{"title":"Blueprint for the Energy Transition | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LmJjZy5jb20vaW5kdXN0cmllcy9lbmVyZ3kvZW5lcmd5LXRyYW5zaXRpb24vYmx1ZXByaW500gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LmJjZy5jb20vaW5kdXN0cmllcy9lbmVyZ3kvZW5lcmd5LXRyYW5zaXRpb24vYmx1ZXByaW500gEA?oc=5","id":"CBMiQWh0dHBzOi8vd3d3LmJjZy5jb20vaW5kdXN0cmllcy9lbmVyZ3kvZW5lcmd5LXRyYW5zaXRpb24vYmx1ZXByaW500gEA","guidislink":false,"published":"Wed, 06 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=249, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LmJjZy5jb20vaW5kdXN0cmllcy9lbmVyZ3kvZW5lcmd5LXRyYW5zaXRpb24vYmx1ZXByaW500gEA?oc=5\" target=\"_blank\">Blueprint for the Energy Transition | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Blueprint for the Energy Transition | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LmJjZy5jb20vaW5kdXN0cmllcy9lbmVyZ3kvZW5lcmd5LXRyYW5zaXRpb24vYmx1ZXByaW500gEA?oc=5\" target=\"_blank\">Blueprint for the Energy Transition | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Low Carbon Technologies\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"So how do we accelerate progress to ensure that we can meet ambitious targets for 2030 and beyond? BCG has studied the energy transition in depth to build a blueprint that outlines ways to scale new low-carbon technologies, the global implications of the shift, and critical actions that policymakers, energy users, infrastructure providers, energy producers, and investors can take to move the needle. Over the coming months, we will publish a series of articles exploring many of these topics in greater detail. A Tectonic Shift Failure to bend the curve dramatically on emissions will have steep costs for the natural world and for the health and livelihoods of people around the globe. Evidence of these impacts becomes clearer every day—and at a concerning pace. We have the tools to get to net zero, but we do not have the policies, proven business cases, and capabilities in place everywhere to massively accelerate the pace of action. All stakeholders, private and public, need to do their part to effectively unlock concrete progress. Energy is a fundamental driver of economic growth and human prosperity. Society must massively accelerate substitution and abatement of fossil fuel use. We have the technological levers to get us to a net zero energy system. Oil and gas must be phased down rapidly, but selective investments will still be necessary. Access full blueprint Energy is a fundamental driver of economic growth and human prosperity. A strong correlation exists between energy access and human prosperity. Nations with “very high human development” (a Human Development Index above 0.8) consume more than 20 MWh of primary energy per capita. Fortunately, we can do more with less energy: over the past three decades, the global energy intensity of GDP has decreased by 34%. Further improvements in energy efficiency are critical, while energy access in developing economies must expand. Society must massively accelerate substitution and abatement of fossil fuel use. Fossil fuels represent 80% of energy use and 70% to 75% of GHG emissions globally; coal alone produces over 25% of global emissions. Renewables must rise from 12% of energy supply in 2021 to 50% to 70% by 2050. Solar and wind generation capacity must increase tenfold, and global electric grids must expand by 2.5x—with similar investment levels in both areas. We must also abate emissions from remaining use of fossil fuels, including methane emissions. We have the technological levers to get us to a net zero energy system. Through 2030, proven technologies such as energy efficiency, electrification of end uses, solar photovoltaics, and wind are mainstays of the transition. In the 2030s, emerging technologies—including grid-scale batteries; new types of nuclear reactors; low-carbon hydrogen and carbon capture, utilization, and storage—will scale, given the right investment and effort. Meanwhile, significant investment in direct air capture is critical in this decade to lower its costs in the decades to come. Longer term, big bets such as fusion could be game changers. Oil and gas must be phased down rapidly, but selective investments will still be necessary. We must swiftly phase out coal. However, most net zero scenarios call for oil and gas supply in 2030 equivalent to 50% to 80% of 2021 supply and 15% to 30% in 2050—particularly for fuel use in hard-to-abate sectors and as feedstock in petrochemicals. Current productive assets will not meet 2030 demand and beyond. We must create conditions that ensure selective investment in the development of the most affordable, least GHG-intensive oil and gas volumes. The Far-Reaching Implications The energy transition is critical to preserving a livable planet. It will also drive major economic change—altering the economics of energy systems and markets and remaking the global competitive landscape. But if we successfully accelerate the transition, we can expand access to electricity and greater prosperity to the 775 million people who don’t have either today—and enable the even larger number of people who use very small amounts of electricity today to increase their usage.","filter_flag":1}
{"title":"Breaking through ingrained beliefs: revisiting the impact of the digital economy on carbon emissions | Humanities and ... - Nature.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk5LTAyMy0wMjEyNi030gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk5LTAyMy0wMjEyNi030gEA?oc=5","id":"CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk5LTAyMy0wMjEyNi030gEA","guidislink":false,"published":"Sat, 23 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=266, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk5LTAyMy0wMjEyNi030gEA?oc=5\" target=\"_blank\">Breaking through ingrained beliefs: revisiting the impact of the digital economy on carbon emissions | Humanities and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nature.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Breaking through ingrained beliefs: revisiting the impact of the digital economy on carbon emissions | Humanities and ... - Nature.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk5LTAyMy0wMjEyNi030gEA?oc=5\" target=\"_blank\">Breaking through ingrained beliefs: revisiting the impact of the digital economy on carbon emissions | Humanities and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nature.com<\/font>","source.href":"https:\/\/www.nature.com","source.title":"Nature.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Low Carbon Technologies\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"The impact of the digital economy on carbon emissions Table 2 presents the estimation results of Eqs. (2)–(4). Regression (1) demonstrates the impact of the digital economy on carbon emissions, with the coefficient of Digital showing significant negative effects at the 1% level, confirming the direct influence of the digital economy on carbon emissions. Table 2 Causal mediation estimation. Full size table All control variables chosen in this study exhibit significance, further affirming the robustness of the model. Notably, the estimated coefficient of Area is positive, indicating that larger administrative areas generally promote carbon emissions. Typically, higher administrative areas correspond to lower population density. Numerous studies have revealed a negative correlation between population density and carbon emissions (Wang et al., 2022), with per capita emissions in low-density regions being 2–2.5 times higher than those in high-density areas (Grazi et al., 2008). Moreover, research has shown that carbon emissions in urban areas with high population density are 23% lower than those in rural areas (Fremstad et al., 2018; Yi et al., 2021). Hence, the findings of this paper align with previous literature. The estimated coefficient of Machine is negative, suggesting that the total power of agricultural machinery can restrain carbon emissions. Some studies indicate that large-scale operators are more inclined to adopt advanced agricultural technology, which, despite increased power consumption, mitigates the negative impact of agricultural practices on the ecological environment (Ren et al., 2019). Moreover, cases demonstrate that the carbon emissions per unit area of large farms utilizing high-power agricultural machinery in Iran are significantly lower than those of small-scale farms (Rakotovao et al., 2017). The estimated coefficient of Popu is positive. It is evident that a larger population corresponds to higher electricity consumption, inevitably leading to increased carbon emissions. Furthermore, the coefficient of “Str” is positive, signifying that value added in the primary industry stimulates carbon emissions. In China, adjusting the industrial structure is one approach to reducing carbon emissions. The primary industry predominantly consists of energy-intensive sectors and constitutes a major contributor to carbon emissions (Zhu et al., 2021). The estimated coefficient of Budget is negative, suggesting that general public budget expenditure can restrain carbon emissions. In most Chinese district and county governments, economic and environmental performance are key assessment criteria. However, in the face of fiscal deficits, officials still prioritize local economic development, and China’s rapid economic growth over the decades has come at the expense of environmental pollution (Zhao and Mattauch, 2022). Governments with more substantial financial budgets are more inclined to invest in environmental development (Li et al., 2017) to fulfill superior-level government environmental assessment requirements, resulting in lower carbon emissions. Lastly, the estimated coefficient of Industry is positive, indicating that the number of large-scale industrial enterprises promotes carbon emissions. Since 2017, the Chinese government has transitioned from a high-speed development model to one focused on high-quality development. This shift is driven by the recognition that pursuing industrial scale without considering industrial quality leads to adverse consequences, including significant environmental pollution issues (Tu et al., 2019). Consequently, one of the Chinese government’s future objectives is gradually phasing out highly polluting, high-emission, and high-output industrial enterprises while introducing high-tech enterprises with advanced technology and low pollution levels (Zhang et al., 2021b). Robustness checks Firstly, the objective of this paper is to validate whether the advancement of a high digital economy corresponds to reduced carbon emissions. In the realm of natural science, it is possible to establish a more dependable control group by creating an experimental environment and discerning causal relationships through comparisons between the experimental and control groups. Adhering to this notion, it is necessary to establish two identical sets of experimental and control groups. The experimental group would possess a high digital economy, while the control group would have a low digital economy. The ensuing changes in carbon emissions between the two groups can then be observed. However, finding perfectly matched control and experimental groups in all aspects proves challenging. Therefore, this paper employs propensity score matching. Specifically, districts and counties characterized by a high digital economy are designated as the experimental group, while those with a low digital economy form the control group. Utilizing the aforementioned control variables, a logit model is employed to assign scores to the two groups. Based on these scores, the experimental and control groups are paired using the K-nearest neighbor caliper radius matching method. In this instance, K is set at 4, and the caliper is set at 0.01. Consequently, the closest individual from the four candidates displaying a score difference of 1% is selected for one-to-four matching. Following the matching process, the experimental and control groups exhibit striking similarity, except for the digital economy variable. Finally, the difference in carbon emissions between the treatment and control groups is calculated, providing evidence that the high digital economy group demonstrates lower carbon emission levels. Second, based on the previous discussion, this study unifies the satellite image scales of the DMSP\/OLS and NPP\/VIIRS from 1997 to 2017 and calculates the carbon sequestration (CO2seq) of terrestrial vegetation in 2735 counties in China. This variable is used to replace the previous CO2 variable for regression. Third, this paper draws on the county-level Digital Financial Inclusion Index (Dfiic) issued by the Digital Finance Center of Peking University, China. In the data, there were 1754 counties in 2014, 1754 counties in 2015, 2791 counties in 2016, 2786 counties in 2017, 2802 counties in 2018, 2848 counties in 2019, and 2850 counties in 2020. Digital financial inclusion is calculated based on 33 indicators. We use this index to replace the digital economy level in the regression model. In summary, the results are shown in Table 3, and the coefficients of the core explanatory variables are still significantly negative at the 1% level. Thus, the conclusions above are robust. Table 3 Robustness tests. Full size table Endogeneity test Endogeneity poses a crucial concern that warrants attention in this paper. While carbon dioxide, as an energy source, may not directly impact other economic behaviors, carbon emissions are frequently associated with regional economic activities. A higher carbon emission intensity signifies a greater level of economic development, which subsequently influences the adoption of the digital economy. Conversely, higher carbon emission intensity also signifies a more advanced state of the manufacturing industry, and the remarkable enhancements in manufacturing productivity are intertwined with the rapid progress of the digital economy. Simultaneously, the digital economy and the advancement of manufacturing industry technology are intricately linked. A causal endogenous relationship exists between the digital economy and manufacturing industry productivity. To address the endogeneity issue in the carbon emissions and digital economy relationship, we employ the instrumental variable method. Considering the historical development of China’s digital economy, its origins can be traced back to the establishment of fixed telephone lines. Regions with a high level of digital economy may also exhibit high penetration rates of fixed telephone lines. Furthermore, prior to the widespread adoption of fixed telephone lines, information exchange primarily relied on the postal system, which was responsible for setting up fixed telephone lines. The distribution of post offices directly influenced the deployment of fixed telephone lines during the early stages. Regions with a greater number of post offices and fixed telephone lines often possess a more favorable foundation for digital economy development. A direct positive correlation exists between these factors and the digital economy, while their connection with carbon emissions is not significant. Therefore, the two prerequisites for instrumental variables are met. Accordingly, this paper selects the number of fixed telephone lines per 100 people and the number of post offices per million people in 1984 as instrumental variables. However, considering that the use of one-year data as an instrumental variable will cause problems such that it will be difficult for the fixed effect model to carry out measurements, the number of fixed telephone lines per 100 people (Fixtele) and the number of post offices per million people (Post) in 1984 are multiplied by the number of Internet users per year as the instrumental variables of the digital economy. Regressions (1)–(4) of Table 4 report the regression results after using the two instrumental variables. In regression (1) and regression (3), the first-stage estimation results show that the coefficients of the instrumental variables are all significantly positive at the 1% level, which satisfies one of the preconditions for the instrumental variables, that is, being related to the digital economy. In regression (2) and regression (4), the second-stage estimation results show that the regression coefficient of the digital economy is still significantly negative at a level of at least 1%. Therefore, after excluding the endogeneity problem, the conclusions above are still valid. Table 4 Endogeneity test. Full size table Test of the mediating effect In elucidating the operative mechanisms linking the digital economy with carbon emissions, an initial step involves estimating a causal mediation model. This research employs a quasi-Bayesian approach to approximate parameter uncertainty, with the count of simulation iterations set at 1000. The computational results derived from this model are presented in Eqs. (3) and (4). The results from Regressions (2)–(3) presented in Table 2 delineate the influence exerted by the digital economy on low-carbon technology innovation and industrial diversification. The coefficient estimates for Digital pertaining to both Li and Div exhibit significant positivity at a level of a minimum 1%, substantiating the hypothesis that the digital economy effectively augments all three mediating variables. Results from Regressions (4)–(5) encapsulate the outcomes following the incorporation of the digital economy and the two mediating variables. It is noteworthy that in these regressions, the coefficients for Digital, Li, and Div continue to display significant negativity at the 1% level, inferring that a larger mediating variable corresponds to a reduction in carbon emissions. The outcomes of the causal mediation model provide valuable insights into the potential channels through which the digital economy influences carbon emissions, a topic which is delved into further in subsequent sections of this paper. Moreover, this study calculates the ACME, ADE, and Average Treatment Effects (ATE) by employing the coefficient product of the causal mediation model. The tabulated results are displayed in Table 5. For columns (1)–(2), the outcome variables are CO2, and the mediating variables comprise Li and Div. The ACME of the digital economy’s effect on carbon emissions via low-carbon technology innovation stands at −0.007, and its corresponding 95% confidence interval surpasses 0, attesting to the presence of a mediation effect. The ADE and ATE are −0.938 and −0.945, respectively, with confidence intervals exceeding 0, thus establishing that the proportion of the mediation effect is 0.031. In a similar vein, the other two mediation effects are confirmed, respectively, thereby underscoring the significance of the two mediation pathways. Table 5 ACME and ADE. Full size table Test of the digital economy paradox While research has demonstrated the potential of the digital economy to reduce carbon emissions, an intriguing phenomenon persists—a conundrum we shall refer to as the “Digital Economy Paradox.” Curiously, regions characterized by elevated levels of digital economic prowess often exhibit concurrent high levels of carbon emissions. This paradox challenges the anticipated carbon mitigation benefits of robust digital economic development. In pursuit of empirical validation, the designed variable—digital industrialization—will be scrutinized to determine if its presence accentuates or attenuates the inhibitory effect of the digital economy on carbon emissions. Such analysis holds the potential to unravel the intricate dynamics underpinning the observed “Digital Economy Paradox,” providing a more nuanced understanding of how digital industrialization may potentially counteract the carbon mitigation intent embedded within the digital economy. This paper employs the summation of software business revenue and industrial value-added to gauge the magnitude of digital industrialization and introduces the variable (Din). When the magnitude exceeds the mean, Din is assigned a value of 1; conversely, it takes on a value of 0. Table 6 presents the results of the moderation effect analysis. In this table, Din_Digital signifies the interaction term between digital industrialization and the digital economy. It is discernible that the coefficient estimate for Digital remains significantly negative. However, the coefficient estimate for the interaction term is significantly positive. This finding suggests that digital industrialization exerts a dampening effect on the carbon mitigation capacity of the digital economy. Specifically, when the prevalence of digital industrialization is higher, the inhibitory effect of the digital economy on carbon emissions diminishes. This signifies that such an effect is obscured or mitigated by the pronounced prominence of digital industrialization within the digital economic landscape.","filter_flag":1}
{"title":"Innovative small businesses need a bigger role at COPs - Environmental Finance","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmVudmlyb25tZW50YWwtZmluYW5jZS5jb20vY29udGVudC9hbmFseXNpcy9pbm5vdmF0aXZlLXNtYWxsLWJ1c2luZXNzZXMtbmVlZC1hLWJpZ2dlci1yb2xlLWF0LWNvcHMuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmVudmlyb25tZW50YWwtZmluYW5jZS5jb20vY29udGVudC9hbmFseXNpcy9pbm5vdmF0aXZlLXNtYWxsLWJ1c2luZXNzZXMtbmVlZC1hLWJpZ2dlci1yb2xlLWF0LWNvcHMuaHRtbNIBAA?oc=5","id":"CBMicmh0dHBzOi8vd3d3LmVudmlyb25tZW50YWwtZmluYW5jZS5jb20vY29udGVudC9hbmFseXNpcy9pbm5vdmF0aXZlLXNtYWxsLWJ1c2luZXNzZXMtbmVlZC1hLWJpZ2dlci1yb2xlLWF0LWNvcHMuaHRtbNIBAA","guidislink":false,"published":"Thu, 28 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=271, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmVudmlyb25tZW50YWwtZmluYW5jZS5jb20vY29udGVudC9hbmFseXNpcy9pbm5vdmF0aXZlLXNtYWxsLWJ1c2luZXNzZXMtbmVlZC1hLWJpZ2dlci1yb2xlLWF0LWNvcHMuaHRtbNIBAA?oc=5\" target=\"_blank\">Innovative small businesses need a bigger role at COPs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Environmental Finance<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Innovative small businesses need a bigger role at COPs - Environmental Finance","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmVudmlyb25tZW50YWwtZmluYW5jZS5jb20vY29udGVudC9hbmFseXNpcy9pbm5vdmF0aXZlLXNtYWxsLWJ1c2luZXNzZXMtbmVlZC1hLWJpZ2dlci1yb2xlLWF0LWNvcHMuaHRtbNIBAA?oc=5\" target=\"_blank\">Innovative small businesses need a bigger role at COPs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Environmental Finance<\/font>","source.href":"https:\/\/www.environmental-finance.com","source.title":"Environmental Finance","query":"https:\/\/news.google.com\/rss\/search?q=\"Low Carbon Technologies\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"The COP process needs to listen to the voices of innovative small businesses if net zero is to be delivered, Jan Lozek writes COP28 will bring together the world's leading climate change scientists, political leaders and activists to agree how we accelerate our efforts to reach net zero and save the planet. Joining them will be big business, lobbyists and some intrepid members of the public. Yet a critical voice is missing from the COP climate conference: the voice of smaller, innovative business, which have no official platform at COP and little chance of affording the significant costs involved with attending COP. Why does this matter? Because smaller businesses are the lifeblood of the energy transition and are crucial in ensuring an accelerated change through fresh ideas and innovation, their ability to bring new ideas to market fast, a focus on practical solutions and the ability to make a difference and help us actually reach net zero. With stands at COP28 costing up to $6.5 million it is a pity that some of this money couldn't be directed into an early-stage fund to help innovative start-ups that are focused on the net zero transition \/ climate mitigation to scale their ideas and business. Were they able to do that it could have a far more positive impact in addressing climate change than fleets of expensive stands generating large amounts of hot air. As an example, the €250 million that we have invested, at Future Energy Ventures, into start-up and scale-up businesses that are pioneering new solutions in climate tech and the energy transition have a saving potential of 11 gigatonnes of emissions by 2050, equivalent to the global emissions from the transportation sector in 2021. A similar amount of money invested in helping scale other climate-solution focused businesses around the world would have a huge impact, arguably far greater than the money-making machine that the COP green-zone and fringe conferences have become, regardless of the critical work done within COP's diplomatic Blue Zone. When it comes to how we introduce low-carbon technologies and new energy systems, the technology to deliver net zero already exists, the challenge is how we deliver that at scale in order to reduce carbon emissions and provide a foundation for a sustainable, low-carbon future. Achieving that requires finance that is structured to invest in scale-up solutions by recognising the unique needs of these businesses such as for easily accessible, long-term, sustainable funding. Scale-up companies don't just need money, they also need connections to other like-minded organisations so they can collaborate and work on bigger solutions, they need mentoring and they need access to end-user markets that will utilise their technology. The extreme weather we have seen around the globe this year shows why we cannot afford to wait for solutions from UN conferences like COP which, despite best intentions, reflect geopolitical tensions and diplomatic challenges of the day. It would be hugely optimistic to expect that we will see countries like the US, China, Russia and the EU agreeing with one another and collaborating in the common good at COP28. We may get breakthroughs on the sidelines but high-impact change and political frameworks that are enacted globally is likely to be a long-term process that may not be achieved this year. Yet as this summer's weather patterns have shown, delays in finding solutions makes the need for them all the more urgent. Unilateral action by governments has so far proven more effective; the US's Inflation Reduction Act has shown what can be achieved with bold policies, and the knock-on effect this has had on other countries – for example with the EU working on the Net Zero Industry Act. Unfortunately, these policies are also subject to change from new political regimes, so it is critical to take the opportunity that these regulatory frameworks provide and use them to accelerate private capital into business solutions that deliver technological change that does not rely on fiscal support. That is why COP needs to find ways to include and stimulate the start-up and scale-up economy. If we are to deliver net zero we need 'whole-economy' action and a vibrant SME economy that gets the seed and scale up finance that it needs and the ongoing support to translate that investment into successful climate-positive businesses. Unfortunately, there is no silver bullet to climate change and it takes time to make an impact. Yet, when we look at use cases for success there are many. The European photovoltaic (PV) and wind sector was, just a decade ago, seen as an area for cranks and ideological hippies. Now it is the cheapest form of energy available on the Continent and countries like the UK are seeing up to 50% of their energy needs provided by renewables. That's a huge impact achieved over a relatively short period, driven by targeted finance and subsidies working together to transform an energy system. Scale-up climate focused businesses like Northvolt or Neoen are now global 'unicorns', repaying their investors and also creating a framework for greater growth. And despite the challenging fundraising and investment environment, investments into early-stage climate tech is holding up well. According to HolonIQ, there are already 83 climate tech unicorns and that number will surely grow exponentially through the rest of the decade. Yet we need more bolder thinking and fresh ideas. Covid-19 taught us how much can be achieved by science, technology and governments working together to focus on a single problem. Open-sourcing technology and encouraging collaboration can achieve significant results where there is also energy and ideas. The climate crisis dwarfs Covid as a challenge that needs collaborative thinking and action and we need to accelerate what we are doing now before it is too late. Much of the bold thinking and fresh ideas that I see are pioneered by smaller, scale up businesses that are set up to 'move fast and break things'. Customers also need to buy this technology and take it seriously and changing consumers' minds starts with building trusted businesses in communities that supply the revolutionary technology and new products that we need in a decarbonised society. Global events like COP28 are hugely valuable for holding countries accountable for their net zero journey and actions. But real change doesn't come from international conferences, it comes from what happens afterwards in individual economies and communities. For much of the world, business is a collection of smaller organisations collaborating together. Failing to consider the needs, voices and impact of the SME and scale-up economy at events like COP is a huge, wasted opportunity. Rather than generating vast amounts of money from multinationals who have the resources to attend COP, and in some cases also have an agenda to dilute or delay the net zero transition, we should look at what more we can do to support scaling up the technology and businesses that exist to create a sustainable future. Only then will we generate a truly net zero economy. Jan Lozek is managing partner at and co-founder of Future Energy Ventures.","filter_flag":1}
{"title":"New environmental data report confirms step change in cruise industry uptake of new environmental technologies - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMipgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1lbnZpcm9ubWVudGFsLWRhdGEtcmVwb3J0LWNvbmZpcm1zLXN0ZXAtY2hhbmdlLWluLWNydWlzZS1pbmR1c3RyeS11cHRha2Utb2YtbmV3LWVudmlyb25tZW50YWwtdGVjaG5vbG9naWVzLTMwMTkxODQzNS5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMipgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1lbnZpcm9ubWVudGFsLWRhdGEtcmVwb3J0LWNvbmZpcm1zLXN0ZXAtY2hhbmdlLWluLWNydWlzZS1pbmR1c3RyeS11cHRha2Utb2YtbmV3LWVudmlyb25tZW50YWwtdGVjaG5vbG9naWVzLTMwMTkxODQzNS5odG1s0gEA?oc=5","id":"CBMipgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1lbnZpcm9ubWVudGFsLWRhdGEtcmVwb3J0LWNvbmZpcm1zLXN0ZXAtY2hhbmdlLWluLWNydWlzZS1pbmR1c3RyeS11cHRha2Utb2YtbmV3LWVudmlyb25tZW50YWwtdGVjaG5vbG9naWVzLTMwMTkxODQzNS5odG1s0gEA","guidislink":false,"published":"Tue, 05 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=248, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMipgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1lbnZpcm9ubWVudGFsLWRhdGEtcmVwb3J0LWNvbmZpcm1zLXN0ZXAtY2hhbmdlLWluLWNydWlzZS1pbmR1c3RyeS11cHRha2Utb2YtbmV3LWVudmlyb25tZW50YWwtdGVjaG5vbG9naWVzLTMwMTkxODQzNS5odG1s0gEA?oc=5\" target=\"_blank\">New environmental data report confirms step change in cruise industry uptake of new environmental technologies<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New environmental data report confirms step change in cruise industry uptake of new environmental technologies - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMipgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1lbnZpcm9ubWVudGFsLWRhdGEtcmVwb3J0LWNvbmZpcm1zLXN0ZXAtY2hhbmdlLWluLWNydWlzZS1pbmR1c3RyeS11cHRha2Utb2YtbmV3LWVudmlyb25tZW50YWwtdGVjaG5vbG9naWVzLTMwMTkxODQzNS5odG1s0gEA?oc=5\" target=\"_blank\">New environmental data report confirms step change in cruise industry uptake of new environmental technologies<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Low Carbon Technologies\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"2023 data from Cruise Lines International Association shows investment in technologies and alternative fuels that will accelerate the maritime transition towards net zero WASHINGTON, Sept. 5, 2023 \/PRNewswire\/ -- Cruise Lines International Association (CLIA), the leading voice of the global cruise industry, today released its 2023 Global Cruise Industry Environmental Technologies and Practices Report, showing concrete progress by the sector in advancing its environmental and sustainability agenda. The 2023 order book data shows that cruise lines continue investment in new vessels with 44 new ships on order during the next five years, representing an investment of $62 billion since 2019. Of these new ships, 25 will be LNG- powered and seven will be either methanol ready on delivery, or methanol capable, representing an investment in new engine technologies that will accelerate the maritime transition towards a future of low to zero carbon fuels. Examples of progress cited include the number of alternative fuels pilot programs and trials currently in place with cruise ships. In addition, an increasing number of vessels sailing and launching over the next five years will either use alternative fuels or will be able to incorporate zero carbon fuels when they become available. The 2023 report also demonstrates other significant investments cruise lines are making to reduce emissions at berth and at sea, such as shoreside electricity, which allows cruise ships to switch off engines for significant emissions reduction while in port. More cruise lines are diversifying energy solutions by incorporating multi-fuel engines, trialing fuel cell technology, wind (including solid sail) technology, as well as photovoltaic solutions and battery storage for power shaving. Efficiency tracking systems are now in use on 171 CLIA-member ships, representing 60% of the global fleet, with many more systems planned. In addition, cruise lines are pursuing fuel flexibility, investing today in propulsion technologies with conversion capabilities for the future—with 32 pilot projects and collaborative initiatives underway with sustainable fuel producers and engine companies. President, and CEO, CLIA, Kelly Craighead said: \"Cruise lines continue to transform the modern fleet to protect the oceans, air and destinations enjoyed by millions of passengers each year. Our data shows a step change in the uptake of new environmental technologies by our cruise line members. Already today cruise lines are building the ships of the future which will run on new, more sustainable engine technologies. The introduction of these new technologies and the many pilot programs and trials in place reveal how the cruise industry is an innovator and early adopter of technologies that are helping us sail to a more sustainable future.\" The availability of sustainable marine fuels remains essential to achieving the maritime industry's decarbonisation goals and underscores the need for governments to support research efforts to accelerate development of these fuels so that they are safe, viable and available for use. Chairman of CLIA Pierfrancesco Vago said: \"Achieving our collective sustainability ambitions requires substantial investment from the public and private sector. The cruise industry, as part of the broader maritime sector, is doing its part by building the future of cruise into our ships today. We need governments to support research efforts, as well as provide a clear and stable regulatory landscape, so that fuel suppliers and others can do the critical work needed.\" The data shows that CLIA ocean-going cruise lines continue their work to reduce emissions. Highlights of progress include: Shoreside Electricity (SSE) Capability – Plugging into shoreside electricity allows ship engines to be switched off, reducing emissions by up to 98%, depending on the mix of energy sources, while a ship is in port, according to studies conducted by a number of the world's ports and the U.S. Environmental Protection Agency. Across the CLIA cruise-line member fleet, 120 ships (46% of the total and a 48% increase in the number of ships with SSE since 2022) are equipped to connect to shoreside electricity, with 86% of CLIA member ships (representing 95% of global passenger capacity) coming online between now and 2028 specified for shoreside electricity system. Currently 32 ports (compared to 29 ports in 2022), representing fewer than 2% of the world's ports, have at least one cruise berth with plug-in capability. By 2028, more than 210 ships with shoreside power capability are expected, plus additional ships to be retrofitted with the capability, representing a total of 72% of ships and 74% of global passenger capacity. In 2022, CLIA has announced that its ocean cruise line members have made a commitment that all ships calling at ports capable of providing shoreside power will be equipped to either use SSE by 2035 or be able to use alternative low-carbon technologies, as available, to reduce emissions in port. As part of the EU's Fit for 55 green program, by 2030, major ports in Europe will be required to have shoreside power, which will further accelerate the available port infrastructure investment in that region. Advanced Wastewater Treatment Systems – As part of their overarching sustainability focus, cruise lines have committed to not discharging untreated sewage anywhere in the world, during normal operations. Across the CLIA cruise-line member fleet, 202 ships (77% of the total), representing 80% of global passenger capacity (a 12% increase from 2022) are equipped with advanced wastewater treatment systems. These systems operate to a higher standard than shoreside treatment plants in many coastal cities. All CLIA-member cruise line new-build ships are specified for advanced wastewater treatment systems— which will bring the total to 242 ships, representing 80% of the fleet and 84% of global capacity. In addition, since 2019, the number of ships with advanced wastewater treatment systems capable of meeting the more stringent standards of the Baltic Sea Special Area has increased 167%. Today, nearly one- third of CLIA member ships have this capability. Renewable fuels and alternative energy sources – Various CLIA member lines are trialing, using, and incorporating into new-build ships the capability to run on renewable fuels, including biofuels and synthetic carbon fuels. Within the CLIA member fleet, four ships sailing today use renewable biofuel as an energy source—and an additional four new-build ships are expected to be configured for renewable biofuels. In addition, 24 ships have biofuel trials and two have synthetic carbon fuels trials. Seven new-build ships are anticipated to run on zero carbon fuels, including five ships envisioned to use green methanol and two envisioned to use green hydrogen. 15% of new-build cruise ships entering service in the next five years are anticipated to be equipped with battery storage and\/or fuel cells to allow for hybrid power generation. Liquified Natural Gas (LNG) Fuel – As the cruise industry anticipates the transition to a future of sustainable, renewable fuels, several cruise ships are utilizing liquified natural gas (LNG). Ships designed with LNG engines and fuel supply systems are able to switch to bio or synthetic LNG in the future, with little or no modifications. The 2023 report found 48% of new-build capacity will be designed with LNG engines and fuel supply systems. These ships are part of a future generation of vessels that will be capable of running on renewable marine fuels once fuel providers are able to make them available at scale. Based on analyses by SeaLNG and others, LNG is currently the fossil fuel available at scale that has the best performance in reducing atmospheric emissions. LNG has virtually zero sulfur emissions and particulate emissions, reduces NOx emissions by approximately 85%, and achieves up to a 20% reduction in greenhouse gas emissions. Notes to Editors: The data tables for this year's report can be found at this LINK. *Sustainable, renewable marine fuels can include biofuels, synthetic carbon fuels, and other advanced approaches including zero carbon fuels, such as green methanol and green hydrogen. For more information, please visit cruising.org\/environment-sustainability . About the Cruise Lines International Association (CLIA) CLIA is the world's largest cruise industry trade association, providing a unified voice for the industry as the leading authority of the global cruise community. On behalf of its members, affiliates and partners, the organization supports policies and practices that foster a secure, healthy, and sustainable cruise ship environment, promoting positive travel experiences for millions of travelers who cruise annually. This year, CLIA forecasts that annual the number of passengers will reach 31.5 million passengers—surpassing 2019 levels. The CLIA community includes the world's most prestigious ocean, river, and specialty cruise lines; a widespread network of stakeholders, including ports and destinations, ship development, suppliers, and business services; and a highly trained and certified travel agent members that represent the largest network of travel professionals specializing in cruise travel. The organization's global headquarters are in Washington, DC, with regional offices located in North and South America, Europe, and Australasia. For more information, please visit cruising.org or follow us on Facebook, Instagram, Twitter, and YouTube with our handle @CLIAGlobal—or on LinkedIn. SOURCE Cruise Lines International Association","filter_flag":1}
{"title":"Five Strategies for Optimizing Power-to-X Projects - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvZml2ZS1zdHJhdGVnaWVzLWZvci1vcHRpbWl6aW5nLXB0eC1wcm9qZWN0c9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvZml2ZS1zdHJhdGVnaWVzLWZvci1vcHRpbWl6aW5nLXB0eC1wcm9qZWN0c9IBAA?oc=5","id":"CBMiUWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvZml2ZS1zdHJhdGVnaWVzLWZvci1vcHRpbWl6aW5nLXB0eC1wcm9qZWN0c9IBAA","guidislink":false,"published":"Thu, 28 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=271, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvZml2ZS1zdHJhdGVnaWVzLWZvci1vcHRpbWl6aW5nLXB0eC1wcm9qZWN0c9IBAA?oc=5\" target=\"_blank\">Five Strategies for Optimizing Power-to-X Projects<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Five Strategies for Optimizing Power-to-X Projects - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvZml2ZS1zdHJhdGVnaWVzLWZvci1vcHRpbWl6aW5nLXB0eC1wcm9qZWN0c9IBAA?oc=5\" target=\"_blank\">Five Strategies for Optimizing Power-to-X Projects<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Low Carbon Technologies\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Society can ill afford the risks associated with protracted timelines for implementing low-carbon technologies. These delays might culminate in a logjam of new capacity that does not enter the market until after 2030, stalling the development of critical technology and pushing back the arrival of the hydrogen economy by several decades. Clearly, companies that learn how to expedite their projects will secure a considerable advantage. There is an additional benefit: ecosystems develop around the first projects to reach the market, fostering a sustained advantage. This situation poses a fundamental question for industry participants: How do players successfully navigate these projects without putting billions of dollars at risk? A New Approach in Five Dimensions Our new paradigm for large-capital PtX projects addresses the underlying drivers of poor performance to help companies dramatically streamline project development, reduce time-to-market, and significantly increase project value. This innovative approach ensures that the design solution is not only more robust but also empowers the project team to respond to changes quickly and effectively. 1. Reimagine decision-making processes and use new reference metrics. The standard stage-gate process for project development works well for established markets and technologies. For innovative projects such as PtX, however, such processes are too linear and siloed, while the metrics neither support the required analyses nor enable effective decision making. Standard processes also do not support test-and-trial approaches. As a result, teams often develop a hypothesis for the solution under consideration (for example, the project configuration) and refine it based on standard requirements, only to discover that the solution is not viable. Instead, teams should rapidly generate multiple competing ideas (such as for the plant’s storage and operating concepts), test them quickly by leveraging advanced analytics tools and generative AI, and then integrate the insights and iterate. This process can become even more efficient if the supply chain is engaged early—something easier said than done given the cumbersome procurement processes in most companies. In addition, companies need to change the metrics they use for decision making in stage-gate processes. Metrics such as levelized cost of energy (LCOE) or levelized cost of ammonia (LCOA) are more straightforward and insightful during front-end development than the internal rate of return (IRR) or hurdle rates. Indeed, LCOx metrics allow project teams to estimate at the prefeasibility stage whether a project will be viable and globally competitive. They can also be used in benchmarking efforts to identify levers for project optimization. Companies need to change the metrics they use for decision making in stage-gate processes. Organizations need to agree on the methodology and assumptions for calculating LCOx in order to ensure that the metric is comparable to other benchmarks. For example, they must agree on how to account for the intermittency of energy production, whether to use standard definitions (such as those established by the UK’s Department for Business, Energy & Industrial Strategy), and whether to make estimates in nominal or real terms. Beyond LCOx, metrics such as the expected value of perfect information (EVPI) provide deeper insights than classic sensitivity analyses. Moreover, quantitative and probabilistic risk models are far better than standard risk matrices. Indeed, risk matrices offer little value when the key risks are poorly understood, and teams are prone to an availability bias. At worst, risk matrices can divert an organization’s focus to incorrect risks, resulting in delays, heightened risks, and missed opportunities. A frequently observed pain point is preparing the documentation required to pass through a stage gate. Project managers should view the issues from the gatekeeper’s perspective. By solely addressing the gatekeeper’s most pressing questions, managers can significantly streamline the required deliverables. In short, the objective should shift from seeking certainty to determining where diminished uncertainty is sufficient for advancing to subsequent phases. (See “Rethinking Stage-Gate Processes.”) Rethinking Stage-Gate Processes Based on our experience, the issue with most stage-gate processes is not poor design, but rather their unintended encouragement of counterproductive behaviors. Simply put, the stage-gate process can foster a tick-the-box mentality, whereby project teams often prioritize tasks required to advance to the next phase. While this might seem harmless, it can lead to detrimental practices, such as emphasizing task completion over addressing critical questions or placing undue reliance on inappropriate metrics. Consider cost estimates. Many teams excel at creating detailed cost projections in the initial stages. The stage process might require a Class 5 estimate, which means it could be as much as 50% below or 100% above the actual costs. Although teams often strive for greater precision in the estimate, they neglect developing other options or fail to fully understand the range of uncertainty. Consequently, they might prove that a solution is prohibitively expensive rather than identifying viable alternatives. They also might assume that their cost estimate is fairly precise while overlooking the risk that the actual costs could be twice as high. “ Once uncertainty is sufficiently reduced, the developer can decide whether the project should be implemented. In nascent industries, such as PtX, this is especially relevant. In contrast to oil and gas projects, where options are well-defined with limited alternatives (for example, the cost of a subsea tie-back), PtX teams grapple with a vast array of choices. This includes decisions about project size, technology selection, grid connectivity, product off-takes, optimal timelines, and engagement with the broader ecosystem, to name a few. A similar concern arises with metrics. For instance, a finance team might ask if a project achieves a specific IRR or meets a hurdle rate. However, the uncertainty surrounding PtX projects transforms IRR into a probability distribution, prompting the question: Which IRR—the median, mode, or average? In addition, a company needs to decide which metrics will ultimately guide its decision to proceed. A more useful metric might be the economic value of perfect information, which assesses the value of gaining further insights about the project. Once uncertainty is sufficiently reduced, the developer can decide whether the project should either be stopped or implemented. Even if the average IRR falls short of company benchmarks, proceeding might still be justifiable if high uncertainty is offset by the substantial strategic advantage of early market entry—a scenario that is almost always the case in PtX projects. 2. Develop new skills for high-performance teams and organizations. Companies aiming to develop PtX projects need a new approach to structuring project teams, as well as new work models that promote creativity and speed. PtX requires specific, dynamic capabilities to enable rapid and effective responses to unexpected events and to handle the complexity associated with such projects. These include capabilities to quickly test-and-trial ideas, balance innovative thinking and decisive action, and develop specific solutions. To gain these capabilities, companies must not only build competencies but also establish a new organizational context to drive the right behaviors within project teams. They must find individuals who possess strong capabilities across the different areas of expertise needed for a PtX project (for example, renewables and process plants) and can perform well amid high levels of ambiguity and uncertainty. Only a handful of companies currently have people with the required capabilities in their organization. The others are increasingly concerned about finding the necessary talent. In many cases, they will need to reskill their onsite workers. Here are three actions that can promote high performance: Seek both technical expertise and soft skills. Too often, we see companies default to their existing teams instead of actively reskilling their workforce and seeking more suitable talent. Possessing the right skills, capabilities, knowledge, and experience to handle the uncertainty and ambiguity of PtX projects may require external hiring. For example, developers need technical expertise in electrolysis, ammonia, or downstream solutions as well as in real estate development and project management systems. Moreover, given the unique demands of PtX projects, hiring decisions should consider not only technical capabilities but also innate problem-solving abilities and other soft skills. Too often, we see companies default to their existing teams instead of actively reskilling their workforce and seeking more suitable talent. Possessing the right skills, capabilities, knowledge, and experience to handle the uncertainty and ambiguity of PtX projects may require external hiring. For example, developers need technical expertise in electrolysis, ammonia, or downstream solutions as well as in real estate development and project management systems. Moreover, given the unique demands of PtX projects, hiring decisions should consider not only technical capabilities but also innate problem-solving abilities and other soft skills. Build a cohesive team, not a collection of star players. It is unlikely that every individual, including those in leadership roles, embodies all the essential traits needed to create a well-rounded team. Companies need to consider whether the project sponsor, senior leadership, and operational team possess the capabilities needed to navigate a project’s uncertainties. (Assembling an Olympic national team provides a fitting analogy: A country aiming for the top spot on the Olympic medal chart cannot rely solely on a few exceptional athletes, regardless of their individual medal hauls. To surpass competitors, an Olympic delegation requires a varied assortment of teams spanning different sports and a diverse array of athletes within each sport.) Once a cohesive team is in place, leaders must ensure that members focus on developing optimal solutions rather than getting bogged down by a misguided emphasis on precision. It is unlikely that every individual, including those in leadership roles, embodies all the essential traits needed to create a well-rounded team. Companies need to consider whether the project sponsor, senior leadership, and operational team possess the capabilities needed to navigate a project’s uncertainties. (Assembling an Olympic national team provides a fitting analogy: A country aiming for the top spot on the Olympic medal chart cannot rely solely on a few exceptional athletes, regardless of their individual medal hauls. To surpass competitors, an Olympic delegation requires a varied assortment of teams spanning different sports and a diverse array of athletes within each sport.) Once a cohesive team is in place, leaders must ensure that members focus on developing optimal solutions rather than getting bogged down by a misguided emphasis on precision. Assess how well your processes encourage innovation. Rigid adherence to outdated processes and benchmarks is a near-certain recipe for failure. A recent BCG survey on the performance of large capital projects found that strict adherence to benchmarks was the variable most strongly correlated with subpar project outcomes. We often see companies strictly adhering to processes that, while ensuring compliance with internal policies, yield suboptimal solutions. A laser focus on compliance does not equate to excellence or innovation. Although a current process might suffice in proven scenarios, it could be a surefire path to failure in an environment of heightened uncertainty. Outdated processes KPIs or improperly designed organizational structures can foster detrimental behaviors, culminating in poor performance. To ensure innovation, companies need to structurally embed the practice. For example, one client scheduled brainstorming sessions to allow teams to focus on innovative thinking and then rapidly specify a set of ideas to be refined further. The additional solutions promoted an approximate 20% reduction in the effective LCOA for a PtX plant. 3. Utilize probabilistic models and AI-driven optimization. Although standard deterministic models are valuable for building a basic understanding of what promotes project success, they fall short in areas with high uncertainty. Project teams that focus on specific numbers when making estimates or setting targets often spend more time debating assumptions than discerning potential outcomes. The precise development trajectory of PtX markets or technologies is neither clear-cut nor reducible to a handful of discrete scenarios. Even so, very few companies use probabilistic modeling for decision making. Most continue to rely on simplistic risk models, which are effective only in well-understood circumstances. For example, PtX projects face considerable uncertainty relating to the electrolyzer’s performance and cost and the final product's price. Instead of speculating on a single scenario for performance, cost, and price, developers can model these factors using probabilistic distributions, allowing the mathematics to produce unbiased outputs. To evaluate the scenarios they use, companies can consider the following question: Are the scenarios merely a set of assumptions and discrete points, or do they form an integrated model that accounts for a broad spectrum of uncertainty and interdependencies? Rapid advances in analytic techniques and AI have vastly simplified the development of the required estimation models and enhanced their capabilities, allowing companies to execute a significantly higher number of simulations in less time. Such models markedly improve the project team's capacity to evaluate and navigate risks associated with internal economic drivers, external economic incentives, market trends, and schedules. Probabilistic models markedly improve the ability to evaluate risks associated with internal economic drivers, external economic incentives, market trends, and schedules. By implementing such models, companies can turn uncertainty and risk to their advantage. In addition, jointly optimizing technical and economic variables can reduce capex while enhancing value through better allocation of expenditures and a proper tradeoff between mitigating risks and maximizing returns.","filter_flag":1}
{"title":"British Gas releases second UK net zero homes index - Centrica","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmNlbnRyaWNhLmNvbS9tZWRpYS1jZW50cmUvbmV3cy8yMDIzL2JyaXRpc2gtZ2FzLXJlbGVhc2VzLXNlY29uZC11ay1uZXQtemVyby1ob21lcy1pbmRleC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmNlbnRyaWNhLmNvbS9tZWRpYS1jZW50cmUvbmV3cy8yMDIzL2JyaXRpc2gtZ2FzLXJlbGVhc2VzLXNlY29uZC11ay1uZXQtemVyby1ob21lcy1pbmRleC_SAQA?oc=5","id":"CBMiZGh0dHBzOi8vd3d3LmNlbnRyaWNhLmNvbS9tZWRpYS1jZW50cmUvbmV3cy8yMDIzL2JyaXRpc2gtZ2FzLXJlbGVhc2VzLXNlY29uZC11ay1uZXQtemVyby1ob21lcy1pbmRleC_SAQA","guidislink":false,"published":"Thu, 21 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=264, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmNlbnRyaWNhLmNvbS9tZWRpYS1jZW50cmUvbmV3cy8yMDIzL2JyaXRpc2gtZ2FzLXJlbGVhc2VzLXNlY29uZC11ay1uZXQtemVyby1ob21lcy1pbmRleC_SAQA?oc=5\" target=\"_blank\">British Gas releases second UK net zero homes index<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Centrica<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"British Gas releases second UK net zero homes index - Centrica","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmNlbnRyaWNhLmNvbS9tZWRpYS1jZW50cmUvbmV3cy8yMDIzL2JyaXRpc2gtZ2FzLXJlbGVhc2VzLXNlY29uZC11ay1uZXQtemVyby1ob21lcy1pbmRleC_SAQA?oc=5\" target=\"_blank\">British Gas releases second UK net zero homes index<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Centrica<\/font>","source.href":"https:\/\/www.centrica.com","source.title":"Centrica","query":"https:\/\/news.google.com\/rss\/search?q=\"Low Carbon Technologies\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"More than three quarters (78%) are willing to make changes in the home to achieve Net Zero Climate change is now seen as the fifth most important issue facing the country For Summer 2023 the British Gas Net Zero Homes Index, which measures confidence in Net Zero being achieved, drops slightly from 57.5 to 56.5 Over the next two years, almost half (47%) of homeowners said they were willing to install improved insulation to tackle climate change with 28% willing to install a heat pump One in three (30%) parents say their child knows more about climate change than they do British Gas is training its workforce to deliver its range of Net Zero products across the UK and supports calls for a greater investment in green skills You can explore the Net Zero Homes Index in-depth here British Gas has today released their second Net Zero Homes Index tracking how UK families feel about the journey to Net Zero and their readiness to make home and lifestyle changes. The Index reveals that when it comes to Net Zero, there continues to be widespread awareness but a limited understanding of the 2050 Net Zero target. When Net Zero was explained, 71% of the public agreed that it was the right thing to do. On average, people believe that the UK will reach Net Zero closer to 2075 rather than 2050 and, over one in five (22%) respondents were so pessimistic that they thought it would never be achieved. In this year’s research, the cost-of-living crisis and high energy prices have meant confidence has dropped slightly from 57.5 to 56.5 on a scale from 0 to 100. Most significantly, climate change is now seen as the fifth most important issue facing the country as it moves down from fourth last year. Despite this, over half (57%) of respondents say that climate change is one of the most pressing issues of our time. The development of onshore wind, which has previously faced pockets of local opposition as well as a government ban on development, remains in line with last year’s results. The research found that respondents were overwhelmingly receptive to the development with 79% supporting building more onshore wind, with just 7% saying they were opposed. Over four in five (88%) respondents supported building more solar power, 83% supported more offshore wind and, new nuclear remained the most controversial option, with only 48% supporting it. Making changes in the home Following on from last year, the public are more committed to tackling climate change, with 78% of respondents willing to make changes in their home. In fact, over the next two years, almost half (47%) of homeowners said they were willing to install improved insulation with over two fifths (41%) willing to add solar panels to their roof and 28% willing to install an electric vehicle ‘fast charge’ point. This year, the Index revealed over one in four homeowners (28%) would be willing to install a heat pump. Attitudes to heat pumps vary substantially by age with 48% aged 18-24 willing to install a heat pump compared to just 15% of those aged 65 and over.","filter_flag":1}
{"title":"National Grid confirmed as platinum sponsor for Transport + Energy Forum - transportandenergy - Transport + Energy","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vdHJhbnNwb3J0YW5kZW5lcmd5LmNvbS8yMDIzLzA5LzIwL25hdGlvbmFsLWdyaWQtY29uZmlybWVkLWFzLXBsYXRpbnVtLXNwb25zb3ItZm9yLXRyYW5zcG9ydC1lbmVyZ3ktZm9ydW0v0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vdHJhbnNwb3J0YW5kZW5lcmd5LmNvbS8yMDIzLzA5LzIwL25hdGlvbmFsLWdyaWQtY29uZmlybWVkLWFzLXBsYXRpbnVtLXNwb25zb3ItZm9yLXRyYW5zcG9ydC1lbmVyZ3ktZm9ydW0v0gEA?oc=5","id":"CBMicWh0dHBzOi8vdHJhbnNwb3J0YW5kZW5lcmd5LmNvbS8yMDIzLzA5LzIwL25hdGlvbmFsLWdyaWQtY29uZmlybWVkLWFzLXBsYXRpbnVtLXNwb25zb3ItZm9yLXRyYW5zcG9ydC1lbmVyZ3ktZm9ydW0v0gEA","guidislink":false,"published":"Wed, 20 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=263, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vdHJhbnNwb3J0YW5kZW5lcmd5LmNvbS8yMDIzLzA5LzIwL25hdGlvbmFsLWdyaWQtY29uZmlybWVkLWFzLXBsYXRpbnVtLXNwb25zb3ItZm9yLXRyYW5zcG9ydC1lbmVyZ3ktZm9ydW0v0gEA?oc=5\" target=\"_blank\">National Grid confirmed as platinum sponsor for Transport + Energy Forum - transportandenergy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Transport + Energy<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"National Grid confirmed as platinum sponsor for Transport + Energy Forum - transportandenergy - Transport + Energy","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vdHJhbnNwb3J0YW5kZW5lcmd5LmNvbS8yMDIzLzA5LzIwL25hdGlvbmFsLWdyaWQtY29uZmlybWVkLWFzLXBsYXRpbnVtLXNwb25zb3ItZm9yLXRyYW5zcG9ydC1lbmVyZ3ktZm9ydW0v0gEA?oc=5\" target=\"_blank\">National Grid confirmed as platinum sponsor for Transport + Energy Forum - transportandenergy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Transport + Energy<\/font>","source.href":"https:\/\/transportandenergy.com","source.title":"Transport + Energy","query":"https:\/\/news.google.com\/rss\/search?q=\"Low Carbon Technologies\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Transport + Energy Forum has announced headline sponsorship from National Grid, along with speaker participation at a senior level. With National Grid’s critical role in bringing the transport and energy sectors together to accelerate decarbonisation, the organisation’s participation in the Forum promises to be a compelling contribution. Cordi O’Hara OBE FEI, President of National Grid Electricity Distribution (NGED) will present an update from National Grid as part of the morning agenda. Cordi will join a panel debate, chaired by broadcaster Quentin Willson, which also includes Chris Skidmore MP, clean air campaigner Rosamund Adoo-Kissi-Debrah, Stephen Elderkin from National Highways and Lizzie Culwick from OZEV. Cordi is responsible for the safe and reliable operation of the UK’s largest electricity distribution network, serving more than eight million customers across the East and West Midlands, South West and South Wales. As President, Cordi is accountable for NGED’s £6bn investment programme that will be delivered by 2028 – part of a wider £16bn investment by National Grid to upgrade its transmission and distribution networks – keeping clean, fair, affordable power flowing to homes and businesses. In her time at National Grid, Cordi has been a strong advocate for innovative solutions to a decarbonised energy market, believing clean technology solutions and new demand response initiatives can help to deliver Government targets for net zero. Cordi O’Hara, President of National Grid Electricity Distribution, said: “At National Grid, we are committed to driving the UK’s transition to a decarbonised future which is why we’re delighted to be sponsoring the Transport + Energy Forum – an event that recognises the crucial role of both the energy and transport sectors in achieving net zero for the UK. “National Grid’s innovative work around low carbon technologies, including the electrification of transport, will be key to facilitating this low carbon revolution, taking it further and faster than ever before and ensuring no-one is left behind in the green transition. By acting now and collaborating with others across the industry, we can work together to deliver the solutions needed to accelerate this transition, and I very much look forward to National Grid being at the heart of this challenge.” “It’s a real privilege to welcome National Grid to our sponsor line up this year”, commented Alec Peachey Editorial Director, Transport + Energy. “National Grid’s role in taking us further and faster to towards decarbonisation is pivotal. We are delighted to welcome Cordi O’Hara to our speaker line up, along with her contribution to our panel.” For more information on the Transport + Energy Forum, 16 November at Birmingham Conference and Events Centre, click here. Share this: LinkedIn Twitter Facebook Email ","filter_flag":1}
{"title":"Voyaging Toward a Greener Maritime Future | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvdm95YWdpbmctdG93YXJkLWEtZ3JlZW5lci1tYXJpdGltZS1mdXR1cmXSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvdm95YWdpbmctdG93YXJkLWEtZ3JlZW5lci1tYXJpdGltZS1mdXR1cmXSAQA?oc=5","id":"CBMiT2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvdm95YWdpbmctdG93YXJkLWEtZ3JlZW5lci1tYXJpdGltZS1mdXR1cmXSAQA","guidislink":false,"published":"Wed, 27 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=270, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvdm95YWdpbmctdG93YXJkLWEtZ3JlZW5lci1tYXJpdGltZS1mdXR1cmXSAQA?oc=5\" target=\"_blank\">Voyaging Toward a Greener Maritime Future | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Voyaging Toward a Greener Maritime Future | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvdm95YWdpbmctdG93YXJkLWEtZ3JlZW5lci1tYXJpdGltZS1mdXR1cmXSAQA?oc=5\" target=\"_blank\">Voyaging Toward a Greener Maritime Future | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Low Carbon Technologies\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"The shipping industry is the backbone of the global economy, facilitating 90% of international trade and transporting over 11 billion metric tons of goods annually. Yet it is responsible for 2% to 3% of global greenhouse gas (GHG) emissions, which contributes to the supply-chain (Scope 3) emissions of every business with seaborne logistics. In 2023, the International Maritime Organization revised its GHG emissions target to achieve net zero emissions for shipping by or around 2050. The Global Centre for Maritime Decarbonisation (GCMD) and Boston Consulting Group (BCG) conducted a first-of-its-kind industry survey to take stock of shipowners and operators’ progress in establishing six elements needed for the industry to reach net zero. The survey saw strong participation from 128 shipowners and operators across vessel types, fleet sizes and geographies, which collectively own or operate 14,000 merchant vessels, and account for $500 billion in revenue. High Decarbonization Ambitions, Uneven Progress We found high decarbonization ambitions: Most respondents viewed net zero as a strategic priority, and 77% had already set concrete decarbonization targets. The industry has also mobilized resources to decarbonize: respondents are investing 2% of their revenues into green initiatives, and 87% have personnel working toward green objectives. The path to net zero for shipowners and operators requires six elements: A robust strategy and roadmap Four specific decarbonization levers to reduce emissions: operational efficiency, technological efficiency, fuel transition, and shipboard carbon capture Enablers such as dedicated sustainability teams, strategic investments in green initiatives, internal carbon prices, and digitalization While the industry has made some progress in adopting mature and cost-effective efficiency levers, adoption of complex or nascent levers remains low. Drop-in green fuels are constrained by costs and supply-side gaps, and optimism for future cleaner fuels is yet to translate into firm commitment. The industry is now at a pivotal point, with many shipowners and operators ramping up their decarbonization efforts. Three-quarters of respondents plan to increase investments in green initiatives. Stakeholders can build on this momentum with a variety of supportive actions. But to be effective, they need to tailor their interventions to address the specific challenges that shipowners and operators face at each stage of decarbonization. Three Decarbonization Archetypes We see three archetypes, differentiated in their outlook, investment appetite, and the challenges faced. Frontrunners have the greatest ambitions and are willing to invest heavily. They are pushing boundaries, adopting even nascent decarbonization levers, such as wind propulsion and air lubrication. A majority plan to pilot shipboard carbon capture solutions by 2025. Frontrunners are also planning to adopt methanol and ammonia as early as 2026 and 2029 respectively, and the availability of fuels and bunkering infrastructure will be critical to enabling adoption. Followers believe in decarbonizing their fleets, but have tighter investment thresholds and a near-term outlook. They have kept pace with Frontrunners in adopting mature and cost-effective efficiency levers, such as main engine improvements and slow steaming, but are behind in the adoption of nascent levers, such as wind propulsion and air lubrication. Conservatives are still early in their decarbonization journey, likely due to a lack of awareness and familiarity with the various decarbonization levers, and the capabilities to assess and deploy them. They are best supported by measures that increase their familiarity with the levers and help contextualize them to their specific fleets and operational requirements. Call to Action Our research highlights five key actions for stakeholders: Conduct technical pilots and facilitate data sharing, especially for nascent levers Create innovative financing mechanisms to de-risk adoption of less mature levers Raise awareness, contextualize levers, and build capabilities, especially among Conservatives Start to build out future fuels infrastructure at ports Develop mechanisms to equalize and share the costs of levers across the ecosystem Maritime decarbonization is a complex, critical endeavor. The successful implementation of these five key actions demands a whole-of-value-chain approach. By working together, stakeholders can transform the maritime sector into a beacon of environmental stewardship, and set a course for a greener future where decarbonization and commercial success go hand in hand.","filter_flag":1}
