{"title":"Product Returns, Reverse Logistics, and a Circular Economy - Esri","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmVzcmkuY29tL2Fib3V0L25ld3Nyb29tL3B1YmxpY2F0aW9ucy93aGVyZW5leHQvcHJvZHVjdC1yZXR1cm5zLXByb2xpZmVyYXRlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmVzcmkuY29tL2Fib3V0L25ld3Nyb29tL3B1YmxpY2F0aW9ucy93aGVyZW5leHQvcHJvZHVjdC1yZXR1cm5zLXByb2xpZmVyYXRlL9IBAA?oc=5","id":"CBMiV2h0dHBzOi8vd3d3LmVzcmkuY29tL2Fib3V0L25ld3Nyb29tL3B1YmxpY2F0aW9ucy93aGVyZW5leHQvcHJvZHVjdC1yZXR1cm5zLXByb2xpZmVyYXRlL9IBAA","guidislink":false,"published":"Tue, 07 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=38, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmVzcmkuY29tL2Fib3V0L25ld3Nyb29tL3B1YmxpY2F0aW9ucy93aGVyZW5leHQvcHJvZHVjdC1yZXR1cm5zLXByb2xpZmVyYXRlL9IBAA?oc=5\" target=\"_blank\">Product Returns, Reverse Logistics, and a Circular Economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Esri<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Product Returns, Reverse Logistics, and a Circular Economy - Esri","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmVzcmkuY29tL2Fib3V0L25ld3Nyb29tL3B1YmxpY2F0aW9ucy93aGVyZW5leHQvcHJvZHVjdC1yZXR1cm5zLXByb2xpZmVyYXRlL9IBAA?oc=5\" target=\"_blank\">Product Returns, Reverse Logistics, and a Circular Economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Esri<\/font>","source.href":"https:\/\/www.esri.com","source.title":"Esri","query":"https:\/\/news.google.com\/rss\/search?q=\"Reverse logistics\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"The path from raw material to finished good to a customer’s home is carefully choreographed. Less so? What happens when that ill-fitting pair of pants or unwanted gadget ends up in the return pile. What some companies are discovering, however, is that the location intelligence they rely on to deliver products to customers efficiently can be equally helpful when goods move in reverse—an increasingly common occurrence. Article snapshot: The “buy now, return later” mantra of today’s consumer is causing a glut of product returns—and a lot of opportunities for a more circular economy. As consumer spending has grown, so too have product returns, more than doubling between 2019 and 2022 to an estimated $816 billion annually, according to the National Retail Federation and Appriss Retail. While returns can be a convenience for consumers, they’re less convenient for company balance sheets and the planet. Some returns can be resold in stores, off-loaded to discount resellers, or donated to charity, but the rest often end up in incinerators or landfills, according to a recent Wall Street Journal op-ed by a pair of University of Tennessee logistics experts. That creates about 6 billion pounds of landfill waste and 16 million metric tons of carbon dioxide, the authors said, citing a study by returns-management company Optoro. Frustrated by the financial losses and environmental degradation created by returns, some companies are eyeing a circular economy approach—one that connects them with interested buyers or manufacturers that can create something new from what’s been returned. Connecting Product Returns with Sources of Demand One challenge of reverse logistics is that there’s far less predictability about where returns will go than there is in a typical supply chain. What can make the process clearer is a smart map that reveals the location of products and their potential destinations. For goods that will end up back on store shelves, GIS technology can capture real-time location information from inventory management systems, indicating which stores in the retail network need certain products. For returned goods that can’t be sold in store, a smart map can show facilities that take donations or resell returns. Then there’s the opportunity to convert returns into new products through upcycling. At a time when supply chain disruptions have left companies scrambling for key components, materials can be harvested and used to make repurposed furniture, apparel, and other goods. That circular economy practice aims to lengthen a product’s useful life, reduce waste, and preserve—even revive—natural systems. As noted in a recent WhereNext article: From an environmental perspective, the consequences [of disposal] are increasingly significant, impacting air, water, and soil resources that underpin the economy. For business executives, trashing products that could be repurposed and resold violates a basic tenet of profitability: never leave value on the table—or in this case, at the dump. One company is using GIS technology to manage the circular economy for plastics. By assigning plastic products a unique digital identifier, the company can use a smart map to trace each batch from the point of collection to the recycling facility and beyond. Such transparency helps manufacturers validate net-zero achievements while giving consumers confidence that their purchases are supporting the circular economy. Pinpointing Supply Chain Links in Proximity Once a company identifies organizations interested in buying returns, planners can use location intelligence to better route the products. GIS software identifies logistics routes that minimize miles traveled and carbon emissions, whether by ship, train, truck, or plane. GIS specializes in complex analysis and coordination, helping companies like FedEx orchestrate the movement of spare parts to keep its planes airworthy and minimize waste in the system. Establishing the links that turn product returns into circular opportunities is inherently a geographic pursuit. Ultimately, this geography of reverse logistics can help build a circular economy, increasing both sustainability and profitability. Photo by Sigmund","filter_flag":1}
{"title":"Mud Jeans Wants to Help Other Brands Get a Handle on EPR - Sourcing Journal","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vc291cmNpbmdqb3VybmFsLmNvbS9kZW5pbS9kZW5pbS1icmFuZHMvbXVkLWplYW5zLWV4dGVuZGVkLXByb2R1Y2VyLXJlc3BvbnNpYmlsaXR5LWVwci1ob3RsaW5lLWxlYXNlLWEtamVhbnMtNDE2MDY1L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vc291cmNpbmdqb3VybmFsLmNvbS9kZW5pbS9kZW5pbS1icmFuZHMvbXVkLWplYW5zLWV4dGVuZGVkLXByb2R1Y2VyLXJlc3BvbnNpYmlsaXR5LWVwci1ob3RsaW5lLWxlYXNlLWEtamVhbnMtNDE2MDY1L9IBAA?oc=5","id":"CBMie2h0dHBzOi8vc291cmNpbmdqb3VybmFsLmNvbS9kZW5pbS9kZW5pbS1icmFuZHMvbXVkLWplYW5zLWV4dGVuZGVkLXByb2R1Y2VyLXJlc3BvbnNpYmlsaXR5LWVwci1ob3RsaW5lLWxlYXNlLWEtamVhbnMtNDE2MDY1L9IBAA","guidislink":false,"published":"Wed, 08 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=39, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vc291cmNpbmdqb3VybmFsLmNvbS9kZW5pbS9kZW5pbS1icmFuZHMvbXVkLWplYW5zLWV4dGVuZGVkLXByb2R1Y2VyLXJlc3BvbnNpYmlsaXR5LWVwci1ob3RsaW5lLWxlYXNlLWEtamVhbnMtNDE2MDY1L9IBAA?oc=5\" target=\"_blank\">Mud Jeans Wants to Help Other Brands Get a Handle on EPR<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sourcing Journal<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Mud Jeans Wants to Help Other Brands Get a Handle on EPR - Sourcing Journal","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vc291cmNpbmdqb3VybmFsLmNvbS9kZW5pbS9kZW5pbS1icmFuZHMvbXVkLWplYW5zLWV4dGVuZGVkLXByb2R1Y2VyLXJlc3BvbnNpYmlsaXR5LWVwci1ob3RsaW5lLWxlYXNlLWEtamVhbnMtNDE2MDY1L9IBAA?oc=5\" target=\"_blank\">Mud Jeans Wants to Help Other Brands Get a Handle on EPR<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sourcing Journal<\/font>","source.href":"https:\/\/sourcingjournal.com","source.title":"Sourcing Journal","query":"https:\/\/news.google.com\/rss\/search?q=\"Reverse logistics\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Mud Jeans wants to help its fellow apparel brands “get a hold” of their extended producer responsibility strategies. This Thursday, the denim label plans to host a one-off “EPR hotline” where it will provide insight from its years centering circularity. The event comes as the European Commission plans to propose EPR regulations in June and the Netherlands prepares to implement its own EPR policies in July. Mud, however, has prioritized reverse logistics for years, collecting old jeans and recycling them into new products. In a typical year, the company estimates it receives back between roughly 10,000 and 15,000 pairs of old jeans. In 2021, that total surpassed 11,500. The self-described “first circular denim brand” also offers free repairs for customers participating in its “Lease a Jeans” concept. Though Mud has not received “large numbers” of repair requests—the service only extends to the first year of a lease—the company views its denim leasing program as one of its “most successful strategies,” corporate social responsibility manager Lea Landsberg said. “The idea behind offering jeans for lease is to move towards an economy based on experiences rather than possessions,” Landsberg told Rivet. “We want to show people that you don’t have to be the owner of a product to still enjoy that product. This shift in mindset appeals to many, especially the younger generation. They are aware that the jeans are not with them forever. It also increases the awareness that the materials from which the product is made have had a life before and will have a life after they are done wearing it.” Mud is currently trialing a more extensive repair pilot in Amsterdam and Utrecht, the Netherlands. The prospective program would allow any customer to repair their Mud jeans for free. Launched at the end of last year, this service has facilitated 65 repairs so far, Landsberg said Monday. Though measuring the impact of these repair services is difficult, she said customer feedback has suggested these repair services extend the jeans’ lifetimes by several years. “Running a holistic take-back scheme has also taught us a lot about efficient reverse logistics and circular design,” Landsberg added. “Through feedback from our logistics partner and our recycling partners we have been able to create a well-functioning system. By taking this approach for several years, we have also been able to increase the amount of recycled denim we use.” Ultimately, however, Mud has learned to accept that circularity will come at a higher price. “Using recycled cotton is still more expensive than using virgin cotton,” Landsberg said. “We have learned to stick to our values and continue doing what we think is important anyway. Meaning: taking back old jeans for free and recycling them into new jeans, despite the higher costs.”","filter_flag":1}
{"title":"How retailers are changing their approach to online returns - Econsultancy","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vZWNvbnN1bHRhbmN5LmNvbS9yZXRhaWxlcnMtaW5ub3ZhdGluZy1vbmxpbmUtcmV0dXJucy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vZWNvbnN1bHRhbmN5LmNvbS9yZXRhaWxlcnMtaW5ub3ZhdGluZy1vbmxpbmUtcmV0dXJucy_SAQA?oc=5","id":"CBMiPWh0dHBzOi8vZWNvbnN1bHRhbmN5LmNvbS9yZXRhaWxlcnMtaW5ub3ZhdGluZy1vbmxpbmUtcmV0dXJucy_SAQA","guidislink":false,"published":"Mon, 27 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=58, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vZWNvbnN1bHRhbmN5LmNvbS9yZXRhaWxlcnMtaW5ub3ZhdGluZy1vbmxpbmUtcmV0dXJucy_SAQA?oc=5\" target=\"_blank\">How retailers are changing their approach to online returns<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Econsultancy<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How retailers are changing their approach to online returns - Econsultancy","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vZWNvbnN1bHRhbmN5LmNvbS9yZXRhaWxlcnMtaW5ub3ZhdGluZy1vbmxpbmUtcmV0dXJucy_SAQA?oc=5\" target=\"_blank\">How retailers are changing their approach to online returns<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Econsultancy<\/font>","source.href":"https:\/\/econsultancy.com","source.title":"Econsultancy","query":"https:\/\/news.google.com\/rss\/search?q=\"Reverse logistics\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Retail return rates are soaring. According to data from Rebound, UK retail returns were 26% higher in November 2022 compared to the same period the year before. Similarly, Salesforce noted a surge in returns, citing a 63% increase in returns year-on-year for the holiday period just gone. Rebound suggests that inflation and the cost-of-living crisis could be a factor in rising return rates, with consumers exhibiting greater caution over spend, as well as impulse buying on Black Friday (before deciding to return). Previously, the retail industry has focused on making returns as fuss-free as possible.. Now, however, the high cost of returns is becoming impossible to ignore – both to retailers and the environment. Optoro estimates that it costs an average of $33 or 66% of the price of a $50 item for retailers to process a return, with costs stretching from processing to discounting and liquidation losses. The high cost also means that most items end up in landfill rather than being re-stocked. Optoro states that, for 2020 alone, returned inventory created 5.8 billion lbs of landfill waste, while shipping of returns emitted 16 million metric tons of carbon dioxide. Consequently, the retail industry has started to re-think its approach. Many companies are either looking for ways to make it harder for customers to make online returns (via charges or limits on regular return), or conversely, even more convenient to return items in physical locations. Promoting resale and peer-to-peer returns Only 20% of retail returns are reported to be defective, meaning that the majority of items are returned for other reasons. For clothing and apparel, this is often due to items being the wrong size or fit, or because the customer has bought multiple items with the intention of returning a part of the order (a practice known as ‘bracketing’). However, a common misunderstanding is that all non-defective items will make their way back into retail stock to be resold, but the reality is that most do not. Technology companies such as Greenlist are aiming to alleviate the issue by offering retailers new ways to handle returns, such as peer-to-peer. The company’s tech plugs into Shopify websites, enabling customers to select items that other customers want to return. Essentially, instead of sending returns to the retailer, customers can send them directly on to each other for a discounted price. Canada-based start-up, Frate, offers a similar business model, also using QR codes to create shipping labels for customers selling on their unwanted goods. Other technology solutions are aiming to help retail brands retain revenue by encouraging exchanges rather than returns. Return management company Loop does this by offering customers one-click exchanges on retail sites, as well as additional incentives such as bonus credit and free shipping. As well as helping to retain the cost of the initial purchase, the idea is that exchanges create a more positive experience for customers, which in turn is more likely to generate loyalty and fewer returns in future. Peer-to-peer returns can also be made on third-party resale marketplaces like eBay, Depop, and Thredup, but in certain instances, retail brands are creating their own resale sites to combat returns. One of the most successful examples of this is Patagonia, which pledges never to dispose of returned items, instead selling them on its Worn Wear marketplace, which also buys back old clothes for repair and resale to drive a circular fashion model. Worn Wear also encourages in-store drop-offs in exchange for store credit, too, to further encourage a sustainable approach to resale. Educating customers to actively discourage online returns Patagonia’s purpose-driven business model is centred around educating consumers about the environmental cost of over-consumption, ultimately encouraging them to buy less. While it is a rather radical approach – and one that is only successful due to Patagonia’s commitment in other areas, such as charitable donations and sustainable materials – other retail brands are also taking heed and actively educating customers on what the impact of returns might be. In doing so, retail brands are able to justify charging for returns, which many more are hoping to introduce without negatively impacting the customer experience. A number of brands including New Look, Moss Bros, and Mountain Warehouse have all recently introduced charges for online returns. Interestingly, research suggests that consumers are largely accepting of this, as long as they are offset by additional value and convenience. A Loop survey of 1,000 consumers found that 70% of respondents would be willing to pay for premium returns experiences. Loop defines ‘premium’ in this context as an experience that “elevates consumer convenience through features like at-home item pickup, package-less return drop-off, or initiation through a QR code.” Essentially, any elements that promote time-saving or that streamline the return experience. Another strategy to win consumer favour is to offer transparency with regards to when and what items will go on sale, which can prevent customers from the practice of returning items and re-buying them at a cheaper price. Glossy reports how brands Universal Standard and Kopari did this ahead of Black Friday last year, effectively enabling customers to plan ahead and intentionally buy only once. Elsewhere, when the cost of processing a return is more than the item itself, some large retailers have allowed customers to keep items instead of returning them. Walmart, Target, and Amazon began with this policy during Covid-19 to help deal with supply chain issues, but have since kept it as part of wider customer service strategies. Pet retailer Chewy is similarly well-known for its approach to returns, often telling customers to keep or donate items but refunding them anyway. In doing so, Chewy is able to foster a positive customer experience and drive brand loyalty. Optimising reverse logistics – curbside returns, no queues, and paperless While fewer returns is the end-goal, the issue is never going to disappear entirely, so it’s vital for the process to be as frictionless as possible. This can also be beneficial for retailers, with 92% of consumers saying that they are more likely to buy from a retailer again if the returns process is easy. One way to optimise reverse logistics – which refers to the process of sending items back through the supply chain – is to offer free returns to stores or third-party pick-up locations, where technology is driving additional convenience for customers. Walmart, Target, and Nordstrom now offer curbside returns to encourage returns to stores, meaning that customers don’t even have to leave their vehicle in order to do so. Target has even trialled the option of adding a Starbucks order for curbside pick-up, further incentivising customers to use the service. Nordstrom in particular has seen success with its Norstrom Local stores, which are inventory-free locations dedicated to services such as pick-ups, alterations, and returns (to both Nordstrom and other retailers). Crucially, Nordstrom says that returns made at its Local outlets are processed faster than its main stores as well as online, ultimately increasing the chances of the retailer being able to resell the items. Elsewhere, Amazon is making the process more convenient by offering box-free returns, so that customers can return their unpackaged items to any participating Amazon Fresh, Whole Foods, Kohl’s, or UPS Stores, and return their item by scanning a QR code. Other retailers are also investing in store technology to ease the burden of returns. Marks & Spencer, for example, launched digital click-and-collect capabilities in 78 UK stores in 2022, enabling customers to return items without the hassle of having to queue up. Additionally, M&S has launched mobile-optimised returns, which it says reduces pain points, “such as the need to visit third party courier websites, use a printer, and find the right paper summaries amongst your orders.” With returns remaining a big issue for retailers, finding innovative ways to deter customers from online returns – or at least re-direct them into physical locations – is likely to be the way forward.","filter_flag":1}
{"title":"FWA CPE maximizes return on 5G spectrum ... - eeNews Europe","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LmVlbmV3c2V1cm9wZS5jb20vZW4vZndhLWNwZS1tYXhpbWl6ZXMtcmV0dXJuLW9uLTVnLXNwZWN0cnVtL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LmVlbmV3c2V1cm9wZS5jb20vZW4vZndhLWNwZS1tYXhpbWl6ZXMtcmV0dXJuLW9uLTVnLXNwZWN0cnVtL9IBAA?oc=5","id":"CBMiSGh0dHBzOi8vd3d3LmVlbmV3c2V1cm9wZS5jb20vZW4vZndhLWNwZS1tYXhpbWl6ZXMtcmV0dXJuLW9uLTVnLXNwZWN0cnVtL9IBAA","guidislink":false,"published":"Tue, 28 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=59, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LmVlbmV3c2V1cm9wZS5jb20vZW4vZndhLWNwZS1tYXhpbWl6ZXMtcmV0dXJuLW9uLTVnLXNwZWN0cnVtL9IBAA?oc=5\" target=\"_blank\">FWA CPE maximizes return on 5G spectrum ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">eeNews Europe<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"FWA CPE maximizes return on 5G spectrum ... - eeNews Europe","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LmVlbmV3c2V1cm9wZS5jb20vZW4vZndhLWNwZS1tYXhpbWl6ZXMtcmV0dXJuLW9uLTVnLXNwZWN0cnVtL9IBAA?oc=5\" target=\"_blank\">FWA CPE maximizes return on 5G spectrum ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">eeNews Europe<\/font>","source.href":"https:\/\/www.eenewseurope.com","source.title":"eeNews Europe","query":"https:\/\/news.google.com\/rss\/search?q=\"Reverse logistics\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"FWA CPE maximizes return on 5G spectrum New Products | February 28, 2023 By Jean-Pierre Joosting VANTIVA, formerly known as Technicolor, has launched its Falcon 5G fixed wireless access (FWA) customer premises equipment (CPE) at Mobile World Congress 2023 in Barcelona. The integrated system delivers fast wireless speeds over a wide area. The announcement is the latest example of the company’s leadership position in providing network service providers (NSPs) with the latest‚— and most innovative— products for the connected home market. “With Falcon 5G, VANTIVA addresses two distinct market opportunities. It is an ideal product for mobile operators that have made significant investments in the 5G spectrum and want to accelerate and maximize returns on those investments. FWA offers these NSPs an opportunity to introduce new residential services and generate new revenue streams,” said Ashwani Saigal, Vice President of Broadband and Video CPE at VANTIVA. “Falcon 5G also creates new opportunities for integrated fixed and mobile operators. They are now in a position to extend their broadband services to underserved residential areas that do not have access to cable or fiber infrastructure,” he said. The Falcon 5G complements and expands on the innovations introduced last year when the Cobra 5G premium indoor CPE and the 5G Omni outdoor CPE were launched. The Falcon 5G, for instance, pushes 5G traffic to the C-band of the spectrum, improving indoor 5G signal reception and significantly boosting uplink speeds while enabling whole-home Wi-Fi coverage in a more compact eco-friendly form factor. Falcon 5G harnesses the company’s breakthrough Indoor5G™ technology, which allows the reception system in the gateway device to self-optimize by automatically configuring its internal antennas to ensure the best reception from operators’ towers. The CPE also leverages Power Class 1.5, which boosts the transmission power by 3 dB. This allows operators to improve uplink speeds for FWA users. More importantly, it enables NSPs to address up to 40% larger areas around their base stations and connect more homes with 5G. The Falcon 5G addresses connectivity and performance issues created by the weakening of 5G signals as traffic passes through the walls of homes. The single-unit CPE can be easily self-installed by subscribers with the help of the NaviGate5G™ iOS and Android mobile apps developed by VANTIVA to optimize the position of the 5G gateway in the home. NaviGate5G™ determines the available towers location in the end users’ vicinity and guides them to position the device at the optimum place. This self-service technology removes the need for NSP-technician installation visits, reducing the time and resources that are typically associated with “truck rolls.” The latest Wi-Fi 6 technologies have been integrated into the CPE to ensure high-quality connectivity throughout the home. VANTIVA engineers have placed Wi-Fi antennas at the top of Falcon 5G tower design to bring true 360° performance. In addition to enabling speeds and coverage that supports high-quality video streaming across multiple devices and high-speed connectivity for smart homes and Internet of Things (IoT) devices, VANTIVA is addressing global demand for greener, more sustainable, products. The company has thoroughly simplified Falcon 5G’s electrical architecture. As a result, the overall size of the Falcon 5G is 45% smaller and has reduced operating power consumption by 35% compared to current products available in the market. The form factor reduction means that the number of gateways flowing through the international supply chain in shipping containers increases by 47%, further improving the carbon footprint profile of the product. Additionally, the company’s mechanical designers have maximized passive convection to remove the need for cooling fans. In terms of materials, 95% of the plastic parts in the Falcon 5G gateway are comprised of recycled resins. The product is designed for easy reverse logistics, reducing the costs associated with refurbishing and recycling. The packaging, made of brown recycled cardboard, is plastic-free. All markings on the product exclusively use vegetable inks. Finally, Falcon 5G is one of the first 5G FWA gateways on the market to take full advantage of the integrated Qualcomm® 5G Fixed Wireless Access Platform Gen 2 from Qualcomm Technologies for mobile broadband, removing the need for additional components like an application processor. This makes Falcon 5G the most efficient indoor CPE on the market. “Qualcomm Technologies’ global leadership and 5G offerings have been critical in fostering the proliferation and adoption of 5G and FWA to drive affordable, accessible connectivity infrastructure for global communities,” said Dino Flore, Vice President, Technology, Qualcomm Europe, Inc. www.vantiva.com Related articles 5G chipset for next generation CPE devices MediaTek unveils platform for 5G CPE devices 5G uCPE for multi-access edge computing deployments If you enjoyed this article, you will like the following ones: don't miss them by subscribing to : If you enjoyed this article, you will like the following ones: don't miss them by subscribing to : eeNews on Google News Share:","filter_flag":1}
