{"title":"Changing how we talk — and think — about manufacturing - University of Cambridge news","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vd3d3LmNhbS5hYy51ay9zdG9yaWVzL2Z1dHVyZS1vZi1tYW51ZmFjdHVyaW5n0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vd3d3LmNhbS5hYy51ay9zdG9yaWVzL2Z1dHVyZS1vZi1tYW51ZmFjdHVyaW5n0gEA?oc=5","id":"CBMiNWh0dHBzOi8vd3d3LmNhbS5hYy51ay9zdG9yaWVzL2Z1dHVyZS1vZi1tYW51ZmFjdHVyaW5n0gEA","guidislink":false,"published":"Tue, 17 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=17, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=17, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vd3d3LmNhbS5hYy51ay9zdG9yaWVzL2Z1dHVyZS1vZi1tYW51ZmFjdHVyaW5n0gEA?oc=5\" target=\"_blank\">Changing how we talk — and think — about manufacturing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">University of Cambridge news<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Changing how we talk — and think — about manufacturing - University of Cambridge news","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vd3d3LmNhbS5hYy51ay9zdG9yaWVzL2Z1dHVyZS1vZi1tYW51ZmFjdHVyaW5n0gEA?oc=5\" target=\"_blank\">Changing how we talk — and think — about manufacturing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">University of Cambridge news<\/font>","source.href":"https:\/\/www.cam.ac.uk","source.title":"University of Cambridge news","query":"https:\/\/news.google.com\/rss\/search?q=\"Low Emission Technologies\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"However, it’s not just about how we talk about manufacturing that needs to change. We need to think differently about it, too. Firstly, we need to move from the view of ‘the manufacturing sector’ as something that stands separate from our daily lives. It might just be me, but I sometimes feel that there is a weird perceived disconnect between the world of making and distributing things, and the world of consumption. Working in manufacturing for 20 years, I have become dangerously blinkered to this. I am too often taken aback by comments from smart people who are themselves surprised to learn that manufacturing is still thriving in the UK, and its critical role in all our lives. A key part of the message we need to spread is: manufacturing affects every aspect of our lives. We make choices about what we choose to buy (or not buy). We make choices about how we buy. And all of this directly impacts the decisions made by manufacturing firms and their investors. What’s more, our role as consumers within the manufacturing world has been amplified in recent years by digitalisation enabling the seamless flow of data through the design, production and use of so many products we use every day. That leads to a second key point: the need to be much better at ‘joining up the dots’. There are many examples of outstanding people and programmes that support manufacturing in the UK. But one thing that gets reported to me from industry colleagues is the lack of connections between all the initiatives aimed at the long-term development of our national manufacturing capabilities. And at the heart of this is the need to have connections between those who invest in technologies, those who help develop skills, and those who support the transformation of supply chains. In terms of technologies, we must do two things. Firstly, we must accelerate the adoption of existing technologies by those who most need them. A great example of this is helping smaller manufacturers adopt appropriate digitalisation technologies to improve their productivity. In parallel, we must develop and follow roadmaps to develop and capture value from emerging technologies over coming decades — long beyond the typical political cycles. But technologies — whether existing or emerging — are of zero value if we do not have people with the right skills in the right place at the right time. Picking up the example above, small manufacturing firms require access to the skills needed to adopt appropriate technologies to improve their competitiveness. But we also need to ensure that universities and colleges have the people — spanning the scientific and the technical — needed to generate and scale-up new concepts. This will only work if we take an integrated view of skills development combining the academic with the vocational, spanning full-time education and through-life learning. Yet technologies and people alone do not create value. They need to be combined in an appropriate organisational form structured around the right business model. We are seeing huge transformations in both aspects across many sectors, such as the complex supply chains for internal combustion engines shifting to electric propulsion systems, or the bulk production of pharmaceuticals shifting to the delivering of personalised medicines. Our thinking about and support for manufacturing must treat these three parts — technologies, skills, supply chains — as one integrated system. Saying that is easy: doing it will be much harder. But it is possible, and we can see others who are already doing it. The Biden administration has just published a new US national strategy for manufacturing. It is one that is based on a vision to ‘grow the economy, create quality jobs, enhance environmental sustainability, address climate change, strengthen supply chains, ensure national security, and improve healthcare’. How do they plan to achieve this impressive vision? By connecting the activities around developing technologies, having an appropriate workforce both for now and in the future, and developing resilient supply chains. Sound familiar?","filter_flag":1}
