{"title":"How Google is supporting the circular economy","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d1fa985464c91a7e8bc20539731&url=https%3a%2f%2fwww.nature.com%2farticles%2fd42473-022-00399-1&c=1934620950812163367&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d1fa985464c91a7e8bc20539731&url=https%3a%2f%2fwww.nature.com%2farticles%2fd42473-022-00399-1&c=1934620950812163367&mkt=en-us","summary":"Circular design. Reduce the need for new products and materials by supporting longer product lifecycles, reuse programmes and recycling. • Recycled materials. Use recycled materials to create ...","published":"Wed, 16 Nov 2022 06:13:00 GMT","published_parsed":"time.struct_time(tm_year=2022, tm_mon=11, tm_mday=16, tm_hour=6, tm_min=13, tm_sec=0, tm_wday=2, tm_yday=320, tm_isdst=0)","news_source":"Nature","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How Google is supporting the circular economy","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Circular design. Reduce the need for new products and materials by supporting longer product lifecycles, reuse programmes and recycling. • Recycled materials. Use recycled materials to create ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Circular Design\" \"new products\"&format=rss","text":"Figure 1. Zero-waste data centres. Google uses several circularity strategies at its globally owned and operated data centres, such as repairing components whenever possible to extend the life of servers. For the vast majority of Earth’s existence, our planet functioned as the quintessential circular system. The Sun’s energy nourished trees into life, and once they fell, microorganisms broke them down into soil and nutrients, fuelling the next generation of growth. The notion of ‘waste’ did not exist — everything had a use. It is only in the past few hundred years that humans have interrupted this cycle. With the rise of the Industrial Age came a linear economy built around the consumption of natural resources. Energy was turned into goods and products that we used — and then threw away. This sliver of Earth’s history improved the lives of billions of people, but it came at a tremendous cost to the planet’s future. At our current pace, humanity needs 1.75 Earths to sustain our consumption of natural resources. We have been running a resource deficit since the 1970s that accelerates every year according to the Global Footprint Network, and by 2050, humanity will generate 3.5 Gt of solid waste annually1. To protect our planet while continuing to improve lives, we need to decouple economic growth from the consumption and disposal of finite resources. That is the core premise of the circular economy, which aims to minimize waste and maximize reuse of existing materials. The circular economy also offers a critical pathway to mitigate climate change, because recycled and reused resources have lower carbon footprints. For example, improving the circulation and reuse of uncontaminated steel would avoid 500 Mt of new steel production by 2050, saving more than 1 billion tonnes of carbon emissions per year2. Fortunately, the opportunity is as vast as the need. By making the most of our finite resources, we can not only thrive within planetary boundaries, but we can also generate an estimated US$4.5 trillion3 in new economic output by 2030 and support efforts to achieve net-zero carbon emissions across the economy. Google is committed to accelerating the transition to a circular economy in which business creates environmental, economic and community value through the maximum reuse of finite resources. To help inspire others toward a similar goal, we are sharing some of the lessons we have learned from our circularity programme — and the challenges that remain. Our three circularity principles Since our founding, Google has made it a core value to operate our business in an environmentally sustainable way. In 2007, we became the first major company to be carbon neutral for our operations. As of 2022, our sustainability programme takes a comprehensive view across carbon, water, ecology and circularity. We aim to achieve net-zero emissions across all of our operations and value chain — including our consumer hardware products — by 2030, to replenish 120% of the water we consume by the same year, and to become a circular Google within this more sustainable world. Our approach to circularity is anchored around three core principles: 1. Design-out waste and pollution. This means designing for circularity from the start, enabling existing products to become future resources. 2. Keep products and materials in use. This means extending the effective life of products or materials as long as is safely possible, to make the most of all the resources that went into their creation. 3. Promote safe and healthy materials. This means designing products with materials that are safe for both people and the planet, recognizing that these materials will be used and reused long into the future. These foundations are embedded into all aspects of our business operations, from the data centres we operate to the campuses we build, the products we create, the suppliers we work with, and the culture we encourage. The following section describes some of the progress we have made in each of these areas. Figure 2. Circularity at Bay View and Charleston East. These new Google campuses feature many circularity strategies, such as incorporating salvaged materials to promote reuse and designing flexible spaces to reduce renovation waste. Zero-waste data centres Google owns and operates 23 global data centres filled with servers and other equipment that provide reliable service to the billions of people who use our products every day. Our circularity goal for these centres is to achieve ‘zero waste’, defined as minimizing waste generation and maximizing the reuse of products and materials as much as possible while diverting 90% or more of solid waste from landfills. As of 2022, seven of our 23 data centres have met this zero waste to landfill target and we are continuously making investments to advance waste diversion and recycling across our operations (Fig. 1). Additionally, since 2015, 32.6 million hardware components have been resold into the secondary market, and in 2021, 27% of upgrade components were from refurbished inventory4,5. Our approach to data-centre circularity starts with identifying the life-cycle stage of data-centre components. From there we apply several circularity strategies: • Maintain. Whenever possible, we repair components to extend the life of servers. • Refurbish. When a server or equipment is decommissioned, we create an inventory of usable, refurbished components that are stored for future reuse. • Reuse. Any excess components are resold on the secondary market, following a rigorous security process. • Recycle. Components that cannot be reused or resold are sent to an electronics waste-recycling partner. Proof point: European data centre in Denmark. One of our newest European data centres, located in the Danish town of Fredericia, achieved zero-waste to landfill from day one — and continues to make important progress. Site management is working with a waste partner to recycle additional material that is otherwise sent to waste-to-energy recovery. This has required close partnership with staff and our vendors to find innovative solutions for waste collection and separation. Circular campuses Google has offices in over 180 cities spanning nearly 60 countries. We take a holistic approach to circularity in our offices and campuses, which starts by designing buildings with healthy materials and continues with reducing food and plastic waste in our workspaces. Our three key areas of office circularity are: • Food waste. Our food programme aims to reduce waste through composting, donation and tracking use to right-size orders. We recently announced a goal of sending zero food waste to landfills — and cutting food waste in half for each Google employee — by 2025. We also use behavioural nudges that encourage Googlers to take only the food they will eat. For example, by reducing the depth of our cafeteria bowls by an inch, we found that Googlers took smaller portion sizes, which reduced leftover plate waste by 30–50% (ref. 6). • Plastics waste. We work to reduce single-use plastics and other plastic waste through a series of interventions, including procurement, operational changes and workspace design. These efforts include eliminating the purchase of single-use plastics wherever possible and making reusable drinking options (like our sustainable hydration stations) easy to use in our micro-kitchens. • Building and construction materials. In developing our office spaces, we promote circularity through a number of practices, including procuring salvaged and reused materials in construction projects, designing our facilities to enable zero-waste operations, and setting ambitious waste- diversion targets to keep material out of landfills. For example, since 2012, we have had a robust salvage programme, working with non-profits to find new homes for usable building components such as doors, plumbing fixtures and tiles. Proof point: Bay View and Charleston East campuses. Our new Bay View and Charleston East campuses mark significant steps forward for our circularity programme (Fig. 2). At both locations, we vetted thousands of building materials against the Living Building Challenge (LBC) Red List to eliminate ‘worst in class’ materials and chemicals with the goal of creating a safer, more circular environment. Both campuses incorporated salvaged materials into the building design, and both aim to reduce future renovation waste through highly flexible and reconfigurable work areas. At Charleston East, in particular, more than 22,000 imperial tons of construction waste had been diverted as of October 2021, and 530,000 pounds of drywall waste was recycled as part of a closed-loop wallboard initiative. With these efforts, Charleston East is set to be one of the largest projects ever to attain an LBC Materials Petal certification for healthy building materials. Product and hardware design Millions of people use Google products like Pixel, Nest, Home and Fitbit every day, making these products a circularity priority area. Our product circularity approach involves several strategies: • Using recycled materials. We are committed to using recycled or renewable content in at least 50% of plastic across the product portfolio by 2025, prioritizing recycled plastic wherever possible. For example, the Nest Audio enclosure — which is composed of fabric, housing, a foot and a few smaller parts — is made from 70% post-consumer recycled (PCR) plastic. Our materials scientists and design engineers developed a custom PCR plastic in partnership with our suppliers, and we work closely with them to expand the market for recycled materials, including those we develop specifically for our products. • Practicing circular design. We focus on material reuse and extending the useful life of our products as part of the fundamental design process. For example, we have a goal of making all packaging plastic- free and 100% recyclable by 2025. We also provide a number of repair options, such as making a full range of spare parts for Pixel 2 through Pixel 6 Pro products, including batteries, replacement displays and cameras, and we will provide at least five years of security updates for the Pixel 6 and Pixel 6 Pro, as well as future Pixel phones, from the date we start selling them on the US Google Store. Additionally, for Google Nest, we issue critical bug fixes and patches for at least five years after launch. • Eliminating waste. We are committed to achieving Underwriters Laboratory (UL) 2799 Zero Waste to Landfill certification at all final assembly manufacturing sites by 2022. We are also reducing packaging waste from our suppliers when they ship parts to our manufacturing sites. Additionally, for consumers, we are developing tools and programmes to help people properly recycle electronic goods. For example, we recently made it easier for people to find out where they can recycle or dispose of electronic goods using Google Maps and Search. And we continue to research and pilot new ways for customers to recycle e-waste, including through a doorstep- recycling pilot programme in Denver, Colorado. • Promoting safer chemistry. We strive to select materials to use in our products that have a chemical composition that is safe for both people and the planet — both now and far into the future. For example, we make our restricted substances specification publicly available while also aiming to use safer flame retardants and eliminate antimicrobials across all of our products by 2023. Figure 3. Recycled aluminium in hardware. Google developed a 100% recycled aluminium alloy, validated by a third-party certifier, to improve circularity in the Pixel phone. Proof point: recycled aluminium. As part of our work toward a more circular Google, we developed a 100% recycled aluminium alloy to meet our Google Pixel performance standards, validated by a third-party certifier (Fig. 3). The Pixel 5 was our first phone to incorporate this recycled aluminium, which not only eliminates the use of mined aluminium in the enclosure and reduces waste but also lowers the carbon footprint of manufacturing the enclosure by 35% (based on a third-party- verified life-cycle assessment) compared to using virgin aluminium. At the time of writing, the aluminium inside the back housing of the Pixel 5, 6 and 6 Pro is made with 100% recycled content. We also want other companies to benefit from our work and for other manufacturers to use this alloy in their products. That is why we require our suppliers to make this alloy available to manufacturers across the electronics industry. For more information about our sustainability claims, please visit https:\/\/store.google.com\/magazine\/sustainability. Enabling everyone Even as we work to build a more circular Google, we recognize that realizing a circular economy will take everyone’s participation. To support broader adoption of core circularity practices, we are building tools and partnerships that enable and empower others to reduce waste and reuse materials. A few notable efforts are as follows: • Enabling better recycling. We have now made it easier for people to find out where they can recycle electronics, batteries, glass bottles, clothing and other goods using Google Maps and Search. Local merchants and shops can show the recycling services they offer, and more people can find these options just by searching something like “battery recycling near me” (Fig. 4). People can also suggest edits to the available recycling options at a location, helping others in their community find the right place for them. • Helping officials cut plastic pollution. Every year, rivers carry millions of tonnes of plastic into oceans. We partnered with the United Nations Environment Programme (UNEP) to develop a new machine-learning model that shows a highly accurate view of plastic pollution, with a launch demo focused on the Mekong River in Thailand. This open-source model empowers local government to take action and scale new solutions. • Facilitating household circularity. We have empowered people to take action on circularity in their everyday lives with our interactive tool, Your Plan, Your Planet. The tool features lessons on extending the life of household goods, along with a teachers’ companion guide for schools. It also includes tips around water conservation, energy savings and more. Circularity’s role in climate change While the circular economy is critical from a global resource perspective, it is also essential to addressing climate change. Simply put, the world cannot achieve a net-zero carbon-emissions target without the circular economy. Global greenhouse gas emissions are expected to reach 51 Gt by 2050 (ref. 7). About 45% of that comes from ‘embodied’ emissions, or carbon generated from the production of new buildings, cars, clothing, food and other common goods or products. The circular economy has a key role in stopping the disposal of embodied carbon en route to a net-zero world. Every piece of waste represents a new product that will be created from scratch — and thus a missed opportunity to cut embodied emissions. We can seize that opportunity and cut up to 10 Gt of carbon by 2050 (ref. 7) through several circular strategies described in greater detail elsewhere in this article, including: • Deconstruction. Make better use of buildings through practices like deconstruction and reuse, low-carbon construction materials such as mass timber, and retrofitting or repurposing existing spaces. • Circular design. Reduce the need for new products and materials by supporting longer product lifecycles, reuse programmes and recycling. • Recycled materials. Use recycled materials to create new goods and products, as recycled resources generate significantly lower greenhouse-gas emissions than virgin resources during production. Emerging opportunities As we build on our progress in the years to come, we see a number of exciting areas with the potential to further accelerate the transition to a circular economy. Artifical intelligence Artificial intelligence (AI) is becoming a tool to help address challenges facing many industries, and waste is no exception. Recent estimates suggest that AI’s ability to design-out food waste can create US$127 billion in annual value by 2030, and its ability to improve consumer electronics is valued at US$90 billion a year8. Our 2019 white paper identified three primary ways that AI can support circularity: • Design circular products, components and materials. For example, AI can generate insights that help significantly shorten the design timeline of microchips, which reduces the total amount of materials needed for research and development. • Operate circular business models. For example, our food team, in collaboration with X, Alphabet’s moonshot factory, is using AI to speed up the food-inspection process, strengthening the supply chain and reducing waste. • Optimize circular infrastructure. For example, AI-powered computer vision can help industrial robots classify waste on assembly lines with very high accuracy, leading to better sorting at recycling facilities. Deconstruction and reuse Roughly 11% (ref. 9) of global emissions come from construction and the creation of new building materials — an impact that is locked-in forever and cannot be reduced through technological improvements. Commercial deconstruction and reuse practices can help address this impact by promoting the use of low-carbon materials and encouraging adaptation of commercial buildings. Our 2019 white paper identified the following areas of opportunity for deconstruction and reuse in office development: • Design and build for circularity. Development projects can prioritize healthy materials (including mass timber where feasible), design adaptable spaces that can change without needing extensive renovations, design for disassembly to avoid demolition waste, and create a deconstruction plan from the start. Regulation has an important role to play in supporting these practices. • Set-up salvage for success. Cities can support salvage practices by requiring salvage plans during the building permitting phase and otherwise incentivizing the practice. Buildings can develop salvage inventories from the start that can make it easier to reuse or save equipment and materials throughout the life of the space. • Scale and diversify the deconstruction workforce. Local jurisdictions can require ‘salvage-ready’ contractors for commercial projects and should support workforce training in deconstruction as a specific growth skill. • Strengthen the regional reuse marketplace. There are a number of ways to strengthen the reuse market and support the circular economy of commercial buildings, including setting salvage targets, embracing virtual salvage marketplaces, and requiring salvage during public project procurement. Electronic waste Electronic waste (e-waste) is one of the world’s fastest growing waste streams. In 2019, only 17% of e-waste was recycled globally, according to Statistica. The rest often ends up in landfills, is improperly disposed of in the environment, or ‘hibernates’ — the practice of keeping a product that is no longer in active or regular use — in our homes. This practice limits the ability to recycle usable materials and e-waste, meaning that more new resources must be consumed to create new products. In 2021, we conducted an assessment of why consumers engage in product hibernation instead of recycling and identified the following areas of opportunity10 (it should be noted that there are usually multiple factors in a decision to hibernate a product, and that the key factors differ by product, so pursuing all of these areas is critical to maximize electronic recycling): • Low handoff-option awareness or convenience. Consumers may lack information about proper recycling methods or facilities or find that option inconvenient. Google is working to address this problem through Maps and Search programmes (described earlier) that help identify and access local e-waste recycling options. • Compensation expectations (financial or social). Consumers often expect compensation for their e-waste, although this exchange can be social in nature, taking the form of product donations. • Keeping spare products. Consumers often keep old products in case they need to replace a broken one. Stronger repair programmes can help, such as our programme for the Google Pixel described earlier. • Data retrieval and removal. Consumers often hold on to products because they lack easy or reliable ways to transfer or erase data from the devices. • Device nostalgia. Consumers often feel an emotional attachment to their devices, which causes reluctance to part with them. Figure 4. Search ‘battery recycling near me’. Google Maps and Search now make it easier for people to find places near them that recycle a variety of goods, such as batteries, eletronics and glass Challenges ahead We are excited by the progress made by Google’s circularity programme to date, as well as by the opportunities on the horizon. We also recognize the many systemic challenges hindering even greater progress — some of which we identify below. Overcoming these and other barriers will be critical to realizing the circular economy as soon as possible. Improving data availability The circular economy aims to make the most of every resource we use. To do that requires high-quality, standardized data enabling the market to identify, manage and value all the resources available at any given time. For example, rather than seeing a piece of plastic as an item to use and discard, we should see it as bits of information that tell us how it can be reused, what it is worth in terms of recycling, and where it is needed. Such data should inform capital investments, infrastructure priorities, business plans, policy interventions and more — as such, we view data availability as a key to accelerating the transition toward the circular economy. This challenge is one we feel particularly inspired to help solve as a data company, working alongside others. Scaling innovation The circular economy is in a similar place to where renewable energy was a few decades ago: we knew where we needed to go but often lacked the right technologies to help companies, governments and households get there in a cost- competitive way. Innovation helped bridge that gap, with the rise of advances such as new silicon systems to capture sunlight, larger wind turbines to capture energy and longer- lasting batteries to power electric vehicles. We need similar innovation around the way products and materials are designed, manufactured, used, reused, or recycled back into the economy. We need accelerators, venture funding and other forms of support focused on turning great circularity ideas into leading technologies. We plan to leverage Google’s ingenuity, technical leadership, cultural influence and talented people to help do just that. Embracing the future Meeting this moment demands a spirit of exploration and discovery. In nature’s circular system, it is the novel adaptations that pave a new path. Similarly, we need innovative thinkers to inspire a shared sense of purpose around this new direction and rally collective action. For our part, we can help by connecting billions of people every day and sharing our own lessons and experiences. Moving forward together The circular economy, by definition, connects everyone. It is in that spirit of cooperation that we describe the approach Google is currently taking, recognizing that we do not have all the solutions and that true progress will span the global economy. We need business leaders to partner across industries and reduce costs, governments to incentivize action and protect the public good, innovators to keep looking ahead and thinking big, and people everywhere to know that no action is too small.","filter_flag":1}
{"title":"Aquafil – Helping Define the Circular Business Model of the Future","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d1fa985464c91a7e8bc20539731&url=https%3a%2f%2fmarkets.businessinsider.com%2fnews%2fstocks%2faquafil-helping-define-the-circular-business-model-of-the-future-1033493400&c=15437159718050761386&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d1fa985464c91a7e8bc20539731&url=https%3a%2f%2fmarkets.businessinsider.com%2fnews%2fstocks%2faquafil-helping-define-the-circular-business-model-of-the-future-1033493400&c=15437159718050761386&mkt=en-us","summary":"Aquafil SpA (ECNLF:OTCQX – ECNL:IM), based in Arco (TN) Italy and a pioneer of the circular economy, believes now is the time for business leaders to make a radical shift. If we are to continue ...","published":"Thu, 20 Jun 2024 08:13:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=20, tm_hour=8, tm_min=13, tm_sec=0, tm_wday=3, tm_yday=172, tm_isdst=0)","news_source":"Business Insider","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Aquafil – Helping Define the Circular Business Model of the Future","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Aquafil SpA (ECNLF:OTCQX – ECNL:IM), based in Arco (TN) Italy and a pioneer of the circular economy, believes now is the time for business leaders to make a radical shift. If we are to continue ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Circular Design\" \"new products\"&format=rss","text":"ARCO, Italy, June 20, 2024 (GLOBE NEWSWIRE) -- Aquafil SpA (ECNLF:OTCQX – ECNL:IM), based in Arco (TN) Italy and a pioneer of the circular economy, believes now is the time for business leaders to make a radical shift. If we are to continue driving toward a circular economy, businesses must think beyond how they can create circular products and also begin developing and adopting circular business models. There is especially an opportunity for this shift within the interior design and architecture space, where products and materials are frequently used and switched out. The common business model in today’s design industry still struggles to create with the end in mind: spaces are created to be used for a specific purpose and not optimized to be re-used again. Research from LMN Architects recently discovered that this cycle of waste has built a cumulative carbon impact that is even greater than the emissions generated by the structure of the building itself. By transitioning to innovative business models with a circular focus, design businesses will still be able to share important products with customers while reducing resource extraction on one end and waste buildup on the other. Some of the circular business models of the future that we’re starting to see are products as services, product use extension and take-back programs. Products as Services One of the latest innovative business models we’re seeing is one where items that were typically sold as products are now being sold as services. The Ellen MacArthur Foundation highlights a few organizations practicing this model, from lighting-as-a-service, where customers pay a monthly fee for light while the business manages the installation, operation and maintenance of the lighting systems, to furniture-as-a-service, where customers pay a monthly fee for furniture and return it when no longer needed. These service models enable customers to keep up with the latest and greatest products without contributing to waste. Businesses are able to take back the products when they start to wear and tear or the customer no longer needs them, finding ways to reuse the materials or get them ready for a new customer. The success of the business changes from volume to performance, therefore extending the life of the product. This mindset shift will also mean a shift in the way products are designed, as designers and manufacturers are incentivized to create products that are longer lasting and use ingredients that withstand wear and tear for longer. Businesses that turn to the product as a service model will have to consider the durability and impact of the materials they work with in a way they hadn’t before. Product Use Extension Another circular business model explores opportunities to extend the life of a product after its use. In the architecture and construction space, this can mean finding ways to renovate existing spaces with existing materials rather than bulldozing and starting fresh. A recent Bloomberg article highlights how the U.S. economy is already moving in this direction as renovations have overtaken new construction in architectural billings for the first time in 20 years. Architects are typically inspired to create something new, but there needs to be a shift in excitement to transform older buildings just as well, especially with a circular mindset. Not only does it create more carbon emissions when we build a new structure, there are also outdated energy systems and embodied carbon within materials of older buildings that contribute nearly 40% of total global greenhouse gas emissions, according to the Global Alliance for Building and Construction. Architects have the opportunity and responsibility to apply circular design principles to already built environments in order to combat these issues and extend the life of their products: in this case, buildings. For interior design, product use extension can mean creating modular products that can easily be taken apart. Take-Back Programs Take-back programs will likely be the easiest transition for traditional business models into more circular practices, although they will require innovative logistics. Often, organizations with this model have developed a way to reutilize the materials from used products to create new products, enabling the business to rely less on resource extraction. It also tends to build a strong loyalty with customers who have an incentive to continue buying products, knowing they will either be able to trade it in for a newer model or receive a payment of some kind. The take-back model has already been adopted within the fashion industry, especially with businesses that are already using recycled and regenerated ingredients in their design. However, there is an opportunity for the design industry to also utilize this model. For example, Aquafil’s carpet recycling centers have provided Aquafil a way to take back nylon-based products like carpet and fabric scraps that would otherwise end up in landfills to create ECONYL® regenerated nylon. In states like California and now New York with carpet recycling laws, businesses are even incentivized to recycle their carpet, benefitting the recycler, the business receiving the recycled materials as well as the environment. Building a Circular Business Model Moving from a linear to a circular economic model brings multiple benefits, including the reduction of pressure on the environment, the optimization of the availability of raw materials and an inevitable boost to innovation and economic growth. The companies that lead the way with circular business models have given us an example of what is possible and an inspiring hope for our future economy. Over 10 years ago Aquafil recognized the virtue and value of the Circular Economy and eco-design. Since then, the Company has invested hundreds of millions of Euros in developing technologies and building facilities to produce an infinitely recyclable version of Nylon 6: ECONYL® regenerated nylon. The latter maintains the same quality level and performance as standard nylon, has the same wearing features as material from fossil fuel and can help you closing the loop. Today, Aquafil generates over 52% of its fibers revenues from the ECONYL® regeneration products (1Q 2024 revenues amounted to Euro 147.5 mln). The goal is to continually increase this proportion targeting 60% to 2025. About Aquafil SpA Since 1965, the Aquafil Group has been a pioneer of the circular economy and a landmark in terms of quality and product innovation for Italy and the globe. We primarily manufacture Nylon 6 fibers and polymers but also Nylon 6.6 and Dryarn. Our flagship product is ECONYL® nylon, which revolutionizes the world of synthetic fibers through a closed-loop model. Today, Aquafil remains a leader in the research of new production systems for sustainable development. To keep current on Aquafil, please go to www.aquafil.com. Investors Contact Giulia Rossi investor.relations@aquafil.com mob: +39 327 0820.268 Media Contact Maria Giovanna Sandrini maria.giovanna.sandrini@aquafil.com mob: +39 348 6019.628 U.S. Contact: Joe Hassett joeh@gregoryfca.com 610-787-0464 (Cell)","filter_flag":1}
{"title":"Design issues concerning circular economy assessment methods at the product level: a comparative analysis through a case study of a mobile tiny house","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d1fa985464c91a7e8bc20539731&url=https%3a%2f%2fwww.cambridge.org%2fcore%2fjournals%2fdesign-science%2farticle%2fdesign-issues-concerning-circular-economy-assessment-methods-at-the-product-level-a-comparative-analysis-through-a-case-study-of-a-mobile-tiny-house%2f574CAB9C8D518B39FE49F37FB4B13040&c=527733255400871501&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d1fa985464c91a7e8bc20539731&url=https%3a%2f%2fwww.cambridge.org%2fcore%2fjournals%2fdesign-science%2farticle%2fdesign-issues-concerning-circular-economy-assessment-methods-at-the-product-level-a-comparative-analysis-through-a-case-study-of-a-mobile-tiny-house%2f574CAB9C8D518B39FE49F37FB4B13040&c=527733255400871501&mkt=en-us","summary":"This can be seen from the results obtained in the Circularity Calculator, The Circular Economy Toolkit, the CN_Con, the Circular Spidermap and the Circular Design Tool, since all of them consider ...","published":"Wed, 05 Jun 2024 05:04:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=5, tm_hour=5, tm_min=4, tm_sec=0, tm_wday=2, tm_yday=157, tm_isdst=0)","news_source":"Cambridge University Press","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Design issues concerning circular economy assessment methods at the product level: a comparative analysis through a case study of a mobile tiny house","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"This can be seen from the results obtained in the Circularity Calculator, The Circular Economy Toolkit, the CN_Con, the Circular Spidermap and the Circular Design Tool, since all of them consider ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Circular Design\" \"new products\"&format=rss","text":"3. Case study and methodology This work was developed in the context of the Tiny FOP Mob Project (see details in the Acknowledgments). Within this project, a prototype of a tiny house (Figure 1) was developed with the purpose of serving as a real-world laboratory in five locations of the Venosta Valley, Italy (Nezzi et al. Reference Nezzi, Ruiz-Pastor, Altavilla, Berni and Borgianni2022). One of the purposes of the tiny house was to bring science and society closer with an emphasis on sustainability issues. In this context, the prototype of the tiny house was designed and made with sustainable materials to the largest possible extent. More in details, the used materials were: • hemp bricks (load-bearing walls) (Figure 2), • spruce wood (frame, beams and screed), • larch wood (floor, false ceiling and external cladding), • natural mortar (bricks assembly), • hemp fiber and natural hydraulic lime (interior surface finishing) and • others (galvanized titanium for the roof and vapor barrier made of wood fiber). The tiny house prototype has a 25 square meters area and a weight of 12 tons. Despite tiny houses are known to be possible icons of social movements, which largely resonates with the scopes of the mentioned project, the aspects closely concerning CE (and its corresponding assessment methods) are considered here only, that is, the environmental dimension turned to be predominant in the analyses that follow. All the required data to assess the circularity of the tiny house were collected through semi-structured interviews with the project partners, the manufacturer and material providers of the prototype, as well as from the literature. After data were collected, the most relevant methods to assess CE in literature were selected and applied to the tiny house. The method selection was based on a literature investigation and search for nonacademic, yet established, CE assessment tools. All the nano-level CE assessment tools identified for the scope of this study were: • validated or accepted in the literature, • clearly described or providing online tools for the assessment of circularity so to be straightforwardly applied in the present work and • the ones providing a specific result for circularity (either with a single variable or with the combination of few variables). The identification of pertinent tools was supported by the recent overviews of nano-level circularity assessment methods (Ruiz-Pastor et al. Reference Ruiz-Pastor, Chulvi, Mulet and Royo2022; Cardoso Chrispim et al. Reference Cardoso Chrispim, Mattsson and Ulvenblad2023). Six tools, which are summarized in Figure 3, complied with the requirements above and they were applied to the tiny house prototype. In the next subsections, the application of the different methods is shown. 3.1 Circularity Calculator This tool, developed by Ellen MacArthur Foundation and IDEAL&CO (2020), evaluates the circularity of a product or service through several parameters regarding all life stages. It is a web platform with different parameters to be assessed. Specifically, the parameters to introduce in the web tool are shown in Figure 4, which are presented along the data pertaining to the tiny house. The tool is acknowledged in the literature and employed in other works such as de Pascale et al. (Reference De Pascale, Arbolino, Szopik-Depczyńska, Limosani and Ioppolo2021) or Roos Lindgreen et al. (Reference Roos Lindgreen, Mondello, Salomone, Lanuzza and Saija2021). The tool provides three CE-related parameters beyond circularity, namely value capture, recycled content and reuse index. The result obtained with the Circular Economy Calculator shows that the circularity of the tiny house is 40%. 3.2 Circular Economy Toolkit The Circular Economy Toolkit (Evans & Bocken Reference Evans and Bocken2013) is a free web tool, which measures the circularity of a product or service through 33 parameters. These parameters are subdivided into seven categories: • design, manufacture and distribute, • usage (by the costumer), • repair\/maintenance of the product, • reuse\/redistribution of the product, • remanufacturing\/refurbishment of product or part, • product as a service and • product recycling at the end of life. Each of the parameters within the categories is evaluated through a slide bar with three different positions. The tool provides as a result a graph, which shows the potential improvement for each category. In order to achieve a numerical value, the three possible positions of the slide bar have been converted to a three-point Likert scale, quantifying them as a 0, 1 or 2 points and summed up to obtain a final score (Figure 5). For the sake of convenience, ordered variables have been used as continuous ones here and whenever required. The results show that the tiny house has a circularity of 35 out of 66, being 66 the least circular. This means that the tiny house is 47% circular according to the Circular Economy Toolkit. 3.3 Combination of circularity, novelty and concepts The metric developed to assess the combination of circularity, novelty and concepts was developed by Ruiz-Pastor et al. Reference Ruiz-Pastor, Altavilla, Nezzi, Borgianni and Orzes2022 and designated as CN_Con. It evaluates the circularity and the novelty as a whole in product concepts. The metric covers all the parameters regarding CE that can be considered in the conceptual design stage. The CE is calculated in two steps: the first one concerns the strategies for durability the product follows. In a second step, the evaluation regards the origin of the raw materials and the destination of the different components and materials in the end of life of the product. In the case of the tiny house assessed, only one of the 10 strategies proposed by the tool is applied, design for social innovation (2.89 points in the tool). On the other hand, new materials are used to manufacture the prototype (0 points in the tool), but these materials are recoverable (4.3 points in the tool). Accordingly, the circularity score of the tiny house is 6.36 out of 10 points. In order to make the result comparable with the other methods, the final score has been normalized and calculated as a percentage of circularity, namely 63.6%. 3.4 Metric for quantifying product-level circularity This metric (Linder, Sarasini & van Loon Reference Linder, Sarasini and van Loon2017) evaluates the circularity of products only in terms of cost of recirculated parts. In the equation, the scholars propose a numerical value is obtained as the ratio between the economic value of recirculated parts and the economic value of all parts. In the case of the tiny house studied, there are no recirculated parts in the manufacturing of the product. Therefore, the circularity of the tiny house is 0% in this case. 3.5 Circular Spidermap This tool (Van den Berg and Bakker, Reference Van den Berg and Bakker2015) evaluates circularity according to product aspects regarding its lifetime, the maintenance and the recycling. Specifically, the parameters evaluated are • future proof, • disassembly, • maintenance, • remake and • recycle. The product evaluated is assigned one of four possible values for each parameter. In the case of the tiny house, the parameters have been converted to a four-point Likert scale, quantifying them as 1, 2, 3 or 4 points, being 4 the most circular. The results are shown in Figure 6. As in the other cases, the circularity score was calculated. In this case, a maximum score in the parameter (4) is equal to 100% circularity and the minimum score (1) is 25% circularity (the score 0 is not foreseen in this method). The final percentage of circularity is the average of all the parameters, which results in 65% for the present case study. 3.6 Circular Design Tool When applying this tool (Moreno, Ponte & Charnley Reference Moreno, Ponte and Charnley2017), parameters about the life cycle, resource conservation and user and product development are assessed. A circularity index is calculated according to different parameters and an importance factor (provided by the tool itself). The score varies between 0 and 787.5, being the largest value the most circular. In the case of the tiny house, the score obtained after assessing all the parameters is 318.2. In Figure 7, the scores for each parameter are reported. The normalized score has been calculated by means of ratio: it is 40.41% of circularity. 4. Comparison results After applying the methods, a circularity percentage for the tiny house has been obtained for each method. The final normalized scores are summarized in Figure 8 to ease comparisons. As it is shown, in six out of the seven methods, the circularity scores range between 40 and 65%. In the case of the metric developed by Linder et al. (Reference Linder, Sarasini and van Loon2017), the circularity is clearly affected by the peculiar factors used for the assessment, which differ substantially with respect to the other tools. In Linder et al. (Reference Linder, Sarasini and van Loon2017), only costs are considered, which leads to a result of no circularity, since the other CE-related features of the tiny house prototype are neglected. As the importance of considered variables emerge here, the domains of variables dealt with in each of the employed CE assessment tools is illustrated in Figure 3. According to Figure 3, the most common variables are within materials optimization, lifetime and maintenance, each present in five methods. The least diffused variables are the ones concerning to issues arguably ascribable to CE, such as the product specifications, the novelty and the system design or users; each of these variables are used in one of the methods only. On the other hand, most of the methods consider five variables. The Circularity Calculator (15) and the Circular Economy Toolkit (33) are the methods using the most indicators. As mentioned, the metric for quantifying product-level circularity, instead, uses one indicator only. 5. Discussion The results obtained with the assessment tools are consistent according to the main features and materials of the tiny house evaluated, since the house is built with sustainable materials but, for example, end-of-life actions were not focused on in the design of the tiny house. The results underline the need of integrating the CE concepts in all the stages of the design, manufacturing, use and end-of-life of buildings in general, and of the tiny house in particular. Thus, the fair circularity of the prototype is mostly due to its sustainable materials used for its construction, which is obviously one of its strengths. This can be seen from the results obtained in the Circularity Calculator, The Circular Economy Toolkit, the CN_Con, the Circular Spidermap and the Circular Design Tool, since all of them consider variables related to materials. To improve the overall circularity of the tiny house, a possibility would be to manufacture it with recirculated materials; this issue is stressed in the tools considering the starting materials, which are, again, all the tools except the metric for quantifying product-level circularity. In addition, a strong possible improvement would be designing the tiny house for easy disassembly and repair, in line with the CE actions considered in the Circularity Calculator, Circular Economy Toolkit, the CN_Con, the Circular Spidermap and the Circular Design Tool. This evidence supports that not only are circularity scores comparable but also that the priority actions to align with CE are substantially consistent. This can be justified by the similarity of the set of variables used to calculate circularity, as made more apparent below. The tools applied mostly focus on the usage and maintenance of products, followed by the material quantity and the lifetime. Other variables considered are the design and manufacturing of the products, the costs, the recycling of materials or the general environmental impact. The possibility of implementing product–service features in the products is considered in two assessment methods (Evans & Bocken Reference Evans and Bocken2013; Ruiz-Pastor et al. Reference Ruiz-Pastor, Altavilla, Nezzi, Borgianni and Orzes2022). Also, other aspects are considered, such as the novelty of the products (Brezet & van Hemel Reference Brezet and van Hemel1997; Ruiz-Pastor et al. Reference Ruiz-Pastor, Altavilla, Nezzi, Borgianni and Orzes2022). This can contribute to evaluate in a more comprehensive way products and concepts, since novelty and creativity are crucial to fulfill CE-related requirements (Golinska et al. Reference Golinska, Kosacka, Mierzwiak and Werner-Lewandowska2015). Furthermore, the sustainability of the materials must be matched with the right behavior at the end of life of the buildings. There could be the need of incentivizing the users and\/or dismantling companies to ensure the most sustainable products’ end of life. This issue is not only a matter of design, but it also involves educating the users and manufacturers in a sustainable use of products and materials.","filter_flag":1}
{"title":"Contour chair by Pearson Lloyd for Senator","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d1fa985464c91a7e8bc20539731&url=https%3a%2f%2fwww.dezeen.com%2f2024%2f05%2f24%2fcontour-chair-pearson-lloyd-senator-dezeen-showroom%2f&c=18025291054270242028&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d1fa985464c91a7e8bc20539731&url=https%3a%2f%2fwww.dezeen.com%2f2024%2f05%2f24%2fcontour-chair-pearson-lloyd-senator-dezeen-showroom%2f&c=18025291054270242028&mkt=en-us","summary":"Dezeen Showroom: British studio Pearson Lloyd applied circular design principles when creating Contour, a versatile chair made from recycled and recyclable materials for office furniture company ...","published":"Thu, 23 May 2024 17:01:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=5, tm_mday=23, tm_hour=17, tm_min=1, tm_sec=0, tm_wday=3, tm_yday=144, tm_isdst=0)","news_source":"Dezeen","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Contour chair by Pearson Lloyd for Senator","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Dezeen Showroom: British studio Pearson Lloyd applied circular design principles when creating Contour, a versatile chair made from recycled and recyclable materials for office furniture company ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Circular Design\" \"new products\"&format=rss","text":"Dezeen Showroom: British studio Pearson Lloyd applied circular design principles when creating Contour, a versatile chair made from recycled and recyclable materials for office furniture company Senator. The Contour task chair is distinguished by its simplicity – rather than using complex mechanics, it aims to provide automatic ergonomic comfort for a wide range of bodies, on the basis that the same chair is often used by many different people within today's dynamic workplaces. Adaptable rather than adjustable, the Contour chair has a flexible, sculpted backrest made from a single piece of plastic, along with a cushioned seat. Pearson Lloyd designed the chair to align with circular economic principles – meaning that all of its materials should be able to be kept in a closed loop with nothing going to landfill. The backrest is made purely of recycled polypropylene plastic, while the removable seat and backrest covers are also available in 100 per cent recycled fabric. This approach also means that Contour is designed for longevity, with all parts able to be easily repaired. A choice of base options are available, including a swivel base with a tilt mechanism, which is recommended for longer periods of desk work. Product details: Product: Contour Designer: Pearson Lloyd Brand: Senator Contact: [email protected] Dezeen Showroom Dezeen Showroom offers an affordable space for brands to launch new products and showcase their designers and projects to Dezeen's huge global audience. For more details email [email protected]. Dezeen Showroom is an example of partnership content on Dezeen. Find out more about partnership content here.","filter_flag":1}
{"title":"Best Bluetooth Speaker for 2024","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d1fa985464c91a7e8bc20539731&url=https%3a%2f%2fwww.cnet.com%2ftech%2fhome-entertainment%2fbest-bluetooth-speaker%2f&c=3765598967969140431&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d1fa985464c91a7e8bc20539731&url=https%3a%2f%2fwww.cnet.com%2ftech%2fhome-entertainment%2fbest-bluetooth-speaker%2f&c=3765598967969140431&mkt=en-us","summary":"PC speakers Credentials CNET’s expert staff reviews and rates dozens of new products and services each month, building on more than a quarter century of expertise.","published":"Wed, 19 Jun 2024 05:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=19, tm_hour=5, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=171, tm_isdst=0)","news_source":"CNET","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Best Bluetooth Speaker for 2024","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"PC speakers Credentials CNET’s expert staff reviews and rates dozens of new products and services each month, building on more than a quarter century of expertise.","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Circular Design\" \"new products\"&format=rss","text":"Tribit XSound Go: Despite being on the market for several years, the Tribit XSound Go remains one of the top Bluetooth speakers for the money. Besides sounding decent for streaming your favorite music and more, this affordable Bluetooth speaker is also fully waterproof. It has had some small upgrades over the years. JBL Pulse 5: JBL's Pulse speaker is now in its fifth generation, and both the sound quality and 360-degree light show have been improved. JBL has \"expanded the transparent outer body\" so the customizable light show (there's a companion app for iOS and Android that allows you to alter the colorful lighting effects) looks more impressive. The speaker is also IP67 dustproof and waterproof, and it offers up to 12 hours of battery at moderate volume levels. Anker Motion Boom: Anker's more expensive Soundcore Motion Boom Plus (see above) is a substantial sound upgrade over the original Motion Boom but this model remains a very good mini boom box for the money. Equipped with a handle and weighing a little over 4 pounds, the speaker reminds me of one of those giant flashlights or \"floating lanterns\" that were in vogue about 30 years ago. For the record, the Motion Boom actually does float and is fully waterproof with an IPX7 rating. UE Hyperboom: Ultimate Ears' Boom Bluetooth speakers come in a few different sizes, but none of them are as big as the Hyperboom. A supersize wireless speaker that tips the scales at a hefty 13 pounds, the Hyperboom makes the UE Megaboom 3 look unquestionably puny. It's not cheap, but its sound quality is better than a lot of the jumbo portable speakers on the market right now. Read our review. Marshall Willen: Marshall's little mono Willen speaker is similar to Bose's SoundLink Micro and other micro speakers like the Tribit StormBox Micro 2. Also like those speakers, it has an integrated strap on its base so you can clip it onto a backpack or even to your bike's handlebars. Its 2-inch full-range driver and two passive radiators put out more sound than you'd think it would for its tiny size, and it offers decent clarity as well as just enough bass to avoid sounding tinny (you can choose from three preset sound modes). Tribit StormBox: The StormBox looks like a cross between a UE and a JBL speaker. We suspect that's not an accident. This fully waterproof speaker costs about significantly less than the JBL Flip 5 and Flip 6 and produces a bigger sound. Its rechargeable battery offers up to 20 hours of battery life for playing music and more. Tribit's XSound speakers are probably a better value, but the StormBox is more stylish. Bang & Olufsen Beosound A1 (2nd Gen): A couple of years ago, Bang & Olufsen upgraded its dome-shaped aluminum-clad A1 speaker with improved battery life, better speakerphone performance (it now has a three-microphone array) and slightly improved sound. It's not only the smallest wireless speaker from the Danish company, it's technically the most affordable. Sonos Roam: Available in white or black for $179, the Roam is currently the smallest and most affordable Sonos speaker (if you don't count those $99 Sonos-compatible Symfonisk Ikea Wi-Fi bookshelf speakers), although it's fairly expensive for a mini wireless speaker. This Sonos Roam model, like the bigger Sonos Move 2 portable speaker, is equipped with both Bluetooth and Wi-Fi and can tap into an existing Sonos multiroom audio system and link with other Series 2-compatible Sonos speakers. Bose SoundLink Micro: Although a little pricey and due to be upgraded, the Bose SoundLink Micro sounds remarkably decent for its tiny size, delivering more bass than other pocketable speakers. It's a fully waterproof Bluetooth speaker and is available in three color options, although the blue version appears to be hard to find. Anker Soundcore Motion Plus: Anker's Soundcore Motion Plus came out in 2019, but it remains one of the best-sounding speakers for around $100. It's larger than many mini Bluetooth speakers, but it's still compact. It manages to sound quite a bit fuller than much of the competition in its price range, with bigger bass, more volume and better clarity. It's also fully waterproof (IPX7-rated) and has support for the aptX streaming codec for devices like Samsung's Galaxy phones that support it. Bang & Olufsen Beosound Explore: While it's a little overpriced for the sound quality it ultimately delivers, the Beosound Explore is a very good little speaker that has a sleek, eye-catching design, is fully waterproof and dustproof (IP67 rating), and offers excellent battery life, with up to 27 hours of music listening at moderate volume levels. Monoprice Soundstage 3: Monoprice tends to make pretty generic-looking electronic products, and its understated Soundstage 3 Bluetooth speaker probably isn't going to wow you with its design although its minimalist aesthetic has its appeal. I wouldn't buy this speaker at its list price of $250, but it's often discounted to closer to $150, where it's a good value thanks to its ability to play big sound with strong bass and decent clarity, with 50 watts of power that drives a 5.25-inch \"concave aluminum cone woofer\" flanked by two 1-inch silk-dome tweeters. It also has good connectivity options, including digital optical, 3.5mm analog and RCA analog wired inputs that allow you to connect your television or another stereo component. There's also a sub-out port. Tribit XSound Mega: Over the last few years, Tribit has made several Bluetooth speakers that deliver a lot of boom for the buck. Add its new XSound Mega to the list. Tribit is billing the XSound Mega as more of an outdoor speaker -- a lanyard is included for toting it around as a sort of mini boombox -- but it works just fine indoors. It has an LED light show that you can turn on or off and there are three EQ settings for sound: XBass, Music and Audiobook. Additionally, it can be used as a power bank to charge your mobile devices.","filter_flag":1}
{"title":"Target talks turning old car seats into adorable storage crates — and the future of its Target Zero initiative","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d1fa985464c91a7e8bc20539731&url=https%3a%2f%2fwww.yahoo.com%2fnews%2ftarget-talks-turning-old-car-054500570.html&c=16530637385539846456&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d1fa985464c91a7e8bc20539731&url=https%3a%2f%2fwww.yahoo.com%2fnews%2ftarget-talks-turning-old-car-054500570.html&c=16530637385539846456&mkt=en-us","summary":"And, Breen said, the company is using the car seats to create new products, including storage crates for Target's home goods brand, Brightroom. Now, the company is looking to see where else it can ...","published":"Thu, 13 Jun 2024 17:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=13, tm_hour=17, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=165, tm_isdst=0)","news_source":"Yahoo","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Target talks turning old car seats into adorable storage crates — and the future of its Target Zero initiative","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"And, Breen said, the company is using the car seats to create new products, including storage crates for Target's home goods brand, Brightroom. Now, the company is looking to see where else it can ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Circular Design\" \"new products\"&format=rss","text":"Target talks turning old car seats into adorable storage crates — and the future of its Target Zero initiative You've heard \"Expect more, pay less.\" Now get ready for Target's newest catchphrase: \"More joy, less waste.\" In a recent discussion at the Sustainable Brands' Brand-Led Culture Change conference, Jason Breen, Target's senior director of owned product innovation, laid out what makes Target's sustainability strategy unique — beyond the Marie Kondo vibes. Here are a few of the key ingredients to Target's holistic sustainability goals: 1⃣ The biggest trade-in event of the year isn't for cars — it's for car seats Since 2016, Target has been solving a pain point for sleep-deprived parents nationwide by incentivizing a way to get rid of car seats responsibly. \"We didn't stop with how to get rid of it,\" Breen said, \"but we also added a moment of joy by adding a 20% off the next car seat or baby product.\" Almost 30 million pounds worth of car seat materials end up in American landfills every year — partly because car seats have expiration dates after which manufacturers can't guarantee they will reliably protect kids. Car seats are also made of a ton of different components, making it harder to reuse the parts. Offered for a few weeks each year, Target's car seat return program has become the company's No. 1 consumer-facing sustainability initiative, according to Breen. So far, it has recycled over 2.6 million car seats, or nearly 40 million pounds' worth — and those numbers don't yet include this spring's campaign. And, Breen said, the company is using the car seats to create new products, including storage crates for Target's home goods brand, Brightroom. Now, the company is looking to see where else it can engage guests in similar behaviors. For example, it's testing a shoe take-back program in a couple of stores, responding to a common concern for customers that has even led to an unrelated startup company called GotSneakers. \"I feel like I shouldn't throw them in the garbage, but I'm not sure what to do with them,\" Breen said, acknowledging that many customers feel the same way. 2⃣ Doubling down on products that go full circle Breen says one way Target is looking to create an \"equitable, sustainable future\" is through circularity — when companies design products to be reused for as long as possible to reduce waste. By 2040, Breen says 100% of Target's nearly 50 \"owned brands\" will be circular by design. And by next year, Breen announced that two Target-owned brands will fall into that camp: Universal Thread and Everspring. That means they'll look to eliminate waste \"using materials that are regenerative, recycled, or sourced sustainably — to create products that are more durable, easily repaired, or recyclable,\" according to Target's sustainability goals. For example, some Universal Threads clothing is already being made with yarn blended with fibers collected from used garments and manufacturing scraps, including this crewneck T-shirt and this cami, developed in partnership with the nonprofit Accelerating Circularity, according to the retailer's website. Universal Thread clothing will also feature a \"digital product passport\" so customers can scan a QR code to get information about what the product is made of as well as learn how to improve the lifespan of their products and engage in other sustainable behaviors. Target says it's also trained more than 3,000 team members and 1,000 vendor employees in these circular design principles over the past six years, using a web-based hub and a calculator that helps the team assess the impact of certain materials. 3⃣ Making zero a good thing Back to those \"more joy, less waste\" vibes: Breen walked through Target's goal to ultimately replace single-use packaging for its products. \"Target Zero is an initiative that delivers products that either reduce packaging significantly or eliminate it completely,\" Breen said. Target now has a curated collection of products — in-house brands as well as vendors such as Burt's Bees and Pacifica beauty products — that use packaging designed to be more sustainable. That means they are refillable, reusable, compostable, or made from recycled materials that reduce the use of plastic. All such products have the Target Zero icon on them to highlight the initiative. Bottom line Instead of making sustainability a separate strategy at Target, Breen says, it's integrated into all aspects of the business — from car seat recycling to circular products to reduced packaging. And as for achieving the holy grail of sustainability? Breen framed it as: \"How can we continue to deliver the promise of affordability to the guest while providing them with sustainable alternatives?\" �� For more profiles like this one, sign up for TCD's free Business Edition newsletter. It'll give you the edge you need on business and the clean economy. Join our free newsletter for cool news and actionable info that makes it easy to help yourself while helping the planet.","filter_flag":1}
