{"title":"Global Thermostat unveils design with top engineering firms for a Direct Air Capture system that can scale to capture ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi2wFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dsb2JhbC10aGVybW9zdGF0LXVudmVpbHMtZGVzaWduLXdpdGgtdG9wLWVuZ2luZWVyaW5nLWZpcm1zLWZvci1hLWRpcmVjdC1haXItY2FwdHVyZS1zeXN0ZW0tdGhhdC1jYW4tc2NhbGUtdG8tY2FwdHVyZS1taWxsaW9ucy1vZi10b25uZXMtb2YtY2FyYm9uLWRpb3hpZGUtcGVyLXllYXItMzAyMDExNzAwLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi2wFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dsb2JhbC10aGVybW9zdGF0LXVudmVpbHMtZGVzaWduLXdpdGgtdG9wLWVuZ2luZWVyaW5nLWZpcm1zLWZvci1hLWRpcmVjdC1haXItY2FwdHVyZS1zeXN0ZW0tdGhhdC1jYW4tc2NhbGUtdG8tY2FwdHVyZS1taWxsaW9ucy1vZi10b25uZXMtb2YtY2FyYm9uLWRpb3hpZGUtcGVyLXllYXItMzAyMDExNzAwLmh0bWzSAQA?oc=5","id":"CBMi2wFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dsb2JhbC10aGVybW9zdGF0LXVudmVpbHMtZGVzaWduLXdpdGgtdG9wLWVuZ2luZWVyaW5nLWZpcm1zLWZvci1hLWRpcmVjdC1haXItY2FwdHVyZS1zeXN0ZW0tdGhhdC1jYW4tc2NhbGUtdG8tY2FwdHVyZS1taWxsaW9ucy1vZi10b25uZXMtb2YtY2FyYm9uLWRpb3hpZGUtcGVyLXllYXItMzAyMDExNzAwLmh0bWzSAQA","guidislink":false,"published":"Mon, 11 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=11, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=345, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi2wFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dsb2JhbC10aGVybW9zdGF0LXVudmVpbHMtZGVzaWduLXdpdGgtdG9wLWVuZ2luZWVyaW5nLWZpcm1zLWZvci1hLWRpcmVjdC1haXItY2FwdHVyZS1zeXN0ZW0tdGhhdC1jYW4tc2NhbGUtdG8tY2FwdHVyZS1taWxsaW9ucy1vZi10b25uZXMtb2YtY2FyYm9uLWRpb3hpZGUtcGVyLXllYXItMzAyMDExNzAwLmh0bWzSAQA?oc=5\" target=\"_blank\">Global Thermostat unveils design with top engineering firms for a Direct Air Capture system that can scale to capture ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Global Thermostat unveils design with top engineering firms for a Direct Air Capture system that can scale to capture ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi2wFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dsb2JhbC10aGVybW9zdGF0LXVudmVpbHMtZGVzaWduLXdpdGgtdG9wLWVuZ2luZWVyaW5nLWZpcm1zLWZvci1hLWRpcmVjdC1haXItY2FwdHVyZS1zeXN0ZW0tdGhhdC1jYW4tc2NhbGUtdG8tY2FwdHVyZS1taWxsaW9ucy1vZi10b25uZXMtb2YtY2FyYm9uLWRpb3hpZGUtcGVyLXllYXItMzAyMDExNzAwLmh0bWzSAQA?oc=5\" target=\"_blank\">Global Thermostat unveils design with top engineering firms for a Direct Air Capture system that can scale to capture ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"This represents a quantum leap in how much carbon dioxide our customers can remove from the atmosphere for their needs. Post this The U.S. Department of Energy awarded funding in 2021 to develop an initial engineering design for a Direct Air Capture carbon dioxide removal system with an annual capacity of at least 100,000 tonnes. The prime contractor partnered with Sargent & Lundy and Global Thermostat to develop the scaled-up design of Global Thermostat's Direct Air Capture technology . Building on more than a decade of research and development, Global Thermostat has been operating its kilotonne-scale K-Series plant – one of the largest in the world – at its headquarters near Denver, Colorado, since 2022. According to CEO Paul Nahi, \"Global Thermostat's technology is inherently scalable with stackable contactors. Our new M-Series design leverages the unique advantages and proven capabilities of our core solution while putting it into an even larger, more efficient, and more cost-effective form factor that can be deployed at the megatonne scale and beyond.\" Now that the initial engineering work is complete, Global Thermostat is finalizing the detailed technical specifications needed to obtain fabrication and construction bids for large commercial projects. The company is actively engaging with potential customers to deploy the M-Series for a diverse array of applications around the world. \"The completion of the M-Series module design is another milestone in Global Thermostat's progress,\" Nahi said. \"Not only do we have a uniquely cost-advantaged and advanced core Direct Air Capture technology, the M-Series design also allows us to harness economies of scale.\" \"This represents a quantum leap in how much carbon dioxide our customers can remove from the atmosphere for their needs,\" Nahi added. \"We see significant and growing demand for big commercial projects in carbon sequestration, sustainable e-fuels, and building materials, among others. The M-Series enables us to address those markets at a scale that is both climate-relevant and uniquely cost-competitive.\" According to the latest report by the scientists of the United Nations' Intergovernmental Panel on Climate Change, \"Carbon Dioxide Removal is necessary to achieve net zero CO2 and GHG emissions both globally and nationally, counterbalancing 'hard-to-abate' residual emissions. CDR is also an essential element of scenarios that limit warming to 1.5°C or below 2°C.\" Delegates from nearly 200 countries are now convened in Dubai for the COP28 climate summit to accelerate progress towards these critical targets. Direct Air Capture refers to technologies that directly capture CO2 from the atmosphere to help achieve net zero and eventually net negative greenhouse emissions, as sources of existing emissions are drawn down. Direct Air Capture is highly scalable and has many advantages as a carbon dioxide removal solution: it enables permanent sequestration, is directly measurable, and does not interfere with natural systems. It can be used in combination with underground storage or mineralization to permanently remove past carbon dioxide emissions. Or, the captured carbon can be substituted for fossil-based carbon in critical, everyday products such as fuels, cement, and plastics. Global Thermostat's patented Direct Air Capture solution consists of high-efficiency fans that pull air through ultra-high surface area contactors where the surface geometry and embedded solid sorbent have been custom-designed to optimize the capture of CO2. Low-temperature heat then rapidly releases the CO2 for long-term storage or reuse. The M-Series module design uses the same patented air contactors and capital advantaged process as Global Thermostat's proven kilotonne-scale K-Series modules. The most significant difference is its size, architecture, and scalability. The M-Series design features larger, circular Direct Air Capture modules that contain over 600% more contactors per module than a single K-Series unit. Each ring is made up of 10 individual wedges that can be efficiently mass-produced, shipped, and then rapidly assembled at a project site. These rings are then aggregated in \"4-Packs\" that share a central gas processing area that uses standard, widely-available industrial components and is skid-mounted for easy fabrication, shipping, and installation. The overall plant CO2 capture capacity can scale from tens of thousands of tonnes to millions of tonnes per year by simply increasing the number of 4-Packs. \"Direct Air Capture represents yet another advancement in our role in empowering a more sustainable, decarbonized energy future,\" said Sargent & Lundy Vice President Kevin Lauzze this week. \"Growing the technology to commercial scale is a critical step toward wide deployment. It continues our journey from connecting thousands of megawatts of renewable energy to the grid, to scaling up carbon capture technology, to now being able to remove carbon from the atmosphere to help reach net-zero goals and beyond.\" Over the last year, Global Thermostat has grown its team, scaled its facilities and capabilities at its new headquarters in Colorado, and launched one of the largest operating Direct Air Capture plants to date. According to Nahi, \"Today we have a full suite of Direct Air Capture modules for our customers' diverse needs for on-site generation of CO2 from air, from our containerized T-Series mobile modules for small-scale applications in the tens of tonnes per year to our K-Series modules for kilotonne-level needs, and now our M-Series for climate-scale projects, for all of which we are seeing growing demand in the market.\" \"The M-Series enables large additional economies of scale while leveraging our proven technology and maintaining modular constructability, which translates into significantly lower cost per tonne of CO2 for our customer.\" \"With this new design, we're on track to start delivering carbon dioxide removal and sustainable sources of carbon at a size and on a timeframe that the world needs, and that positions us to be the world's leading Direct Air Capture provider.\" About Global Thermostat, PBC Global Thermostat's mission is to continually innovate and globally deploy the world's best direct air capture technologies. Over the past decade, we've gained unparalleled experience about the critical drivers of performance for direct air capture, proven our technology at multiple scales, and secured over 100 patents. We have unique, advanced testing and analytic capabilities at our state-of-the art facilities near Denver, Colorado that enable us to continuously improve our solutions for deployment at increasingly larger scales. The PBC in our name stands for \"Public Benefit Corporation,\" a status we have held since 2022. With our multi-patented portfolio of solutions for capturing and removing CO2 directly from the atmosphere, Global Thermostat is working to help restore Earth's climate by reducing carbon dioxide at a global scale for the benefit of all. Follow Global Thermostat on LinkedIn and X and for more information see www.globalthermostat.com . SOURCE Global Thermostat, PBC","filter_flag":1}
{"title":"The top 20 agtech deals of 2023 - AgFunderNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS90aGUtdG9wLTIwLWFndGVjaC1kZWFscy1vZi0yMDIz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS90aGUtdG9wLTIwLWFndGVjaC1kZWFscy1vZi0yMDIz0gEA?oc=5","id":"CBMiOGh0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS90aGUtdG9wLTIwLWFndGVjaC1kZWFscy1vZi0yMDIz0gEA","guidislink":false,"published":"Thu, 28 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=362, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS90aGUtdG9wLTIwLWFndGVjaC1kZWFscy1vZi0yMDIz0gEA?oc=5\" target=\"_blank\">The top 20 agtech deals of 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AgFunderNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The top 20 agtech deals of 2023 - AgFunderNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS90aGUtdG9wLTIwLWFndGVjaC1kZWFscy1vZi0yMDIz0gEA?oc=5\" target=\"_blank\">The top 20 agtech deals of 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AgFunderNews<\/font>","source.href":"https:\/\/agfundernews.com","source.title":"AgFunderNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Disclosure: AgFunderNews’ parent company is AgFunder. Agtech deals of 2023 followed much the same trajectory as other tech sectors, with lower valuations and far fewer mega-rounds than seen in the VC heyday of 2021 and early 2022. This year also saw a shift towards more investment in climate-focused solutions, hence the multiple waste-to-energy startups and carbon-related companies on the list below. Ag biotechnology, which includes the biologicals sector, was another strong category this year. As you read this, the AgFunderNews team is taking a bit of holiday R&R time before we start sifting through the mountains of data involved in the creation of AgFunder’s Global AgriFoodTech Investment report, coming in early 2024. In the meantime, here’s a sneak peek at the top 20 agtech deals of 2023, based on preliminary data from AgFunder. 1. EcoCeres (United States) – Bain Capital invested $400 million into US-based biorefinery platform EcoCeres, which converts low-value waste (e.g., agricultural biomass) into high-value biofuels and biopolymers. 2. Atlas Agro (Switzerland) – Renewable fertilizer company Atlas Agro raised $325 million in a late-stage round from Australia-based Macquarie Group‘s asset management arm. 3. Xpansiv (United States) – The carbon and environmental commodities marketplace raised $125 million from Blackstone Energy Partners, Bank of America and Goldman Sachs. 4. eFishery (Indonesia) – Aquaculture management platform Fishery reached “unicorn” status with $200 million in Series D funding from UAE-based G42 Global Expansion Fund (42xFund), SoftBank Vision Fund II and others. 5. Charm Industrial (United States) – Charm Industrial raised a $100 million Series B led by General Catalyst to expand across the US. Charm converts agricultural biomass into a carbon-rich liquid it then pumps underground to permanently remove carbon from the atmosphere. 6. Silo (United States) – The supply chain tech startup raised $100 million in new capital from First Citizens Bank. Funding went towards developing new products for Silo’s workflow automation and fintech tool for food retailers. 7. GoodLeaf Farms (Canada) – This indoor ag grower had one of the few high-profile raises for a vertical farming company in 2023, securing $78 million from CIBC and Farm Credit Canada. The debt-financing round went towards GoodLeaf Farms’ expansion across Canada. 8. Aphea.Bio (Belgium) – Ag biotech startup Aphea.Bio scored €70 million ($78 million) from Innovation Industries, Gates Foundation and others. The funding round supported the growth of Aphea.Bio’s biologicals business. 9. Loam Bio (Australia) – Soil carbon startup Loam raised A$105 million ($73 million) in a Series B round co-led by Chris Sacca fund Lowercarbon Capital and Wollemi Capital. 10. SAEL (India) – SAEL, which converts agri-waste to renewable energy, landed $60 million from Norfund‘s Norwegian Climate Investment Fund. SAEL noted the funding helped reduce more than 2.8 million tons of CO2 emissions by reducing stubble burning in fields. 11. Bluepha (China) – Biomaterials firm Bluepha snapped up $58 million in an extended Series B round led by Zhong Ping Capital. The company is developing a range of naturally occurring biopolymers to assist downstream companies. 12. Halter (New Zealand) – Halter, best known for its solar-powered smart cow collars and other livestock management tech, raised NZD 85 million $53.3 million. Bessemer Venture Partners led the Series C round with participation from Blackbird Ventures and others. 13. Ecorobotix (Switzerland) – The ag robotics startup raised $52 million in Series B funding for its automated precision spraying robots for row crops and pastures. Aqton PE and Cibus Capital co-led the round. 14. Agreena (Denmark) – scooped up a €46 million ($50 million) Series B for its soil carbon program that financially incentivizes farmers to transition to regenerative agriculture practices. Germany’s HV Capital led the round 15. Aemetis Biogas (United States) – The company, a subsidiary of biofuels company Aemetis, bagged $50 million in a debt financing round. Funding went towards construction of a dairy digester based on USDA Renewable Energy for America Program (REAP) loan guarantee commitments. 16. Green Genius (Lithuania) – The renewable energy company secured $50 million from Poland’s mBank to build 69MW of solar plants in Poland. To date this is the largest deal for Green Genius in Poland, where the startup already has other solar projects in the works. 17. Bio-Engine (China) – Bio-Engine, which makes serum-free media for human and animal cells, raised “over 300 million RMB” ($41 million) in May of this year. Newerli Capital led the Series C financing. 18. Greenlabs (S. Korea) – The precision ag company raised $38.4 million in debt financing from existing investors BRV Capital Management and SkyLake Incuvest. 19. Bestzyme Bioengineering (China) – The company, which does enzyme manufacturing for products like animal feed and bio-ethanol, raised $35.2 million in private equity. 20. Victory Farms (Kenya) – Tilapia producer Victory Farms completed a $35 million Series B round to expand operations in Kenya and Rwanda, as well as potential entry into Ethiopia, Uganda and Tanzania.","filter_flag":1}
{"title":"Daybreak Dec. 11: Vilsack says US 'flipped the script for American agriculture' at COP meeting - Agri-Pulse","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5hZ3JpLXB1bHNlLmNvbS9hcnRpY2xlcy8yMDM4OC1kYXlicmVhay1kZWMtMTEtdmlsc2Fjay1zYXlzLXVzLWZsaXBwZWQtdGhlLXNjcmlwdC1mb3ItYW1lcmljYW4tYWdyaWN1bHR1cmUtYXQtY29wLW1lZXRpbmfSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5hZ3JpLXB1bHNlLmNvbS9hcnRpY2xlcy8yMDM4OC1kYXlicmVhay1kZWMtMTEtdmlsc2Fjay1zYXlzLXVzLWZsaXBwZWQtdGhlLXNjcmlwdC1mb3ItYW1lcmljYW4tYWdyaWN1bHR1cmUtYXQtY29wLW1lZXRpbmfSAQA?oc=5","id":"CBMihAFodHRwczovL3d3dy5hZ3JpLXB1bHNlLmNvbS9hcnRpY2xlcy8yMDM4OC1kYXlicmVhay1kZWMtMTEtdmlsc2Fjay1zYXlzLXVzLWZsaXBwZWQtdGhlLXNjcmlwdC1mb3ItYW1lcmljYW4tYWdyaWN1bHR1cmUtYXQtY29wLW1lZXRpbmfSAQA","guidislink":false,"published":"Mon, 11 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=11, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=345, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5hZ3JpLXB1bHNlLmNvbS9hcnRpY2xlcy8yMDM4OC1kYXlicmVhay1kZWMtMTEtdmlsc2Fjay1zYXlzLXVzLWZsaXBwZWQtdGhlLXNjcmlwdC1mb3ItYW1lcmljYW4tYWdyaWN1bHR1cmUtYXQtY29wLW1lZXRpbmfSAQA?oc=5\" target=\"_blank\">Daybreak Dec. 11: Vilsack says US 'flipped the script for American agriculture' at COP meeting<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Agri-Pulse<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Daybreak Dec. 11: Vilsack says US 'flipped the script for American agriculture' at COP meeting - Agri-Pulse","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5hZ3JpLXB1bHNlLmNvbS9hcnRpY2xlcy8yMDM4OC1kYXlicmVhay1kZWMtMTEtdmlsc2Fjay1zYXlzLXVzLWZsaXBwZWQtdGhlLXNjcmlwdC1mb3ItYW1lcmljYW4tYWdyaWN1bHR1cmUtYXQtY29wLW1lZXRpbmfSAQA?oc=5\" target=\"_blank\">Daybreak Dec. 11: Vilsack says US 'flipped the script for American agriculture' at COP meeting<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Agri-Pulse<\/font>","source.href":"https:\/\/www.agri-pulse.com","source.title":"Agri-Pulse","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Agriculture Secretary Tom Vilsack pronounced himself pleased with U.S. efforts at the COP28 climate change meeting in Dubai, citing, in particular, a declaration signed by 152 countries outlining “the steps that need to be taken in order to ensure that we can produce the food necessary to meet the nutritional needs of the world now, and in the future, in light of a changing climate.” The declaration, he said in a call with reporters Sunday, is “very, very consistent with what [USDA] and the Biden-Harris administration and the United States farmers and ranchers have been engaged in. And in fact, I would say that, in this COP, we flipped the script for American agriculture.” Vilsack said other countries expressed interest in USDA’s $300 million effort to quantify the impact of conservation practices on greenhouse gas emissions and carbon sequestration and particularly “the willingness of the Department of Agriculture in the U.S. to share information with the world as to what we learned.” FAO releases ‘road map’ to cut GHG emissions from ag and food systems The United Nations Food and Agriculture Organization has released an ambitious roadmap to reduce greenhouse gas emissions from “agrifood systems” below the 1.5-degree Celsius threshold set by the 2016 Paris Agreement. In particular, FAO says it wants to reduce methane emissions 25% by 2030 compared to 2020 and achieve carbon neutrality by 2035. It also wants to transform ag and food systems into a carbon sink by 2050. “Actions targeting the livestock sector should prioritize enhancing the efficiency of production, particularly among low-productivity producers,” the FAO report says. While livestock “serves as a crucial source of high-quality protein and essential micronutrients, and is vital for normal development and good health, especially within vulnerable or remote communities,” the sector also directly contributes 26% of all agrifood system emissions (including enteric fermentation and manure),” the report says. By the way: The roadmap came two days after another FAO report looking at how to reduce emissions from livestock. FAO Deputy Director-General Maria Helena Semedo said “solutions such as improving animal health, breeding practices, reducing food loss and waste, and directly targeting GHG emissions have the potential to provide multiple benefits for people and the planet, but they require investments in the sector to narrow efficiency gaps, while meeting an increased global demand for animal protein.” House Rules tees up whole milk bill The House Rules Committee meets today to prepare a bill for floor debate that would ensure schools can offer whole milk to kids. The Whole Milk for Healthy Kids Act of 2023 would prevent whole milk from being counted toward overall fat restrictions in school meals. The 16 amendments proposed for the bill as of Sunday included one that would allow whole milk to be organic or nonorganic. Another amendment would prevent the USDA from issuing any rule that bans varieties of milk, including chocolate milk. A third proposal would express the sense of Congress that whole milk should be the drink of choice for American schoolchildren. Keep in mind: The debate comes as a scientific advisory committee is preparing recommendations for the next update of the Dietary Guidelines for Americans, which currently recommend limiting saturated fat intake to less than 10% of daily calories. The Center for Science in the Public Interest, a consumer advocacy group, has been trying to stop the House bill, arguing it runs counter to the dietary guidelines. The bill’s supporters argue there is a scientific basis for treating dairy fat differently than other fats. For more on the bill and this week’s ag agenda, read our Washington Week Ahead. USDA: DMC sign-up coming early 2024 The beginning of 2024 is rapidly approaching, and USDA has yet to conduct a sign-up for the Dairy Margin Coverage program. In a statement, the department tells Agri-Pulse USDA’s Farm Service Agency is currently working on revising the rule for the program as a result of provisions in the yearlong extension of the 2018 farm bill. “We anticipate the announcement of enrollment early in calendar year 2024,” the statement says. Why it matters: DMC is expected to continue triggering payments to producers, at least in the early part of 2024. Geologists say reductions in Ogallala Aquifer use could stabilize reserves in Western Kansas Ogallala Aquifer water levels could be steadied in most of Western Kansas with pumping reductions of between 18% and 32%, according to a recent analysis from the state’s Geological Survey. The aquifer appears to be faring better in South Central Kansas, with only 0.7% reductions needed to achieve stable water levels, the Kansas Geological Survey estimates. Cut through the clutter! We deliver the news you need to stay informed about farm, food and rural issues. Sign up for a FREE month of Agri-Pulse here. Keep in mind: The Ogallala Aquifer is the backbone of agriculture on the central and southern Plains, but its water supplies have dwindled from overuse in parts of Kansas, Oklahoma, New Mexico and Texas. Water levels in those regions have dropped more than 100 feet since 1950, according to the U.S. Geological Survey. House members introduce Innovative FEED Act to update FDA regulations Many animal feed additive products with potential nutritional and environmental benefits end up in an expensive and long drug regulation review process. The Innovative Feed Enhancement and Economic Development Act, or Innovative FEED Act, introduced by a bipartisan group of House members Thursday would establish a zootechnical animal food substance category for the Food and Drug Administration to consider new products, rather than the currently required animal drug pathway. The bill has already been introduced in the Senate. The American Feed Industry Association is urging Congress to give FDA the ability to evaluate these new products within the agency’s existing food additive petition process. “Dozens of countries have already safely approved and started using these feed ingredients on farms, resulting in improved animal production, well-being, reduced pre-harvest food safety concerns, and a smaller environmental footprint,” AFIA says. Lead House co-sponsors include Reps. Greg Pence, R-Ind., Jim Baird, R-Ind., Kim Schrier, D-Wash., and Angie Craig, D-Minn. He said it: “I didn't hear much about that. I did hear about the important role that strategies for methane reduction can play in making the current livestock industry sustainable, and a recognition that there is a need and will be a continually growing need for more protein.” Agriculture Secretary Tom Vilsack, asked on a press call Sunday whether he had heard much talk at COP28 about reducing meat consumption as a climate strategy. Philip Brasher, Jacqui Fatka and Noah Wicks contributed to this report Please direct questions or comments to Associate Editor Steve Davies.","filter_flag":1}
{"title":"Kingspan launches hemp-based HemKor as part of its sustainability programme - RIBA Journal","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LnJpYmFqLmNvbS9wcm9kdWN0cy9raW5nc3Bhbi1oZW1rb3ItaGVtcC1iYXNlZC1pbnN1bGF0aW9uLWZsZXhpYmxlLXBsYW5ldC1wYXNzaW9uYXRl0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LnJpYmFqLmNvbS9wcm9kdWN0cy9raW5nc3Bhbi1oZW1rb3ItaGVtcC1iYXNlZC1pbnN1bGF0aW9uLWZsZXhpYmxlLXBsYW5ldC1wYXNzaW9uYXRl0gEA?oc=5","id":"CBMiX2h0dHBzOi8vd3d3LnJpYmFqLmNvbS9wcm9kdWN0cy9raW5nc3Bhbi1oZW1rb3ItaGVtcC1iYXNlZC1pbnN1bGF0aW9uLWZsZXhpYmxlLXBsYW5ldC1wYXNzaW9uYXRl0gEA","guidislink":false,"published":"Fri, 22 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=356, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LnJpYmFqLmNvbS9wcm9kdWN0cy9raW5nc3Bhbi1oZW1rb3ItaGVtcC1iYXNlZC1pbnN1bGF0aW9uLWZsZXhpYmxlLXBsYW5ldC1wYXNzaW9uYXRl0gEA?oc=5\" target=\"_blank\">Kingspan launches hemp-based HemKor as part of its sustainability programme<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RIBA Journal<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Kingspan launches hemp-based HemKor as part of its sustainability programme - RIBA Journal","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LnJpYmFqLmNvbS9wcm9kdWN0cy9raW5nc3Bhbi1oZW1rb3ItaGVtcC1iYXNlZC1pbnN1bGF0aW9uLWZsZXhpYmxlLXBsYW5ldC1wYXNzaW9uYXRl0gEA?oc=5\" target=\"_blank\">Kingspan launches hemp-based HemKor as part of its sustainability programme<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RIBA Journal<\/font>","source.href":"https:\/\/www.ribaj.com","source.title":"RIBA Journal","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Three new hemp-based insulation products have been launched by Kingspan in a step that starts to bring hemp into the mainstream. Hemp is a crop recognised for its high levels of carbon sequestration, and with a minimum of 80% bio-based material overall. Currently only available in The Netherlands, Germany and Belgium, the products Jute Blend, Pure and Padding were developed at the manufacturer’s IKON innovation centre in Ireland. Kingspan has suffered drop in trust in the UK after an employee admitted to the Grenfell Tower Inquiry in 2017 it had 'almost kept secret' fire tests on the insulation product later installed at Grenfell Tower. Kingspan later condemned these actions. Jute Blend and Pure meet the European standard EN 16785-1:2015 used to validate the amount of biomass in bio-based products, and according to a spokesperson for the Kingspan. Environmental Product Declaration (EPD) certificates for HemKor products are in development and should be available in 2024. Jute Blend combines hemp with recycled jute bags, it has a declared bio-based content of at least 80% and a thermal performance of 0.040 W\/mK. Pure has a bio-based content of over 95% and a thermal performance of 0.043 W\/mK. Padding has a bio-based content of 100%, but details of its bio-based content and thermal performance were not made available. When asked the percentage of hemp in each product, the spokesperson said: ‘The reason we mention “largely made of hemp” is because not all products in the range contain only hemp. For instance, Jute Blend contains Jute, which is also a bio-based material. Furthermore, that product also includes recycled PET as a binder and soda to ensure the desired reaction to fire.’ Hemp is a circulation crop that takes just four to five months to mature. Is rapid growth, relative height (up to 5m) and deep roots make it effective at storing carbon. HemKor products are manufactured in Nördlingen, Germany with the hemp grown in Europe, mainly in The Netherlands and Romania.","filter_flag":1}
{"title":"Nexus Development Capital Adds Carbon Removal to Growing Portfolio with a $5M Investment in Maine-based ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMisQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25leHVzLWRldmVsb3BtZW50LWNhcGl0YWwtYWRkcy1jYXJib24tcmVtb3ZhbC10by1ncm93aW5nLXBvcnRmb2xpby13aXRoLWEtNW0taW52ZXN0bWVudC1pbi1tYWluZS1iYXNlZC1zdGFuZGFyZC1iaW9jYXJib24tMzAyMDIwNTI1Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMisQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25leHVzLWRldmVsb3BtZW50LWNhcGl0YWwtYWRkcy1jYXJib24tcmVtb3ZhbC10by1ncm93aW5nLXBvcnRmb2xpby13aXRoLWEtNW0taW52ZXN0bWVudC1pbi1tYWluZS1iYXNlZC1zdGFuZGFyZC1iaW9jYXJib24tMzAyMDIwNTI1Lmh0bWzSAQA?oc=5","id":"CBMisQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25leHVzLWRldmVsb3BtZW50LWNhcGl0YWwtYWRkcy1jYXJib24tcmVtb3ZhbC10by1ncm93aW5nLXBvcnRmb2xpby13aXRoLWEtNW0taW52ZXN0bWVudC1pbi1tYWluZS1iYXNlZC1zdGFuZGFyZC1iaW9jYXJib24tMzAyMDIwNTI1Lmh0bWzSAQA","guidislink":false,"published":"Thu, 21 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=355, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMisQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25leHVzLWRldmVsb3BtZW50LWNhcGl0YWwtYWRkcy1jYXJib24tcmVtb3ZhbC10by1ncm93aW5nLXBvcnRmb2xpby13aXRoLWEtNW0taW52ZXN0bWVudC1pbi1tYWluZS1iYXNlZC1zdGFuZGFyZC1iaW9jYXJib24tMzAyMDIwNTI1Lmh0bWzSAQA?oc=5\" target=\"_blank\">Nexus Development Capital Adds Carbon Removal to Growing Portfolio with a $5M Investment in Maine-based ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Nexus Development Capital Adds Carbon Removal to Growing Portfolio with a $5M Investment in Maine-based ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMisQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25leHVzLWRldmVsb3BtZW50LWNhcGl0YWwtYWRkcy1jYXJib24tcmVtb3ZhbC10by1ncm93aW5nLXBvcnRmb2xpby13aXRoLWEtNW0taW52ZXN0bWVudC1pbi1tYWluZS1iYXNlZC1zdGFuZGFyZC1iaW9jYXJib24tMzAyMDIwNTI1Lmh0bWzSAQA?oc=5\" target=\"_blank\">Nexus Development Capital Adds Carbon Removal to Growing Portfolio with a $5M Investment in Maine-based ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Funding will go towards scaling biochar operations to meet commercial demand in combating threats including \"forever chemicals\", soil remediation and stormwater vulnerabilities NEW YORK, Dec. 21, 2023 \/PRNewswire\/ -- Nexus Development Capital , a provider of catalytic capital for sustainable infrastructure project developers, today announced a $5M investment in biochar producer Standard Biocarbon . The funding will enable Standard Biocarbon to scale operations at its facility in Enfield, Maine to meet the growing demand for carbon capture and biochar. The company will commence production of its high-quality biochar in Q1 2024 and is estimated to produce 16,000 cubic yards of biochar and capture 3,000 tons of carbon a year. Maine-based biochar producer Standard Biocarbon is set to begin production of its high-quality biochar in early 2024, capturing an estimated 3,000 tons of carbon a year. Standard Biocarbon was founded by veteran sustainability entrepreneurs Fred Horton and Tom Horton in 2020 to develop a scalable commercial biochar manufacturing capacity in North America. Biochar, a charcoal-like material, is produced by heating organic matter to an extremely high temperature in a low-oxygen environment. The biochar can then store carbon for up to thousands of years. By putting biochar back into the earth, the carbon is permanently removed, making biochar one of the most immediate commercially scalable pathways for carbon removal. In addition to the multiple established agricultural applications, biochar can be used in hazardous waste remediation, stormwater management and in low-carbon cement, pavement and polymers. Recently, biochar has emerged as a leading carbon removal (CDR) solution, limited only by the pace of scaled production and the growth of biochar adoption. According to new research by the International Biochar Institute, biochar has the potential to capture up to 3 billion metric tons of CO2 annually, reducing global emissions by up to 6 percent. Standard Biocarbon's plant utilizes state-of-the-art technology to efficiently produce biochar of consistently high quality and to create the highest value CDR. This negative emission technology (NET) has high value applications with environmental benefits including: Remediating heavy metals and forever chemicals (PFAS) from water and soils Reduction of methane emissions via new animal feed additive Feedstock to produce graphite or graphene for battery electrodes and composites Improving soil productivity, water and nutrient retention Alternative concrete and pavement Reducing urban tree mortality Improving water filtration capabilities Emerging uses of renewable materials in technology where nonrenewable metals have historically been used \"Biochar is one of the most cost-effective and commercially ready approaches for removing CO2 from the atmosphere. Scaling these types of carbon removal facilities is now one of our biggest opportunities,\" said Joshua Kaufman, CEO of Nexus Development Capital. \"We see Standard Biocarbon as one of the first to bring these in-demand carbon sequestration solutions online to meet the huge appetite across multiple sectors.\" Nexus Development Capital's unique investment model focuses on providing catalytic capital to accelerate early-stage project teams that are often developing new FOAK low-carbon solutions. By filling a much-needed investment market gap, Nexus Development Capital enables developers to prove their business model, complete development activities, grow their teams and commercialize their technologies. The company's investment in Standard Biocarbon comes on the heels of its recent investment in SWITCH Maritime, the operator of the US's first hydrogen ferry. \"This investment by Nexus Development Capital has enabled Standard Biocarbon to complete one of the most advanced and efficient biochar plants in the world,\" said Fred Horton, CEO and co-founder of Standard Biocarbon. \"We're seeing incredible interest in a consistent supply of our high-quality purpose-made biochar, which until now has been nearly impossible to find.\" About Nexus Development Capital Nexus Development Capital is dedicated to providing capital and expertise to teams developing sustainable infrastructure projects. As a market leader in funding energy transition and circular economy assets, Nexus Development Capital's partnership model enables developers to prove their business model, complete development activities, grow their teams and commercialize their technologies. Nexus Development Capital is a partner of Nexus PMG, an industry leading low-carbon infrastructure development and services company. To learn more, visit www.nexusdevcap.com\/ . About Standard Biocarbon Standard Biocarbon Corp, based in Enfield, Maine is creating a new model to scale biochar production using proven advanced technology and a relentless focus on product quality and consistency to expand markets. We are a first mover in a sector on a trajectory to become a widely used commodity in a range of high value uses. Our first biochar plant is scheduled to start operations in Q1 2024 and will manufacture high carbon biochar from sawmill residuals sourced onsite with full chain of custody. We are working to catalyze a new green growth industry in our region, leveraging a robust but evolving forest products sector to serve growing demand for less CO2 in the air, better soil, cleaner water and more resiliency to the impacts of severe weather. To learn more, visit www.standardbiocarbon.com . Media Contact [email protected] SOURCE Nexus Development Capital","filter_flag":1}
{"title":"Tall wooden buildings have a problem. Luckily, solutions do exist - Canada's National Observer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3Lm5hdGlvbmFsb2JzZXJ2ZXIuY29tLzIwMjMvMTIvMTMvbmV3cy90YWxsLXdvb2Rlbi1idWlsZGluZ3MtcHJvYmxlbS1zb2x1dGlvbnPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3Lm5hdGlvbmFsb2JzZXJ2ZXIuY29tLzIwMjMvMTIvMTMvbmV3cy90YWxsLXdvb2Rlbi1idWlsZGluZ3MtcHJvYmxlbS1zb2x1dGlvbnPSAQA?oc=5","id":"CBMiWGh0dHBzOi8vd3d3Lm5hdGlvbmFsb2JzZXJ2ZXIuY29tLzIwMjMvMTIvMTMvbmV3cy90YWxsLXdvb2Rlbi1idWlsZGluZ3MtcHJvYmxlbS1zb2x1dGlvbnPSAQA","guidislink":false,"published":"Wed, 13 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=347, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3Lm5hdGlvbmFsb2JzZXJ2ZXIuY29tLzIwMjMvMTIvMTMvbmV3cy90YWxsLXdvb2Rlbi1idWlsZGluZ3MtcHJvYmxlbS1zb2x1dGlvbnPSAQA?oc=5\" target=\"_blank\">Tall wooden buildings have a problem. Luckily, solutions do exist<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada's National Observer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Tall wooden buildings have a problem. Luckily, solutions do exist - Canada's National Observer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3Lm5hdGlvbmFsb2JzZXJ2ZXIuY29tLzIwMjMvMTIvMTMvbmV3cy90YWxsLXdvb2Rlbi1idWlsZGluZ3MtcHJvYmxlbS1zb2x1dGlvbnPSAQA?oc=5\" target=\"_blank\">Tall wooden buildings have a problem. Luckily, solutions do exist<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada's National Observer<\/font>","source.href":"https:\/\/www.nationalobserver.com","source.title":"Canada's National Observer","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"The sustainable building sector is looking to the past for ideas on how to decarbonize materials the industry relies on to create buildings and homes. An old player that is becoming increasingly key? Wood. While wood sequesters carbon and is touted as a sustainable building product, there are problems associated with some of the wood products being used for taller buildings now going up in cities worldwide. In Vancouver, there are two timber highrises, and countries like Sweden, Norway and Austria have similarly built towering structures with wood. However, many wood products are coated with toxic chemicals that make them difficult to recycle at the end of their life, which is a problem, said Naomi Keena, an assistant professor at McGill University’s Peter Guo-hua Fu School of Architecture. There are promising natural alternatives popping up that she says need more attention. Steel, cement and plastic are just a few of the carbon-intensive materials used to construct everything from small homes to towering skyscrapers. On the other hand, wood sequesters carbon and architects are using it to build higher than ever before with the material. The wood used to create buildings is often cross-laminated timber and glue-laminated timber. Unlike raw wood slabs, they are made by layering small sheets of wood with glue or by shredding up wood and mixing it with a binder to create a solid piece. The glue used is synthetic, while wood is a natural fibre, and Keena said that’s a combination that should be avoided. In a circular economy (where materials are reused, repaired and recycled), natural fibres fit into what’s known as the biological cycle and synthetics fit into the technical cycle, and the two don’t overlap. “A simple example … with food, we have composting because we know it can biodegrade because it's a biological product. With synthetic resins, they're part of the technical cycle,” she explained, adding there are proven recycling processes for materials like steel, but not when it's mixed with other materials. Around 11 per cent of global emissions come from the built sector of the building industry, rather than emissions from operations, which includes the production of building materials such as cement, along with the construction process. As timber becomes an increasingly attractive choice for the building sector to cut back on its emissions, it’s a pivotal time to consider how to make the product recyclable at the end of its life, said Keena. If not, the use of new composite wood products will lead to significant waste in the future. While wood sequesters carbon and is touted as a sustainable building product, there are problems associated with some of the wood products being used for taller buildings now going up in cities worldwide. Toxic resin coats many of these products. “People don't think about 50 years time, but if we keep building the way we're building now … not thinking about the end of life, then … we're going to have the same issues in 50 years time,” she said. “...As we develop these new products that are being lauded as green … we have to think about how they can have a long-term, sustainable life cycle.”","filter_flag":1}
{"title":"Mine land remediation drives demand for Hemp Farms Australia - Business News Australia","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmJ1c2luZXNzbmV3c2F1c3RyYWxpYS5jb20vYXJ0aWNsZXMvaGVtcC1mYXJtcy1hdXN0cmFsaWEtYm9vbWluZy1hcy1zZWVkLWlwLWdhaW5zLWZyb20tbmV3LW1hcmtldC1jaGFubmVscy5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmJ1c2luZXNzbmV3c2F1c3RyYWxpYS5jb20vYXJ0aWNsZXMvaGVtcC1mYXJtcy1hdXN0cmFsaWEtYm9vbWluZy1hcy1zZWVkLWlwLWdhaW5zLWZyb20tbmV3LW1hcmtldC1jaGFubmVscy5odG1s0gEA?oc=5","id":"CBMiemh0dHBzOi8vd3d3LmJ1c2luZXNzbmV3c2F1c3RyYWxpYS5jb20vYXJ0aWNsZXMvaGVtcC1mYXJtcy1hdXN0cmFsaWEtYm9vbWluZy1hcy1zZWVkLWlwLWdhaW5zLWZyb20tbmV3LW1hcmtldC1jaGFubmVscy5odG1s0gEA","guidislink":false,"published":"Fri, 22 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=356, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmJ1c2luZXNzbmV3c2F1c3RyYWxpYS5jb20vYXJ0aWNsZXMvaGVtcC1mYXJtcy1hdXN0cmFsaWEtYm9vbWluZy1hcy1zZWVkLWlwLWdhaW5zLWZyb20tbmV3LW1hcmtldC1jaGFubmVscy5odG1s0gEA?oc=5\" target=\"_blank\">Mine land remediation drives demand for Hemp Farms Australia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business News Australia<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Mine land remediation drives demand for Hemp Farms Australia - Business News Australia","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmJ1c2luZXNzbmV3c2F1c3RyYWxpYS5jb20vYXJ0aWNsZXMvaGVtcC1mYXJtcy1hdXN0cmFsaWEtYm9vbWluZy1hcy1zZWVkLWlwLWdhaW5zLWZyb20tbmV3LW1hcmtldC1jaGFubmVscy5odG1s0gEA?oc=5\" target=\"_blank\">Mine land remediation drives demand for Hemp Farms Australia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business News Australia<\/font>","source.href":"https:\/\/www.businessnewsaustralia.com","source.title":"Business News Australia","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"From hempcrete in construction to animal bedding, carbon sequestration to biochar, pallets to the phytoremediation of end-of-life mine sites, a plethora of market channels have opened up for industrial hemp and Brisbane-based Hemp Farms Australia (HFA) is seizing the opportunity. Founded by Lauchlan Grout and Harrison Lee in 2013, HFA is a specialist in industrial hemp genetics with its own unique varieties that thrive in harsh, hot environments. Grout tells Business News Australia the company has sold hemp seed for 1,200 hectares of farmland domestically this year with expectations that figure will triple in 2024, while the company has also teamed up with a distributor in the US where he believes the market opportunity could be 10-12 times greater still. \"The industry has taken some time to get to where it is, but we've also used that time very strategically to make sure that we have the perfect product offering,\" Grout explains. \"If we need to switch and pivot to meet a new product offering that the market’s requested, we’ve built ourselves up so that we can do that, and we can move around in a lightweight manner, and that’s due to not being heavily debt-burdened.\" The entrepreneur claims HFA has just one large competitor in Australia, and the industry is still waiting for the global genetics titans to step in. \"I’d say at the moment they’re looking to people like us to form the industry and create the different segments and commercialise the end markets, which is really only just being done now,\" he says. \"The Australian industry has experienced some changes in market preferences over the past few years. Previously there was a complete focus solely on grain and grain production due to the low barriers to entry, and also the pre-existing processing infrastructure. \"But since then there’s been huge development and capital investment that’s poured into fibre and biomass harvesting and processing methods and capabilities.\" One of Hemp Farms Australia's industrial hemp operations. Grout says this has allowed farmers and processers more avenues for their offtake harvest material, which increases the demand for HFA's seed. \"Another massive factor here in Australia is obviously the growing concern over climate condition and carbon emissions has increased the demand for carbon sequestrating activities, biochar solutions and also activated carbon offtakes,\" he says. \"Now there are actually methodologies approved internationally, and this has been a huge driver into why we’re expanding into the US market. \"HFA at the moment is perfectly placed to dominate both the Australian and US markets with our fibre and dual-purpose genetics.\" Dual-purpose genetics means a crop can be around 50 per cent seed and 50 per cent fibre, so it's a more flexible way to earn various revenue streams from the one crop. However, fibre-focused varieties are a biomass crop that can either be made into a bale of hemp 'hurd' that is used in such areas as animal bedding, hemp-based concrete, or pallets as a timber alternative. \"What we’ve really seen, especially in Australia, is businesses innovating with end products focused on fibre, whether it be hempcrete, biofuels, net zero carbon pallets that are made from compressed hemp fibre and hurd so you can replace timber,\" Grout says. \"You can have hemp go into pallets and they can be sent all around the world without being treated. That's a big market that's taking off. \"So there’s construction, there’s pallets, there’s timber replacement products, there’s activated carbon which is a great feed additive or fertiliser, and what we’ve pretty much had to do is align ourselves with the businesses that have injected capital into those processing facilities so we have a guaranteed end customer and that customer has a guaranteed end market.\" Grout adds that a big driver of growth in Australia has been mining companies looking to for industrial hemp for phytoremediation purposes, improving soil quality but also creating a marketable product from the crops put into a phytoremediation process. \"Phytoremediation is growing hemp on a degraded, already used up mining site, and it is a perfect crop to rehabilitate that soil back to a viable condition. \"When you have a mine that is now out of action, they use tailings – pretty much all the wastewater from that mining activity. That’s all kept in a huge dam or a quarry somewhere. What they’re proposing is that water can be used on these types of crops,\" he says, clarifying these are crops that are only industrial and not in any way oriented to human consumption. \"All of the material that will be harvested for a crop that's doing phytoremediation, or even a crop that’s just doing carbon sequestration, that material will more than likely end up in a biochar facility or a hempcrete processing facility to be fed into the construction market.\" US opportunities The Hemp Farms Australia co-founder highlights transformative growth in the US industrial hemp industry, which has opened up following a period when the sector was almost entirely fed by Canadian imports. \"Our strategy expanding into the US is due to a much larger market and also larger market demand,\" Grout explains. \"This demand is is concentrated in all southern states of the US primarily because these regions share very similar climatic and daylength conditions. Being close to the equator has historically posed challenges for growers in obtaining viable and reliable genetics. \"They haven’t really been able to grow their industry or create or develop new products because they haven't had varieties that would excel very well close to the equator.\" Areas of focus in the US for Hemp Farms Australia. Grout says this is largely due to the varieties sourced coming from sources where climates are very different, but at the same time as mainstay varieties have struggled in the southern states of the US, there have also been major investments into processing and new product development. \"The demand over in America for what we're seeing with our varieties is sitting at about 15,000 hectares, which you can tell is 10-12 times what we’re seeing in Australia,\" Grout says. Grout is unable to reveal the name of the company's partner in the US, but notes they will be trialling three of HFA's varieties - two dual-purpose, one grain-focused - in six different sites within Texas and Tennessee. \"The aim of that is to pretty much build prominence and also gain some data feedback on yield metrics, which will then turn into a wholesale distribution set-up over there, which will then evolve into a licence and royalty agreement with the distributor,\" he says. HFA has also embarked on a $2.5 million capital raise to assist with the expansion and beef up operations at home. \"We’re currently going through a capital raise to allow us to expand on our team, and also expand into the US, the reason being that we need to take the opportunity whilst it’s there and use all of our current funds to push towards making that happen,\" Grout says. \"We have taken on small amounts of seed investment up to this stage from one party, but we more so wanted to look at this as a strategic investment, because we want to expand on our knowledge and capabilities with genetics.\"","filter_flag":1}
