{"title":"Researchers use superheated steam to sanitize dry food manufacturing plants - Food Safety News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiKGh0dHBzOi8vd3d3LmZvb2RzYWZldHluZXdzLmNvbS8_cD0yMjQwOTTSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiKGh0dHBzOi8vd3d3LmZvb2RzYWZldHluZXdzLmNvbS8_cD0yMjQwOTTSAQA?oc=5","id":"CBMiKGh0dHBzOi8vd3d3LmZvb2RzYWZldHluZXdzLmNvbS8_cD0yMjQwOTTSAQA","guidislink":false,"published":"Mon, 27 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=58, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiKGh0dHBzOi8vd3d3LmZvb2RzYWZldHluZXdzLmNvbS8_cD0yMjQwOTTSAQA?oc=5\" target=\"_blank\">Researchers use superheated steam to sanitize dry food manufacturing plants<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food Safety News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Researchers use superheated steam to sanitize dry food manufacturing plants - Food Safety News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiKGh0dHBzOi8vd3d3LmZvb2RzYWZldHluZXdzLmNvbS8_cD0yMjQwOTTSAQA?oc=5\" target=\"_blank\">Researchers use superheated steam to sanitize dry food manufacturing plants<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food Safety News<\/font>","source.href":"https:\/\/www.foodsafetynews.com","source.title":"Food Safety News","query":"https:\/\/news.google.com\/rss\/search?q=\"Waste stream management\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Researchers at Cornell University are developing a new tool to eliminate deadly pathogens in commercial dry food processing plants — superheated, dry steam. Because it is impossible to sanitize equipment in certain dry manufacturing plants with water, lead researcher Abigail Snyder, Ph.D., assistant professor of food science, is testing the viability of superheated steam to clean these environments. “Cleaning and sanitation in dry food processing and produce packing is a challenge because you can’t use soap or water,” Snyder said. “We’re seeing how well-superheated steam works to prevent contamination and to keep food safe.” The work is relevant to the milk powder and powdered infant formula industry, something that has come to the forefront of consumers’ minds. Last year, there was a total of five infants with cronobacter infections resulting in hospitalization and three deaths connected to Abbott Nutrition’s formula. Abbott initiated a recall of some of its infant formula products — including Similac — after the reports of serious bacterial infections in infants. Superheated steam would also work in plants manufacturing snack foods, spices, nuts, and nut butters, produce, as well as chocolate and other candies, Snyder said. The Center for Produce Safety awarded Snyder with a $400,000 grant on Jan. 1, 2022, to fund the superheated steam research. Why dry foods? Synder is partnering with co-investigator V.M. (Bala) Balasubramania, professor of food science and technology at Ohio State University, to examine produce-processing pack houses to understand how best to apply this technology. The two have worked together previously, in 2020, researching sanitation strategies in the dry food manufacturing environment. Motivating the research is the recognition that maintaining safe processing production areas for dry foods is an important and potentially life-saving task, as E. coli has been found in low-moisture foods. According to the U.S. Centers for Disease Control and Prevention, from 2016 to 2019 approximately 100 multistate E. coli cases were linked to flour and related products. “A lot of food products require no refrigeration,” Snyder said. “Historically, people believed that low-moisture foods were safe since they don’t support microbial growth. But in the past 15 years, there have been big outbreaks and recalls associated with dry food, not because microbes or pathogens grow in the food, but because they can survive for a long time.” Superheated steam Dry or superheated steam is heated beyond 212 degrees F to more than 250 degrees F. It becomes invisible and acts like a hot gas. The dry steam is applied to production surfaces, kills any pathogens and microbes, and leaves no moisture or condensation to harbor further pathogens. “Our results will be compared to the efficacy of conventional scraping, vacuuming, and brushing methods now commonly applied,” Snyder said, adding that this work will establish best practices in these food processing environments. “We hope new tools like superheated steam will reduce the demand on water, sanitizers, and waste-stream management in food manufacturing, aligning with consumer preferences and sustainability goals.” More about this research can be found here. About CPS The Center for Produce Safety (CPS) is a 501(c)(3), U.S. tax-exempt, charitable organization focused exclusively on providing the produce industry and government with open access to the actionable information needed to continually enhance the safety of fresh produce. (To sign up for a free subscription to Food Safety News, click here.)","filter_flag":1}
