{"title":"Loam Bio Gets $73M to Boost Soil Carbon Capture - CarbonCredits.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vY2FyYm9uY3JlZGl0cy5jb20vbG9hbS1iaW8tZ2V0cy03M20tdG8tYm9vc3Qtc29pbC1jYXJib24tY2FwdHVyZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vY2FyYm9uY3JlZGl0cy5jb20vbG9hbS1iaW8tZ2V0cy03M20tdG8tYm9vc3Qtc29pbC1jYXJib24tY2FwdHVyZS_SAQA?oc=5","id":"CBMiSWh0dHBzOi8vY2FyYm9uY3JlZGl0cy5jb20vbG9hbS1iaW8tZ2V0cy03M20tdG8tYm9vc3Qtc29pbC1jYXJib24tY2FwdHVyZS_SAQA","guidislink":false,"published":"Wed, 15 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=15, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=46, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vY2FyYm9uY3JlZGl0cy5jb20vbG9hbS1iaW8tZ2V0cy03M20tdG8tYm9vc3Qtc29pbC1jYXJib24tY2FwdHVyZS_SAQA?oc=5\" target=\"_blank\">Loam Bio Gets $73M to Boost Soil Carbon Capture<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CarbonCredits.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Loam Bio Gets $73M to Boost Soil Carbon Capture - CarbonCredits.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vY2FyYm9uY3JlZGl0cy5jb20vbG9hbS1iaW8tZ2V0cy03M20tdG8tYm9vc3Qtc29pbC1jYXJib24tY2FwdHVyZS_SAQA?oc=5\" target=\"_blank\">Loam Bio Gets $73M to Boost Soil Carbon Capture<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CarbonCredits.com<\/font>","source.href":"https:\/\/carboncredits.com","source.title":"CarbonCredits.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Carbon farming startup Loam Bio has closed a US$73 million Series B round co-led by Lowercarbon Capital and Wollemi Capital to improve the ability of soil to capture carbon. Loam Bio specializes in boosting soil’s ability to store carbon through microbiology. It has also launched its CarbonBuilder seed inoculum and SecondCrop carbon tools in Australia. The $73M Investment in Loam Apart from Lowercarbon Capital and Wollemi Capital, other key investors who participated in the funding round include: Horizons Ventures, Acre Venture Partners, Main Sequence, the Clean Energy Finance Corporation, and Grok Ventures Loam will use the $73 million funding to expand its seed coating tech that supercharges plants’ ability to capture and store carbon in the soil. Tegan Nock, the company’s co-founder noted that: “We’re really focused on delivering value for broad acre cropping systems right now, including wheat, barley and canola for the Australian market, and soy and corn for the US market.” The fund will also support the delivery of new products that will go through years of testing for main crops in regions the company operates. Better Soil Carbon Capture About 10% of the earth’s surface is cropland. Though capturing carbon through the soil won’t be enough to remove what’s already in the air, the fact remains that it helps reduce carbon emissions. But farmers have to draw down carbon and store it underground. And this is no easy task for many farmers, especially in cropping systems. Loam co-founder Guy Hudson said that the annual cropping cycle can be intensive on soils. That’s because much of the carbon and nutrients are drawn from the soil to grow the crops for every season. Regenerative farming practices such as cover cropping and no-till are good at sequestering carbon. However, applying them at scale may disrupt existing operations of the farmers. This is where Loam Bio’s microbial technology comes in to help farmers adopt those carbon farming practices. According to Hudson: “By applying Loam seed treatment, farmers can accelerate a path towards healthier, more productive soils by driving more rapid increases in soil carbon, which benefits resilience and productivity.” The startup seeks to improve the quality and quantity of soil carbon capture through its microbial technology. Loam’s CarbonBuilder: How it Works Loam harnesses the power of microbiology to help tackle climate change while creating value for agriculture. The carbon farming firm coats seeds with its CarbonBuilder fungal before sowing them. The coating “supercharges” plants’ ability to store carbon in the soil. Nock said that what makes CarbonBuilder unique is the type of carbon that is sequestered through the biological process. She added that it’s the more stable form of carbon, meaning “there’s lower risk for farmers integrating carbon farming practices.” She also said that this method increases fertility and productivity in the soil. Under normal conditions, plants will draw down CO2 and trap it in the soil in the form of biomass. Among the various types of carbon, recalcitrant carbon doesn’t break down easily. Instead, it stays in the soil for a long time, up to a millennium. CarbonBuilder targets this hard-to-decompose carbon. Seeds coated with CarbonBuilder’s microbial fungi increase carbon sequestered in the soil. As the seed germinates, microbes bind the CO2 with macroaggregates in the soil. In other words, the fungi convert the carbon into a much stabler form it can keep in the ground for a long time. As mentioned in the video, there are 1.8 billion hectares of farmland globally. And there are about one million plants per hectare in a wheat crop. If those figures are multiplied and their sequestration is optimized through CarbonBuilder, the results would be massive. But that’s yet too far from what Loam manages to achieve right now. The carbon farming firm has sown 6,000 trial plots across 29 areas in 2 countries. In one example of CarbonBuilder’s application in barley, farmers managed to increase carbon units stored per hectare: from 0 – 2 to 3 – 6. Another company is improving trees’ ability to capture carbon and store it in their biomass. They refer to them as “GMO super trees“. SecondCrop: Helping farmers join the carbon market Alongside CarbonBuilder, Loam is also launching SecondCrop carbon project options. The goal is to boost the economic viability and transparency of the company’s carbon farming approach. Loam will assist farmers in many activities through SecondCrop, including: Registration and administration Land management strategies Measurement and verification SecondCrop removes the upfront costs that carbon markets usually require. Loam also works directly with farmers to measure soil carbon and register with the carbon scheme. The company stated: “By removing the risks of upfront costs, not [being able to build] soil carbon, and access to skilled support to manage the project, farmers are able to integrate carbon building into their existing farming system. Loam’s SecondCrop carbon project options are designed to remove these barriers for farmers and encourage increased participation in carbon farming.” In carbon farming, carbon can be thought of as a crop similar to the other crops farmers produce. These agricultural practices give farmers the potential to turn their farms’ carbon sequestration into cash with carbon credits. Each ton of CO2 sequestered is awarded with one carbon credit. This year, Loam will expand its technology testing in new geographies like Canada and Brazil. They will focus on the major crops grown specifically in those places. Right now, Loam works with a limited number of Australian farmers to boost soil carbon capture. The carbon farming startup plans to reach the commercialization stage in the U.S. in 2024.","filter_flag":1}
{"title":"Loam Bio raises $75m, launches tools to improve soil carbon capture - AgFunderNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS9sb2FtLWJpby1yYWlzZXMtNzVtLXNlcmllcy1iLWZyb20tbG93ZXJjYXJib24tYWNyZS1vdGhlcnMtdG8tYm9vc3Qtc29pbC1jYXJib27SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS9sb2FtLWJpby1yYWlzZXMtNzVtLXNlcmllcy1iLWZyb20tbG93ZXJjYXJib24tYWNyZS1vdGhlcnMtdG8tYm9vc3Qtc29pbC1jYXJib27SAQA?oc=5","id":"CBMiZ2h0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS9sb2FtLWJpby1yYWlzZXMtNzVtLXNlcmllcy1iLWZyb20tbG93ZXJjYXJib24tYWNyZS1vdGhlcnMtdG8tYm9vc3Qtc29pbC1jYXJib27SAQA","guidislink":false,"published":"Mon, 13 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=44, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS9sb2FtLWJpby1yYWlzZXMtNzVtLXNlcmllcy1iLWZyb20tbG93ZXJjYXJib24tYWNyZS1vdGhlcnMtdG8tYm9vc3Qtc29pbC1jYXJib27SAQA?oc=5\" target=\"_blank\">Loam Bio raises $75m, launches tools to improve soil carbon capture<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AgFunderNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Loam Bio raises $75m, launches tools to improve soil carbon capture - AgFunderNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS9sb2FtLWJpby1yYWlzZXMtNzVtLXNlcmllcy1iLWZyb20tbG93ZXJjYXJib24tYWNyZS1vdGhlcnMtdG8tYm9vc3Qtc29pbC1jYXJib27SAQA?oc=5\" target=\"_blank\">Loam Bio raises $75m, launches tools to improve soil carbon capture<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AgFunderNews<\/font>","source.href":"https:\/\/agfundernews.com","source.title":"AgFunderNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Better, faster, stronger carbon capture Cropland covers roughly 10% of the earth’s surface. While scientists agree it can’t single-handedly remove atmospheric carbon as fast as we produce the stuff, soil carbon sequestration could nonetheless put a meaningful dent in the problem. First, however, farmers have to actually get the carbon in the ground, which is no small feat for many. “It’s particularly hard in the context of cropping systems to build significant quantities of carbon,” says Loam co-founder Guy Hudson. “The annual cropping cycle can be intensive on soils, with much of the carbon and nutrients being drawn from the soil to grow the crops each season.” Current land-management practices like no-till and cover cropping can sequester carbon. But to do so at scale can be significantly disruptive to farmers’ existing operations, and is a risky financial bet that doesn’t always generate quick returns. “Loam’s microbial tools are another way to help farmers do this, and do it more rapidly,” Hudson says of helping farmers transition. “By applying Loam seed treatment, farmers can accelerate a path towards healthier, more productive soils by driving more rapid increases in soil carbon, which benefits resilience and productivity.” Loam aims to increase both the quantity and quality of carbon through its offerings. How CarbonBuilder works: Loam coats seeds with the CarbonBuilder fungal inoculum before sowing. This coating “supercharges” plants’ ability to store carbon in the soil. Normally, plants draw down atmospheric carbon, trapping it in the soil, usually in the form of biomass. But there are different types of carbon, says Loam. Labile carbon breaks down quickly. Recalcitrant carbon, on the other hand, resists decomposition and stays in the soil much longer — up to millennia. Loam’s CarbonBuilder stores this latter kind of carbon. Seeds coated with Loam’s microbial fungi increase carbon within structures in the soil. As the seed germinates, microbes bind atmospheric carbon drawn down by the plant with microaggregates in the soil. In other words, the fungi converts CO2 into a much stabler form of carbon it can store in the ground long term. “There are 1 million plants per hectare in a wheat crop,” Hudson explained in a recent video. “Multiply that by 1.8 billion hectares of managed farmland across the world, and you’re looking at an infrastructure that can facilitate the largest carbon drawdown event we’ve ever seen.” We’re still a ways off from that mark, of course. To date, Loam has sown 6,000 individual trial plots across 29 locations in two countries. In CarbonBuilder trials done for barley, farmers were able to increase carbon units per hectare to between three and six, up from zero to two via other land-management practices. “What makes CarbonBuilder unique is the type of carbon that is sequestered through the biological process,” says Loam co-founder Tegan Nock. “It’s the more stable forms of carbon, which means there’s lower risk for growers integrating carbon farming practices.” She adds that this method of sequestration also increases fertility and productivity in the soil. How SecondCrop works: Loam is is launching CarbonBuilder together with its SecondCrop carbon project options. The company says this will increase transparency and economic viability, and maximize the benefits of increased soil carbon delivered back to the farm enterprise. Through SecondCrop, Loam assists with registration and administration, land management strategies, measurement and verification. The company works directly with growers to measure soil carbon and register with the right carbon scheme. Loam says this strategy gives farmers technical and administrative expertise without those things being a burden to core farming practices. Loam also provides the option to train and pay farmers’ existing agronomists. SecondCrop removes the upfront costs typically required for carbon markets. Because farmers can use the CarbonBuilder tech, there’s also more certainty around their ability to even build soil carbon. “By removing the risks of upfront costs, not [being able to build] soil carbon, and access to skilled support to manage the project, farmers are able to integrate carbon building into their existing farming system,” says Loam. “Loam’s SecondCrop carbon project options are designed to remove these barriers for farmers and encourage increased participation in carbon farming.” How Loam will use the funding: “This year we’re moving from pre-commercial to commercial and launching our products in Australia,” says Hudson. Currently, Loam is working with a limited number of farmers in Australia. The company plans to reach commercialization stage in the US in 2024. “We’re really focused on delivering value for broadacre cropping systems right now, including wheat, barley and canola for the Australian market, and soy and corn for the US market,” says Nock. “The $73 million series B raise will help us expand our product development and support the delivery of new products entering the pipeline that will go through years of testing for key crops in regions we’re already working in.” In 2023, Loam will also expand its testing in new geographies including Canada and Brazil. Testing will focus on the major crops grown specifically in those regions.","filter_flag":1}
{"title":"Agtech: Breaking down the farmer adoption dilemma - McKinsey","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3Lm1ja2luc2V5LmNvbS9pbmR1c3RyaWVzL2FncmljdWx0dXJlL291ci1pbnNpZ2h0cy9hZ3RlY2gtYnJlYWtpbmctZG93bi10aGUtZmFybWVyLWFkb3B0aW9uLWRpbGVtbWHSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3Lm1ja2luc2V5LmNvbS9pbmR1c3RyaWVzL2FncmljdWx0dXJlL291ci1pbnNpZ2h0cy9hZ3RlY2gtYnJlYWtpbmctZG93bi10aGUtZmFybWVyLWFkb3B0aW9uLWRpbGVtbWHSAQA?oc=5","id":"CBMibWh0dHBzOi8vd3d3Lm1ja2luc2V5LmNvbS9pbmR1c3RyaWVzL2FncmljdWx0dXJlL291ci1pbnNpZ2h0cy9hZ3RlY2gtYnJlYWtpbmctZG93bi10aGUtZmFybWVyLWFkb3B0aW9uLWRpbGVtbWHSAQA","guidislink":false,"published":"Tue, 07 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=38, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3Lm1ja2luc2V5LmNvbS9pbmR1c3RyaWVzL2FncmljdWx0dXJlL291ci1pbnNpZ2h0cy9hZ3RlY2gtYnJlYWtpbmctZG93bi10aGUtZmFybWVyLWFkb3B0aW9uLWRpbGVtbWHSAQA?oc=5\" target=\"_blank\">Agtech: Breaking down the farmer adoption dilemma<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">McKinsey<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Agtech: Breaking down the farmer adoption dilemma - McKinsey","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3Lm1ja2luc2V5LmNvbS9pbmR1c3RyaWVzL2FncmljdWx0dXJlL291ci1pbnNpZ2h0cy9hZ3RlY2gtYnJlYWtpbmctZG93bi10aGUtZmFybWVyLWFkb3B0aW9uLWRpbGVtbWHSAQA?oc=5\" target=\"_blank\">Agtech: Breaking down the farmer adoption dilemma<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">McKinsey<\/font>","source.href":"https:\/\/www.mckinsey.com","source.title":"McKinsey","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Agriculture technology (agtech) has an adoption challenge. There are multiple barriers to scaling from an industry perspective—such as fragmentation, lack of standard data architecture, and cross-platform interoperability. In this article, we evaluate the challenges related to farmer adoption, sharing the “voice from the field.” With recent increases in on-farm profitability and strong investments over the last decade, there is a high openness to innovation, yet adoption is slow. On one hand, most farmers have benefited from the macroeconomic tailwinds of global commodity cycles; in 2021, on-farm income in many regions was at its highest level in almost a decade and was projected to remain at near record highs in 2022. On the other hand, inflationary pressures are mounting and farmers are facing an onslaught of challenges—having to scrutinize weather forecasts, be aware of shifts in the regulatory landscape, or face evolving consumer preferences, rising costs from inflation, and unreliable supply chains. Meanwhile, external capital has been pouring into the upstream agriculture food-technology industry to the tune of about $18.2 billion in 2021, an approximate 38 percent year-on-year growth since 2013. This influx of capital has brought with it a plethora of technological solutions to the agriculture space. Over the past decade, the number of farmer-facing agtech start-ups has ballooned. Farmers can now harness software, hardware, and service-based solutions that promise to increase efficiency, ease pain points, and lower their environmental footprint. Even with need driving funding availability, agtech start-ups are struggling to scale. In our recent publication on agtech funding over the last decade, we showed that most deals are occurring in the Seed and Series A rounds. Far fewer start-ups, however, are receiving later-stage funding or going public, suggesting that agtech start-ups are not able to build the requisite customer base to transition to these funding rounds. Current global agtech adoption: survey In some areas, agtech solutions are already driving the next level of farm productivity by reducing operational costs and enabling less resource-intensive growth. To gain a deeper understanding of how agtech usage may differ across regions globally, and what barriers may be impeding broader adoption, we surveyed 5,500 row- and specialty-crop farmers in 2022 across Asia, Europe, North America, and South America. Farmers’ responses reveal that agtech adoption varies markedly across geographies, and that hesitant adopters are particularly wary of unclear ROI and high prices (Exhibit 1). 1 European and North American farmers lead global agtech adoption, with about 61 percent currently using or planning to adopt one agtech product in the next two years. North American farmers cite high costs (52 percent) and unclear ROI (40 percent) as their biggest challenges to adopting farm-management systems. Farmers in Europe, while also most concerned about high costs (48 percent), report complexities in setup and use as an additional major barrier to adoption (32 percent). Farmers in South America (50 percent) follow in agtech adoption, with differences in adoption observed between countries within each region. South American farmers are the most apprehensive about trust in the purchasing process through online platforms (33 percent). Agtech product adoption is lowest in Asia, with only about 9 percent of farmers using or planning to use at least one agtech product; adoption varies between countries in this region as well. Looking at agtech submarkets, farm-management software has the highest adoption among farmers at 21 percent, followed closely by a 15 percent utilization of remote-sensing and precision agriculture hardware. Sustainability-related technology (such as software and hardware that measure carbon emissions and sequestration, and monitor and optimize irrigation systems), and automation and robotics—technologies that are still in their infancy—lag at about 5 percent adoption. Over the next two years, limited growth is projected across categories, with roughly 4 percent of farmers saying they plan to adopt either farm-management software, precision-agriculture hardware, remote-sensing solutions, or sustainability-related technologies, while additional automation and robotics adoption is projected to be slightly lower, at around 2.5 percent. Five trends emerge within the agtech space Six major farmer-facing agtech submarkets Farm-management software includes computer and mobile applications designed to improve operational efficiency, optimize input usage, create variable-rate prescriptions, and provide back-office solutions. Sustainability-related technologies include software and hardware designed to measure carbon emissions and sequestration, monitor and optimize irrigation systems, and estimate sustainability impact scores. Precision-agriculture hardware includes products designed to provide real-time measurements of soil fertility and moisture; enable auto-steer capabilities during planting, spraying, and harvesting; optimize planting populations; and reduce pesticide application overspray. Remote-sensing technologies include satellite and unmanned aerial vehicle solutions that monitor crop growth and identify both biotic and abiotic stressors in a high-throughput manner. Agribusiness marketplaces and other mid-stream technologies include online commodity trading platforms, digital marketplaces tailored to input purchasing, and products providing greater insight into food safety, traceability, and logistic support. Farm robotics, automation, and electric equipment include advanced field machinery designed to reduce labor needs, optimize field operations, increase productivity of input application, and reduce operating costs. Five trends arise across six farmer-facing agtech submarkets. (See sidebar, “Six major farmer-facing agtech submarkets.”) Some trends are cross-cutting, while the impact of others is disproportionate across certain agtech submarkets: Though agtech adoption is slow, farmers are open to innovation. There is a transition toward more sustainable, less resource-intensive food systems, with precision agriculture as a key enabler. Regulation will likely play an increasingly important role in accelerating growth in certain agtech submarkets. Business models continue to evolve toward integrated solutions. There is opportunity to improve product personalization and resolve the limited trust around data sharing. Openness to innovation Shifting pressures are leading farmers to be more open to agtech innovations as potential tools to optimize their returns and minimize their financial risk. Thirty-nine percent of farmers surveyed globally are currently using or planning to use at least one agtech product in the next two years. To improve their bottom lines, 43 percent of surveyed farmers are focused on trying new products to increase yield, while almost a quarter (22 percent) are planning to change purchasing and vendor strategies. Rising input prices are currently the greatest worry that farmers face, with 67 percent citing increased input prices as one of their top three concerns for profitability over the next two years. Their unease is well-founded, as farmers globally report that their input prices have risen between around 80 percent and 250 percent in the last few years. South American farmers have been the hardest hit (at about 247 percent), while Asia’s input costs (around 82 percent) are the least affected. Though farmers are currently producing food under elevated sales price conditions, the volatility of the commodity markets—combined with rising input prices—introduces great uncertainty on future profitability. As past economic cycles have shown, the delay in time between input production, purchase, and application means that a dip in commodity prices does not immediately mirror a drop in input prices, adding strain to farmers’ bottom lines. Farmers are thus motivated to offset this uncertainty by optimizing their yields—an opportunity to introduce agtech innovations to their farming strategies. Across all markets, large farms—more than 5,000 acres—are the most willing to adopt agtech solutions (81 percent), with 76 percent of medium farms (2,000 to 5,000 acres) and 36 percent of small farms (fewer than 2,000 acres) using or planning to use at least one technology in the next two years. Agtech adoption is not uniform across regions and, in some cases, there is substantial variation between countries within regions—both in terms of the percentage of farmers using agtech, and the agtech submarkets they adopt. Farm-management software is the most common submarket among North American farmers. In South America, remote-sensing technology is the highest use case (23 percent), and Brazilian farmers outpace Argentinian farmers in adoption across most agtech submarkets. European farmers show considerable variation by country, as well as within submarkets. For example, agribusiness marketplace adoption is highest in Germany at 13 percent, whereas precision-agriculture hardware usage is highest in the Netherlands at 33 percent. In Asia, farmers in India currently use more agtech products than those in China across all submarkets. Instead of targeting the adoption of individual agtech solutions, the current environment is likely to encourage farmers to focus attention on combining two key submarkets: farm-management software systems and precision-agriculture hardware solutions. These two innovations work in concert to optimize fertilizer and pesticide usage and tailor seeding rates. Farm-management software systems are particularly promising because they can equip farmers with the information needed to evaluate and manage how they utilize large value pools, including inputs such as fertilizers, seeds, and pesticides. These systems are further enhanced when precision-agriculture hardware solutions are deployed to conduct input application in the field. For example, optimizing input application through variable rate applications, especially when coupled with advanced guidance systems and automatic shutoffs, gives farmers greater control at preventing site-specific over-application. Transition to more sustainable food systems As the physical and economic impacts of climate change worsen, global consumers and investors are turning to sustainable food systems. McKinsey’s recent article on conscious eating shows that nearly 30 percent of respondents have increased their consumption of more sustainable food products since the start of the COVID-19 pandemic. Additionally, our most recent analysis of agtech funding in 2022 indicated that nearly one-third of start-ups have a sustainability-focused value proposition. This suggests that both start-ups and investors are responding to these changes in consumer preferences and broader societal trends. However, results from our survey show that the direct adoption of agtech has yet to align with investor and consumer sentiment—such as sustainability-related technologies and those that support the transition to more sustainable farming practices. Europe and North America lead the use of sustainability-related technology, but at 9 percent adoption, there is opportunity for agtech to grow in these regions. There is also growth opportunity in other parts of the world, with only a 6 percent adoption rate globally. Even where adoption of sustainable farming practices is higher, use of sustainability-related technologies is still low. For example, as shown in our “Global Farmer Insights 2022” survey, Brazil is a leader in the use of biologicals (55 percent) and low-till practices (83 percent), though its adoption of sustainability-related technology is as low as 10 percent. Precision-agriculture hardware, which is a major driver for sustainable, low-emission farming practices, is utilized the most in North America (28 percent), followed closely by South America (27 percent), and Europe at 21 percent. The solutions showing the most enthusiastic adoption are yield mapping and monitoring software (69 percent), variable rate fertilizer-application technology (67 percent), and automatic sprayer-section shutoffs (67 percent). Asia is still catching up, with only 4 percent adoption of overall sustainability-related technology categories (Exhibit 2). 2 Farmers can leverage agtech more deliberately to support the broader adoption of sustainable farming practices. To participate in sustainability programs, farmers are not only expected to adopt sustainable practices, but to also verify compliance and continually measure their impact. This includes measuring soil organic carbon to verify carbon sequestration—for many carbon programs, for example, three to nine years’ worth of historical data are required depending on crop rotation. These cover specific data points such as tillage history, yield data, soil-sampling results, and crop inputs. In total, up to 100 different data fields need to be collected and recorded during the growing season to meet validation and verification requirements. Farmers are further expected to provide up to 100 years in permeance requirements for carbon sequestration to prove that a reversal has not occurred. Sustainability-related technologies that support measurement, reporting, and verification (MRV), as well as data-collection technologies such as remote sensing, are starting to address the burdensome data requirements and will likely play an important role as farmers transition toward more sustainable practices. Regulation’s increasingly important role Regulation already plays a critical role in shaping the future of agtech—our survey data show that government-sponsored programs are the main drivers of sustainability-program adoption, with about 40 percent of farmers reporting that they participate in these initiatives. Regulatory changes proposed over the past three to five years in various countries are likely to affect the direction of agtech adoption and innovation. For example, Europe’s proposed Green Deal (parts of which focuses on overall reduction and exposure to agricultural inputs) is widely expected to have a moderating impact on farmers’ fertilizer and pesticide usage. There are also proposed changes to Canada’s 2030 Emission Reduction Plan that aim to lower emissions from fertilizer application. These are likely to drive the adoption of agtech innovations such as farm-management software solutions and precision-agriculture technologies—alongside a shift toward using inputs with lower greenhouse-gas emissions. In practice, agtech solutions have the potential to support farmers in optimizing the application of high-emission inputs. For example, high-resolution fertility mapping, when coupled with variable-rate applications of fertilizer, can both optimize and increase productivity of fertilizer usage and prevent over application. The combination of AI-backed machine vision and automatic nozzle shutoffs on GPS-guided spray equipment can also significantly maximize the efficiency of herbicide application and prevent costly overlap. In addition to concerns about biodiversity loss and water pollution through the overuse of chemical fertilizers, a pertinent issue affecting farming globally is the collision of rising global temperatures and declining freshwater pools—both visible and underground. Water management is likely to gain more attention, receiving increasing societal and regulatory pressure. New solutions can be found in agtech to address freshwater usage and waste from agricultural practices. For example, remote-sensing technologies that detect plant health or stress, soil-moisture sensors that communicate with irrigation systems, advanced weather-forecasting solutions, and the software interfaces that connect them all, could be effective tools in increasing the sustainability and social responsibility of farm irrigation practices. Continued business model evolution Despite start-up and investment interest in farm-management software solutions, cost is a major barrier for farmers, with 47 percent of respondents citing it as a top concern (Exhibit 3). 3 In fact, 50 percent of farmers globally are unwilling to pay for these solutions at all—this may be because input manufacturers, distributors, and equipment companies have historically offered deep discounts or no-charge subscriptions to comprehensive digital platforms, leaving farmers to question the ROI of newer offerings. Although there is higher agtech adoption in larger farms, the number of small and medium farms with limited adoption in the developed world presents a significant market opportunity, though product offerings would need to be tailored for these operations. For farms of all sizes and income levels, ease of access would enable agtech’s potential to positively impact livelihoods and the environment globally. A clearer value proposition that focuses on ROI will likely encourage more adoption—30 percent of farmers cited an unclear ROI as a top barrier to adoption and, based on their responses, the minimum-expected ROI to consider adoption is 3:1. This suggests that the current solutions’ impacts aren’t easily measurable. Agtech companies are presently trying to move away from one-time purchases and flat-fee annual renewals of software or solutions and focus more on business-model adaptation and exploration. They are also shifting toward monetizing solutions with combinations of hardware, software, services, and analytical innovations to enhance the financial viability of their businesses. Usage-based models (for example, $\/per acre, $\/per module\/per acre) are by far the most common pricing models, with prices as low as $1 an acre to as high as $60 an acre. Despite the attractiveness of these models to agtech players, even products in the lower per-acre price range have struggled to scale. Demonstrating the ROI of agtech solutions to farmers is challenging. Productivity gains (such as yield increase and yield stability) are confounded by a host of variables that affects overall performance. For example, external factors (including extreme weather events) often mask any improvements, especially where farmers are only testing the solutions on select areas of land. Models with fewer up-front expenditures for hardware, such as leasing or renting, and scalable pricing structures (for instance, per acre, module, or sensor) are expected to be the easiest models with which to grow adoption. This may be particularly relevant in the upcoming years where 31 percent of farmers are projecting lower profits than in years before. Now that agtech suppliers can offer more than one-off point solutions, there is increased interest in building digital capabilities and marketplaces. By leveraging farmer data, integrated players (such as input retailers) are increasingly motivated to gain meaningful insights into their customers’ behaviors, hoping to identify synergistic opportunities for up-sell and cross-sell. Product personalization and trust Given agtech suppliers’ increasing interest in the value of farmer data, and their accompanying digital channels and cloud-based software offerings, the underlying assumption has been that data-ownership worries harbored by farmers will not persist—however, survey results indicate that is not the case. Beside cost and ROI, farmers remain concerned about whom has access to their data, with 20 percent of farmers globally citing this as a top barrier for adopting farm-management software. Farmers in North America lead all regions in their concerns about data sharing (25 percent), whereas Asian farmers are the least concerned (18 percent). Products that offer greater personalization and provide science-backed, actionable insights around input optimization are the ones most likely to foster trust and gain traction in the current inflationary environment. This is particularly important when developing agtech products that are meant to have functionality for both specialty- and row-crop farmers, as there are distinctions between crop physiology, cultural practices, grades, and end-market uses for each. Platforms that are designed for row-crop farmers and then are applied to specialty-crop farmers are unlikely to achieve farmer buy-in and create impact. Instead, companies wishing to support specialty-crop farmers could focus on a systems approach to develop actionable insights that cater to the interdependencies of all facets of production. Digital channels by which farmers learn about and acquire products also require further attention. Despite start-up and incumbent interest in online platforms, survey results suggest that fewer than 12 percent of farmers globally strongly prefer to buy products online. When asked about what makes them hesitant to shop online, farmers indicate that online storefronts do not provide a satisfactory customer experience or offer customized recommendations (Exhibit 4). This is more important in certain product categories than others—for example, evaluating new seed varieties requires more dialogue with sales experts, compared to the routine purchase of equipment replacement parts. 4 Surveyed farmers perceive agronomists to be the most trustworthy source of information, followed by neighboring farmers, sales representatives, and lastly, online sources. This may be because agronomists often have deep regional expertise, local ties, and are able to tailor recommendations to farmers’ needs, while providing one-on-one connection by visiting and phoning farmers. Our previous article on farmers value digital engagement, shows that agtech solution providers have an opportunity to blend technical innovation with local knowledge to provide tailored recommendations to farmers. Current pain points and further adoption could be addressed by concurrently analyzing past growing behaviors, harnessing advancements in satellite imaging and machine learning to circumvent the need for up-front data sharing, and drawing on hyperlocal agronomic insights from agronomists, sales representatives, and other experts. Time to seize the opportunities The agtech space offers immense opportunities to stimulate farmer buy-in, but more work lies ahead to drive adoption. We have identified four key areas: Personalizing products and business models: The current adoption of agtech varies across diverse farm sizes and regions. Moreover, specialty- and row-crop farmers each have distinct requirements for agtech solutions. Agtech players now have the chance to further personalize products and business models, as well as offer more targeted solutions for small and medium farmers. By focusing on the uniqueness of each farmer’s operations, agtech innovators can develop clear value propositions for their technologies, highlighting ROI with measurable KPIs. For example, an agtech company retooled its commercial model by pairing sales with technical representatives, which allowed for a more personalized selling approach. As a result, the company was able to articulate its value proposition more clearly to farmers, while highlighting the ROI through a comprehensive pricing strategy that allowed flexibility for additional value-added services to farmers. Making the customer journey easier: Agtech companies could explore solutions to elevate their customer experience. Given differences in the needs as well as the average age of farmers globally, increased product testing that leverages user-experience design principles could help solve farmers’ pain points in a more personalized way. Although streamlining customer-support operations through digital interfaces is becoming more common (with support videos, web messaging, and AI-assisted chat bots), including more traditional, trusted person-to-person technical support has the potential to help drive adoption. Renewing trust in data storage and sharing: Considering the hesitancy that farmers express about sharing data, agtech start-ups can build trust by honing their data strategy, streamlining data collection, and gathering only the information that is essential to deliver better products and solutions to farmers. Integrating solutions versus amassing point-based solutions: Agtech leaders can unlock more value by tapping into data from different sources—such as field-based sensors, satellites, farm equipment, and both public and for-sale private sources—and ensure that their technology can integrate with the large set of solutions already used by farmers. Past players have attempted to grow adoption by moving away from standalone measurements toward providing suites of measurements across farmers’ entire operations. However, a middle ground that has a greater emphasis on insights might be more suitable. For example, an agtech company started out by offering a snapshot of a farmer’s crop health by drawing on a point-based solution, but it struggled to scale in its business model. By leveraging the strong intellectual property already developed, the company was able to bring in high volumes of data from disparate sources. With the use of advanced machine learning and analytics, all data sources were integrated into its platform to provide actionable insights using a user-friendly interface. This allowed the company to change its business model away from B2C toward more attractive B2B intermediaries, where the insights proved more valuable than the measurements themselves. Farmers are currently facing immense challenges: price increases, extreme weather events, shifting consumer behavior, and a changing regulatory environment. Agtech has an opportunity to play an even more central role—if there is a concerted focus on solving the persistent challenges of the past decade around ROI, cost, and data gathering. When done well, greater agtech adoption can lead to more inclusive and sustainable growth for farmers, and benefit conscious consumers and investors beyond the farm gate.","filter_flag":1}
{"title":"Drapers investigates: how fashion retail is carbon offsetting - Drapers","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmRyYXBlcnNvbmxpbmUuY29tL2luc2lnaHQvYW5hbHlzaXMvZHJhcGVycy1pbnZlc3RpZ2F0ZXMtaG93LWZhc2hpb24tcmV0YWlsLWlzLWNhcmJvbi1vZmZzZXR0aW5n0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmRyYXBlcnNvbmxpbmUuY29tL2luc2lnaHQvYW5hbHlzaXMvZHJhcGVycy1pbnZlc3RpZ2F0ZXMtaG93LWZhc2hpb24tcmV0YWlsLWlzLWNhcmJvbi1vZmZzZXR0aW5n0gEA?oc=5","id":"CBMia2h0dHBzOi8vd3d3LmRyYXBlcnNvbmxpbmUuY29tL2luc2lnaHQvYW5hbHlzaXMvZHJhcGVycy1pbnZlc3RpZ2F0ZXMtaG93LWZhc2hpb24tcmV0YWlsLWlzLWNhcmJvbi1vZmZzZXR0aW5n0gEA","guidislink":false,"published":"Tue, 14 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=45, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmRyYXBlcnNvbmxpbmUuY29tL2luc2lnaHQvYW5hbHlzaXMvZHJhcGVycy1pbnZlc3RpZ2F0ZXMtaG93LWZhc2hpb24tcmV0YWlsLWlzLWNhcmJvbi1vZmZzZXR0aW5n0gEA?oc=5\" target=\"_blank\">Drapers investigates: how fashion retail is carbon offsetting<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Drapers<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Drapers investigates: how fashion retail is carbon offsetting - Drapers","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmRyYXBlcnNvbmxpbmUuY29tL2luc2lnaHQvYW5hbHlzaXMvZHJhcGVycy1pbnZlc3RpZ2F0ZXMtaG93LWZhc2hpb24tcmV0YWlsLWlzLWNhcmJvbi1vZmZzZXR0aW5n0gEA?oc=5\" target=\"_blank\">Drapers investigates: how fashion retail is carbon offsetting<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Drapers<\/font>","source.href":"https:\/\/www.drapersonline.com","source.title":"Drapers","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"At last October's United Nations Climate Change Conference, COP27, scientists predicted 2022 global carbon dioxide emissions from burning fossil fuel would increase 1% on 2021, to 36.6 billion tonnes of carbon dioxide CO2, driven primarily by an increase in global travel as Covid-19 restrictions eased. Scientists warn this will make it harder for the world to avoid disastrous levels of climate change: with the UN’s Intergovernmental Panel on Climate Change (IPCC) – an intergovernmental body tasked with advancing knowledge about climate change caused by human activities – says greenhouse gas emissions, which are mainly CO2, must decrease 43% by 2030 to limit global warming to 1.5 degrees Celsius in accordance with the 2015 Paris Agreement and escape its most severe impacts. Amid this spiralling carbon crisis, many fashion businesses acknowledge they must play a part in reducing emissions. Estimates vary, but the fashion industry is thought to contribute between 2% and 8% of annual global carbon emissions, according to various reports and estimates – from the raw materials used, transportation, manufacturing, product use (washing and drying by the wearer) to end of life, when many items are incinerated or sent to landfill rather than recycled. For companies with long, complex supply chains, businesses built on manufacturing and selling new products, reducing emissions is not simple. One of the ways many – including Aldo and Kering Group-owned Gucci, Saint Laurent and Balenciaga – do so is by carbon offsetting (see box): purchasing reductions in or the removal of carbon dioxide from the atmosphere from third parties to compensate for emissions generated by the business. While this does have some impact on reducing carbon levels, offsets are controversial, critics say they are an apologia for emitting and mean that businesses do not have to change their behaviour, and fraught with challenges. Those wanting to use them should consider a range of factors before doing so, say brands, activists and carbon reduction experts. Read more: Drapers Sustainable Fashion Conference 2023 Read more: Why Ganni is investing in carbon insetting Read more: What's next for sustainability in 2023? Many fashion businesses have been carbon offsetting for years. As the climate crisis has climbed higher up the global agenda, the business case for reducing emissions has become clearer, and standards such as B Corp certification – for which businesses must prove high standards of social and environmental performance – more coveted. For example, Marks & Spencer purchased 2 million tonnes of carbon offsets for an undisclosed sum between 2012 and 2017 as part of its Plan A sustainability plan, through programmes such as Unicef’s carbon-offset project, which funded 40,000 fuel-efficient cooking stoves in Bangladesh in 2014, as well as creating more than 150 new jobs for local people who were trained to manufacture, market and install the stoves. Global footwear brand Aldo purchases offsets from clean energy projects in India and China, as well as a forest conservation project in the Amazon. Advertisement Prices and projects vary. Nature-based projects are at the higher end, charging an average of $14.40 (£11.73) per tonne of carbon, while industrial gas destruction projects, which destroy emissions so they are not released into the atmosphere, are among the cheapest. Projects on the lower end of the market can charge less than $1-2 (80p - £1.61) per tonne. Others have started carbon insetting: financing carbon-reducing projects in their own supply chains (see box), such as premium Danish fashion brand Ganni and British luxury label Burberry – which set up its regeneration fund in 2020 to invest in both carbon offsetting and insetting projects, such as regenerative farming, which can help sequester (remove from the atmosphere) carbon (see box) with wool producers in Australia. Since 2021, M&S has not used offsets to maintain its carbon-neutral status, which it achieved in 2012, instead redirecting funds that would have been invested in offsets into its Climate Innovation Fund set up in June 2022 to support projects in its supply chain and operations. Edzard van der Wyck is co-founder and CEO of British brand Sheep Inc, which sells merino wool knitwear globally, direct to consumer via its website. It is a carbon negative business rather than just carbon neutral(see box), through ensuring products are biodegradable, minimising the carbon footprint of its manufacturing process, and allocating 5% of all revenues to biodiversity projects, with investments vetted by an independent advisory panel of climate change experts. Van der Wyck says offsetting can play a part in the battle against emissions, but warns businesses to be conscientious in which programmes they select. “Carbon offsetting definitely has a place in the market,” he tells Drapers. “It has to, while [the fashion industry is] still figuring out trying to improve, and industries have to evolve, because things can't simply change [overnight]. The second you carbon offset, [businesses] are immediately vilified [by industry and climate crisis observers], but there has to be a nuanced conversation about it. It’s not black and white – carbon offsetting is a grey area.” Advertisement However, van der Wyck notes that carbon offsetting is “a bit of a cowboy market”, pointing to some treeplanting schemes as an example of projects that can sometimes do more environmental harm than good: “It’s an uncomfortable reality. In New Zealand there are tree-planting exercises happening where farmers just plant a certain type of tree in these vast areas, and it's destroying the natural mix [of the environment].” He says this type of project is easy to sell to businesses because the idea of planting trees is straightforward and appealing, and simple to communicate to fashion customers: “But these are just saplings. They're tiny trees that take years to grow [into mature trees that will sequester large amounts of carbon]. “It's also getting harder and harder to verify all these projects. Sometimes they happen in faraway countries, or where maybe the auditing is not as strict as it should be or they don't audit it that often. Projects can kind of fall into disarray. It's very hard to know you're actually having a proper impact. You have to actually look at the data that sits behind it. It’s really important to understand the impact of projects that you're investing in.” Ganni’s sustainability director, Lauren Bartley, agrees, telling Drapers that carbon offsetting is an “opaque” approach offering businesses limited visibility and control over the schemes from which they purchase offsets. Because of this the Danish brand announced in February 2022 that it was no longer offsetting, and began carbon insetting later that year. She says: “Through insetting, we can forge stronger partnerships with our suppliers and be the lead investor in our own projects. This gives us full visibility of projects and their impact.” Swiss sneaker and sportswear brand On is stocked in the UK by retailers such Office, JD Sport, Selfridges and Harrods, and opened its first UK store on 10 February, on London's Regent Street. It has a keen focus on manufacturing products with as low a carbon footprint as possible. Ilmarin Heitz, On’s global head of innovation, says that reducing emissions in a business’s own supply chain is essential: “Lowering our carbon footprint is an important goal. However, it encompasses much more than carbon offsetting. At On, we believe innovation and sustainability go hand-in-hand. As we envision a future where every On product is fossil-free and is engineered for circularity, sustainability has become a main driver when designing a product.” As well as purchasing carbon offsets from projects developing fibre-to-fibre recycling techniques – turning textile waste into new fibers for clothing – it has reduced the use of airfreight from 39% of products shipped in 2019 to 12% in 2020 and continued to hold it at 12% in 2021, and works with its factories in its supply chain to reduce waste and be more energy efficient. The brand is also researching the use of carbon emissions to create a primary raw material for a shoe’s midsole. In September 2022, On revealed the first-ever shoe made from carbon emissions, called Cloudprime. The shoe is made from CleanCloud EVA (ethylene-vinyl acetate) foam that uses carbon emissions as a raw material. Heitz says: “The beauty of this project is that we capture harmful emissions before they enter the atmosphere, and at the same time we are moving away from [using] fossil feedstock [fuel or raw material for manufacturing made from fossilised carbon products, such as crude oil].” For Tamara Cincik, founder and CEO of Fashion Roundtable – a thinktank dedicated to driving greater responsibility in the fashion industry – like Van der Wyck, urges businesses to be wary of ineffective offsetting projects: “Carbon credits are a relatively new market and in a consumerist landscape, there is a danger of carbon offsetting and its schemes being used to meet KPIs while bolstering ‘green’ credentials. “There are many fashion initiatives that claim to offset a company’s carbon through planting trees – an example is where a tree is planted for every order placed. The same trees will be planted in one place at mass. This is known to decrease nutrients from the soil and also impact on the diversity of bacteria that are critical to the balance of soil. “This [emissions reduction] requires long-term thinking and our research points to the fact that much of the work around carbon offsetting is short-termist. Take the example of Microsoft’s efforts to offset its carbon, by planting trees, which later burned down in a forest fire [in August 2021, in Washington and Oregon, US, a fire destroyed forestry projects used by companies including BP and Microsoft to offset their carbon emissions].” Cincik urges fashion businesses to consider investing in regenerative farming as “something which goes beyond soil health and instead looks at improving the land instead of causing harm”. She adds: “This ultimately leads to healthier soil with the capabilities of working towards healthier communities.” Footwear brand Allbirds uses offsets to reduce its carbon emissions, as well as using ocean liner shipping instead of air, working with third-party factories in its supply chain to increase renewable energy use, and using low-carbon materials – plant leathers with 40 times less carbon impact than traditional leather, and avoiding petroleum-based synthetics, for example. “It’s an ‘and’ strategy, not an ‘either\/or’ strategy,” Hana Kajimura, head of sustainability, tells Drapers, of the combination of Allbirds’ offsetting and work on its own emissions. “We've been a carbon-neutral company since 2019 [certified by Climate Neutral, a non-profit organisation that measures the impact of the carbon dioxide equivalent that brands measure, remove, avoid, and reduce]. We tax ourselves for every tonne of CO2 that we emit, and all of that money goes into a pool. And at the end of the year, we invest in projects that reduce or avoid emissions, to find out what our footprint was in the air. And that's all in addition to very aggressive reduction targets. “In terms of the specific projects we fund, the first thing we do is purchase renewable energy credits against all of our electricity footprints [more than 40% of energy-related CO2 emissions are caused by the burning of fossil fuels for electricity generation], to match like for like with that part. And then with what's remaining, we do a combination of projects, but try to invest in nature-based projects as much as possible.” Renewable energy credits generate one MW\/hour of electricity from a renewable energy source for use elsewhere. Allbirds also funds projects in renewable energy and lower carbon farming, such as the Capricorn Ridge Wind initiative, a wind farm in Texas. Kajimura says: “Like anything in the climate crisis, there's no perfect solution. So, yes, you can find companies that are just planting trees and continuing to pollute not doing anything to reduce their footprint. You can find offset projects that aren't doing what they say they should. Of course, there are flaws. But there's also a lot of good. \"My fear is that we throw out all the good with the bad by painting offsets with a broad brush. It's just making sure that all of the projects that we do invest in one are certified to best in class, third party standards, ensuring that the developers of the project have gone through all the hoops to prove that it's going to be well managed and that there are mechanisms in place to control for challenges. And then Climate Neutral is an additional check on top of that offset certification to make sure that we're doing this all responsibly. We're always going to be doing both reducing [carbon emissions] and some form of offsetting. We will just have to buy fewer and fewer offsets.” Margaret Kim, CEO of Gold Standard – a certification programme for emission reductions – agrees with Kajimura that verification is critical: “If carbon markets are to be an effective tool [in reducing global emissions], buyers need to be assured that each credit they purchase is really removing 1 tonne of carbon from the atmosphere. “Some project types are not eligible under the Gold Standard carbon crediting issuance, such as those that could prolong or expand the use of fossil fuels, large hydro restrictions, and avoided deforestation (REDD+) [protecting forests that would otherwise be cleared for use] projects. The reasons vary, but the general rule is that there are too many shortcomings and uncertainties be confident of their impact, and therefore we do not believe these projects should be funded by carbon credits. Credits created from such projects are like the ‘fast fashion’ of the carbon market: lower quality, produced quickly and with uncertain impacts.” Kim points to projects seeking to make vehicle engines more efficient as an example of those that, while certainly reducing emissions, may have the \"perverse effect of extending the life of the vehicle and incentivise further use of fossil fuel\" - hence Gold Standard does not support them. While carbon offsetting should not be dismissed, fashion businesses wanting to use offsets must thoroughly research programmes if they are to have a genuine impact on emissions, and to avoid doing more damage to the environment or investing in sham projects. They must also simultaneously invest directly into reducing emissions within their own supply chains: the climate crisis will not wait.","filter_flag":1}
{"title":"Alberta invests $58 million in Canadian circular economy projects - Recycling Product News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnJlY3ljbGluZ3Byb2R1Y3RuZXdzLmNvbS9hcnRpY2xlLzM5ODczL2FsYmVydGEtaW52ZXN0cy1kb2xsYXI1OC1taWxsaW9uLWluLWNhbmFkaWFuLWNpcmN1bGFyLWVjb25vbXktcHJvamVjdHPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnJlY3ljbGluZ3Byb2R1Y3RuZXdzLmNvbS9hcnRpY2xlLzM5ODczL2FsYmVydGEtaW52ZXN0cy1kb2xsYXI1OC1taWxsaW9uLWluLWNhbmFkaWFuLWNpcmN1bGFyLWVjb25vbXktcHJvamVjdHPSAQA?oc=5","id":"CBMieWh0dHBzOi8vd3d3LnJlY3ljbGluZ3Byb2R1Y3RuZXdzLmNvbS9hcnRpY2xlLzM5ODczL2FsYmVydGEtaW52ZXN0cy1kb2xsYXI1OC1taWxsaW9uLWluLWNhbmFkaWFuLWNpcmN1bGFyLWVjb25vbXktcHJvamVjdHPSAQA","guidislink":false,"published":"Tue, 21 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=52, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnJlY3ljbGluZ3Byb2R1Y3RuZXdzLmNvbS9hcnRpY2xlLzM5ODczL2FsYmVydGEtaW52ZXN0cy1kb2xsYXI1OC1taWxsaW9uLWluLWNhbmFkaWFuLWNpcmN1bGFyLWVjb25vbXktcHJvamVjdHPSAQA?oc=5\" target=\"_blank\">Alberta invests $58 million in Canadian circular economy projects<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Recycling Product News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Alberta invests $58 million in Canadian circular economy projects - Recycling Product News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnJlY3ljbGluZ3Byb2R1Y3RuZXdzLmNvbS9hcnRpY2xlLzM5ODczL2FsYmVydGEtaW52ZXN0cy1kb2xsYXI1OC1taWxsaW9uLWluLWNhbmFkaWFuLWNpcmN1bGFyLWVjb25vbXktcHJvamVjdHPSAQA?oc=5\" target=\"_blank\">Alberta invests $58 million in Canadian circular economy projects<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Recycling Product News<\/font>","source.href":"https:\/\/www.recyclingproductnews.com","source.title":"Recycling Product News","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"The Government of Alberta is advancing the province's circular economy by committing $58 million through Emissions Reduction Alberta (ERA) to projects across the province worth $528 million in public and private investment. All funding is sourced from the province's Technology Innovation and Emissions Reduction (TIER) fund. Producing high-quality fertilizer for farmers, recycling asphalt from roof shingles, sequestering carbon in concrete, and novel plastics recycling are some examples of the technology solutions receiving funding through ERA's circular economy challenge. If successful, these projects will result in cumulative greenhouse gas (GHG) reductions of up to 4 million tonnes by 2050 – equal to offsetting the GHG footprint of 1 million homes. The funding is expected to create 1835 person-year jobs in Alberta and have a $350 million GDP impact in the province by 2025. The investment aligns with provincial initiatives including the proposed extended producer responsibility (EPR) approach, the agricultural plastics recycling initiative, and the natural gas vision and strategy's goal to establish Alberta as a centre of excellence for plastics diversion and recycling. \"Advancing technology solutions that support a circular economy makes good environmental and economic sense. Circular economy challenge projects supported by the TIER fund will help keep valuable materials in the economy and out of landfills, which drives investment, bolsters economic activity, cuts emissions, and creates jobs. It's a win across the board,\" says Sonya Savage, minister of environment and protected areas. \"A more sustainable, diversified provincial economy requires using our resources more wisely, we need to think about waste as a resource rather than a cost. This investment in converting waste into other uses is going to make a real difference,\" adds Justin Riemer, CEO of Emissions Reduction Alberta Circular Economy Challenge projects support waste reduction, material, and feedstock substitution, value recovery, and reduction of the lifecycle environmental footprint of materials and products. These technology solutions can reduce the impacts of material production, processing, and disposal. The invested innovations will support industry competitiveness, new venture creation, and economic diversification. Projects that will receive funding Northstar Clean Technologies Inc. The project will design, build, and commence operations of a new asphalt roof shingles recycling facility. ERA funding: $7.1 million | Project cost: $20.6 million Sparks Eggs Dehydrate inedible eggs from an existing grading and packing facility into a powder to be used for pet food and animal feed. ERA funding: $500,000 | Project cost: $1 million Rimrock Renewables LP. Treat the byproduct of the anaerobic digestion process to produce fertilizer, peat, cattle bedding, and clean water on-site. ERA funding: $8.4 million | Project cost: $19 million Hydrovac Waste Solutions Ltd. Divert slurry from the landfill and recover valuable products from the hydro-vacuum process. ERA funding: $1.7 million | Project cost: $8 million Carbon Upcycling Technologies Demonstrate a commercial-scale carbon sequestration and utilization technology for the cement and concrete sector. ERA funding: $4.4 million |Project cost: $11 million Phyto Organix Foods Inc. Construction of a large-scale, commercial, net zero yellow pea fractionation facility. ERA funding: $10 million | Project cost: $231 million Suncor Energy Inc. Recover Vanadium, a valuable critical metal\/element, from the fly ash by-product from coke-fired boilers and use it in the growing energy storage market. ERA funding: $7 million | Project cost: $36 million INCA Renewtech Construct and operate a first-of-kind commercial facility to create a sustainable, advanced bio-composite material made from hemp stalk. ERA funding: $10 million | Project cost: $174.5 million Circular Rubber Technologies Inc. Reclaim rubber from end-of-life, high-grade tires from industrial activities and sell the end product back to manufacturers for use in new tires. ERA funding: $3.2 million | Project cost: $16 million RBW Waste Management Ltd. Install and commission a recycling system for high-density polyethylene containers used to transport liquid and solid wastes and process them into new products. ERA funding: $700,000 | Project cost: $1.4 million","filter_flag":1}
