{"title":"Chapter 4: Customers' cooperation key to Flex's 2030 sustainability strategy - Compliance Week","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5jb21wbGlhbmNld2Vlay5jb20vY2FzZS1zdHVkaWVzL2NoYXB0ZXItNC1jdXN0b21lcnMtY29vcGVyYXRpb24ta2V5LXRvLWZsZXhzLTIwMzAtc3VzdGFpbmFiaWxpdHktc3RyYXRlZ3kvMzMwNDguYXJ0aWNsZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5jb21wbGlhbmNld2Vlay5jb20vY2FzZS1zdHVkaWVzL2NoYXB0ZXItNC1jdXN0b21lcnMtY29vcGVyYXRpb24ta2V5LXRvLWZsZXhzLTIwMzAtc3VzdGFpbmFiaWxpdHktc3RyYXRlZ3kvMzMwNDguYXJ0aWNsZdIBAA?oc=5","id":"CBMigwFodHRwczovL3d3dy5jb21wbGlhbmNld2Vlay5jb20vY2FzZS1zdHVkaWVzL2NoYXB0ZXItNC1jdXN0b21lcnMtY29vcGVyYXRpb24ta2V5LXRvLWZsZXhzLTIwMzAtc3VzdGFpbmFiaWxpdHktc3RyYXRlZ3kvMzMwNDguYXJ0aWNsZdIBAA","guidislink":false,"published":"Thu, 11 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=131, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5jb21wbGlhbmNld2Vlay5jb20vY2FzZS1zdHVkaWVzL2NoYXB0ZXItNC1jdXN0b21lcnMtY29vcGVyYXRpb24ta2V5LXRvLWZsZXhzLTIwMzAtc3VzdGFpbmFiaWxpdHktc3RyYXRlZ3kvMzMwNDguYXJ0aWNsZdIBAA?oc=5\" target=\"_blank\">Chapter 4: Customers' cooperation key to Flex's 2030 sustainability strategy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Compliance Week<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Chapter 4: Customers' cooperation key to Flex's 2030 sustainability strategy - Compliance Week","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5jb21wbGlhbmNld2Vlay5jb20vY2FzZS1zdHVkaWVzL2NoYXB0ZXItNC1jdXN0b21lcnMtY29vcGVyYXRpb24ta2V5LXRvLWZsZXhzLTIwMzAtc3VzdGFpbmFiaWxpdHktc3RyYXRlZ3kvMzMwNDguYXJ0aWNsZdIBAA?oc=5\" target=\"_blank\">Chapter 4: Customers' cooperation key to Flex's 2030 sustainability strategy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Compliance Week<\/font>","source.href":"https:\/\/www.complianceweek.com","source.title":"Compliance Week","query":"https:\/\/news.google.com\/rss\/search?q=\"Reverse logistics\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Editor’s note: Compliance Week’s four-part case study, “Reaching into the value chain: How Flex helps drive sustainability beyond its walls,” is available exclusively to CW members. A critical prong of Flex’s 2030 sustainability strategy is reducing Scope 3 emissions on the customer side. The global manufacturer pledged 70 percent of certain customers would have science-based targets by 2025. The segment of customers targeted was identified by their emissions covering purchased goods and services, capital goods, and use of sold products. This is a mighty goal, considering “use of sold products” constitutes the lion’s share of Flex’s Scope 3 emissions annually. In 2021, the category accounted for 93 percent of Flex’s total Scope 3 emissions. “Purchased goods and services” and “capital goods” translated to 6.11 percent and 0.26 percent of Scope 3 emissions, respectively. The Greenhouse Gas Protocol offers guidance on 15 categories of Scope 3 carbon emissions. According to the guidance, “purchased goods and services” are tangible and intangible products acquired by Flex from a direct supplier each year: materials, parts, office furniture, and IT support, for example. “Capital goods” are physical products owned by Flex—machinery, facilities, vehicles, etc.—used to manufacture customers’ merchandise. Direct emissions from capital goods fall into Flex’s Scope 1 and 2 emissions, but emissions tied to the production of capital goods fall into Scope 3. Flex is primarily a contract manufacturer, with a finger in every pie. From motherboards to mobile phones to air treatment systems to respiratory equipment, Flex plays an integral role in the mass production of industry-leading products. Yet, it has little control over its inventory of “purchased goods,” which are dictated by its customers. This fact is problematic for a company keen on reducing emissions upstream. “We could get a bid from a company tomorrow to build something for them where the products are already designed and they have already done a lot of the prework. It makes it really hard to control, long term, your Scope 3 emissions,” said David Gessler, vice president of procurement and supply chain management at Flex.","filter_flag":1}
{"title":"{Super SCM Makers} IKEA India: The Digitization of Supply Chain - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vYXJ0aWNsZS90ZWNobm9sb2d5LWUtY29tbWVyY2UvZGlnaXRhbC10cmVuZHMvc3VwZXItc2NtLW1ha2Vycy1pa2VhLWluZGlhLWRpZ2l0aXphdGlvbi1zdXBwbHktY2hhaW7SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vYXJ0aWNsZS90ZWNobm9sb2d5LWUtY29tbWVyY2UvZGlnaXRhbC10cmVuZHMvc3VwZXItc2NtLW1ha2Vycy1pa2VhLWluZGlhLWRpZ2l0aXphdGlvbi1zdXBwbHktY2hhaW7SAQA?oc=5","id":"CBMigQFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vYXJ0aWNsZS90ZWNobm9sb2d5LWUtY29tbWVyY2UvZGlnaXRhbC10cmVuZHMvc3VwZXItc2NtLW1ha2Vycy1pa2VhLWluZGlhLWRpZ2l0aXphdGlvbi1zdXBwbHktY2hhaW7SAQA","guidislink":false,"published":"Thu, 04 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=4, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=124, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vYXJ0aWNsZS90ZWNobm9sb2d5LWUtY29tbWVyY2UvZGlnaXRhbC10cmVuZHMvc3VwZXItc2NtLW1ha2Vycy1pa2VhLWluZGlhLWRpZ2l0aXphdGlvbi1zdXBwbHktY2hhaW7SAQA?oc=5\" target=\"_blank\">{Super SCM Makers} IKEA India: The Digitization of Supply Chain<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"{Super SCM Makers} IKEA India: The Digitization of Supply Chain - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vYXJ0aWNsZS90ZWNobm9sb2d5LWUtY29tbWVyY2UvZGlnaXRhbC10cmVuZHMvc3VwZXItc2NtLW1ha2Vycy1pa2VhLWluZGlhLWRpZ2l0aXphdGlvbi1zdXBwbHktY2hhaW7SAQA?oc=5\" target=\"_blank\">{Super SCM Makers} IKEA India: The Digitization of Supply Chain<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Reverse logistics\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"FROM BYTES TO BITES: How AI is Transforming Food and Agriculture The world's population is experiencing a rapid surge, and it is foreseen to approach a staggering 9.7 billion individuals by the year 2050. Consequently, this escalating growth has engendered a mounting apprehension regarding the ability to satisfy the escalating demand for sustenance, all while ensuring the vital aspects of food security and sustainability remain intact. In light of these concerns, the integration of artificial intelligence (AI) applications in the agri-food sector holds extraordinary potential to revolutionize the industry, heralding a new era of heightened sustainability. Artificial intelligence (AI) embodies the capacity of machines or computer programs to undertake endeavours typically reliant on human intellect, encompassing domains such as learning, reasoning, problem-solving, and decision-making. The realm of AI encompasses diverse subfields, each contributing unique capabilities to this expansive discipline. These subfields encompass machine learning (ML), deep learning, natural language processing, computer vision, robotics, and cognitive computing. Within AI technology, a plethora of algorithms emerges, including reinforcement learning, swarm intelligence, cognitive science, expert systems, fuzzy logic (FL), Artificial Neural Networks (ANN), and Logic Programming, offering a rich tapestry of tools to leverage in pursuit of intelligent automation. Innovative Applications of AI in Food and Agriculture GRAIN QUALITY Manual grain inspection is a time-consuming process and is prone to human error, which can result in the selection of lower-quality grains. Therefore, the use of computer vision systems in grain inspection is becoming increasingly popular. These systems use advanced imaging techniques and ML algorithms to analyse images of grains and identify defects or impurities, such as broken kernels, foreign materials etc. Back propagation neural network (BPNN) has been effectively used to classify rice grain varieties with great accuracy (96%), even with poor image quality. PEST DETECTION AND WEED MANAGEMENT Accurate identification of insect species, size variation, and stage of development is crucial for effective pest management in agriculture. By identifying the type and number of insects present in a crop field, farmers can take appropriate measures to control the pest population and prevent damage to their crops. Several AI and ML technologies are being developed and tested for insect detection and counting. Some of these technologies use computer vision algorithms, while others rely on ML algorithms to identify and classify different insect species. Similarly, herbicides have been widely used by farmers for many years to control weeds and improve crop yields. However, the overuse or improper application of herbicides can have negative impacts on both human health and the environment. To minimize the negative impacts of herbicides, there is a growing need for more precise and accurate application methods. Robotic weed control is also an emerging technology that shows great promise for the future of agriculture. Robotic weed control systems typically use computer vision and ML algorithms to detect and identify weeds in crop fields, then use robotic arms or other mechanical tools to remove or destroy the weeds. Although intelligent mechanical weed control would be more felicitous than weeding devices with cutting action, contrary to time-based weed removal, it is possible to remotely regulate the tendency of tines of spring-tine harrow prototype systems based on the conditions of soil, the density of weed, and crop production. CROP SELECTION AND YIELD IMPROVEMENT Robots, such as the Berry 5 Robot from Harvest Croo Robotics (Tampa, FL, USA), are designed to automate the harvesting of strawberries, which is a labour-intensive and time-consuming process. The robot uses computer vision and ML algorithms to identify and pick ripe strawberries at a faster rate than humans can. This can help farmers to reduce labour costs and improve their yields by ensuring that more strawberries are harvested at the optimal time. FOOD SAFETY COMPLIANCE AI enabled cameras are used to ensure safety compliance amongst food workers in food facility. This employs facial-recognition and object-recognition software to determine whether workers are complying with good personal hygiene as required by food safety law. If violation is found, it extracts the screen images for review which can be rectified in the real time. The accuracy of this technology is more than 96%. PRODUCT DEVELOPMENT AI technology uses machine learning and predictive algorithms to model consumer flavour preferences and predict how well they will respond to new tastes. The data can be segmented into demographic groups to help companies develop new products that match the preferences of their target audience. With these, manufacturers could know what products will thrive before the hit the shelves. Companies like SPOONSHOT are using AI techniques like NLP (natural language processing) and computer vision to build organised information from unstructured data. They leverage food science domain knowledge to process data relating to physical and chemical properties of ingredients to understand how ingredient interactions impact a final recipe. SPOONSHOT can scout 3B social conversations, 5M research papers, 84M articles, 4M products, 84M blogs etc to provide actionable insights around product concepts, product and menu innovations, consumer market insights, competitor analysis etc. MARKET RESEARCH AND SALES ENABLEMENT AI offers tremendous potential to assist in market research within the food industry, providing valuable insights and facilitating better decision-making. AI algorithms can analyse vast amounts of data, including consumer preferences, purchasing behaviour, and social media interactions related to food. By recognizing patterns and correlations, AI can identify emerging trends, understand consumer preferences, and predict future demands accurately. This information can help food businesses tailor their products, marketing strategies, and overall consumer experience to meet evolving customer needs. Social listening tools like CRIMSON HEXAGON and SYNTHESIO helps generate valuable insights around audience analysis, brand intelligence, campaign analysis, customer sentiment, market research, trend analysis, competitor analysis etc, helping make smarter, data-driven decisions. (11) In the current attention-driven economy, where capturing and retaining attention is challenging due to the overwhelming choices and distractions faced by consumers, traditional market research methods have their limitations. However, AI-powered research offers a promising solution by providing rapid, reliable, and actionable insights. Companies like THE LIGHTBULB.AI leverage AI-enabled technology to offer a range of research services. These include qualitative and quantitative research, ad testing, as well as UI\/UX testing. Their advanced capabilities encompass facial coding, eye tracking, speech transcription, text sentiment analysis, and audio tonality analysis. These modules enable comprehensive analysis and understanding of user experiences and preferences. By harnessing AI in research, businesses can overcome the shortcomings of traditional methods and gain a deeper understanding of consumer behaviour. AI-based research offers the advantage of speed, accuracy, and scalability, allowing companies to adapt swiftly to evolving market dynamics and make informed decisions based on robust data-driven insights. AI can significantly contribute to sales enablement by providing valuable insights, automating tasks, and enhancing overall sales efficiency. INFILECT, a leading provider of advanced retail visual intelligence, offers cutting-edge solutions that can greatly boost sales for organizations. With their advanced image recognition technology and retail data analytics capabilities, Infilect empowers businesses to improve shelf visibility and enhance store execution performance. By analysing visual data, such as product placement, stock availability, and planogram compliance, Infilect provides valuable insights to optimize sales strategies and improve overall retail performance. CONCLUSION In conclusion, the transformational power of AI in the food and agriculture industry is undeniable. From bytes of data to the very bites we consume, AI has become a driving force behind enhanced productivity, sustainability, and innovation. Through advanced algorithms and data-driven insights, AI is optimizing crop management, improving yield predictions, and revolutionizing farming practices. It is enabling precise monitoring of soil conditions, crop health, and irrigation needs, leading to resource-efficient and environmentally conscious agricultural operations. Furthermore, AI is enhancing food safety by rapidly detecting and mitigating risks associated with contaminants, pests, and diseases. It is facilitating traceability and supply chain transparency, ensuring that consumers have access to safe and high-quality food. Beyond the farm, AI is revolutionizing food production, from automated processing and packaging to personalized nutrition recommendations. It is driving the development of novel ingredients and flavors, expanding the boundaries of culinary creativity. However, it is essential to recognize that the adoption of AI in the food and agriculture sector is an ongoing journey. Challenges such as data privacy, infrastructure limitations, and ethical considerations must be addressed to fully harness the potential of AI while ensuring equitable access and sustainable practices. In this age of bytes and bites, AI holds the promise of a transformative future for food and agriculture, ushering in a new era of abundance, efficiency, and global nourishment. Let us seize the opportunities that lie ahead and embrace AI as a powerful ally in creating a more sustainable, resilient, and inclusive food system for generations to come. Bharat Sawnani is the founder of Elevantus with 14 years' experience across innovation, technology, quality, and 6 years in clinical pharmacokinetics.","filter_flag":1}
{"title":"Conheça 4 projetos de reciclagem do iFood - iFood","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vaW5zdGl0dWNpb25hbC5pZm9vZC5jb20uYnIvZW4vbm90aWNpYXMvY29uaGVjYS00LXByb2pldG9zLXJlY2ljbGFnZW0taWZvb2Qv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vaW5zdGl0dWNpb25hbC5pZm9vZC5jb20uYnIvZW4vbm90aWNpYXMvY29uaGVjYS00LXByb2pldG9zLXJlY2ljbGFnZW0taWZvb2Qv0gEA?oc=5","id":"CBMiU2h0dHBzOi8vaW5zdGl0dWNpb25hbC5pZm9vZC5jb20uYnIvZW4vbm90aWNpYXMvY29uaGVjYS00LXByb2pldG9zLXJlY2ljbGFnZW0taWZvb2Qv0gEA","guidislink":false,"published":"Wed, 17 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=137, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vaW5zdGl0dWNpb25hbC5pZm9vZC5jb20uYnIvZW4vbm90aWNpYXMvY29uaGVjYS00LXByb2pldG9zLXJlY2ljbGFnZW0taWZvb2Qv0gEA?oc=5\" target=\"_blank\">Conheça 4 projetos de reciclagem do iFood<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">iFood<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Conheça 4 projetos de reciclagem do iFood - iFood","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vaW5zdGl0dWNpb25hbC5pZm9vZC5jb20uYnIvZW4vbm90aWNpYXMvY29uaGVjYS00LXByb2pldG9zLXJlY2ljbGFnZW0taWZvb2Qv0gEA?oc=5\" target=\"_blank\">Conheça 4 projetos de reciclagem do iFood<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">iFood<\/font>","source.href":"https:\/\/institucional.ifood.com.br","source.title":"iFood","query":"https:\/\/news.google.com\/rss\/search?q=\"Reverse logistics\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"In 2021, iFood outlined an important goal in the area of environment: reduce the amount of plastic used in delivery by 50%. And one of the fronts on which the company works to achieve this objective is in initiatives related to recycling. iFood projects are based on three pillars: Raise awareness and engage society in recycling; Promote opportunities for the correct disposal of recyclables; Innovate circular economy solutions to recover waste from delivery. And the actions coordinated by the company seek to tie together several ends so that the entire recycling journey comes to fruition. “The environmental education of society, combined with the training and optimization of cooperatives, means that recycling is expanded”, says Camila Borges, senior sustainability analyst at iFood. “With this, we were able to promote the circularity of waste in the sector, generating socio-environmental impact in the places where we operate.” Discover, below, some of the company's programs to promote recycling. Follow iFood News on social media: Instagram It is Facebook. Voluntary Delivery Points iFood installed 48 PEVs Voluntary Delivery Points in four capitals to encourage people to recycle. “In Ferraz de Vasconcelos, in São Paulo, we also adopted a format in which an electric tricycle, used by our partner Collecting, enters the narrow streets of communities to collect recyclable waste from homes”, says Camila. iFood's action in this municipality in the metropolitan region of São Paulo also counts on the partnership of the NGO Generating Falcons. Re-cycle Fortaleza O Re-cycle appeared in 2022. It is a free recyclable collection platform run by the city of Fortaleza, sponsored by iFood and run by Startup Solos. Currently, it promotes selective collect door to door in homes, bars and restaurants in six neighborhoods of the municipality, reaching the mark of 370 tons of recyclables collected by June 2023. Collection is done by electric tricycles driven by collectors from associations selected to work on the project, empowering these professionals. Raquel Nascimento is one of the beneficiaries of Re-ciclo In eight months, she tripled her income from collections thanks to the project With the multiplication of income, Raquel can provide more comfort to her two daughters Collections are carried out using an electric tricycle The group of collectors he is part of carries out 50 collections per week One of the program's beneficiaries is Raquel Nascimento, 35 years old. She says that she has been collecting for five years, but that, in the last eight months, her working conditions and earnings have improved a lot. This happened thanks to the partnership that the association of which it is part, Moura Brasil, became part of the Re-ciclo project. “Before, we would go out in groups by truck or cart to make 5 collections a week”, says Raquel. “Today, we are able to carry out 50 collections weekly, leaving on 5 electric tricycles.” The work was all organized by routes, traveled regularly between 8am and 5pm, every day. Thanks to the new routine, Raquel tripled her monthly income. “Before, I earned between R$ 250 and R$ 300 per month”, he calculates. “Now I get R$ 900.” Additional income has not only a financial impact on your life, but also an affective and emotional one. After all, the increase in the budget allows her to provide “more comfort” for her two daughters, aged 6 and 12. “I buy better things for them, like clothes and food items,” he says. “I was also able to pay for tutoring for their studies.” Revert – recycling of Styrofoam® Isopor® is a material derived from plastic and 100% is recyclable. But logistics and volume issues make recycling difficult. iFood then launched, in November 2022, the Revert, a program to optimize logistics and the value of material sales. The project is carried out in partnership with TrashIn, a waste management and reverse logistics company. And it involves the acceleration of cooperatives through the application of technology, enabling them to recycle Styrofoam®. I've Been Bag iFood's bags, thermal backpacks, do not go to waste when they lose their usable condition. The project I've Been Bag, a reverse logistics action created in 2020, correctly disposes of the material that makes up the bags. Part of it is sent to a textile industry cooperative that reuses it in new products. Another part goes to the cement industry, where it replaces petroleum coke, a fossil fuel used in the furnaces of companies in the sector. The project is carried out in partnership with startup Brazilian GreenPlat, responsible for structuring collection logistics and environmentally correct disposal of backpacks, and with Shred, which transforms the bags in new products. Já Fui Bag recovered, in 2020 and 2021 alone, 124 tons of thermal backpacks.","filter_flag":1}
