{"title":"The future of materials - Deloitte","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvdGhlLWZ1dHVyZS1vZi1tYXRlcmlhbHMuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvdGhlLWZ1dHVyZS1vZi1tYXRlcmlhbHMuaHRtbNIBAA?oc=5","id":"CBMiWmh0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvdGhlLWZ1dHVyZS1vZi1tYXRlcmlhbHMuaHRtbNIBAA","guidislink":false,"published":"Fri, 02 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=153, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvdGhlLWZ1dHVyZS1vZi1tYXRlcmlhbHMuaHRtbNIBAA?oc=5\" target=\"_blank\">The future of materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deloitte<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The future of materials - Deloitte","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvdGhlLWZ1dHVyZS1vZi1tYXRlcmlhbHMuaHRtbNIBAA?oc=5\" target=\"_blank\">The future of materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deloitte<\/font>","source.href":"https:\/\/www2.deloitte.com","source.title":"Deloitte","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Introduction: Eastman was founded in 1920 in Kingsport, Tennessee, by Eastman Kodak and spun off by Kodak as a new entity in 1994. Today, it is a global specialty materials company that produces a broad range of products for everyday life, such as innovative films for electric vehicles and resins for high-performance medical devices.50 The company’s vision is to continue innovating to make materials that enhance the quality of life while also being a thought and action leader to define the path for circularity globally. To that end, Eastman works closely with others to address the triple challenge: climate change, the global water crisis, and caring for the global population.51 Problem: Kodak operated a methanolysis plant from the mid-1980s to the mid-2000s to chemically recycle used polyesters and manufacture the recycled content into new products. However, customer demand for a sustainable solution was not there, and the economics of that plant declined, eventually leading to its closure.52 Eastman began considering sustainability in its strategy again in the early 2000s.53 At that time, Eastman started to explore once again whether it could innovate around its existing assets to develop more sustainable business practices and how it could work with partners toward common goals to reduce waste and emissions. Solution: In 2019, Eastman announced that it would start two chemical-recycling projects. The first would leverage an existing coal-gasification facility in Kingsport that had initially been completed in 1983 to produce chemicals from syngas rather than from petroleum. This plant would use Carbon Renewal Technology (CRT) to recycle most complex waste plastics (with the exception of PVC (polyvinyl chloride)) into syngas.54 Eastman would then use that syngas to produce acetic acid and other acetyls, building blocks for advanced materials, additives, and fibers.55 The second project would leverage the methanolysis technology originally developed by Kodak in the 1980s to break down PET into MEG and DMT, which Eastman would further manufacture into specialty copolyesters.56 This Polyester Renewal Technology (PRT), a form of depolymerization known as molecular recycling, allows Eastman to recycle polyester waste repeatedly without degradation over time and reduces greenhouse gas (GHG) emissions by 20%–30% compared to processes using fossil fuels.57 One of the biggest challenges facing Eastman within its commercial-scale recycling plants is collecting enough quality feedstock to feed the plant. To help ensure adequate feedstock, Eastman partnered with feedstock providers, invested in its ability to sort plastics (to avoid contamination), identified several different feedstock prototypes based on what’s available in the market, and used process chemistry to optimize those feedstocks. Eastman focused on a low feedstock cost and a premium for recycled products to make the economics work this time.58 Second, Eastman uses a mass-balance approach to track recycled content to receive revenue from its product and associated recycled content. The mass-balance approach traces, measures, and reports the amount of recycled materials used to create a product.59 This method is certified by International Sustainability and Carbon Certification (ISCC) and allows brands to report the percentage of recycled content allocated to their manufactured products. This way, brands can demonstrate that they have met their recycled content targets. Benefits: Chemical recycling has already helped reduce waste and emissions for Eastman and its partners. Eastman reports that it recycled more than 12 million pounds (about 5,500 metric tons) of plastic waste in 2021.60 And Eastman’s customers can benefit by acquiring recycled content to meet their emissions and waste targets. Eastman’s CRT process is also estimated to reduce GHG emissions by 20%–50% compared to processes using fossil fuels,61 and its PRT process is expected to reduce emissions by 20%–30%.62 The future: Eastman is expected to begin operations at its PRT plant in Kingsport later this year and has already announced two new PRT projects—one in France and another in the United States. The plant in France is expected to come online in 2026,63 with more than 80% of feedstock under definitive agreements and most rPET-packaging offtake under definitive agreements.64 Eastman has committed to recycling more than 250 million pounds (about 114,000 metric tons) of plastic by 2025 and more than 500 million pounds (about 227,000 metric tons) by 2030.65 The company also plans to innovate new ways to optimize its supply chain through waste takeback strategies, including pre- and postconsumer waste or forming a closed-loop system through brand partnerships. Eastman has noted two helpful market trends as it expands its recycling capabilities. First, companies are beginning to design products with recyclability in mind. This has led to simplifying the plastics used in a product so that sorting and recycling are easier. Second, companies are beginning to use preconsumer and postconsumer waste, expanding access to noncontaminated plastics feedstock.66","filter_flag":1}
{"title":"First Person Perspective: Carpet is the feedstock of the future - Resource Recycling","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9yZWN5Y2xpbmcvMjAyMy8wNi8xNC9maXJzdC1wZXJzb24tcGVyc3BlY3RpdmUtY2FycGV0LWlzLXRoZS1mZWVkc3RvY2stb2YtdGhlLWZ1dHVyZS_SAXNodHRwczovL3Jlc291cmNlLXJlY3ljbGluZy5jb20vcmVjeWNsaW5nLzIwMjMvMDYvMTQvZmlyc3QtcGVyc29uLXBlcnNwZWN0aXZlLWNhcnBldC1pcy10aGUtZmVlZHN0b2NrLW9mLXRoZS1mdXR1cmUv?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9yZWN5Y2xpbmcvMjAyMy8wNi8xNC9maXJzdC1wZXJzb24tcGVyc3BlY3RpdmUtY2FycGV0LWlzLXRoZS1mZWVkc3RvY2stb2YtdGhlLWZ1dHVyZS_SAXNodHRwczovL3Jlc291cmNlLXJlY3ljbGluZy5jb20vcmVjeWNsaW5nLzIwMjMvMDYvMTQvZmlyc3QtcGVyc29uLXBlcnNwZWN0aXZlLWNhcnBldC1pcy10aGUtZmVlZHN0b2NrLW9mLXRoZS1mdXR1cmUv?oc=5","id":"CBMic2h0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9yZWN5Y2xpbmcvMjAyMy8wNi8xNC9maXJzdC1wZXJzb24tcGVyc3BlY3RpdmUtY2FycGV0LWlzLXRoZS1mZWVkc3RvY2stb2YtdGhlLWZ1dHVyZS_SAXNodHRwczovL3Jlc291cmNlLXJlY3ljbGluZy5jb20vcmVjeWNsaW5nLzIwMjMvMDYvMTQvZmlyc3QtcGVyc29uLXBlcnNwZWN0aXZlLWNhcnBldC1pcy10aGUtZmVlZHN0b2NrLW9mLXRoZS1mdXR1cmUv","guidislink":false,"published":"Wed, 14 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=165, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9yZWN5Y2xpbmcvMjAyMy8wNi8xNC9maXJzdC1wZXJzb24tcGVyc3BlY3RpdmUtY2FycGV0LWlzLXRoZS1mZWVkc3RvY2stb2YtdGhlLWZ1dHVyZS_SAXNodHRwczovL3Jlc291cmNlLXJlY3ljbGluZy5jb20vcmVjeWNsaW5nLzIwMjMvMDYvMTQvZmlyc3QtcGVyc29uLXBlcnNwZWN0aXZlLWNhcnBldC1pcy10aGUtZmVlZHN0b2NrLW9mLXRoZS1mdXR1cmUv?oc=5\" target=\"_blank\">First Person Perspective: Carpet is the feedstock of the future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Resource Recycling<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"First Person Perspective: Carpet is the feedstock of the future - Resource Recycling","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9yZWN5Y2xpbmcvMjAyMy8wNi8xNC9maXJzdC1wZXJzb24tcGVyc3BlY3RpdmUtY2FycGV0LWlzLXRoZS1mZWVkc3RvY2stb2YtdGhlLWZ1dHVyZS_SAXNodHRwczovL3Jlc291cmNlLXJlY3ljbGluZy5jb20vcmVjeWNsaW5nLzIwMjMvMDYvMTQvZmlyc3QtcGVyc29uLXBlcnNwZWN0aXZlLWNhcnBldC1pcy10aGUtZmVlZHN0b2NrLW9mLXRoZS1mdXR1cmUv?oc=5\" target=\"_blank\">First Person Perspective: Carpet is the feedstock of the future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Resource Recycling<\/font>","source.href":"https:\/\/resource-recycling.com","source.title":"Resource Recycling","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"This article appeared in the March 2023 issue of Resource Recycling. Subscribe today for access to all print content. Post-consumer carpet has long been hard to handle, a bulky waste item that rapidly fills up landfills. However, recent developments in technology mean this waste stream has become the feedstock for the future. Carpet America Recovery Effort (CARE) has been working for years to establish an effective recycling system in California, with excellent results. About 76.4% of all the carpet collected in California in 2021 was recycled into useful new products, exceeding the program’s goal of 60.0%. This percentage, called the yield, has grown dramatically over the life of the program from just 28.0% a decade ago, all thanks to expanded collection, extra processing capacity and growing markets for sustainable materials. Through subsidies, grants and technical assistance, CARE supports increased collection and processing of carpet into products containing recycled carpet material. Twenty-seven vendors currently incorporate carpet in at least 103 products. These products have industrial and retail applications, such as automotive plastic components, rubber transition mats, building materials, absorbency products, carpet underlayment and new carpet itself. Carpet – residential and commercial broadloom and carpet tile – is manufactured using approximately 70% thermoplastics and 30% inert\/inorganic fillers. The face fibers of carpeting can vary and are typically made from PET, nylon and\/or polypropylene fibers. Billions of PET bottles are recycled each year in the production of PET carpets, making carpet the largest single outlet for recycled PET bottles. The backing consists of finely milled calcium carbonate with a small percentage of SBR Latex, which acts as the glue in the carpet manufacturing process. All carpet recycling starts with a mechanical process and then can undergo the chemical recycling process to add avalue to the material. Mechanically recycled post-consumer carpet produces various streams of usable and sustainable materials. These materials make their way back into products that consumers use daily. From heat-resistant, hard plastic under the hoods of cars to concrete ballistic and forced-entry construction materials, this feedstock material will continue to be a sustainable choice when designing products for the circular economy. Advances in chemical recycling have grown the market demand for post-consumer carpet feedstock. The face fiber – PET, polypropylene, nylon 6 and nylon 66 – can be processed to make a suitable feed material for the chemical recycling process. This process purifies the material streams to create the basic building blocks for polymers, monomers, oligomers or new hydrocarbon products. These once-wasted materials are now a valuable commodity for a growing sustainability market segment. Major companies such as Eastman, Dow, PureCycle Technologies, ExxonMobil, Shell and Aquafil are increasingly interested and have committed hundreds of millions of dollars to building new plants as legislation around the county begins to support the diversion and recycling of post-consumer plastics in general. The recent acquisition of California-based recycler Circular Polymers by the global high-performance materials manufacturer Ascend Performance Materials is just one indicator that manufacturers are looking to utilize these materials as a sustainable feedstock moving forward. Eastman has indicated that they are committed to their chemical process and will utilize 160,000 tons of PET per year in their newest facility. That operation is being brought on-line shortly. As a result of these technological and business developments, carpet has become a valuable, sought-after feedstock. “Carpet: Feedstock for the Future” is the theme of the upcoming CARE Annual Conference, April 25-26 in Orlando, Fla. Collectors, processors and manufacturers from around the country will discuss recent developments in recycling technology, the ID equipment challenge, extended producer responsibility, and new products and markets. Russ DeLozier is a carpet industry veteran who consults on plastics recycling, waste reduction, flooring recycling and overall sustainability issues. Rob Thiess is the product and market development manager for CARE.","filter_flag":1}
{"title":"Mono-Material Lipstick Tubes - Trend Hunter","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiOmh0dHBzOi8vd3d3LnRyZW5kaHVudGVyLmNvbS90cmVuZHMvbW9uby1tYXRlcmlhbC1wYWNrYWdpbmfSAT5odHRwczovL3d3dy50cmVuZGh1bnRlci5jb20vYW1wL3RyZW5kcy9tb25vLW1hdGVyaWFsLXBhY2thZ2luZw?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiOmh0dHBzOi8vd3d3LnRyZW5kaHVudGVyLmNvbS90cmVuZHMvbW9uby1tYXRlcmlhbC1wYWNrYWdpbmfSAT5odHRwczovL3d3dy50cmVuZGh1bnRlci5jb20vYW1wL3RyZW5kcy9tb25vLW1hdGVyaWFsLXBhY2thZ2luZw?oc=5","id":"CBMiOmh0dHBzOi8vd3d3LnRyZW5kaHVudGVyLmNvbS90cmVuZHMvbW9uby1tYXRlcmlhbC1wYWNrYWdpbmfSAT5odHRwczovL3d3dy50cmVuZGh1bnRlci5jb20vYW1wL3RyZW5kcy9tb25vLW1hdGVyaWFsLXBhY2thZ2luZw","guidislink":false,"published":"Sat, 10 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=161, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOmh0dHBzOi8vd3d3LnRyZW5kaHVudGVyLmNvbS90cmVuZHMvbW9uby1tYXRlcmlhbC1wYWNrYWdpbmfSAT5odHRwczovL3d3dy50cmVuZGh1bnRlci5jb20vYW1wL3RyZW5kcy9tb25vLW1hdGVyaWFsLXBhY2thZ2luZw?oc=5\" target=\"_blank\">Mono-Material Lipstick Tubes<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Trend Hunter<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Mono-Material Lipstick Tubes - Trend Hunter","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOmh0dHBzOi8vd3d3LnRyZW5kaHVudGVyLmNvbS90cmVuZHMvbW9uby1tYXRlcmlhbC1wYWNrYWdpbmfSAT5odHRwczovL3d3dy50cmVuZGh1bnRlci5jb20vYW1wL3RyZW5kcy9tb25vLW1hdGVyaWFsLXBhY2thZ2luZw?oc=5\" target=\"_blank\">Mono-Material Lipstick Tubes<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Trend Hunter<\/font>","source.href":"https:\/\/www.trendhunter.com","source.title":"Trend Hunter","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Quadpack's Emerald is a Mono-Material Packaging Innovation To better align with circular economy principles, brands are favoring mono-material packaging over multi-material cosmetic components, and Quadpack's Emerald is a new option for brands that make everything from lip products to balms and solid fragrances. This mono-material tube is minimalist in form and available in either square or cylindrical shapes with a capacity of 4-4.5 grams, making it suitable for most lipsticks on the market. Brands that are interested in either style can opt for their choice of materials: recyclable PET and recycled PET (rPET) up to 100%. Multi-material cosmetic components have long presented challenges in terms of recyclability, as the combination of different materials makes it difficult to separate and process them effectively. In response, sustainably minded beauty brands are favoring mono-material packaging, making it easier for consumers to recycle and reduce waste. Trend Themes 1. Mono-material Packaging - Brands are favoring mono-material packaging over multi-material cosmetic components, presenting an opportunity for companies to develop new mono-material packaging solutions that align with circular economy principles. 2. Recyclable PET and Rpet Materials - Brands are opting for recyclable PET and rPET up to 100% as their choice of materials for mono-material packaging, presenting an opportunity for companies to develop new products that focus on sustainable materials. 3. Sustainable Beauty - Sustainably minded beauty brands are favoring mono-material packaging, making it easier for consumers to recycle and reduce waste, presenting an opportunity for companies to develop new sustainable beauty products and packaging solutions. Industry Implications 1. Cosmetics - New mono-material packaging solutions for cosmetics like lipstick and solid fragrances are becoming popular among sustainably minded beauty brands, presenting an opportunity for companies to develop new sustainable packaging solutions for cosmetics. 2. Packaging - The shift toward mono-material packaging presents an opportunity for packaging companies to develop new products and services that focus on sustainable and recyclable materials. 3. Sustainability - The trend toward sustainable beauty and packaging presents a major opportunity for companies to develop new products and services that meet consumer demand for sustainable and environmentally friendly options.","filter_flag":1}
{"title":"With New Recycling Center Fully Operational, EGGER Now Manufactures Products With Post-Consumer Recycled Wood - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3dpdGgtbmV3LXJlY3ljbGluZy1jZW50ZXItZnVsbHktb3BlcmF0aW9uYWwtZWdnZXItbm93LW1hbnVmYWN0dXJlcy1wcm9kdWN0cy13aXRoLXBvc3QtY29uc3VtZXItcmVjeWNsZWQtd29vZC0zMDE4NDQxNDEuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3dpdGgtbmV3LXJlY3ljbGluZy1jZW50ZXItZnVsbHktb3BlcmF0aW9uYWwtZWdnZXItbm93LW1hbnVmYWN0dXJlcy1wcm9kdWN0cy13aXRoLXBvc3QtY29uc3VtZXItcmVjeWNsZWQtd29vZC0zMDE4NDQxNDEuaHRtbNIBAA?oc=5","id":"CBMipAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3dpdGgtbmV3LXJlY3ljbGluZy1jZW50ZXItZnVsbHktb3BlcmF0aW9uYWwtZWdnZXItbm93LW1hbnVmYWN0dXJlcy1wcm9kdWN0cy13aXRoLXBvc3QtY29uc3VtZXItcmVjeWNsZWQtd29vZC0zMDE4NDQxNDEuaHRtbNIBAA","guidislink":false,"published":"Tue, 06 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=157, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3dpdGgtbmV3LXJlY3ljbGluZy1jZW50ZXItZnVsbHktb3BlcmF0aW9uYWwtZWdnZXItbm93LW1hbnVmYWN0dXJlcy1wcm9kdWN0cy13aXRoLXBvc3QtY29uc3VtZXItcmVjeWNsZWQtd29vZC0zMDE4NDQxNDEuaHRtbNIBAA?oc=5\" target=\"_blank\">With New Recycling Center Fully Operational, EGGER Now Manufactures Products With Post-Consumer Recycled Wood<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"With New Recycling Center Fully Operational, EGGER Now Manufactures Products With Post-Consumer Recycled Wood - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3dpdGgtbmV3LXJlY3ljbGluZy1jZW50ZXItZnVsbHktb3BlcmF0aW9uYWwtZWdnZXItbm93LW1hbnVmYWN0dXJlcy1wcm9kdWN0cy13aXRoLXBvc3QtY29uc3VtZXItcmVjeWNsZWQtd29vZC0zMDE4NDQxNDEuaHRtbNIBAA?oc=5\" target=\"_blank\">With New Recycling Center Fully Operational, EGGER Now Manufactures Products With Post-Consumer Recycled Wood<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"American-Made Particleboard and Thermally Fused Laminate Now More Sustainable LEXINGTON, N.C., June 6, 2023 \/PRNewswire\/ -- With its new recycling center fully operational, EGGER Wood Products, a leading manufacturer of wood-based materials, is further demonstrating its commitment to producing sustainable materials for interior design and furniture applications. This investment offers architects, designers and millworkers an option for U.S.-made thermally fused laminate (TFL) and particleboard, made with up to 15 percent post-consumer recycled wood. EGGER Wood Products and its parent company, the EGGER Group, strongly promote the responsible use of wood as a valuable natural resource. By implementing cascading use principals, the usable life of wood can be extended, resulting in less waste and enhanced carbon sequestration capacity. The addition of post-consumer recycled wood in the company's raw material supply chain further supports these sustainability goals. \"We are happy to say that most of the wood material in our U.S.-produced boards is waste wood from sawmill residues and pre-consumer recycled material,\" says Markus Frevert, plant manager for production at EGGER Wood Products. \"With the addition of our $41 million recycling center, up to 15 percent of the wood chips used are post-consumer recycled material. Only about seven percent comes from harvested timber, sourced from sustainably managed forests.\" In January, EGGER Group acquired the business and assets of Novem Industries, located in Charlotte, N.C. The acquisition, via EGGER's wholly-owned subsidiary, Timberpak, LLC, serves as a collection and preparation site that accepts construction and demolition waste wood and packaging waste—primarily used and broken pallets. The wood is ground into pieces about one foot in length before delivery to EGGER's Lexington production plant. The majority of EGGER's post-consumer recycled wood is sourced through Timberpak. EGGER strives to operate as sustainably as possible throughout its production and logistics processes, looking for ways to maximize efficiency and minimize its carbon footprint at every opportunity. Approximately 90% of the wood supply for the Lexington plant originates within a 100-mile radius to reduce carbon impact from transport. Transportation impact is further reduced with the use of rail cars to deliver finished products to customers when possible. About EGGER Founded in 1961 in St. Johann in Tyrol, Austria, EGGER Group is a more than $4.3 billion privately-held, family-owned company that employs more than 11,100 associates. EGGER is a global leader in the manufacturing of wood-based materials for the furniture and interior design, flooring and building products industries. The company's extensive, value-added product range includes thermally fused laminate (TFL), laminates, edge banding, raw particleboard, medium density fiberboard (MDF) and MDF Mouldings. EGGER operates 21 plants globally, including EGGER Wood Products LLC in Lexington, N.C., the company's first production facility in North America. The state-of-the-art particleboard manufacturing plant, with TFL lamination capacity, started production in September 2020. The total investment of the project, once completed, will be more than $700 million and will create an estimated 770 direct jobs. For more information about EGGER, visit www.egger.com. SOURCE EGGER Wood Products","filter_flag":1}
{"title":"CPI Announces Keynote Speaker for 2023 Polyurethanes Technical Conference - American Chemistry Council","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMinwFodHRwczovL3d3dy5hbWVyaWNhbmNoZW1pc3RyeS5jb20vY2hlbWlzdHJ5LWluLWFtZXJpY2EvbmV3cy10cmVuZHMvcHJlc3MtcmVsZWFzZS8yMDIzL2NwaS1hbm5vdW5jZXMta2V5bm90ZS1zcGVha2VyLWZvci0yMDIzLXBvbHl1cmV0aGFuZXMtdGVjaG5pY2FsLWNvbmZlcmVuY2XSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMinwFodHRwczovL3d3dy5hbWVyaWNhbmNoZW1pc3RyeS5jb20vY2hlbWlzdHJ5LWluLWFtZXJpY2EvbmV3cy10cmVuZHMvcHJlc3MtcmVsZWFzZS8yMDIzL2NwaS1hbm5vdW5jZXMta2V5bm90ZS1zcGVha2VyLWZvci0yMDIzLXBvbHl1cmV0aGFuZXMtdGVjaG5pY2FsLWNvbmZlcmVuY2XSAQA?oc=5","id":"CBMinwFodHRwczovL3d3dy5hbWVyaWNhbmNoZW1pc3RyeS5jb20vY2hlbWlzdHJ5LWluLWFtZXJpY2EvbmV3cy10cmVuZHMvcHJlc3MtcmVsZWFzZS8yMDIzL2NwaS1hbm5vdW5jZXMta2V5bm90ZS1zcGVha2VyLWZvci0yMDIzLXBvbHl1cmV0aGFuZXMtdGVjaG5pY2FsLWNvbmZlcmVuY2XSAQA","guidislink":false,"published":"Tue, 13 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=164, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinwFodHRwczovL3d3dy5hbWVyaWNhbmNoZW1pc3RyeS5jb20vY2hlbWlzdHJ5LWluLWFtZXJpY2EvbmV3cy10cmVuZHMvcHJlc3MtcmVsZWFzZS8yMDIzL2NwaS1hbm5vdW5jZXMta2V5bm90ZS1zcGVha2VyLWZvci0yMDIzLXBvbHl1cmV0aGFuZXMtdGVjaG5pY2FsLWNvbmZlcmVuY2XSAQA?oc=5\" target=\"_blank\">CPI Announces Keynote Speaker for 2023 Polyurethanes Technical Conference<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">American Chemistry Council<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CPI Announces Keynote Speaker for 2023 Polyurethanes Technical Conference - American Chemistry Council","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinwFodHRwczovL3d3dy5hbWVyaWNhbmNoZW1pc3RyeS5jb20vY2hlbWlzdHJ5LWluLWFtZXJpY2EvbmV3cy10cmVuZHMvcHJlc3MtcmVsZWFzZS8yMDIzL2NwaS1hbm5vdW5jZXMta2V5bm90ZS1zcGVha2VyLWZvci0yMDIzLXBvbHl1cmV0aGFuZXMtdGVjaG5pY2FsLWNvbmZlcmVuY2XSAQA?oc=5\" target=\"_blank\">CPI Announces Keynote Speaker for 2023 Polyurethanes Technical Conference<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">American Chemistry Council<\/font>","source.href":"https:\/\/www.americanchemistry.com","source.title":"American Chemistry Council","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"WASHINGTON (June 13, 2023) – The Center for the Polyurethanes Industry (CPI) today announced that Debbie Mielewski, Ph.D., a sustainability expert, will deliver the keynote speech at the opening session of the 65th Polyurethanes Technical Conference on Sept. 25, 2023 in San Antonio, TX. “We are thrilled to welcome Dr. Mielewski back to CPI’s annual conference,” said Lee Salamone, Senior Director, CPI. “Dr. Mielewski joined us at the 2019 Conference and inspired us with her vision for the future of sustainability in our industry. We are eager to have her return to share what she’s learned along her journey to sustainability since then, during a time when the world has experienced so many changes in viewpoints, business practices, technology and more.” Dr. Mielewski recently retired from a 36-year career at the Ford Motor Company where she was the Technical Fellow of Sustainability. During her tenure at Ford’s Research and Innovation Center, she worked on automotive paints, polymer processing, and new materials development. In 2000, she pioneered a biomaterials program at Ford when \"being green\" was not popular in the industry. Her team was the first to demonstrate a soy-based foam that met all the requirements for automotive seating, which led to the material being launched on the 2008 Mustang. As of 2022, over 15 industry-first, sustainable materials have appeared on Ford vehicles through her and the team’s efforts. Dr. Mielewski recently established her own company to share her knowledge with the hope of accelerating sustainable materials’ development across industries, and would like to inspire students and others to bring more earth friendly materials to the market. “I am beyond delighted to be back at the CPI conference giving the keynote speech. The world is changing quickly, and it is imperative to use sustainable principles in the fight to reverse climate change,” said Dr. Mielewski. “I've expanded my viewpoint beyond automotive, and will be presenting recent thoughts on the roadblocks to achieving sustainability goals and sharing examples of progress and success.” The 65th Polyurethanes Technical Conference will take place Sept. 25-27, 2023, at the Marriott Rivercenter in San Antonio, TX. Registration is now open for this premier event, which will feature discussions on key regulatory and policy issues, educational sessions, and the latest innovations in the polyurethanes industry. On LinkedIn? Follow the Center for the Polyurethanes Industry for the latest news, insights, and ideas and use the hashtag #PolyCon23 to join the conversation.","filter_flag":1}
{"title":"30 sustainable and ethical fashion brands to shop now - Marie Claire UK","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3Lm1hcmllY2xhaXJlLmNvLnVrL25ld3MvZmFzaGlvbi1uZXdzL2Jlc3QtZXRoaWNhbC1mYXNoaW9uLWJyYW5kcy10by1rbm93LXN1c3RhaW5hYmxlLWZhc2hpb24tODQxNjnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3Lm1hcmllY2xhaXJlLmNvLnVrL25ld3MvZmFzaGlvbi1uZXdzL2Jlc3QtZXRoaWNhbC1mYXNoaW9uLWJyYW5kcy10by1rbm93LXN1c3RhaW5hYmxlLWZhc2hpb24tODQxNjnSAQA?oc=5","id":"CBMibWh0dHBzOi8vd3d3Lm1hcmllY2xhaXJlLmNvLnVrL25ld3MvZmFzaGlvbi1uZXdzL2Jlc3QtZXRoaWNhbC1mYXNoaW9uLWJyYW5kcy10by1rbm93LXN1c3RhaW5hYmxlLWZhc2hpb24tODQxNjnSAQA","guidislink":false,"published":"Thu, 01 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=152, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3Lm1hcmllY2xhaXJlLmNvLnVrL25ld3MvZmFzaGlvbi1uZXdzL2Jlc3QtZXRoaWNhbC1mYXNoaW9uLWJyYW5kcy10by1rbm93LXN1c3RhaW5hYmxlLWZhc2hpb24tODQxNjnSAQA?oc=5\" target=\"_blank\">30 sustainable and ethical fashion brands to shop now<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Marie Claire UK<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"30 sustainable and ethical fashion brands to shop now - Marie Claire UK","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3Lm1hcmllY2xhaXJlLmNvLnVrL25ld3MvZmFzaGlvbi1uZXdzL2Jlc3QtZXRoaWNhbC1mYXNoaW9uLWJyYW5kcy10by1rbm93LXN1c3RhaW5hYmxlLWZhc2hpb24tODQxNjnSAQA?oc=5\" target=\"_blank\">30 sustainable and ethical fashion brands to shop now<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Marie Claire UK<\/font>","source.href":"https:\/\/www.marieclaire.co.uk","source.title":"Marie Claire UK","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"If you're searching the Internet for sustainable clothing brands, chances are, you're keen to cut down on your fast fashion consumption and make your wardrobe a little more eco-friendly. Shopping ethically is a great way to reduce your carbon footprint and overall emissions, especially now that more and more brands are focusing on producing better quality clothes with a seasonless aesthetic, meaning customers won't grow tired of them after a few months. But with so much sustainable fashion around, knowing how to pick the right brands can be tricky, especially when so many are guilty of greenwashing. With that in mind, here at Marie Claire we've put together a guide to help you. What is the difference between ethical and sustainable clothing brands? There is a lot of confusion between the terms 'ethical' and 'sustainable.' No, the two aren't the same. Treating staffers, suppliers and so on in an ethical manner is just one part of being a sustainable business. There are different ways to produce ethical clothing, and according to the Ethical Fashion Forum, they generally fall into three categories - social, environmental and commercial. The forum specifically tackles these issues: Countering fast, cheap fashion and damaging patterns of fashion consumption Defending fair wages, working conditions and workers’ rights, and supporting sustainable livelihoods Addressing toxic pesticide and chemical use, using and\/or developing eco-friendly fabrics and components Minimising water use Recycling and addressing energy efficiency and waste Developing or promoting sustainability standards for fashion Providing resources, training and\/or awareness-raising initiatives Protecting animal rights (L + R) Fashion Editor Zoe Anastasiou dressed in Omnes and Reformation. (Centre) Health & Sustainability Editor Ally Head dressed in Dai. (Image credit: Future Owned) What constitutes a sustainable clothing brand? When it comes to sustainable fashion brands, there are many things to consider including how a brand sources its fabrics, how they manufacture and transport their products, and how they sell items in a planet-friendly way. As Joanna Dai, founder of the B Corp-certified clothing brand Dai shares, every new product put out into the world has an impact - however, some brands are doing better than others to minimise their mark. We asked Dai for her expertise on how you can ensure a brand is genuine in its sustainability efforts. Marie Claire Newsletter Celebrity news, beauty, fashion advice, and fascinating features, delivered straight to your inbox! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors How can you spot if a brand is genuine in its sustainability efforts? Joanna Dai outlines her tips below. Accountability - \"For real change, brands must be accountable for their impacts and decisions across the entire business,\" she shares. \"Brands that achieve B Corp certification are invested in running a responsible business.\" Fabrics - \"Look to brands that are using certified plant-based or innovative recycled materials as much as possible,\" she recommends. End of life - \"Sustainability doesn’t end once the customer checks out their basket. Look out for brands that offer repairs and take-back schemes that help increase a garment’s longevity or encourage responsible recycling,\" she encourages. \"We recently introduced Dai’Cycle, a programme where customers can drop off their preloved Dai clothing in exchange for a £25 gift card to use on their next in-store purchase. We will renew and repair the donated pieces and offer them in-store as preloved items to new customers, or donate it to our charity partner Smart Works.\" Building products to last - \"Alongside an end-of-life programme, invest in brands and products that are well designed and built to last,\" she goes on. \"This is a founding principle at Dai, I personally road-test each and every product to make sure it performs and functions for our customers now, and for years to come.\" Valuing people - \"Sustainability must combine people and the planet. Look at brands' supplier codes of conduct or commitments to paying fair and living wages to ensure the people who are making your garments are being treated well.\" Marie Claire UK's Sustainability Editor, Ally Head, agrees, adding that shopping for sustainable clothing can feel like a minefield when you've got brands greenwashing left, right and centre. Her advice? \"Always check whether a brand has a B Corp certification. If they do, it means they've undergone the most rigorous testing - qualifying can take as long as three years (!) - to make sure their practices are plant-friendly across all aspects of their business. They have a detailed directory on their site of all the brands that have qualified.\" A post shared by B Corporation UK (@bcorpuk) A photo posted by on Secondly, do your research - often, if a brand actually works to sustainable practice, they'll have a whole page dedicated to it on their website. \"Do read up and also carefully consider both the eco-claims they are making and how they say their business is structured - do they promote fast fashion, do they rack up air miles like there's no tomorrow, and do they still send products out in non-recyclable or non-biodegradable materials? Even if a brand says they're sustainable, they might be greenwashing - for example, a global company that churns out new designs every day doesn't *sound* sustainable to us.\" And thirdly, use your common sense. \"Buying secondhand, shopping in vintage stores, using pre-loved fashion sites or renting clothes are all great ways to shop sustainably and lower the impact that creating new clothes can have on the environment,\" Ally explains. Keep on scrolling to discover our favourite sustainable clothing brands - and while you're here, check out our favourite ethical jewellery brands and sustainable sports brands, too. The best sustainable clothing brands you need to know about: Dai VIEW NOW Dai is a B Corp-certified clothing brand founded by Joanna Dai. Not only is the brand using performance 4-way stretch, machine washable, wrinkle resistant fabrics and designing some of the most comfortable clothes ever, but they are also committed to doing good for people and the planet. Sustainability is woven into every fibre of their brand DNA. They use over 60% recycled or plant-based yarns and recently introduced Dai’Cycle, a programme where customers can drop off their preloved Dai clothing in exchange for a £25 gift card to use on their next in-store purchase. The brand will renew and repair the donated pieces and offer in-store as preloved items to new customers, or donate it to their charity partner Smart Works. Editor Verdict: \"I am OBSESSED with this brand. I met the founder Joanna earlier in the year and loved hearing about her journey of launching a fashion brand that's genuinely sustainable, too (they're a certified B Corp). Their suit trousers and navy striped shirt are my personal favourite items from their collection, but everything is gorgeous.\" - Ally Head, Health & Sustainability Editor. OMNES VIEW NOW OMNES means all, with the brand's ethos being that we are all in this together. The brand is aware that fashion is one of the worst polluters, so even when sketching clothes, designers think of styles and fabrics that you will wear as long as possible. The brand also uses offcuts in accessories to minimise waste, and audits its factories in Romania, India and London to make sure they comply with Health and Safety, Environment, Business Ethics and Labour Standards. Editor Verdict: \"When it comes to chic dresses and understated event wear, Omnes is one of my favourites. I love the brand's signature cowl neck slip dresses, which are often made from recycled polyester, Ecovero Viscose or deadstock fabric. The shapes are so flattering and they're the kind of dresses you can wear for years to come for all manner of different occasions.\" - Zoe Anastasiou, Fashion Editor Ninety Percent Visit Site Ninety Percent gained its name thanks to its unique business model, which sees the brand sharing 90% of its profits between its people and charitable causes that prioritise the planet. In addition to this, the brand also prides itself on transparency and traceability, as well as the use of sustainable materials. The label focuses on the use of natural, renewable and certified organic materials, including Linen, ENKA Viscose, Tencel, Micro Modal and Global Organic Textile Standard (GOTS) certified organic cotton. And also uses low-impact finishes like plant-based buttons and nickle free metals. Reformation VIEW NOW With a slogan that reads, \"Being naked is the #1 most sustainable option. We're #2,\" you could deduce that Reformation is a brand that prides itself on its sustainability efforts. The brand hopes to achieve Climate Positivity by 2025, with a goal that includes sourcing 100% of its fabrics from either recycled, regenerative or renewable materials. Reformation recently released a circular denim collection and is even working to develop vegan, plastic-free leather made from Mycelium (which is the root-like structure of a mushroom). With Nothing Underneath Visit Site As a B Corp-certified brand, you can guarantee that With Nothing Underneath is prioritising the planet and is conscious about its environmental impact. The brand thrives on the ethos of buying less and buying better, offering a whole host of timeless wardrobe staples that are guaranteed to stay in your wardrobe for years to come. In terms of materials, the brand uses Organic Cotton, Tencel, recycled Silk and even its buttons are made from Corozo nuts. Editor Verdict: \"There is, in my opinion, no shirt brand that compares to With Nothing Underneath. I own three of the brand's shirts and wear them season in, season out. Not only is the quality exceptional, but the fit is second to none—nailing that laid-back, casual vibe that still oozes luxury and expense. They're not wildly expensive in the grand scheme of things, but still more than your average £30 Zara buy. However, when I think about the cost per wear compared to high-street alternatives in my wardrobe, With Nothing Underneath comes out on top every single time.\" - Shannon Lawlor, Acting Senior Beauty Editor Arkitaip Visit Site Arkitaip is focused on creating clothing that will last, with timeless designs and well-crafted construction. Created in Europe, Arkitaip utilises 100% Masters Of Linen-certified linen and can pinpoint where 95% of its raw materials originate. The brand's garment workers are also treated with the utmost care and protected by the EU's European Employment Strategy. Everything is created in Portugal in a small, family-run factory. In addition to all of this, Arkitaip is also a member of 1% for the planet, an initiative which commits to donating 1% of a brands profit to environmental causes. MyCashmere VIEW NOW As another young brand founded just last year, MyCashmere is bringing sustainable practices to the cashmere sector. The brand produces its clothing in Italy, using either 100% SFA (Sustainable Fibre Alliance) certified yarn or Re-Verso Recycled Cashmere, which is made from post-factory leftovers. The label even takes its sustainable ethos into its packaging, using grass paper packaging which is biodegradable and free from plastic. Ultimately, each of MyCashmere's pieces is created to become a timeless addition to your wardrobe and the kind of classic item you will keep for years to come. Sézane VIEW NOW Sézane has become one of the first-ever French brands to obtain a B Corp certification. With its origin in vintage, Sézane believes the pieces that we wear today should become the vintage of tomorrow. From the transformation of their production methods and choice of materials to reducing their delivery and packaging footprint, Sézane is committed to concrete sustainability measures. Today, three-quarters of the materials in their current collection are eco-friendly. They have obtained 5 certifications (GOTS, Oeko-Tex, FSC, RWS and RMS ) and released their first 100% eco-friendly denim line. Since 2018 Sézane has raised over 4.5 million euros for the philanthropic program DEMAIN. On the 21st of every month, 10% of global turnover and 100% of the proceeds from a dedicated design are donated to programs which support access to education and equality of opportunity for children all over the world. Editor Verdict: \"Nothing says French girl chic, quite like Sézane. The brand offers timeless staples that you will want to wear for years to come. After all, aside from manufacturing and fabrication, another true test of a sustainable wardrobe is ensuring you wear and re-wear your clothes again and again. Nothing is more sustainable than the clothes already in your wardrobe.\" - Zoe Anastasiou, Fashion Editor O Pioneers Visit Site O Pioneers proudly describes themselves as a brand that represents the 'antithesis of fast fashion.' Made from dead stock or end of season fabrics, O Pioneers works with local seamstresses and craftswomen here in the UK to create all of its products, thereby minimising its carbon footprint. In addition to this, the brand advocates for investing in classics that will stay with you for several years and not just a season. The brand creates wearable dresses that are made to be utilised for the everyday, and not just on special occasions, meaning you can definitely lower your price per wear. Rouje Visit Site Founded by Jeanne Damas, Rouje is a brand that recognises sustainability is about constantly improving. The brand is working to become more sustainable with each collection. Currently, 94% of the brand's range is created in Europe meaning the brand lowers its environmental impact. They also choose to use ground transport where ever possible. When it comes to fabrics, 74% of the brand's Spring\/Summer collection is made from certified materials, while the brand also chooses to produce in limited quantities to avoid overproduction. nobody's child VIEW NOW Nobody's Child has pivoted to become a go-to fashion label that is sustainable as well as affordable, without compromising on design. Through 2021, its mission was to become a more responsible brand and now 90% of the collection is made from certified sustainable materials. Nobody's Child has also partnered with Canopy on the PACK4Good initiative, and its tags are FSC certified, with packaging made from 100% recycled plastic. Fanfare The Label Visit Site \"What others see as waste, we see as a starting point…\" this is the bold proclamation on Fanfare's website. The brand was built on a circular fashion model, using rescued, up-cycled and recycled materials to create new products. The brand manufactures its products locally, either in East London or at a short distance away, thereby minimising its carbon footprint while also creating new job opportunities in the local community. Deiji Studios Visit Site As a brand that offsets its entire carbon usage, you can guarantee that Deiji Studios is conscious about its impact on the planet. The brand designs using natural and sustainable fibres including linen, GOTS cotton and more, utilising materials that are biodegradable or recycled. Deiji Studios has also partnered with 1% for the planet, meaning that the brand contributes at least 1% of its annual revenue to environmental causes. EVARAE VIEW NOW EVARAE ensure a fully transparent supply chain of materials and production. Consciously choosing materials that are made through more sustainable processes that lower their environmental impact. 100% of swimwear is made from the regenerative fabric ECONYL®, while their ready-to-wear collection is crafted in 100% earth-friendly fibres. The ready-to-wear collection is produced in small production runs, cutting down on waste and minimising the environmental impact. EVARAE uses a small family-run atelier in Rimini, Italy, who have over 20 years of experience producing swimwear, meaning the brand can guarantee the safety and job security of those involved in creating its garments. DAY 6 VIEW NOW DAY 6 is a new independent womenswear brand focusing on the growing gap between fast and designer fashion. Designed, milled and produced in the UK, DAY 6 put an emphasis on small, minimum-waste production that is climate and customer conscious. DAY 6 creates playful designs with a high-fashion attitude at an attainable price point. Mother of Pearl VIEW NOW This contemporary sustainable womenswear brand celebrates individuality, authenticity and sustainability. In just 13 years, Amy Powney has gone from sweeping the cutting-room floor at Mother of Pearl to taking the helm as its Creative Director. Sustainability has been a life-long passion for Amy and she’s been on a mission for Mother of Pearl to reduce its impact on the planet. Clothes are made from organic and natural materials, with a transparent supply chain, putting social responsibility, respect to animals and low-environmental impact first and foremost. Their website is set up so you can see the sustainable attributes of each piece. Faithfull the Brand VIEW NOW Founded in Indonesia in 2012, Faithfull the Brand has care, quality and authenticity weaved into its fabric. From day one, co-directors, Sarah-Jane Abrahams and Helle Them-Enger have collaborated with Bali’s best manufacturers to create their hand-made garments, and have continued to live and work closely with their local community ever since. At the heart of the brand are thoughtfully produced designs that evoke a sense of summer and a spirit of travel. Faithfull is known and loved for its vintage inspired prints, flattering shapes, and unique pieces, made for sun-seekers and romantic dreamers. Aspiga VIEW NOW As a B Corp-certified brand, you just know Aspiga takes its sustainability credentials very seriously. Last year, the label moved away from using new polyester in its products, choosing instead to use recycled polyester and other yarns made from recycled plastic such as EcoVero. Aspiga has also stopped using plastic in any of its packagings. Its clothing now comes in garment bags made from 100% cornstarch, which is compostable. The label also works with fair trade factories and repurposes all scrap fabric to create sustainable gift bags, scrunchies and face masks, thereby minimising waste. MARFA STANCE VIEW NOW The MARFA STANCE concept is based on buildable, adaptable, reversible and personalised clothing. Each piece can be worn in multiple ways and with multiple functions, promoting a buy less and buy better approach. Unique, buildable elements are available in each collection to evolve key styles, offering the ability to update and sustain your signature wardrobe season upon season. In addition the collection has a modular element where if a customer buys multiple items from the collection, the pieces can button into each other and create new ways to wear for different times of the year. Seasonless, timeless design and colour palette encourage forever wear, focusing on the garment's longevity and functionality as an investment piece. KJINSEN VIEW NOW Founded earlier this year, KJINSEN is a label that puts sustainability at the forefront of each business decision. In order to reduce its carbon footprint, the brand creates its pieces here in an atelier in London. Additionally, KJINSEN works exclusively with biodegradable fabrics, such as GOTS-certified organic cotton and cashmere. They pride themselves on utilising a traceable supply chain and often use deadstock fabric, excluding synthetic fabrics from their offering entirely. BITE VIEW NOW Operating from their London Atelier, BITE makes and produces everything on-site in their east London factory space, using only natural, certified organic fabrics with a record of social and environmental responsibility. The collection consists of a maximum of 20 fixed and updated styles each season, an evolutionary archive, which is now stocked at over 10 global retailers. ASKET VIEW NOW Responsible fashion label ASKET is perfecting one garment at a time, throwing out all the unnecessary fuss and focussing on what matters: quality and fit. Recently, the first three garments of its womenswear permanent collection launched: the white t-shirt, the white shirt and the standard jeans. Each piece joining the permanent collection is 100% traceable and created to last and designed to fit - with 54 sizes in the denim. Anny Nord VIEW NOW All of Anny Nord’s gorgeous shoes (based on a clean Scandi aesthetic) originate from the brand’s design studio outside the coastal town of Båstad in Sweden. The brand believes in quality over quantity and to slow things down they only present two collections per year. Production is kept as close to home as possible in order to keep transports shorter and in turn the CO2 footprint smaller. It works closely with a few quality factories in Portugal and Spain where shoe-making is a handcraft and good and ethical working conditions are a given. All plastic packaging has been removed, and the label works with premium leathers that are from Leather Working Group (LWG) audited members within Europe in order to ensure a supply chain of superior environmental performance. Boteh Visit Site Swim and resort wear brand, Boteh works with plant-derived fabrics or 100% cellulosic fabrics, as the brand describes. Their products are constructed from organic cotton, European flax linen and more. Cellulosic fabrics are not only more sustainable, but they also tend to be a more durable option. When it comes to swimwear, the brand creates its swim collections in regenerated Econyl, which is a fabric made from recycled waste (such as fishing nets). Boteh works with certified factories in India and China, who uphold quality and ethical production standards. Hunza G VIEW NOW Hunza G’s production process begins and ends locally in the UK, amidst a small group of individuals passionate about quality knit fabrics and considered swimwear construction. The crinkle fabric is knitted in a local mill in the Midlands, then processed and dried before being sent to their Central London studio where each garment is cut and made, limiting any possible unnecessary fabric consumption. They also resourcefully produce small run-off quantities of headbands and scrunchies with small cuttings of excess fabric – reducing wastage and providing a long-lasting alternative. 1 People VIEW NOW 1 People, a revolutionary Danish apparel and lifestyle brand that is globally expanding, has a mindset to introduce a new meaning of sustainable luxury. They have now launched the Minimalist Edit - your solution for sustainability. 1 People have curated a variety of effortless luxurious looks, so you can be confident that you are consciously styling yourself in timeless, ethical, high-quality fashion. Minimalism is at the heart of the brand, which is why the Ready To Wear Edit pays attention to detail, offering ten simplistic and versatile designs that can be styled up to 30 diversified looks. This collection along with every 1 People product sold will benefit charity Business For Planet and its efforts to support the education of the social entrepreneurs of tomorrow. White Stuff VIEW NOW White Stuff’s women’s jeans and dungarees are designed consciously, using lower impact materials and manufactured with recycled water and renewable energy. All of their new styles feature recycled cotton (between 5% and 20% of the total fabric mix) and recycled polyester thread. The pockets are made from a recycled polyester and organic cotton blend. Additionally, the different washes of jeans have been created without pumice or stone washing techniques, which can be damaging to factory workers’ health. The denim factories they work with all take steps to mitigate their environmental impact. GANNI VIEW NOW GANNI has pledged to focus on four areas, the planet, people, the product and prosperity. These goals include reducing CO2 emulsions by 30% per kg of clothing, a gender equality policy, using more sustainable fabrics and investing in innovative projects to support the planet. Editor Verdict: \"GANNI makes up a lot of my wardrobe - in fact, you could call me a super fan. The super-soft beanies, the huge collars, the oversized coats and the chunky boots. These cool fashion staples are classic and timeless, and the quality of the clothing means that you'll have them for decades. The Scandi brand is the ultimate cool-girl uniform in London this season, but it's also the sustainable choice, becoming B corp certified just this Autumn.\" - Jenny Proudfoot, Featured Editor Bogdar VIEW NOW Created and led by couple Pavel and Teodora Lozanov, Bogdar expands on its family’s fashion legacy in Bulgaria – a country with a rich history in clothes manufacturing. It remains true to its roots with 100% of Bogdar pieces produced in their family-owned facility in Vidin, Bulgaria, with a hand-picked team of just 16 members, while building on, and contributing to the emerging style of the New East. Le Kasha VIEW NOW Le Kasha's mission is to make beautiful and timeless clothing suitable for every place and every season, using only natural and noble material, at the Le Kasha Eco label factory.","filter_flag":1}
{"title":"Role of R&D in achieving sustainable goals - Indian Chemical News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi9yb2xlLW9mLXJkLWluLWFjaGlldmluZy1zdXN0YWluYWJsZS1nb2Fscy0xNzk1ONIBX2h0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi9saXRlL3JvbGUtb2YtcmQtaW4tYWNoaWV2aW5nLXN1c3RhaW5hYmxlLWdvYWxzLTE3OTU4?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi9yb2xlLW9mLXJkLWluLWFjaGlldmluZy1zdXN0YWluYWJsZS1nb2Fscy0xNzk1ONIBX2h0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi9saXRlL3JvbGUtb2YtcmQtaW4tYWNoaWV2aW5nLXN1c3RhaW5hYmxlLWdvYWxzLTE3OTU4?oc=5","id":"CBMiWmh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi9yb2xlLW9mLXJkLWluLWFjaGlldmluZy1zdXN0YWluYWJsZS1nb2Fscy0xNzk1ONIBX2h0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi9saXRlL3JvbGUtb2YtcmQtaW4tYWNoaWV2aW5nLXN1c3RhaW5hYmxlLWdvYWxzLTE3OTU4","guidislink":false,"published":"Mon, 26 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=177, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi9yb2xlLW9mLXJkLWluLWFjaGlldmluZy1zdXN0YWluYWJsZS1nb2Fscy0xNzk1ONIBX2h0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi9saXRlL3JvbGUtb2YtcmQtaW4tYWNoaWV2aW5nLXN1c3RhaW5hYmxlLWdvYWxzLTE3OTU4?oc=5\" target=\"_blank\">Role of R&amp;D in achieving sustainable goals<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Chemical News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Role of R&D in achieving sustainable goals - Indian Chemical News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi9yb2xlLW9mLXJkLWluLWFjaGlldmluZy1zdXN0YWluYWJsZS1nb2Fscy0xNzk1ONIBX2h0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi9saXRlL3JvbGUtb2YtcmQtaW4tYWNoaWV2aW5nLXN1c3RhaW5hYmxlLWdvYWxzLTE3OTU4?oc=5\" target=\"_blank\">Role of R&amp;D in achieving sustainable goals<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Chemical News<\/font>","source.href":"https:\/\/www.indianchemicalnews.com","source.title":"Indian Chemical News","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"The chemical industry is a major contributor to the global economy, with a market size of over US $4 trillion in 2021. The industry is also a significant employer, with millions of people working in various roles, including research and development, production, quality, EHS, sales, and logistics. In India, the chemical industry is extremely diversified and covers more than 80,000 commercial products. This can be broadly classified into bulk chemicals, specialty chemicals, agrochemicals, petrochemicals, polymers, and fertilizers. One of the major challenges the industry faces is changing consumer preferences. As consumers become more environmentally conscious, there is an increasing demand for products that are made from sustainable and environmentally friendly materials. This trend is driving the development of new products and technologies and therefore, one of the fundamental drivers of growth in the chemical industry continues to be R&D. The traditional approach of chemical organizations to R&D may not be the best option as the industry is changing fast with development of newer technologies and digitalization across the world. It will be difficult for companies to remain competitive if they do not stay ahead of the technology curve. This is only possible by investing in R&D and developing new products. Therefore, R&D will play an extremely important role in helping organizations achieve sustainable goals. Sustainable chemistry aims to design and develop chemicals and processes that reduce or eliminate the use and generation of hazardous substances, minimize environmental impacts, and promote economic growth. It is important for R&D to focus on the twelve principles of “Green Chemistry” which include prevention, atom economy, less hazardous chemical syntheses, designing safer chemicals, safer solvents and auxiliaries, design for energy efficiency, use of renewable feedstocks, reduce derivatives, catalysis, design for degradation, real-time analysis for pollution prevention, and inherently safer chemistry for accident prevention. Scientists and engineers working in R&D should also focus on developing new sustainable materials, such as biodegradable plastics, bio-based materials, and recyclable materials to replace traditional materials that are less sustainable. Newer technologies can also be used to develop new processes for recycling and upcycling materials. Chemists need to develop new methods for breaking down plastics into their component parts, which can then be used to create new products. Additionally, upcycling processes can transform waste materials into new products, reducing the need for new raw materials. Coatings play a critical role in many industries, but traditional coatings can be harmful to the environment. Green chemistry can be used to develop sustainable coatings that are less harmful to the environment. For example, researchers can develop coatings that are made from renewable materials or coatings that have lower volatile organic compound (VOC) emissions. In the agrochemical industry, efforts of scientists over several years have resulted in identification and developing safer chemicals that have lower toxicity and are less harmful to human health and the environment. Discovering new modes of actions for insecticides, herbicides, and fungicides has helped farmers to reduce the doses of chemicals from Kg\/hectare to few grams\/hectare. Scientists have developed safer raw materials which cause minimum damage to the environment and are less hazardous for farmers. Collaboration among researchers, government agencies, and industry can help identify safer chemicals. By sharing data and knowledge, stakeholders can work together to identify chemicals that are safer and more sustainable. In the pharmaceutical industry, sustainable manufacturing of Active Pharmaceutical Ingredients (APIs) is important to ensure supply security to manufacture required formulations. This was evident during Covid-19 period as some of the most developed nations were dependent on India to supply life-saving drugs. Recently developed and introduced APIs are highly active but complex in chemistry. Therefore, more sophisticated processes are involved which also poses challenges and opportunities for R&D scientists. Atom economy, waste generation and chemical reaction hazards need to be focused to ensure sustainability of the processes. In the oil and gas industry, engineers and chemists in the upstream processes need to collaborate to develop greener solutions which are effective as corrosion inhibitors, scale inhibitors, viscosity modifiers, emulsion breakers, reverse emulsion breakers, biocides, hydrate inhibitors among others. These solutions are extremely important for sustainability considering the high-volume requirements. Developing and identification of greener catalysts, fuel additives, H2S scavengers in the downstream process of the oil and gas industry is equally important for sustainability. Today, the sustainable practices followed by Industries are limited to solvent recoveries and developing safe processes to avoid accidents. Economic and technical challenges often hinder the commercialization of green chemical processes. Over the last few years, commercialization of a few green technologies using ionic liquids and supercritical carbon dioxide as solvent were attempted with limited success. Microwave chemistry is extremely popular with academia but still not seen as a success in commercial applications. Advantages of microwave chemistry include low energy consumption, homogeneity, speed of heating, faster reaction (minutes instead of hours or days), atom economy (greater yield and lesser wastage), green solvents (including water, ethanol, and methanol) which are strongly responsive to microwave. Less or no solvent also gives opportunity to perform concentrated reactions and possibility of neat condition or supported reagents. Rapid conditions screening for integrated on-line control guarantees safe operations. R&D scientists need to challenge themselves to commercialize this technology which will contribute significantly to the sustainability cause. There are also recent reports of commercial applications of surfactant mediated reactions but in limited numbers. Many organic fundamental organic reactions, which otherwise need organic phase and dry conditions, can be carried out in water using surfactant mediated technology. Advantages of this chemistry is that it brings substrates and reagents in proximity to enhance efficiency and rate of reaction, and it sometimes shows reactivity or selectivity that cannot be attained in organic medium. Considering the potential of this technology, more efforts are needed to popularize green chemistry. Flow chemistry is getting good traction and over the next few years, it is expected that several batch processes will be converted to continuous using flow chemistry. In flow chemistry, reagents are continuously pumped through the reactor and the product is continuously collected. Key factors for flow chemistry reactions are residence time (flow rates), mixing, pressure and temperature. Some of the highly energetic reactions such as nitration are good candidates for flow chemistry and are being practiced in industry. Sustainability principles should be considered when we initiate the process development of any molecule. It is important that during the ideation stage, we must thoroughly debate and look for sustainable practices. This includes the use of lower quantities of volatile organic solvents and recyclable catalysts. This also includes focusing on processes which give least minimum products and maximum yields resulting in superior atom economy and selecting processes with least steps resulting in energy efficient synthesis. During the entire product lifecycle from development to growth and from maturity to decline, processes need changes. In every step, the development team must focus on sustainability which may also be achieved through collaborations with academia or research institutes. Industry and academia must foster a better environment for creativity by jointly building and developing new knowledge and by bringing together multi-talented groups of researchers from both pools to provide solutions to make R&D more sustainable. To develop a sustainable process for optimum yield (which is also intrinsically safe to manufacture), very often we are required to use solvents in larger quantities and hence it is extremely important to judiciously follow 3R (Reduce, Reuse, and Recycle) principles. We must try to Reduce as minimum solvent as possible in the process, our next option must be to Reuse it back in the process. However, very often it has challenges of impurities and therefore Recycle after appropriate treatment is key to the success of the process. All efforts should also be made to use solvents with superior EHS profile such as minimum ozone depletion potential and biodegradability. This also has an economic advantage since incineration of waste is not cost effective and will result in expensive product costs. Green chemistry is probably not a solution to all environmental challenges, but it still remains to be the most fundamental approach in achieving sustainability goals. Green processes will not be successful if not economically viable and therefore Green technology must compete with classical processes with respect to cost of the product. More efforts are required from R&D as well as commercial teams to make our products “Good and Green”. Globally, there is an increased regulatory focus on ESG and climate risk, and the chemical industry will be the first one to face scrutiny. We need to work towards changing the environmental brand image of the chemical industry by focusing on sustainable and green technologies to deliver better and safer solutions. R&D will play an integral role in fostering economic and viable solutions for future growth.","filter_flag":1}
{"title":"Samuel Ross joins Beats by Dre - HYPEBAE","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vaHlwZWJhZS5jb20vMjAyMy82L3NyLWEtZm91bmRlci1zYW11ZWwtcm9zcy1iZWF0cy1ieS1kcmUtcHJpbmNpcGFsLWRlc2lnbi1jb25zdWx0YW50LXJvbGUtZGV0YWlsc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vaHlwZWJhZS5jb20vMjAyMy82L3NyLWEtZm91bmRlci1zYW11ZWwtcm9zcy1iZWF0cy1ieS1kcmUtcHJpbmNpcGFsLWRlc2lnbi1jb25zdWx0YW50LXJvbGUtZGV0YWlsc9IBAA?oc=5","id":"CBMiaWh0dHBzOi8vaHlwZWJhZS5jb20vMjAyMy82L3NyLWEtZm91bmRlci1zYW11ZWwtcm9zcy1iZWF0cy1ieS1kcmUtcHJpbmNpcGFsLWRlc2lnbi1jb25zdWx0YW50LXJvbGUtZGV0YWlsc9IBAA","guidislink":false,"published":"Thu, 22 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=173, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vaHlwZWJhZS5jb20vMjAyMy82L3NyLWEtZm91bmRlci1zYW11ZWwtcm9zcy1iZWF0cy1ieS1kcmUtcHJpbmNpcGFsLWRlc2lnbi1jb25zdWx0YW50LXJvbGUtZGV0YWlsc9IBAA?oc=5\" target=\"_blank\">Samuel Ross joins Beats by Dre<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">HYPEBAE<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Samuel Ross joins Beats by Dre - HYPEBAE","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vaHlwZWJhZS5jb20vMjAyMy82L3NyLWEtZm91bmRlci1zYW11ZWwtcm9zcy1iZWF0cy1ieS1kcmUtcHJpbmNpcGFsLWRlc2lnbi1jb25zdWx0YW50LXJvbGUtZGV0YWlsc9IBAA?oc=5\" target=\"_blank\">Samuel Ross joins Beats by Dre<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">HYPEBAE<\/font>","source.href":"https:\/\/hypebae.com","source.title":"HYPEBAE","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"British artist and designer Samuel Ross has made a significant impact in the industry, gaining recognition for his successful label A-COLD-WALL* and acclaimed consultancy firm SR_A. Hence, it comes as no surprise that he has joined Beats as its first-ever Principal Design Consultant. With his industrial design studio, SR_A, Ross will shape the brand’s industrial design strategy, focusing on new products and packaging. The emphasis will be on incorporating sustainable materials, premium finishes and thoughtful color selection to enhance the overall product experience for Beats’ consumers. In 2021, Ross collaborated with Beats on the highly sought-after Studio3 Wireless design, which achieved global sellout, marking the start of a unique partnership. As the Principal Design Consultant, Ross brings a fresh, global perspective to Beats, infusing the brand with innovation and artistic sensibility. Ross expressed his excitement about the new role, stating: “It’s an honor to join Beats as the first Principal Design Consultant. Beats is a technology brand with a legacy deeply rooted in culture and the future. Together, we aim to further develop the design language, explore material experimentation and enhance the brand’s character. Our vision will blend wearability, style and functionality, representing the intersection of expression and practicality.” As we await further details, keep an eye on this space for more updates. In case you missed it, Pharrell Williams opens “Skateboard” instagram for Louis Vuitton.","filter_flag":1}
{"title":"How Up-Fuse is turning plastic waste into trendy fashion - Gulf Business","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vZ3VsZmJ1c2luZXNzLmNvbS91cC1mdXNlLXR1cm5zLXBsYXN0aWMtd2FzdGUtaW50by10cmVuZHktZmFzaGlvbi_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vZ3VsZmJ1c2luZXNzLmNvbS91cC1mdXNlLXR1cm5zLXBsYXN0aWMtd2FzdGUtaW50by10cmVuZHktZmFzaGlvbi_SAQA?oc=5","id":"CBMiSWh0dHBzOi8vZ3VsZmJ1c2luZXNzLmNvbS91cC1mdXNlLXR1cm5zLXBsYXN0aWMtd2FzdGUtaW50by10cmVuZHktZmFzaGlvbi_SAQA","guidislink":false,"published":"Wed, 28 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=179, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vZ3VsZmJ1c2luZXNzLmNvbS91cC1mdXNlLXR1cm5zLXBsYXN0aWMtd2FzdGUtaW50by10cmVuZHktZmFzaGlvbi_SAQA?oc=5\" target=\"_blank\">How Up-Fuse is turning plastic waste into trendy fashion<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Gulf Business<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How Up-Fuse is turning plastic waste into trendy fashion - Gulf Business","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vZ3VsZmJ1c2luZXNzLmNvbS91cC1mdXNlLXR1cm5zLXBsYXN0aWMtd2FzdGUtaW50by10cmVuZHktZmFzaGlvbi_SAQA?oc=5\" target=\"_blank\">How Up-Fuse is turning plastic waste into trendy fashion<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Gulf Business<\/font>","source.href":"https:\/\/gulfbusiness.com","source.title":"Gulf Business","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Image credit: Supplied Tell us what inspired you to launch Up-fuse. My co-founder Lama El Khawanky and I grew up in Egypt and would always see trash dirtying the beautiful shores of Egypt and parts of Cairo and other cities. Unfortunately, the situation only got worse. The mission behind Up-fuse was to create a slow fashion, eco-conscious brand, which seamlessly transforms plastic waste into durable and stylish products for a greener future. We wanted to be active participants in changing everyone’s mindsets revolving around environmental change but were also deeply passionate about creating a social impact in the community. This was the driving factor that inspired us to finally take a huge leap and launch Up-fuse to create products using only recycled and sustainable materials while also supporting our community by creating jobs for the locals. Tell us how you have contributed to the circular economy. At Up-fuse, we seek to prove that ecologically sound businesses are not far-fetched concepts, as we adopted a business model that helps in reducing waste through production rather than the opposite. Our brand is focused on creating quality pieces that are timeless and designed for longevity to encourage our customers to reduce the need for frequent replacements for their wardrobes. Every single item is upcycled and is produced using only recycled and sustainable materials to promote resource efficiency and waste reduction to contribute to a more environmentally conscious fashion industry. So far, we have recycled over one million plastic bags, 400,000 bottles, and 400 tyres – a huge milestone and achievement for us. With our recent expansion in the UAE, we have also established a local distribution channel to reduce the carbon footprint. What is your business model and how do you source your material and from where? Since launching in 2013, Up-fuse has always been an eco-conscious e-commerce brand where all our products are available to purchase on our website and can be shipped worldwide. We recently opened a physical store in El Gouna, a town in Egypt’s Red Sea region and have now expanded our online presence in the UAE by working with a startup called Yanzo, which is our local distributor. We work with local non-governmental organisations (NGOs) across Egypt to source all our waste material from old tyres, plastic bags and bottles and then upcycle them into a variety of durable and stylish products. We collaborate with informal and formal garbage collectors in Cairo and we sort, clean and store the materials in our production house. We also have a donation format where direct and business clients can donate their plastic materials on a monthly basis. Finally, we work with factories that usually discard plastics of bad quality and use them in our production. How do you support the communities you work with? We constantly engage with our local community and empower businesses and organisations by working with talented, yet previously underappreciated, Egyptian artisans and migrants, the majority of whom are women, to help unearth talent and a sense of purposeful belonging. With an aim to support the unprivileged locals and refugees in the handicrafts business, we collaborate with local NGOs to create jobs within the community. How has the market responded to your product? So far, we have received some great responses and positive feedback about our products from customers who are looking for new sustainable alternatives instead of conventional fashion. Our customers find the products to be functional and one-of-a-kind featuring unique designs. They feel good about their purchase because they love the message behind it. Tell us about the bestsellers in your product range. The Lolita Multi Way Bag (see right) has been our hero product and best-selling piece. It is made from 15 upcycled plastic bags and is definitely a must-have piece, as it can be dressed up or dressed down by wearing it as a cross-body or shoulder bag, or even as a clutch. It also comes in various colours and designs to suit different styles and preferences. Our customers also love our range of small wallets, which are compact and made from three-five upcycled plastic bags, and laptop sleeves which are made from 20-25 upcycled plastic bags. Any recent highlights for the brand? Being a part of the United Nations Climate Change Conference 2022 (COP27) is definitely one of the notable highlights in our journey with Up-fuse so far. We had the privilege to showcase our firm and provide upcycled goods as a verified supplier, which segued into opportunities to scale production and evolve as a regional leader in this space. Another highlight would be getting the opportunity to work with local NGOs in Egypt who help us source most of the waste materials that can be recycled to create Up-fuse products. We are part of the Adidas Run Campaign and provide runners with giveaways, connecting our community with runners to raise environmental awareness. Lastly, we have enabled customised vocational training for the IOM (International Organization of Migration) for 30 women from Sudan, Syria and Egypt to educate them about sewing, plastic recycling and making bags. How can we as consumers support the circular economy? As consumers, we can choose to actively support the circular economy by making the conscious decision to purchase products from slow fashion brands that are designed to last and produced with high-quality craftsmanship. It is important to realise the environmental harm caused by frequently purchasing items for your wardrobe. Rather, it is much more effective to invest in quality, timeless pieces that are versatile and last longer. Supporting the circular economy simply means shifting mindsets and having a mindful approach to consumption. Some of the other ways I feel we can be a part of the circular economy include embracing second-hand\/pre-loved items, donating or recycling previous items, reducing throwaway culture by using items to their maximum potential and borrowing instead of buying things for limited usage. What’s next for the brand? Going forward, the plan is to continue investing into our mission of making an environmental and social impact that will put us on the path to being one of the leading sustainable brands in the UAE and strengthening our credible global reputation. In addition, we will be launching a couple of new products this summer including bags, slippers, cover-ups and kaftans for our customers in the UAE who plan to travel or stay in the city. We are very open to collaborations in the UAE and are excited to increase our presence and be a part of eco-friendly fashion conversations in the region.","filter_flag":1}
{"title":"Next generation gantry sees BAT UK help retailers keep up in fast-moving alternative nicotine products landscape - Grocery Trader","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL2dyb2Nlcnl0cmFkZXIuY28udWsvbmV4dC1nZW5lcmF0aW9uLWdhbnRyeS1zZWVzLWJhdC11ay1oZWxwLXJldGFpbGVycy1rZWVwLXVwLWluLWZhc3QtbW92aW5nLWFsdGVybmF0aXZlLW5pY290aW5lLXByb2R1Y3RzLWxhbmRzY2FwZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL2dyb2Nlcnl0cmFkZXIuY28udWsvbmV4dC1nZW5lcmF0aW9uLWdhbnRyeS1zZWVzLWJhdC11ay1oZWxwLXJldGFpbGVycy1rZWVwLXVwLWluLWZhc3QtbW92aW5nLWFsdGVybmF0aXZlLW5pY290aW5lLXByb2R1Y3RzLWxhbmRzY2FwZS_SAQA?oc=5","id":"CBMijQFodHRwczovL2dyb2Nlcnl0cmFkZXIuY28udWsvbmV4dC1nZW5lcmF0aW9uLWdhbnRyeS1zZWVzLWJhdC11ay1oZWxwLXJldGFpbGVycy1rZWVwLXVwLWluLWZhc3QtbW92aW5nLWFsdGVybmF0aXZlLW5pY290aW5lLXByb2R1Y3RzLWxhbmRzY2FwZS_SAQA","guidislink":false,"published":"Tue, 06 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=157, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL2dyb2Nlcnl0cmFkZXIuY28udWsvbmV4dC1nZW5lcmF0aW9uLWdhbnRyeS1zZWVzLWJhdC11ay1oZWxwLXJldGFpbGVycy1rZWVwLXVwLWluLWZhc3QtbW92aW5nLWFsdGVybmF0aXZlLW5pY290aW5lLXByb2R1Y3RzLWxhbmRzY2FwZS_SAQA?oc=5\" target=\"_blank\">Next generation gantry sees BAT UK help retailers keep up in fast-moving alternative nicotine products landscape<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Grocery Trader<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Next generation gantry sees BAT UK help retailers keep up in fast-moving alternative nicotine products landscape - Grocery Trader","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL2dyb2Nlcnl0cmFkZXIuY28udWsvbmV4dC1nZW5lcmF0aW9uLWdhbnRyeS1zZWVzLWJhdC11ay1oZWxwLXJldGFpbGVycy1rZWVwLXVwLWluLWZhc3QtbW92aW5nLWFsdGVybmF0aXZlLW5pY290aW5lLXByb2R1Y3RzLWxhbmRzY2FwZS_SAQA?oc=5\" target=\"_blank\">Next generation gantry sees BAT UK help retailers keep up in fast-moving alternative nicotine products landscape<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Grocery Trader<\/font>","source.href":"https:\/\/grocerytrader.co.uk","source.title":"Grocery Trader","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"New ‘eye-catching’ gantry is BAT UK’s response to fast-changing market for alternative nicotine products and is due for launch to UK retailers in June A small group of retailers toured a pilot store in Glasgow and the manufacturer in Spain – their feedback will help BAT UK with future improvements. Established BAT UK partner Zedis manufacture the gantry with zero waste using sustainable materials all sourced within 50 km of their factory. BAT UK is helping retailers make another confident stride in the fast-changing alternative nicotine market by launching a new sustainable gantry solution. The gantry blends sustainability, innovation and quality and is BAT’s response to ongoing changes in the UK market for tobacco and the rise in the number of alternative nicotine products. Set for launch to retailers in June, the gantry includes several features to help retailers to display products and promotions more clearly for customers. “The alternative nicotine category is evolving very quickly and it’s hard to determine where it will lead to next,” said Afzal Rahman, B2B manager at BAT UK. “We want to work with independent retailers to create an ideal solution to help them navigate the category and be successful in it too.” The gantry highlights new products and displays a product range in a clear and distinct way with its backlit design, helping customers browse and choose the right products for them. Three media screens installed above the gantry will help retailers market products such as Vuse* and Velo*. The screens can be tailored to any promotion, keeping adult nicotine consumers informed before they reach the till area. Hashim Tahir, B2B executive at BAT UK, said: “With the exceptional growth of vapes in the past few years, BAT UK noticed a gap in the market, and we realised retailers aren’t equipped to merchandise and range the category correctly to drive sales and attract adult nicotine consumers to the category. “We want to help retailers update their tobacco gantries, which can be seen as outdated as retailers transition to drawers underneath the till area. The gantry we have built offers a multi-category solution where retailers are able to display vapes and alternative nicotine products together, while having space for tobacco.” Retailers on tour A group of seven UK retailers joined representatives from BAT, on a visit to the 800sq ft Day-Today store in Glasgow. Owner Irfan Ahmad became the first UK retailer to offer the new gantry solution, a decision he made based on its modern design and focus on alternative nicotine products. “Other companies we reached out could only offer the traditional tobacco gantry and they hadn’t moved with the market,” explained Ahmad. “BAT UK’s new gantry is offering something new by focusing on alternative nicotine products”. “Working with BAT UK has been great,” Ahmad said. “They worked with me every step of the way, helping me to understand the alternative nicotine product category, as well as ensuring we offered the right products. BAT UK really listened to me about what I needed in my store to drive sales.” Six of the seven retailers also joined BAT UK and Retail Express to visit the Zedis factory in Barcelona to see how each gantry is made. They praised the new solution and the invitation from BAT to help shape the product in future: Vince Malone, Tenby Stores and Post Office, Pembrokeshire “It’s clear BAT UK are great at what they do and today has been fantastic. From a customer’s point of view, the gantry is really eye-catching. It will capture their attention as soon as they walk in store, and while they might not purchase something straightaway, it brings those products to the forefront of their mind.” Sunita Aggarwal, Spar Hackenthorpe, Sheffield “Going on the tour was amazing to see how they put everything together. We also liked how they source all their materials locally, too. It’s nice to be part of the journey, listened and spoken to us and taken on our ideas.” Sustainable, high quality Building a sustainable gantry solution was key for BAT UK – the new gantry uses 100% recycled plastic and a selection of wood and metal that makes it lighter in weight than previous solutions. All materials used to make the gantry are sourced from within a radius of 50km of the Barcelona site and their reuse or recycling means there’s zero wastage from the manufacturing process. A Wi-Fi linked smart plug can help retailers using the gantry to monitor its energy consumption. In addition to LED lighting, the new gantry offers push mechanisms, adjustable shelf height and has a central locking system for the drawers to help keep tobacco secure. Retailers will also benefit from upgradable product labels and unique planogram updates.","filter_flag":1}
