{"title":"Chemistry Urgently Needs to Develop Safer Materials - Scientific American","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LnNjaWVudGlmaWNhbWVyaWNhbi5jb20vYXJ0aWNsZS9jaGVtaXN0cnktdXJnZW50bHktbmVlZHMtdG8tZGV2ZWxvcC1zYWZlci1tYXRlcmlhbHMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LnNjaWVudGlmaWNhbWVyaWNhbi5jb20vYXJ0aWNsZS9jaGVtaXN0cnktdXJnZW50bHktbmVlZHMtdG8tZGV2ZWxvcC1zYWZlci1tYXRlcmlhbHMv0gEA?oc=5","id":"CBMiX2h0dHBzOi8vd3d3LnNjaWVudGlmaWNhbWVyaWNhbi5jb20vYXJ0aWNsZS9jaGVtaXN0cnktdXJnZW50bHktbmVlZHMtdG8tZGV2ZWxvcC1zYWZlci1tYXRlcmlhbHMv0gEA","guidislink":false,"published":"Sat, 25 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=25, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=56, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LnNjaWVudGlmaWNhbWVyaWNhbi5jb20vYXJ0aWNsZS9jaGVtaXN0cnktdXJnZW50bHktbmVlZHMtdG8tZGV2ZWxvcC1zYWZlci1tYXRlcmlhbHMv0gEA?oc=5\" target=\"_blank\">Chemistry Urgently Needs to Develop Safer Materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Scientific American<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Chemistry Urgently Needs to Develop Safer Materials - Scientific American","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LnNjaWVudGlmaWNhbWVyaWNhbi5jb20vYXJ0aWNsZS9jaGVtaXN0cnktdXJnZW50bHktbmVlZHMtdG8tZGV2ZWxvcC1zYWZlci1tYXRlcmlhbHMv0gEA?oc=5\" target=\"_blank\">Chemistry Urgently Needs to Develop Safer Materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Scientific American<\/font>","source.href":"https:\/\/www.scientificamerican.com","source.title":"Scientific American","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Prevention\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Ron Fodo, Ohio EPA Emergency Response, looks for signs of fish and also agitates the water in Leslie Run creek to check for chemicals that have settled at the bottom following a train derailment that is causing environmental concerns on February 20, 2023 in East Palestine, Ohio. On February 3rd, a Norfolk Southern Railways train carrying toxic chemicals derailed causing an environmental disaster. As the story of the Norfolk Southern chemical spill in East Palestine, Ohio, continues to unfold, we are learning how this freight train derailment polluted local waterways and released hazardous contaminants into the air. People returning to their homes speak of health issues and dead pets, and the Environmental Protection Agency is now forcing the train company to pay for the cleanup. While this incident highlights the need for safer chemical transport, we believe what has happened is also a wake-up call for rethinking the chemistry that fuels our economy. The cargo manifest of the freight train shows multiple cars contained combustible or flammable petroleum-based chemicals besides vinyl chloride. They include benzene and butyl acrylate, which are also precursors to plastics and other chemicals, as well as 2-butoxyethanol, a common ingredient in paint strippers and cleaning products. These chemicals include carcinogens, mutagens, reproductive system and organ toxicants, and skin and respiratory irritants. Fish kills in affected streams raise concerns about the long-term safety of drinking water and soils. And scientists are only beginning to look at persistent and toxic by-products, such as dioxins, created by the purposeful ignition of five tanker cars, in homes and soil. It is shocking that this cargo was not officially classified as hazardous. If we want to end dangerous chemical incidents that make people and ecosystems sick, we need to address our dependence on these chemicals and the manufacturing processes needed to make them. This derailment and the chaos it has created must spur chemists, the chemical industry and the companies that rely on chemical products to create safer and more sustainable chemicals, processes, materials and products. On supporting science journalism If you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today. The current generation of chemicals that form the basis of our economy, including vinyl chloride and benzene, were rapidly developed, deployed and scaled prior to the 1960s. Their chemistries were built on increasingly abundant fossil-fuel platforms and designed for functionality and low cost. As “the industry of industry,” firms have used these chemicals to create new products and applications, in particular to create plastics, and to advance transportation, communications and construction technologies. Although environmental and occupational health laws of the 1970s and 1980s resulted in significant improvements in chemical safety, how we regulate these chemicals assumes that we can enjoy the benefits of what was transported by the derailed Norfolk Southern train while controlling the risks. But those risks can never be fully controlled. The Ohio derailment was only one of more than 20,000 hazardous materials transport incidents that happen each year. More than 11,000 facilities across the U.S. make, use or store hazardous chemicals in amounts that could harm people or the environment, according to the U.S. Government Accountability Office. And 202 accidental releases happen per year on average at manufacturing, distribution and public works facilities. About one quarter of them affect nearby communities. The Environmental Protection Agency estimates the quantified annual damages from chemical accidents to be $434 million per year and the loss in property values caused by incidents in about 660 facilities from 2004 to 2019 to be $39.5 billion. Many of these facilities are located both in low-income communities of color and in areas with natural hazards that are likely to be exacerbated by climate change, increasing the potential for toxic chemical incidents in the future. After several major chemical incidents, including the Union Carbide disaster in Bhopal, India, in the 1980s that killed thousands of people, a broad consensus emerged to change chemicals management strategies away from emissions controls, Tyvek suits, respirators and emergency cleanup plans. Preventing pollution at the source became a national priority with the 1990 Pollution Prevention Act. For many scientists and engineers, prevention at the source meant developing approaches to eliminate hazards by, for example, substituting dangerous chemicals in manufacturing processes with less dangerous ones or redesigning production processes and products to negate or dramatically reduce the use of toxic substances. By the mid-1990s the concepts of inherent safety, green engineering and green chemistry emerged that applied the principles of pollution prevention to molecular and process design. A diverse group of experts recently developed a definition of sustainable chemistry as the “development and application of chemicals, chemical processes, and products that benefit current and future generations without harmful impacts to humans or ecosystems.” The European Union has also developed criteria for chemicals that are “safe and sustainable by design.” Bringing together chemists and engineers with health scientists to better understand, evaluate, and eliminate environmental and health hazards at the design phase of chemicals and chemical processes will ultimately reduce hazards to workers, communities and consumers from production, transport, use, and end of life of chemicals and chemical products. Yet despite growing interest in sustainable chemistry in the research and education communities, industry and government have not fully embraced it. Transitioning to safer and less hazardous chemicals and products is easier said than done. The chemicals and materials we have today—including polyvinyl chloride (PVC), the main use of vinyl chloride—are cost-effective, well performing and highly integrated into global supply chains. There is little incentive to transition, particularly given the significant costs of research and development, piloting, capitalization and reformulation to integrate new, safer chemicals into the economy—and little willingness from anyone to pay those extra costs. We won’t adequately address the problems of hazardous chemicals without a supply of cost-effective and safer solutions. Rethinking the chemistries, manufacturing processes and materials that fuel our economy will require significant government coordination, investment, collaboration across industry, and meaningful engagement with academia and communities—the same concerted and sustained effort that built the current generation of chemicals. It will also require educating a new generation of chemists and engineers. Innovations in chemistry and chemical processes are critical to addressing the hazards of chemicals, but they can also address the industry’s significant contribution to climate change and plastics waste, which are increasingly under scrutiny from the investment community and government authorities. The federal government has a unique opportunity to demonstrate leadership in advancing sustainable chemistry through its implementation of the Sustainable Chemistry Research and Development Act. And it can ensure that the massive investments made in manufacturing processes and materials to decarbonize the economy through the Inflation Reduction Act also address the toxicity and hazards of our current chemicals and materials. (The chemical industry is responsible for 20 percent of industrial CO 2 emissions, according to the Department of Energy.) Research indicates that such investments would not only reduce the billions of dollars that toxic incidents cost us each year but would actually be beneficial to the economy, positioning the U.S. as an innovation and sustainability leader. Designing, applying and scaling new chemistries and manufacturing processes will take significant time—likely decades—given cycles of research, development and manufacturing. But in the meantime, to avoid another East Palestine disaster, we need to enhance safety controls to protect communities and workers from such toxic tragedies. These safety controls include requiring electronic brake systems, expanding the number of well-trained safety-focused workers, and evaluating risks at facilities to adopt safer options when available. The hundreds of people who were under mandatory evacuations have mostly returned to their community, which is now the focus of a massive hazardous waste cleanup operation. These people deserve immediate action to address this disaster. But for every community that has been or could be affected by hazardous chemical incidents, we need long-term sustained actions and investments to prevent such disasters by replacing hazardous chemicals with alternatives that are fundamentally safer to manufacture, transport and use. This is an opinion and analysis article, and the views expressed by the author or authors are not necessarily those of Scientific American.","filter_flag":1}
{"title":"Literacy rate impact on innovations and environmental pollution in China - Frontiers","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTE1NDA1MtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTE1NDA1MtIBAA?oc=5","id":"CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTE1NDA1MtIBAA","guidislink":false,"published":"Mon, 20 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=20, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=51, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTE1NDA1MtIBAA?oc=5\" target=\"_blank\">Literacy rate impact on innovations and environmental pollution in China<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Literacy rate impact on innovations and environmental pollution in China - Frontiers","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTE1NDA1MtIBAA?oc=5\" target=\"_blank\">Literacy rate impact on innovations and environmental pollution in China<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","source.href":"https:\/\/www.frontiersin.org","source.title":"Frontiers","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Prevention\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"This study examines the impact of literacy rate and innovations on environmental pollution in China from 1990 to 2021. We applied the Quantile Autoregressive Distributed Lag method for the analysis, and our findings suggest that an increase in literacy rate leads to short- and long-term innovations. At the same time, literacy has a positive effect in 1st to 4th quantile in the long run. Furthermore, innovation has a positive effect on environmental pollution. However, in the short run, the literacy rate has negative implications for environmental pollution. These findings imply that education is essential to increase innovation in the economy. Besides, the literacy rate increases the standard of living, and thus, it is recommended that government should adopt environmental protection laws to reduce environmental pollution along with literacy increase. Additionally, China has achieved significant economic growth in the last few decades. To ensure sustainable economic growth government should introduce a carbon tax to minimize production externalities such as environmental pollution. 1 Introduction Chinese economic growth in recent years has been attributed to recent investments in physical and human capital investments. However, human capital’s contribution is low compared to physical assets. (Wei et al., 2001; Arayama & Miyoshi, 2004). According to Ding & Knight (2011), human capital is measured by the number of people enrolled in secondary and higher education, the number of science and technology workers in the labor force, and the amount of money on education and science. This is significantly associated with the number of innovations that occur within a nation. CHI (2008) synthesizes contradictory evidence: higher worker education does contribute to economic growth and innovations; however, its impact may be indirect, which explains its minimal direct effect on growth. Human capital, following the endogenous growth hypothesis, is hypothesized to motivate the development of new technologies and their dissemination, both of which, in turn, stimulate economic expansion. However, there is scant evidence that human capital affects innovation, and there is no evidence that education has any indirect positive effects on innovation-driven economic growth. Education plays a significant role in innovation at the regional level. Invention patent applications per capita were significantly correlated with the number of people who had earned advanced degrees (Chi & Qian, 2010). symptoms at presentation, physical exams and lab results. Increasing prosperity in China has a trickle-down effect, bringing new management techniques and cutting-edge technologies that can bolster innovation in other parts of the world. Innovations are the main engine attributed to a higher level of economic growth in China (Zhu et al., 2019). State Environmental Status Bulletin reported that in 2018, environmental air quality regulations were met in just 121 out of 338 prefecture-level cities in China, or 35.8% of the country’s urban areas. There were 822 days in 338 cities where pollution levels were dangerously high, 20 more than in 2017. Sixty percent of the time, PM2.5 was the main pollutant on days with severe pollution. The endogenous growth theory posits that technological progress is crucial to stimulating economic expansion (Malamud & Zucchi, 2019). There is a long history of research into how technological progress impacts the natural world. Holdren and Ehrlich (1971) suggested an association between the three variables (IPAT) theory, which posits that technological progress can mitigate the increase in pollution caused by a growing human population. The author classified the causes of environmental pollution into three categories: large-scale impacts; structural effects; and technological effects; with the latter two categories receiving particular attention because of the importance of technology in improving environmental quality. There is consensus among academia on how technological progress might enhance environmental quality. There has been a rise in studies examining the correlation between pollution reduction investments and creative output. Tursun et al. (2015) estimated the impact of engineering technology on pollution reduction from 2005 to 2010. Their results support the hypothesis that technical progress contributes to a 60% decrease in CO 2 and SO 2 . Levinson investigated the environmental impacts of the United States’ industrial sector in light of global trade and technological progress in 2009. The findings of that study show that technological progress has had a substantial positive influence on the environment of the United States’ manufacturing sector, with SO 2 emissions decreasing by 39% between 1987 and 2001. Pollution levels were inversely related to environmental research funding (Peng SJ, 2006). Increasing one’s potential for independent innovation can reduce the carbon dioxide intensity of the industrial sector, according to the results of a study done in China by Yang et al. (2014). Because of their increasing complexity and difficulty in assessment, environmental concerns are usually reduced to sound bites rather than being dealt with in a sensible matter. This is because their complexity is expanding. People with a substantial stake in a sort of economic development that is not sustainable and extracts resources can sometimes successfully derail efforts to address environmental concerns equitably. This is because they have a vested interest in the manner in which economic progress takes place. In order to ensure that education can play an essential part in defining and analyzing environmental issues and producing solutions to environmental challenges, the challenge is to convey this complexity in appealing and understandable ways to the audience that will be receiving this information. Even though significant progress has been made in protecting aquatic ecosystems, additional problems are still to come due to the growing human population and increased industrial production. Besides, several reforms have been made to protect the environment. Despite the perception that it is “soft” and garnering less attention than other activities to preserve the environment, environmental education develops future environmental problem solutions. Environmental education needs to be successful in the twenty-first century in terms of its goals of cultivating the next-generation of environmental leaders and increasing public awareness and concern for environmental issues (Hudson, 2001). Research, development, and innovations have been growing in China for the last few decades. In addition, the literacy rate in China has reached the highest level in the region, and the recent trade openness and industrialization bring a significant increase in the country, which puts pressure on the environment and leads to increases the environmental pollution such as CO 2 emissions. The past literature suggested a close association between innovations and CO 2 emissions. However, the relationship between literacy rate and CO 2 emissions relationship needs to be clarified in the literature. Therefore, the study aims to investigate the nexus between literacy rate, innovations, and environmental pollution in China. This study contributes to the existing literature from the following points; first, according to the best of our knowledge, this first study evaluates the nexus between literacy rate, innovations, and environmental pollution in China for the first time. This will help understand the implications of innovations and literacy for the CO 2 emissions in China. The study suggests policy implications that could help to reduce air pollution and speed up innovation activities in the country. Second, this study uses a novel QARDL method for analysis, which provides both short-run and long-run estimations. The QARL provides more robust estimations than the conventional ARDL method and better policy recommendations. 2 Literature review The term “academic literacy” has been given several different definitions and interpretations, all of which may be discovered scattered throughout the many bodies of scholarly literature. There are many different ways to interpret the term “content-area literacy.” However, the most comprehensive interpretation is that the term refers to skills connected to having a solid command of a subject and higher-level reasoning. There are many different ways to interpret the term “content-area literacy\" (Shanahan & Shanahan, 2008). The development of several abilities, such as critical and analytical thinking, linguistic fluency, social awareness, and involvement in the community, are all aspects of an education in literacy that should be comprehensive and well-rounded (Kiili et al., 2013). As a result, the concept comprises not just the fundamental literacy skills of reading and writing but also a wide range of academic capabilities in addition to those two specific literacies. In an effort to pin down just what we mean when we talk about “academic literacy,” various techniques have been tried throughout the years. It is a widely held view that to achieve academic literacy, one must possess a particular set of linguistic talents desirable in the employment market (Li, 2022). In various academic subfields, the idea of innovation has been the subject of research and discussion. Innovation can be defined as the process of coming up with new ideas, processes, or tools, as well as making use of those new ideas, methods, or technologies. There are many various types of innovation, some of which have been recognized in earlier research (De Vries et al., 2016), such as product and service innovation. Among the many different types of innovation, product innovation and service innovation are two of the most common. The creation and distribution of one-of-a-kind goods and services are the focus of the concepts known respectively as product innovation and service innovation. Process innovation refers to the development of new concepts, frames, or paradigms to assist in defining the nature of a problem and possible solutions, as opposed to conceptual innovation, which refers to shifts in the established procedures, techniques, routines, structures, or roles within an organization or administration. Conceptual innovation refers to developing new concepts, frames, or paradigms to assist in defining the nature of a problem and possible solutions (Liddle, 2013). Higher education in China has advanced tremendously since the turn of the century, and the country has also made significant strides in technological innovation. Between 1978 and 2000, and again between 2000 and 2018, the average yearly growth rate of the total number of conventional universities was 2.55 percent. Since 1998, there has also been an uptick in the number of students enrolling in traditional forms of higher education. The average annual growth rate of patents was 20.73% from 2000 through 2018, much greater than the average annual growth rate of 12.77% from 1985 through 2000 (WIPO IP Statistics Data Center, n.d.). The period covered by this study was from 2000 through 2018. China’s educational system has benefited from several measures taken by the Chinese government. The Chinese government recommended putting into action the Strategy of Developing the Country via Science and Education in 1995 when it realized the significance of education in fostering a culture of innovation. The decision to accelerate the advancement of science and technology considered this recommendation and included it. The same year, as an essential component of the strategy, the Chinese government launched the “211 Project,” which prioritizes the expansion of approximately one hundred institutions and a wide variety of essential academic specialties. China’s “985 Project” was initiated in 1999 to create several top-tier universities. Currently, the project intends to encourage the establishment of 39 prestigious academic institutions located all over the country. In the meantime, the Ministry of Education in China published its Action Plan for Education Promotion for the 21st century. This plan gave “university expansion” the highest priority in China’s higher education reforms and hurried up the development of traditional universities. From 44.92 percent in the year 2000 to 94.48 percent in the year 2010, the percentage of Chinese inhabitants who hold a college degree has skyrocketed, as shown by statistics from both the Chinese National Bureau of Statistics and the United States Census Bureau. On the other hand, reports from the World Intellectual Property Organization reveal precisely the opposite of what was stated (Pan et al., 2020). One essential variable that drives corporate innovation is macro-level education at the higher education institution level. To begin, partnerships between universities and businesses, academic conferences, and attempts to train employees all contribute to an increase in the innovative capacity of companies. As a second thing to consider, educational institutions can supply businesses with trained workers. The majority of China’s high-tech development zones can be found in areas that are home to a significant number of highly regarded educational institutions and research labs (Grimpe & Sofka, 2009). The Chinese economy had witnessed consistent and rapid growth since 1978, when it started reforming and opening up to the outside world. Even though the long-term extended model played a part in China’s economic miracle, the country is currently grappling with the burden of delayed development and worsening environmental quality. This is although the model played a part in China’s economic miracle. Even though this paradigm was the primary impetus for China’s miraculous economic rise, this is the result (Zhang et al., 2020). Since the beginning of China’s economic reforms, the potential of the country to innovate has considerably expanded. This can be seen in the rise in both the input and the output indicators of innovation systems, such as the number of people working in research and development, the amount of money spent on research and development, patents, high-tech and service exports, and scientific and technical journal articles. These are all indicators of innovation systems. However, although increasing quantity is always the first stage in every catch-up approach, the quality of many indicators has been called into question. This is despite the fact that increasing quantity is always the first step (Fan, 2015). Liu et al. (2022) analyzed the role of renewable energy and eco-innovation in Environmental performance and international trade in China. Their findings suggest that innovation and renewable energy improve the environmental quality, while trade increases the CO 2 emissions in China. Liu et al. (2022) investigated the relationship between infrastructure development, CO 2 emissions, and HDI in China; they reported that infrastructure development increases CO 2 emissions and HDI in China. Zeraibi, Ayoub, et al. (2022) reexamine the EKC hypothesis by adding China’s fiscal, monetary, and environmental development policies. Their results indicate a long-run relationship between fiscal and monetary expansion, economic growth, and CO 2 emissions. Past research focuses on education’s effect on economic growth and development, such as Stites & Semali (1991), Coman Nuta et al. (2022); Treiman (2007), and Mazumdar (2005) found the literacy rate improves the economic growth and development. Some other researchers such as Mughal et al. (2022); Wang and Wang (2022); Ibrahim and Vo (2021) and Xin et al. (2022) investigated the innovations and environmental pollution. There are mixed findings. Some research suggests that innovation reduces environmental pollution, while others suggest that innovation has either a negative or no effect on environmental pollution. In contrast to past research, the current study analyzes the nexus between literacy rate, environmental pollution, and innovation in China. 3 The trend of literacy rate on innovations and the environment in China Economic development has adverse implications for environmental quality in China and raises environmental concerns. The incompatibility of economic growth and environmental quality is a pain point in China’s economic transition and development. The key to overcoming the pain point is to achieve innovation-driven development. In other words, economic growth and environmental quality are not compatible with one another. Human capital’s impact on creative ability is a very popular area of study. The primary premise of the endogenous growth hypothesis, which states that gains in human capital led to increases in technical innovation, which in turn led to increases in economic growth, receives only a small amount of support from empirical research. Several studies have investigated China’s human capital’s role in the country’s capacity to absorb foreign knowledge and increase domestic production. However, the impact of human capital on a nation’s capacity to produce its own unique body of knowledge has received little attention from researchers. In order to resolve this issue, we made use of data on patent applications and education at the province level, as well as methodologies from the field of spatial econometrics, to take into account the spatial dependence of observations. Figure 1 presents patent and CO 2 emissions in China, while Figure 2 shows the patent and literacy Rate in China from 1985 to 2021. We found a strong correlation between the educational level of workers and the amount of innovation activity in the province, which was measured by the number of invention patent applications submitted for every 10,000 residents. The impact of higher education on innovation is far greater than that of primary and secondary schools combined. We also discovered something less encouraging: during the past decade, the significance of workers’ post-secondary education to the innovation process has decreased. More research is required to assess whether higher education’s impact on innovation has lessened and the reasons for this (Chi & Qian, 2010). Pan et al. (2020) explored the criteria that education plays a role in Promote Firm Innovation in China. They identified that The United Nations established seventeen goals for sustainable development in 2015, and many of them are interconnected. FIGURE 1 FIGURE 1. Patent and CO 2 emissions in China. FIGURE 2 FIGURE 2. Patent and literacy rate in China. Two of these goals are increasing access to education at a high level and discovering alternative sources of energy that are not dependent on fossil fuels. This study’s objective is to investigate the connection between the amount and quality of higher education and the innovative capacity of businesses. Data from the one-of-a-kind Chinese Patent Census Database (1991–2018), the Chinese Industrial Enterprise Database (1995–2013), and provincial-level schooling statistics were utilized in the empirical investigation. Inferences such as the following can be drawn from these findings of empirical research: The quality of higher education that was made available in those provinces was the key factor that contributed to the lack of average innovation outcomes achieved by Chinese businesses on a provincial level. The rapid increase in the number of persons with post-secondary educations from institutions that are not among the nation’s elites is one hypothesis that may help to explain this phenomenon. People who did not graduate from a prestigious university are less likely to be inventive. However, they have a higher likelihood of being employed by businesses that have this quality in common. Graduates typically find work in fields related to advanced technology. To put it another way, China’s efforts to expand access to education have placed excessive emphasis on expanding enrollment and insufficient attention on improving the standard of education being offered. Second, having a college degree was positively related to company innovation; however, having a degree from a less prestigious university was negatively connected with company creativity. There is a possibility that the Chinese government is increasing its support for famous universities in part because these institutions serve as experimental locations for educational reform programs meant to stimulate innovative thinking among students. Third, whereas prestigious higher education had almost little bearing on the innovative activities of SOEs and FOEs, it had a significant and positive role in the creative endeavors of POEs. This is because Chinese higher education institutions that are not considered to be of elite status place a greater focus on educating students for the workforce than they do on scientific inquiry and the development of new products. State-owned enterprises (SOEs) in China are frequently subject to significant amounts of influence from the government, and they provide little incentive for innovative personnel to produce. On the other hand, foreign-owned enterprises (FOEs) in China may obtain technology from their overseas parents. The implications of our empirical findings, both in terms of theory and in terms of practice, are significant. To begin, we separated the several hypotheses that endogenous growth models rely on. The unique qualities of each student’s selected school and institution will determine the extent to which they are encouraged to think creatively. Second, after successfully expanding the higher education sector, the Chinese government should shift its focus from education quantity to education quality and pay more attention to improving innovative capabilities in teaching and research, particularly for non-elite higher education institutions. This should be done because the Chinese government has successfully expanded the higher education sector. In the meantime, the most prestigious educational institutions continue to be crucial for the creativity of developing countries. As a result of China’s rise to prominence as a major producer on the global market, the country’s environmental conditions have deteriorated considerably in recent decades, placing the country’s population in grave danger and contributing to a variety of ongoing socioeconomic problems. In the past 20 years, there have been significant shifts, most notably in the execution of environmental and emission standards, which have gone from weak to robust. These changes have been particularly notable in the United States. In recent years, China’s environmental issues have emerged as a matter of national significance, making it necessary for the country to take action. The Air Pollution Prevention and Control Action Plan, the Environmental Protection Law of 2015, the Environmental Protection Tax Law of 2017, and several other significant efforts on national policy have all been passed and made operationally (Jin et al., 2016). China, the country with the largest industrial sector in the world, continues to face significant environmental difficulties even though numerous efforts and ambitious plans have been made at various periods at the local, provincial, and federal levels. China is particularly susceptible to the effects of SO 2 and CO 2 emissions on civilization. These consequences can be felt worldwide, but China is particularly at risk. Therefore, to solve the issue before it is too late, new environmental standards based on objective criteria need to be developed. The issues that were caused by pollution and smog in the country were balanced out by addressing the issue of carbon trading, which has added a significant agenda item to the government’s ambitions for the next 5 years. Environmental non-governmental organizations can help facilitate a more objective assessment of environmental problems and possible solutions to such problems. The quick increase in CO 2 emissions caused environmental degradation in past few decades. Chinese government have made significant efforts to reduces the emissions in the country. According to the findings of this study, there is a significant gap in effectiveness between the various regulatory agencies. However, government agencies now have greater leeway to initiate legal action against those who violate environmental regulations. The Environmental Protection Tax Law, which was just passed into law, includes a provision that proposes expanding the scope of environmental levies to include carbon dioxide emissions. It is necessary to make a payment for the carbon tax. However, the government should prioritize creating an economy with a minimal carbon footprint and a society that is, sympathetic to the environment. A better environmental future for China and the rest of the world requires paying attention to ensuring implementation compared to analyses of the results, public interest, participation, transparency, and efficiency in suggesting penalties on the responsible and then reviewing compatibilities of the environmental laws. Figure 3 presents the trend between literacy rate and CO 2 emissions in China from 1985 to 2021. This is necessary to achieve the ultimate environmental goals (Khan & Chang, 2018). China’s environmental protection law (EPL) aims to improve the environment through a legal system. Share the environmental database that accurately measures environmental pollution; effectively implement the environment laws; close monitoring of industries that may affect the environment. Strict measures and extremely high accountability standards should be implemented to maintain the country’s emission level. Implementing carbon tax in industries to mitigate emissions is a good decision. FIGURE 3 FIGURE 3. Literacy Rate and CO 2 emissions in China. Even if the revised EPL satisfies China’s environmental protection requirements, there is still a significant amount of potential for improvement. The following are a few suggestions that were made throughout this inquiry that might be of some use: • Consistent legislative actions aiming at improving the legal system, with a primary emphasis on the approach for implementing the EPL; • Establishing a framework for numerous government agencies to share environmental database information is essential to achieve the most effective harmonization, which must then be followed by the proper measures in order to build an inter-regional environmental enforcement mechanism; • Increasing environmental intelligence is necessary in order to enforce laws more effectively and identify instances of contamination in the environment. • The state’s economic authorities should encourage firms that are sustainable and beneficial to the environment, and they should phase out inefficient industrial methods. • The non-governmental organizations (NGOs) that work to safeguard the environment play an important role in society and must receive funding. It is essential to make the most of their potential by increasing their capacities and fortifying their pathways; • Polluters need to be held to extremely high accountability standards for installing suitable environmental monitoring equipment and maintaining accurate emission records when pollution is produced. • In order to safeguard the environment to the greatest extent feasible, it is imperative that polluters be incentivized to work together and that efforts to educate the general public about the myriad of laws governing environmental protection be strengthened. • Obtaining insurance is an excellent way to prepare for the approaching carbon tax. The world’s economy and the monetary system will undergo shifts as a direct consequence of the imposition of a price on carbon. China’s government is responsible for seizing the opportunity for a global low-carbon economy by identifying policies and activities pertinent to the issue. • Building a low-carbon economy and culture on a large scale is needed. Before selecting how to impose a carbon tax, it is necessary to analyze both the benefits and the drawbacks of such a tax because its implementation is a foregone conclusion. The government has to prioritize raising the amount of support it provides for low-carbon innovation and providing aid to partnerships working to increase energy consumption and production. • Second, we need to move forward with production methods that are cutting-edge, low-carbon, and ecologically benign while simultaneously building upon and boosting industries that are already well-established. In conclusion, the industry should devise, create, and distribute low-carbon products to eliminate trade barriers, increase market share, and advance the industry (Environmental Law: 2 Years On - China Water Risk, n.d.). 4 Materials and methods The study uses the nexus between literacy rate, innovation, and environmental innovation in China; this study develops two models to analyze the data P = α 1 + β 1 L i + β 2 G D P + β 3 R & D + β 4 N R + ε 1 ( 1 ) E n v = α 2 + β 5 L i + β 6 G D P + β 7 P o p + ε 2 ( 2 ) Where, L = Literacy Rate is the independent variable, R&D = R&D spending. Pt = Patent (innovation) NR = number of researchers in a country (per million people) Env = Environmental pollution–CO2. GDP = GDP. E = Energy consumption. The expected sign of the coefficients suggests holding a positive LI, GDP, R&D, and NR. At the same time, GDP and population have positive expected signs, and literacy rate is assumed a negative relationship with CO2 emissions. Further, the literature suggests that literacy can enhance environmental quality in China. Therefore, this study aims to measure the implications of literacy on innovation and the environment for the period 1985-2021. The study applied the QARDL model suggested by Hashmi et al. (2022). QARDL method allows us to investigate the long-run and short-run relationship between literacy rate, GDP, R&D, NR, and innovation. QARDL is a more advanced method than ARDL and measures variations in explanatory variables. We use two separate models in this study; the simplified version of ARDL can be written as P t = ϕ + ∑ i = 1 n ϑ 1 i L I t − i + ∑ i = 0 m ϑ 2 i G D P t − i + ∑ i = 0 k ϑ 3 i R & D t − i + ∑ i = 0 l ϑ 4 i N R t − i + ∑ i = 0 l ϑ 4 i C O 2 t − i + μ t ( 3 ) P t = ϕ + ∑ i = 1 n ϑ 1 i L I t − i + ∑ i = 0 m ϑ 2 i G D P t − i + ∑ i = 0 k ϑ 3 i R & D t − i + ∑ i = 0 l ϑ 4 i N R t − i + ∑ i = 0 l ϑ 4 i C O 2 t − i + μ t ( 4 ) The Quantile ARDL is the extension of the basic ARDL method; following these two models in Equations (1), (2), we can rewrite as follow, Q P t = λ τ + ∑ i = 1 r ϑ i τ P t − i + ∑ i = 0 t ϑ i τ L I t − i + ∑ i = 0 d ϑ i τ R & D t − i + ∑ i = 0 s ϑ i τ N R t − i + κ t τ ( 5 ) Q E N V t = π τ + ∑ i = 1 e ϑ i τ L I t − i + ∑ i = 0 n ϑ i τ G D P t − i + ∑ i = 0 h ϑ i τ P t − i + ϖ t τ ( 6 ) To account the possibility of serial correlations, the QARDL model in equations (2)&3) needs to be generalized, demonstrating the QARDL-ECM model: Q Δ P t = θ ( τ ) + γ ( τ ) ( P t − 1 − β L I ( τ ) L I t − 1 − β G D P ( τ ) G D P t − 1 − β R & D ( τ ) R & D t − 1 − β N R ( τ ) N R t − 1 ) + ∑ i = 1 n − 1 λ i τ Δ P t − i + ∑ i = 0 m − 1 λ i τ Δ L I t − i + ∑ i = 0 k λ i τ Δ G D P t − i + ∑ i = 0 k λ i τ Δ R & D t − i + ∑ i = 0 k λ i τ Δ N R t − i + φ t τ ( 7 ) Q Δ E N V t = θ τ + γ τ P t − 1 − β L I τ L I t − 1 − β G D P τ G D P t − 1 + ∑ i = 1 n − 1 λ i τ Δ P t − i + ∑ i = 0 m − 1 λ i τ Δ L I t − i + ∑ i = 0 k λ i τ Δ G D P t − i + φ t τ ( 8 ) Whereas short-term cumulative effects of historical and present P, LI, R&D, NR, and ENV levels are calculated by: γ = ∑ i − 1 n − 1 κ γ j ν * = ∑ i − 1 g − 1 α κ j , θ * = ∑ i − 1 d − 1 α θ j , ϖ * = ∑ i − 1 k − 1 α ϖ j ( 9 ) To determine the long-term parameter for P, LI, R&D, NR, and ENV, we use the formula: δ P * = − δ P ρ , δ L I * = − δ L I ρ , δ G D P * = − δ G D P ρ , δ R & D * = − δ R & D ρ , δ N R * = − δ N R ρ , δ E N V * = − δ E N V ρ ( 10 ) ECM’s coefficient (p) is expected to have a significant negative value. The first step is to perform a unit root test in the estimation. However, no strict same odder integration is required, just like the Johansen test requires. The unit root test is applied to check the order of integration of the variables in the system. The unit root is essential for the reliability of long-term forecasting. It should be noted that the prediction may not be applicable and reliable when the series is unstable or when there are random shocks within the data. ADF method is used to test stationary properties of the data. Δ AF t = ν 0 + κ AF t − 1 + ∑ i = 1 σ φ i Δ AF t − 1 + μ t ( 11 ) Δ AF t = ν 0 + T + κ AF t − 1 + ∑ i = 1 σ φ i Δ AF t − 1 + μ t ( 12 ) Equations (7) and (8) suggest the ADF unit root estimation of series based on intercept and trend in all series. Additionally, Lee Strazicich is more efficient for detecting a break in the data than Zivot Andrews (ZA). ZA test measures the discontinuity in the dataset at trend or intercept, but Lee Strazicich tests the data break exogenously by applying the trend and intercept simultaneously. Mathematically Lee Strazicich expressed as. y t = β 0 + β 1 t + β 2 a 1 t + β 3 a 2 t + β 4 a 3 t + β 5 a 4 t + φ y t − 1 + ∑ j = 1 n d j Δ y t − j + ε t ( 13 ) However, to measure the overall significance of included variables in the model we used the Wald test, which provides joint significance. The significance of the Wald test implies that explanatory variables jointly determine the dependent variables. The test is applicable to multiple models, including those with binary variables. W L t = ν ⌢ − ν 0 2 1 \/ I n ν ⌢ = I n ν ⌢ ν ⌢ − ν 0 2 ( 14 ) In addition, series data may face autocorrelation problems, indicating the two-time series are correlated. ACR t = ϕ 1 + ∑ k = 2 p ν j ACR jt + α t α t = β 1 + ∑ k = 2 p β j R jt + π α t − 1 ( 15 ) Testing linearity is also important; the study test assumes that non-linear combinations of explanatory variables respond to dependent variables. The model uses a polynomial or another non-linear functional form to the linearity of the model. x = α z + γ 1 x ⌢ 2 + ⋯ + γ k − 1 x ⌢ k + ε ( 16 ) 5 Results and discussion This section provides results and discussion; the first part of estimations is descriptive statistics. The estimations mainly discuss the overall trend, deviation in data, and symmetrical properties such as skewness and kurtosis. Table 1 provides descriptive statistics. TABLE 1 TABLE 1. Descriptive analysis. The descriptive statistics suggested following the standard value, implying that included variables are in the acceptable range. The symmetrical pattern suggests that its value lies in standard value. JB statistics also suggest that the model is consistent with the data. The Augmented Dickey-Fuller (ADF) test is used to check stationarity in data. The stationarity status of a variable assumes that the variable should have mean and constant over time. For the non-stationary series, mean and variance do not remain constant. The outcomes of ADF are reported in Table 2. TABLE 2 TABLE 2. ADF estimation. The information in Table 2 elaborates that at a 1% significance level, LI is stationary level. Although all the factors have zero mean and constant variance at the first difference, indicating that the statistical characteristics of the data do not change with time. The ADF results suggest that all variables are non-stationary at level and become stationary at first difference. Additionally, another test known as the Lee-Strazicich test (LS) is used to verify the stationary properties of the data further. The LS is used for stationarity testing if the data has structural breaks. The LS results are reported in Table 3. TABLE 3 TABLE 3. LS estimation. Table 3 presents that innovation, environment, literacy rate, number of researchers, and gross domestic product, have a break in their continuity. The Autoregressive Distributed Lag (ARDL) bounds test determines the long-run and short-run relationship between variables. This method determines whether one variable has a statistically significant effect on another variable (the dependent variable) over time. The results are reported in Table 4. TABLE 4 TABLE 4. Estimations of model 1 and model 2. Table 4 shows Model 1 and 2 bound tests which test the hypothesis of the long run; cointegration estimates the long-run relationship between the variables, and the bound test results indicate the existence of a long-run relationship. This indicates that innovations, CO 2 emissions, and literacy rate has a long-run association. If cointegration exists in the model, it implies that all variables move together over time. However, there might possibility of short run deviation from the long run equilibrium, which ECM can measure. The information in Table 5 reveals that LI, GDP, R&D, and NR influence innovation in the long run. The estimation discloses that in the 1st quantile, LI, GDP, R&D, and NR are significant and positively affecting innovation. In 2nd, 3rd and 4th quantile, LI, and GDP also have a positive association with innovation. These results imply that in the long run LI, GDP, R&D, and NR determine innovation in China. In addition, the short-run findings report that only literacy rate has a positive effect on innovations in 3rd quantile; similarly, R&D spending affected innovations only in 3rd quantile. This indicates that short-run estimations innovations need a large period. TABLE 5 TABLE 5. Q-ARDL for model 1. Table 6 contains results for Model 2, which indicates that in the long run, literacy has a positive and significant effect on environmental pollution. While in the short run, GDP can have a positive and significant effect on environmental pollution in 4th quantile. At the same time, the literacy rate has no effect on environmental pollution in the short run. These results imply that with the literacy rate increase in the long run, people attain higher living standards and increase their income level, raising energy consumption and environmental pollution. However, in the short run, the literacy rate does not affect the living standard and energy consumption; thus, literacy does not affect environmental pollution. Innovation is often seen as a critical driver of economic growth and competitiveness, allowing businesses and societies to continuously improve and adapt to changing circumstances. It is also essential in addressing global challenges such as climate change, health epidemics, and food and water security. Our results suggest a long-run association between innovations and environmental pollution in China. This implies a strong association between literacy and innovation. Highly literate societies tend to be more innovative, which enables individuals to access new information and knowledge. It also helps people to communicate their ideas effectively and collaborate with others, which leads to successful innovation. The positive association between literacy rate and innovation is supported by other studies (Cheung et al., 2021; Guzmán-Simón et al., 2020; Swain & Cara, 2019; Lau & Richards, 2021; Højen et al., 2021; Liu et al., 2021; Tian et al., 2020; García-Pérez-de-Lema et al., 2021; Fitriasari et al., 2021). Literate societies consider to be aware of environmental issues and more aware of understanding and addressing them. In addition, literate individuals tend to make more sustainable choices regarding consumption and disposal habits. In addition, literacy can assist people in understanding the science behind environmental problems and finding solutions. TABLE 6 TABLE 6. Q-ARDL estimations for model 2. The expenditure on R&D, however, is often viewed as a key element of innovation. Research and development projects involve creating new ideas and transforming them into innovative products, processes, or services. R&D contributes to the development of new technologies, improving existing products, and creating new businesses. R&D investments lead to innovative products and services, which enable organizations to gain a competitive advantage in the market. The findings are supported by other studies (Babelytė-Labanauskė & Nedzinskas, 2017; Hammar & Belarbi, 2021; Vrontis & Christofi, 2021; Heij et al., 2020). Innovation can also solve environmental problems; For example, developing new technologies, such as renewable energy sources or more efficient methods of production, can help reduce production’s impact on the environment. Innovation finds new ways to utilize resources sustainably and reduces the negative effect of the environment on societies. 6 Conclusion China has made significant progress in increasing literacy rates in recent decades. Similarly, a significant achievement has been made in R&D and innovations. World Intellectual Property Organization reported that in 2019 China devoted about 2.18% of its GDP to R&D spending, which is the highest among all middle-income countries. Trade openness and sustained economic expansion over the last few decades resulted in a high level of environmental pollution. Therefore, this study analyzes the relationship between literacy rate and innovation and environmental pollution from 1985 to 2021. We applied Quantile ARDL method for data analysis and used two models; the first model takes innovations as the dependent variable, while literacy rate, GDP, R&D spending, and the number of researchers (NR) are taken as independent variables. While in the second model, we took environmental pollution (CO2) as the dependent variable, and literacy rate, GDP, and population as independent variables. Our study’s outcomes suggest a long-run relationship between innovations, literacy rate, and environmental pollution. However, the literacy rate does not affect environmental pollution in the short run. These findings have some useful policy implications; firstly, the literacy rate is essential in establishing innovations in China. Therefore, the government should make an effort to increase the literacy rate, especially in rural areas. Secondly, innovations have a positive and significant effect on environmental pollution, indicating that innovations are mostly taken to produce CO 2 emissions-related products. Therefore, the government should focus on innovations, renewable energy sources, and sustainable products which reduce the country’s environmental pollution. Since the literacy rate does not affect environmental pollution in the short run, the government must add environment awareness-related content to the syllabus in the education system, especially at the primary and secondary education levels. The study has some limitations; this study focuses on a single country case, and future studies may use many countries and compare the region-wise relationship between literacy rate and innovation and environmental pollution. Future studies may use other advance methodologies for the data analysis and compare the results with past studies’ findings. Data availability statement The original contributions presented in the study are included in the article\/supplementary material, further inquiries can be directed to the corresponding authors. Author contributions All authors listed have made a substantial, direct, and intellectual contribution to the work and approved it for publication. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References Arayama, Y., and Miyoshi, K. (2004). Regional diversity and sources of economic growth in China. World Econ. 27 (10), 1583–1607. doi:10.1111\/j.1467-9701.2004.00668.x CrossRef Full Text | Google Scholar Chi, W., and Qian, X. (2010). The role of education in regional innovation activities: Spatial evidence from China. J. Asia Pac. Econ. 15 (4), 396–419. doi:10.1080\/13547860.2010.516158 CrossRef Full Text | Google Scholar Chi, W. (2008). The role of human capital in China’s economic development: Review and new evidence. China Econ. Rev. 19 (3), 421–436. doi:10.1016\/J.CHIECO.2007.12.001 CrossRef Full Text | Google Scholar Coman Nuţă, A. C., Lupu, D., and Nuţă, F. M. (2022). The impact of public education spending on economic growth in Central and Eastern Europe. An ARDL approach with structural break. Econ. Research-Ekonomska Istraživanja 36 (1), 1261–1278. doi:10.1080\/1331677X.2022.2086147 CrossRef Full Text | Google Scholar De Vries, H., Bekkers, V., and Tummers, L. (2016). Innovation in the public sector: A systematic review and future research agenda. Public Adm. 94 (1), 146–166. doi:10.1111\/padm.12209 CrossRef Full Text | Google Scholar Ding, S., and Knight, J. (2011). Why has China grown so fast? The role of physical and human capital formation. Oxf. Bull. Econ. Statistics 73 (2), 141–174. doi:10.1111\/j.1468-0084.2010.00625.x CrossRef Full Text | Google Scholar Environmental Law (2022). Environmental Law: 2 Years on - China water risk. Available at: https:\/\/www.chinawaterrisk.org\/opinions\/environmental-law-2-years-on\/(Accessed December 14, 2022). Google Scholar Grimpe, C., and Sofka, W. (2009). Search patterns and absorptive capacity: Low- and high-technology sectors in European countries. Res. Policy 38 (3), 495–506. doi:10.1016\/J.RESPOL.2008.10.006 CrossRef Full Text | Google Scholar Hudson, S. J. (2001). Challenges for environmental education: Issues and ideas for the 21st century. BioScience 51 (4), 283–288. doi:10.1641\/0006-3568(2001)051[0283:CFEEIA]2.0.CO;2 CrossRef Full Text | Google Scholar Ibrahim, M., and Vo, X. V. (2021). Exploring the relationships among innovation, financial sector development and environmental pollution in selected industrialized countries. J. Environ. Manag. 284, 112057. doi:10.1016\/j.jenvman.2021.112057 CrossRef Full Text | Google Scholar Khan, M. I., and Chang, Y. C. (2018). Environmental challenges and current practices in China-A thorough analysis. Sustain. Switz. 10 (7), 2547. doi:10.3390\/su10072547 CrossRef Full Text | Google Scholar Kiili, C., Mäkinen, M., and Coiro, J. (2013). Rethinking academic literacies designing multiface ted academic literacy experiences for preservice teachers. J. Adolesc. Adult Lit. 57 (3), 223–232. doi:10.1002\/JAAL.223 CrossRef Full Text | Google Scholar Li, D. (2022). A review of academic literacy research development: From 2002 to 2019. Asian-Pacific J. Second Foreign Lang. Educ. 7 (1), 5. doi:10.1186\/s40862-022-00130-z CrossRef Full Text | Google Scholar Liddle, J. (2013). Innovation in the public sector: Linking capacity and leadership - edited by victor bekkers, jurian edelenbos and bram steijn. Public Adm. 91 (2), 511–513. doi:10.1111\/padm.12009 CrossRef Full Text | Google Scholar Liu, J., Nathaniel, S. P., Chupradit, S., Hussain, A., Köksal, C., and Aziz, N. (2022). Environmental performance and international trade in China: The role of renewable energy and eco-innovation. Integr. Environ. Assess. Manag. 18 (3), 813–823. doi:10.1002\/ieam.4530 PubMed Abstract | CrossRef Full Text | Google Scholar Mughal, N., Arif, A., Jain, V., Chupradit, S., Shabbir, M. S., Ramos-Meza, C. S., et al. (2022). The role of technological innovation in environmental pollution, energy consumption and sustainable economic growth: Evidence from South Asian economies. Energy Strategy Rev. 39, 100745. doi:10.1016\/j.esr.2021.100745 CrossRef Full Text | Google Scholar Pan, X., Gao, Y., Guo, D., and Cheng, W. (2020). Does higher education promote firm innovation in China? Sustain. Switz. 12 (18), 7326. doi:10.3390\/SU12187326 CrossRef Full Text | Google Scholar Peng SJ, B. Q. (2006). Economic growth and environmental pollution: An empirical test for the environmental Kuznets curve hypothesis in China | Request PDF. Res. Financial Econ. Issues 8 (273), 3–17. Available at: https:\/\/www.researchgate.net\/publication\/285319834_Economic_growth_and_environmental_pollution_An_empirical_test_for_the_environmental_Kuznets_curve_hypothesis_in_China. Google Scholar Shanahan, T., and Shanahan, C. (2008). Teaching disciplinary Literacy to adolescents: Rethinking content- area Literacy. Harv. Educ. Rev. 78 (1), 40–59. doi:10.17763\/haer.78.1.v62444321p602101 CrossRef Full Text | Google Scholar Stites, R., and Semali, L. (1991). Adult literacy for social equality or economic growth? Changing agendas for mass literacy in China and Tanzania. Comp. Educ. Rev. 35 (1), 44–75. Available at: https:\/\/www.jstor.org\/stable\/1188015. Google Scholar Treiman, D. J. (2007). Growth and determinants of literacy in China. Education and reform in China, 135–153. Google Scholar Tursun, H., Li, Z., Liu, R., Li, Y., and Wang, X. (2015). Contribution weight of engineering technology on pollutant emission reduction based on IPAT and LMDI methods. Clean Technol. Environ. Policy 17 (1), 225–235. doi:10.1007\/s10098-014-0780-1 CrossRef Full Text | Google Scholar Wei, Y., Liu, X., Song, H., and Romilly, P. (2001). Endogenous innovation growth theory and regional income convergence in China. J. Int. Dev. 13 (2), 153–168. doi:10.1002\/jid.721 CrossRef Full Text | Google Scholar WIPO IP Statistics Data Center (2022). WIPO IP statistics data center. Available at: https:\/\/www3.wipo.int\/ipstats\/index.htm?tab=patent (Accessed December 14, 2022). Google Scholar Xin, D., Zhang, Z. S., and Sun, J. (2022). How technological innovation influences environmental pollution: Evidence from China. Complexity 2022, 1–9. doi:10.1155\/2022\/5535310 CrossRef Full Text | Google Scholar Yang, Y., Cai, W., and Wang, C. (2014). Industrial CO2 intensity, indigenous innovation and R&D spillovers in China’s provinces. Appl. Energy 131, 117–127. doi:10.1016\/J.APENERGY.2014.06.033 CrossRef Full Text | Google Scholar Zeraibi, A., Ahmed, Z., Shehzad, K., Murshed, M., Nathaniel, S. P., and Mahmood, H. (2022). Revisiting the EKC hypothesis by assessing the complementarities between fiscal, monetary, and environmental development policies in China. Environ. Sci. Pollut. Res. 29, 23545–23560. doi:10.1007\/s11356-021-17288-7 PubMed Abstract | CrossRef Full Text | Google Scholar","filter_flag":1}
