{"title":"Japan's top manufacturer of selective soldering equipment - The Worldfolio","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LnRoZXdvcmxkZm9saW8uY29tL2ludGVydmlld3MvamFwYW5zLXRvcC1tYW51ZmFjdHVyZXItb2Ytc2VsZWN0aXZlLXNvbGRlcmluZy1lcXVpcG1lbnQvNTk0Mi_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LnRoZXdvcmxkZm9saW8uY29tL2ludGVydmlld3MvamFwYW5zLXRvcC1tYW51ZmFjdHVyZXItb2Ytc2VsZWN0aXZlLXNvbGRlcmluZy1lcXVpcG1lbnQvNTk0Mi_SAQA?oc=5","id":"CBMiZ2h0dHBzOi8vd3d3LnRoZXdvcmxkZm9saW8uY29tL2ludGVydmlld3MvamFwYW5zLXRvcC1tYW51ZmFjdHVyZXItb2Ytc2VsZWN0aXZlLXNvbGRlcmluZy1lcXVpcG1lbnQvNTk0Mi_SAQA","guidislink":false,"published":"Tue, 07 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=311, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LnRoZXdvcmxkZm9saW8uY29tL2ludGVydmlld3MvamFwYW5zLXRvcC1tYW51ZmFjdHVyZXItb2Ytc2VsZWN0aXZlLXNvbGRlcmluZy1lcXVpcG1lbnQvNTk0Mi_SAQA?oc=5\" target=\"_blank\">Japan's top manufacturer of selective soldering equipment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Worldfolio<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Japan's top manufacturer of selective soldering equipment - The Worldfolio","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LnRoZXdvcmxkZm9saW8uY29tL2ludGVydmlld3MvamFwYW5zLXRvcC1tYW51ZmFjdHVyZXItb2Ytc2VsZWN0aXZlLXNvbGRlcmluZy1lcXVpcG1lbnQvNTk0Mi_SAQA?oc=5\" target=\"_blank\">Japan's top manufacturer of selective soldering equipment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Worldfolio<\/font>","source.href":"https:\/\/www.theworldfolio.com","source.title":"The Worldfolio","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Consumption Reduction\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Do you agree with our premise that right now is an exciting time for Japan's manufacturing sector? Why or why not? I agree with that view. In order to shorten the distance between us and our customers, our product development department is based in Kawagoe City, Saitama Prefecture, which is in charge of eastern Japan, and Nagoya City, Aichi Prefecture, which is in charge of western Japan, where we can develop products in line with various customer requirements with speed. In manufacturing, we have introduced the concept of local production for local consumption at four sites in Japan so that we can deliver products to customers' factories as quickly as possible, and we are developing our activities on a daily basis with an optimised supply chain that also reduces logistics costs. According to a study by the Ministry of Economy, Trade and Industry (METI), by 2030 the proportion of the working-age population aged 15-65 will be less than 60%, and the proportion of the elderly population will continue to increase, resulting in a labour shortage of approximately 6.5 million people in relation to labour demand. The decline in the working population could slow down Japan's economic activity, leading to a decline in economic growth and GDP (gross domestic product). Companies that cannot expect to replenish their workforce will lose dynamism and are more likely to be unable to implement drastic measures. If economic strength declines, competitiveness in international markets may also fall and Japan's presence in the international community may diminish. In order to meet these challenges, we are convinced that the use of advanced tools through digital innovation will become more important, and that we can realise more robust productivity improvements by digitising the 'shop floor', which has long been regarded as one of Japan's strengths, and making capital investments in both hardware and software. We contribute to society as a group of specialists in manufacturing, from the development of soldering equipment through to manufacturing, sales and after-sales service. Could you expound upon the ramifications that the aging population and the waning enthusiasm of the younger generation for manufacturing have imposed on your sales and production operations? As mentioned above, the shortage of labour due to the ongoing decline in the population is a challenge we take very seriously. Efforts to recruit talented people are becoming increasingly complex. I do not believe that the younger generation has lost its enthusiasm for manufacturing (monozukuri). It is no exaggeration to say that post-war Japan was a history of manufacturing. Our predecessors made it a habit to work day and night to achieve their goals and objectives, without giving up and without giving up until the end, regardless of the effort and effort required. In an environment where curiosity and hard work are rewarded, it is customary for the Japanese to proceed vigorously towards one thing, without regard to surroundings or circumstances - the so-called inrush temperament. I consider it my duty to guide, steer and instil this temperament and spirit in the young generation in the shortest possible path. We have cultivated a strategic cooperative relationship with our group company Fukoku Tokai Ltd (HQ: Nagoya, Aichi). Fukoku Tokai Ltd. has 300-400 professionals in the EMS business as one of its main businesses, and this strategic partnership with multi-skilled personnel is a human resources strategy that further strengthens our human resources capability. Another group company is Dynatron Ltd, a specialist in software development. The smartphones and personal computers that we use every day, as well as more familiar home appliances, are becoming more and more convenient as software evolves and adapts to our daily lives. Dynatron's core business is the development, sales and after-sales service of manufacturing software for printed circuit boards, which are the heart of these products and are incorporated into them. Dynatron Corporation, Fukoku Tokai Co., Ltd. and the Company are working together to develop the trinity of activities and generate synergy effects. In addition, in order to maximise the advantages of group companies, we have established a comprehensive employee exchange programme, which ensures seamless business cooperation through exchanges between older and younger employees, and has created an environment in which each company can bring its own areas of expertise to the group, making it easier for the group as a whole to produce results. We are proud to be Japan's top manufacturer of selective soldering equipment, which is the de facto product in the industry. We will continue to utilise the combined strengths of our group companies, and our product development capabilities and manufacturing superiority will further strengthen our competitiveness. I am determined to become the world's leading manufacturer of soldering equipment. I am determined to be the world's leading manufacturer of soldering equipment. This passion brings together like-minded colleagues, and all of us will work together to become the world's leading manufacturer of soldering equipment. (Selective soldering equipment is equipment that automatically solders the required amount of solder on the PCB where it is needed.) Amidst the intriguing context of population and recruitment challenges, an interesting silver lining has emerged: numerous SMEs have turned their gaze abroad to compensate for Japan's lack of labor and domestic sales. Given your extensive track record of establishing Sales & Service network and forging partnerships across over 10 diverse global markets, coupled with your international perspective, what would you say have been the key takeaways or lessons you've learned about doing business overseas? Where will you go from here? The current sales composition is 70% domestic and 30% overseas. Other equipment manufacturers, on the other hand, are the opposite, with a high proportion of overseas sales. Major equipment manufacturers in particular have a significantly low domestic sales ratio and a high overseas sales ratio. This fact suggests that there remains significant untapped potential in overseas markets. Our medium- to long-term plan for our overseas sales expansion strategy is to systematically establish an overseas sales expansion network, starting with the Asian region. We already have sales and service bases in the Shanghai and Shenzhen regions of China through Group companies. We have established sales networks in South Korea, Taiwan, Singapore, Malaysia and other regions. As a direct operation, an office was opened in Bangkok, Thailand, in October last year to start sales promotion and after-sales service operations. Furthermore, the expansion strategy includes an imminent plan to establish a presence in India. At the same time, the company is also looking into the possibility of entering the North American and European markets, where it is currently thin on the ground, in cooperation with specialised trading companies. The aim is to increase total sales by 1.7 times in the coming year 2025, driven primarily by international markets. Production will be concentrated in Japan and products will be exported abroad. An article in the Nihon Keizai Shimbun revealed that each of the industry's major equipment manufacturers will invest more than JPY 10 billion each to double their production capacity. Such domestic investment coincides with the anticipated sustained depreciation of the yen and will strengthen the competitiveness of the Japanese manufacturing industry in the face of price competition. Furthermore, Japan's deep-rooted tradition of uncompromising monozukuri further highlights the advantages of domestic production for Japanese companies. As part of what we have learnt from companies that have expanded their business overseas, we have heard that workers in overseas factories are placed on site immediately after being hired and are not able to receive sufficient training as in Japan. To cope with this, it is essential to provide easy-to-understand and easy-to-use hardware and software. Dynatron Corporation, a group of software development specialists, is a member of the Dynatron group of companies, so our product range can be supplied in both hardware and software fields. Of course, languages are also available in English. Labour shortages are not just a problem in Japan. All developed countries are facing the same problem. China will soon become a society with a declining population. AI and smart factories are essential to overcome this. We feel that software is becoming increasingly important in manufacturing. From a design point of view, how are you modifying your product design to meet the requests for lead-free soldering alternatives or carbon-neutral-friendly equipment? While our competitors' equipment is geared towards large-scale standardised production, we differentiate ourselves with our unique approach. Our selective soldering machines enable the optimum amount of solder to be applied to the required part in the optimum amount of time. They are also equipped with a system that automatically calculates the takt time of the equipment and allocates the soldering points between the equipment, thereby improving the equipment utilisation rate and enabling the effective use of energy resources. We are also working on the development of a revolutionary next-generation selective soldering machine that focuses on reducing power consumption during operation. This next-generation selective soldering equipment is currently in line with the global trend towards reducing environmental impact and the social demands of the SDGs, and is expected to make a significant contribution to local communities. | | | | Previous Next What is the projected release timeline for this product? Additionally, could you provide insights into the anticipated extent of energy consumption reduction that your clients might expect to achieve through its implementation? Our goal is to significantly reduce energy consumption by 30%. The innovative system we are planning to install differs significantly from the previous model. Whereas current systems, once activated, continue to operate continuously, the new systems are designed to activate only when their function is required. For example, a dynamic approach to timing, similar to the idling stop in a car, guarantees immediate readiness for use through rapid heating, resulting in a system that visibly reduces energy consumption. We are currently in the final stages of development and hope to present the system to you at next year's exhibition. Component miniaturization is a significant industry trend influencing PCB manufacturing and the electronics sector. The advent of smaller devices requires heightened precision in the production of constituent parts, thereby engendering a commensurate demand for soldering technologies of enhanced accuracy and specialized equipment capable of adeptly manipulating these diminutive components while upholding rigorous quality standards. How is this trend impacting your ongoing product development endeavors? Currently, the area of light, thin and small is dominated by the leading surface-mount manufacturers. It is important to make it clear that our business is not about entering this area. Our strategic direction is to dominate in the post-processing sector. Our customers include several automobile manufacturers, who are rapidly demanding new soldering requirements for large special components against the background of the paradigm shift to EVs. Against this background, we have decided to concentrate on the development of unique soldering equipment and processes. In particular, our selective soldering machines enable us to solve problems in areas where manual soldering is difficult due to the large volume of large components or narrow adjacent arrangements. This process proposition gives us a competitive advantage in certain segments. We are continuously seeking to develop products that best meet customer needs. With regard to EV quality control or inspection process, especially for a car, safety is the keyword. Solder joint inspection presents considerable challenges due to the inherent limitations of visual inspection in detecting latent defects. Various advanced techniques, such as X-ray analysis and AOI, are employed to examine hidden defects. Is your company actively engaging in these endeavors, or do they fall under the purview of a collaborative partner? Could you elaborate on the comprehensive quality control procedures you have in place to ascertain the safety and excellence of soldering processes? In order to maintain strict quality assurance standards, a thorough process is in place to check the long-term reliability of the equipment before the final introduction and installation of our equipment at the customer's plant. After the development of a new product is completed, the equipment is delivered to Fukoku Tokai Ltd, a group company, before it is put on the market, where the operating environment is artificially changed and multiple test items are carried out to repeatedly check the long-term reliability of the equipment and solder it. Fukoku Tokai has the advantage of high-quality manufacturing cultivated through automobile assembly, and has many evaluation facilities, analysis and analysis equipment, etc. within the plant. In this way, we judge equipment suitable for the quality required by the market at the equipment evaluation stage of new products. Furthermore, our commitment to precision extends to the quality inspection of individual solders. For this inspection, we utilise advanced non-destructive testing equipment, including X-ray technology sourced from reliable external sources. State-of-the-art inspection equipment is a crucial component of our quality assurance. Do you envision the prospect of expanding your group's reach beyond the confines of Japan's borders? Does your future global expansion involve the active pursuit of agents or distributors within the specific markets you are targeting, or perhaps the establishment of local sales offices? How will you grow the Koki Tec brand overseas? Our strategy is to first establish a local subsidiary in Thailand. Next, we will establish a sales office in India. In India, we have formed a partnership with a local subsidiary and aim to collaborate in sales and maintenance services. In Europe and the USA, we are promoting partnerships with local specialist trading companies. However, although specialised trading companies and distributors are familiar with our products, they do not deal exclusively in our products. We therefore need to establish a presence in each country, actively demonstrate our commitment to local distributors and partners and synergise our marketing efforts. Following our entry into the Indian market, our global sales expansion strategy is to establish sales offices directly in the respective regions in the future. Our goal is to become the number one soldering equipment manufacturer in the world. We will spare no effort or investment to achieve this. If you were on the last day of your presidency, is there a personal goal or ambition you are determined to fulfill by that point? We believe that our management strategy is most effective when it creates cooperative synergies between group companies (enterprises). Each company plays a vital and specialised role, and together they work in harmony to accelerate our activities as a global company with a competitive edge. Specifically, Dynatron is a pioneer in selective soldering equipment, with a line-up of products ranging from table-top to in-line soldering equipment in line with customer needs, and plays a role in supplying equipment to customers based on a consistent philosophy from elemental technology development to high-precision hardware. Dynatron Corporation has had the number one market share in PCB CAM software development for 30 years and is responsible for the programme development of Kohki Tec's soldering equipment. The company has started to develop differentiated software that automatically detects highly difficult soldering points from PCB design data and automatically reflects them in the operating programme. In the future, in order to further improve the utilisation rate of equipment, we will digitalise all information as part of our response to the smart factory concept, build a system for centralised data management, utilise AI to analyse and improve acquired data, propose quality and utilisation rate improvements through a short PDCA cycle, and create new customer value. The role of the company is to create new customer value. Fukoku Tokai Co., Ltd. also has important overall responsibilities, such as evaluating the long-term reliability of soldering equipment and proposing processes to customers from the perspective of high-quality manufacturing fostered through the assembly of automobile parts. This harmonisation of expertise in hardware, assembly and software is not just a perfunctory collaboration, but strategic management over the medium to long term. With the goal of gaining the top share of the global market for soldering equipment, we will accelerate our activities with an indefatigable and unyielding spirit. Interview conducted by Neale Oghigian & Paul Mannion","filter_flag":1}
