{"title":"New $150m fund targets net zero “disruption” start-ups across energy, transport, recycling","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf489b1464fbe75819f1fcb6fe9&url=https%3a%2f%2freneweconomy.com.au%2fnew-150m-fund-targets-net-zero-disruption-start-ups-across-energy-transport-recycling%2f&c=7491156152877727952&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf489b1464fbe75819f1fcb6fe9&url=https%3a%2f%2freneweconomy.com.au%2fnew-150m-fund-targets-net-zero-disruption-start-ups-across-energy-transport-recycling%2f&c=7491156152877727952&mkt=en-us","summary":"will hand-pick companies for up to $12 million in funding to develop prototypes or scale up to meet demand for new products. “This is a significant development that comes at the right time ...","published":"Tue, 04 Jun 2024 17:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=4, tm_hour=17, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=156, tm_isdst=0)","news_source":"RenewEconomy","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New $150m fund targets net zero “disruption” start-ups across energy, transport, recycling","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"will hand-pick companies for up to $12 million in funding to develop prototypes or scale up to meet demand for new products. “This is a significant development that comes at the right time ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Resource Efficiency\" \"new products\"&format=rss","text":"A rapidly growing specialist investment firm has launched a $150 million venture capital fund to support climate and nature start-ups across five emerging sectors. Pollination, founded five years ago by climate and environmental law expert Martijn Wilder, will hand-pick companies for up to $12 million in funding to develop prototypes or scale up to meet demand for new products. “This is a significant development that comes at the right time,” Mr Wilder, who’s also chair of the nation’s $15 billion National Reconstruction Fund Corporation, said on Wednesday. With an undisclosed cornerstone commitment from Queensland Investment Corporation, Pollination’s new fund will target energy, transport, food and agriculture, carbon and nature management, and the emerging circular economy of recycling and reuse. Pollination chief investment officer Diana Callebaut told AAP that those five areas had the most impact and potential in Australia. “We’re not as mature in our climate and nature investing as other jurisdictions which, again, provides a great opportunity for growth on a relative basis,” Ms Callebaut said. She said Australia was “very attractive” for early-stage investment and had an advantage in energy markets, carbon measurement and land regeneration, in particular. The fund expects to begin making investments in late 2024 and will take three to five years to allocate capital, with a heavier concentration in the early years and the prospect of reinvestment. “We’ll look at investing 60 per cent of the capital and then leave 40 per cent to be able to top up our best opportunities,” Ms Callebaut said. Pollination already has a stake in Australian climate technology firms and an East Kimberley partnership with a First Nations-led clean energy, green hydrogen and green ammonia export project. Carbon accountants FlintPro, seaweed farmer Sea Forest, sustainable foodies at Goterra, energy startup MGA Thermal and emissions platform Ruminati are on their books. QIC private equity investment director Lottie Tant said the new fund would support local innovators working on the global challenges of climate change and nature preservation. “Pollination’s global footprint and deep climate expertise provides a specialist value-add to Queensland startups,” Ms Tant said. She said the scale-up capital would go to proven and innovative climate technologies, with the landmark fund to help close a funding gap experienced by early-stage companies. The first Pollination-only fund, separate from a $US1 billion joint venture with HSBC, will be open to wholesale and institutional investors. Source: AAP The first Pollination-only fund, separate from a $US1 billion joint venture with HSBC, will be open to wholesale and institutional investors.","filter_flag":1}
{"title":"Global Solar Panel Recycling Market Analysis 2024-2034, Featuring First Solar, Sharp, Trina Solar, We Recycle Solar, Reiling and Yingli Energy Co.","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf489b1464fbe75819f1fcb6fe9&url=https%3a%2f%2ffinance.yahoo.com%2fnews%2fglobal-solar-panel-recycling-market-081100206.html&c=14639896138752279665&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf489b1464fbe75819f1fcb6fe9&url=https%3a%2f%2ffinance.yahoo.com%2fnews%2fglobal-solar-panel-recycling-market-081100206.html&c=14639896138752279665&mkt=en-us","summary":"By embracing recycling as an integral part of the solar energy lifecycle, stakeholders can promote sustainability, resource efficiency, and circular economy principles. Key Market Players and ...","published":"Thu, 06 Jun 2024 18:11:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=6, tm_hour=18, tm_min=11, tm_sec=0, tm_wday=3, tm_yday=158, tm_isdst=0)","news_source":"Yahoo Finance","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Global Solar Panel Recycling Market Analysis 2024-2034, Featuring First Solar, Sharp, Trina Solar, We Recycle Solar, Reiling and Yingli Energy Co.","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"By embracing recycling as an integral part of the solar energy lifecycle, stakeholders can promote sustainability, resource efficiency, and circular economy principles. Key Market Players and ...","news_image":"http:\/\/www.bing.com\/th?id=OVFT.gUnaOmLESH_hCmm3506jtC&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":600.0,"news_imagemaxheight":400.0,"query":"https:\/\/www.bing.com\/news\/search?q=\"Resource Efficiency\" \"new products\"&format=rss","text":"Company Logo Global Solar Panel Recycling Market Global Solar Panel Recycling Market Dublin, June 07, 2024 (GLOBE NEWSWIRE) -- The \"Solar Panel Recycling Market - A Global and Regional Analysis: Focus on Type, Process, Material, Shelf life and Region - Analysis and Forecast, 2024-2034\" report has been added to ResearchAndMarkets.com's offering. The solar panel recycling market has emerged as a crucial component of the renewable energy ecosystem, driven by the rapid proliferation of solar energy installations worldwide. With solar power playing an increasingly significant role in the global energy transition, the management of end-of-life solar panels has become a pressing concern. This introduction will explore the dynamics of the solar panel recycling market, highlighting its importance, current trends, challenges, and future opportunities. In an optimistic forecast, the market, valued at $404.3 million in 2024, is anticipated to grow at a CAGR of 16.50%, reaching $1.86 billion by 2034. In recent years, solar energy has experienced exponential growth, fueled by declining costs, technological advancements, and increasing environmental awareness. According to the International Energy Agency (IEA), global solar photovoltaic (PV) capacity exceeded 700 gigawatts (GW) in 2021, with projections indicating continued expansion in the coming years. This surge in solar installations translates to a substantial influx of end-of-life solar panels that require proper disposal or recycling. Governments around the world are implementing policies and regulations to promote renewable energy deployment and address waste management challenges. Many jurisdictions have introduced Extended Producer Responsibility (EPR) schemes or product stewardship programs that mandate producers to take responsibility for the disposal and recycling of their products, including solar panels. Additionally, some regions have established targets for the recycling or reuse of solar panel components, driving market growth and innovation in recycling technologies. In conclusion, the solar panel recycling market is poised for significant growth and transformation as the adoption of solar energy continues to soar. While challenges such as lack of standardized recycling processes and regulatory inconsistencies persist, technological innovations and policy interventions are driving progress in the industry. By embracing recycling as an integral part of the solar energy lifecycle, stakeholders can promote sustainability, resource efficiency, and circular economy principles. Key Market Players and Competition Synopsis The companies that are profiled have been selected based on inputs gathered from primary experts and analysing company coverage, product portfolio, and market penetration. Some of the prominent companies in this market are: First Solar, Inc. Sharp Corporation Trina Solar We Recycle Solar Reiling GmbH & Co. KG Yingli Energy Co. Ltd Story continues Key Questions Answered in this Report: What are the main factors driving the demand for solar panel recycling market? What are the major patents filed by the companies active in the solar panel recycling market? Who are the key players in the solar panel recycling market, and what are their respective market shares? What partnerships or collaborations are prominent among stakeholders in the solar panel recycling market? What are the strategies adopted by the key companies to gain a competitive edge in solar panel recycling market? What is the futuristic outlook for the solar panel recycling market in terms of growth potential? What is the current estimation of the solar panel recycling market and what growth trajectory is projected from 2024 to 2034? Which regions demonstrate the highest adoption rates for solar panel recycling market, and what factors contribute to their leadership? Key Attributes: Report Attribute Details No. of Pages 100 Forecast Period 2024 - 2034 Estimated Market Value (USD) in 2024 $404.3 Million Forecasted Market Value (USD) by 2034 $1862.2 Million Compound Annual Growth Rate 16.5% Regions Covered Global Key Topics Covered: 1. Markets: Industry Outlook 1.1 Trends: Current and Future Impact Assessment 1.2 Supply Chain Overview 1.3 R&D Review 1.4 Regulatory Landscape 1.5 Stakeholder Analysis 1.6 Impact Analysis for Key Global Events 1.7 Market Dynamics Overview 2. Solar Panel Recycling Market (by Product) 2.1 Product Segmentation 2.2 Product Summary 2.3 Solar Panel Recycling Market (by Type) 2.3.1 Monocrystalline 2.3.2 Polycrystalline 2.3.3 Thin Film 2.3.4 Others 2.4 Solar Panel Recycling Market (by Process) 2.4.1 Thermal 2.4.2 Chemical 2.4.3 Mechanical 2.4.4 Laser 2.4.5 Combination 2.4.6 Others 2.5 Solar Panel Recycling Market (by Material) 2.5.1 Silicon 2.5.2 Metal 2.5.3 Plastic 2.5.4 Glass 2.5.5 Others 2.6 Solar Panel Recycling Market (by Shelf life) 2.6.1 Early Loss 2.6.2 Normal Loss 3. Solar Panel Recycling Market (by Region) 4. Companies Profiled First Solar, Inc. Reiling GmbH & Co. KG The Retrofit Companies, Inc. Rinovasol Global Services B.V. ROSI We Recycle Solar Silicontel Ltd. Etavolt PTE. Ltd. PV Industries PTY Ltd. Solarcylcle, Inc. Canadian Solar Inc. Sharp Corporation JA Solar Co. Ltd Trina Solar Yingli Energy Co. Ltd For more information about this report visit https:\/\/www.researchandmarkets.com\/r\/1rr9j8 About ResearchAndMarkets.com ResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends. Attachment CONTACT: CONTACT: ResearchAndMarkets.com Laura Wood,Senior Press Manager press@researchandmarkets.com For E.S.T Office Hours Call 1-917-300-0470 For U.S.\/ CAN Toll Free Call 1-800-526-8630 For GMT Office Hours Call +353-1-416-8900 ","filter_flag":1}
{"title":"Information knowledge and innovation management","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf489b1464fbe75819f1fcb6fe9&url=https%3a%2f%2fwww.sheffield.ac.uk%2fis%2fresearch%2fgroups%2fikim&c=376970394206328111&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf489b1464fbe75819f1fcb6fe9&url=https%3a%2f%2fwww.sheffield.ac.uk%2fis%2fresearch%2fgroups%2fikim&c=376970394206328111&mkt=en-us","summary":"Their existence provides managers and organisations with the opportunity to conduct research about their end- users and to create new products and services ... productivity, resource-efficiency and ...","published":"Sun, 16 Apr 2017 06:54:00 GMT","published_parsed":"time.struct_time(tm_year=2017, tm_mon=4, tm_mday=16, tm_hour=6, tm_min=54, tm_sec=0, tm_wday=6, tm_yday=106, tm_isdst=0)","news_source":"University of Sheffield","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Information knowledge and innovation management","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Their existence provides managers and organisations with the opportunity to conduct research about their end- users and to create new products and services ... productivity, resource-efficiency and ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Resource Efficiency\" \"new products\"&format=rss","text":"The project aimed at investigating how organisational and network capital influence path renewal and path creation processes. It followed a qualitative case study approach, which allowed the investigation of industry rejuvenation manifestations in a natural setting. South Yorkshire and the North Region of Portugal were chosen as archetypical old industrial regions concentrating a variety of firms that have been successful in their adaptation by the innovative restructuring of their traditional manufacturing activities. Participants in the study comprised Managing Directors of firms belonging to the metal and engineering industry and the textile and footwear sectors, and actors of the regional innovation system – Higher Education Institutions, Research & Development centres, business incubators, local executive boards, chambers of commerce and industry. The qualitative, interview-based research design gave participants an opportunity to reflect at length on how industry in their respective regions has proved its resilience in the face of a context of global economic crisis. More specifically, participants held widely consensual views on the role played by regional embedded competences in the shaping of firms’ turn to innovation, productivity, resource-efficiency and high value-added to compete in global markets. Access to knowledge transfer centres that operate the integration of knowledge assets that are unique to the regions was also considered pivotal to the leveraging of high value-added goods and services, and to the effective management of value chains. The project findings contribute to an enhanced understanding of how organisational capital (manifested notably through working practices that support intra and inter-organisational knowledge flows) and regional network capital (manifested notably through engagement in collective learning with innovation actors, combined with the exploitation of geographical proximity opportunities to create and distribute knowledge) support the development of rejuvenation trajectories of firms embedded in old industrial regions. Watch the project video The project culminated in the organisation of the Industrial Renaissance Forum – a combined stakeholder engagement and results dissemination event held at the Information School. The Forum celebrated the industrial rejuvenation trajectories of two European old industrial regions: South Yorkshire and the North Region of Portugal. The experience and know how of key stakeholders - EU Committee of the Regions, UK and Portugal firms, enterprise partnerships, R&D centres, local government – was brought together in discussion, giving participants cross-cutting insight into practical projects, good practice, governance issues, and the dynamics of regional innovation. Project lead: Dr Jorge Martins Funder: Regional Studies Association","filter_flag":1}
{"title":"Global Soy-Based Chemicals Market to Reach USD 61591.8 million by 2034, Driven by Eco-Friendly Trends","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf489b1464fbe75819f1fcb6fe9&url=https%3a%2f%2fwww.fmiblog.com%2f2024%2f06%2f14%2fglobal-soy-based-chemicals-market-to-reach-usd-61591-8-million-by-2034-driven-by-eco-friendly-trends%2f&c=7488754991449433238&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf489b1464fbe75819f1fcb6fe9&url=https%3a%2f%2fwww.fmiblog.com%2f2024%2f06%2f14%2fglobal-soy-based-chemicals-market-to-reach-usd-61591-8-million-by-2034-driven-by-eco-friendly-trends%2f&c=7488754991449433238&mkt=en-us","summary":"The global soy-based chemicals market is projected to grow significantly, with sales estimated at USD 30,163.4 million in 2024, expected to reach USD 61,591.8 million by 2034. This growth, at a ...","published":"Fri, 14 Jun 2024 11:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=14, tm_hour=11, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=166, tm_isdst=0)","news_source":"Future Market Insights","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Global Soy-Based Chemicals Market to Reach USD 61591.8 million by 2034, Driven by Eco-Friendly Trends","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"The global soy-based chemicals market is projected to grow significantly, with sales estimated at USD 30,163.4 million in 2024, expected to reach USD 61,591.8 million by 2034. This growth, at a ...","news_image":"http:\/\/www.bing.com\/th?id=OVFT.qHNTtUU5lJPG0J6RNLX4AS&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":550.0,"news_imagemaxheight":350.0,"query":"https:\/\/www.bing.com\/news\/search?q=\"Resource Efficiency\" \"new products\"&format=rss","text":"The global soy-based chemicals market is projected to grow significantly, with sales estimated at USD 30,163.4 million in 2024, expected to reach USD 61,591.8 million by 2034. This growth, at a compound annual growth rate (CAGR) of 7.4%, underscores the increasing demand for sustainable and eco-friendly alternatives to traditional petrochemicals. Derived from soybeans, soy-based chemicals are finding widespread applications across industries such as cosmetics, food, agriculture, and textiles, thanks to their biodegradability and reduced environmental impact. The soy-based chemicals market is poised for robust growth, driven by sustainability imperatives, regulatory support, and technological advancements. As industries prioritize environmental responsibility and resource efficiency, soy-based chemicals offer a compelling solution for meeting both economic and environmental objectives. Elevate Your Business: Access Our Sample for Key Insights and Strategic Advantages: https:\/\/www.futuremarketinsights.com\/reports\/sample\/rep-gb-1361 Key Takeaways: Eco-Friendly Demand Surge: Rising consumer awareness and preference for environmentally sustainable products are major drivers of the soy-based chemicals market. Regulatory Support: Government policies and incentives favoring bio-based products are bolstering market growth. Broad Application Spectrum: Soy-based chemicals are increasingly used in cosmetics, food, agriculture, and textiles, with ongoing research expanding their application scope. Innovative Packaging Solutions: Advances in biotechnology and chemical engineering are enhancing the production efficiency and performance of soy-based chemicals. Price Volatility: Fluctuations in soybean prices pose a challenge to the cost competitiveness of soy-based chemicals. Regional Insights: United States: The U.S. market is experiencing a surge in demand for soy-based chemicals, driven by sustainability initiatives and consumer preferences for eco-friendly products. Government policies, such as the USDA’s BioPreferred Program, provide significant support through tax credits and grants, encouraging investment in soy-based alternatives. Collaboration among industry stakeholders is fostering innovation, while marketing campaigns are raising awareness of the benefits of soy-based chemicals, including their biodegradability and renewable sourcing. United Kingdom: The UK government is actively promoting bio-based industries, including soy-based chemicals, to achieve sustainability goals and reduce fossil fuel reliance. Policies providing subsidies, tax breaks, and research grants are fostering innovation and investment in bio-based technologies. Rising environmental awareness among consumers is driving demand for soy-based products in various industries, including cosmetics, food, packaging, and textiles, contributing to the market’s robust growth. China: Technological advancements in biotechnology, enzymatic conversion, and chemical engineering are enhancing the competitiveness of soy-based chemicals in China. The collaboration between industry players, research institutions, and government agencies is facilitating innovation and market expansion. Policies promoting market liberalization and trade agreements are opening new opportunities, enabling companies to access advanced technologies and global markets. With growing awareness of plastic pollution, soy-based bioplastics are gaining traction as sustainable packaging solutions. Revolutionize Your Approach: Purchase the Report for Strategic Growth Insights! https:\/\/www.futuremarketinsights.com\/checkout\/1361 Competition Outlook The global industry is fragmented, with leading manufacturers focusing on technology and product quality. Key companies are adopting marketing strategies like mergers and acquisitions, new products, and production capacity expansions. They are investing in research and development to expand product lines. Leading Soy-based Chemical Brands The Dow Chemical Company Cara Plastics Inc. Ag Environmental Products LLC Archer Daniels Midland Co. Cargill Inc. Elevance Renewable Sciences Inc. Renewable Lubricants Inc. Soy Technologies LLC BioBased Technologies LLC Soyaworld Inc. Vertec BioSolvents Inc. Key Segments of Market Report By Type: The industry is segmented into soy oil, fatty acids, polyols, soy waxes, methyl-soyate, isoflavones, and others. By End-user: Based on end-user, the sector is categorized into paper, cosmetics, food and beverages, plastics and polymer, bio-diesel, and others. By Region: Industry analysis has been carried out in key countries of North America, Latin America, Western Europe, Eastern Europe, South Asia and Pacific, East Asia, and the Middle East and Africa. About Future Market Insights (FMI) Future Market Insights, Inc. (ESOMAR certified, recipient of the Stevie Award, and a member of the Greater New York Chamber of Commerce) offers profound insights into the driving factors that are boosting demand in the market. FMI stands as the leading global provider of market intelligence, advisory services, consulting, and events for the Packaging, Food and Beverage, Consumer Technology, Healthcare, Industrial, and Chemicals markets. With a vast team of over 400 analysts worldwide, FMI provides global, regional, and local expertise on diverse domains and industry trends across more than 110 countries. Contact Us: Future Market Insights Inc. Christiana Corporate, 200 Continental Drive, Suite 401, Newark, Delaware – 19713, USA T: +1-845-579-5705 For Sales Enquiries: sales@futuremarketinsights.com Website: https:\/\/www.futuremarketinsights.com LinkedIn| Twitter| Blogs | YouTube","filter_flag":1}
{"title":"A sewage treatment plant as a source of raw materials","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf489b1464fbe75819f1fcb6fe9&url=https%3a%2f%2fidw-online.de%2fde%2fnews834996&c=9070858146588320074&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf489b1464fbe75819f1fcb6fe9&url=https%3a%2f%2fidw-online.de%2fde%2fnews834996&c=9070858146588320074&mkt=en-us","summary":"Home > Pressemitteilung: A sewage treatment plant as a source ...","published":"Mon, 10 Jun 2024 04:58:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=10, tm_hour=4, tm_min=58, tm_sec=0, tm_wday=0, tm_yday=162, tm_isdst=0)","news_source":"idw","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"A sewage treatment plant as a source of raw materials","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Home > Pressemitteilung: A sewage treatment plant as a source ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Resource Efficiency\" \"new products\"&format=rss","text":"Instanz: Teilen Teilen: A sewage treatment plant as a source of raw materials Lena Jauernig Stabsstelle Hochschulkommunikation Universität Stuttgart 10.06.2024 13:43 On June 6, 2024, Baden-Württemberg's Minister President Winfried Kretschmann visited the Büsnau Training and Research Sewage Treatment Plant. Researchers from the University of Stuttgart and the Karlsruhe Institute of Technology (KIT) used a pilot plant to demonstrate how sewage treatment plants can contribute to climate neutrality by recovering raw materials. \"The Teaching and Research Sewage Treatment Plant at the University of Stuttgart has an important objective: To extract valuable raw materials from wastewater and reintroduce them into the economic cycle. In this way, the organic carbon in the wastewater can be used sustainably. The research sewage treatment plant is also focused on reducing the high emissions of climate-damaging gases typically produced by conventional sewage treatment plants,\" said Minister President Winfried Kretschmann. \"But the innovation here is not just happening at a high level. The sewage treatment plant is also a training center for wastewater treatment plant personnel and supports companies in the development of plant technology. In this way, the sewage treatment plant facilitates the crucial transfer from science to practical application.\" Our wastewater not only contains dirt and excrement, but also valuable raw materials such as nitrogen and organic carbon compounds. With the help of chemical, biological and physical processes, these raw materials can be recovered from wastewater to make products such as fertilizer, hydrogen and bioplastics. The KoalAplan project (“Municipal wastewater as a source of ammonium nitrogen, hydrogen and bioplastics - the Büsnau biorefinery”) has been researching this process since 2021. Scientists from the DVGW Research Center at the Engler-Bunte Institute of the Karlsruhe Institute of Technology (KIT), the University of Stuttgart, the Fraunhofer Institute for Interfacial Engineering and Biotechnology (IGB), the Technical University of Hamburg, and the Clausthal University of Technology are working on the KoalAplan project together with the State Agency for Environmental Technology and Resource Efficiency in Baden-Württemberg (Umwelttechnik BW). The KoalAplan is funded by the Baden-Württemberg Ministry for the Environment, Climate Protection and the Energy Sector and the European Regional Development Fund (ERDF). It is part of the state strategy “Sustainable Bioeconomy for Baden-Württemberg”. At the Büsnau teaching and research sewage treatment plant at the University of Stuttgart, researchers are testing under real conditions how the recovery of raw materials in sewage treatment plants can be realized on an industrial scale. A biorefinery was set up as a pilot plant for this purpose, which has been operating successfully since 2023. During his visit on June 6, Baden-Württemberg's Minister President Winfried Kretschmann was briefed on the project's findings to date. Biorefinery Achieves Successful Continuous Operation Peter Maurer, Head of the Teaching and Research Sewage Plant at the University of Stuttgart, and Prof. Dr. Harald Horn, Coordinator of the KoalAplan project and Professor of Water and Water Technology at the Karlsruhe Institute of Technology (KIT), gave Minister President Winfried Kretschmann and a group of media representatives a tour of the biorefinery and explained the process used. Normally, carbon dioxide is produced from the organic carbon when it passes through a sewage treatment plant. “Our processes reduce the production of this climate-damaging gas. At the same time, we obtain raw materials that help to replace petroleum-based substances. With this two-pronged strategy, the sewage treatment plants of the future could make an important contribution to climate neutrality,” says Prof. Dr. Harald Horn. Traditional wastewater treatment processes are being expanded with new components The wastewater treatment concept applied by the project group consists of chemical, physical and biological process steps. As part of the preliminary treatment, mechanical cleaning takes place first. Coarse matter is removed, and it is here that a third of the organic carbon is separated. A further third of the carbon is then separated from the main wastewater flow with the aid of ultra-fine micro-sieves. “The microsieves are a key part of our concept. The carbon obtained following this process is so highly concentrated that it can be used in biotechnology,\" says Professor Horn. Subsequently, ammonium nitrogen is removed from the main wastewater stream using an ion exchanger. The result is a product that can be used as a fertilizer. The filtered solids and the primary sludge are first converted into organic acids by acid hydrolysis in the side-stream process, which also produces biohydrogen and CO2. The hydrolysate is filtered and converted to hydrogen using microbial electrolysis. Hydrogen has many applications in the chemical industry and is regarded as a future energy source. In a feasibility study, gas flows from microbial electrolysis and dark fermentation are utilized in a biotechnological process to produce valuable chemicals. Additionally, the carbon dioxide generated is re-fixed during this process. The organic carbon remaining in the process of the microbial electrolysis cell is then fermented to form a basic material for bioplastics. Finally, the main stream wastewater follows the conventional treatment path: Remaining nitrogen and carbon are broken down in several stages, and any accumulating sludge ends up in the secondary clarifier, where methane is extracted. \"Since last year, our biorefinery has demonstrated through continuous operation that the process chain is effective and could therefore also be implemented in other sewage treatment plants,” says Peter Maurer, head of the research sewage treatment plant. “We hope that we can use the pilot project to sensitize other companies to the potential of bioeconomic strategies. Our example shows that you can reduce the consumption of fossil raw materials and even save costs and market new products as a result.” The Teaching and Research Sewage Treatment Plant in Büsnau At the Büsnau Teaching and Research Sewage Treatment Plant, students, doctoral students and research groups have been researching and experimenting with innovative processes for wastewater treatment on a semi-industrial and industrial scale since 1965. The teaching and research sewage treatment plant is affiliated to the Institute for Sanitary Engineering, Water Quality and Solid Waste Management at the University of Stuttgart. It is not used exclusively for research, but also treats the wastewater of 8,500 inhabitants of a Stuttgart district. Part of the main flow of the municipal wastewater is fed through the project's KoalAplan pilot plant. Wissenschaftliche Ansprechpartner: Peter Maurer, Head of the Teaching and Research Sewage Treatment Plant at the University of Stuttgart, Tel.: +49 711 685-63724, peter.maurer@iswa.uni-stuttgart.de https:\/\/www.iswa.uni-stuttgart.de\/ Prof. Dr. Harald Horn, Professor of Water Chemistry and Water Technology at the Engler-Bunte Institute at KIT and Head of the Water Chemistry and Water Technology Department at the DVGW Research Unit at the Engler-Bunte Institute of the Karlsruhe Institute of Technology (KIT) https:\/\/www.ebi.kit.edu\/english\/index.php Weitere Informationen: https:\/\/www.beschaeftigte.uni-stuttgart.de\/en\/news\/A-sewage-treatment-plant-as-a... https:\/\/www.iswa.uni-stuttgart.de\/institute\/lfkw\/ Bilder < Exciting insights for Chancellor Anna Steiger, Professor Sara Kleindienst, Minister President Winfri ... Ludmilla Parsyak University of Stuttgart < Peter Maurer (right) presents Minister President Winfried Kretschmann the Büsnau teaching and resear ... Ludmilla Parsyak University of Stuttgart Merkmale dieser Pressemitteilung: Journalisten, Wissenschaftler Elektrotechnik, Energie, Umwelt \/ Ökologie überregional Buntes aus der Wissenschaft, Forschungsprojekte Englisch","filter_flag":1}
{"title":"Aspen Aerogels Announces Thermal Barrier Award from Valmet Automotive for Electric Porsche 718 Series and Reiterates 2024 Financial Outlook","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf489b1464fbe75819f1fcb6fe9&url=https%3a%2f%2ffinance.yahoo.com%2fnews%2faspen-aerogels-announces-thermal-barrier-120000509.html&c=17707494682719109997&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf489b1464fbe75819f1fcb6fe9&url=https%3a%2f%2ffinance.yahoo.com%2fnews%2faspen-aerogels-announces-thermal-barrier-120000509.html&c=17707494682719109997&mkt=en-us","summary":"Aspen Aerogels, Inc. (NYSE: ASPN) (\"Aspen\" or the \"Company\"), a technology leader in sustainability and electrification solutions, today announced a PyroThin® design award from Valmet Automotive to ...","published":"Thu, 13 Jun 2024 05:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=13, tm_hour=5, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=165, tm_isdst=0)","news_source":"YAHOO!Finance","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Aspen Aerogels Announces Thermal Barrier Award from Valmet Automotive for Electric Porsche 718 Series and Reiterates 2024 Financial Outlook","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Aspen Aerogels, Inc. (NYSE: ASPN) (\"Aspen\" or the \"Company\"), a technology leader in sustainability and electrification solutions, today announced a PyroThin® design award from Valmet Automotive to ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Resource Efficiency\" \"new products\"&format=rss","text":"Valmet Automotive design award for the Porsche 718 series is Aspen's sixth OEM award 2024 Financial Outlook remains unchanged NORTHBOROUGH, Mass., June 13, 2024 \/PRNewswire\/ -- Aspen Aerogels, Inc. (NYSE: ASPN) (\"Aspen\" or the \"Company\"), a technology leader in sustainability and electrification solutions, today announced a PyroThin® design award from Valmet Automotive to supply the next generation electric-only Porsche 718 series. Aspen Aerogels, Inc. Aspen is also reiterating its 2024 financial outlook. Valmet Automotive \/ Porsche EV Thermal Barrier Commercial Award Valmet Automotive is Porsche's manufacturing partner for the next generation electric 718 lineup The Porsche 718 platform covers the Cayman and Boxster models with an expected start of production in 2025 Porsche, through Valmet, joins Audi and Scania as announced PyroThin® awards linked to the Volkswagen Group Commenting on today's announcement, Aspen's President and CEO, Donald R. Young, \"We are excited to add Valmet Automotive and Porsche to our growing list of customers as they prepare to manufacture an all-electric 718 lineup.\" Mr. Young added, \"This award, and the depth of our quote and development pipeline with additional OEM customers, further validates PyroThin® as the go-to EV thermal barrier solution. We believe that we will add more awards to our roster during 2024 to drive further diversification in our PyroThin® customer base for 2025 and beyond.\" 2024 Financial Outlook Unchanged Aspen's 2024 full year outlook remains as follows: ($ in millions, except per share amounts) Metric 2024 Outlook Implied YoY % Improvement Revenue Thermal Barrier Energy Industrial >380 >230 >150 59% 109% 17% Adjusted EBITDA >55 340 % Net Income (Loss) >2 104 % Earnings Per Share >0.03 105 % Ricardo C. Rodriguez, Chief Financial Officer and Treasurer, commented, \"We developed a pragmatic performance baseline when planning for 2024 and while preparing the most recently communicated outlook increase as part of our Q1 results.\" Mr. Rodriguez added, \"Thinking more broadly and long-term, our profitable Energy Industrial segment, in combination with a broad set of blue-chip PyroThin® customers, positions us to continue supporting the long-term EV demand ramp with conviction. We look forward to discussing our Q2 results in detail at our next earnings call on August 1st, 2024.\" The Company's 2024 outlook assumes depreciation and amortization of $30 million, stock-based compensation expense of $14 million, other (income) expense and income tax expense of $9 million, and weighted average shares outstanding of 75.8 million for the full year. Story continues A reconciliation of net loss to non-GAAP Adjusted EBITDA for the 2024 financial outlook is provided in the financial schedules that are part of this press release. An explanation of this non-GAAP financial measure is also included below under the heading \"Non-GAAP Financial Measures.\" Non-GAAP Financial Measures In addition to providing financial measurements based on generally accepted accounting principles in the United States of America (\"GAAP\"), Aspen provides an additional financial metric that is not prepared in accordance with GAAP (\"non-GAAP\"). The non-GAAP financial measure included in this press release is Adjusted EBITDA. Management uses this non-GAAP financial measure, in addition to GAAP financial measures, as a measure of operating performance because the non-GAAP financial measure does not include the impact of items that management does not consider indicative of Aspen's core operating performance. In addition, management uses Adjusted EBITDA (i) for planning purposes, including the preparation of Aspen's annual operating budget, (ii) to allocate resources to enhance the financial performance of its business, and (iii) as a performance measure under its bonus plan. Management believes that this non-GAAP financial measure reflects Aspen's ongoing business in a manner that allows for meaningful comparisons and analysis of trends in its business, as it excludes expenses and gains not reflective of Aspen's ongoing operating results or that may be infrequent and\/or unusual in nature. Management also believes that this non-GAAP financial measures provides useful information to investors in understanding and evaluating Aspen's operating results and future prospects in the same manner as management and in comparing financial results across accounting periods and to those of peer companies. This non-GAAP measure may not be comparable to similarly titled measures presented by other companies. The non-GAAP financial measure does not replace the presentation of Aspen's GAAP financial results and should only be used as a supplement to, not as a substitute for, Aspen's financial results presented in accordance with GAAP. In this press release, Aspen has provided a reconciliation of Adjusted EBITDA to net loss, the most directly comparable GAAP financial measure. Management strongly encourages investors to review Aspen's financial statements and publicly filed reports in their entirety and not rely on any single financial measure. About Aspen Aerogels, Inc. Aspen is a technology leader in sustainability and electrification solutions. The Company's aerogel technology enables its customers and partners to achieve their own objectives around the global megatrends of resource efficiency, e-mobility, and clean energy. Aspen's PyroThin® products enable solutions to thermal runaway challenges within the EV market. Aspen Battery Materials, the Company's carbon aerogel initiative, seeks to increase the performance of lithium-ion battery cells to enable EV manufacturers to extend the driving range and reduce the cost of EVs. The Company's Cryogel® and Pyrogel® products are valued by the world's largest energy infrastructure companies. Aspen's strategy is to partner with world-class industry leaders to leverage its Aerogel Technology Platform® into additional high-value markets. Aspen is headquartered in Northborough, Mass. For more information, please visit www.aerogel.com. Special Note Regarding Forward-Looking and Cautionary Statements This press release and any related discussion contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995 that involve risks and uncertainties that could cause actual results to be materially different from historical results or from any future results expressed or implied by such forward-looking statements, including statements relating to the thermal barrier award from Valmet Automotive and Aspen's 2024 financial outlook. These statements are not historical facts but rather are based on Aspen's current expectations, estimates and projections regarding Aspen's business, operations and other factors relating thereto, including with respect to Aspen's 2024 financial outlook. Words such as \"may,\" \"will,\" \"could,\" \"would,\" \"should,\" \"anticipate,\" \"predict,\" \"potential,\" \"continue,\" \"expects,\" \"intends,\" \"plans,\" \"projects,\" \"believes,\" \"estimates,\" \"outlook,\" \"assumes,\" \"targets,\" \"opportunity,\" and similar expressions are used to identify these forward-looking statements. Such forward-looking statements include statements regarding, among other things, Aspen's expectations about capacity, revenue, revenue capacity, backlog, costs, expenses, profitability, cash flow, gross profit, gross margin, operating margin, net loss, Adjusted EBITDA, Adjusted EBITDA margin and related decreases, improvements, timing, variability or trends; beliefs about higher than expected demand from the EV market and how it may enable a path to profitability, expectations about improvement in ability to absorb fixed costs and reduction of conversion costs as a percentage of sales and the same leading to target revenue capacity and gross margins and Adjusted EBITDA margins; Aspen's expectations regarding the planned second manufacturing plant in Georgia (\"Plant II\"), the extended construction and commissioning timeframe for Plant II, Aspen's efforts to manage the construction of Plant II to align with our expectations of demand from EV customers, and the use of contract manufacturers to meet demand from Energy Industrial customers; beliefs about the general strength, weakness or health of Aspen's business; acceleration in demand; beliefs about current or future trends in the energy, energy infrastructure, chemical and refinery, LNG, sustainable building materials, EV thermal barrier, EV battery materials or other markets and the impact of these trends on Aspen's business; beliefs about the strength, effectiveness, productivity, costs, profitability or other fundamentals of Aspen's business; beliefs about the role of Aspen's technology and opportunities in the electric vehicle market; beliefs about Aspen's ability to provide and deliver products and services to electric vehicle customers; beliefs about content per vehicle, revenue, costs, expenses, profitability, investments or cash flow associated with Aspen's electric vehicle opportunities, including the EV thermal barrier business; beliefs about revenue growth and profitability; beliefs about the performance of PyroThin® including its ability to mitigate the propagation of thermal runaway in electric vehicles; beliefs about Aspen's ability to expand the market for PyroThin®, to achieve design wins, to commence shipments of production parts, and to become an industry standard solution for thermal runaway management; beliefs about Aspen's thermal barrier design, prototype, quoting and assembly activities; and expectations about the cost of the capital projects, including Plant II; and beliefs about the Company's pending application with the DOE seeking a loan pursuant to the DOE LPO's ATVM. All such forward-looking statements are based on management's present expectations and are subject to certain factors, risks and uncertainties that may cause actual results, outcome of events, timing and performance to differ materially from those expressed or implied by such statements. These risks and uncertainties include, but are not limited to, the following: inability to execute the growth plan, inability to continue construction of Plant II and to do so at a cost consistent with Aspen's estimates and aligned with Aspen's expectations of demand from our EV customers; the right of EV thermal barrier customers to cancel contracts with Aspen at any time and without penalty; any costs, expenses, or investments incurred by Aspen in excess of projections used to develop pricing under the contracts with EV thermal barrier customers; Aspen's inability to create customer or market opportunities for, including PyroThin®; any other battery performance and safety products, battery materials or for other new products developed from Aspen's aerogel technology; any disruption or inability to achieve expected capacity levels in any of the three existing production lines in East Providence, RI or the Mexico assembly facility or at any contract manufacturer; any failure to enforce any of Aspen's patents; the general economic conditions and cyclical demands in the markets that Aspen serves; and the other risk factors discussed under the heading \"Risk Factors\" in Aspen's Annual Report on Form 10-K for the year ended December 31, 2023 and filed with the Securities and Exchange Commission (\"SEC\") on March 7, 2024, as well as any updates to those risk factors filed from time to time in Aspen's subsequent periodic and current reports filed with the SEC. All statements contained in this press release are made only as of the date of this press release. Aspen does not intend to update this information unless required by law. Reconciliation of Non-GAAP Financial Measures The following tables present a reconciliation of the non-GAAP financial measure included in this press release to the most directly comparable GAAP measure: Reconciliation of Adjusted EBITDA to Net Loss We define Adjusted EBITDA as net income (loss) before interest expense, taxes, depreciation, amortization, stock-based compensation expense and other items, which occur from time to time and which we do not believe are indicative of our core operating performance. For the 2024 full year financial outlook: Year Ending December 31, 2024 (In thousands) Net income $ 2,000 Depreciation and amortization 30,000 Stock-based compensation 14,000 Other expense, net and income tax expense 9,000 Adjusted EBITDA $ 55,000 Cision View original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/aspen-aerogels-announces-thermal-barrier-award-from-valmet-automotive-for-electric-porsche-718-series-and-reiterates-2024-financial-outlook-302171630.html SOURCE Aspen Aerogels, Inc.","filter_flag":1}
