{"title":"UPDATED \"50 STATES OF RECYCLING\" ASSESSMENT FINDS THAT WELL-DESIGNED POLICY IS CRITICAL TO ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi9wFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VwZGF0ZWQtNTAtc3RhdGVzLW9mLXJlY3ljbGluZy1hc3Nlc3NtZW50LWZpbmRzLXRoYXQtd2VsbC1kZXNpZ25lZC1wb2xpY3ktaXMtY3JpdGljYWwtdG8tYWNoaWV2aW5nLWhpZ2hlci1yZWN5Y2xpbmctcmF0ZXMtYXBwcm94aW1hdGVseS02LTUtYmlsbGlvbi13b3J0aC1vZi1tYXRlcmlhbC1sb3N0LXRvLWxhbmRmaWxsLWFubnVhbGx5LTMwMjAxNTk0My5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi9wFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VwZGF0ZWQtNTAtc3RhdGVzLW9mLXJlY3ljbGluZy1hc3Nlc3NtZW50LWZpbmRzLXRoYXQtd2VsbC1kZXNpZ25lZC1wb2xpY3ktaXMtY3JpdGljYWwtdG8tYWNoaWV2aW5nLWhpZ2hlci1yZWN5Y2xpbmctcmF0ZXMtYXBwcm94aW1hdGVseS02LTUtYmlsbGlvbi13b3J0aC1vZi1tYXRlcmlhbC1sb3N0LXRvLWxhbmRmaWxsLWFubnVhbGx5LTMwMjAxNTk0My5odG1s0gEA?oc=5","id":"CBMi9wFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VwZGF0ZWQtNTAtc3RhdGVzLW9mLXJlY3ljbGluZy1hc3Nlc3NtZW50LWZpbmRzLXRoYXQtd2VsbC1kZXNpZ25lZC1wb2xpY3ktaXMtY3JpdGljYWwtdG8tYWNoaWV2aW5nLWhpZ2hlci1yZWN5Y2xpbmctcmF0ZXMtYXBwcm94aW1hdGVseS02LTUtYmlsbGlvbi13b3J0aC1vZi1tYXRlcmlhbC1sb3N0LXRvLWxhbmRmaWxsLWFubnVhbGx5LTMwMjAxNTk0My5odG1s0gEA","guidislink":false,"published":"Thu, 14 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=348, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi9wFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VwZGF0ZWQtNTAtc3RhdGVzLW9mLXJlY3ljbGluZy1hc3Nlc3NtZW50LWZpbmRzLXRoYXQtd2VsbC1kZXNpZ25lZC1wb2xpY3ktaXMtY3JpdGljYWwtdG8tYWNoaWV2aW5nLWhpZ2hlci1yZWN5Y2xpbmctcmF0ZXMtYXBwcm94aW1hdGVseS02LTUtYmlsbGlvbi13b3J0aC1vZi1tYXRlcmlhbC1sb3N0LXRvLWxhbmRmaWxsLWFubnVhbGx5LTMwMjAxNTk0My5odG1s0gEA?oc=5\" target=\"_blank\">UPDATED \"50 STATES OF RECYCLING\" ASSESSMENT FINDS THAT WELL-DESIGNED POLICY IS CRITICAL TO ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"UPDATED \"50 STATES OF RECYCLING\" ASSESSMENT FINDS THAT WELL-DESIGNED POLICY IS CRITICAL TO ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi9wFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VwZGF0ZWQtNTAtc3RhdGVzLW9mLXJlY3ljbGluZy1hc3Nlc3NtZW50LWZpbmRzLXRoYXQtd2VsbC1kZXNpZ25lZC1wb2xpY3ktaXMtY3JpdGljYWwtdG8tYWNoaWV2aW5nLWhpZ2hlci1yZWN5Y2xpbmctcmF0ZXMtYXBwcm94aW1hdGVseS02LTUtYmlsbGlvbi13b3J0aC1vZi1tYXRlcmlhbC1sb3N0LXRvLWxhbmRmaWxsLWFubnVhbGx5LTMwMjAxNTk0My5odG1s0gEA?oc=5\" target=\"_blank\">UPDATED \"50 STATES OF RECYCLING\" ASSESSMENT FINDS THAT WELL-DESIGNED POLICY IS CRITICAL TO ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"2023 \"50 States of Recycling\" report highlights the need for more accurate data, policy and infrastructure investment to improve statewide recycling rates. WESTMINSTER, Colo., Dec. 14, 2023 \/PRNewswire\/ -- Today, Eunomia Research & Consulting and Ball Corporation released an updated \"50 States of Recycling\" report, building on the original, first-of-its-kind state-by-state comparable assessment of common packaging materials by using data on generation, recycling and disposal rates from across the United States. Key findings include: 9 of the 10 states with the highest recycling rates have Recycling Refunds (also known as bottle bills or Deposit Return Systems). While states with Recycling Refunds only account for 27% of the U.S. population, they account for 47% of all packaging recycled, 51% of all aluminum cans and glass bottles recycled and 61% of all PET bottles recycled. States with Recycling Refunds recycle 34% of packaging, excluding fibers and flexible plastics (FFP), through closed-loop end markets (i.e., can-to-can or bottle-to-bottle) compared to 7% for non-Recycling Refund states. Nationally, the value of material diverted from landfills is $2.6 billion , which only represents 32% of the value that could be captured annually. , which only represents 32% of the value that could be captured annually. There is around $6.5 billion worth of material that is lost to landfill annually that could be captured through more effective recycling practices. Since the last iteration of the \"50 States of Recycling\" report, overall recycling rates across the country have stagnated or declined. Several factors contributed to these declines, including pandemic-related shutdowns at many recycling centers. Currently, the U.S. recycles just 45.2% of aluminum cans. Getting that recycling rate closer to 90% by 2030 would create opportunities to reduce greenhouse gas emissions (GHG) – in 2021, 79 million MTCO2e of GHG emissions were avoided through recycling, comparable to removing more than 17 million vehicles from the roads - and grow our economy. The updated report ranks U.S. states by recycling rates while also examining the benefits of implementing policies such as Recycling Refunds, and Extended Producer Responsibility (EPR), which holds producers responsible for product management through the product's lifecycle. When the two policies are enacted alongside one another, the report found that states achieve higher recycling rates, maximize closed-loop recycling (i.e. bottle-to-bottle and can-to-can) and thereby deliver the best social, environmental and economic outcomes for the U.S. \"The recycling rates in our report represent the real recycling—versus collection—rate, meaning this rate is not what is collected for recycling, but rather what is available to be made into new products. Recycling rates in many states are still measured in terms of what is collected for recycling, so to enable a 'like for like' comparison between states, the collection rates have been adjusted to show the real recycling rate. Having a true assessment of recycling rates will better enable us to understand what policy and program measures are needed to capture more quality material, increasing circularity, reducing our need for virgin materials and thus helping protect the planet,\" said Sarah Edwards, Director, Eunomia North America. The 10 states with the highest recycling rates (excluding FFP) in 2021 include: Maine (65%); Vermont (51%); Massachusetts (48%); Iowa (45%); Oregon (45%); New York (44%); California (41%); Michigan (40%); New Jersey (39%); and Connecticut (39%). The 10 states with the lowest recycling rates (excluding FFP) in 2021 include: West Virginia (2%); Louisiana (4%); Tennessee (5%); Alaska (6%); South Carolina (6%); Mississippi (6%); Oklahoma (8%); Alabama (8%); Texas (8%); and Colorado (11%). When expressed as a monetary benefit, the total economic value of recycling in the U.S. is approximately $35 billion, accounting for gross value, employment income from recycling-related jobs and greenhouse gas impact reduction – comparable to removing more than 17 million vehicles from the roads. If effective recycling policies were enacted nationwide, such as pairing Extended Producer Policy alongside Recycling Refunds, the benefit of recycling would double to $70 billion annually. \"Many consumers want to, and think they are, doing the right thing when they put their can or bottle in the recycle bin. However, collection does not equal real recycling. Creating a true closed-loop system — where a can becomes a can, or a bottle becomes a bottle — will require a well-designed recycling policy that creates compelling incentives to recycle and expand recycling infrastructure and systems to ensure the process is simple, convenient and affordable for everyone,\" said Daniel W. Fisher, Chairman and CEO, Ball Corporation. As policymakers and stakeholders from across the supply chain work together to enact meaningful policies and develop effective recycling programs, the \"50 States of Recycling\" report should serve as a resource for developing beneficial programs for the future. How the next generation of recycling systems is designed matters, and smart policies and programs that work together are essential to deliver the best outcomes in the U.S. For more information and state-by-state analysis, view the full \"50 States of Recycling\" report. About Ball Corporation Ball Corporation supplies innovative, sustainable aluminum packaging solutions for beverage, personal care and household products customers, as well as aerospace and other technologies and services primarily for the U.S. government. Ball Corporation and its subsidiaries employ 21,000 people worldwide and reported 2022 net sales of $15.35 billion. For more information, visit www.ball.com, or connect with us on Facebook or Twitter. About Eunomia Established in 2001, Eunomia Research & Consulting ('Eunomia') is an international environmental consultancy dedicated to adding value to organisations through the delivery of improved outcomes. Eunomia has over 100 employees, with offices in Bristol, London, Manchester, Brussels, Athens, New York and Auckland. Working throughout the UK, other EU Member States and beyond, Eunomia's consultants have experience and expertise in environmental, technical and commercial disciplines. For more information about Eunomia, please visit www.eunomia.co.uk . Forward-Looking Statement This release contains \"forward-looking\" statements concerning future events and financial performance. Words such as \"expects,\" \"anticipates,\" \"estimates,\" \"believes,\" and similar expressions typically identify forward looking statements, which are generally any statements other than statements of historical fact. Such statements are based on current expectations or views of the future and are subject to risks and uncertainties, which could cause actual results or events to differ materially from those expressed or implied. You should therefore not place undue reliance upon any forward-looking statements, and they should be read in conjunction with, and qualified in their entirety by, the cautionary statements referenced below. Ball undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Key factors, risks and uncertainties that could cause actual outcomes and results to be different are summarized in filings with the Securities and Exchange Commission, including Exhibit 99 in Ball's Form 10-K, which are available on Ball's website and at www.sec.gov. Additional factors that might affect: a) Ball's packaging segments include product capacity, supply, and demand constraints and fluctuations and changes in consumption patterns; availability\/cost of raw materials, equipment, and logistics; competitive packaging, pricing and substitution; changes in climate and weather and related events such as drought, wildfires, storms, hurricanes, tornadoes and floods; footprint adjustments and other manufacturing changes, including the startup of new facilities and lines; failure to achieve synergies, productivity improvements or cost reductions; unfavorable mandatory deposit or packaging laws; customer and supplier consolidation; power and supply chain interruptions; changes in major customer or supplier contracts or loss of a major customer or supplier; inability to pass through increased costs; war, political instability and sanctions, including relating to the situation in Russia and Ukraine and its impact on Ball's supply chain and its ability to operate in Europe, the Middle East and Africa regions generally; changes in foreign exchange or tax rates; and tariffs, trade actions, or other governmental actions, including business restrictions and orders affecting goods produced by Ball or in its supply chain, including imported raw materials; b) Ball's aerospace segment include funding, authorization, availability and returns of government and commercial contracts; and delays, extensions and technical uncertainties affecting segment contracts; failure to obtain, or delays in obtaining, required regulatory approvals or clearances for the proposed transaction; any failure by the parties to satisfy any of the other conditions to the proposed transaction; the possibility that the proposed transaction is ultimately not consummated; potential adverse effects of the announcement or results of the proposed transaction on the ability to develop and maintain relationships with personnel and customers, suppliers and others with whom it does business or otherwise on the business, financial condition, results of operations and financial performance; risks related to diversion of management's attention from ongoing business operations due to the proposed transaction; the impact of the proposed transaction on the ability to retain and hire key personnel; and c) Ball as a whole include those listed above plus: the extent to which sustainability-related opportunities arise and can be capitalized upon; changes in senior management, succession, and the ability to attract and retain skilled labor; regulatory actions or issues including those related to tax, environmental, social and governance reporting, competition, environmental, health and workplace safety, including U.S. Federal Drug Administration and other actions or public concerns affecting products filled in Ball's containers, or chemicals or substances used in raw materials or in the manufacturing process; technological developments and innovations; the ability to manage cyber threats; litigation; strikes; disease; pandemic; labor cost changes; inflation; rates of return on assets of Ball's defined benefit retirement plans; pension changes; uncertainties surrounding geopolitical events and governmental policies, including policies, orders, and actions related to COVID-19; reduced cash flow; interest rates affecting Ball's debt; successful or unsuccessful joint ventures, acquisitions and divestitures, and their effects on Ball's operating results and business generally; and potential adverse effects of the announcement or results of the proposed transaction on the market price of Ball Corporation's common stock. SOURCE Ball Corporation","filter_flag":1}
{"title":"OP\/ED: Mercy University's Recycling System – The Impact - The Impact","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vdGhlaW1wYWN0bmV3cy5jb20vb3Bpbmlvbi8yMDIzLzEyLzE0L29wLWVkLW1lcmN5LXVuaXZlcnNpdHlzLXJlY3ljbGluZy1zeXN0ZW0v0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vdGhlaW1wYWN0bmV3cy5jb20vb3Bpbmlvbi8yMDIzLzEyLzE0L29wLWVkLW1lcmN5LXVuaXZlcnNpdHlzLXJlY3ljbGluZy1zeXN0ZW0v0gEA?oc=5","id":"CBMiVmh0dHBzOi8vdGhlaW1wYWN0bmV3cy5jb20vb3Bpbmlvbi8yMDIzLzEyLzE0L29wLWVkLW1lcmN5LXVuaXZlcnNpdHlzLXJlY3ljbGluZy1zeXN0ZW0v0gEA","guidislink":false,"published":"Thu, 14 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=348, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vdGhlaW1wYWN0bmV3cy5jb20vb3Bpbmlvbi8yMDIzLzEyLzE0L29wLWVkLW1lcmN5LXVuaXZlcnNpdHlzLXJlY3ljbGluZy1zeXN0ZW0v0gEA?oc=5\" target=\"_blank\">OP\/ED: Mercy University's Recycling System – The Impact<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Impact<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"OP\/ED: Mercy University's Recycling System – The Impact - The Impact","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vdGhlaW1wYWN0bmV3cy5jb20vb3Bpbmlvbi8yMDIzLzEyLzE0L29wLWVkLW1lcmN5LXVuaXZlcnNpdHlzLXJlY3ljbGluZy1zeXN0ZW0v0gEA?oc=5\" target=\"_blank\">OP\/ED: Mercy University's Recycling System – The Impact<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Impact<\/font>","source.href":"https:\/\/theimpactnews.com","source.title":"The Impact","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Every time I step into the cafeteria, I observe more than one student discarding half of their food on their plate. I often wonder why they took so much food if they weren’t going to eat it. Perhaps it’s a perspective shaped by where I come from, where people beg for food regularly. Food is gold – even when Mercy University’s main dining hall isn’t always top-notch, at least we have access to food. I find it impressive how much waste this school produces. I can’t help but envision the staggering scale of waste when I witness approximately six to ten people discarding most of their food. And that’s merely within 25 minutes it takes me to have a meal. Not to mention the amount of cans and bottles I see in the trash and cardboard in the dumpster. The sheer volume of waste is beyond comprehension. The importance of recycling extends beyond measure. Our world is becoming increasingly contaminated, and a lack of social consciousness is apparent among students and staff. Recycling, the process of collecting and transforming materials into new products, is vital for reducing waste and conserving resources. It’s primary purpose is to save the world that we are contaminating. According to the U.S. Environmental Protection Agency (EPA), the average person in the United States generates around 4.9 pounds of daily waste, encompassing residential and commercial waste. Considering that Mercy University has a total enrollment of 8,615 students, with 11 percent residing on campus, the amount of waste generated is substantial. Mercy University’s recycling system is one of the poorest I’ve ever seen, lacking eco-friendly materials in both the Main Hall cafeteria and Victory Hall. Witnessing a first-world country university lagging so far behind in dining and recycling modernization is disheartening. Yes, we have separate bins, but ensuring students follow recycling rules remains challenging. Are they been disposed of properly or junked together? Proper education on recycling practices appears uncommon in the area, with a noticeable absence of seminars, talks, and educational initiatives on campus. Many individuals need to be aware of the impact of using plastic and the lack of environmentally sustainable practices. The amount of harm we can do to the world is immeasurable and it’s growing – health change is a growing emergency throughout the planet as thin tanks around the world are gathering to reverse the damage we have created. Implementing a simple recycling system with rewards incentivizing young adults could make a significant difference. Having experienced the effectiveness of a sound recycling system in Europe, the satisfaction of contributing to the world is indescribable. I must admit I was once ignorant about recycling but came to understand the detrimental effects of plastic on the environment. While having an eco-friendly cafeteria may increase expenses, the long-term savings and benefits can outweigh these costs. The cost of making a dining hall eco-friendly with dishwashers and real silverware can vary, ranging from $100,00 to $500,00. Depending on factors such as the size of the hall and desired eco-friendly features. High-capacity, energy-efficient dishwashers may cost more upfront but lead to long-term savings. It’s essential to recognize that although plastic alternatives may seem cheaper initially, the long-term benefits of eco-friendly measures are more significant. According to a report by the World Economic Forum, global plastic production has increased exponentially, with about 380 million tons of plastic being produced annually. A significant portion of this plastic ends up in landfills, taking hundreds of years to decompose and releasing harmful substances into the soil and water. Nearby colleges such as Skidmore College, Canisius University, Barnard College, and more have implemented a sustainable program for their dining. It is having a positive impact on their community as well. Canisius University has a special agreement that when they have excess food, they donate it to Goodr. Goodr is a company that offers Food Waste solutions by redistributing edible food waste and donating it to a local non-profit to meet the greatest need. While recycling rates have been improving globally, there is still work to be done, especially at the local level. Mercy University has the potential to lead by example, demonstrating a commitment to environmental sustainability through its recycling practices. Implementing an effective recycling program would reduce the university’s ecological footprint and inspire positive change within the student body and the community. Ideas like “all-you-can-eat” buffets at colleges have lowered food quality and increased waste production. As a student, I sometimes over-grab food, but the question remains: what should I do with the excess? Witnessing others mindlessly throw everything away sparks reflection. Doesn’t it make you feel something? When I see someone throw biowaste into the plastics bin – why is it so hard to put it in the correct bin? Is it laziness? Are we a generation of complacency, or can we be the change the world needs? I find myself in the United States of America, one of the most advanced countries in the world, and still, they need to catch up in recycling practices. What we do today affects our future generations. It’s our conscious how we decide or not to contribute. The call for an improved recycling system at Mercy University is not just about waste reduction – it’s a call for environmental responsibility and a commitment to shaping a better future. As members of a first-world country, responsibility and knowledge must be shared to make a positive impact. It’s time for Mercy University to become leaders and foster a sustainability and environmental consciousness culture.","filter_flag":1}
{"title":"BWH Hotels and Call2Recycle Bring Battery Recycling Practices to the Canadian Hospitality Sector - GlobeNewswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiqAFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8xMi8xMi8yNzk0OTM3LzAvZW4vQldILUhvdGVscy1hbmQtQ2FsbDJSZWN5Y2xlLUJyaW5nLUJhdHRlcnktUmVjeWNsaW5nLVByYWN0aWNlcy10by10aGUtQ2FuYWRpYW4tSG9zcGl0YWxpdHktU2VjdG9yLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiqAFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8xMi8xMi8yNzk0OTM3LzAvZW4vQldILUhvdGVscy1hbmQtQ2FsbDJSZWN5Y2xlLUJyaW5nLUJhdHRlcnktUmVjeWNsaW5nLVByYWN0aWNlcy10by10aGUtQ2FuYWRpYW4tSG9zcGl0YWxpdHktU2VjdG9yLmh0bWzSAQA?oc=5","id":"CBMiqAFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8xMi8xMi8yNzk0OTM3LzAvZW4vQldILUhvdGVscy1hbmQtQ2FsbDJSZWN5Y2xlLUJyaW5nLUJhdHRlcnktUmVjeWNsaW5nLVByYWN0aWNlcy10by10aGUtQ2FuYWRpYW4tSG9zcGl0YWxpdHktU2VjdG9yLmh0bWzSAQA","guidislink":false,"published":"Tue, 12 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=12, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=346, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqAFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8xMi8xMi8yNzk0OTM3LzAvZW4vQldILUhvdGVscy1hbmQtQ2FsbDJSZWN5Y2xlLUJyaW5nLUJhdHRlcnktUmVjeWNsaW5nLVByYWN0aWNlcy10by10aGUtQ2FuYWRpYW4tSG9zcGl0YWxpdHktU2VjdG9yLmh0bWzSAQA?oc=5\" target=\"_blank\">BWH Hotels and Call2Recycle Bring Battery Recycling Practices to the Canadian Hospitality Sector<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"BWH Hotels and Call2Recycle Bring Battery Recycling Practices to the Canadian Hospitality Sector - GlobeNewswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqAFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8xMi8xMi8yNzk0OTM3LzAvZW4vQldILUhvdGVscy1hbmQtQ2FsbDJSZWN5Y2xlLUJyaW5nLUJhdHRlcnktUmVjeWNsaW5nLVByYWN0aWNlcy10by10aGUtQ2FuYWRpYW4tSG9zcGl0YWxpdHktU2VjdG9yLmh0bWzSAQA?oc=5\" target=\"_blank\">BWH Hotels and Call2Recycle Bring Battery Recycling Practices to the Canadian Hospitality Sector<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","source.href":"https:\/\/www.globenewswire.com","source.title":"GlobeNewswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Toronto, ON, Dec. 12, 2023 (GLOBE NEWSWIRE) -- Call2Recycle, Canada’s leading battery collection and recycling program, and BWH Hotels (BWH), a leading global hospitality enterprise, are announcing a collaboration to implement battery recycling across the BWH network. It is the first time a major company in the Canadian hospitality sector has integrated battery recycling on a large scale as part of their sustainability strategy. To date, 47 BWH hotels in eight Canadian provinces and territories have joined the Call2Recycle battery recycling program, with more set to join in 2024. This program will provide BWH with a free and convenient solution to dispose of used batteries from their operations responsibly. Battery-powered devices are omnipresent in the operations of the hospitality industry, including being used in sensors, smoke detectors, door locks, and room devices such as clocks or TV remotes. This initiative is part of BWH’s global “Because We Care” sustainability program. Based on three pillars, Earth, People, Community (EPC), the program is aimed at increasing sustainable practices and reducing the carbon footprint across the hotel network. “We are thrilled to join forces with Call2Recycle to introduce battery recycling across our Canadian portfolio of hotels,” said Michael Morton, Vice President Brand Management and Member Services at BWH Hotels. “This significant step forward is a testament to our ongoing commitment to sustainability and environmental stewardship. Aligned with our global EPC program, this collaboration underscores our dedication to fostering sustainable hotel operations that not only safeguard our environment but contribute to the wellbeing of the communities we serve worldwide.” “We are excited to see BWH leading the way for new sustainability and battery recycling efforts in the hospitality sector,” said Joe Zenobio, President, Call2Recycle Canada. “Hotels are major users of battery-powered devices, and BWH’s recycling commitment will allow us to recycle greater volumes of used batteries and divert them from landfills, making a critical difference to protect the environment.” Environmental and economic benefits of battery recycling Recycling batteries is a collective responsibility and an essential part of Canada’s effort to reduce its carbon footprint by reusing waste materials. Properly disposing of batteries is critical to environmental protection and building sustainable recycling practices across Canada. In addition, batteries that have reached the end of their life can be used to make a variety of new products, supporting a strong circular economy. About Call2Recycle Canada, Inc. Call2Recycle® is Canada’s leading organization for battery collection and recycling, fulfilling product stewardship obligations on behalf of over 400 members, including producers of single-use and rechargeable batteries. It is the provincially-approved consumer battery collection and recycling program for British Columbia, Saskatchewan, Manitoba, Quebec, and Prince Edward Island, and operates as a registered Producer Responsibility Organization (PRO) in Ontario according to the Ontario Batteries Regulation. Call2Recycle accepts household batteries (weighing up to 5 kg) for recycling and eTransport batteries used to power eBikes, eScooters, eSkateboards, Hoverboards and Electric Vehicles (EVs). Since its inception in 1997, Call2Recycle has diverted over 40 million kilograms of batteries from Canadian landfills. This reputation for excellence has enabled Call2Recycle to maintain trusted, long-term relationships with stakeholders and a network of more than 10,000 participating collection locations across Canada, including at leading retailers and municipal facilities. About BWH℠ Hotels BWH Hotels is a leading, global hospitality enterprise comprised of three hotel companies, including WorldHotels™, Best Western® Hotels & Resorts and SureStay® Hotels. The global enterprise boasts approximately 4,300 hotels in over 100 countries and territories worldwide*. With 19 brands across every chain scale segment, from economy to luxury, BWH Hotels suits the needs of developers and guests in every market. *Numbers are approximate, may fluctuate, and include hotels currently in the development pipeline. Media Contact For BWH℠ Hotels: Shelby Bartemes, Senior Vice President The Brandman Agency +1.323.944.0064 BWHHotels@brandmanagency.com Attachment","filter_flag":1}
{"title":"Four Michigan tribes get federal grant dollars for recycling projects - MLive.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3Lm1saXZlLmNvbS9wdWJsaWMtaW50ZXJlc3QvMjAyMy8xMi9mb3VyLW1pY2hpZ2FuLXRyaWJlcy1nZXQtZmVkZXJhbC1ncmFudC1kb2xsYXJzLWZvci1yZWN5Y2xpbmctcHJvamVjdHMuaHRtbNIBhwFodHRwczovL3d3dy5tbGl2ZS5jb20vcHVibGljLWludGVyZXN0LzIwMjMvMTIvZm91ci1taWNoaWdhbi10cmliZXMtZ2V0LWZlZGVyYWwtZ3JhbnQtZG9sbGFycy1mb3ItcmVjeWNsaW5nLXByb2plY3RzLmh0bWw_b3V0cHV0VHlwZT1hbXA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3Lm1saXZlLmNvbS9wdWJsaWMtaW50ZXJlc3QvMjAyMy8xMi9mb3VyLW1pY2hpZ2FuLXRyaWJlcy1nZXQtZmVkZXJhbC1ncmFudC1kb2xsYXJzLWZvci1yZWN5Y2xpbmctcHJvamVjdHMuaHRtbNIBhwFodHRwczovL3d3dy5tbGl2ZS5jb20vcHVibGljLWludGVyZXN0LzIwMjMvMTIvZm91ci1taWNoaWdhbi10cmliZXMtZ2V0LWZlZGVyYWwtZ3JhbnQtZG9sbGFycy1mb3ItcmVjeWNsaW5nLXByb2plY3RzLmh0bWw_b3V0cHV0VHlwZT1hbXA?oc=5","id":"CBMieGh0dHBzOi8vd3d3Lm1saXZlLmNvbS9wdWJsaWMtaW50ZXJlc3QvMjAyMy8xMi9mb3VyLW1pY2hpZ2FuLXRyaWJlcy1nZXQtZmVkZXJhbC1ncmFudC1kb2xsYXJzLWZvci1yZWN5Y2xpbmctcHJvamVjdHMuaHRtbNIBhwFodHRwczovL3d3dy5tbGl2ZS5jb20vcHVibGljLWludGVyZXN0LzIwMjMvMTIvZm91ci1taWNoaWdhbi10cmliZXMtZ2V0LWZlZGVyYWwtZ3JhbnQtZG9sbGFycy1mb3ItcmVjeWNsaW5nLXByb2plY3RzLmh0bWw_b3V0cHV0VHlwZT1hbXA","guidislink":false,"published":"Sat, 02 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=2, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=336, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3Lm1saXZlLmNvbS9wdWJsaWMtaW50ZXJlc3QvMjAyMy8xMi9mb3VyLW1pY2hpZ2FuLXRyaWJlcy1nZXQtZmVkZXJhbC1ncmFudC1kb2xsYXJzLWZvci1yZWN5Y2xpbmctcHJvamVjdHMuaHRtbNIBhwFodHRwczovL3d3dy5tbGl2ZS5jb20vcHVibGljLWludGVyZXN0LzIwMjMvMTIvZm91ci1taWNoaWdhbi10cmliZXMtZ2V0LWZlZGVyYWwtZ3JhbnQtZG9sbGFycy1mb3ItcmVjeWNsaW5nLXByb2plY3RzLmh0bWw_b3V0cHV0VHlwZT1hbXA?oc=5\" target=\"_blank\">Four Michigan tribes get federal grant dollars for recycling projects<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">MLive.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Four Michigan tribes get federal grant dollars for recycling projects - MLive.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3Lm1saXZlLmNvbS9wdWJsaWMtaW50ZXJlc3QvMjAyMy8xMi9mb3VyLW1pY2hpZ2FuLXRyaWJlcy1nZXQtZmVkZXJhbC1ncmFudC1kb2xsYXJzLWZvci1yZWN5Y2xpbmctcHJvamVjdHMuaHRtbNIBhwFodHRwczovL3d3dy5tbGl2ZS5jb20vcHVibGljLWludGVyZXN0LzIwMjMvMTIvZm91ci1taWNoaWdhbi10cmliZXMtZ2V0LWZlZGVyYWwtZ3JhbnQtZG9sbGFycy1mb3ItcmVjeWNsaW5nLXByb2plY3RzLmh0bWw_b3V0cHV0VHlwZT1hbXA?oc=5\" target=\"_blank\">Four Michigan tribes get federal grant dollars for recycling projects<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">MLive.com<\/font>","source.href":"https:\/\/www.mlive.com","source.title":"MLive.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Four Michigan tribes received federal grant money for major improvements to recycling equipment and programs. The U.S. Environmental Protection Agency recently awarded nearly $3.8 million in federal infrastructure funds to Native tribes in both the Upper Peninsula and Lower Michigan to build new and upgrade existing recycling and composting facilities. An additional $1.8 million was awarded to nonprofit Michigan Recycling Coalition for education efforts.","filter_flag":1}
{"title":"Updated U.S. recycling report finds $6.5 billion worth of material lost to landfill annually - Recycling Product News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5yZWN5Y2xpbmdwcm9kdWN0bmV3cy5jb20vYXJ0aWNsZS80MTIyMS91cGRhdGVkLXN0YXRlLW9mLXVzLXJlY3ljbGluZy1yZXBvcnQtZmluZHMtZG9sbGFyNjUtYmlsbGlvbi13b3J0aC1vZi1tYXRlcmlhbC1sb3N0LXRvLWxhbmRmaWxsLWFubnVhbGx50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5yZWN5Y2xpbmdwcm9kdWN0bmV3cy5jb20vYXJ0aWNsZS80MTIyMS91cGRhdGVkLXN0YXRlLW9mLXVzLXJlY3ljbGluZy1yZXBvcnQtZmluZHMtZG9sbGFyNjUtYmlsbGlvbi13b3J0aC1vZi1tYXRlcmlhbC1sb3N0LXRvLWxhbmRmaWxsLWFubnVhbGx50gEA?oc=5","id":"CBMimgFodHRwczovL3d3dy5yZWN5Y2xpbmdwcm9kdWN0bmV3cy5jb20vYXJ0aWNsZS80MTIyMS91cGRhdGVkLXN0YXRlLW9mLXVzLXJlY3ljbGluZy1yZXBvcnQtZmluZHMtZG9sbGFyNjUtYmlsbGlvbi13b3J0aC1vZi1tYXRlcmlhbC1sb3N0LXRvLWxhbmRmaWxsLWFubnVhbGx50gEA","guidislink":false,"published":"Thu, 21 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=355, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5yZWN5Y2xpbmdwcm9kdWN0bmV3cy5jb20vYXJ0aWNsZS80MTIyMS91cGRhdGVkLXN0YXRlLW9mLXVzLXJlY3ljbGluZy1yZXBvcnQtZmluZHMtZG9sbGFyNjUtYmlsbGlvbi13b3J0aC1vZi1tYXRlcmlhbC1sb3N0LXRvLWxhbmRmaWxsLWFubnVhbGx50gEA?oc=5\" target=\"_blank\">Updated U.S. recycling report finds $6.5 billion worth of material lost to landfill annually<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Recycling Product News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Updated U.S. recycling report finds $6.5 billion worth of material lost to landfill annually - Recycling Product News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5yZWN5Y2xpbmdwcm9kdWN0bmV3cy5jb20vYXJ0aWNsZS80MTIyMS91cGRhdGVkLXN0YXRlLW9mLXVzLXJlY3ljbGluZy1yZXBvcnQtZmluZHMtZG9sbGFyNjUtYmlsbGlvbi13b3J0aC1vZi1tYXRlcmlhbC1sb3N0LXRvLWxhbmRmaWxsLWFubnVhbGx50gEA?oc=5\" target=\"_blank\">Updated U.S. recycling report finds $6.5 billion worth of material lost to landfill annually<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Recycling Product News<\/font>","source.href":"https:\/\/www.recyclingproductnews.com","source.title":"Recycling Product News","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Eunomia Research & Consulting and Ball Corporation released an updated 50 States of Recycling report, building on the original state-by-state comparable assessment of common packaging materials by using data on generation, recycling, and disposal rates from across the United States. Key findings of the report include: 9 of the 10 states with the highest recycling rates have recycling refunds (also known as bottle bills or deposit return systems). While states with recycling refunds only account for 27 percent of the U.S. population, they account for 47 percent of all packaging recycled, 51 percent of all aluminum cans and glass bottles recycled, and 61 percent of all PET bottles recycled. States with recycling refunds recycle 34 percent of packaging, excluding fibres and flexible plastics (FFP), through closed-loop end markets compared to 7 percent for non-recycling refund states. Nationally, the value of material diverted from landfills is $2.6 billion, which only represents 32 percent of the value that could be captured annually. There is around $6.5 billion worth of material that is lost to landfills annually that could be captured through more effective recycling practices. Since the last iteration of the 50 States of Recycling report, overall recycling rates across the country have stagnated or declined. Several factors contributed to these declines, including pandemic-related shutdowns at many recycling centres. Currently, the U.S. recycles just 45.2 percent of aluminum cans. Getting that recycling rate closer to 90 percent by 2030 would create opportunities to reduce greenhouse gas emissions (GHG) – in 2021, 79 million MTCO2e of GHG emissions were avoided through recycling, comparable to removing more than 17 million vehicles from the roads – and grow the U.S. economy. The updated report ranks U.S. states by recycling rates while also examining the benefits of implementing policies such as recycling refunds and extended producer responsibility (EPR) which holds producers responsible for product management through the product's lifecycle. When the two policies are enacted alongside one another, the report found that states achieve higher recycling rates, maximize closed-loop recycling (i.e. bottle-to-bottle and can-to-can), and deliver the best social, environmental, and economic outcomes for the U.S. \"The recycling rates in our report represent the real recycling – versus collection – rate, meaning this rate is not what is collected for recycling, but rather what is available to be made into new products. Recycling rates in many states are still measured in terms of what is collected for recycling, so to enable a 'like for like' comparison between states, the collection rates have been adjusted to show the real recycling rate. Having a true assessment of recycling rates will better enable us to understand what policy and program measures are needed to capture more quality material, increasing circularity, reducing our need for virgin materials, and thus helping protect the planet,\" said Sarah Edwards, director of Eunomia North America. The 10 states with the highest recycling rates (excluding FFP) in 2021 include Maine (65 percent), Vermont (51 percent), Massachusetts (48 percent), Iowa (45 percent), Oregon (45 percent), New York (44 percent), California (41 percent), Michigan (40 percent), New Jersey (39 percent), and Connecticut (39 percent). The 10 states with the lowest recycling rates (excluding FFP) in 2021 include West Virginia (2 percent), Louisiana (4 percent), Tennessee (5 percent), Alaska (6 percent), South Carolina (6 percent), Mississippi (6 percent), Oklahoma (8 percent), Alabama (8 percent), Texas (8 percent), and Colorado (11 percent). When expressed as a monetary benefit, the total economic value of recycling in the U.S. is approximately $35 billion, accounting for gross value, employment income from recycling-related jobs, and greenhouse gas impact reduction – comparable to removing more than 17 million vehicles from the roads. If effective recycling policies were enacted nationwide, such as pairing extended producer policy alongside recycling refunds, the benefit of recycling would double to $70 billion annually. \"Many consumers want to, and think they are, doing the right thing when they put their can or bottle in the recycle bin. However, collection does not equal real recycling. Creating a true closed-loop system – where a can becomes a can, or a bottle becomes a bottle – will require a well-designed recycling policy that creates compelling incentives to recycle and expand recycling infrastructure and systems to ensure the process is simple, convenient and affordable for everyone,\" said Daniel W. Fisher, chairman and CEO of the Ball Corporation. As policymakers and stakeholders from across the supply chain work together to enact meaningful policies and develop effective recycling programs, the 50 States of Recycling report should serve as a resource for developing beneficial programs for the future. How the next generation of recycling systems is designed matters, and smart policies and programs that work together are essential to deliver the best outcomes in the U.S. For more information and state-by-state analysis, view the full 50 States of Recycling report.","filter_flag":1}
{"title":"Global Electronics Recycling Business Report 2023: Market to Reach $110.6 Billion by 2030 from $39.8 Billion in 2022 ... - GlobeNewswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigwJodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMi8wNS8yNzkxMTA5LzI4MTI0L2VuL0dsb2JhbC1FbGVjdHJvbmljcy1SZWN5Y2xpbmctQnVzaW5lc3MtUmVwb3J0LTIwMjMtTWFya2V0LXRvLVJlYWNoLTExMC02LUJpbGxpb24tYnktMjAzMC1mcm9tLTM5LTgtQmlsbGlvbi1pbi0yMDIyLVUtUy1pcy1Fc3RpbWF0ZWQtYXQtOC0xLUJpbGxpb24tV2hpbGUtQ2hpbmEtaXMtRm9yZWNhc3QtdG8tR3Jvdy1hdC5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigwJodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMi8wNS8yNzkxMTA5LzI4MTI0L2VuL0dsb2JhbC1FbGVjdHJvbmljcy1SZWN5Y2xpbmctQnVzaW5lc3MtUmVwb3J0LTIwMjMtTWFya2V0LXRvLVJlYWNoLTExMC02LUJpbGxpb24tYnktMjAzMC1mcm9tLTM5LTgtQmlsbGlvbi1pbi0yMDIyLVUtUy1pcy1Fc3RpbWF0ZWQtYXQtOC0xLUJpbGxpb24tV2hpbGUtQ2hpbmEtaXMtRm9yZWNhc3QtdG8tR3Jvdy1hdC5odG1s0gEA?oc=5","id":"CBMigwJodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMi8wNS8yNzkxMTA5LzI4MTI0L2VuL0dsb2JhbC1FbGVjdHJvbmljcy1SZWN5Y2xpbmctQnVzaW5lc3MtUmVwb3J0LTIwMjMtTWFya2V0LXRvLVJlYWNoLTExMC02LUJpbGxpb24tYnktMjAzMC1mcm9tLTM5LTgtQmlsbGlvbi1pbi0yMDIyLVUtUy1pcy1Fc3RpbWF0ZWQtYXQtOC0xLUJpbGxpb24tV2hpbGUtQ2hpbmEtaXMtRm9yZWNhc3QtdG8tR3Jvdy1hdC5odG1s0gEA","guidislink":false,"published":"Tue, 05 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=5, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=339, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwJodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMi8wNS8yNzkxMTA5LzI4MTI0L2VuL0dsb2JhbC1FbGVjdHJvbmljcy1SZWN5Y2xpbmctQnVzaW5lc3MtUmVwb3J0LTIwMjMtTWFya2V0LXRvLVJlYWNoLTExMC02LUJpbGxpb24tYnktMjAzMC1mcm9tLTM5LTgtQmlsbGlvbi1pbi0yMDIyLVUtUy1pcy1Fc3RpbWF0ZWQtYXQtOC0xLUJpbGxpb24tV2hpbGUtQ2hpbmEtaXMtRm9yZWNhc3QtdG8tR3Jvdy1hdC5odG1s0gEA?oc=5\" target=\"_blank\">Global Electronics Recycling Business Report 2023: Market to Reach $110.6 Billion by 2030 from $39.8 Billion in 2022 ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Global Electronics Recycling Business Report 2023: Market to Reach $110.6 Billion by 2030 from $39.8 Billion in 2022 ... - GlobeNewswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwJodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMi8wNS8yNzkxMTA5LzI4MTI0L2VuL0dsb2JhbC1FbGVjdHJvbmljcy1SZWN5Y2xpbmctQnVzaW5lc3MtUmVwb3J0LTIwMjMtTWFya2V0LXRvLVJlYWNoLTExMC02LUJpbGxpb24tYnktMjAzMC1mcm9tLTM5LTgtQmlsbGlvbi1pbi0yMDIyLVUtUy1pcy1Fc3RpbWF0ZWQtYXQtOC0xLUJpbGxpb24tV2hpbGUtQ2hpbmEtaXMtRm9yZWNhc3QtdG8tR3Jvdy1hdC5odG1s0gEA?oc=5\" target=\"_blank\">Global Electronics Recycling Business Report 2023: Market to Reach $110.6 Billion by 2030 from $39.8 Billion in 2022 ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","source.href":"https:\/\/www.globenewswire.com","source.title":"GlobeNewswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Dublin, Dec. 05, 2023 (GLOBE NEWSWIRE) -- The \"Electronics Recycling - Global Strategic Business Report\" report has been added to ResearchAndMarkets.com's offering. Global Electronics Recycling Market to Reach $110.6 Billion by 2030 The global market for Electronics Recycling estimated at US$39.8 Billion in the year 2022, is projected to reach a revised size of US$110.6 Billion by 2030, growing at a CAGR of 13.6% over the analysis period 2022-2030. Metals, one of the segments analyzed in the report, is projected to record 14.3% CAGR and reach US$80.3 Billion by the end of the analysis period. Growth in the Plastics segment is estimated at 12.4% CAGR for the next 8-year period. The global E-Waste Recycling market has experienced significant shifts and trends, largely influenced by the COVID-19 pandemic. Initially, the pandemic disrupted traditional patterns of E-Waste generation and recycling due to lockdowns and changes in consumer behavior. With businesses temporarily closed, there was a slowdown in electronic equipment disposal. However, as these disruptions proved transitory, the electronics recycling industry is expected to gain momentum, driven by the resumption of normal business operations and the increasing demand for electronics. E-Waste constitutes a broad spectrum of electronic and electrical devices, each with its distinct material composition. Understanding these materials is crucial for effective recycling and resource recovery. Improper E-Waste disposal can have significant environmental and health consequences, underscoring the importance of responsible electronics recycling. While recycling rates for E-Waste have traditionally been low, there is a growing emphasis on adopting a circular approach, encompassing refurbishment, remanufacturing, and recycling to reduce waste and promote sustainability. The volume of E-Waste generated globally continues to rise, with developing countries emerging as significant contributors, necessitating sustainable recycling practices. The growth of the consumer electronics sector plays a pivotal role in E-Waste recycling, as the increasing prevalence of consumer electronics leads to a higher volume of discarded devices. Developing countries are expected to be key drivers of growth in the E-Waste recycling market. The market landscape is characterized by established players and startups, with some startups gaining recognition for innovative E-Waste recycling solutions. Recent market activity includes partnerships, investments, and initiatives aimed at improving recycling processes and enhancing sustainability in the E-Waste recycling industry. These developments reflect the industry's commitment to responsible recycling practices and resource recovery in a changing electronics landscape influenced by the COVID-19 pandemic. The U.S. Market is Estimated at $8.1 Billion, While China is Forecast to Grow at 17% CAGR The Electronics Recycling market in the U.S. is estimated at US$8.1 Billion in the year 2022. China, the world's second largest economy, is forecast to reach a projected market size of US$28.6 Billion by the year 2030 trailing a CAGR of 17% over the analysis period 2022 to 2030. Among the other noteworthy geographic markets are Japan and Canada, each forecast to grow at 9.5% and 9.7% respectively over the 2022-2030 period. Within Europe, Germany is forecast to grow at approximately 13.3% CAGR. What`s New? Special discussions on the global economic climate and market sentiment Coverage on global competitiveness and key competitor percentage market shares Market presence analysis across multiple geographies - Strong\/Active\/Niche\/Trivial Online interactive peer-to-peer collaborative bespoke updates Access to digital archives and trademarked research platform Complimentary updates for one year Access to curated YouTube video transcripts of market sentiments shared by CEOs, domain experts and market influencers via interviews, podcasts, press statements and event keynotes Key Attributes: Report Attribute Details No. of Pages 510 Forecast Period 2022 - 2030 Estimated Market Value (USD) in 2022 $39.8 Billion Forecasted Market Value (USD) by 2030 $110.6 Billion Compound Annual Growth Rate 13.6% Regions Covered Global MARKET TRENDS & DRIVERS Increasing Smartphone Adoption Expands Opportunities for e-Scrap Recycling Market Global Smartphone Shipments in Million Units: 2010-2021 Smartphone Adoption as Share of Total Population: 2016-2021 Smartphone Adoption Across Select Countries : 2020 Expanding IoT Ecosystem Provides Steady Demand Prospects Global Number of IoT Connected Devices (In Billion) for the Years 2016, 2018, 2020, 2022 & 2025 Increase in Consumer Spending on Smart Home Gadgets Presents Growth Opportunities Global Smart Homes Market (In US$ Billion) for the Years 2019, 2021, 2023 & 2025 Global Smart Home Market Breakdown by Technology (in %) for 2018 and 2022 Recycling Approaches to Exploit Potential Deposits of E-Waste Lying in Landfills Microfluidic Strategy to Push Recycling Rate Leading Electronics Recycling Technology Trends Major Technology Trends Innovating Electronics Recycling Turning Electronic Waste into Power Approaches for Recycling Precious Metals Anaerobic Digestion & Enzymatic Activity Techniques for Efficient Waste Collection, Routing & Disposal Waste Management Apps AI-Driven Robotics Helping in Overcoming Electronics Recycling Challenges Shorter Lifespan of New Electronic Devices Adds to the Volume of E-Waste Generated Average Lifespan (in Years) of Select Consumer Electronic Products Wearables Manufacturers Focus on Effective EOL Strategies Collaboration: Key to Profitable Recycling Global Wearable Device Shipments in Million Units for the Years 2017, 2019, 2021, 2023, and 2025 Recyclers Collaborate with Device Manufacturers Smaller and Thinner Devices Create Challenges for Recyclers Device Manufacturers Focus on Recyclable Products Other Innovative Technologies to Reduce E-Waste Generation Rising Concerns over Environmental Implications of Plastics Waste Disposal Turns Focus onto Plastics Recycling Plastic Waste Statistics: In a Nutshell Global Percentage Breakdown of Plastic Waste Generation by End-Use Sector: 2021E Challenges Confronting Total E-waste Elimination Rapid Production of Large Quantum of E-Waste Makes Management a Key Challenge Low Commodity Price Values - A Major Challenge Low General Public Awareness Levels Thwarts Industry Efforts Data Security: A Vital Aspect of E-waste Disposal Developing Countries: The Common Destination for E-Waste Dumping Strategies Likely to Tap Growth Opportunities in E-Waste Management Regulatory Regime Paves Way for Recycling of Recycling of Electronics Products FOCUS ON SELECT PLAYERS(Total 177 Featured) Apple, Inc. Boliden Group Dowa Holdings Co., Ltd. Aurubis AG Adamec Recycling GmbH AER Worldwide All Green Electronics Recycling LLC BRAL Reststoff-Bearbeitungs GmbH CEAR, Inc. Cerebra Integrated Technologies Ltd. Cimelia Resource Recovery Pte., Ltd. Cleanaway Waste Management Ltd. Clean Earth, Inc. A1 Assets, Inc. Chiho Environmental Group Ltd. For more information about this report visit https:\/\/www.researchandmarkets.com\/r\/tzg9xy About ResearchAndMarkets.com ResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends. Attachment","filter_flag":1}
{"title":"How did the top smartphone makers fare in sustainability in 2023? - Rappler","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnJhcHBsZXIuY29tL3RlY2hub2xvZ3kvZmVhdHVyZXMvc21hcnRwaG9uZS1icmFuZHMtbWFrZXJzLXN1c3RhaW5hYmlsaXR5LXJlcG9ydHMtMjAyMy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnJhcHBsZXIuY29tL3RlY2hub2xvZ3kvZmVhdHVyZXMvc21hcnRwaG9uZS1icmFuZHMtbWFrZXJzLXN1c3RhaW5hYmlsaXR5LXJlcG9ydHMtMjAyMy_SAQA?oc=5","id":"CBMiYWh0dHBzOi8vd3d3LnJhcHBsZXIuY29tL3RlY2hub2xvZ3kvZmVhdHVyZXMvc21hcnRwaG9uZS1icmFuZHMtbWFrZXJzLXN1c3RhaW5hYmlsaXR5LXJlcG9ydHMtMjAyMy_SAQA","guidislink":false,"published":"Fri, 22 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=356, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnJhcHBsZXIuY29tL3RlY2hub2xvZ3kvZmVhdHVyZXMvc21hcnRwaG9uZS1icmFuZHMtbWFrZXJzLXN1c3RhaW5hYmlsaXR5LXJlcG9ydHMtMjAyMy_SAQA?oc=5\" target=\"_blank\">How did the top smartphone makers fare in sustainability in 2023?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Rappler<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How did the top smartphone makers fare in sustainability in 2023? - Rappler","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnJhcHBsZXIuY29tL3RlY2hub2xvZ3kvZmVhdHVyZXMvc21hcnRwaG9uZS1icmFuZHMtbWFrZXJzLXN1c3RhaW5hYmlsaXR5LXJlcG9ydHMtMjAyMy_SAQA?oc=5\" target=\"_blank\">How did the top smartphone makers fare in sustainability in 2023?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Rappler<\/font>","source.href":"https:\/\/www.rappler.com","source.title":"Rappler","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"This is AI generated summarization, which may have errors. For context, always refer to the full article. According to an Alibaba study, in the Philippines, up to 89% of consumers desire sustainable lifestyles, making tech brands' green efforts more important than ever MANILA, Philippines – Smartphones are the most common and ubiquitous consumer electronics device today, estimated to have more than 4.5 billion users in 2022. These devices consume a lot of energy and resources to make, generating over 146 million tons of carbon dioxide or equivalent emissions, according to financial advisory group Deloitte’s estimates in 2022. It’s actually a tiny fraction of the 36.8 gigatons of emissions produced in 2022, but as Deloitte notes, “it is still worth trying to reduce.” Where is the carbon or equivalent emission produced in the life of a phone? In 2022 estimates, about 83% is said to come from the manufacture, shipping, first-year usage of new smartphones, while about 11% comes from the usage of existing phones, 4% comes from refurbishing old phones, and another 1% is from recycling processes. What does this tell us? A new smartphone purchase has a bigger carbon cost than extending one’s usage of an existing phone. As it stands, the standard practice among almost, if not all, smartphone manufacturers is to release new models on an annual basis. That’s the current pace of this business, which is designed to push you to upgrade sooner rather than later. There have been some evidence, however, that people are holding on to their phones longer, partly due to seemingly more minor annual improvements. Apple, earlier this year, was also investigated by France over accusations of planned obsolescence. The EU is legislating for replaceable batteries in phones, while the Biden administration in the US has pushed for more robust right-to-repair laws. All of these actions may potentially lengthen phone ownership. But even amid shifting buyer trends spurred partly by the lack of significant improvements, and government-led initiatives to extend smartphone usefulness, smartphone manufacturers aren’t likely to shift release cycles anytime soon. New products, at least for the foreseeable future, will continue to come out annually. As informed consumers, we can choose to not immediately latch on to the shiny new thing, especially if the year-to-year improvement isn’t that striking. But if it’s really time to upgrade, let’s take a look at which brand has the greenest processes, based on the latest versions of their sustainability reports, and other press-issued statements. Apple Apple has long been viewed as a leader in environmental standards, and the tech giant has never been shy to incorporate its progress in these initiatives to its product marketing. At its annual September launch event, the iPhone-maker aired a five-minute sketch, where CEO Tim Cook, among other employees, held a meeting with a personified Mother Nature, played by Hollywood actor Octavia Spencer. In that meeting, Cook and company try to win over Mother Nature’s heart by sharing with her a report of the progress the company has made on its sustainability objectives. The video is, of course, meant to tout how this year’s Watch models reportedly carry the carbon neutral branding, with the company aiming to do the same for all of its products by 2030. The sketch drew mixed reactions from the public. Some called it out for how it used climate initiatives to sell products, while others simply didn’t find it entertaining at all. For this list, however, the focus will be on the iPhone. As mentioned previously, manufacturing smartphones is energy- and resource-intensive, creating a lot of emissions that impact the environment. Last year’s iPhone 14 Pro, for instance, emits 65 kg of carbon dioxide into the atmosphere during its lifecycle, according to Apple. No less than 81% of those emissions occur during the manufacturing process, which covers the extraction of raw materials, the manufacturing of the device itself and transport, to name a few steps. This year’s iPhone 15 Pro, in comparison, emits 66 kg of carbon dioxide, one kilogram higher than the iPhone 14 Pro’s emissions. Apple, however, notes that the 15 Pro’s emissions would have been 26 kg higher if not for the use of more recycled materials and clean energy solutions. Still, it’s not a move towards a lower number, so it’s tough to argue that the iPhone moved the needle this year in terms of green efforts. What might be worth mentioning is that Apple debuted USB-C connectivity on this year’s iPhone generation, the iPhone 15. While it can be argued that the European Union’s common charger legislation forced the company’s hand, the change still marks a significant contribution towards lessening e-waste. With iPhones now sporting a USB-C port, you’ll be able to use the cables and adapters you might already have to charge your device. Making the USB-C as standard across all devices is estimated to save at least 11,000 tons of e-waste annually. Xiaomi Xiaomi is similarly taking action to reduce its carbon emissions, adopting what it calls its Zero-Carbon Philosophy to reach its goals. This plan was reportedly rolled out in phases, and spans different aspects of the Chinese electronics giant’s operations. The first phase, which was set in 2021, involved Xiaomi lowering carbon emissions of its main headquarters, targeting a 4.5% decrease by 2026 versus its 2020 figure. But in just two years, the company says it has already managed to surpass its target, recording a 21.12% reduction in per capita carbon emissions compared to the 2021 baseline. The company has also touted new, more energy-efficient technologies in its products. In the past year, for example, it said it has developed a more energy-efficient 5G and signal transmission solution, reducing the power consumption of the company’s smartphones by up to 30% compared with the previous generation. Another notable effort is the development of a new, more energy-efficient display technology, which reduces the energy consumption of devices by up to 70% in specific applications. Xiaomi also promotes a circular economy, anchored by a refurbishing system that renews discarded devices. The company claims that within the past year, it has refurbished about 94,000 smartphones, all of which were later sold again as certified refurbished products. Other green initiatives include the use of wear-resistant ceramic materials and synthetic silicone in smartphones, the adoption of eco-friendly packaging with less paper and plastic, and the development of a recycling system that finds new use for e-waste. Honor HONOR 90 5G Honor in 2023 published its first-ever Environmental, Social and Governance Report, where it outlined its goal to reduce its carbon emissions by 88%, achieve 100% use of renewable energy, and reach carbon neutral operations by 2045. As part of that sustainability commitment, the former Huawei sub-brand is overhauling its product development lifecycle. For example, it has reportedly reduced its use of hazardous substances and materials by 3,861 tons and recycled more than 1,785 tons of e-waste. Additionally, 98% of the materials used in the packaging of the Magic V foldable smartphone are non-plastic. On the production side, automated technology is reportedly employed to reduce energy and resource consumption. These efforts, according to Honor, puts it on track to reach its goal to reach carbon neutral operations by 2045. realme Realme in 2023 reaffirmed its commitment to its “Sustainability Vision” initiative, which involves cutting 50% of its carbon emissions from its popular GT smartphone series within five years. The initiative, which was announced in 2022, has the Chinese brand try to minimize its carbon footprint as much as it can throughout the whole smartphone cycle, from design to manufacturing to recycling. In its sustainability report, Realme highlighted three important approaches it’s taking as part of the initiative. First, it’s extending the lifespan of its products by adopting a more modular design and improving after-sales services. Second, it’s adopting stricter standards around hazardous substance control to reduce the environmental impact of the disposal of its smartphones. Last, it has set up a recycling system and a trade-in business to take in discarded smartphones, preventing them from ending up in a landfill. Realme also touted that its 2022 flagship, the Realme GT2 Pro, is the world’s first TCO 9.0 certified smartphone. TCO 9.0 is a certification given to IT products that fulfill a certain criteria for sustainability. The GT2 Pro features a biopolymer rear panel, which supposedly decreases carbon emissions from its manufacturing by 35.5%. The material also creates up to two kilograms less carbon emissions for every kilogram made versus petroleum. OPPO Similar to the other companies on this list, OPPO also has its own commitment to sustainability that covers the optimization of smartphones’ lifecycles and the use of eco-friendly materials in manufacturing, among others. What’s a bit different with the company’s approach, however, is it’s also getting like-minded individuals involved in its low-carbon development roadmap. In 2022, OPPO launched the Inspiration Challenge, which called on tech professionals and entrepreneurs to submit their ideas for tech innovations. Winning ideas were awarded a grant and technical support from the company. This year, OPPO brought back the challenge, featuring two categories: “Inspiration for People” and “Inspiration for the Planet”. The latter, of course, focuses on solutions that promote green technology as applied to consumer electronics. Among the winners was Estonia-based startup Woola’s packaging solution for the OPPO Watch, made from recycled wool. Each of the five winners received a grant of $50,000 as well as opportunities to collaborate with OPPO and its partners to further develop their ideas. OPPO was also recognized by Time in 2023 for its Zero-Power Tag, a tracking device that sends out temperature or location data without using a battery. The lightweight prototype uses ambient energy sources like radio waves and heat to power it, negating the need for a lithium ion battery, which are harmful to the environment and eventually end up in landfills. The company said it’s refining the tracker to expand its feature set and perhaps apply it to other smaller devices. Samsung Samsung claims that 2023’s S23 models are its “most sustainable phones yet.” The South Korean electronics giant touted the devices’ are UL ECOLOGO-certified for reduced environmental and health impact. Furthermore, the Galaxy S23 Ultra is said to be made up of 12 internal and external components of recycled material, up from the Galaxy S22 Ultra’s six. The materials include recycled aluminum and glass as well as recycled plastics sourced from discarded fishing nets and water barrels. All the materials for the packaging are also sustainably sourced. While it’s nice to hear about an uptick in usage of recycled materials, the overall impact is not clear at the moment. In addition, Samsung promised to deliver up to four generations of OS updates and five years of security updates for the S23 series. This promise should help prolong the life of your device and let you use it longer without it feeling outdated. Samsung said it’s also made strides towards its New Environmental Strategy, which is the company’s roadmap to reach net zero at the Device eXperience (DX) Division by 2030 and at the company level including the Device Solutions (DS) Division by 2050. The DX division covers the company’s smartphone and home appliance businesses. Among those strides is the increase in use of renewable energy by 65% compared to the previous year, reaching 8,704 gigawatt hours. In line with this, all of DX division’s offices in Korea as well as manufacturing plants in Vietnam, India, and Brazil have reportedly transitioned to 100% renewable energy, following the same transition in the company’s US, Europe, and China offices in 2020. In its annual sustainability report, the company said its efforts in 2022 produced a total sustainability value equivalent to about $88.9 billion. However, in 2023, it’s expecting that value to decline, citing “global economic recession and industry stagnation” as major factors. It said, though, that this decline won’t stop it from investing in environmental management initiatives in semiconductor process gas reduction and water resource preservation, among others. Samsung in 2023 also launched its Sustainability Website, showing key data on its progress towards its net zero goals and details on its sustainability-related initiatives. The website, which covers a range of topics, helps the company disclose the relevant information in a transparent and easy-to-digest fashion. Fairphone Play Video It’s not a household name but when it comes to sustainability, there’s arguably no other brand that has stronger credentials than the Fairphone. This is why the Dutch cooperative has found itself on this list. In 2023, it released the Fairphone 4, a modern smartphone designed in such a way that you can repair yourself from the comfort of your home. A lot of that repairability comes from the device’s modular design. Its rear panel can, for instance, be unclipped without any tools, while the battery can easily be replaced using your standard screwdriver. Fairphone also said that the device is manufactured from fair trade gold and silver and ethically sourced aluminum and tungsten as well as recycled metals and plastic. The brand has also committed to recycling the equivalent volume of electronics per device sold. While some of the aforementioned smartphone manufacturers above also have recycling practices and promote repairability, none of them have gone to the lengths Fairphone has. So in this regard, it deserves some form of recognition, despite the fact that it’s not as readily available as most other phone brands here. Huawei Huawei has its “Tech for a Better Planet” planet pledge that focuses on “advancing energy conservation and emissions reduction, promoting renewable energy, and contributing to a circular economy.” The company said that the average energy efficiency of their main products in 2022, when its last green report was published, has increased 2.1 times compared with 2019. For their manufacturing processes, Huawei said their use of a digital energy monitoring system that manages power consumption on production lines, and upgrades towards more efficient machines have led to energy savings of 19.67 million kWh throughout 2022, or the equivalent of 11,218 tons of emissions. Like many brands, they tout the use of lightweight packaging, minimize plastic use, and promote reuse of packaging materials. Huawei said in its sustainability report, “The longer a product’s lifecycle, the smaller its impact on the environment.” To that end, they promised “easy” upgrades for their Harmony OS “over the long term.” They touted a smooth user experience across all devices, even providing upgrade services down to their older phones such as the Mate 9 series released way back in 2016. “The OS makes it possible for users to revive old models from many years ago,” Huawei said. The company also said it has a global recycling system wherein they work with scrap providers to reuse raw materials for use in refurbishing devices. The program has so far led to 600,000 sold refurbished devices, including phones. vivo In its sustainability report, Vivo touts the thinness of their products as a way to reduce materials use. For examples, their S series phones’ components have become thinner by 15 to 30%, resulting in not just a lighter product for the user, but slightly for the environment as well. The company also said that they’ve made their packaging lighter over the years, citing a reduction of about 18 grams for some models. “For every 10 million mobile phones, the reduction is equivalent to saving the use of 180 tons of paper,” vivo said. In their Y series phones, 50% of the fibers in their packaging materials come from recycling, with the company saying they’re aiming for a higher percentage gradually. They’ve lowered the use of plastics in earphone and data cable cases too by 17.5% and 6.7% respectively. For everyday use, the company highlighted how they make their phones more energy efficient for it to last longer. “To the best of our ability, we use electronic components with higher energy efficiency, and use intelligent algorithms to intelligently adjust device performance according to users’ usage scenarios and application needs,” it said. Making their devices tougher will extend product life too, said vivo, explaining how the rate of display modules cracking has been reduced by 70%. Assessing sustainability It’s worth assessing the sustainability efforts of these smartphone giants each year as there’s reportedly a growing number of consumers who are seeking eco-friendly products to support sustainable lifestyles. In the Philippines, up to 89% of consumers desire sustainable lifestyles but find it difficult due to inconvenience and high costs, according to an Alibaba Group study. Those are the two major factors that are stopping them from changing their shopping behaviors in this aspect. With regards to the smartphone industry, there are steps being taken to address both inconvenience and costs in support of sustainability, led by the EU with its new rules on USB-C standardization, battery replaceability, and right-to-repair laws. Such regulations can help solve the two aforementioned challenges stopping consumers leading sustainable lifestyles, allowing them to hold onto their devices for longer, which saves them from repair fees or the cost of a new device. Would these changes offset the smartphone industry’s impact on the environment? Alone, perhaps not. However, when factored in with the other initiatives that companies like Apple, Samsung, and Xioami, to name a few, are rolling out behind the scenes as well as the EU’s other regulatory efforts, there’s a strong potential to turn the smartphone value chain green. – Rappler.com","filter_flag":1}
{"title":"Elfbar's pop-up event shines spotlight on responsible recycling for single-use vapes - Convenience Store","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5jb252ZW5pZW5jZXN0b3JlLmNvLnVrL3lvdXItYnVzaW5lc3MvZWxmYmFycy1wb3AtdXAtZXZlbnQtc2hpbmVzLXNwb3RsaWdodC1vbi1yZXNwb25zaWJsZS1yZWN5Y2xpbmctZm9yLXNpbmdsZS11c2UtdmFwZXMvNjg2MjA1LmFydGljbGXSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5jb252ZW5pZW5jZXN0b3JlLmNvLnVrL3lvdXItYnVzaW5lc3MvZWxmYmFycy1wb3AtdXAtZXZlbnQtc2hpbmVzLXNwb3RsaWdodC1vbi1yZXNwb25zaWJsZS1yZWN5Y2xpbmctZm9yLXNpbmdsZS11c2UtdmFwZXMvNjg2MjA1LmFydGljbGXSAQA?oc=5","id":"CBMikwFodHRwczovL3d3dy5jb252ZW5pZW5jZXN0b3JlLmNvLnVrL3lvdXItYnVzaW5lc3MvZWxmYmFycy1wb3AtdXAtZXZlbnQtc2hpbmVzLXNwb3RsaWdodC1vbi1yZXNwb25zaWJsZS1yZWN5Y2xpbmctZm9yLXNpbmdsZS11c2UtdmFwZXMvNjg2MjA1LmFydGljbGXSAQA","guidislink":false,"published":"Fri, 08 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=342, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5jb252ZW5pZW5jZXN0b3JlLmNvLnVrL3lvdXItYnVzaW5lc3MvZWxmYmFycy1wb3AtdXAtZXZlbnQtc2hpbmVzLXNwb3RsaWdodC1vbi1yZXNwb25zaWJsZS1yZWN5Y2xpbmctZm9yLXNpbmdsZS11c2UtdmFwZXMvNjg2MjA1LmFydGljbGXSAQA?oc=5\" target=\"_blank\">Elfbar's pop-up event shines spotlight on responsible recycling for single-use vapes<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Convenience Store<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Elfbar's pop-up event shines spotlight on responsible recycling for single-use vapes - Convenience Store","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5jb252ZW5pZW5jZXN0b3JlLmNvLnVrL3lvdXItYnVzaW5lc3MvZWxmYmFycy1wb3AtdXAtZXZlbnQtc2hpbmVzLXNwb3RsaWdodC1vbi1yZXNwb25zaWJsZS1yZWN5Y2xpbmctZm9yLXNpbmdsZS11c2UtdmFwZXMvNjg2MjA1LmFydGljbGXSAQA?oc=5\" target=\"_blank\">Elfbar's pop-up event shines spotlight on responsible recycling for single-use vapes<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Convenience Store<\/font>","source.href":"https:\/\/www.conveniencestore.co.uk","source.title":"Convenience Store","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Vape brand Elf Bar recently hosted a pop-up event in London centered around raising public awareness about the importance of recycling single-use vapes. The initiative was part of its GreenAwareness programme, which aims to promote responsible recycling practices. In a move to encourage vape take-back, the programme debuted in April this year and provides free recycling bins to retail and convenience stores. It comes after recent research by Material Focus found that five million single-use vapes are thrown away each week, with 73% of UK vapers admitting to throwing them away. The vape brand recently announced its partnership with the Scottish Grocer’s Federation (SGF) to roll out 1000 free vape recycling bins to SGF members. ElfBar claimed that the returns from the trial phases have been promising, with 80,000 in total since June from the initial 70 stores participating in the pilot. Speaking to Convenience Store, Chris Kader head of PR and communications at Elf Bar UK said: “As a wider part of the programme, it’s about investing and researching development and more recycling facilities. We’re looking at how vape and single-use products are instrumental as a smoking cessation tool and we have done research and 72% of ex-smokers and 56% of current smokers all agree that having single-use vapes is intrinsic to their journey to quit smoking.” The event showcased GreenAwareness recycling bins and unveils a conceptual single-use vape designed to simplify the dismantling process for recycling with easier battery separation. In addition, it displayed the programme’s progress in the collection, transportation and dismantling of single-use vapes and the future reuse of vapes. Eve Peters director of government affairs for the UK and spokesperson for Elf Bar commented on the programme: “All the external recycling waste partners we have engaged with, including Recover and TES, agree that single-use vapes are highly recyclable with many reusable components, including the battery. The pop-up is about letting the public know they can return their used vapes for recycling. “Recognising the thousands of existing vape recycling points across the UK available through the Material Focus recycling locator, we understand that millions of vapes are already undergoing collection for disassembly. GreenAwareness’ independent efforts complement this by advancing the recycling process for single-use vapes. “From this modest start, momentum is gaining as more bins arrive in retail and convenience stores across the UK. As the programme evolves, so will the development of supporting infrastructure to enhance single-use vape recycling throughout the chain. Battery test charging to determine suitability for further use and washing techniques to advance plastic reuse are already being conducted to amplify efforts.”","filter_flag":1}
