{"title":"Paris Rhône Energy to Showcase Green Energy Storage Solutions at RE+ 2023 - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3BhcmlzLXJob25lLWVuZXJneS10by1zaG93Y2FzZS1ncmVlbi1lbmVyZ3ktc3RvcmFnZS1zb2x1dGlvbnMtYXQtcmUtMjAyMy0zMDE5MTc1MTguaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3BhcmlzLXJob25lLWVuZXJneS10by1zaG93Y2FzZS1ncmVlbi1lbmVyZ3ktc3RvcmFnZS1zb2x1dGlvbnMtYXQtcmUtMjAyMy0zMDE5MTc1MTguaHRtbNIBAA?oc=5","id":"CBMigAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3BhcmlzLXJob25lLWVuZXJneS10by1zaG93Y2FzZS1ncmVlbi1lbmVyZ3ktc3RvcmFnZS1zb2x1dGlvbnMtYXQtcmUtMjAyMy0zMDE5MTc1MTguaHRtbNIBAA","guidislink":false,"published":"Tue, 05 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=248, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3BhcmlzLXJob25lLWVuZXJneS10by1zaG93Y2FzZS1ncmVlbi1lbmVyZ3ktc3RvcmFnZS1zb2x1dGlvbnMtYXQtcmUtMjAyMy0zMDE5MTc1MTguaHRtbNIBAA?oc=5\" target=\"_blank\">Paris Rhône Energy to Showcase Green Energy Storage Solutions at RE+ 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Paris Rhône Energy to Showcase Green Energy Storage Solutions at RE+ 2023 - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3BhcmlzLXJob25lLWVuZXJneS10by1zaG93Y2FzZS1ncmVlbi1lbmVyZ3ktc3RvcmFnZS1zb2x1dGlvbnMtYXQtcmUtMjAyMy0zMDE5MTc1MTguaHRtbNIBAA?oc=5\" target=\"_blank\">Paris Rhône Energy to Showcase Green Energy Storage Solutions at RE+ 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Conservation\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"When we venture towards a greener future, it's significant to highlight the promising role of Paris Rhône Energy. Paris Rhône Energy is a leading energy technology company that provides advanced power grid software solutions, backup and prime power systems for home and industrial applications, solar + battery storage solutions, virtual power plant platforms, and engine- and battery-powered tools and equipment. We are committed to sustainable, cleaner energy products poised to revolutionize the 21st-century electrical grid. As a leading provider of reliable energy products, we have driven productive transformations in power conservation. With the adoption of eco-friendly technologies, we empower individuals to pave the way toward a more sustainable life. Understanding Home Battery Storage Let's dive into the concept of energy storage systems in the following: 1. What Are Home Battery Storage Systems? Home battery storage systems are energy reservoirs designed to store surplus electricity generated by renewable sources such as solar energy. These innovative solutions allow homeowners to leverage surplus power during demand or emergencies. The primary purpose of storage batteries is to provide users optimal control over energy consumption and liberate them from traditional sources. Home battery storage systems enhance energy independence and promote sustainability. 2. How Home Battery Storage System Works with Renewable Energy Sources? The home battery solutions use renewable sources to build a dynamic energy ecosystem. Sometimes solar panels or wind turbines produce more power than the immediate demand. Instead of wasting the additional energy, the excess power is diverted to the batteries. This storage system efficiently upholds the surplus energy using advanced technologies like lithium-ion batteries. When renewables are not actively producing energy, these storage solutions are activated. They release the stored energy into the home electrical grid and meet your power requirements. 3. Advantages of Home Battery Storage for Homeowners & Environment Home battery storage offers a multitude of benefits for homeowners and the environment, making it a compelling choice for users. For example: 1) Energy Storage systems allow homeowners to power their homes with excess electricity during peak demand times. It enhances their energy independence, making them self-reliant. 2) This cutting-edge technology also offers financial benefits to homeowners. By tailoring the stored energy during peak hours, you can avoid high electricity rates and embrace cost savings. 3) An efficient backup source during power outages, blackouts, or emergencies. 4) As the storage battery systems encourage using clean energy, they help mitigate greenhouse emissions and create a more sustainable future. 5) The battery storage systems integrate eco-friendly technologies that contribute to lightening the impact of climate change and protecting our environment. 6) It also helps in stabilizing the electrical grid. The batteries manage the impact on the power grid and handle the variations in renewable electricity output. During peak consumption, the stored energy is deployed to alleviate the strain on the main electricity grid. Paris Rhône Energy Is Going to Attend RE+ 2023 RE+ 2023 is one of the largest solar shows that sets opportunities to present the latest advancements in renewable energy technologies. The event brings together a broad alliance of industry peers to share their sustainable energy solutions and expertise. As a leading manufacturer in the energy sector, we are going to attend this excellent platform. RE+ 2023 will allow Paris Rhône Energy to showcase its innovative technology to foster sustainability on a global scale. 1. Exhibitor Information Paris Rhône Energy is all geared up to participate in the upcoming event at the Sands Expo convention center, 201 Sands Ave, Las Vegas, NV, from 11th-14th Sept. The exhibition is held by Solar Energy Industries Association and Solar Energy Power Association. We will be on Sands level 2 and booth number 5140. Don't forget to visit us and unlock the new tools in the renewable sector. 2. Exhibitor Products All-in-one ESS At the event, we will present our innovative range of eco-conscious products. We are excited to exhibit our All-in-one energy storage system: HESS-PEX-SERIES. The other details are in the following. EV Charger Our EV charging solutions align with our commitment to eco-friendliness. By offering a cleaner solution for charging electric vehicles, we contribute towards reducing greenhouse emissions. Battery Storage System Our all-in-one home energy storage system allows homeowners to store surplus renewable power and optimize energy consumption. Balcony Battery We are excited to display our balcony battery which is creatively designed for SOC. Its space-saving design, DIY installation, and high power make it an ideal choice for homeowners. BYD Blade Battery Storage BYD blade battery storage integrates an intelligent management system. Its ultra-thin and sleek design makes it an easy-to-operate solar battery for home use. Being energy efficient, it contributes toward the conservation of renewable power. Paris Rhône Energy's All-in-One ESS Ready to invest in reliable energy storage systems? Look no further than all-in-one ESS from Paris Rhône Energy. We offer an all-in-one home energy storage system to enhance your energy independence. Our all-in-one home energy storage system has the following advantages: 10-year long warranty Expandable capacity of 10.24kwh-76.8kwh Energy efficiency and reduced carbon footprint Fast recharging in 1.5 hours Smart monitoring control Moreover, we will launch our new product, HESS-PEX-SERIES, at the exhibition, bringing you a brand new experience. Please look forward to it! Commitment to Energy Efficiency and Conservation All the products in our All-in-One ESS series prioritize energy efficiency. Optimizing your energy usage helps to maximize the utilization of stored energy. We have adopted intelligent technologies to minimize energy loss and contribute to energy conservation. This translates to significantly minimized power wastage, rendering it an optimal choice for both residential and industrial consumers. Conclusion In short, sustainable home battery solutions pledges a greener future. If you're looking to invest in energy-efficient products, connect with Paris Rhône Energy. We have been a portable power station supplier since 1915. Our sustainable practices have fostered clean energy adoption and made a positive impact on the environment. If you also attach great importance to these aspects, then come to our booth for detailed information! For more information, please visit https:\/\/www.energyparisrhone.com Find Paris Rhône Energy: Facebook: https:\/\/www.facebook.com\/ParisRhoneEnergy Instagram: https:\/\/www.instagram.com\/ ParisRhoneEnergy Twitter: https:\/\/twitter.com\/ParisRhoneEnergy Linkedin: https:\/\/www.linkedin.com\/company\/87128055\/ YouTube: https:\/\/www.youtube.com\/@ParisRhone_Energy\/featured SOURCE Paris Rhône Energy","filter_flag":1}
{"title":"Biden uses executive power to create a New Deal-style American Climate Corps - The Associated Press","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2JpZGVuLWNsaW1hdGUtY29ycHMtY29uc2VydmF0aW9uLWdyZWVuLW5ldy1kZWFsLWQxZWEwZTIxOGM4NzU0YjkwZjg0NDZhZDU3YWVkNjg50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2JpZGVuLWNsaW1hdGUtY29ycHMtY29uc2VydmF0aW9uLWdyZWVuLW5ldy1kZWFsLWQxZWEwZTIxOGM4NzU0YjkwZjg0NDZhZDU3YWVkNjg50gEA?oc=5","id":"CBMia2h0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2JpZGVuLWNsaW1hdGUtY29ycHMtY29uc2VydmF0aW9uLWdyZWVuLW5ldy1kZWFsLWQxZWEwZTIxOGM4NzU0YjkwZjg0NDZhZDU3YWVkNjg50gEA","guidislink":false,"published":"Wed, 20 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=263, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2JpZGVuLWNsaW1hdGUtY29ycHMtY29uc2VydmF0aW9uLWdyZWVuLW5ldy1kZWFsLWQxZWEwZTIxOGM4NzU0YjkwZjg0NDZhZDU3YWVkNjg50gEA?oc=5\" target=\"_blank\">Biden uses executive power to create a New Deal-style American Climate Corps<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Associated Press<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Biden uses executive power to create a New Deal-style American Climate Corps - The Associated Press","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2JpZGVuLWNsaW1hdGUtY29ycHMtY29uc2VydmF0aW9uLWdyZWVuLW5ldy1kZWFsLWQxZWEwZTIxOGM4NzU0YjkwZjg0NDZhZDU3YWVkNjg50gEA?oc=5\" target=\"_blank\">Biden uses executive power to create a New Deal-style American Climate Corps<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Associated Press<\/font>","source.href":"https:\/\/apnews.com","source.title":"The Associated Press","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Conservation\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"WASHINGTON (AP) — After being thwarted by Congress, President Joe Biden will use his executive authority to create a New Deal-style American Climate Corps that will serve as a major green jobs training program. In an announcement Wednesday, the White House said the program will employ more than 20,000 young adults who will build trails, plant trees, help install solar panels and do other work to boost conservation and help prevent catastrophic wildfires. The climate corps had been proposed in early versions of the sweeping climate law approved last year but was jettisoned amid strong opposition from Republicans and concerns about cost. Democrats and environmental advocacy groups never gave up on the plan and pushed Biden in recent weeks to issue an executive order authorizing what the White House now calls the American Climate Corps. “After years of demonstrating and fighting for a Climate Corps, we turned a generational rallying cry into a real jobs program that will put a new generation to work stopping the climate crisis,’' said Varshini Prakash, executive director of the Sunrise Movement, an environmental group that has led the push for a climate corps. With the new corps “and the historic climate investments won by our broader movement, the path towards a Green New Deal is beginning to become visible,’' Prakash said, referring to a comprehensive jobs-and-climate plan supported by many activists and some Democrats but ridiculed by Republicans as a socialist nightmare that would raise taxes and hamper the economy. Prakash, a frequent Biden critic, participated in a White House call on Tuesday promoting the new job corps, which comes as Biden tries to strengthen his appeal to young voters in the 2024 presidential campaign. The Sunrise Movement and other climate activists, including many young adults, were outraged this spring after Biden approved the huge Willow oil-drilling project in Alaska. Opponents say the project and others approved by Biden put his climate legacy at risk and are a breach of his 2020 campaign promise to stop new oil drilling on federal lands. Those concerns were put aside, for now, as environmental activists hailed the new jobs program, which is modeled after the Civilian Conservation Corps, created in the 1930s by President Franklin D. Roosevelt, a Democrat, as part of the New Deal. “Young people nationwide are excited to see the launch of the American Climate Corps, enhancing career pathways in clean energy, conservation and climate resilience,’' said Cristina Tzintzún Ramirez, president of NextGen America, an organization that promotes education, registration and mobilization for voters age 18 to 35. “Young people are fighting for climate justice every day in their community, and now they have even more opportunity to continue this fight in their careers,’' Ramirez said. More than 50 Democratic lawmakers, including Massachusetts Sen. Ed Markey and New York Rep. Alexandria Ocasio-Cortez, had also encouraged Biden to create a climate corps, saying in a letter on Monday that “the climate crisis demands a whole-of-government response at an unprecedented scale.’' The lawmakers cited deadly heat waves in the Southwest and across the nation, as well as dangerous floods in New England and devastating wildfires on the Hawaiian island of Maui, among recent examples of climate-related disasters. Democrats called creation of the climate corps “historic” and a key step toward fulfilling the vision of the Green New Deal. “Today President Biden listened to the (environmental) movement, and he delivered with an American Climate Corps,’' a beaming Markey said at a celebratory news conference outside the Capitol. “We are starting to turn the green dream into a green reality,’' added Ocasio-Cortez, who co-sponsored the Green New Deal legislation with Markey four years ago. “You all are changing the world,’' she told young activists. The White House declined to say how much the program will cost or how it will be paid for, but Markey and other Democrats said money from the climate law and the 2021 infrastructure law would serve as a “down payment” for thousands of jobs. Republicans have largely dismissed the climate corps as a do-gooder proposal that would waste money and could even take jobs away from other workers displaced by the COVID-19 pandemic. “We don’t need another FDR program, and the idea that this is going to help land management is a false idea as well,” Arkansas Rep. Bruce Westerman, chairman of the House Natural Resources Committee, said in 2021. Rep. Joe Neguse, a Colorado Democrat, said the program should pay “a living wage” while offering health care coverage and other benefits. A key distinction between the original Civilian Conservation Corps and the new climate contingent is that, unlike the 1930s, the U.S. economy is not in an economic depression. The U.S. unemployment rate was 3.8% in August, low by historical measures. The new corps is also likely to be far more diverse than the largely white and male force created 90 years ago. White House climate adviser Ali Zaidi said the administration will work with at least six federal agencies to create the climate corps and will pair with at least 10 states. California, Colorado, Maine, Michigan and Washington have already begun similar programs, while five more are launching their own climate corps, Zaidi said: Arizona, Maryland, Minnesota, North Carolina and Utah. The initiative will provide job training and service opportunities to work on a wide range of projects, including restoring coastal wetlands to protect communities from storm surges and flooding; clean energy projects such as wind and solar power; managing forests to prevent catastrophic wildfires; and energy efficient solutions to cut energy bills for consumers, the White House said. Creation of the climate corps comes as the Environmental Protection Agency launches a $4.6 billion grant competition for states, municipalities and tribes to cut climate pollution and advance environmental justice. The Climate Pollution Reduction Grants are funded by the 2022 climate law and are intended to drive community-driven solutions to slow climate change. EPA Administrator Michael Regan said the grants will help “communities so they can chart their own paths toward the clean energy future.” The deadline for states and municipalities to apply is April 1, with grants expected in late 2024. Tribes and territories must apply by May 1, with grants expected by early 2025.","filter_flag":1}
{"title":"Unlocking the Potential of Local Hydrogen: Fukushima's Quest - Denso","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LmRlbnNvLmNvbS9nbG9iYWwvZW4vZHJpdmVuLWJhc2UvcHJvamVjdC9uZXdzcGlja3NfaHlkcm9nZW4yL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LmRlbnNvLmNvbS9nbG9iYWwvZW4vZHJpdmVuLWJhc2UvcHJvamVjdC9uZXdzcGlja3NfaHlkcm9nZW4yL9IBAA?oc=5","id":"CBMiSGh0dHBzOi8vd3d3LmRlbnNvLmNvbS9nbG9iYWwvZW4vZHJpdmVuLWJhc2UvcHJvamVjdC9uZXdzcGlja3NfaHlkcm9nZW4yL9IBAA","guidislink":false,"published":"Fri, 08 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=251, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LmRlbnNvLmNvbS9nbG9iYWwvZW4vZHJpdmVuLWJhc2UvcHJvamVjdC9uZXdzcGlja3NfaHlkcm9nZW4yL9IBAA?oc=5\" target=\"_blank\">Unlocking the Potential of Local Hydrogen: Fukushima's Quest<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Denso<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Unlocking the Potential of Local Hydrogen: Fukushima's Quest - Denso","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LmRlbnNvLmNvbS9nbG9iYWwvZW4vZHJpdmVuLWJhc2UvcHJvamVjdC9uZXdzcGlja3NfaHlkcm9nZW4yL9IBAA?oc=5\" target=\"_blank\">Unlocking the Potential of Local Hydrogen: Fukushima's Quest<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Denso<\/font>","source.href":"https:\/\/www.denso.com","source.title":"Denso","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Conservation\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Carbon Neutrality, Factories First Achieving carbon neutrality by 2050—a bold ambition. By announcing this goal in October 2020, the Japanese government established a clear direction for the country, setting the wheels in motion. The task of eliminating CO₂ emissions quickly became a priority, shaping conversations across various industries. Decarbonization efforts are particularly crucial for Japan’s manufacturing industry, as it accounts for an estimated 40% of domestic CO₂ emissions. Given hydrogen’s potential to offset and eliminate emissions, the project underway at DENSO Fukushima since March is well-aligned with these efforts to create carbon-neutral factories. The goal is to use hydrogen to decarbonize plant operations first and foremost, and ultimately establish a model where locally-produced hydrogen is consumed within that region—a local energy system. This is how Kazuhiro Higuchi, a key member of Fukushima’s hydrogen-powered society project, describes the big picture behind the project currently underway there. Following a mid-career move to DENSO in 2003, Higuchi worked as head of software design and development for diesel-type engine control units (ECUs) prior to his 2011 assignment to DENSO Germany, where he was posted to promote the advanced development of diesel systems. Higuchi returned from his five-year post to pursue further development of these at DENSO, before moving to Toyota Motor Corporation in 2021. Currently, Higuchi is engaged in efforts to build a Fukushima-based model case for a hydrogen-powered society. Higuchi:“Until this point, factories at DENSO Fukushima have primarily relied on two sources of energy: grid-based electricity purchased from power suppliers and liquefied petroleum gas (LPG). Both are derived from fossil fuels, and both emit CO₂ during the process of generation and use. In this context, our decarbonization efforts have emphasized four key approaches. “ The first approach involves energy conservation efforts: energy used in factories is charted to help identify and reduce wasteful energy consumption patterns. The next step is to produce more renewable energy on-site. DENSO Fukushima already has a number of solar and wind power facilities installed, with plans to produce even more electricity via their own solar panels in the near future. Renewable energy plays a key role in their third approach: a switch to renewable sources for the electricity supplied from the external grid. The fourth approach, meanwhile, focuses on hydrogen usage as a replacement for LPG to produce heat energy for manufacturing purposes. Among the various car components manufactured at DENSO Fukushima, heat exchangers (radiators) and air-conditioning modules use a particularly large amount of heat in their manufacturing process. As part of ongoing emission reduction efforts, a portion of this process will shift from gas-powered to electric furnaces, while hydrogen will replace LPG as fuel for the plant’s afterburner furnace*, which is used to detoxify plant emission gases. * Jointly developed with Chugai Ro Co, the afterburner furnace takes in the exhaust gases from industrial furnaces and re-ignites them to fully eliminate hydrocarbons, carbon monoxide, and other substances contained in them. By incorporating water electrolysis equipment developed by Toyota Motor Corporation based on the technology from its “MIRAI” fuel cell vehicle, the DENSO Fukushima plant looks to produce its own hydrogen locally. Higuchi:“Fuel cells produce electricity by combining hydrogen and oxygen, while water electrolysis produces hydrogen and oxygen. In other words, the reactions for the two processes are reversed, while the overall structure is essentially the same. By re-using the technology from “MIRAI” cars to create water electrolysis equipment and by standardizing the related materials and components, we think it might be possible to create a highly reliable system for hydrogen production at relatively low cost.\" he power generated on-site from renewable energy sources is used to produce “green” hydrogen*, with the resulting fuel also stored locally. This stored hydrogen is then supplied to the factory whenever the production lines need it. This means that all steps necessary for a full hydrogen supply chain—production, storage & transport, and usage—can be established locally. If the current initiative proves successful, it will serve as a major step on the path to constructing a model case for a local energy system. * Green hydrogen is the term used for “clean” hydrogen produced from renewable energy sources such as solar and wind power, with no CO₂ emitted during the entire production process. A Sustainable Vision for Japan’s Manufacturing Industry A local energy system creates a cycle in which energy is produced and used locally. This not only helps to establish a steady and efficient power supply system, but it could also do much more—it has the power to revitalize local economies and communities. In the aftermath of the 2011 Great East Japan Earthquake, Fukushima Prefecture launched a tentpole project to support ongoing reconstruction and recovery efforts. Designed to pave the way for the region's long-term plans, the “Fukushima Plan for a New Energy Society” looks to harness the potential of renewable energy to create a new launchpad for industry growth. The prefecture has consistently led the way in efforts towards establishing a hydrogen-powered society. Since June 2021, Fukushima Prefecture and Toyota Motor Corporation have been working together to establish the groundwork for a new city development model based on hydrogen technology from Fukushima. Developments like these indicate that the sentiment towards broader hydrogen usage is definitely building. We asked DENSO’s veteran Hiroki Tarui about his experience of applying the company’s core production technology in new fields, and what he finds most rewarding about the process. Tarui:“As a Fukushima-based unit of the Toyota Group, I feel that our team has been given a mission—to develop the systems and technology necessary for creating a hydrogen-powered society here, before sharing that on a global scale. This is a very challenging initiative, and everyone involved in the project is highly motivated to see it succeed.” These tests to create a carbon-neutral factory stand as a major milestone on the road to a hydrogen-based local energy system. Mitsuhiro Ando, who is working with local businesses to establish a regional hydrogen supply chain, makes one thing clear: a sustainable future for Japan's manufacturing industry hinges on factory decarbonization. Ando:“Achieving carbon neutrality for factories is about safeguarding the future of our manufacturing industry.There was a time when manufacturing was all about making good-quality products at a low price. But times have changed. Now, suppliers need to prove that they’re working to reduce GHG emissions—those who can't meet these standards risk being left out of the supply chain completely. For manufacturers, carbon neutrality is essentially becoming the price of admission to the business world these days. If they aren't reducing their carbon footprint, they could soon find themselves unable to sell their products—simple as that. That's why we're striving to create a model case for carbon-neutral factories here and then extend it across Japan. It's our way of doing our part to protect our country's manufacturing in the long run.” The greater significance of this demonstration project is also not lost on Masashi Koizumi, who is a coordinator for the Fukushima hydrogen project, working with municipal groups and local companies. Koizumi:“Local companies here in Fukushima share an acute awareness of the need to adapt, understanding that sticking to established practices today threatens their ability to manufacture in the future. They understand the urgency but just don't know what concrete steps they should be taking. That's why we aim to keep our tests and their outcomes as open as possible, to share the technology and resulting insights with the community. But the efforts of a single company are simply not enough when it comes to establishing a local energy system. We recognize the importance of collaboration with local businesses, government, and other stakeholders. We would like to forge strong alliances and build a collective force to tackle this challenge together.” Finding the Best Fit for Hydrogen The prospect of locally-produced hydrogen for local consumption holds promise to deliver a significant and far-reaching impact on both Japanese society and industry, if realized. However, the journey to this goal isn’t without hurdles—there are numerous challenges to surmount, from technical issues to cost-related concerns. On top of this, making hydrogen a part of everyday life will require finding the most effective applications for it is another tough task. Higuchi:“For instance, at our DENSO Fukushima plant, we don’t use a lot of heat energy, so we can easily replace it with hydrogen produced by our own electrolysis equipment. However, other factories out there may require much larger amounts of heat. So, the question arises—can these energy-intensive factories truly benefit from using hydrogen? And if so, can DENSO Fukushima’s model be applied to them too, or should other approaches be considered? Success at our own plant isn’t the end goal. We need to identify how to use hydrogen across a variety of potential use cases. Without it, we can’t roll out this local hydrogen energy model to other manufacturing sites. As I mentioned previously, many local companies are interested in using hydrogen to decarbonize their operations. By exchanging information and connecting with them, we're gaining insights into the realities of their production processes, working together to identify issues they might face in adopting hydrogen use.” While hydrogen boasts many advantages as an energy source, it isn’t necessarily suited to replace all other options. The truth is that even in some of this project’s test facilities, the furnaces used for heating certain products are powered by renewable energy sources rather than hydrogen. Why? Because in some cases, it's actually better to directly use clean electricity when it's needed. Higuchi:“Yes, you can make hydrogen by electrolyzing water, and you can generate electricity by reacting hydrogen with oxygen, as I mentioned earlier. But if something is powered by electricity in the first place, it’d be wasteful energy-wise to first use electricity to create hydrogen and then convert that hydrogen back into electricity. In these situations, it's wiser to use electricity as it is. But electricity itself, unlike hydrogen, has a storage problem. Solar panels may produce a lot of electricity during long streaks of sunny days, but all that surplus energy ultimately goes to waste if you’re not using much of it immediately. Instead, what we could do is use that solar power to make hydrogen and store the surplus for another day. Then, when the days are shorter or when renewable energy is scarce, we can convert that stored hydrogen back into electricity. This is one way to fully leverage the advantages inherent to hydrogen.” We’re still in the early stages of making hydrogen power practical, with more questions than answers at this point. For that very reason, it’s important that we listen to the voices of those businesses and groups looking to embrace hydrogen, as they are the ultimate users. Through this, we can figure out how hydrogen can truly serve society. A Global Vision for Fukushima’s Local Energy Model Fukushima’s tests of carbon-neutral factory operations are just getting off the ground, but they are already attracting significant local interest. From executives at major corporations to small-town factory owners, a steady stream of visitors tour the site daily, highlighting the high expectations for hydrogen use in Fukushima. Koizumi:“We’re currently working with 30 or so local companies to develop social applications and test potential implementations. Fukushima's business leaders have a sincere desire to revitalize their local industries. From their perspective, obstacles still remain on the long path of recovery and reconstruction—but they believe that if the hydrogen industry flourishes in Fukushima, it could halt the exodus of young residents and breathe new life into local communities. For some, building a society powered by hydrogen isn’t a matter of generating profit for their company, but securing a foundation for life in Fukushima for future generations. That heartfelt sentiment has cemented my belief in the great value of this project, and our collective responsibility to contribute towards the creation of new industries and employment opportunities throughout the prefecture.” Should efforts to implement a hydrogen-based local energy model succeed in Fukushima, it would pave the way for extending this approach nationwide. Fukushima Prefecture and Toyota Motor Corporation have declared intentions to collaborate on finding hydrogen applications in society. Their ambitious plans involve first targeting cities with populations of around 300,000 to create a model for a hydrogen-inclusive lifestyle, and then rolling out this model in similarly-sized cities throughout Japan. Fukushima prefecture is home to three such cities—Fukushima, Koriyama, and Iwaki—where initial efforts for social implementation will be focused, with further regional expansion to follow. Beyond that, they're envisioning a bright future where Japanese hydrogen technology and the local production-consumption model can be shared with the rest of the world. Higuchi:“If Japan manages to quickly assemble the technology and equipment necessary for a hydrogen-based society and then export them, it could shine a spotlight on the power of Japanese manufacturing globally. If hydrogen starts being produced around the world using Japanese equipment, our country could become a world leader in the energy sector, and perhaps even gain an edge in terms of national energy security.” From a local initiative in Fukushima, to a nationwide endeavor in Japan, and finally a global movement—the unfolding story of this local hydrogen production and consumption project is too fascinating to miss, packed with the potential to reshape our future. Writer: Yuka Tsukada Photographer: Yuki Amakura Designer: Kirika Kosuzu Editor: Fumiya Kimiwada This article is based on a Japanese article produced by NewsPicks Brand Design and published by DENSO with permission.","filter_flag":1}
{"title":"CECO Environmental Raises Full Year 2023 Outlook, Announces Acquisition of Kemco Systems, a Leader in Industrial ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi2AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2NlY28tZW52aXJvbm1lbnRhbC1yYWlzZXMtZnVsbC15ZWFyLTIwMjMtb3V0bG9vay1hbm5vdW5jZXMtYWNxdWlzaXRpb24tb2Yta2VtY28tc3lzdGVtcy1hLWxlYWRlci1pbi1pbmR1c3RyaWFsLXdhdGVyLXJlY3ljbGluZy1hbmQtZW5lcmd5LWNvbnNlcnZhdGlvbi1zb2x1dGlvbnMtMzAxOTI1ODYwLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi2AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2NlY28tZW52aXJvbm1lbnRhbC1yYWlzZXMtZnVsbC15ZWFyLTIwMjMtb3V0bG9vay1hbm5vdW5jZXMtYWNxdWlzaXRpb24tb2Yta2VtY28tc3lzdGVtcy1hLWxlYWRlci1pbi1pbmR1c3RyaWFsLXdhdGVyLXJlY3ljbGluZy1hbmQtZW5lcmd5LWNvbnNlcnZhdGlvbi1zb2x1dGlvbnMtMzAxOTI1ODYwLmh0bWzSAQA?oc=5","id":"CBMi2AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2NlY28tZW52aXJvbm1lbnRhbC1yYWlzZXMtZnVsbC15ZWFyLTIwMjMtb3V0bG9vay1hbm5vdW5jZXMtYWNxdWlzaXRpb24tb2Yta2VtY28tc3lzdGVtcy1hLWxlYWRlci1pbi1pbmR1c3RyaWFsLXdhdGVyLXJlY3ljbGluZy1hbmQtZW5lcmd5LWNvbnNlcnZhdGlvbi1zb2x1dGlvbnMtMzAxOTI1ODYwLmh0bWzSAQA","guidislink":false,"published":"Wed, 13 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=256, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi2AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2NlY28tZW52aXJvbm1lbnRhbC1yYWlzZXMtZnVsbC15ZWFyLTIwMjMtb3V0bG9vay1hbm5vdW5jZXMtYWNxdWlzaXRpb24tb2Yta2VtY28tc3lzdGVtcy1hLWxlYWRlci1pbi1pbmR1c3RyaWFsLXdhdGVyLXJlY3ljbGluZy1hbmQtZW5lcmd5LWNvbnNlcnZhdGlvbi1zb2x1dGlvbnMtMzAxOTI1ODYwLmh0bWzSAQA?oc=5\" target=\"_blank\">CECO Environmental Raises Full Year 2023 Outlook, Announces Acquisition of Kemco Systems, a Leader in Industrial ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CECO Environmental Raises Full Year 2023 Outlook, Announces Acquisition of Kemco Systems, a Leader in Industrial ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi2AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2NlY28tZW52aXJvbm1lbnRhbC1yYWlzZXMtZnVsbC15ZWFyLTIwMjMtb3V0bG9vay1hbm5vdW5jZXMtYWNxdWlzaXRpb24tb2Yta2VtY28tc3lzdGVtcy1hLWxlYWRlci1pbi1pbmR1c3RyaWFsLXdhdGVyLXJlY3ljbGluZy1hbmQtZW5lcmd5LWNvbnNlcnZhdGlvbi1zb2x1dGlvbnMtMzAxOTI1ODYwLmh0bWzSAQA?oc=5\" target=\"_blank\">CECO Environmental Raises Full Year 2023 Outlook, Announces Acquisition of Kemco Systems, a Leader in Industrial ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Conservation\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"DALLAS, Sept. 13, 2023 \/PRNewswire\/ -- CECO Environmental Corp. (Nasdaq: CECO) (\"CECO\"), a leading environmentally focused, diversified industrial company whose solutions protect people, the environment, and industrial equipment, today announced that on Aug. 23, 2023, it completed the acquisition of Kemco Systems, Co. LLC (Kemco), a Florida-based company that specializes in the design, manufacturing and support of custom-engineered industrial water recycling and energy conservation solutions for North American industrial markets. Following the acquisition, the Company announced it has raised its full-year 2023 outlook for revenue and EBITDA. Kemco Acquisition Kemco, founded in 1969, marks the third acquisition for CECO during 2023, and a continuation of CECO's steady execution of its programmatic M&A strategy. The Kemco acquisition enhances CECO's North American presence, extending the Company's industrial water and wastewater treatment applications reach, adding new energy conservation and water recycling solutions, and expanding the addressable market into new high-value food processing, commercial laundry, and ready-mix concrete customer segments and end markets. Kemco generated full-year 2022 revenues of approximately $22 million and advances the Company's stated goals of owning differentiated engineered solutions businesses with niche leadership positions and more short-cycle and aftermarket revenue. \"I am excited to welcome the Kemco team to CECO and confident that the combination will open new growth opportunities across attractive industrial water markets. The acquisition of Kemco is another important and strategic step to build upon our already strong and diversified industrial water capabilities, which we have been building with tremendous organic growth execution and the acquisitions of Compass Water, Index Water, DS21, and General Rubber,\" said Todd Gleason, Chief Executive Officer, CECO Environmental. \"Kemco has a tremendous reputation with its strong, blue-chip customer base and an installed base of more than 7,000 systems. When combined with our focused investment programs, we expect to add additional market-leading solutions and capabilities to further solve critical customer problems while delivering sustainable growth.\" Added Gleason, \"While this acquisition helps expand our North American presence in the water and wastewater treatment market, CECO also has the opportunity to introduce these water recycling and energy conservation solutions globally as a new offering, especially in regions we already serve where companies are seeking ways to reduce water usage, recycle their wastewater streams, and conserve energy.\" Kemco's leadership team will remain to drive the business and work across CECO's other industrial water businesses to maximize solution selling and services. \"We are excited to join a company that is so well aligned with our mission of helping customers solve their water and energy challenges, and we expect to enhance our value delivery to customers seeking to reduce their environmental footprint while improving their profitability,\" said Tom Vanden Heuvel, Vice President and General Manager of Kemco Systems. \"Working with a group that is placing a greater emphasis on closing the water loop was an important element of our decision-making process. With CECO, we believe our customers will feel the difference that a bigger team with global reach and a broader technology base has to offer.\" Janney Montgomery Scott LLC and McDermott, Will & Emery, LLP served as advisors to Kemco for this transaction. Company Raises Full Year 2023 Outlook The Company increased its full year 2023 outlook to reflect revenues forecasted to be at least $525 million, up approximately 24 percent year over year. The Company also updated its expected full year 2023 adjusted EBITDA forecasted to be at least $55 million, up approximately 30 percent year over year. The updated expected full year revenue and adjusted EBITDA guidance compares to the previous outlook, provided in August, of revenues of between $500 and $525 million and adjusted EBITDA of between $50 and $55 million. \"The combination of our continued strong execution in healthy industrial markets and growing backlog, coupled with the acquisition of Kemco Systems, gives us added visibility and bolsters our confidence in our full year growth and profitability,\" stated Gleason. \"We continue to steadily transform CECO and create a high-performance industrial growth company. The acquisitions we have completed over the past 24 months continue to deliver performance at or above the high-growth financials associated with each transaction, which helps CECO to advance leadership positions in Industrial Air, Industrial Water and the Energy Transition markets.\" ABOUT CECO ENVIRONMENTAL CECO Environmental is a leading environmentally focused, diversified industrial company, serving a broad landscape of industrial air, industrial water and energy transition markets across the globe through its key business segments: Engineered Systems and Industrial Process Solutions. Providing innovative technology and application expertise, CECO helps companies grow their business with safe, clean, and more efficient solutions that help protect people, the environment and industrial equipment. In regions around the world, CECO works to improve air quality, optimize the energy value chain, and provide custom solutions for applications including power generation, petrochemical processing, general industrial, refining, midstream oil and gas, electric vehicle production, poly silicon fabrication, battery recycling, beverage can, and water\/wastewater treatment along with a wide range of other applications. CECO is listed on Nasdaq under the ticker symbol \"CECO.\" Incorporated in 1966, CECO's global headquarters is in Dallas, Texas. For more information, please visit www.cecoenviro.com. ABOUT KEMCO SYSTEMS Since 1969, Clearwater, Florida-based Kemco Systems has delivered more than 7,000 systems worldwide for industrial Water Reuse\/Recycle, Wastewater Treatment, Wastewater Filtration, Efficient Hot Water Heating, High-Pressure Pumping, Wastewater Heat Recovery, Stack Heat Recovery, Water Chilling, Vapor\/Steam Curing and Conditioning, and Total System Monitoring. Kemco's systems are built to the highest standards for the most challenging conditions and offer exceptional reliability, outstanding quality and top value for its client's energy dollar. Learn more about Kemco's solutions and experience at https:\/\/www.kemcosystems.com. SAFE HARBOR STATEMENT Any statements contained in this Press Release, other than statements of historical fact, including statements about management's beliefs and expectations, are forward-looking statements and should be evaluated as such. These statements are made on the basis of management's views and assumptions regarding future events and business performance and include, but are not limited to, statements regarding CECO's full year 2023 outlook, statements about CECO's expectations regarding the integration of Kemco Systems, Co. LLC, into CECO; the benefits of the acquisition of Kemco Systems, Co. LLC, and the expectations regarding the transaction's impact on CECO's strategic growth plan. We use words such as \"believe,\" \"expect,\" \"anticipate,\" \"intends,\" \"estimate,\" \"forecast,\" \"project,\" \"will,\" \"plan,\" \"should\" and similar expressions to identify forward-looking statements. Forward-looking statements involve risks and uncertainties that may cause actual results to differ materially from any future results, performance or achievements expressed or implied by such statements. Potential risks and uncertainties that could cause actual results to differ materially include risks regarding the achievement of the anticipated benefits of the acquisition, our ability to successfully integrate acquired businesses and realize the synergies from acquisitions, as well as a number of factors related to our business, including the sensitivity of our business to economic and financial market conditions generally and economic conditions in our service areas; dependence on fixed price contracts and the risks associated therewith, including actual costs exceeding estimates and method of accounting for revenue; the effect of growth on our infrastructure, resources, and existing sales; the ability to expand operations in both new and existing markets; the potential for contract delay or cancellation as a result of on-going or worsening supply chain challenges; liabilities arising from faulty services or products that could result in significant professional or product liability, warranty, or other claims; changes in or developments with respect to any litigation or investigation; failure to meet timely completion or performance standards that could result in higher cost and reduced profits or, in some cases, losses on projects; the potential for fluctuations in prices for manufactured components and raw materials, including as a result of tariffs and surcharges, and rising energy costs; inflationary pressures relating to rising raw material costs and the cost of labor; the substantial amount of debt incurred in connection with our strategic transactions and our ability to repay or refinance it or incur additional debt in the future; the impact of federal, state or local government regulations; our ability to repurchase shares of our common stock and the amounts and timing of repurchases, if any; our ability to successfully realize the expected benefits of our restructuring program; our ability to successfully integrate acquired businesses and realize the synergies from strategic transactions; the unpredictability and severity of catastrophic events, including cyber security threats, acts of terrorism or outbreak of war or hostilities or public health crises, as well as management's response to any of the aforementioned factors; and our ability to remediate our material weakness, or any other material weakness that we may identify in the future that could result in material misstatements in our financial statements. Additional risks and uncertainties are discussed under \"Part I – Item 1A. Risk Factors\" of the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2022 and may be included in subsequently filed Quarterly Reports on Form 10-Q. Many of these risks are beyond management's ability to control or predict. Should one or more of these risks or uncertainties materialize, or should the assumptions prove incorrect, actual results may vary in material aspects from those currently anticipated. Investors are cautioned not to place undue reliance on such forward-looking statements as they speak only to our views as of the date the statement is made. Except as required under the federal securities laws or the rules and regulations of the Securities and Exchange Commission, we undertake no obligation to update or review any forward-looking statements, whether as a result of new information, future events or otherwise. NOTE REGARDING NON-GAAP FINANCIAL MEASURES CECO is providing certain non-GAAP historical financial measures as presented above as we believe that these figures are helpful in allowing individuals to better assess the ongoing nature of CECO's core operations. A \"non-GAAP financial measure\" is a numerical measure of a company's historical financial performance that excludes amounts that are included in the most directly comparable measure calculated and presented in accordance with GAAP. Adjusted EBITDA, as we present it in the financial data included in this press release, has been adjusted to exclude the effects of amortization expenses for acquisition-related intangible assets, contingent retention and earnout expenses, restructuring expenses primarily relating to severance and legal expenses, acquisition and integration expenses which include retention, legal, accounting, banking, and other expenses, foreign currency remeasurement and other nonrecurring or infrequent items and the associated tax benefit of these items. Management believes that these items are not necessarily indicative of the Company's ongoing operations and their exclusion provides individuals with additional information to better compare the Company's results over multiple periods. Management utilizes this information to evaluate its ongoing financial performance. Our financial statements may continue to be affected by items similar to those excluded in the non-GAAP adjustments described above, and exclusion of these items from our non-GAAP financial measures should not be construed as an inference that all such costs are unusual or infrequent. Adjusted EBITDA is not calculated in accordance with GAAP, and should be considered supplemental to, and not as a substitute for, or superior to, financial measures calculated in accordance with GAAP. Non-GAAP financial measures have limitations in that they do not reflect all of the costs associated with the operations of our business as determined in accordance with GAAP. As a result, you should not consider these measures in isolation or as a substitute for analysis of CECO's results as reported under GAAP. Additionally, CECO cautions investors that non-GAAP financial measures used by the Company may not be comparable to similarly titled measures of other companies. Non-GAAP measures presented on a forward-looking basis are not reconciled to the comparable GAAP financial measures because the reconciliation could not be performed without unreasonable efforts. The GAAP measures are not accessible on a forward-looking basis because we are currently unable to predict with a reasonable degree of certainty the type and extent of certain items that would be expected to impact GAAP measures for these periods but would not impact the non-GAAP measures. Such items may include amortization expenses for acquisition-related intangible assets, contingent retention and earnout expenses, restructuring expenses primarily relating to severance and legal expenses, acquisition and integration expenses which include retention, legal, accounting, banking, and other expenses, foreign currency remeasurement and other nonrecurring or infrequent items and the associated tax benefit of these items. The unavailable information could have a significant impact on our GAAP financial results. Company Contact : Peter Johansson, Chief Financial and Strategy Officer (888) 990-6670 Investor Relations Contact : Steven Hooser or Jean Marie Young Three Part Advisors 214-872-2710 [email protected] News Media : Kimberly Plaskett, Corporate Communications Director [email protected] SOURCE CECO Environmental Corp.","filter_flag":1}
{"title":"The Side of Huawei We Don't Know - The National Interest Online","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vbmF0aW9uYWxpbnRlcmVzdC5vcmcvYmxvZy90ZWNobGFuZC9zaWRlLWh1YXdlaS13ZS1kb24lRTIlODAlOTl0LWtub3ctMjA2Nzg5P3BhZ2U9MCUyQzHSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vbmF0aW9uYWxpbnRlcmVzdC5vcmcvYmxvZy90ZWNobGFuZC9zaWRlLWh1YXdlaS13ZS1kb24lRTIlODAlOTl0LWtub3ctMjA2Nzg5P3BhZ2U9MCUyQzHSAQA?oc=5","id":"CBMiXmh0dHBzOi8vbmF0aW9uYWxpbnRlcmVzdC5vcmcvYmxvZy90ZWNobGFuZC9zaWRlLWh1YXdlaS13ZS1kb24lRTIlODAlOTl0LWtub3ctMjA2Nzg5P3BhZ2U9MCUyQzHSAQA","guidislink":false,"published":"Mon, 11 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=254, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vbmF0aW9uYWxpbnRlcmVzdC5vcmcvYmxvZy90ZWNobGFuZC9zaWRlLWh1YXdlaS13ZS1kb24lRTIlODAlOTl0LWtub3ctMjA2Nzg5P3BhZ2U9MCUyQzHSAQA?oc=5\" target=\"_blank\">The Side of Huawei We Don't Know<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The National Interest Online<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Side of Huawei We Don't Know - The National Interest Online","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vbmF0aW9uYWxpbnRlcmVzdC5vcmcvYmxvZy90ZWNobGFuZC9zaWRlLWh1YXdlaS13ZS1kb24lRTIlODAlOTl0LWtub3ctMjA2Nzg5P3BhZ2U9MCUyQzHSAQA?oc=5\" target=\"_blank\">The Side of Huawei We Don't Know<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The National Interest Online<\/font>","source.href":"https:\/\/nationalinterest.org","source.title":"The National Interest Online","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Conservation\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"The participation of employees is also unique. All members of the supervisory board and board of directors are Huawei employees. It is also a requirement that shareholder representatives nominated to the board have contributed to the company and demonstrated the requisite leadership skills. A similar mindset of learning from different models was applied to succession planning and the establishment of its rotating co-chair system five years ago. Huawei places an emphasis on developing leaders within the company. To achieve the system it wanted, it studied different leadership structures from established companies with similar approaches, including family-founded companies. By retaining top talent, the company believes it can overcome the limitations of any one individual and provide checks and balances. Huawei presently has three rotating co-chairs. When co-chairs are off duty, they visit other countries, meet employees, learn about the business, and, importantly, have space and time to think, which is given a lot of emphasis. Huawei’s open worldview and its appreciation for other cultures are most dramatically reflected in its R&D campus in the city of Dongguan, nicknamed the “European city,” where 30,000 staff work in twelve different “villages” modeled after nine different European countries. Manicured gardens surround life-size replicas of the most famous cities and architecture in Europe, including the Palace of Versailles, Heidelberg Castle, Amsterdam, and Verona. Dotted across the villages are numerous restaurants and cafes, a reflection of Ren’s advocacy of coffee culture. There is also an electric train service so that no one needs to drive within the campus. The concept for the campus was conceived as part of a design competition and was selected for its uniqueness, setting it apart from the usual tech company or Chinese-inspired designs. The organization and its employees clearly continue to have an appreciation for promoting global culture exchanges and learning from non-Chinese models of success. Prominent observers have taken notice of this. A Commitment to Social Obligations and Making a Difference Many might be surprised to learn that Huawei considers sustainability to be an integral part of its business priorities. It has four sustainability strategies, all of which are aligned with its vision and mission: Digital Inclusion, Security and Trustworthiness, Environmental Protection, and Healthy and Harmonious Ecosystem. Each of these strategies is integrated with the company’s business and product development. For example, Huawei’s products and solutions are increasingly designed to help the business and their clients reduce energy consumption and CO2 emissions. While the company does release annual sustainability reports, these do not adhere to the typical Western ESG (environmental, social, and corporate governance) or CSR (corporate social responsibility) reporting. Similarly, the company does not place too much of an emphasis on philanthropy and has not set up a foundation or philanthropic arm. Instead, it invests in developing cost-effective and sustainable solutions using its technology and working with local and multilateral partners to achieve its objectives in countries where the needs are most critical. Consider TECH4ALL, the company’s long-term digital inclusion initiative, dedicated to producing innovative technologies and solutions that enable an inclusive and sustainable world. They have applied AI and cloud to learn the sound of endangered animals, rainforests, and wetlands, to remotely monitor and prevent illegal hunting and logging. This application has been used in many countries in Latin America and Europe and has the potential to be deployed in other fields. Another example is RuralStar. As part of its commitment to rural development and bridging the digital divide to boost development in remote areas, Huawei invested in innovating simpler and smaller technology for data transmission. The RuralStar solution allows a base station to be constructed on a simple pole instead of a dedicated tower, with low-power features that can be powered using six solar panels. RuralStar is widely recognized as one of the greenest and most cost-effective solutions available for remote and rural communities. Notably, the business decision to service rural areas comes at an estimated 30 percent reduction in profit margins compared with the traditional focus on high-density urban areas only. Globally, this technology services small villages of several thousand residents at a 70 percent cost reduction compared to traditional solutions. Following its first pilot in Ghana in 2017, over sixty countries have implemented RuralStar and over 50 million people in rural areas have benefited. As an example of how such projects are funded, in 2020 in Ghana, the Ministry of Communications and the Ghana Investment for Electronic Communications signed a financing agreement with Export-Import Bank of China for Huawei to deploy more than 2,000 RuralStar sites for Ghana to provide voice and data services for over 3.4 million people. Within its goal to drive digitalization, Huawei has also been consistently investing in green transformation. Beyond a significant increase in the use of renewable energy within their own operations (a 42.3 percent increase from 2020), an increased energy efficiency of their products is also an important metric in their innovation process. A company reports a 1.9 times increase in energy efficiency in their main products since 2019, which in turn helps their customers and industry partners reduce their carbon footprint. More broadly, Huawei’s digital power technology is being deployed and used in many solar farms globally. The idea is to manage watts with bits to help better produce clean energy and cut emissions. By the end of 2021, Huawei Digital Power had helped customers generate 482.9 billion kWh of green power and save about 14.2 billion kWh of electricity. These efforts have resulted in a reduction of nearly 230 million tons in CO2 emissions, equivalent to planting 320 million trees. The ability to choose to meet its social commitments and to take concrete steps towards realizing its corporate vision beyond the mission statements is relatively unique to Huawei. At a time when companies are striving to meet ESG goals and overcome the fundamental tension between short-term priorities and investments for sustainable growth, Huawei works to overcome such challenges by seeing its products and services as key enablers of sustainable development. It is committed to developing information and communications technologies for reducing carbon emissions, promoting renewable energy, and contributing to the circular economy. Huawei strives to promote energy conservation and emission reduction in its own operations and to use more renewable energy. This is possible to achieve due to internal consensus across the leadership team to make strategic choices aligned with their sustainability agenda, the desire to invest in long-term ambitions, and the capacity to innovate new products that allow them to achieve their sustainability goals. A Company That Isn’t Going Away Huawei’s success on the global stage, based upon excellence in delivering new innovations, demonstrates that China has much to teach the rest of the world. Yet this success came about via a strategy of openness and a willingness to learn from others. The company’s critics, scrambling to respond to recent developments, ought to take note. Chandran Nair is the founder and CEO of the Global Institute For Tomorrow (GIFT). He is the author of Dismantling Global White Privilege: Equity for a Post-Western World. Image: Shutterstock.","filter_flag":1}
{"title":"Azbil Aims to Provide Comfort-Enhanced Work Environments with Energy Savings | NIKKEI ESG Management Forum - 日経BP","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi82MC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi82MC_SAQA?oc=5","id":"CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi82MC_SAQA","guidislink":false,"published":"Fri, 08 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=251, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi82MC_SAQA?oc=5\" target=\"_blank\">Azbil Aims to Provide Comfort-Enhanced Work Environments with Energy Savings | NIKKEI ESG Management Forum<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">日経BP<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Azbil Aims to Provide Comfort-Enhanced Work Environments with Energy Savings | NIKKEI ESG Management Forum - 日経BP","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi82MC_SAQA?oc=5\" target=\"_blank\">Azbil Aims to Provide Comfort-Enhanced Work Environments with Energy Savings | NIKKEI ESG Management Forum<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">日経BP<\/font>","source.href":"https:\/\/project.nikkeibp.co.jp","source.title":"日経BP","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Conservation\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Energy efficiency in office buildings and factories is vital for countering global warming. In addition to reducing negative impact on the environment, companies must also endeavor to improve productivity, safety, and their workplace atmosphere. The continued development of measurement and control technology is essential for maximizing effective energy use, ensuring that it is possible to achieve both economic growth and the SDGs. Designing Comfort-Oriented Offices to Boost Productivity Augmented reality (AR) visualization of air volume flow from air conditioning vents to create spaces where each individual can feel comfortable (Fujisawa Technology Center new laboratory building) A next-generation air conditioning system is being demonstrated at a café-style workspace at the Azbil Corporation's Fujisawa Technology Center, located in Fujisawa, Kanagawa Prefecture, near Tokyo. One example of the new system's capabilities is that anyone feeling hot can simply use a smartphone app to adjust the airflow from the ceiling vent directed toward them. The lighting has a subtle blue tint in cool zones and orange in warm areas, making it easy to find a comfortable spot. Instead of uniform room temperature control, Azbil aims to create spaces where each person feels comfortable and where active communication flourishes. As a major manufacturer of monitoring and control equipment, the azbil Group operates across a range of fields, including building air conditioning, factory production systems, as well as gas and water utility meters. Since its founding in 1906, the Group has played a pivotal role in industrial modernization through total automation, following its ideal of \"liberating people from drudgery.\" In recent years its customers expect measures to conserve the environment, workplace and workstyle improvements, and advanced production methods. In response, Azbil has redefined its role as a provider of \"human-centered automation.\" In today's climate, business growth requires active adoption of the United Nations Sustainable Development Goals (SDGs), specifically through contributing to creating individual satisfaction and corporate growth. Valve maintenance is essential for stable plant operation. Azbil uses advanced digital technology to further improve valve diagnostic services. Improving productivity and workspace quality while holding energy usage to a reasonable level is easily said, but achieving the ideal balance is no trivial matter. In a large building there might be upward of 100,000 monitoring points, covering elements such as temperature, humidity, and atmospheric pressure. Azbil constantly keeps track of some 4,000 buildings across Japan. The accumulation of big data resulting from this work is analyzed and used in the development of new ideas and methods for saving energy and adding value. One example of this is keeping a constant eye on the enormous valves used at chemical plants through the use of cloud computing services to optimize assessments of ongoing real-time situations to know exactly when maintenance, replacement, and other work is needed. The Group is also working to upgrade its sensor functions while improving analysis capabilities through the use of artificial intelligence. Closely knit connections with its customers' workplaces are another direct link in contributing to the SDGs. Azbil can help clients combat global warming at each step along the way, from setting targets to providing, operating, and maintaining equipment. In 2021, Azbil helped its customers cut carbon dioxide emissions by a total of 2.94 million tons, roughly 160 times the Group's own emissions. The Group plans to extend reductions to 3.4 million tons by 2030, while also ensuring that all its products are designed to be recyclable. Reducing carbon dioxide emissions is an urgent matter that must be tackled across the entirety of the supply chain. For this reason, B2B companies are increasingly important for achieving a sustainable Earth.","filter_flag":1}
{"title":"Global Non-Ferrous Metals Market to Reach $1.5 Trillion by 2028, Driven by Increasing Automotive and Construction ... - GlobeNewswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMizgFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xNC8yNzQzMjgwLzI4MTI0L2VuL0dsb2JhbC1Ob24tRmVycm91cy1NZXRhbHMtTWFya2V0LXRvLVJlYWNoLTEtNS1UcmlsbGlvbi1ieS0yMDI4LURyaXZlbi1ieS1JbmNyZWFzaW5nLUF1dG9tb3RpdmUtYW5kLUNvbnN0cnVjdGlvbi1JbmR1c3RyeS1EZW1hbmQuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMizgFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xNC8yNzQzMjgwLzI4MTI0L2VuL0dsb2JhbC1Ob24tRmVycm91cy1NZXRhbHMtTWFya2V0LXRvLVJlYWNoLTEtNS1UcmlsbGlvbi1ieS0yMDI4LURyaXZlbi1ieS1JbmNyZWFzaW5nLUF1dG9tb3RpdmUtYW5kLUNvbnN0cnVjdGlvbi1JbmR1c3RyeS1EZW1hbmQuaHRtbNIBAA?oc=5","id":"CBMizgFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xNC8yNzQzMjgwLzI4MTI0L2VuL0dsb2JhbC1Ob24tRmVycm91cy1NZXRhbHMtTWFya2V0LXRvLVJlYWNoLTEtNS1UcmlsbGlvbi1ieS0yMDI4LURyaXZlbi1ieS1JbmNyZWFzaW5nLUF1dG9tb3RpdmUtYW5kLUNvbnN0cnVjdGlvbi1JbmR1c3RyeS1EZW1hbmQuaHRtbNIBAA","guidislink":false,"published":"Thu, 14 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=257, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMizgFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xNC8yNzQzMjgwLzI4MTI0L2VuL0dsb2JhbC1Ob24tRmVycm91cy1NZXRhbHMtTWFya2V0LXRvLVJlYWNoLTEtNS1UcmlsbGlvbi1ieS0yMDI4LURyaXZlbi1ieS1JbmNyZWFzaW5nLUF1dG9tb3RpdmUtYW5kLUNvbnN0cnVjdGlvbi1JbmR1c3RyeS1EZW1hbmQuaHRtbNIBAA?oc=5\" target=\"_blank\">Global Non-Ferrous Metals Market to Reach $1.5 Trillion by 2028, Driven by Increasing Automotive and Construction ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Global Non-Ferrous Metals Market to Reach $1.5 Trillion by 2028, Driven by Increasing Automotive and Construction ... - GlobeNewswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMizgFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xNC8yNzQzMjgwLzI4MTI0L2VuL0dsb2JhbC1Ob24tRmVycm91cy1NZXRhbHMtTWFya2V0LXRvLVJlYWNoLTEtNS1UcmlsbGlvbi1ieS0yMDI4LURyaXZlbi1ieS1JbmNyZWFzaW5nLUF1dG9tb3RpdmUtYW5kLUNvbnN0cnVjdGlvbi1JbmR1c3RyeS1EZW1hbmQuaHRtbNIBAA?oc=5\" target=\"_blank\">Global Non-Ferrous Metals Market to Reach $1.5 Trillion by 2028, Driven by Increasing Automotive and Construction ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","source.href":"https:\/\/www.globenewswire.com","source.title":"GlobeNewswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Conservation\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Dublin, Sept. 14, 2023 (GLOBE NEWSWIRE) -- The \"Non-Ferrous Metals Market by Type, Application, and Region 2023-2028\" report has been added to ResearchAndMarkets.com's offering. The global non-ferrous metals market reached a value of US$ 1,079 billion in 2022 and is expected to witness substantial growth in the coming years. The market is projected to reach US$ 1,459 billion by 2028, with a Compound Annual Growth Rate (CAGR) of 5.1% during the forecast period from 2023 to 2028. Non-ferrous metals refer to metallic substances that do not contain iron as their primary component. This category includes a wide range of metals such as aluminum, copper, lead, tin, nickel, titanium, zinc, and others. These metals are extensively used across various industries, including automotive, electronics, construction, aerospace, healthcare, and more. They are valued for their unique properties, including high corrosion resistance, low melting points, excellent thermal and electrical conductivity, ductility, and malleability. Non-ferrous metals are cost-effective, lightweight, readily available, and easy to recycle, making them environmentally friendly. Several factors, including increased utilization in the automotive and construction industries, advancements in coatings and treatments, a shift toward sustainable production and recycling methods, and growth in the electrical and electronics industry, are driving the growth of this market. Non-Ferrous Metals Market Trends: Automotive Industry Utilization: Non-ferrous metals play a vital role in the automotive industry, with applications ranging from body panels and engine components to electric vehicle (EV) components like battery packs. The growing adoption of non-ferrous metals in EVs is contributing to market growth. Construction Industry Demand: The construction industry is witnessing increased demand for non-ferrous metals in the manufacture of windows, doors, plumbing pipes, and structural materials like beams and columns, driving market expansion. Advanced Coatings and Treatments: Recent developments in surface coatings and treatments, such as electroplating and anodizing, enhance the corrosion and wear resistance of non-ferrous metal products, making them more attractive to various industries. Sustainable Production and Recycling: The adoption of sustainable production methods and recycling techniques not only reduces waste but also contributes to energy conservation, which is boosting the market's growth. Electrical and Electronics Industry: Non-ferrous metals are increasingly used in the electrical and electronics industry for manufacturing wires, connectors, transformers, and other components, further supporting market growth. Key Market Segmentation: The report offers a detailed analysis of key trends within each segment of the global non-ferrous metals market, along with forecasts for global, regional, and country-level markets from 2023 to 2028. The market is categorized based on type and application. Type Insights: Aluminum Copper Lead Tin Nickel Titanium Zinc Others Application Insights: Automobile Industry Electronic Power Industry Construction Industry Others Regional Insights: North America Europe Asia Pacific Latin America Middle East and Africa Competitive Landscape: The report offers a comprehensive analysis of the competitive landscape in the global non-ferrous metals market, featuring profiles of major companies such as Aditya Birla Group, Alcoa Corporation, Aluminum Corporation of China Limited, Anglo American plc, BHP, RUSAL (En+ Group MKPAO), Glencore Plc, Norilsk Nickel, Rio Tinto Group, Sumitomo Metal Mining Co. Ltd., Vale S.A., and more. Key Questions Answered: How has the global non-ferrous metals market performed, and what are the growth prospects? What are the key drivers, restraints, and opportunities in the market? Which regions and countries offer attractive market opportunities? What are the most promising types and applications in the non-ferrous metals market? Who are the major players in the global market, and what is the competitive landscape? How has the COVID-19 pandemic affected the non-ferrous metals market? What are the key sustainability initiatives and recycling practices in the industry? How is the adoption of non-ferrous metals changing in the automotive and construction sectors? What technological advancements are driving innovation in coatings and treatments for non-ferrous metals? What role do non-ferrous metals play in the growth of the electric vehicle (EV) market? Key Attributes: Report Attribute Details No. of Pages 148 Forecast Period 2022 - 2028 Estimated Market Value (USD) in 2022 $1079 Billion Forecasted Market Value (USD) by 2028 $1459 Billion Compound Annual Growth Rate 5.2% Regions Covered Global For more information about this report visit https:\/\/www.researchandmarkets.com\/r\/a09po0 About ResearchAndMarkets.com ResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends. Attachment","filter_flag":1}
{"title":"Navitas Debuts Next-gen GaNSafe Power Components - Eetasia.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmVldGFzaWEuY29tL25hdml0YXMtZGVidXRzLW5leHQtZ2VuLWdhbnNhZmUtcG93ZXItY29tcG9uZW50cy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmVldGFzaWEuY29tL25hdml0YXMtZGVidXRzLW5leHQtZ2VuLWdhbnNhZmUtcG93ZXItY29tcG9uZW50cy_SAQA?oc=5","id":"CBMiSWh0dHBzOi8vd3d3LmVldGFzaWEuY29tL25hdml0YXMtZGVidXRzLW5leHQtZ2VuLWdhbnNhZmUtcG93ZXItY29tcG9uZW50cy_SAQA","guidislink":false,"published":"Tue, 26 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=269, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmVldGFzaWEuY29tL25hdml0YXMtZGVidXRzLW5leHQtZ2VuLWdhbnNhZmUtcG93ZXItY29tcG9uZW50cy_SAQA?oc=5\" target=\"_blank\">Navitas Debuts Next-gen GaNSafe Power Components<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Eetasia.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Navitas Debuts Next-gen GaNSafe Power Components - Eetasia.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmVldGFzaWEuY29tL25hdml0YXMtZGVidXRzLW5leHQtZ2VuLWdhbnNhZmUtcG93ZXItY29tcG9uZW50cy_SAQA?oc=5\" target=\"_blank\">Navitas Debuts Next-gen GaNSafe Power Components<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Eetasia.com<\/font>","source.href":"https:\/\/www.eetasia.com","source.title":"Eetasia.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Conservation\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Navitas Debuts Next-gen GaNSafe Power Components Article By : EE Times Taiwan Navitas Semiconductor’s new generation of GaNSafe series products will break the existing market’s 'established impression' of GaN. Generally speaking, the market’s voltage application range for gallium nitride (GaN) components is smaller than that of silicon carbide (SiC). But one key characteristic of GaN is its switching speed, which can enable high power density in charging devices, and reduce the need for external passives and magnetic components, thus reducing overall device size. However, as various application systems gradually move towards higher voltages, are there opportunities for GaN to be used in higher voltage applications? Navitas Semiconductor’s new generation of GaNSafe series products will break the existing market’s ‘established impression’ of GaN. At the recent global GaNSafe product launch conference held in Taipei, Charles Bailley, senior business development director of Navitas, said that more and more data centers are being built worldwide. The recent popularity of artificial intelligence (AI) technology, especially Generative AI, has attracted much attention, prompting industry players to start building AI data centers. However, as data centers have always been ‘power consumers,’ ensuring their high computing performance and excellent energy consumption performance are a critical challenge. And this is where Navitas’ fourth-generation GaN product GaNSafe comes in. GaNSafe’s high-efficiency wide-bandgap power platform can meet the needs of demanding high-power applications such as data centers, solar\/energy storage systems, and electric vehicles (EVs), according to Bailley. This is due to GaNSafe’s high efficiency, high power density, and powerful and reliable operation capabilities. More importantly, the first high-voltage 650\/800V GaNSafe product series covers the RDS(ON) range from 35mΩ to 98mΩ and adopts a surface-mount TOLL package suitable for GaN for excellent heat dissipation effect, which can meet the needs of voltage requirements for 1,000W–22,000W applications. Bailley further explained that although GaN devices are industry-certified power switches with very good performance, there are still some problems that need to be improved. For example, in high-power applications, the topology of discrete GaN devices is more difficult to ‘control’ and cannot support higher operating voltages. And as device size continue to get smaller, effectively dissipating heat is likewise an issue. Navitas’ GaNSafe integrates additional, application-specific protection function that, coupled with the new rugged high-power TOLL package, further improves heat dissipation, thus providing excellent performance under extreme high temperatures and long-term working conditions. Not only that, it can also reduce the overall cost of the application system. To prove the benefits that GaNSafe can bring to high-power applications, Bailley also gave in-depth examples of system platforms implemented through GaNSafe technology. The Navitas CRPS185 data center power platform built using GaNSafe can provide 3,200W of power in a volume of only 40mm × 73.5mm × 185mm (544cm3), achieving a power density of 5.9W\/cm3 (that is, close to 100W\/in³). Compared with traditional silicon-based solutions, the size is 40% smaller, and the conversion efficiency can exceed 96.5% at 30% load and exceed 96% at 20~60% load, establishing the industry standard of ‘Titanium Plus’. In addition, with built-in GaNSafe, Navitas’ new 6.6kW 2-in-1 two-way EV on-board charger (OBC) realizes the function of integrating 3kW DC\/DC on the basis of the two-way 6.6kW OBC. Bailley said that compared with similar solutions in the market, this OBC platform is significantly ahead in various performance indicators, such as power output of 6.6kW charging and 6.0kVA discharging, 50% higher power density of 3.9kW\/L, and peak efficiency at full load as high as 96%. Bailley emphasized that GaNSafe’s various features and advantages has opened a new path for GaN components to enter the high-voltage application market. In the future, GaNSafe products are expected to lead the market for high-power GaN Power ICs. Currently, 40 client projects including data centers, solar energy, energy storage and EV applications have used the GaNSafe series for related product development. It is expected that GaNSafe will officially enter mass production in the fourth quarter of 2023. As David Carroll, Navitas’ senior vice president of global sales, mentioned in the press conference, Navitas’ mission is to continue to help various devices reduce energy consumption through the development of innovative GaN and SiC wide-bandgap semiconductor products and close cooperation with TSMC, and thereby reducing dependence on petrochemical energy and prompting the world to accelerate towards a new sustainable world of energy conservation and carbon reduction. The release of GaNSafe not only sets a new milestone for Navitas in 2023 but is also expected to capture 30% of the GaN market for the company.","filter_flag":1}
{"title":"Aichi Sangyo: a leading industrial solution provider for metal processing industries - The Worldfolio","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy50aGV3b3JsZGZvbGlvLmNvbS9pbnRlcnZpZXdzL2FpY2hpLXNhbmd5by1sZWFkaW5nLWluZHVzdHJpYWwtc29sdXRpb24tcHJvdmlkZXItZm9yLW1ldGFsLXByb2Nlc3NpbmctaW5kdXN0cmllcy81ODgwL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy50aGV3b3JsZGZvbGlvLmNvbS9pbnRlcnZpZXdzL2FpY2hpLXNhbmd5by1sZWFkaW5nLWluZHVzdHJpYWwtc29sdXRpb24tcHJvdmlkZXItZm9yLW1ldGFsLXByb2Nlc3NpbmctaW5kdXN0cmllcy81ODgwL9IBAA?oc=5","id":"CBMigAFodHRwczovL3d3dy50aGV3b3JsZGZvbGlvLmNvbS9pbnRlcnZpZXdzL2FpY2hpLXNhbmd5by1sZWFkaW5nLWluZHVzdHJpYWwtc29sdXRpb24tcHJvdmlkZXItZm9yLW1ldGFsLXByb2Nlc3NpbmctaW5kdXN0cmllcy81ODgwL9IBAA","guidislink":false,"published":"Thu, 28 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=271, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy50aGV3b3JsZGZvbGlvLmNvbS9pbnRlcnZpZXdzL2FpY2hpLXNhbmd5by1sZWFkaW5nLWluZHVzdHJpYWwtc29sdXRpb24tcHJvdmlkZXItZm9yLW1ldGFsLXByb2Nlc3NpbmctaW5kdXN0cmllcy81ODgwL9IBAA?oc=5\" target=\"_blank\">Aichi Sangyo: a leading industrial solution provider for metal processing industries<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Worldfolio<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Aichi Sangyo: a leading industrial solution provider for metal processing industries - The Worldfolio","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy50aGV3b3JsZGZvbGlvLmNvbS9pbnRlcnZpZXdzL2FpY2hpLXNhbmd5by1sZWFkaW5nLWluZHVzdHJpYWwtc29sdXRpb24tcHJvdmlkZXItZm9yLW1ldGFsLXByb2Nlc3NpbmctaW5kdXN0cmllcy81ODgwL9IBAA?oc=5\" target=\"_blank\">Aichi Sangyo: a leading industrial solution provider for metal processing industries<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Worldfolio<\/font>","source.href":"https:\/\/www.theworldfolio.com","source.title":"The Worldfolio","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Conservation\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Can you please introduce us to your company? Aichi contributes to improving Japanese manufacturing, customer value, and constructing a prosperous future by providing the world's leading technology as a solution. We also contribute our resources to energy conservation and initiatives. This is our head office, and we also have sales branches in Kobe, Nagoya, Hiroshima, and Koka. In addition, we have a factory in Sagamihara which is an hour's drive from here and a design facility in Hitachi. My grandfather established the company in 1927, which makes our company 86 years old. I am a third-generation President, and I took over the business from my father. The company has about 150 employees. We are focused on welding technology, metallurgical technology, and machine tool-related products. We import cutting-edge technology from around the world and develop, design, manufacture, and sell our products. We are an engineering trading company that provides technology to major automotive, shipbuilding, and nuclear manufacturers and supports Japan's manufacturing industry. We can make our designs and manufacture welding-related equipment. In addition, we do real estate management. We can meet the demands of the whole Japanese market. One of our advantages is delivering thousands of goods to the domestic market. We have our agents and distributors in the local market, so we have a strong network in the metal field industry. Our company has a sales team, technical support, and design team. We can provide after-sales service and maintenance repairs as a technical trading company. Before COVID, we invited many overseas special guests like GE and Rolls-Royce and university professors. We asked our existing and potential customers to show them our technologies and products. We also invite many people to our yearly open house. We have participated in many famous exhibitions in Japan with our partners. Our head office and our factory have showrooms which we can use to show our technologies and products to our customers. This is our factory, where we create automated systems to make products. We can design special machines to meet customers' specific demands. We have an integrated system where we can deliver and provide after-sales service. Our primary customers are in heavy industries such as aviation and aerospace, automotive, construction, steelmakers, shipbuilders, and many others. We work with both global companies and other SMEs. We now have 70 partners overseas, such as Lincoln, Fronius in Austria, and ARO in France, with whom we have worked for about 50 years. In engineering, we design and develop robotic and automation systems for customers. Occasionally, we create new products for construction and metal industry companies. Before the great earthquake in Japan in 2011, our main customers were in nuclear heavy industries. We installed many automated rotating welding machines in nuclear power plants. Nowadays, we install many robotic systems in Toshiba for the ITA project. We also install many welding machines for automotive or specialized vehicle companies, shipbuilders, metal companies, and plant & bridge builders. We have received many inquiries from the sites where they polish and grind. Most sites have aging technicians and have difficulty securing manpower, so companies are changing to robotic systems. About 14 years ago, we imported 5-axis machines from Germany. We installed machines for IHI for their turbine blades and sent them equipment with 5-Axis, such as vises, robotic systems, or software. Eight years ago, we started our Additive Manufacturing Business and handled powder bed fusion, electron beam, metal deposition, wire additive manufacturing, and many other processes with our partners. Two years ago, we started wind power generation. We are importing special machines for EV battery manufacturers such as Toyota. For the past 20 years, Japanese firms have faced stiff price competition from regional manufacturers. Nevertheless, in particular niche B2B fields, Japanese industries still dominate a significant market share in specific crucial segments. How do Japanese companies remain competitive despite stiff price competition? Japanese companies have always been focused on improving and revolutionizing their technologies. The period between 1955–1973 was Japan's most rapid economic growth. It was a time when Japanese companies imported advanced technologies from overseas to learn and make improvements from them. These unique technologies they developed have been passed on to the next generations of major companies and SMEs. Right now, Japan still has the technology that can cater to the changing needs of society. Japanese companies take regulation changes seriously and adjust to provide high-quality and reliable products. They make tremendous efforts to meet the high-quality requirements of customers and can provide high-quality control and assurance of their products. This mindset has pushed Japanese companies forward. Japan's high-quality and reliable products have gained the trust of customers across the globe. As an island nation, Japan has established a very efficient supply chain management system with a comprehensive ecosystem in each industry. Logistics and transportation systems have been established to achieve the \"just in time\" policy. Other sectors also provide support so that companies can offer speed and flexibility. This overall efficiency reduces cost. In this domestic ecosystem, there is an interdependence between major companies and SMEs. This network is based on trust, allowing companies to take on more long-term development projects. The strength of Japan is in its supply chain management and being trustworthy. This is more important today than it has ever been. With America's interest rates increasing, the value of the JPY against the USD has decreased, making Japanese exports more competitive. Do you think we are living at the start of the Japanese industry's revival? I heard that many Japanese companies are taking their manufacturing back to Japan. I am also hearing that many SMEs are launching new factories within Japan. There are differing opinions, but most Japanese companies are looking more into domestic production. I think this is the last opportunity for the resurgence of Japanese manufacturing because Japan's engineers are aging. We have a limited time to preserve their expertise and experience through AI and robotics to pass it on to the next generation. Once we establish this system, Japanese manufacturers will have many opportunities. | | | Previous Next Japan is famous for its traders. However, this is a concept that is unique to Japan. About 20 years ago, Japanese traders were mainly in charge of providing products and financing projects. However, companies are adding value services in engineering and fine-tuning, among many others. How do you think your company's role will evolve in the next 10 years? Specialized trading firms play a vital role in the current period, where innovation is required. The Japanese government is now giving green and digital funding to SMEs and providing subsidies to diversify and branch out into new businesses. We act as traders and advisors to support SMEs to diversify and evolve in their industries. Our target for the next 10 years is to provide solutions and focus on being a consultant and providing our clients with long-term visions. Often, SMEs have short-term visions, and that is to see a return on investment. However, we want to give them a perspective and a mindset to see a more extended future and survive the market by providing added-value schemes. We not only want to supply equipment, but we also want to offer lifetime maintenance and support. This approach of providing a holistic service helps us create long-term trust with our customers and expand our business. Can you explain how you help SMEs overcome their labor shortages with your technologies? We have a partner in Germany that I often visit. A welding job that takes 12 people in Japan only takes two workers in Germany. Germany has two to three times more robotic welding machines installed in their facility. Japan still has a lot of room to introduce robotics and automated machinery in manufacturing, especially in SMEs which are behind when it comes to digital transformation. By converting and introducing these automated systems, we can compensate for the lack of human resources. Retired engineers of major companies have extensive knowledge, and having them train the younger generation would be a very practical approach to improving Japan's overall manufacturing level. We have recruited previous employees of major companies and are now creating a training scheme for the younger generation. We are going to offer this as a service. Japanese companies are often reluctant to make big decisions because whoever makes the decision has to take responsibility for it. To help them overcome their reluctance to make the big decision to move forward with digital technologies, we try to take them to our partner companies in Germany and have them see what an advanced factory environment can accomplish with their own eyes. Recently, you have made investments through partnerships in three new fields. The first is additive manufacturing, where you are focusing on 3D metallurgy. The second is lithium-ion batteries through a partnership with a company in Germany. The third is renewables, where you provide solutions for wind generation. Why did you choose these three sectors, and what strategy will you employ in these business expansions? We have an extensive overseas partnership network. We learn about cutting-edge technologies through them and other related parties. Observing the Western overseas market trend can help us see the potential path that Japan will take in the future. If we carefully follow and analyze the approach of the Japanese government and observe which fields they are focusing on and providing subsidies to, we will know which companies and manufacturers we should approach. We can act as a bridge and introduce overseas companies with high potential for growth to the Japanese market. We can assist them in entering Japan's market, which often is very hard due to language and cultural boundaries. We learned many lessons from our experiences dealing with various businesses. We are now focusing on specific fields we have strengthened, such as metallurgy. What are your expectations in the next 12 months regarding the Japanese lithium-ion battery industry? We try not to rely solely on the lithium-ion battery field because we have many other options, including solid-state batteries. In Japan, apart from EVs, there is also a movement to utilize existing engines by developing new types of environmentally friendly fuels. We are pursuing a balanced and comprehensive approach regarding new sources of energy. Are you currently looking for new partnerships? If so, in what particular fields will you be looking for these partners? We are looking for new partners in 3D printing and software. We have already established partnerships with many startups and are focused on supporting their growth. In production, Japan has advanced machinery, but we lack the expertise in digitalization and the use of AI sensors and cameras, so we are looking for partners that can provide these. We are constantly looking for new partners. Why is it better for foreign firms to partner with you instead of directly entering the Japanese market? To have business transactions with a major Japanese company, you need to have an account with them. We already have established accounts with many Japanese companies, so we can readily provide sales channels to overseas companies. Furthermore, after-service and maintenance are crucial to delivering and acquiring the trust of Japanese clients. Rather than flying people from overseas, they can utilize our maintenance base to reduce transport costs while providing a complete support system. Many major companies request quick response maintenance when their equipment breaks down. We can provide 24\/7 maintenance. Doing this reduces the frustration and increases the satisfaction of our customers and provides business opportunities through acquiring the trust of our customers. Translating and localizing the manuals is also essential. This will help meet the demands of Japanese clients. By providing comprehensive services to overseas companies who want to enter the Japanese market, we are giving them a higher chance of success in their endeavor. We can also provide fine-tuning and customizing products according to Japanese standards and regulations. During COVID, we worked with a foreign company that had a branch in Japan, but the Japanese branch could not provide the customization. We were able to do that for them. Our fine-tuning and integration abilities allow us to help Western companies to have long-term businesses in Japan. In the Japanese industry, we are a member of many associations and groups, including the Chamber of Commerce. We have direct connections with other companies that are also a part of these associations. I can easily approach and talk directly to them. This domestic network is our advantage as a Japanese company over other overseas firms. Our company can provide from downstream to upstream. As companies become bigger in Japan, one has to understand the Japanese nuances of what is beneath the surface and what they actually mean. Looking into the future, are there new applications that you would like to expand into and create new partnerships? We are focusing on the field of robotics. I believe that fully automating and introducing full robotics in the production line would stagnate production. However, if we can introduce a good balance of human labor with collaborating robots, it would be the most ideal. We are currently working on this balance. We are also very much interested in developing communication between robots and humans. The growth of Japanese SMEs depends on whether they can produce highly additive value in manufacturing and also if they can find high-profit margin products. We want to be available to support the SMEs in achieving these two things. I am helping them realize sustainable growth. Your company has made quite a headway in additive manufacturing, and you were focusing on metals. As a result, you worked with various metal and alloy materials. Can you give us a specific example of such a development and explain more about your expansion into additive manufacturing? Japanese additive manufacturing is slightly delayed compared to Europe and the US because we do not have the military and aerospace market that they have. We started working with the automotive and energy sectors. They are our top two markets. We installed about 30 systems, half of which are in the automotive industry. At the time, they were working on lightweight automobiles and dealing with aluminum alloys. The other market we are interested in is copper alloys. Copper can be challenging to handle due to electricity and temperature problems, but we are willing to work with it because it is highly reflective. One of our successes was in the area of Aichi, where Toyota is. They were looking for tested technologies that can be used for bending coils because their engineers are getting old, and it is difficult to find new employees. At the time, we had some successful results with our copper technologies, so they started working with us and also developed their own. They installed four of our systems for induction coils. The technology for additive manufacturing has been around for some time now. In the beginning, people said that it would revolutionize industries. However, it has not yet done so. In countries like the US, we see that it is utilized to manufacture low-volume specific components on the same day. What do you think will be the role of additive manufacturing in Japan's supply chain? The problem is often in qualifications. Global additive manufacturing qualification similar to ASTM or TM does not exist. They are probably making it right now. I heard that 70% is from ASTM (American Society for Testing and Materials) and 20 % from DIN (Deutsches Institut für Normung\/German Institute for Standardization). Japan is just waiting for it. Only Japan has middleman companies. As an island company, we are isolated and limited in our foreign language skills. Finding an engineer in Japan who can speak English is very difficult. Engineers from Germany or Finland can come alone to Japan and communicate in English. However, we have to send our engineers with translators. This is a challenge for Japan. If overseas companies want to know more about additive manufacturing in Japan, only very few people can communicate in English. The cost of living today has not changed since when I was a child. When I went to China 20 years ago, the prices seemed cheap, but now they are the same as Japan. This was a result of our challenging situation. If we come back for your 100th anniversary, what goals and personal ambitions would you like to have achieved by then? I wish to give additional bonuses to our employees. As a company, we would have been working and supporting our partners for 100 years! We would like to continue doing it. Moreover, we view Japan's future as very important, so we want to provide a bright future for our children. We want to actively take part in fortifying the Japanese monozukuri and strengthening our technologies. I believe that our technological advancements can meet the challenges of our resource-poor country, and this is what we would like to focus our energies on moving forward.","filter_flag":1}
