{"title":"Why Kristen Bell, Robert Downey Jr., and Eva Longoria Love Vegan Sneaker Brand Løci (And Where You Can Buy ... - VegNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiNmh0dHBzOi8vdmVnbmV3cy5jb20vdmVnYW4tc25lYWtlci1icmFuZC1sb2NpLWNlbGVicml0edIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiNmh0dHBzOi8vdmVnbmV3cy5jb20vdmVnYW4tc25lYWtlci1icmFuZC1sb2NpLWNlbGVicml0edIBAA?oc=5","id":"CBMiNmh0dHBzOi8vdmVnbmV3cy5jb20vdmVnYW4tc25lYWtlci1icmFuZC1sb2NpLWNlbGVicml0edIBAA","guidislink":false,"published":"Wed, 18 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=291, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNmh0dHBzOi8vdmVnbmV3cy5jb20vdmVnYW4tc25lYWtlci1icmFuZC1sb2NpLWNlbGVicml0edIBAA?oc=5\" target=\"_blank\">Why Kristen Bell, Robert Downey Jr., and Eva Longoria Love Vegan Sneaker Brand Løci (And Where You Can Buy ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why Kristen Bell, Robert Downey Jr., and Eva Longoria Love Vegan Sneaker Brand Løci (And Where You Can Buy ... - VegNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNmh0dHBzOi8vdmVnbmV3cy5jb20vdmVnYW4tc25lYWtlci1icmFuZC1sb2NpLWNlbGVicml0edIBAA?oc=5\" target=\"_blank\">Why Kristen Bell, Robert Downey Jr., and Eva Longoria Love Vegan Sneaker Brand Løci (And Where You Can Buy ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","source.href":"https:\/\/vegnews.com","source.title":"VegNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-conscious Materials\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Without a doubt, the sneaker brand Løci is a celebrity favorite. From Leonardo DiCaprio (who is actually an investor in the brand) to Ben Affleck to Kristen Bell and Robert Downey Jr. A-listers just can’t seem to get enough of Løci. But why all the fuss? It turns out that this London-based brand doesn’t just make great, comfy sneakers, but it also uses sustainable and vegan materials. And that’s a big tick in our book. Here’s more about Løci, its celebrity fanbase, and some of our favorite sneaker picks. What is the Løci brand? Løci is already incredibly popular, but it’s actually still a relatively new brand in the sneaker market. It was founded in 2020 by Frank Eribo and Philippe Homsy, who were concerned about the amount of animal products used in the fashion industry. The shoe sector, in particular, is reliant on the leather industry, which is linked with deforestation, rising emissions, and the slaughter of millions of animals every year. Eribo and Homsy decided it was time to create sustainable, ethical sneakers that wouldn’t impact the environment in the same way. “We wanted to create a premium vegan alternative, where customers wouldn’t have to compromise on style or quality,” they told Soho House. With that in mind, the brand makes all of its products with eco-conscious materials, like corn leather, recycled plastic, and cork, in ethically run factories in Portugal, where every worker earns a living wage. The collections are also produced in small drops to reduce waste, and each purchase gives back to the environment—10 percent of all profits are donated to marine conservation nonprofits. Who wears Løci sneakers? Løci’s sustainability focus and its top-quality sneaker design have turned it into a hit with celebrities. Some of its most famous fans include those mentioned above, plus Sophie Turner, Eva Longoria, Mila Kunis, Nikki Reed, Jessica Alba, Kylie Jenner, Olivia Wilde, and Lucy Hale, who recently partnered with the brand on her own capsule edit. DiCaprio also announced his investment in the brand just over a year after it launched. “I am proud to be an investor in Løci,” the A-list actor and environmentalist said in a statement. “[It’s] a brand dedicated to minimizing its environmental impact, and centered around creating cruelty-free, ethical footwear.” Speaking to Forbes, Homsy praised DiCaprio’s decision to invest. “Today, sustainability is one of the most used buzzwords,” he told the publication. “We want Løci to cut through the noise and be judged by our impact. Through education, innovation, and donations, we’ve built a business model that is driven by our passion. With Leo, we could not have hoped for a more genuine and committed partner.” The best vegan sneakers from Løci It’s celeb-approved, stylish, respectful of the planet, and 100 percent vegan. When it comes to Løci, what’s not to love? If you want to get in on the star-studded footwear action, here are some of our favorite vegan sneaker styles from the brand. Løci 1 Fusion Take it back to the ‘80s with these retro-inspired sneakers, which are particularly loved by Hale, as they made it into her edit with the brand. Made with recycled ocean plastic, bamboo, recycled nylon, recycled rubber, recycled foam, and natural cork, they’re slick, they’re modern, and like Løci says, “athleisure never looked so good.” Get them here Løci 2 Neo If the ‘80s aren’t your thing, how about the ‘90s? Celebrate the iconic era with these basketball sneakers, which were “created for the concrete courts of ‘90s LA.” Available in five colorways, the shoes feature a bio-leather upper, a lining made with bamboo and recycled nylon, and eyelets made with recycled brass. Get them here Løci 3 Origin The Origin boasts a classic, timeless design, which means they’ll go with pretty much anything—from your favorite dress to your go-to pair of jeans. Materials include recycled ocean plastic, bamboo, recycled nylon, and natural cork. Get them here Løci 4 Hero X Reed Those who prefer a mid-top sneaker style will love Løci’s Hero sneakers, which come in a range of colorways. According to the brand, the design, made with recycled ocean plastic, bamboo, and recycled brass, is inspired by the trends of the ‘70s, ‘80s, and ‘90s. “A vegan sneaker for the real icons,” it notes. Get them here Løci 5 Legend Again, the Legend is inspired by basketball sneakers, which is why it features that iconic high-top silhouette. Like all of Løci’s designs, the sneaker features a mix of recycled brass, recycled foam, bamboo, and recycled ocean plastic. Choose from colorways like khaki, grey, white, and natural. Get them here Løci 6 Atom Løci covers all the bases in sneaker design. So, if you’re more of a skatewear fan, you’ll love the brand’s Atom design. Available in five different colorways, including black and cream and blue and white, the design—made with bio leather, bamboo, and recycled nylon, among other sustainable materials—is classic yet modern. Get them here Løci 7 Classic If you’re feeling unsure about which Løci design to go for, the Classic is a good, strong choice. It’s available in multiple colorways, including several neon options, and the silhouette is timeless, clean, and perfect for everyday wear. Get them here","filter_flag":1}
{"title":"R|Elan™ brought The Glamour of Couture By Varun Bahl at Lakmé Fashion Week - The Textile Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi9yZWxhbi1icm91Z2h0LXRoZS1nbGFtb3VyLW9mLWNvdXR1cmUtYnktdmFydW4tYmFobC1hdC1sYWttZS1mYXNoaW9uLXdlZWsv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi9yZWxhbi1icm91Z2h0LXRoZS1nbGFtb3VyLW9mLWNvdXR1cmUtYnktdmFydW4tYmFobC1hdC1sYWttZS1mYXNoaW9uLXdlZWsv0gEA?oc=5","id":"CBMibmh0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi9yZWxhbi1icm91Z2h0LXRoZS1nbGFtb3VyLW9mLWNvdXR1cmUtYnktdmFydW4tYmFobC1hdC1sYWttZS1mYXNoaW9uLXdlZWsv0gEA","guidislink":false,"published":"Fri, 13 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=286, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi9yZWxhbi1icm91Z2h0LXRoZS1nbGFtb3VyLW9mLWNvdXR1cmUtYnktdmFydW4tYmFobC1hdC1sYWttZS1mYXNoaW9uLXdlZWsv0gEA?oc=5\" target=\"_blank\">R|Elan™ brought The Glamour of Couture By Varun Bahl at Lakmé Fashion Week<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Textile Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"R|Elan™ brought The Glamour of Couture By Varun Bahl at Lakmé Fashion Week - The Textile Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi9yZWxhbi1icm91Z2h0LXRoZS1nbGFtb3VyLW9mLWNvdXR1cmUtYnktdmFydW4tYmFobC1hdC1sYWttZS1mYXNoaW9uLXdlZWsv0gEA?oc=5\" target=\"_blank\">R|Elan™ brought The Glamour of Couture By Varun Bahl at Lakmé Fashion Week<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Textile Magazine<\/font>","source.href":"https:\/\/www.indiantextilemagazine.in","source.title":"The Textile Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-conscious Materials\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Varun Bahl’s Festive Edit collection presented by R|Elan™ at Lakmé Fashion Week in partnership with FDCI was an ode to nature’s beauty as well as the designer’s two decades of fashion expertise. Varun Bahl with Hemant D. Sharma, Sector Head – Polyester, Reliance Industries, at a press conference. The “Inner Bloom-Festive Edit” collection celebrated the much-loved symbol of flowers, as Varun brought them to gorgeous life with exquisite 3-dimensional embroideries, opulent materials from the R|Elan range of versatile fabrics, and masterful craftsmanship. Varun Bahl’s artistic palette for this collection introduced a festive and diverse range of colours, diverging from his signature style all beautifully incorporated into custom-woven, high-performance, and eco-friendly R-Elan™ fabrics. Using the fabulous, R|Elan™ high performance fabrics, Varun dreamt up feminine, free flowing drapes for lehengas, while the jacket and cape sets, as well as the trouser suits added to the fashion statements of the collection. The collection includes four of R|Elan’s™ versatile fabrics, i.e., R|Elan™ Superfeel & Freeflow – luxurious fabrics with enhanced drape & exceptional hand feel, R|Elan™ Kooltex – high performance fabrics with inherent moisture management technology & R|Elan™ Greengold – sustainable fabrics made from 100% post-consumer PET Bottles. These fabrics not only enhance the drapes of lehengas but also feature in jacket sets, cape sets, and trouser suit sets. Varun’s colour choice was a mélange of hues as he dipped his colour brush into diverse tones that moved from old rose, duck egg blue, ecru, gold, sage green, which were then topped with popular black. Embroidery was the basis of Varun’s ensembles with zardozi and aari work in the forefront along with luxurious bead embroidery. To add more grandeur to the collection, Varun added metallic accents, intricate bead work that featured the finest bugle and caviar beads, along with two cut seeds and sequins mirroring to bring the floral fantasy on the garments to life. In line with R|Elan™ and Varun’s steadfast commitment to sustainability, in addition to 40% of the collection being made with R|Elan™ Greengold, it also includes a small up-cycled segment that promotes the repurposing of materials. This segment features patchwork crafted from borders and 3-D floral patches, further elevating the sustainable quotient of the collection. Varun Bahl’s “Inner Bloom-Festive Edit” collection presented by R|Elan™ with the brand’s amazing line up of fabrics will offer a grand, sartorial blossoming for the buyers this season. Commenting on the Inner Bloom collection Mr. Hemant D. Sharma, Sector Head – Polyester, Reliance Industries, said, “Varun Bahl’s ‘Inner Bloom’ collection, in partnership with R|Elan™, is a celebration of nature’s timeless beauty, seamlessly woven into the fabric of sustainable fashion. With intricate craftsmanship and eco-conscious materials, this collection embodies our shared commitment to a more beautiful and sustainable world. Reliance Industries Limited remains steadfast in its dedication to promoting sustainability and circularity concepts throughout the fashion industry, setting new standards for a brighter, more environmentally conscious future. We proactively scan the desires of fashion consumers to create products that not only align with their values but also bring delight to their faces, fostering a deeper connection between fashion, sustainability, and joy.” Varun Bahl added on his showcase, “I have always believed that sustainability is the future of fashion, and it is my great pleasure to have associated with RIElan, for Lakmé Fashion Week in Partnership with FDCI, this season. With the use of sustainable fabrics from RIElan, we have created an absolute one-of-a-kind festive collection, and I am sure that the presentation piqued interest for the audiences that witnessed the collection live.”","filter_flag":1}
