{"title":"Q&A with Federico Bedeschi - World Grain","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LndvcmxkLWdyYWluLmNvbS9hcnRpY2xlcy8xOTQzNC1xLWFuZC1hLXdpdGgtZmVkZXJpY28tYmVkZXNjaGnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LndvcmxkLWdyYWluLmNvbS9hcnRpY2xlcy8xOTQzNC1xLWFuZC1hLXdpdGgtZmVkZXJpY28tYmVkZXNjaGnSAQA?oc=5","id":"CBMiSWh0dHBzOi8vd3d3LndvcmxkLWdyYWluLmNvbS9hcnRpY2xlcy8xOTQzNC1xLWFuZC1hLXdpdGgtZmVkZXJpY28tYmVkZXNjaGnSAQA","guidislink":false,"published":"Wed, 27 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=361, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LndvcmxkLWdyYWluLmNvbS9hcnRpY2xlcy8xOTQzNC1xLWFuZC1hLXdpdGgtZmVkZXJpY28tYmVkZXNjaGnSAQA?oc=5\" target=\"_blank\">Q&amp;A with Federico Bedeschi<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">World Grain<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Q&A with Federico Bedeschi - World Grain","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LndvcmxkLWdyYWluLmNvbS9hcnRpY2xlcy8xOTQzNC1xLWFuZC1hLXdpdGgtZmVkZXJpY28tYmVkZXNjaGnSAQA?oc=5\" target=\"_blank\">Q&amp;A with Federico Bedeschi<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">World Grain<\/font>","source.href":"https:\/\/www.world-grain.com","source.title":"World Grain","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Reduction\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"LIMENA, ITALY — Bedeschi is a family-owned manufacturing and project engineering company with a global outlook, specializing in the design, production and supply of machines and integrated systems for grain handling and storage. Based in Padova, Italy, the company provides the equipment and services needed to handle bulk commodities along the entire value chain. World Grain interviewed Federico Bedeschi, sales manager food applications, about the company’s history, products and services and the challenges facing the grain handling industry. WG: Tell us more about the equipment and services you offer to the industry. Bedeschi: Our equipment includes ship loaders and unloaders with handling capacities from 100 to 20,000 tph (for grain the highest capability is 3,000 tph) and ship loading sizes up to 120,000 deadweight tonnes, belt conveyors, as well as pipe and enclosed conveyors to avoid emissions and spillage of material. In addition, we offer transshipments for offshore logistics. Lastly, we can also supply Eco Hoppers that are designed to guarantee dust control and ensure the maximum level of efficiency. We can design and manufacture products and services that are required to transport and handle food bulk commodities. WG: How did the company get started and grow to its current status? Bedeschi: Bedeschi was founded in 1908 by Guglielmo Bedeschi, as a local business in Padova, Italy, primarily focused on manufacturing machines and equipment to produce bricks. Over the years, we diversified our product range to include bulk material handling equipment like stackers, reclaimers, ship loaders and unloaders and conveyor systems, as well as crushers in the mining and cement industry. We also expanded internationally and step by step opened offices in the US, Hong Kong and other countries. We always thrive to diversify our industry exposure. The food sector has always been a top priority for us. In 2023, we have been expanding our global footprint further with the opening of new offices in Australia and Germany, having attracted more than 50 new engineers from the materials handling industry. We have set a goal to become a leading player in the bulk materials handling solution. WG: What makes Bedeschi unique? Bedeschi: What makes Bedeschi truly unique is our century-long history as a family-owned business — currently the fourth and fifth generations of the family are deeply involved in daily operations. We take pride in our Italian manufacturing facilities, which allow us to handle any type of bulk material, from humid clay to dry substances, with custom solutions. Our engineering capabilities combined with our exceptional manufacturing skills set us apart. We have a dedicated team that excels in cutting-edge bulk material handling solutions, ensuring that we remain at the forefront of innovation in our field. With our offices and three workshops around the globe, we are very close to our customers and offer timely solutions to problems they might face. Bedeschi is also strongly committed to sustainability. This commitment is deeply embedded in our corporate culture, ensuring that our solutions are not only efficient and reliable but also environmentally conscious. An example is the project in Australia for Cargill, where Bedeschi provided an innovative ship loader for grain and seeds onto ships. In addition to meeting the highest environmental standards, the machine has also reduced the average mooring time of ships by more than 50%, resulting in reduced fuel consumption, activity-related noise pollution, and in greenhouse gas emissions. WG: Why did Bedeschi decide to open locations in Germany and Australia? Bedeschi: The establishment of our two new offices in Germany and Australia represents a strategic move to bolster Bedeschi’s position in the materials handling industry. Several compelling factors drove this decision. First, we recognized the exit of two major market players in the materials handling industry. This presented us with a unique opportunity to not only gain a substantial market share but also to enrich our company’s know-how by welcoming experienced professionals from these renowned companies. Moreover, our recent growth necessitated additional manpower, especially in the field of engineering. Given the challenges of sourcing experienced engineers in the locations where we were already established, we made a deliberate choice to open offices in Germany and Australia, regions known for their availability of skilled engineers. In Germany, we have expanded our engineering capabilities and created an engineering hub with deep knowledge about large capacity material handling solutions. This strategic move allows us to further strengthen our engineering power to meet the increasing requirements of our clients and to expand our product line, adding new products to offer even more complete solutions. In Australia, we ventured into a market that has proven to hold enormous potential, both in mining applications and, interestingly, in food applications as well. WG: What other regions would Bedeschi like to expand into? How does this fit into the company’s overall strategy? Bedeschi: Thanks to the strategic expansion into Australia and Germany, our market exposure has experienced significant growth. The primary challenge now lies in tapping the potential of this heightened market presence. We are proactively exploring new market opportunities, with a keen eye on regions such as China and South America. While we already have a presence in these areas, we believe there is substantial room for further market penetration. Both the Americas and Asia are pivotal regions for us, with promising market outlooks. Our optimism is underpinned by a combination of factors, including projected population growth and the availability of commodities like grain and other bulk food resources. Furthermore, our strategic approach aligns with a global commitment to addressing environmental concerns, with a focus on anticipated developments in pollution reduction and sustainable practices. This approach ensures that our growth is not only commercially viable but also environmentally responsible, further solidifying our position as a responsible industry leader. WG: How has the acquisition of Berga Golfetto Sangati in 2022 benefited Bedeschi? Bedeschi: The acquisition of Berga Golfetto Sangati in 2022 has been a significant milestone for our activities in the food sector. With the inclusion of Berga Golfetto Sangati under the Bedeschi umbrella, we’ve seen tangible benefits. These brands are renowned for their Italian excellence in grain material handling, boasting a long history of success and a robust market presence. This amalgamation of expertise with Bedeschi’s capabilities has empowered us to offer our clients new and advanced opportunities for business growth such as pneumatic ship unloaders. WG: What are some of the innovations Bedeschi is developing for ship loading\/unloading? Bedeschi: Shiploaders and unloaders play a crucial role in the food industry value chain, and they represent the core of Bedeschi’s expertise. Our approach to innovation is twofold: encompassing continuous improvement with each successive project, and dedicated structural research and development to enhance machine performance. Our focus has revolved around vital aspects such as safety, energy efficiency, and operator ergonomics. Notable innovations include the development of a “digital twin” for our machines, enabling remote monitoring and predictive maintenance support for our customers. Additionally, we have embraced technologies like augmented reality (AR) and virtual reality (VR) applications, which allow us to remotely assist field agents in real-time. WG: What are some challenges facing the grain industry and how can Bedeschi address those issues? Bedeschi: In today’s industrial landscape, our customers face two critical challenges: the pressing need to reduce dust emissions and the imperative to minimize energy consumption. At Bedeschi, we recognize that these concerns are paramount for both environmental sustainability and operational efficiency. To address the first challenge, we’ve developed cutting-edge enclosed systems that prevent dust from escaping into the environment. Moreover, our innovative eco hoppers are equipped with state-of-the-art dedusting systems, ensuring low dust dispersion. On the energy front, we’ve shifted our focus to the chain ship unloader, a highly efficient alternative to traditional grab unloaders and pneumatic unloaders. By choosing Bedeschi, you’re not only investing in solutions that meet industry standards but also taking proactive steps towards a cleaner, greener, and more cost-effective future.","filter_flag":1}
