{"title":"Accelerating the Transition to Green Energy with Product Lifecycle Management - POWER magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LnBvd2VybWFnLmNvbS9hY2NlbGVyYXRpbmctdGhlLXRyYW5zaXRpb24tdG8tZ3JlZW4tZW5lcmd5LXdpdGgtcHJvZHVjdC1saWZlY3ljbGUtbWFuYWdlbWVudC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LnBvd2VybWFnLmNvbS9hY2NlbGVyYXRpbmctdGhlLXRyYW5zaXRpb24tdG8tZ3JlZW4tZW5lcmd5LXdpdGgtcHJvZHVjdC1saWZlY3ljbGUtbWFuYWdlbWVudC_SAQA?oc=5","id":"CBMiZ2h0dHBzOi8vd3d3LnBvd2VybWFnLmNvbS9hY2NlbGVyYXRpbmctdGhlLXRyYW5zaXRpb24tdG8tZ3JlZW4tZW5lcmd5LXdpdGgtcHJvZHVjdC1saWZlY3ljbGUtbWFuYWdlbWVudC_SAQA","guidislink":false,"published":"Thu, 09 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=9, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=40, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LnBvd2VybWFnLmNvbS9hY2NlbGVyYXRpbmctdGhlLXRyYW5zaXRpb24tdG8tZ3JlZW4tZW5lcmd5LXdpdGgtcHJvZHVjdC1saWZlY3ljbGUtbWFuYWdlbWVudC_SAQA?oc=5\" target=\"_blank\">Accelerating the Transition to Green Energy with Product Lifecycle Management<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">POWER magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Accelerating the Transition to Green Energy with Product Lifecycle Management - POWER magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LnBvd2VybWFnLmNvbS9hY2NlbGVyYXRpbmctdGhlLXRyYW5zaXRpb24tdG8tZ3JlZW4tZW5lcmd5LXdpdGgtcHJvZHVjdC1saWZlY3ljbGUtbWFuYWdlbWVudC_SAQA?oc=5\" target=\"_blank\">Accelerating the Transition to Green Energy with Product Lifecycle Management<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">POWER magazine<\/font>","source.href":"https:\/\/www.powermag.com","source.title":"POWER magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Rising concerns over climate change have caused a major shift in the energy ecosystem, away from fossil fuels and toward renewable, clean, and sustainable energy. Currently, the earth is about 1.1C warmer than in the late 1800s. As outlined in the Paris Agreement, the goal is to reduce greenhouse gas (GHG) emissions, limit global warming to below 2C above pre-industrial levels, and preferably limit the increase to 1.5C by 2050. According to a new report by the United Nations Framework Convention on Climate Change (UNFCC), even if each country’s climate change pledges are kept, global temperatures are projected to miss the mark and instead suggest a 2.8C hike by the end of the century. Despite the present energy crisis, inflation, economic uncertainty, and the war in Ukraine, companies face pressure from investors and consumers to reduce GHG emissions, which continue to intensify as temperatures rise. While this is true in many industries, it is magnified in the energy market as it has the biggest impact in both emitting GHG emissions and transitioning to green and clean energy. Another inescapable future is the demand for electricity, expected to triple by 2050 as living standards grow. All future scenarios point to renewable energy, particularly solar and wind, to lead the power generation mix by 2050. Along with batteries for electric vehicles (EVs), the unit cost of solar and wind continue to fall while their use continues to rise. However, as the energy crisis and the war in Ukraine have highlighted, there is a need for an energy source that is secure, produces low emissions, and is dispatchable. Nuclear may, for example, be the complement to renewable energy to transition to a more sustainable future. A key factor in accelerating this transition is using digital technologies to control product data for wind, solar, and nuclear. All companies run on product data—it touches all phases of a product’s\/plant’s lifecycle. Those that can harness their data outperform their competition. They’re able to innovate, scale, and transform, merging their digitalization efforts sustainably and making them more resilient competitors in the marketplace. They do this with a strategic business approach known as Product Lifecycle Management (PLM). Although PLM is often associated with engineering and software systems, generally known as “PLM solutions,” PLM is a much broader strategic approach to managing all aspects of the product, services, and processes directly linked to the business strategy. It supports the collaborative creation, management, dissemination, and use of product definition information, supporting the extended enterprise (that is, customers, design, operations, supply partners, etc.) as it spans from concept through end of life of a product or plant. PLM integrates people, processes, business systems, and information that empowers the business, enables product and process innovation, and enhances both top- and bottom-line business performance. Wind turbine manufacturers, for example, use PLM to control the configuration of their product in both their new product introduction process, as well as their requisition-to-order processes, customer requirements, and other regulations. They make use of PLM solutions, product configurators, enterprise resource planning (ERP) systems, and other digital solutions to manage all the components, materials, and processes that make up a wind turbine. Each wind turbine is comprised of thousands of parts, including software, much of which comes from an upstream supply chain regularly consisting of more than a thousand suppliers. For any given order, these parts or, in some cases, functions are configured with PLM, resulting in a bill-of-material (BOM) throughout various phases of the product’s lifecycle. The after-service market is crucial in the wind industry. Therefore, using PLM to create digital twins—virtual replicas of these physical assets, which are kept up to date throughout service—is critical not just for performance, but also to increase efficiency and provide useful insights for future services, upgrades, retirement, and new products. Wind and solar companies are some of the most sustainable in the world. In both January 2022 and 2023, Corporate Knights (a Toronto, Canada–based sustainable-economy media and research company) named Vestas, the largest wind turbine provider, as the “most sustainable corporation in the world” from a list of 6,720 publicly traded companies with more than $1 billion in revenue. Vestas is committed to being a carbon-neutral company by 2030 without using carbon offsets and by producing zero-waste wind turbines by 2040. To accomplish this, Vestas, and competitors such as GE Vernova, Siemens Gamesa, and others are incorporating circular design concepts, reducing carbon emissions, and reducing waste production from manufacturing. Studies have shown that approximately 80% of the GHG emission is locked in during product design. Therefore, wind original equipment manufacturers are making concerted efforts from the outset to design sustainability into their products with the end of life in mind. To accomplish this, they are making greater use of digital threads—the ability to connect product data flow and achieve an integrated view of an asset’s data (that is, its digital twin) throughout its lifecycle across traditionally siloed functional domains. Another key is reducing the product carbon footprint (PCF). So, for each component or material they need to know the carbon dioxide equivalent (CO 2 e). This extends into their supply chain where up to 99% of their carbon footprint is typically embedded in their product manufacturing process. PLM can increase the visibility of the product carbon footprint of the materials used, including those from suppliers, thus reducing the environmental impact. Vestas is also pursuing a zero-waste product by 2040. While 80% of their average wind turbine can already be fully recycled or repurposed, there are challenges for the turbine rotors where composite components made of epoxy resin and fibers make it more difficult to recycle cost effectively. “Integrating sustainability into everything we do is a part of our vision to become the global leader in sustainable energy solutions. This also includes our ambition to be the safest, most-inclusive, and socially responsible company in the energy industry. We want to create a place to work where a diverse workforce of people thrive, grow, and feel that they belong,” said Brian Lindgaard Jensen, vice president with Vestas. The solar industry, entailing solar panels or photovoltaic panels (PV), uses PLM in a similar fashion and is similarly challenged designing for sustainability with an increasing emphasis on waste reduction and recycling at the end of a solar project’s lifespan. A 2016 study by the International Renewable Energy Agency (IRENA) estimates the recyclable materials in old solar modules will be worth $15 billion in recoverable assets by the year 2050. The two primary solar technologies are crystalline silicon, with most of the market share, and thin-film PV, which is used for applications such as building rooftops. Many of the materials that make up PV panels could be highly recyclable. Glass composes most of the weight of a solar panel (about 75%) and glass recycling is already a well-established industry. Other materials that are easily recyclable include the aluminum frame, copper wire, and the plastic junction boxes. The challenge is that existing products were designed for durability with polymer layers that seal the panels from exposure to the elements. The lack of designing for disassembly requires that existing designs require thermal processing at 500C to loosen the adhesive. In Europe, which has a more mature solar industry, the Waste Electrical and Electronic Equipment Directive (WEEE) of the European Union helped found a member-based organization called PV Cycle to build out a robust recycling infrastructure. Although similar regulations are expected in the U.S., as of now, only Washington state has passed legislation requiring manufacturers of PV modules to provide for recycling. Leading thin-film solar manufacturer First Solar started a voluntary recycling program in 2006 and continues to perfect its processes. Today, the company recovers more than 90% of the semiconductor material for reuse in new solar modules. It also recovers 90% of the glass for reuse in new glass container products. As the renewable energy market continues to grow, the use of PLM throughout a circular product lifecycle that spans from raw material sourcing through end-of-life recycling, recovery, and remanufacturing will be critical. And, not only through enhancement with digital twins, digital thread, and configuration management, but also in collaboration across many functions both within the company and with customers and their supply chain. In addition to renewables, Russia’s invasion of Ukraine and the subsequent surge in energy prices has highlighted the need for countries to rethink their energy security strategy. The need for a more diverse and domestic supply of energy is clear, leading to a resurgence in nuclear power. Historically, nuclear power has been cost-prohibitive compared to coal and natural gas, but the combination of the need for energy security, additional low-carbon emissions, and flexible baseload power that can supplement renewable energy is key. Nuclear energy provides 413 GW of capacity operating in 32 countries while avoiding 1.5 gigatonnes (Gt) of GHG emissions and 180 billion cubic meters (bcm) of global gas demand each year. As a result, many counties are scaling back their plans to phase out nuclear, and others, such as the UK, are planning for new reactors. Many of these plants were originally designed more than 40 years ago, before PLM was broadly accepted, but PLM is being adopted, typically during retrofits. So, as an example, if a unit gets a new steam turbine designed using PLM, the utility company can use this data to help them manage their power plant more efficiently. When it comes to older plants, the use of PLM and modern asset management largely comes down to the choice for more efficiency and improved data consistency. The challenge of net zero has also intensified the development in small modular reactor (SMR) technologies. SMRs, generally defined as advanced nuclear reactors with a capacity of less than 300 MW, have strong political and institutional support, with substantial grants in the U.S., and increased support in Canada, the UK, and France. However, SMRs have not yet proven to be financially viable, and few will be online before 2030. That said, they are attracting private investors, they will have lower capital costs, inherent safety and waste management attributes, and reduced project risks may improve social acceptance. The companies investing in advanced SMR technology, such as NuScale Power, GE-Hitachi Energy, and others, use PLM, and in some cases enable almost all their employees to access data under configuration control. The reason for this is the requirements, quality, safety, and other data and documentation required for licensing are interrelated and critical to their business. While the scale may be different from wind turbines and solar plants, and the regulatory requirements more stringent, the PLM concepts and technologies are quite similar. The latest Intergovernmental Panel on Climate Change (IPPC) report highlighted that global CO 2 emissions continue to rise at unprecedented levels. Energy companies need to accelerate their innovation, reduce their PCFs, implement more circular waste reduction, and do so while keeping their costs down with greater collaboration, which is exactly what increased digitalization and PLM offer. We are witnessing the most dramatic transition in energy and the markets impacted by energy in our lifetime. PLM is playing a key role in accelerating the transition to green energy and a decarbonized, sustainable, and circular economy that will benefit our businesses, our customers, and the future of our planet for generations to come. —Mark Reisig is executive consultant, and Sustainability and Green Energy practice director, with CIMdata.","filter_flag":1}
{"title":"UK green hydrogen pioneer GeoPura backed with £36m investment - Barclays","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMilgFodHRwczovL2hvbWUuYmFyY2xheXMvbmV3cy9wcmVzcy1yZWxlYXNlcy8yMDIzLzAyL0dpYW50cy1vZi1pbmR1c3RyeS1tYW51ZmFjdHVyaW5nLWZpbmFuY2UtYmFjay1VSy1ncmVlbi1oeWRyb2dlbi1waW9uZWVyLUdlb1B1cmEtd2l0aC0zNm0taW52ZXN0bWVudC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMilgFodHRwczovL2hvbWUuYmFyY2xheXMvbmV3cy9wcmVzcy1yZWxlYXNlcy8yMDIzLzAyL0dpYW50cy1vZi1pbmR1c3RyeS1tYW51ZmFjdHVyaW5nLWZpbmFuY2UtYmFjay1VSy1ncmVlbi1oeWRyb2dlbi1waW9uZWVyLUdlb1B1cmEtd2l0aC0zNm0taW52ZXN0bWVudC_SAQA?oc=5","id":"CBMilgFodHRwczovL2hvbWUuYmFyY2xheXMvbmV3cy9wcmVzcy1yZWxlYXNlcy8yMDIzLzAyL0dpYW50cy1vZi1pbmR1c3RyeS1tYW51ZmFjdHVyaW5nLWZpbmFuY2UtYmFjay1VSy1ncmVlbi1oeWRyb2dlbi1waW9uZWVyLUdlb1B1cmEtd2l0aC0zNm0taW52ZXN0bWVudC_SAQA","guidislink":false,"published":"Tue, 21 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=52, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilgFodHRwczovL2hvbWUuYmFyY2xheXMvbmV3cy9wcmVzcy1yZWxlYXNlcy8yMDIzLzAyL0dpYW50cy1vZi1pbmR1c3RyeS1tYW51ZmFjdHVyaW5nLWZpbmFuY2UtYmFjay1VSy1ncmVlbi1oeWRyb2dlbi1waW9uZWVyLUdlb1B1cmEtd2l0aC0zNm0taW52ZXN0bWVudC_SAQA?oc=5\" target=\"_blank\">UK green hydrogen pioneer GeoPura backed with £36m investment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Barclays<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"UK green hydrogen pioneer GeoPura backed with £36m investment - Barclays","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilgFodHRwczovL2hvbWUuYmFyY2xheXMvbmV3cy9wcmVzcy1yZWxlYXNlcy8yMDIzLzAyL0dpYW50cy1vZi1pbmR1c3RyeS1tYW51ZmFjdHVyaW5nLWZpbmFuY2UtYmFjay1VSy1ncmVlbi1oeWRyb2dlbi1waW9uZWVyLUdlb1B1cmEtd2l0aC0zNm0taW52ZXN0bWVudC_SAQA?oc=5\" target=\"_blank\">UK green hydrogen pioneer GeoPura backed with £36m investment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Barclays<\/font>","source.href":"https:\/\/home.barclays","source.title":"Barclays","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"UK company GeoPura secures £36m investment from GM Ventures, Barclays Sustainable Impact Capital, SWEN CP through its fund SWEN Impact Fund for Transition 2 and Siemens Energy Ventures Investment will enable the accelerated manufacturing and deployment of Hydrogen Power Units throughout the UK GeoPura will scale its green hydrogen business, replacing fossil fuels with zero emission alternatives in power generation applications such as construction, infrastructure, outdoor events, EV charging and back-up power UK green hydrogen pioneer GeoPura has received £36m investment from global industry leaders, with the round led by GM Ventures, the investment arm of General Motors, and co-led by Barclays Sustainable Impact Capital with participation from SWEN CP and Siemens Energy Ventures to scale its green hydrogen business, which is replacing diesel-fuelled generators and enabling zero-emissions energy across the board to create a more sustainable world. The world-renowned investors will also act as strategic partners for GeoPura as it scales its hydrogen power generation technology. GeoPura currently provides hydrogen power to Balfour Beatty, HS2, National Grid and the BBC among other sustainability-driven customers, replacing traditional diesel generators with its Hydrogen Power Unit (HPU) technology. The HPUs are used for temporary, supplementary, off grid and backup power. GeoPura plans to grow the use of hydrogen into other hard-to-decarbonise areas of our energy system, such as EV charging and supplementary grid power, as economies continue to electrify. With hubs in Nottingham and Newcastle upon Tyne in the UK, the £36m investment will enable GeoPura to mass manufacture HPUs alongside partner Siemens Energy, increase the production of green hydrogen to fuel the units and drive green skills in the North East and throughout the UK, while supporting the global deployment of the technology. GeoPura plans to deploy a fleet of over 3,600 HPUs by 2033, providing clean, low-cost reliable power, and displacing more than six million tonnes of CO 2 emissions through their operation over their life. In response to customer demand, the company aims to bring a number of new products to market, addressing smaller and larger power requirements. The company will work closely with its new strategic partners to advance the technology needed to enable the mass electrification that underpins decarbonisation. Andrew Cunningham, CEO of GeoPura, said: “Green hydrogen is too often seen as a technology that will happen in the future, but GeoPura and our partners are delivering a commercially viable technology, today. The world can’t afford to wait a decade for green fuels to scale – we must act now. “This investment allows us to build on our installed base of HPUs and hydrogen production infrastructure to stimulate the green hydrogen economy, and then expand the use of clean fuels into other hard-to-decarbonise areas of our energy system. “We have secured the right mix of investors, forming strategic partnerships that not only provide the funds to enable us to scale rapidly, but also the skills and resources to accelerate the transition to zero emission fuels. With the support of our investors we can help turn the market on its head and build a green hydrogen economy this decade, not next.” “The need for green hydrogen energy solutions is expanding as a wide range of customers move toward replacing diesel-powered sources,” said Wade Sheffer, Managing Director, GM Ventures. “Our investment in GeoPura demonstrates our focus on scaling breakthrough innovations that can advance sustainability, while supporting GM’s progress toward an all-electric, zero-emissions future. GeoPura’s HPUs and GM’s HYDROTEC fuel cell expertise have the potential to provide better energy solutions across industries.” James Ferrier, Director, Principal Investments, Barclays Sustainable Impact Capital said: “Building low-carbon capacity and capability in our energy supply is key for a timely transition to net-zero. Whilst most of the focus in the UK is rightly on 'greening' our energy grid, industries which are reliant on fossil-fuel powered generators - such as construction, film production and events - should not be forgotten. Establishing tailored methods of off-grid green energy generation such as GeoPura’s Hydrogen Power Unit technology will be crucial for the decarbonisation of these industries, and we are excited to support GeoPura as they begin to scale.” François Pasquier, Investment Director at SWEN CP, said: “SWEN CP, through its impact strategy dedicated to renewable gas infrastructures in Europe, is proud to support the growth of GeoPura and to enable carbon emission reductions in hard to abate sectors. We believe that the quality of the team, the robustness of the technology and the strategic partnership with Siemens Energy are the perfect ingredients to make GeoPura a successful solution to tackle climate change.” Kendra Rauschenberger, General Partner at Siemens Energy Ventures, said: “Having worked alongside GeoPura from the early days, it has been incredible to see the development of this business as more customers turn to utilizing green hydrogen for their sustainable energy needs and commitments. At Siemens Energy Ventures, our focus is on building, investing in and scaling up start-ups that can make a real difference to the complex energy transition our world is facing. Our strategic investment, alongside the investments from all partners, make GeoPura ready for its next phase of rapid growth. We look forward to being part of the journey.” Green hydrogen is widely recognised as essential to achieve global climate goals, potentially supplying 25% of energy demand by 2050, with a $10tn addressable market, according to Goldman Sachs[1]. The UK government has set its own target to hit 10GW of low carbon hydrogen capacity this decade. However, there remain limited commercial technologies able to capitalise on this demand. GeoPura set out to prove green hydrogen as a commercially viable solution, today, to replace existing fossil fuels. Established to decarbonise global economies using zero-emission fuels, GeoPura has grown rapidly since delivering its first Hydrogen Power Unit (HPU) in collaboration with Siemens Energy in 2019. GeoPura’s HPU technology and end-to-end service is a multi-purpose replacement for diesel power worldwide and is available today. GeoPura generates hydrogen and transports the fuel to customers for use in its HPUs – customers simply rent the units and pay for the fuel used. The company is initially targeting sectors with the highest diesel use today, such as construction, infrastructure, outdoor events, and back-up power. It is also providing a solution to power commercial EV charging, where the local electricity network isn’t capable. The only by-product is pure water and heat. [1] Source: https:\/\/www.goldmansachs.com\/insights\/pages\/gs-research\/carbonomics-the-clean-hydrogen-revolution\/carbonomics-the-clean-hydrogen-revolution.pdf","filter_flag":1}
{"title":"Vestas unveils circularity solution to end landfill for turbine blades - Vestas","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LnZlc3Rhcy5jb20vZW4vbWVkaWEvY29tcGFueS1uZXdzLzIwMjMvdmVzdGFzLXVudmVpbHMtY2lyY3VsYXJpdHktc29sdXRpb24tdG8tZW5kLWxhbmRmaWxsLWZvci1jMzcxMDgxONIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LnZlc3Rhcy5jb20vZW4vbWVkaWEvY29tcGFueS1uZXdzLzIwMjMvdmVzdGFzLXVudmVpbHMtY2lyY3VsYXJpdHktc29sdXRpb24tdG8tZW5kLWxhbmRmaWxsLWZvci1jMzcxMDgxONIBAA?oc=5","id":"CBMicmh0dHBzOi8vd3d3LnZlc3Rhcy5jb20vZW4vbWVkaWEvY29tcGFueS1uZXdzLzIwMjMvdmVzdGFzLXVudmVpbHMtY2lyY3VsYXJpdHktc29sdXRpb24tdG8tZW5kLWxhbmRmaWxsLWZvci1jMzcxMDgxONIBAA","guidislink":false,"published":"Wed, 08 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=39, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LnZlc3Rhcy5jb20vZW4vbWVkaWEvY29tcGFueS1uZXdzLzIwMjMvdmVzdGFzLXVudmVpbHMtY2lyY3VsYXJpdHktc29sdXRpb24tdG8tZW5kLWxhbmRmaWxsLWZvci1jMzcxMDgxONIBAA?oc=5\" target=\"_blank\">Vestas unveils circularity solution to end landfill for turbine blades<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vestas<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Vestas unveils circularity solution to end landfill for turbine blades - Vestas","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LnZlc3Rhcy5jb20vZW4vbWVkaWEvY29tcGFueS1uZXdzLzIwMjMvdmVzdGFzLXVudmVpbHMtY2lyY3VsYXJpdHktc29sdXRpb24tdG8tZW5kLWxhbmRmaWxsLWZvci1jMzcxMDgxONIBAA?oc=5\" target=\"_blank\">Vestas unveils circularity solution to end landfill for turbine blades<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vestas<\/font>","source.href":"https:\/\/www.vestas.com","source.title":"Vestas","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Back to news Press Release: 07:33 CET • 08 Feb 2023 Vestas unveils circularity solution to end landfill for turbine blades News release from Vestas Wind Systems A\/S Aarhus, 8 February 2023 Vestas is presenting a new solution that renders epoxy-based turbine blades as circular, without the need for changing the design or composition of blade material. Combining newly discovered chemical technology developed within the CETEC initiative, and partnerships with Olin and Stena Recycling, the solution can be applied to blades currently in operation. Once matured, this will eliminate the need for blade redesign, or landfill disposal of epoxy-based blades when they are decommissioned. “Until now, the wind industry has believed that turbine blade material calls for a new approach to design and manufacture to be either recyclable, or beyond this, circular, at end of life. Going forward, we can now view old epoxy-based blades as a source of raw material. Once this new technology is implemented at scale, legacy blade material currently sitting in landfill, as well as blade material in active windfarms, can be disassembled, and re-used. This signals a new era for the wind industry, and accelerates our journey towards achieving circularity,” says Lisa Ekstrand, Vice President and Head of Sustainability at Vestas. Turbine blades have previously been challenging to recycle due to the chemical properties of epoxy resin, a resilient substance that was believed to be impossible to break down into re-usable components. This has led to many technology leaders attempting to replace or modify epoxy resin with alternatives that can be more easily treated. Vestas’ solution is enabled by a novel chemical process that can chemically break down epoxy resin into virgin-grade materials. The chemical process was developed in collaboration with Aarhus University, Danish Technological Institute, and Olin the partners of the CETEC project, a coalition of industry and academia established to investigate circular technology for turbine blades. “The newly discovered chemical process shows that epoxy-based turbine blades, whether in operation or sitting in landfill, can be turned into a source of raw material to potentially build new turbine blades. As the chemical process relies on widely available chemicals, it is highly compatible for industrialisation, and can therefore be scaled up quickly. This innovation would not have been possible without the ground-breaking CETEC collaboration between industry and academia enabling our progress until this point,” says Mie Elholm Birkbak, Specialist, Innovation & Concepts at Vestas. Through a newly established value chain, supported by Nordic recycling leader Stena Recycling and global epoxy manufacturer Olin, Vestas will now focus on scaling up the novel chemical disassembly process into a commercial solution. Once mature, the solution will signal the beginning of a circular economy for all existing, and future epoxy-based turbine blades. “As the leading customer solution provider of innovative epoxy systems, Olin is proud to support the anticipated massive expansion in wind energy worldwide. By utilising unique technologies, together with our partners, we are ready to recover molecules and convert them into new epoxies that can be re-used in wind turbine blades. We are excited to bring our expertise and unique asset footprint to this partnership, and realize breakthrough sustainable material solutions for existing wind blades and those of the future”, says Verghese Thomas, Vice President, Epoxy Systems and Growth Platforms at Olin. “In the coming years, thousands of turbines will be decommissioned or repowered, representing a major sustainability challenge but also a valuable source of composite materials. As one of Europe’s leading recycling groups with a wide footprint in Europe, we have a central role in the transition to a circular economy. We see this solution as a huge opportunity to take part in making a sustainable solution even more sustainable and circular and are ready to apply our chemical recycling expertise and knowledge to this process”, says Henrik Grand Petersen, MD Stena Recycling Denmark. For several decades, producing wind turbine blades manufactured with epoxy-based resin has been standard practice in the wind industry. In the most mature markets for wind energy, the first turbines are reaching the end of their operational life and this will increase over the coming years. WindEurope expects around 25,000 tonnes of blades to reach the end of their operational life annually by 2025. Once mature, the new solution will provide Vestas with the opportunity to produce new turbine blades made from re-used blade material. In the future, the new solution also signals the possibility to make all epoxy-based composite material a source of raw material for a broader circular economy, potentially encompassing industries beyond wind energy. For more information, please contact: Kristian Holmelund Jakobsen Lead Specialist, Communication and Press Tel: +45 5221 1467 Mail: KRHJA@vestas.com About Vestas Vestas is the energy industry’s global partner on sustainable energy solutions. We design, manufacture, install, and service onshore and offshore wind turbines across the globe, and with more than 160 GW of wind turbines in 88 countries, we have installed more wind power than anyone else. Through our industry-leading smart data capabilities and unparalleled more than 140 GW of wind turbines under service, we use data to interpret, forecast, and exploit wind resources and deliver best-in-class wind power solutions. Together with our customers, Vestas’ more than 28,000 employees are bringing the world sustainable energy solutions to power a bright future. For updated Vestas photographs and videos, please visit our media images page on: https:\/\/www.vestas.com\/en\/media\/images. We invite you to learn more about Vestas by visiting our website at www.vestas.com and following us on our social media channels: About Olin Olin Corporation is a leading vertically-integrated global manufacturer and distributor of chemical products and a leading U.S. manufacturer of ammunition. The chemical products produced include chlorine and caustic soda, vinyls, epoxies, chlorinated organics, bleach, hydrogen, and hydrochloric acid. Winchester's principal manufacturing facilities produce and distribute sporting ammunition, law enforcement ammunition, reloading components, small caliber military ammunition and components, and industrial cartridges. For more information, visit www.olin.com About Stena Recycling Stena Recycling plays an important and central role in the transition to a circular economy by offering services and comprehensive solutions within recycling and efficient resource management. With more than 3000 committed employees and 178 facilities across eight markets, Stena Recycling annually recycles nearly six million tons of waste and end-of-life products from more than 100,000 customers across a range of industries. The recycled raw materials, including ferrous and non-ferrous metals, plastic, and paper, are resold as feedstock for the manufacture of new products. Stena Recycling operates in Sweden, Denmark, Norway, Finland, Poland, Italy, and Germany and the USA. Stena Recycling is part of the Stena Metall Group For more information, visit www.stenarecycling.com About Danish Technological Institute Danish Technological Institute (DTI) is an independent research and development institute. At DTI, we deliver sustainable and exceptional competitiveness through decisive technological knowledge translated into action. With more than 12,000 customers in 65 countries, we develop new knowledge through research and development activities in close corporation with Danish and international companies and research institutes. For more info, visit www.dti.dk or contact project manager Søren Haack at sorh@dti.dk. About Aarhus University Aarhus University is a globally oriented, academically diverse, and research-intensive university. Aarhus University ranks among the top 100 universities in the world on several of the most important international ranking lists, out of over 17,000 universities worldwide. Around 12 per cent of AU’s 40.000 students are international, representing over 120 nationalities. Aarhus University offers state-of-the-art facilities and laboratories having a strong tradition of multidisciplinary research for instance in one of our 42 major research centres. The university’s goal is to contribute towards solving the complex global challenges facing the world. The university therefore strives to combine the high level of academic standards of its researchers with collaboration across disciplinary boundaries to combine research in new ways and solve challenges in close contact with the world around us. For more information please visit: https:\/\/www.au.dk\/ About the CETEC project The CETEC (Circular Economy for Thermosets Epoxy Composites) initiative established in May 2021 by Aarhus University, Danish Technological Institute, Olin, and Vestas, and partly funded by the Innovation Fund Denmark focuses on advancing the adoption of a circular economy across the wind industry. The CETEC initiative is a three-year project that builds on the DreamWind initiative and addresses the lack of available recycling technology for epoxy resins. The project not only aims to increase the blade recyclability but also strives for full circularity by enabling to feed recycled materials of old blades back into the production of new blades.","filter_flag":1}
{"title":"Lennox Commercial Sets New Standard for Performance, Efficiency and Serviceability in Packaged Rooftop Units with ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMitQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xlbm5veC1jb21tZXJjaWFsLXNldHMtbmV3LXN0YW5kYXJkLWZvci1wZXJmb3JtYW5jZS1lZmZpY2llbmN5LWFuZC1zZXJ2aWNlYWJpbGl0eS1pbi1wYWNrYWdlZC1yb29mdG9wLXVuaXRzLXdpdGgtbmV3LXByb2R1Y3RzLTMwMTczNzQ1NC5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMitQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xlbm5veC1jb21tZXJjaWFsLXNldHMtbmV3LXN0YW5kYXJkLWZvci1wZXJmb3JtYW5jZS1lZmZpY2llbmN5LWFuZC1zZXJ2aWNlYWJpbGl0eS1pbi1wYWNrYWdlZC1yb29mdG9wLXVuaXRzLXdpdGgtbmV3LXByb2R1Y3RzLTMwMTczNzQ1NC5odG1s0gEA?oc=5","id":"CBMitQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xlbm5veC1jb21tZXJjaWFsLXNldHMtbmV3LXN0YW5kYXJkLWZvci1wZXJmb3JtYW5jZS1lZmZpY2llbmN5LWFuZC1zZXJ2aWNlYWJpbGl0eS1pbi1wYWNrYWdlZC1yb29mdG9wLXVuaXRzLXdpdGgtbmV3LXByb2R1Y3RzLTMwMTczNzQ1NC5odG1s0gEA","guidislink":false,"published":"Thu, 02 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=2, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=33, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMitQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xlbm5veC1jb21tZXJjaWFsLXNldHMtbmV3LXN0YW5kYXJkLWZvci1wZXJmb3JtYW5jZS1lZmZpY2llbmN5LWFuZC1zZXJ2aWNlYWJpbGl0eS1pbi1wYWNrYWdlZC1yb29mdG9wLXVuaXRzLXdpdGgtbmV3LXByb2R1Y3RzLTMwMTczNzQ1NC5odG1s0gEA?oc=5\" target=\"_blank\">Lennox Commercial Sets New Standard for Performance, Efficiency and Serviceability in Packaged Rooftop Units with ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Lennox Commercial Sets New Standard for Performance, Efficiency and Serviceability in Packaged Rooftop Units with ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMitQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xlbm5veC1jb21tZXJjaWFsLXNldHMtbmV3LXN0YW5kYXJkLWZvci1wZXJmb3JtYW5jZS1lZmZpY2llbmN5LWFuZC1zZXJ2aWNlYWJpbGl0eS1pbi1wYWNrYWdlZC1yb29mdG9wLXVuaXRzLXdpdGgtbmV3LXByb2R1Y3RzLTMwMTczNzQ1NC5odG1s0gEA?oc=5\" target=\"_blank\">Lennox Commercial Sets New Standard for Performance, Efficiency and Serviceability in Packaged Rooftop Units with ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"The Lennox Rooftop Series, now complete with the launch of Enlight™ and Xion™, provides powerful new product lines engineered to fit any application. RICHARDSON, Texas, Feb. 2, 2023 \/PRNewswire\/ -- Lennox, a leader in the commercial rooftop HVAC market, enhances its comprehensive selection of top-performing packaged rooftop units with the introduction of the Enlight™ and Xion™ product lines. With a wide range of performance, efficiency, and service-friendly features, the Enlight™ and Xion™ product lines ensure customers have the right product offering to meet changing federal energy standards for 2023 and an offering for customers that value total cost of ownership. Lennox Commercial’s Enlight™ Product Family Minimizes Environmental Impact and Maximizes Efficiency \"We're continuing to transform the industry with Enlight™ and Xion™ after kicking off the Rooftop Revolution with our premium Model L unit and the Lennox® CORE Control System,\" said Eddie Chavez, Director of Product Management for Lennox Commercial. \"Our solutions are the result of partnering with our customers to develop products that meet their needs for energy efficiency, indoor air quality, and serviceability. In addition, our innovative and industry-leading products position them to adapt in an evolving regulatory environment and help meet ESG objectives.\" Enlight™ Minimizes Environmental Impact and Maximizes Efficiency The Enlight™ product line of rooftop units minimizes environmental impact through exceptional efficiency and sustainable design while providing extreme flexibility, engineered intelligence, and simple service. Enlight™ units include the Lennox® CORE Control System, an intuitive rooftop controller that enables real-time data through connectivity, integration, and optimization. Enlight™ Product Highlights: A comprehensive, high-efficiency product line consisting of 3-25 ton gas-electric and electric-electric models and 2-20 ton heat pump and dual fuel heat pump models. Energy-saving efficiency ratings of up to 17.8 SEER, 17.0 IEER, and 13.3 EER qualify for energy rebates and incentives. Environ™ Coil System with up to 52% less refrigerant and up to 59% lighter than traditional coil systems, reducing overall environmental impact. Lennox® CORE Unit Controller uses advanced sensor inputs to optimize real-time operation and maximize energy efficiency and space comfort. Efficient maintenance and service operations that reduce operational costs and minimize downtime. Xion™ Delivers Reliable Performance and Serviceability Xion™ roof-ready units are engineered to meet standard efficiency requirements while delivering reliable performance, year-round comfort, and a serviceable design. Xion™ product highlights: Field flexibility, with more than 100 field-installed accessories that allow quick modification of units to fit the application. Environ™ coil system to provide reliable performance and stand up to the rigors of everyday use year after year. MSAV® supply fan technology can provide up to 75% fan power savings while improving comfort. Humiditrol® dehumidification technology provides excellent humidity control in the toughest applications. Isolated compressor compartment allows performance checks while the unit is working without interrupting airflow. Quick and convenient gas compartment accessibility. \"Our Enlight™ and Xion™ product lines, combined with our Model L offering, give customers a complete range of commercial HVAC solutions for any application,\" said Tate Byers, Product Manager for Lennox Commercial. \"The sustainable energy-efficiency of Enlight™ and the proven performance and comfort provided by Xion™ are enhanced by flexibility, convenient serviceability, and smart connections that Lennox users expect. These powerful innovations ensure that our customers are equipped for today's heating and cooling needs as well as future challenges.\" \"This is a continuation of the Rooftop Revolution which started with Model L, establishing premium heating and cooling solutions,\" Chavez said. With Enlight™ and Xion™, Lennox now offers the most comprehensive selection of advanced light commercial rooftop units. For more information about the Lennox Enlight™ and Xion™, visit https:\/\/www.lennoxcommercial.com. About Lennox Lennox (NYSE: LII) is a leader in energy-efficient climate-control solutions. Dedicated to sustainability and creating comfortable and healthier environments for our residential and commercial customers while reducing their carbon footprint, we lead the field in innovation with our air conditioning, heating, indoor air quality, and refrigeration systems. MEDIA CONTACT: Lennox Public Relations [email protected] 972-497-7133 SOURCE Lennox International Inc.","filter_flag":1}
{"title":"LiTime: New Possibilities in the Lithium Battery Industry - Yahoo Finance","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9saXRpbWUtcG9zc2liaWxpdGllcy1saXRoaXVtLWJhdHRlcnktaW5kdXN0cnktMTcwMDAwOTk0Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9saXRpbWUtcG9zc2liaWxpdGllcy1saXRoaXVtLWJhdHRlcnktaW5kdXN0cnktMTcwMDAwOTk0Lmh0bWzSAQA?oc=5","id":"CBMiW2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9saXRpbWUtcG9zc2liaWxpdGllcy1saXRoaXVtLWJhdHRlcnktaW5kdXN0cnktMTcwMDAwOTk0Lmh0bWzSAQA","guidislink":false,"published":"Tue, 14 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=45, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9saXRpbWUtcG9zc2liaWxpdGllcy1saXRoaXVtLWJhdHRlcnktaW5kdXN0cnktMTcwMDAwOTk0Lmh0bWzSAQA?oc=5\" target=\"_blank\">LiTime: New Possibilities in the Lithium Battery Industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"LiTime: New Possibilities in the Lithium Battery Industry - Yahoo Finance","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9saXRpbWUtcG9zc2liaWxpdGllcy1saXRoaXVtLWJhdHRlcnktaW5kdXN0cnktMTcwMDAwOTk0Lmh0bWzSAQA?oc=5\" target=\"_blank\">LiTime: New Possibilities in the Lithium Battery Industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance<\/font>","source.href":"https:\/\/finance.yahoo.com","source.title":"Yahoo Finance","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"LiTime LiFePO4 battery Check out LiTime LiFePO4 battery! image1.jpeg SHENZHEN, China, Feb. 14, 2023 (GLOBE NEWSWIRE) -- LiTime, an innovative leader in LiFePO4 lithium batteries and renewable energy solutions, last December announced its rebranding from the former Ampere Time. The brand’s revolutionary LiFePO4 battery features automotive-grade LiFePO4 cells that deliver 4000+ deep cycles at 100% Depth of Discharge (DoD), 6000+ cycles at 80% DoD, and 15000+ cycles at 60% DoD, meaning the smaller the discharge, the longer the battery will last. Its self-developed intelligent BMS provides accurate and precise protection for high-grade LiFePO4 batteries. This product has also become the safest, most reliable, and eco-friendly battery for outdoor and home use today. LiTime has been committed to offering lighter weight, more power, and maintenance-free energy storage batteries and solutions for its customers, with a vision that everyone lives a better life when powered by LiTime. LiTime’s current product line includes LiFePO4 batteries, supporting chargers, and MPPT solar charge controllers. In the first half of 2023, LiTime is bringing the market a whole set of new products, including solar panels, portable power stations, battery boxes, inverters, and more, to perfect its all-in-one energy solutions. Early in the brand’s rebranding announcement on December 14th, 2022, Luny Lu, CEO at LiTime, said, “In the next years, we’ll experience more innovative progress in developing sustainable energy products and solutions to provide people with one-stop energy solutions.” He added, “We’re dedicated to driving a sustainable future and keep well on our way to helping people optimize their energy usage and storage.” As a well-known pioneer in solar energy storage solutions for outdoors, home solar systems, and more off-grid applications, LiTime has evolved the industry with innovative and cost-effective LiFePO4 lithium batteries and has further distinguished itself from other competitors with exceptional customer service. About LiTime (aka Ampere Time) LiTime brand belongs to Shenzhen LiTime Technology Co., Ltd. For 14 years, LiTime has provided safe and convenient LiFePO4 batteries and one-stop energy solutions for people and families worldwide to make power safe and easy and help people achieve energy independence. LiTime’s solar panels and portable power stations will begin shipping in the first quarter of this year. Interested outdoor enthusiasts can visit https:\/\/www.litime.com\/ for more information. Media Contact Official Website: www.LiTime.com Email: service@litime.com Story continues A photo accompanying this announcement is available at https:\/\/www.globenewswire.com\/NewsRoom\/AttachmentNg\/08de5c3b-813b-4a5d-99a3-de1029195e1e ","filter_flag":1}
{"title":"Top 10 electric vehicle charging providers in Europe - EV Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vZXZtYWdhemluZS5jb20vdG9wMTAvdG9wLTEwLWVsZWN0cmljLXZlaGljbGUtY2hhcmdpbmctcHJvdmlkZXJzLWluLWV1cm9wZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vZXZtYWdhemluZS5jb20vdG9wMTAvdG9wLTEwLWVsZWN0cmljLXZlaGljbGUtY2hhcmdpbmctcHJvdmlkZXJzLWluLWV1cm9wZdIBAA?oc=5","id":"CBMiUWh0dHBzOi8vZXZtYWdhemluZS5jb20vdG9wMTAvdG9wLTEwLWVsZWN0cmljLXZlaGljbGUtY2hhcmdpbmctcHJvdmlkZXJzLWluLWV1cm9wZdIBAA","guidislink":false,"published":"Wed, 15 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=15, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=46, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vZXZtYWdhemluZS5jb20vdG9wMTAvdG9wLTEwLWVsZWN0cmljLXZlaGljbGUtY2hhcmdpbmctcHJvdmlkZXJzLWluLWV1cm9wZdIBAA?oc=5\" target=\"_blank\">Top 10 electric vehicle charging providers in Europe<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EV Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 10 electric vehicle charging providers in Europe - EV Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vZXZtYWdhemluZS5jb20vdG9wMTAvdG9wLTEwLWVsZWN0cmljLXZlaGljbGUtY2hhcmdpbmctcHJvdmlkZXJzLWluLWV1cm9wZdIBAA?oc=5\" target=\"_blank\">Top 10 electric vehicle charging providers in Europe<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EV Magazine<\/font>","source.href":"https:\/\/evmagazine.com","source.title":"EV Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"The most sustainable era of mobility is coming, but much of its success hinges on electric vehicle (EV) charging capabilities. With more than nine million EVs sold across Europe—accounting for around 12% of overall adoption, charging providers like these will provide consumers and businesses with the infrastructure to increase their use of electrified cars. 10. Efacec The leading portuguese EV charging station provider, Efacec was founded in 1948 and, with 2,400 employees, aims to create value through environmental commitment. The business is a major exporter of original equipment to over 65 countries, developing solutions, such as motors, generators, transformers, and other electrical accessories for commercial EV charging. 9. EVBox Featured in the March issue of EV Magazine, EVBox develops solutions for both commercial and residential applications, recognising the demand for electrification infrastructure in harder to reach areas within cities. ","filter_flag":1}
{"title":"Breakthrough technology transforms waste plastic bottles into polymers for lithium-ion batteries - EurekAlert","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiL2h0dHBzOi8vd3d3LmV1cmVrYWxlcnQub3JnL25ld3MtcmVsZWFzZXMvOTc5MjE00gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiL2h0dHBzOi8vd3d3LmV1cmVrYWxlcnQub3JnL25ld3MtcmVsZWFzZXMvOTc5MjE00gEA?oc=5","id":"CBMiL2h0dHBzOi8vd3d3LmV1cmVrYWxlcnQub3JnL25ld3MtcmVsZWFzZXMvOTc5MjE00gEA","guidislink":false,"published":"Wed, 08 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=39, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiL2h0dHBzOi8vd3d3LmV1cmVrYWxlcnQub3JnL25ld3MtcmVsZWFzZXMvOTc5MjE00gEA?oc=5\" target=\"_blank\">Breakthrough technology transforms waste plastic bottles into polymers for lithium-ion batteries<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EurekAlert<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Breakthrough technology transforms waste plastic bottles into polymers for lithium-ion batteries - EurekAlert","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiL2h0dHBzOi8vd3d3LmV1cmVrYWxlcnQub3JnL25ld3MtcmVsZWFzZXMvOTc5MjE00gEA?oc=5\" target=\"_blank\">Breakthrough technology transforms waste plastic bottles into polymers for lithium-ion batteries<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EurekAlert<\/font>","source.href":"https:\/\/www.eurekalert.org","source.title":"EurekAlert","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"SINGAPORE – A team of A*STAR scientists has successfully upcycled waste polyethylene terephthalate (PET) plastic into polymer electrolytes, which are key components for safer lithium-ion batteries (LiBs). The study is the first known report of a working lithium-ion battery assembled using polymers upcycled from PET plastics, which are used to make plastic bottles. The study was published in Journal of Materials Chemistry A in November 2022. Plastic waste is a mounting problem in the world today, and it is set to grow bigger with the rising demand for plastics. 460 million tons of plastics were produced globally in 2019, but only 9% are recycled, with the remainder either being incinerated or disposed in landfills and the environment[1]. Plastic waste is conventionally recycled through mechanical and chemical processes, which have their drawbacks. For mechanical recycling, only a small proportion of recycled PET can eventually be used, as their physical properties degrade with each round of recycling due to polymer chain cleavage. Chemical recycling involves high energy usage, requires purified monomers and can be more costly compared to using virgin polymers. “Upcycling waste plastics is a new strategy to give these ubiquitous yet commonly discarded materials a new lease of life to transform them into value-added new products for novel applications. PET plastics offer great potential for upcycling due to their well-established existing waste collection infrastructure and relatively uncomplicated waste streams,” said Dr Derrick Fam, Deputy Head of the Polymer Composites department at A*STAR’s Institute of Materials Research and Engineering (IMRE), who led this study together with Dr Jason Lim, Deputy Head of the Soft Materials department at IMRE. “There is a rise in demand for sustainably-sourced materials for lithium-ion batteries due to greater electrification. However, the use of waste PET plastics as a resource for polymer electrolytes has never been achieved till now. This represents our first attempt to upcycle waste PET plastics for this application”, said Dr Lim. UNLOCKING THE POTENTIAL OF PET: CAPITALISING ON EXISTING PROPERTIES Amongst the different types of plastic, polyethylene terephthalate (PET) is one of the most abundant plastics produced today, amounting to 31 million tonnes in 2019[2]. PET plastics possess existing features that make them suitable to be upcycled into polymer electrolytes (PEs). They are made up of rigid terephthalate components, which contribute to their excellent mechanical properties and can be tapped on to enhance PEs’ mechanical robustness, which in turn facilitates device integration and fabrication. In addition, they possess easily breakable chemical bonds which allow these polymers to be repurposed into new chemical building blocks with ease. These can then be reconstituted into new polymers for fresh applications. FROM BOTTLES TO BATTERIES: REVOLUTIONISING BATTERY DESIGN Waste PET bottles were used by the team to design polyurethane-based PEs. Compared to conventional liquid electrolytes currently used in LiBs, PEs are promising alternative components in batteries that have the potential to eliminate safety hazards such as the risks of electrolyte leakage, uncontrolled heating, volume expansion, dendrite growth and fire hazards. After assessing the viability of the PET-derived polymers as solid polymer electrolytes, the team further evaluated their ionic conductivity and cycling performance when used as gel polymer electrolytes for LiBs. Findings from the study showed the potential of the polyurethanes derived from waste PET as polymer electrolytes for LiBs. They achieved a room temperature conductivity of 10-4 S\/cm as a gel-polymer electrolyte (GPE), which is comparable to existing commercial systems containing liquid electrolytes. The team also successfully assembled a working LiB using these polymers, and showed that cells can be repeatedly charged and discharged up to 150 cycles. Their promising performance paves the way for a future powered by more sustainable energy, where PET plastic waste can be transformed into PE materials for batteries, creating a circular economy while combating the mounting plastic waste issue. The team will also look to advance the technology for upcycling of waste plastics on a larger scale to create components for eco-friendly batteries. This initiative is in line with A*STAR’s efforts to develop sustainable solutions for energy efficiency and waste management. About the Agency for Science, Technology and Research (A*STAR) The Agency for Science, Technology and Research (A*STAR) is Singapore's lead public sector R&D agency. Through open innovation, we collaborate with our partners in both the public and private sectors to benefit the economy and society. As a Science and Technology Organisation, A*STAR bridges the gap between academia and industry. Our research creates economic growth and jobs for Singapore, and enhances lives by improving societal outcomes in healthcare, urban living, and sustainability. A*STAR plays a key role in nurturing scientific talent and leaders for the wider research community and industry. A*STAR’s R&D activities span biomedical sciences to physical sciences and engineering, with research entities primarily located in Biopolis and Fusionopolis. For ongoing news, visit www.a-star.edu.sg. [1] Global Plastics Outlook, Organisation for Economic Cooperation and Development (OECD), 2022. [2] Statista: Production capacity of polyethylene terephthalate worldwide from 2014 to 2024, https:\/\/www.statista.com\/statistics\/242764\/globalpolyethylene-terephthalate-production-capacity\/).","filter_flag":1}
{"title":"The Company's Focus On Innovation And Commitment To Delivering The Highest Quality Products Has Also Been A ... - SolarQuarter","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi6AFodHRwczovL3NvbGFycXVhcnRlci5jb20vMjAyMy8wMi8wOS90aGUtY29tcGFueXMtZm9jdXMtb24taW5ub3ZhdGlvbi1hbmQtY29tbWl0bWVudC10by1kZWxpdmVyaW5nLXRoZS1oaWdoZXN0LXF1YWxpdHktcHJvZHVjdHMtaGFzLWFsc28tYmVlbi1hLWhpZ2hsaWdodC1vZi1teS1leHBlcmllbmNlLXNvLWZhci1hYmhpamVldC1tb3JlLXNhbGVzLWhlYWQtaW5kaWEtc21hLXNvbGFyLXRlY2hub2xvZ3ktYWcv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi6AFodHRwczovL3NvbGFycXVhcnRlci5jb20vMjAyMy8wMi8wOS90aGUtY29tcGFueXMtZm9jdXMtb24taW5ub3ZhdGlvbi1hbmQtY29tbWl0bWVudC10by1kZWxpdmVyaW5nLXRoZS1oaWdoZXN0LXF1YWxpdHktcHJvZHVjdHMtaGFzLWFsc28tYmVlbi1hLWhpZ2hsaWdodC1vZi1teS1leHBlcmllbmNlLXNvLWZhci1hYmhpamVldC1tb3JlLXNhbGVzLWhlYWQtaW5kaWEtc21hLXNvbGFyLXRlY2hub2xvZ3ktYWcv0gEA?oc=5","id":"CBMi6AFodHRwczovL3NvbGFycXVhcnRlci5jb20vMjAyMy8wMi8wOS90aGUtY29tcGFueXMtZm9jdXMtb24taW5ub3ZhdGlvbi1hbmQtY29tbWl0bWVudC10by1kZWxpdmVyaW5nLXRoZS1oaWdoZXN0LXF1YWxpdHktcHJvZHVjdHMtaGFzLWFsc28tYmVlbi1hLWhpZ2hsaWdodC1vZi1teS1leHBlcmllbmNlLXNvLWZhci1hYmhpamVldC1tb3JlLXNhbGVzLWhlYWQtaW5kaWEtc21hLXNvbGFyLXRlY2hub2xvZ3ktYWcv0gEA","guidislink":false,"published":"Thu, 09 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=9, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=40, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi6AFodHRwczovL3NvbGFycXVhcnRlci5jb20vMjAyMy8wMi8wOS90aGUtY29tcGFueXMtZm9jdXMtb24taW5ub3ZhdGlvbi1hbmQtY29tbWl0bWVudC10by1kZWxpdmVyaW5nLXRoZS1oaWdoZXN0LXF1YWxpdHktcHJvZHVjdHMtaGFzLWFsc28tYmVlbi1hLWhpZ2hsaWdodC1vZi1teS1leHBlcmllbmNlLXNvLWZhci1hYmhpamVldC1tb3JlLXNhbGVzLWhlYWQtaW5kaWEtc21hLXNvbGFyLXRlY2hub2xvZ3ktYWcv0gEA?oc=5\" target=\"_blank\">The Company's Focus On Innovation And Commitment To Delivering The Highest Quality Products Has Also Been A ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SolarQuarter<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Company's Focus On Innovation And Commitment To Delivering The Highest Quality Products Has Also Been A ... - SolarQuarter","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi6AFodHRwczovL3NvbGFycXVhcnRlci5jb20vMjAyMy8wMi8wOS90aGUtY29tcGFueXMtZm9jdXMtb24taW5ub3ZhdGlvbi1hbmQtY29tbWl0bWVudC10by1kZWxpdmVyaW5nLXRoZS1oaWdoZXN0LXF1YWxpdHktcHJvZHVjdHMtaGFzLWFsc28tYmVlbi1hLWhpZ2hsaWdodC1vZi1teS1leHBlcmllbmNlLXNvLWZhci1hYmhpamVldC1tb3JlLXNhbGVzLWhlYWQtaW5kaWEtc21hLXNvbGFyLXRlY2hub2xvZ3ktYWcv0gEA?oc=5\" target=\"_blank\">The Company's Focus On Innovation And Commitment To Delivering The Highest Quality Products Has Also Been A ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SolarQuarter<\/font>","source.href":"https:\/\/solarquarter.com","source.title":"SolarQuarter","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"In an exclusive interview with SolarQuarter, Abhijeet More, Sales Head India – Commercial & Home Business, SMA Solar India shares his experience at SMA Solar, their products’ key differentiating factors, and his growth plan for the company. Abhijeet has been selected as a Digital Influencing Volunteer at the United Nations Global week to Act for SDGs and holds various esteemed titles including Senior Green Ambassador, Climate Advocate, Global Goodwill Ambassador, and Energy Swaraj Warrior. Recently, he was also chosen as an Atal Mentor of Change by the Government of India’s NITI Ayog. With over 5,000 subscribers, Abhijeet’s weekly LinkedIn newsletter, where he shares his experiences and contributions towards the Sustainable Development Goals (SDGs) and climate change, has gained a substantial following. To commemorate India’s 75th independence day, Abhijeet has pledged to perform 75 activities towards the SDGs throughout the year, showcasing his dedication to both society and the environment. Here are the excerpts from the conversation. Congratulations on your new role! Tell us how has the experience at SMA Solar been so far. I am excited to work for SMA Solar India because SMA is a leading global player in the solar industry. I work with a talented team of professionals and together we strive to provide world-class solutions to our customers. My experience at SMA so far has been great. I got to know SMA when I installed the advanced and user-friendly SMA solar inverters on my first project. I was impressed with the built-in solutions and remote monitoring portal that made the installation process a breeze. This experience solidified my admiration for the German brand, and I have always dreamed of working for SMA. SMA has a clear vision for the renewable, decentralized and climate-friendly energy supply of the future. More than 110 GW of power with SMA solar inverters are already installed worldwide – and the trend is rising. Thanks to a high level of innovation, SMA is launching new products on the market for commercial and industrial applications as well as for home applications and is striving to expand its production capacity. The company’s focus on innovation and commitment to delivering the highest quality products has also been a highlight of my experience so far. I look forward to continuing to contribute to its growth and success in the future. And I am truly proud to be part of a company that is making a positive impact on the environment. Please highlight on few key differentiating factors of SMA products. SMA Solar Technology AG is a global leader in photovoltaic system technology and has more than 40 years of experience in the solar industry. The company holds more than 1700 patents and is at the forefront of innovation and technological advancement in the industry. SMA is constantly looking for new and innovative ways to improve its products and solutions and ensure that renewable energy supplies advance. SMA is known for manufacturing high-quality inverters and innovative energy solutions that withstand extreme temperatures and harsh environmental conditions and excel in performance and reliability. SMA values the trust of its customers and places great emphasis on building long-term relationships based on honesty and integrity. The company strives to provide its customers with accurate and transparent information and deliver products that meet their needs and exceed their expectations. SMA has a strong global presence with a strong worldwide sales and service network. This enables the company to provide the best possible service and support to its customers, regardless of where they are located. What have you learned in recent years that you would like to implement in the future? I have been working in the solar industry for many years and have gained a lot of experience working with European manufacturers during my career. Therefore, I have a deep understanding of premium brand customers. This has contributed to me being named one of “India’s Top 40 under 40 most promising young business leaders” in 2019. Despite the highly competitive and price sensitive Indian market, I have been able to develop successful sales strategies and achieve high sales volume and profitable margins. Going forward, I would like to continue to contribute all my skills and strategies and work towards making SMA the preferred brand in the Indian industry. I am confident that with my experience and passion for the industry, I will be able to make a valuable contribution to SMA and advance climate-friendly energy. I am proud to be share my passion with more than 26,000 followers on LinkedIn. This is a fantastic and valuable opportunity to stay in close contact with and support our customers in the future. What is your aim for SMA in the next 5 years? My goal for SMA in the next 5 years is to contribute to consolidate its position as the preferred and trusted solar inverter company in India. I am aware of the growing demand for high quality inverters in the Indian market and believe that customers appreciate the benefits of high quality inverters and power solutions. My target is to drive growth and success through strong partnerships and help make SMA the inverter brand of choice, delivering best return on investment to customers. I am confident that our extended warranty program of 20 years and our best in class after-sales service will provide excellent support to our customers throughout the entire life cycle of the system. I am also convinced that SMA will play a valuable role in helping India become a net- zero country by 2050 and achieve its solar target of 300 GW by 2030, making India a world leader in the use of climate-friendly solar energy. Like this: Like Loading...","filter_flag":1}
{"title":"London's Best Sustainable Beauty Salons 2023 - Health & Beauty - Country and Town House","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmNvdW50cnlhbmR0b3duaG91c2UuY29tL3N0eWxlL2hlYWx0aC1hbmQtYmVhdXR5L2xvbmRvbi1zdXN0YWluYWJsZS1iZWF1dHktc2Fsb25zL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmNvdW50cnlhbmR0b3duaG91c2UuY29tL3N0eWxlL2hlYWx0aC1hbmQtYmVhdXR5L2xvbmRvbi1zdXN0YWluYWJsZS1iZWF1dHktc2Fsb25zL9IBAA?oc=5","id":"CBMiXWh0dHBzOi8vd3d3LmNvdW50cnlhbmR0b3duaG91c2UuY29tL3N0eWxlL2hlYWx0aC1hbmQtYmVhdXR5L2xvbmRvbi1zdXN0YWluYWJsZS1iZWF1dHktc2Fsb25zL9IBAA","guidislink":false,"published":"Fri, 03 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=3, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=34, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmNvdW50cnlhbmR0b3duaG91c2UuY29tL3N0eWxlL2hlYWx0aC1hbmQtYmVhdXR5L2xvbmRvbi1zdXN0YWluYWJsZS1iZWF1dHktc2Fsb25zL9IBAA?oc=5\" target=\"_blank\">London's Best Sustainable Beauty Salons 2023 - Health & Beauty<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Country and Town House<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"London's Best Sustainable Beauty Salons 2023 - Health & Beauty - Country and Town House","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmNvdW50cnlhbmR0b3duaG91c2UuY29tL3N0eWxlL2hlYWx0aC1hbmQtYmVhdXR5L2xvbmRvbi1zdXN0YWluYWJsZS1iZWF1dHktc2Fsb25zL9IBAA?oc=5\" target=\"_blank\">London's Best Sustainable Beauty Salons 2023 - Health & Beauty<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Country and Town House<\/font>","source.href":"https:\/\/www.countryandtownhouse.com","source.title":"Country and Town House","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Sustainability isn’t the first thing that comes to mind when you’re booking a manicure or looking to get your highlights redone, but when you’re (hopefully) doing away with straws, toting a tote bag around the supermarket and always carrying your reusable coffee cup, why compromise on where you get your beauty treatments? The most powerful thing we have as consumers is choice, and each decision is an opportunity to make a difference. Here’s our round-up of London’s best sustainable beauty salons. The Best Spas in the UK London’s Best Sustainable Beauty Salons 2022 Blue Tit Blue Tit is the first hairdressing salon group in Europe to become B Corp certified. In the last year alone, the salon has offset 110 per cent of its emissions, created a transparent impact report (which you can find here) and prevented over 10,000 plastic bottles from entering landfill or ocean waters. The salon is also in the process of switching its electricity supply to Haven Power, which generates energy using responsibly sourced, compressed wood pellets and produces 86 per cent less carbon than coal-generated energy, and uses biodegradable towels from Scrummi and Eco Head shower heads to help save water – a big issue to tackle when hundred of heads of hair are washed in the salon each day. BOOK IT: bluetitlondon.com Neil Moodie Studio UK hairstylist Neil Moodie – whose clients include Nicola Coughlan, Jodie Comer and Claire Foy – has opened a new conscious hair salon in East London, marking the stylist’s first solo venture. Neil’s goal is to offer incredible hair cutting and colouring, serviced as consciously as possible and accessible to all. Stylists are trained in all hair types, prices are gender neutral (with costs reflecting the level of service received) and the studio has partnered with the Green Salon Collective to uphold sustainability standards. Think Eco Head taps, sustainable energy, Scrummi compostable hair towels and Vish colour weighing scales to reduce waste. BOOK IT: neilmoodiestudio.com Butchers Salon Since their Hackney salon opened in 2014, Butchers have been proving that ethical hair cuts can still be cutting edge. With tables repurposed out of wooden crates, fluorescent tube lighting, and ivy draped steel pipes supporting shelves of shampoo, their city-chic meets sustainability décor is the height of cool. It’s also sustainable, with products and furnishings provided by local businesses. The same goes for the guest experience, which marries eco-conscious choices with modern comforts. Expect an iPad on arrival (instead of paper-wasting magazines), a biodegradable towel, plant-based refreshments and a playlist of independent artists to listen to while you sit back and enjoy your complementary aromatherapy experience (comes free with every treatment). If this wasn’t cool enough, all their treatments are gender-neutral with gender-neutral pricing. Based on their new Hoxton branch and the third Camden salon in the pipeline, it’s clear Butcher’s formula for trendy sustainability is a hit – you’ll walk away feeling beautiful inside and out. BOOK IT: butchersalon.com STILL London Tranquility is the last thing you’d expect to encounter in Dalston but that’s exactly what STILL London is; a slice of peace on an otherwise bustling street. Since its quiet opening, the inconspicuous spot has drawn in East Londoners with its crystal laden window displays of Sao Paulo incense and jade rollers galore. The first thing you notice upon entering, other than the heavenly scent of incense burning, is a small and stylish nail bar where nail technicians offer vegan manicures using only non-toxic polishes, delivering natural options without making concessions on quality and colour. In the back of the salon, though, is where the real magic happens. Behind sliding doors you’ll find The Treatment Room, a small space where Daisy, the studio’s holistic facial and massage therapist, utilises massage, energy healing, reflexology and all-natural products to refresh your soul and treat your skin. Describing itself as low tech; high vibe, you shouldn’t expect any invasive procedures during the facial, but you’ll still definitely leave the salon with an all over glow from the inside out. BOOK IT: still-london.com Buller and Rice Founded by the owner of London’s first ever sustainable salon comes Buller and Rice, the salon paving the path for sustainability with their all-in approach to eco beauty. From the design of the salon, which utilises designs like bio laminate (a material made of grass cutting) and Smile Plastics (a surface made entirely of 100 per cent recycled yoghurt pots) to their Who Gives a Crap bamboo toilet paper, everything in this salon is kind to the earth in an industry that’s notoriously not. When it comes to your hair, Buller and Rice pride themselves on using solely eco, sustainable and bio-dynamic line, as well as their non-branded re-fill bar which allows customers to bring in any empty pot, tube or tub into the salon to be filled with their choice of product, encouraging clients to reuse all their packaging. You can feel smug knowing everything down to the foil used in dying treatments (or rather Paper Not Foil) is reusable. From the beginning of summer 2019 Buller and Rice will be partnering with Matter of Trust to recycle hair clippings and donate them to aid the clean up of major oil spills – who knew human hair was so good at absorbing oil? The salon’s sustainability credentials are long and illustrious; it’s an A+ from us. BOOK IT: bullerandrice.com Cloud Twelve A haven of serenity is the last thing you’d expect to find in busy Notting Hill, but tucked away in a secluded mews amidst pretty-in-pink houses is exactly that. Cloud Twelve is a sanctuary of wellness, and the club’s spa is a heavenly scented, luxurious and most importantly, sustainable distillation of that. Just reading the treatment menu eases our tensions and while you’ll want to try everything from the lymphatic rose crystal facial to the Himalayan salt scrub, the spa’s range of massages are a must. Once robed and slippered, you’ll head to the waiting room where instead of white lights and a clinical feel, you’ll find a gorgeous cocoon where you can quite literally feel your worries evaporating. Spacious, calming and dimly lit, Cloud Twelve’s treatment rooms are also built for prime relaxation and their expert therapists, knowledgeable and intuitive, deliver a treatment with a difference. From the optional heated massage bed to the calming sound bath and naturally fragranced oils, it’s an experience from start to finish, and what’s more is you can rest assured knowing that everything in the spa is as sustainable as it is indulgent. All treatments are performed using plant-based and ethically sourced materials and products, with all partnering brands being eco-sustainable, non-toxic and highly effective. Plus, as well as being scrumptiously soft, all the linen is made from renewable, 100% biodegradable Scrummi material which cuts down on laundry, carbon emissions and contaminated water waste. As sustainable beauty salons go, Cloud Twelve’s Spa shows that luxurious spa treatments don’t have to cost the earth. BOOK IT: The spa is open to both members and non-members; cloudtwelve.co.uk Glasshouse Salon Glasshouse Salon is ideally situated for a spot of relaxation after braving the crowds on a Saturday morning at Broadway Market. While the sparse industrial interiors are more Scandi minimalist than the lush greenery you’d expect of an eco-conscious salon, don’t be fooled, Glasshouse Salon takes sustainability seriously. In terms of hair care, the salon uses a professional colour range that’s made locally in the UK with energy efficient methods and a low carbon footprint, using a formula that’s ammonia and resorcinol free and packaged in post-consumer recyclable packaging. Hair aside, the salon’s sustainability ethos extends far beyond its products; eco-shower heads are designed to reduce water consumption during hair washes; recyclable and biodegradable towels and capes are draped over clients; and the salon itself is designed with natural and locally sourced materials. Glasshouse even get their coffee from a roaster next door using the same glass jar each week, eliminating the need for any packaging at all. Plus, with a shop front brimming with like-minded conscious makeup, skincare and lifestyle brands, you’ll certainly be walking away with a few new products and hopefully a reaffirmed commitment to sustainable living. BOOK IT: glasshousesalon.co.uk Content Beauty & Wellbeing As is their approach to everything, the Content ethos towards their beauty treatments is a holistic and natural one. Whether you’re looking for a facial, massage or make-up lesson, Content provides an option for those wanting to avoid synthetic chemicals. Since 2008 they’ve been serving up facials from some of the best organic skincare brands in their central London store. Tata Harper is the queen of clean beauty with all of her products made from 100% natural and organic ingredients from a single 1,200 acre Vermont farm, and any one of the Content Tata Harper facials offers the best way to experience her brand’s revitalising results. Whatever you book though, the treatments are fully customisable to your personal ethos whether that’s vegan or gluten free. If you’re looking to rethink your whole beauty routine to be more sustainable (we suggest you do) but don’t know where to start, Content’s ‘Detox Your Make-Up Bag’ consultation will answer all of your questions and introduce you to organic products so good, you won’t mind saying goodbye to that favourite red lipstick. BOOK IT: contentbeautywellbeing.com WhiP, Hackney & Homerton Set just far back enough from Dalston high-street to be away from the hustle and bustle, while still close enough to be primely positioned for a pre-party blow-out, WhiP is a go-to for East Londoners looking for luscious locks that are as kind to the planet as they are to your hair. One look inside the salon and you know you’re in Hackney; retro furnishings, an old-school vibe and bohemian spirit all make for a perfectly quirky and relaxing backdrop for your appointment (the complimentary local beers, cocktails, mocktails, coffees and teas certainly play a role too). Priding themselves on stocking forward-thinking vegan, organic, bio-dynamic and cruelty-free products, your hair will be treated with the likes of Eco and Oway – so you can sit back and relax knowing that being good to your hair isn’t bad for the environment. Highlights other than your, well, highlights include a mini-record shop in-store, as well as the smorgasbord of events including acoustic sessions and artist exhibitions. If you like your hair cut to a banging soundtrack with some friendly chit-chat and possibly the best head-massage of your life, then book your next appointment at WhiP – be sure to also check out the vegan favourite ‘Temple of Seitan’ next door. BOOK IT: whiplondon.co.uk Lisa Franklin Stamped with the ultimate mark of approval from Positive Luxury, Lisa Franklin’s facials are as sustainable as they are illustrious. The Chelsea based facialist is an expert in all things skin, and her facials and products alike promise radiance through the use of precious metals, minerals and botanical infusions. On her ingredients list, you’ll find unique components like rose quartz, platinum and frankincense – of course, all impeccably and sustainable sourced. Taking extra care and notice of their supply chain is vital to Lisa Franklin’s Butterfly Mark award for measurable impact and commitment to sustainability, as the brand cuts down on unnecessary processes and takes as much consideration for the environment and community as it does for your skin. The brand ethos also extends to its packaging, which is all recyclable, naturally. BOOK IT: lisafranklin.london SMUK London Founded by Danish celebrity hair and make-up artist Miabella Ristrip, SMUK only uses products derived from organic and sustainable ingredients and in doing so, does its part to fill the gap in the market for discerning beauty salons that care as much about the environment as they do their customers. One look at the Belgravia space featuring clean lines and pared back decor is enough to relax you – and if it doesn’t, then sitting down for a legendary blow-dry will do the trick. BOOK IT: SMUKlondon.co.uk Featured image: Neil Moodie Studio","filter_flag":1}
