{"title":"U.S. Steel releases sustainability report, touts progress toward net zero carbon emissions","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfdd8864240bce49605e79de57d&url=https%3a%2f%2fwww.nwitimes.com%2fnews%2flocal%2fu-s-steel-releases-sustainability-report-touts-progress-toward-net-zero-carbon-emissions%2farticle_6e09d226-332f-11ef-a065-af55b5fc6703.html&c=9781502655648614889&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfdd8864240bce49605e79de57d&url=https%3a%2f%2fwww.nwitimes.com%2fnews%2flocal%2fu-s-steel-releases-sustainability-report-touts-progress-toward-net-zero-carbon-emissions%2farticle_6e09d226-332f-11ef-a065-af55b5fc6703.html&c=9781502655648614889&mkt=en-us","summary":"It's invested in new products like a new roofing solution with DuPont ... through how we treat our people all the way to the products we build. From our greenhouse gas emissions reductions and ...","published":"Mon, 24 Jun 2024 17:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=24, tm_hour=17, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=176, tm_isdst=0)","news_source":"The Times of Northwest Indiana","news_image":"http:\/\/www.bing.com\/th?id=OVF.AAqQ6knnY4O3NXtOax1vGQ&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":520.0,"news_imagemaxheight":273.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"U.S. Steel releases sustainability report, touts progress toward net zero carbon emissions","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"It's invested in new products like a new roofing solution with DuPont ... through how we treat our people all the way to the products we build. From our greenhouse gas emissions reductions and ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Greenhouse Gas Emissions\" \"new products\"&format=rss","text":"U.S. Steel released its annual sustainability report, touting progress it has made toward net zero carbon emissions by 2025. The Pittsburgh-based steelmaker, one of the Region's largest industrial companies, put out The Future of Steel report that outlines its plans, goals, investments and ongoing efforts to reduce its greenhouse gas emissions. The report highlights U.S. Steel partnerships to reduce carbon emissions, such as through carbon capture in Gary. “U. S. Steel’s sustainability strategy is focused on our customers, our communities, our people and the planet. To meet the needs of the market today and pave the way for the industry tomorrow, our team is constantly developing and improving innovative steel products. ‘The Future of Steel’ report not only highlights our efforts but underscores how well positioned we are to continue this important work,” U. S. Steel Sr. Vice President of Sustainability and Chief Technology Officer Christian Gianni said. U.S. Steel has been working with tech firms, utilities, governments, nonprofits and universities on projects aimed to shrink its carbon footprint. It for instance is working with Molten Industries and the U.S. Department of Energy to work toward carbon-neutral steelmaking and looking to capture and mineralize the carbon emissions from its flagship Gary Works steel mill. The company invested $150 million in direct reduced grade pellets at its Minnesota Ore Operations taconite plant in Minnesota's Iron Range, which supplies ore to Gary Works. It's invested in new products like a new roofing solution with DuPont and a new non-grain oriented electrical steel line for electric vehicles at Big River Steel in Osceola, Arkansas. U.S. Steel hopes to open Big River Steel 2 later this year and bring more solar power online for the Arkansas mini-mill. The report also touts the steelmaker's achievements like being named one of the World’s Most Ethical Companies by Ethisphere, earning a top score on the Disability Equality Index, attaining a perfect score on the Human Rights Campaign Foundation’s Corporate Equality Index and achieving a record low OSHA Days Away from Work rate of 0.04, well below the benchmark for the steel industry. “U. S. Steel has a culture of caring that carries through how we treat our people all the way to the products we build. From our greenhouse gas emissions reductions and recycling progress, to the strength of our workplace for everyone including the LGBTQ+ community, veterans and more, U.S. Steel is committed to its values. Excitingly, this report also lays out a path to do even more in the years ahead,” U. S. Steel Head of Sustainability Erika Chan said.","filter_flag":1}
{"title":"US Foods outlines aggressive product innovation platform","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfdd8864240bce49605e79de57d&url=https%3a%2f%2fwww.foodbusinessnews.net%2farticles%2f26308-us-foods-outlines-aggressive-product-innovation-platform&c=2150938997996948373&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfdd8864240bce49605e79de57d&url=https%3a%2f%2fwww.foodbusinessnews.net%2farticles%2f26308-us-foods-outlines-aggressive-product-innovation-platform&c=2150938997996948373&mkt=en-us","summary":"US Foods introduces, on average, 50 new products twice a year (spring and fall), and ... or be produced and manufactured to help reduce greenhouse gas emissions,” Kinkaid said. Plant-forward is ...","published":"Sun, 23 Jun 2024 17:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=23, tm_hour=17, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=175, tm_isdst=0)","news_source":"FoodBusinessNews","news_image":"http:\/\/www.bing.com\/th?id=OVFT.MKuDmfe41DUYeAxVOaE5Ki&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700.0,"news_imagemaxheight":466.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"US Foods outlines aggressive product innovation platform","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"US Foods introduces, on average, 50 new products twice a year (spring and fall), and ... or be produced and manufactured to help reduce greenhouse gas emissions,” Kinkaid said. Plant-forward is ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Greenhouse Gas Emissions\" \"new products\"&format=rss","text":"ROSEMONT, ILL. — Distributor US Foods, Inc. made MOXē the star of its 2024 Investor Day on June 5. The all-in-one e-commerce portal enables foodservice operators to find products, manage orders and track deliveries while providing real-time inventory to ensure regularly ordered products are in stock. The one-stop-shop uses artificial intelligence (AI) to recommend products to make an operator’s job easier and diners more curious and impulsive. US Foods introduces, on average, 50 new products twice a year (spring and fall), and, according to Stacey Kinkaid, vice president of product development, three-fourths of all new products remain in the company’s growing food product portfolio. “Given evolving dietary and lifestyle preferences, it’s more important than ever for operators to appeal to a variety of diner desires, but the challenge is that there is no one-size-fits-all solution,” she said. “We take great care to ensure our products are as good as or better than the competitive offerings through landscape reviews of sensory, ingredients, claims, packaging and more. We also have strict standards for each our brands and programs, but they vary based on each.” “US Foods offers 22 brands (private label) with about 9,500 unique products,” said Dave Poe, executive vice president and chief merchant. The brands are positioned as good, better or best to provide a solution for an operator’s unique needs. “Scoop” is the platform US Foods uses to promote new concepts and innovations. “Scoop is driving differentiation,” Poe said. “These innovative products are more profitable and drive bigger baskets. These operators have better customer retention.” MOXē helps get products noticed. The company uses AI to recommend new products, and, as a result, each order is up one-and-a-half cases on average. “These items are on-trend products that provide back-of-house convenience, and the ingredients diners want,” Kinkaid said. “We provide application ideas and recipes to make menus shine. We have no shortage of ideas.” She explained how the product innovation team often goes on “restaurant treks” to get ideas and fine-tune them to meet the needs of customers. The approach is exemplified in the company’s new Taiwanese-style salt and pepper popcorn chicken sold under the Patuxent Farms brand. “Besides taste, we had to figure out how to make these poppable chicken bites just the right size and texture,” Kinkaid said. The product consists of lightly coated, par-fried, boneless, skinless, dark meat chicken pieces that are individually quick frozen, with each piece weighing about 0.85 ounces. When deep-fried from frozen by the operator, they have a crispy exterior with a slight sweetness, and a moist, tender slightly spicy interior. The process eliminates measuring, mixing, trimming, seasoning, two-step breading and par-frying, Kinkaid said, plus it saves 85 minutes of labor per case. Product versatility also is part of US Foods’ innovation strategy. The popcorn chicken item, for example, may be used as an appetizer, side dish, main dish, or as a topping for a salad or bowl. “If we are developing a product for our top-tier brands (Chef’s Line, Stock Yards, Rykoff Sexton and Metro Deli), it must comply with our ‘unpronounceables list,’” Kinkaid noted. “This is a list of over 80 ingredients we avoid or replace, such as artificial flavors and colors, nitrites and nitrates, and high fructose corn syrup. This appeals to many of our customers looking for products that are produced with clean-label profiles similar to what they might make themselves back of house.” This past spring, the company debuted Chef’s Line Pinsa Crust formulated with simple ingredients, including wheat flour, rice flour and extra virgin olive oil. Each crust is cold-fermented for 24 hours then stretched and pressed for a back-of-house appearance. “All products that are part of our ‘serve good’ program must come with a claim of responsible sourcing or contribution to waste reduction, or be produced and manufactured to help reduce greenhouse gas emissions,” Kinkaid said. Plant-forward is another priority for US Foods and includes vegan, vegetarian and flexitarian products where plants are the focus. Recent offerings include Molly’s Kitchen plant-based smashed patty, Chef’s Line tempura brussels sprouts and Molly’s Kitchen Mexican-style cheese stuffed cigars. The latter is vegetarian and builds on three popular appetizers: spring rolls, cheese sticks and jalapeño poppers. The item is a crispy spring roll concept and features Mexican-style melting cheese, cotija cheese, cream cheese, red pepper flakes and jalapeño pieces to give it the right hint of heat.","filter_flag":1}
{"title":"Bayer to deliver ten blockbusters in ten years","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfdd8864240bce49605e79de57d&url=https%3a%2f%2fwww.futurefarming.com%2fcrop-solutions%2fweed-pest-control%2fbayer-to-deliver-ten-blockbusters-in-ten-years%2f&c=7615618010601593472&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfdd8864240bce49605e79de57d&url=https%3a%2f%2fwww.futurefarming.com%2fcrop-solutions%2fweed-pest-control%2fbayer-to-deliver-ten-blockbusters-in-ten-years%2f&c=7615618010601593472&mkt=en-us","summary":"Bayer aims to launch ten blockbuster products in the next ten years to support farmers worldwide, the company announced at its 2024 Crop Science innovation update in Chicago. According to Bayer ...","published":"Tue, 25 Jun 2024 00:30:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=25, tm_hour=0, tm_min=30, tm_sec=0, tm_wday=1, tm_yday=177, tm_isdst=0)","news_source":"futurefarming","news_image":"http:\/\/www.bing.com\/th?id=OVFT.I4SIUPat8en_mjNcB1PJCy&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700.0,"news_imagemaxheight":466.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bayer to deliver ten blockbusters in ten years","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Bayer aims to launch ten blockbuster products in the next ten years to support farmers worldwide, the company announced at its 2024 Crop Science innovation update in Chicago. According to Bayer ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Greenhouse Gas Emissions\" \"new products\"&format=rss","text":"Bayer aims to launch ten blockbuster products in the next ten years to support farmers worldwide, the company announced at its 2024 Crop Science innovation update in Chicago. According to Bayer farmers will benefit from new technologies that will help them produce more while restoring nature through innovations that power regenerative agriculture. Bayer considers regenerative agriculture as an outcome-based production model, with improving soil health as a key component, leading to increased resilience. Other key aspects include increased productivity; adaption and mitigation of climate change through reductions in greenhouse gas emissions; increased carbon sequestration in the soil; maintaining, preserving or restoring on-farm biodiversity; conserving water resources through improved water retention, reduction in water run-off, as well as improved social and economic well-being of farmers and their communities. Regenerative agriculture Bayer’s R&D pipeline is driving the transformation to regenerative agriculture through three pillars. The first is through an annual portfolio refresh of new germplasm and new crop protection formulations that help farmers compete in a changing environment. The second pillar refers to completely new products like seed and trait technologies or novel crop protection solutions with blockbuster potential, fueling stable long-term growth. The third pillar consists of key collaborations on technologies like gene editing and biological solutions with strategic partners that are complementing Bayer’s in-house R&D efforts. Preceon Smart Corn System With the Preceon Smart Corn System farmers will benefit from better protection of their crops, better access during the season and higher yields. Bayer’s 2023 Groundbreaker trials in the U.S., which included 365 growers, resulted in more than 80 percent reporting they would plant Preceon Smart Corn again. The targeted commercial launch of the conventional breeding short-stature corn approach earlier this year is also paralleled with progress on the biotech version which has now advanced to R&D phase 4. Biologicals are complementing synthetic products Bayer has accelerated its Biologicals R&D pipeline substantially. Through multi-year strategic research and development partnerships with Ginkgo Bioworks, Kimitec, MustGrow and others, Bayer is accelerating the delivery of breakthrough biological innovations in the areas of next-generation nitrogen fixation, crop protection and biostimulant products – all while continuing to deliver innovative new products through leading development platforms. Ibisio, a biological bird control which uses black pepper oleoresin as its active ingredient, was advanced to Phase 4 and is expected to launch in Europe where it will help to protect freshly sown fields prevent attacks from crows, pigeons, pheasants and other birds. In 2023, about 20 percent of the total corn area in the EU and the UK was protected with a seed treatment solution including bird repellents and there are very few remaining crop protection products to address the problem. Join 17,000+ subscribers Subscribe to our newsletter to stay updated about all the need-to-know content in the agricultural sector, two times a week. \"*\" indicates required fields Email * First name * Phone This field is for validation purposes and should be left unchanged. Ed Asscheman Online editor Future Farming","filter_flag":1}
{"title":"Blue Bin: Our Daily Life Has a Blue Hue and brings us closer to a Greener Future","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfdd8864240bce49605e79de57d&url=https%3a%2f%2fen.protothema.gr%2f2024%2f06%2f20%2fblue-bin-our-daily-life-has-a-blue-hue-and-brings-us-closer-to-a-greener-future%2f&c=3074074743372728216&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfdd8864240bce49605e79de57d&url=https%3a%2f%2fen.protothema.gr%2f2024%2f06%2f20%2fblue-bin-our-daily-life-has-a-blue-hue-and-brings-us-closer-to-a-greener-future%2f&c=3074074743372728216&mkt=en-us","summary":"By Recycling Packaging, We Save Energy and Reduce Greenhouse Gas Emissions, Contributing to Combating the Climate Crisis ...","published":"Thu, 20 Jun 2024 03:32:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=20, tm_hour=3, tm_min=32, tm_sec=0, tm_wday=3, tm_yday=172, tm_isdst=0)","news_source":"protothema.gr","news_image":"http:\/\/www.bing.com\/th?id=OVFT.fbF6lzOmJOMPC34kjd-42y&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700.0,"news_imagemaxheight":431.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Blue Bin: Our Daily Life Has a Blue Hue and brings us closer to a Greener Future","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"By Recycling Packaging, We Save Energy and Reduce Greenhouse Gas Emissions, Contributing to Combating the Climate Crisis ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Greenhouse Gas Emissions\" \"new products\"&format=rss","text":"Newsroom June 20 01:32 Carefully observing neighborhoods in Greece, noticed one color dominating: blue. This is because there are 175,000 active Blue Bins and 10,800 Blue Bells, reminding us of the importance of recycling packaging daily. For 23 years, consistency each of us has managed to contribute significantly to tackling the climate crisis, aiming for a sustainable future for our planet. The climate crisis is here, and one small but very important act to combat it is Recycling Packaging in Blue Bins. Every material recycled in Blue Bins, every natural resource saved, brings us closer to a greener future for everyone. How Do We Recycle Our Packaging? The process is very simple and easy. We follow 4 simple steps: Separate packaging from paper, plastic, glass, aluminum, and tinplate from other waste daily. Empty the packaging from residues. Fold cardboard boxes. Throw materials loose into the blue bin, not inside tied bags. Attention: Never throw garbage in Blue Bins. The Benefits of Packaging Recycling What do we really achieve with such a simple act as Packaging Recycling? Protect the Environment and Ourselves from Pollution Recycling packaging plays a vital role in protecting the environment and valuable natural resources by reducing the need for new raw materials, which in turn helps preserve natural habitats and reduce pollution. Reduce the Volume of Waste The more we recycle our packaging, the less waste ends up in landfills, extending the lifespan of these valuable infrastructures. Save Energy and Reduce Greenhouse Gas Emissions Packaging Recycling requires less energy compared to producing new products from raw materials, which generally involves energy-intensive stages such as raw material extraction, transportation, and processing. This means we save energy and reduce greenhouse gas emissions, contributing to combating the climate crisis. Contribute to Overall Green Growth Packaging Recycling supports green growth, as higher recycling rates mean more investments and jobs throughout the collection – sorting – processing chain, while our practical awareness is the main driver for the industry to adopt greener development models. Collective Effort for a Greener Future Together, we have managed to recycle over 520,000 tons of recyclable materials annually! It’s together that can we achieve even more and better results, contributing to this effort. Recycling packaging is not just a habit but a conscious choice for our future. With every recycled material, we take a step closer to a cleaner and more sustainable planet. Our commitment to recycling demonstrates our responsibility to future generations and our need to protect our planet. Let’s continue recycling our packaging in the Blue Bins, inspiring those around us, because every small act counts. Blue is not just a color; it symbolizes our collective effort for a sustainable future. Let’s make our future greener with… Blue! Learn more about the work of the Hellenic Recovery Recycling Corporation (EEAA)","filter_flag":1}
{"title":"Bezos Center for Sustainable Protein launches at Imperial with $30M funding","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfdd8864240bce49605e79de57d&url=https%3a%2f%2fwww.eurekalert.org%2fnews-releases%2f1049078&c=3137338577367443622&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfdd8864240bce49605e79de57d&url=https%3a%2f%2fwww.eurekalert.org%2fnews-releases%2f1049078&c=3137338577367443622&mkt=en-us","summary":"However, animal-based protein production requires extensive land use and generates significant greenhouse gas emissions. As the global population ... research and innovation to commercialisation of ...","published":"Mon, 24 Jun 2024 08:17:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=24, tm_hour=8, tm_min=17, tm_sec=0, tm_wday=0, tm_yday=176, tm_isdst=0)","news_source":"EurekAlert!","news_image":"http:\/\/www.bing.com\/th?id=OVFT.yhjBmKJONqrHI13OadTwXi&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":300.0,"news_imagemaxheight":200.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bezos Center for Sustainable Protein launches at Imperial with $30M funding","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"However, animal-based protein production requires extensive land use and generates significant greenhouse gas emissions. As the global population ... research and innovation to commercialisation of ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Greenhouse Gas Emissions\" \"new products\"&format=rss","text":"Bezos Earth Fund grant establishes new Centre at Imperial to transform global food systems from environmentally damaging to innovative by creating sustainable solutions. Imperial’s Bezos Centre for Sustainable Protein , launched today, will develop innovative and evidence-based solutions through the design, delivery, and commercialisation of alternative food products that are economically and environmentally friendly, nutritious, affordable, and tasty. The Centre, spanning across seven Imperial academic departments, will advance research into precision fermentation, cultivated meat, bioprocessing and automation, nutrition, and AI and machine learning. The Bezos Earth Fund is providing the funding as part of a $100 million commitment to developing sustainable protein alternatives and expanding consumer choice and an overall $1 billion commitment to food transformation. It’s one of multiple Earth Fund Centres working with other institutions and industry partners to develop and commercialise new alternative protein products to give consumers more choice for meat and dairy products. Professor Hugh Brady, President of Imperial College London, said: “Food security is one of the biggest challenges facing humanity. For a sustainable future, we need to ensure that people across the world can be fed adequately and nutritiously with minimal impact on biodiversity, climate and our wider natural environment. “Imperial has the leading-edge research, innovation, partnerships and convening power to advance global food systems and we are very excited by the potential of our new Bezos Centre for Sustainable Protein.” Dr Andrew Steer, President and CEO of the Earth Fund said: “The Bezos Earth Fund is proud to support Imperial as the home of our second sustainable protein centre. By 2050 the world population will be over 10 billion, so now is the time to rethink the way we produce and consume food. This work will help ensure that our future includes more protein options – and that they taste great, are nutritious and come at low cost.” Transforming our food system Protein is essential to human health; without it our cells, tissues, and organs can’t function. Protein is gained through what we eat, including both animal and plant sources, such as meat, eggs, fish, nuts, and legumes like beans. However, animal-based protein production requires extensive land use and generates significant greenhouse gas emissions. As the global population expands, the health of both humans and the planet will increasingly depend on widespread availability of proteins that taste good and are produced in ways that reduce emissions and protect nature. Plant-based proteins are already gaining momentum as meat alternatives, such as in pea-protein-based burgers. In addition, new technologies are making new kinds of protein that also have the potential to fit this bill, including through microbial fermentation, which can produce proteins and nutrients that can be used in food formulations, and cultivated meat grown from animal cells. Widespread acceptance and uptake of these alternative proteins relies on improvements in their quality and price, as well as reductions in cost and energy use. To transform these proteins into healthy and tasty food, other components also need to be produced more sustainably and efficiently, such as healthy fats and carbohydrates and aspects like flavour, aroma, colourants, and vitamins. This is where engineering biology comes in. Accelerating development Engineering biology applies engineering concepts to design, build and manufacture cells and products. The Centre will use a combination of rational and computational-guided engineering strategies with automation at biofoundries – where cells are turned into mini-factories producing useful products – to accelerate the development and scaling up of new bio-based processes. It will also encompass institutes and facilities that will help translate discoveries into real-world applications, educate the next generation of bioengineers, and support commercialisation. These include the Centre for Synthetic Biology, established in 2009 as the first of its kind in Europe, SynbiCITE, the UK’s industrial translation centre for synthetic biology, and the Centre for Translational Nutrition & Food Research, which has partnerships with Quorn, Nestle, Unilever, and Waitrose, among others. Director of the new Centre, Dr Rodrigo Ledesma-Amaro, from the Department of Bioengineering at Imperial, said: “The Centre’s ethos is that bio-engineered solutions can – and should – be both planet and people-positive. Imperial is uniquely positioned to harness the potential of engineering biology to accelerate the alt-protein revolution and transform global food systems.” Dr Andy Jarvis, the Earth Fund’s Director of Future of Food, said: “Later is dangerously too late if we're to think about growing our world's protein sources. Imperial College London has led pioneering efforts in the field of Engineering Biology, perfectly positioning the university to advance sustainable protein options that will satisfy the growing global masses.” International partners The Centre’s hub will be based at Imperial, with three spokes in the UK and three abroad, with more than 65 international partners spanning cutting-edge research and innovation to commercialisation of new products. The UK spokes are grouped under members of the Cellular Agriculture Manufacturing Hub at UCL and Aberystwyth University, the Food Centre at Reading University, and the Growing Kent & Medway consortium involving the National Institute of Agricultural Botany and the Universities of Kent and Greenwich. International spokes are hosted by the Technical University of Denmark (Biosustain), Tufts University (Centre for Cellular Agriculture), and the National University of Singapore. The launch of the Bezos Centre for Sustainable Protein at Imperial follows the announcement of a sister centre last month at North Carolina State University, as part of the Bezos Earth Fund’s commitment to help transform food and agricultural systems, which also includes efforts to reduce livestock emissions.","filter_flag":1}
{"title":"Jolly Green Giants: The 7 Best ESG Stocks to Buy Now","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfdd8864240bce49605e79de57d&url=https%3a%2f%2fwww.nasdaq.com%2farticles%2fjolly-green-giants-7-best-esg-stocks-buy-now&c=7254693005403836303&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfdd8864240bce49605e79de57d&url=https%3a%2f%2fwww.nasdaq.com%2farticles%2fjolly-green-giants-7-best-esg-stocks-buy-now&c=7254693005403836303&mkt=en-us","summary":"The post Jolly Green Giants: The 7 Best ESG Stocks to Buy Now appeared first on InvestorPlace.","published":"Thu, 13 Jun 2024 09:18:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=13, tm_hour=9, tm_min=18, tm_sec=0, tm_wday=3, tm_yday=165, tm_isdst=0)","news_source":"Nasdaq","news_image":"http:\/\/www.bing.com\/th?id=OVFT.v4bozB5SH3Kxe7FdeF_kLC&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":300.0,"news_imagemaxheight":169.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Jolly Green Giants: The 7 Best ESG Stocks to Buy Now","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"The post Jolly Green Giants: The 7 Best ESG Stocks to Buy Now appeared first on InvestorPlace.","query":"https:\/\/www.bing.com\/news\/search?q=\"Greenhouse Gas Emissions\" \"new products\"&format=rss","text":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips At first glance, the idea of environmental, social and governance (ESG) investments might seem more like a “heart” narrative as opposed to a financial one. In other words, in a perfect world, everyone would choose to support the best ESG stocks to buy. However, in a paradigm of limited resources, some things have to go. Usually, that something is anything related to moral directives. However, the concept that doing right must necessarily come at the expense of the bottom line might need a rethink. That may have been the case in a more cynical time. But these days, the emerging consumer cares deeply about sustainability and other holistic endeavors. Indeed, fostering a reputation for not prioritizing sustainability and other morally desirable attributes can hurt the bottom line. Plus, multiple organizations have started to call attention to the top performers in the ESG circuit. Earning these awards can lead to additional eyeballs. With that in mind, below are potentially the best ESG stocks to buy. Microsoft (MSFT) Source: VDB Photos \/ Shutterstock.com Tech giant Microsoft (NASDAQ:MSFT) is no stranger to innovation and overall business prowess. However, it would be remiss to have a discussion of the best ESG stocks to buy and not include MSFT. According to Investor’s Business Daily, the software (and hardware) juggernaut took the top spot in the publication’s 100 Best ESG Companies for 2023. I wouldn’t be surprised if took the checkered flag in first again for 2024. Microsoft offers so many initiatives covering sustainability and other holistic efforts targeting broader wellness and equity that it’s difficult to cover in any single article. For me, one of the most impressive ambitions that the company forwarded is its aim to be carbon negative – not just neutral – by 2030. By that, we’re talking about being profitable or accretive for the environment, rather than merely mitigating the damage done. Beyond that, the company has been killing it financially. In the past four quarters, its average earnings surprise has come out to 7%. Fiscal 2024 earnings per share may hit $11.79 on sales of $244.92 billion. That would be up 20.2% and 15.6%, respectively, from last year. Mastercard (MA) Source: David Cardinez \/ Shutterstock.com One of the biggest financial services firms in the world, Mastercard (NYSE:MA) is well known for its credit solutions. It also happens to be ranked among the best ESG stocks to buy. In particular, the company has a focus on empowerment. First, it fosters an ecosystem of diversity and opportunity, enabling individuals to reach their top potential. Second, Mastercard is attempting to merge the power of technology and the social need for equity together. Specifically, it wants everyone to participate in the digital economy, and is thus focused on connecting individuals to tools and resources that will enable them to reach prosperity. Finally, the credit services specialist is accelerating its efforts to promote a low carbon, regenerative economy. Notably, these initiatives are not coming at the expense of financial performance. Between the second quarter of 2023 to Q1 2024, the company’s average EPS hit $3.12. This translated to an earnings surprise of 3.35%. Analysts see EPS in fiscal 2024 reach $14.32 on sales of $27.85 billion. That would come out to 16.8% and 11% up, respectively, against the prior year. Caterpillar (CAT) Source: Shutterstock On the surface, Caterpillar (NYSE:CAT) might not immediately sound like one of the best ESG stocks to buy. As an industrial equipment manufacturer, Caterpillar plays a pivotal role in resource mining and energy projects. While these are no doubt important roles, such operations aren’t exactly holistically helpful for the environment. Still, CAT is actually one of IBD’s top ESG plays, ranked number six last year. While mining and manufacturing operations lead to a broader impact, Caterpillar is also engaged in helping to minimize carbon emissions. As well, the company is supporting its enterprise-level customers through new products, technologies and services to help facilitate reduced emissions. Plus, some of the resources that Caterpillar indirectly helps extract – like lithium – can potentially yield positive results through the ultimate end product (i.e. electric vehicles). Even better, the financials don’t appear to have suffered from its ESG efforts. In the past four quarters, the company’s average earnings surprise reached 3.35%. For fiscal 2024, analysts anticipate EPS of $14.32 on sales of $27.85 billion, up 16.8% and 11%, respectively, on a year-over-year basis. Bunge (BG) Source: JHVEPhoto\/ShutterStock.com Based in Chesterfield, Missouri, Bunge (NYSE:BG) plays a key role in the global food supply chain. In terms of industry, it falls under the farm products sector. Per its public profile, Bunge operates as an agribusiness, providing vital commodities such as oilseeds, grains (comprising of wheat and corn) and products for animal feed manufacturers. Because the company depends such much on a healthy environment, it’s no surprise that BG ranks among the best ESG stocks to buy. According to its website, one of the Bunge’s initiatives involves reducing greenhouse gas emissions and unlocking opportunities for sustainable growth. It also launched a program to help accelerate regenerative agriculture. If ever the criticism comes that “do-gooder” organizations can’t succeed financially, Bunge will prove doubters wrong. In the past four quarters, its average EPS clocked in at $3.36. During this period, the average earnings surprise soared to 27.55%. That’s wildly impressive. Admittedly, analysts anticipate a slowdown in fiscal 2024. However, the high-side revenue target of $62.38 billion may represent a nearly 5% growth rate from last year. Either way, analysts rate shares a consensus moderate buy. Mondelez (MDLZ) Source: Shutterstock A confectionary giant, Mondelez (NASDAQ:MDLZ) has delighted generations of consumers. It also happens to be one of the best ESG stocks to buy for its wide-ranging initiatives. According to its website, Mondelez has achieved a 100% success rate in implementing over the past four years food safety schemes that were benchmarked by the Global Food Safety Initiative. As well, 48% of the electricity used in its manufacturing sites have been sourced from renewables. That’s a sizable improvement over the 40% usage metric seen in 2022. So, Mondelez isn’t just talking the talk, it’s walking the walk. In addition, the company has stressed its social equity initiatives, fostering an environment of diversity and inclusion. In the past four quarters, Mondelez posted an average EPS of over 84 cents. This performance translated to an average earnings surprise of 7.08%. Therefore, even with such a strong focus on ESG directives, the financial print remains robust. For fiscal 2024, analysts are anticipating EPS may reach $3.50 on sales of $36.84 billion, up 9.7% and 2.3%, respectively, on a year over year basis. Marriott (MAR) Source: Tricky_Shark \/ Shutterstock.com A multinational organization, Marriott (NASDAQ:MAR) operates, franchises and licenses lodging brands. Primarily, the enterprise focuses on hotels, though it’s also involved in residential and timeshare properties. Presently, its portfolio covers over 30 hotel and timeshare brands at 8,785 locations. With the sustained interest in traveling and similar experiential expenditures, MAR could swing higher. Just as well, the company is succeeding under a framework of holistic positivity. By 2025, Marriott aims to have 80% of managed hotels participating in community service activities. In addition, it’s putting money into the mix to develop hospitality skills and opportunities among youth, diverse populations, women, people with disabilities and veterans and refugees. With such a strong commitment to improving society’s bottom line, some might wonder about Marriott’s own financials. Don’t worry – in the past four quarters, it posted EPS of nearly $2.52. This translated to an earnings surprise of 17.8%. For fiscal 2024, covering experts do see a possible dip in EPS. However, they’re also targeting revenue of $25.45 billion, up 7.3% YOY. Additionally, their blue-sky sales target for that year stands at $26.21 billion. Thus, MAR could rank among the best ESG stocks to buy. Clean Harbors (CLH) Source: Shutterstock A provider of environmental and industrial services, Clean Harbors (NYSE:CLH) makes an organic case for the best ESG stocks to buy. Part of its business involves the always critical hazardous waste disposal solution for companies, small waste generators and government agencies. Through its expansionary efforts, Clean Harbors features approximately 400 service locations in North America. These include over 50 hazardous waste management facilities. As the company states on its website, its business is sustainability. When circumstances go wrong, Clean Harbors is effectively a first responder for the environment and for overall social wellness. Thus, part of the bullish narrative for CLH stock centers on its natural monopoly. While other enterprises can compete with Clean Harbors, the barriers – including regulations – are quite steep. Financially, the company enjoyed a solid outing over the past four quarters except for Q3 2024. That turned out to be a sizable miss. Still, the average earnings surprise during the aforementioned period landed at 0.45%. For fiscal 2024, experts anticipate 7% growth in EPS to hit $7.48. Also, sales could rise 9% to reach $5.89 billion. It’s easily one of the best ESG stocks to buy. On the date of publication, Josh Enomoto did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. A former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia. More From InvestorPlace The post Jolly Green Giants: The 7 Best ESG Stocks to Buy Now appeared first on InvestorPlace. The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.","filter_flag":1}
{"title":"Tanager-1 Is Ready for Launch: Planet’s First Hyperspectral Satellite","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfdd8864240bce49605e79de57d&url=https%3a%2f%2fwww.businesswire.com%2fnews%2fhome%2f20240606226560%2fen%2fTanager-1-Is-Ready-for-Launch-Planet%25E2%2580%2599s-First-Hyperspectral-Satellite&c=15559617235065309904&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfdd8864240bce49605e79de57d&url=https%3a%2f%2fwww.businesswire.com%2fnews%2fhome%2f20240606226560%2fen%2fTanager-1-Is-Ready-for-Launch-Planet%25E2%2580%2599s-First-Hyperspectral-Satellite&c=15559617235065309904&mkt=en-us","summary":"About Carbon Mapper Inc Carbon Mapper is a nonprofit based in Pasadena, CA with the mission to drive greenhouse gas emissions reductions by making ... from current or future product enhancements, new ...","published":"Thu, 06 Jun 2024 09:11:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=6, tm_hour=9, tm_min=11, tm_sec=0, tm_wday=3, tm_yday=158, tm_isdst=0)","news_source":"Business Wire","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Tanager-1 Is Ready for Launch: Planet’s First Hyperspectral Satellite","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"About Carbon Mapper Inc Carbon Mapper is a nonprofit based in Pasadena, CA with the mission to drive greenhouse gas emissions reductions by making ... from current or future product enhancements, new ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Greenhouse Gas Emissions\" \"new products\"&format=rss","text":"SAN FRANCISCO--(BUSINESS WIRE)--Planet Labs PBC (NYSE:PL), a leading provider of daily Earth data and insights, announced today that its first hyperspectral satellite, Tanager-1—made possible by the Carbon Mapper Coalition and its philanthropic partners—is ready for launch. The spacecraft arrived at Vandenberg Space Force Base on June 3rd in preparation for liftoff as early as July on board the Transporter-11 Rideshare mission with SpaceX. Tanager-1 will be the first of a next-generation hyperspectral fleet which will expand Planet’s imaging capabilities in the spectral domain to complement the existing imaging capabilities in the temporal and spatial domains offered by the PlanetScope, SkySat, and Pelican missions. Following on-orbit commissioning, Tanager-1 is planned to provide hyperspectral data both in support of the continued partnership with nonprofit organization Carbon Mapper and Planet’s broader commercial mission. Tanager-1 was enabled by the Carbon Mapper satellite program, which allowed Planet to combine its cutting-edge agile aerospace and smallsat bus technology with the state-of-the-art imaging spectrometer design developed at NASA’s Jet Propulsion Laboratory. This collaboration plans to provide scientific-grade data to enable action on sustainability use cases such as greenhouse gas point-source emissions. “This important collaboration with Planet and Carbon Mapper is an innovative way to confront Earth’s most urgent climate challenges head-on,” said Laurie Leshin, Director of NASA JPL. “Our imaging spectrometer technology and expertise, leveraged and deployed on Tanager-1, will enable a broad range of stakeholders to pinpoint methane super-emitters and take action to mitigate them. The work of the Carbon Mapper Coalition will truly have a global impact, and we are proud to take part in ensuring mission success.” Future Tanager imagery will be analyzed by expert scientists at Carbon Mapper to identify methane and carbon dioxide (CO 2 ) \"super-emitters\" around the world. Planet expects to provide commercial hyperspectral data for a variety of use cases including emissions monitoring, biodiversity assessments, vegetation analysis, minerals mapping, and water contaminant assessments. “I’m thrilled that Tanager has arrived at the launch site. This will provide hyperspectral data that will enable myriad applications from sustainability to security, and complement the data from existing Planet satellite fleets,” said Will Marshall, Co-Founder and CEO of Planet. “I am very proud to be a part of this unique public-private partnership with NASA JPL and Carbon Mapper.” Planet’s hyperspectral constellation is designed to provide imagery with continuous spectral information across the visible and shortwave infrared (VSWIR) regions. Tanager’s imaging spectrometer leverages JPL’s heritage in imaging spectrometer design and development through decades of similar airborne and spaceborne sensors like the Airborne Visible\/Infrared Imaging Spectrometer (AVIRIS) and Earth Surface Mineral Dust Source Investigation (EMIT). The Tanager-1 imaging spectrometer will be the most complex optical system ever launched by Planet, and its delivery to the launch site demonstrates a host of new capabilities, expertise, facilities, and testing acumen at Planet. In recent months, the integrated Tanager-1 spacecraft successfully completed a rigorous series of on-the-ground tests designed to ensure that the integrated satellite can withstand the harsh environments that it will endure at launch and in orbit. Pelican-1, a technology demonstration that successfully launched late last year, shares the same smallsat bus platform with Tanager-1. Together, the successful on-the-ground and in-orbit tests have proven Planet’s agile aerospace approach as applied to the larger and more complicated spacecraft that utilize this next-generation smallsat bus. “Shipping the first Tanager satellite is an enormous step in realizing the vision of our unique public-private partnership with Carbon Mapper and NASA JPL,” said Mark Keremedjiev, Tanager Mission Director at Planet. “This milestone in our program is a shared achievement across a wide range of contributors and I am exceptionally proud of the team that has brought us to this point. I am excited to see the data our system will produce on-orbit and look forward to tackling the host of challenges spaceborne hyperspectral remote sensing is suited to address.” In addition to Tanager-1, Planet will be launching 35 SuperDoves that will contribute to Planet’s flagship daily, global monitoring mission. PlanetScope data is used by hundreds of customers in defense and intelligence, civil government, and commercial markets to take informed action, and better contextualize events they’re seeing on the ground today. Planet’s daily scan and deep archive of data for every point on Earth is unique within the industry and provides customers with a continuous and complete view of their areas of interest. Further, the archive acts as a rich training ground for predictive machine-learning and advanced artificial-intelligence models, accelerating users’ ability to draw insights from the terabytes of data collected by Planet each day. Planet is committed to delivering best-in-class data and services to its customers. The launch of Tanager-1 helps further the company’s mission of making change visible, accessible, and actionable. About Planet Labs PBC Planet is a leading provider of global, daily satellite imagery and geospatial solutions. Planet is driven by a mission to image the world every day, and make change visible, accessible and actionable. Founded in 2010 by three NASA scientists, Planet designs, builds, and operates the largest Earth observation fleet of imaging satellites. Planet provides mission-critical data, advanced insights, and software solutions to over 1,000 customers, comprising the world’s leading agriculture, forestry, intelligence, education and finance companies and government agencies, enabling users to simply and effectively derive unique value from satellite imagery. Planet is a public benefit corporation listed on the New York Stock Exchange as PL. To learn more visit www.planet.com and follow us on X (Twitter). About Carbon Mapper Inc Carbon Mapper is a nonprofit based in Pasadena, CA with the mission to drive greenhouse gas emissions reductions by making methane and carbon dioxide data accessible and actionable. Carbon Mapper is focused on filling gaps in the emerging ecosystem of methane and CO2 monitoring systems by delivering data at facility scale that is precise, timely, and accessible to empower science-based decision making and action. The organization leads a public-private partnership including Planet Labs, PBC and NASA’s Jet Propulsion Laboratory among others focused on developing and deploying a constellation of satellites capable of detecting, quantifying, and verifying methane emissions worldwide. Data from these satellites will offer the next major step in scaling up the thousands of methane plumes and CO2 plumes already publicly available on the Carbon Mapper data portal. Learn more at carbonmapper.org, view our data at data.carbonmapper.org, and follow us on Twitter @carbonmapper Forward Looking Statements Except for the historical information contained herein, the matters set forth in this press release are forward-looking statements within the meaning of the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995, including, but not limited to, the Company’s ability to capture market opportunity and realize any of the potential benefits from current or future product enhancements, new products, or strategic partnerships and customer collaborations, the Company’s ability to successfully design, build, launch and deploy, operate and market new products and satellites and the Company’s ability to realize any of the potential benefits from product and satellite launches, either as designed, within the expected time frame, in a cost-effective manner, or at all. Forward-looking statements are based on the Company’s management’s beliefs, as well as assumptions made by, and information currently available to them. Because such statements are based on expectations as to future events and results and are not statements of fact, actual results may differ materially from those projected. Factors which may cause actual results to differ materially from current expectations include, but are not limited to the Company’s ability to obtain and maintain required licenses and approvals from regulatory agencies, such as the Federal Communications Commission (FCC), in a timely fashion, or at all; whether the Company will be able to successfully build, launch and deploy or operate its satellites, including new satellites either as designed, in a timely fashion or at all; the Company’s ability to develop and release product and service enhancements to respond to rapid technological change, or to develop new designs and technologies for its satellites, in a timely and cost-effective manner; whether the Company will be able to continue to invest in scaling its sales organization, expanding its software engineering (including its ability to integrate new satellite capabilities) and marketing capabilities; whether the Company will be able to accurately predict and capture market opportunity; whether current customers or prospective customers adopt the Company’s platform or new products; the Company’s ability realize any of the potential benefits from new products and satellites, as well as strategic partnerships and customer collaborations; and other risk factors and disclosures about the Company and its business included in the Company's periodic reports, proxy statements, and other disclosure materials filed from time to time with the Securities and Exchange Commission (SEC) which are available online at www.sec.gov, and on the Company's website at www.planet.com. All forward-looking statements reflect the Company’s beliefs and assumptions only as of the date such statements are made. The Company undertakes no obligation to update forward-looking statements to reflect future events or circumstances.","filter_flag":1}
