{"title":"New Report Finds Retail Energy Key to an Affordable Clean Energy Transition - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1yZXBvcnQtZmluZHMtcmV0YWlsLWVuZXJneS1rZXktdG8tYW4tYWZmb3JkYWJsZS1jbGVhbi1lbmVyZ3ktdHJhbnNpdGlvbi0zMDE4Nzg0NzIuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1yZXBvcnQtZmluZHMtcmV0YWlsLWVuZXJneS1rZXktdG8tYW4tYWZmb3JkYWJsZS1jbGVhbi1lbmVyZ3ktdHJhbnNpdGlvbi0zMDE4Nzg0NzIuaHRtbNIBAA?oc=5","id":"CBMigwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1yZXBvcnQtZmluZHMtcmV0YWlsLWVuZXJneS1rZXktdG8tYW4tYWZmb3JkYWJsZS1jbGVhbi1lbmVyZ3ktdHJhbnNpdGlvbi0zMDE4Nzg0NzIuaHRtbNIBAA","guidislink":false,"published":"Mon, 17 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=198, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1yZXBvcnQtZmluZHMtcmV0YWlsLWVuZXJneS1rZXktdG8tYW4tYWZmb3JkYWJsZS1jbGVhbi1lbmVyZ3ktdHJhbnNpdGlvbi0zMDE4Nzg0NzIuaHRtbNIBAA?oc=5\" target=\"_blank\">New Report Finds Retail Energy Key to an Affordable Clean Energy Transition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New Report Finds Retail Energy Key to an Affordable Clean Energy Transition - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1yZXBvcnQtZmluZHMtcmV0YWlsLWVuZXJneS1rZXktdG8tYW4tYWZmb3JkYWJsZS1jbGVhbi1lbmVyZ3ktdHJhbnNpdGlvbi0zMDE4Nzg0NzIuaHRtbNIBAA?oc=5\" target=\"_blank\">New Report Finds Retail Energy Key to an Affordable Clean Energy Transition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Findings recommend removing barriers to competition and improving consumer protections to realize market benefits WASHINGTON, July 17, 2023 \/PRNewswire\/ -- A new report finds that consumers in states with restructured energy markets are better off than states still holding onto the monopoly utility model. States that allow competition are also better positioned to support the transition to clean energy, consumer adoption of electric vehicles, and reduce carbon emissions without relying on ratepayer or taxpayer dollars. A map depicting the 17 states that have adopted retail choice from Retail Energy Advancement League (REAL). It also features a quote from the new Analysis Group report highlighting the benefits of a competitive energy market. The report, \" At the Crossroads: Improving Customer Choice for Products in the U.S. Electricity Sector ,\" authored by the Analysis Group , provides a thorough analysis of different state and industry experiences with retail energy markets, explores effective methods to evaluate market benefits, and proposes reforms to maximize these advantages. Report findings demonstrate that retail energy choice has substantially increased the options available to consumers for the purchase of electricity, played a critical role in the development of clean energy resources, created and marketed a wide range of products that are designed to meet consumers' energy cost management and non-price preferences, and creates the conditions to lower all energy costs in the state market over time. \"While the original intent behind retail choice was focused on reducing energy costs, the benefits of today's competitive retail energy market extend well beyond price,\" says Paul Hibbard, author of the report and former chairman of the Massachusetts Department of Public Utilities. \"It allows consumers to exercise choice, allows for unique product offerings tailored to consumer interest, and fosters innovation that will be a powerful tool in the toolbelt states will need if they are to successfully achieve decarbonization goals. However, now is a critical time for states to get it right.\" The report raised concerns on the methodology used in some existing market analyses that fail to consider the comprehensive impacts of competitive markets, relying solely on a price comparison of the default utility product and the variety of retail energy products over a specific time period as an indicator of the success of the market. For example, comparing the utility short term basic service rate against a 12-month, fixed rate 100% renewable retail energy product, an electric vehicle charging plan that includes charging equipment, or a product that includes free nights and weekends for a set price. The comparison does not account for the additional derived value chosen by the customer. As the report notes, \"These diverse features and the continuously changing components and pricing of retail product offerings make it difficult to compare on a consistent basis outcomes across states, among retail suppliers within a state, or between competitive suppliers and utility default service offerings. Thus, an effective analysis on the health and success of competitive retail energy markets cannot hinge on price alone.\" Report recommendations include having states prioritize consumer education, improve state regulations to better protect consumers against deceptive advertising, and increase penalties for bad actors. \"We stand ready to work with regulators on implementing the proposed reforms outlined in the report,\" said Chris Ercoli, President and CEO of REAL. \"By prioritizing consumer education initiatives, creating a fair environment for competition, and ensuring fundamental consumer protections in place, restructured states can unlock the full potential of competitive retail energy markets and foster a more transparent, inclusive, and sustainable energy landscape.\" About REAL The Retail Energy Advancement League (REAL) is a national advocacy organization dedicated to the expansion and modernization of American retail electric markets. The organization was founded by a coalition of companies that believe consumers deserve control over their energy decisions and that smart regulation and strong consumer protections are the foundation of a healthy market. SOURCE Retail Energy Advancement League (REAL)","filter_flag":1}
{"title":"Hart Energy's 2023 ESG Awards: Cleaner, Safer, More Diverse - Hart Energy","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmhhcnRlbmVyZ3kuY29tL2V4Y2x1c2l2ZXMvaGFydC1lbmVyZ3lzLTIwMjMtZXNnLWF3YXJkcy1jbGVhbmVyLXNhZmVyLW1vcmUtZGl2ZXJzZS0yMDU3NznSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmhhcnRlbmVyZ3kuY29tL2V4Y2x1c2l2ZXMvaGFydC1lbmVyZ3lzLTIwMjMtZXNnLWF3YXJkcy1jbGVhbmVyLXNhZmVyLW1vcmUtZGl2ZXJzZS0yMDU3NznSAQA?oc=5","id":"CBMiZGh0dHBzOi8vd3d3LmhhcnRlbmVyZ3kuY29tL2V4Y2x1c2l2ZXMvaGFydC1lbmVyZ3lzLTIwMjMtZXNnLWF3YXJkcy1jbGVhbmVyLXNhZmVyLW1vcmUtZGl2ZXJzZS0yMDU3NznSAQA","guidislink":false,"published":"Fri, 14 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=195, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmhhcnRlbmVyZ3kuY29tL2V4Y2x1c2l2ZXMvaGFydC1lbmVyZ3lzLTIwMjMtZXNnLWF3YXJkcy1jbGVhbmVyLXNhZmVyLW1vcmUtZGl2ZXJzZS0yMDU3NznSAQA?oc=5\" target=\"_blank\">Hart Energy's 2023 ESG Awards: Cleaner, Safer, More Diverse<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Hart Energy<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Hart Energy's 2023 ESG Awards: Cleaner, Safer, More Diverse - Hart Energy","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmhhcnRlbmVyZ3kuY29tL2V4Y2x1c2l2ZXMvaGFydC1lbmVyZ3lzLTIwMjMtZXNnLWF3YXJkcy1jbGVhbmVyLXNhZmVyLW1vcmUtZGl2ZXJzZS0yMDU3NznSAQA?oc=5\" target=\"_blank\">Hart Energy's 2023 ESG Awards: Cleaner, Safer, More Diverse<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Hart Energy<\/font>","source.href":"https:\/\/www.hartenergy.com","source.title":"Hart Energy","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"ESG matters remain a critical–and sometimes, controversial–touchstone for companies across the supply chain as the energy transition cycle transforms the industry. Hart Energy’s annual ESG Awards highlight the findings of data analysis firm Clear Rating in its effort to categorize and quantify individual business efforts to improve ESG performance. Houston-based Clear Rating specializes in private company valuations, digital securities ratings, and ESG impact assessments. These awards recognize advancements made in sustainable operation, local community engagement and positive workplace culture. The firm made special recognition of individuals in an “ESG Champion” listing on a case-by-case basis. Clear Rating analyzed dozens of nominations and applied a weighted methodology to score nominated companies. In this assessment, more easily quantifiable environmental improvements were weighted the heaviest. The ratings still placed critical scoring metrics on social advancement, including community support and workforce sentiment, and on governance matters, such as board diversity. The final weighted score represents an average of the three ratings. Public Producer Pioneer Natural Resources Final Score: 90 Pioneer Natural Resources’ CEO Scott Sheffield was one of the highest profile executives to call on the industry to reduce flaring in its operations. Calling it a “black eye” as much as five years ago, Sheffield has continued calls on industry colleagues to improve environmental standards. Pioneer, a Permian Basin pure play, prioritizes emissions reductions, freshwater use and diminishing its physical footprint on the land. (Source: Hart Energy) Pioneer, a Permian Basin pure play, prioritizes emissions reductions, freshwater use and diminishing its physical footprint on the land. E – Pioneer committed to reduce methane emissions through facility design, operations and leak-management protocols. Flaring is less than 2% of Pioneer’s produced natural gas, one of the lowest rates in the Permian, and the company has eliminated routine flaring. Category Score: 90 S – The firm strives to protect the environment from damage, as well as the lives of its employees and community members who live near its operations from injury and health risks. Category Score: 90 G – The board of directors is 23% racially diverse and 31% of its membership is female. Pioneer’s board was among the first U.S. producers to report annually on sustainability and climate risk, which is now common among public operators around the world. The board also realigned its executive compensation calculations with ESG performance measurements. Category Score: 90 Talos Energy Final Score: 88.75 One of the leading independent operators in the Gulf of Mexico, Talos Energy strives to create and maintain a culture of ESG awareness with initiatives that foster corporate responsibility in daily operations. The Bayou Bend CCS project was the first offshore lease in the U.S. dedicated to CO₂ sequestration. (Source: Talos Energy Inc.) E – Talos demonstrated commitment to protecting the diverse ocean and coastal environments in which it operates. Through its safety and environmental management system, Talos actively monitors its operations to minimize impacts and ensure full compliance with applicable industry standards and regulations. Current environmental initiatives include a 30% reduction in greenhouse gas emissions (GHG) emissions intensity by 2025 from baseline 2018 levels. Category Score: 90 S – Talos was named one of Houston Chronicle’s Top Workplaces in Houston for eight consecutive years. In June 2021, the company raised approximately $70,000 through employee and company matching contributions to a local Houston children’s charity, Kid’s Meals. Category Score: 85 G – The company has increased female representation on its board of directors to 30%. It has also increased its ESG-related performance metrics to account for 20% of management’s annual incentive plan. Category Score: 85 Private Producer PureWest Energy Final Score: 90.25 PureWest, a natural gas producer in the Rockies, incorporates its ESG principles into daily operations through voluntary initiatives to self-monitor and decrease GHG emissions in support of community volunteering programs. The company, which recently was acquired by a private investor group largely led by family offices, has cultivated a positive, productive and inclusive work environment and was honored with a Denver Business Journal “Best Place to Work” award in the 2023 Large Company category. PureWest is implementing new technology to help replace energy-intensive operations, including solar heat trace pumps and well automation, which allows the company to remove pneumatic devices—eliminating those operational emissions as well as the potential for fugitives. (Source: PureWest) E – PureWest worked closely with Project Canary and TrustWell to certify all of its wells as “Responsibly Sourced” by year-end 2022. A rigorous internal auditing program was established to evaluate leak detection and repair (LDAR) findings and conduct facility evaluations. PureWest voluntarily removed thousands of pneumatic pumps to replace them with solar-powered devices, and removed all of its high-bleed pneumatic devices. The company also deployed stationary methane detection monitors at select sites. Category Score: 90 S – PureWest’s charitable giving policy focuses on providing for basic human needs, such as food, shelter, healthcare and education. The company matches employee donations to more than 60 organizations. Category Score: 85 G – PureWest seeks to encourage healthy debate and embrace the diversity of its workforce. The company says it fosters a workplace that encourages and rewards initiative and provides authority to make decisions within areas of accountability. It empowers employees to adhere to the corporate commitment to operate responsibly and continuously improve the bottom line. Category Score: 95 Sentinel Peak Resources Final Score: 90 Sentinel Peak Resources is focused on the acquisition, development and exploration of oil and gas resources, primarily in California. The firm concentrates on operational excellence, serving as a steward of the environment and investing in its people and communities. Sentinel Peak Resources’ oil and gas operation in the McKittrick oil field is located among the foothills of Western Kern County, Calif. (Source: Sentinel Peak Resources) E – The company set a target of achieving carbon neutrality by 2030 through improved efficiencies, adoption of alternative energy sources and utilization of new technologies. Sentinel has improved its methane management with a five-tank vapor recovery system that reduced CO 2 emissions from crude oil storage tanks by 93%. In addition to GHG reduction, Sentinel minimized freshwater use, sourcing over 95% of its water from non-potable sources, including produced water from its own wells. Category Score: 90 S – Sentinel supports multiple community youth programs, such as mentorship programs in local high schools, and a program to support emancipated young people develop skills required to obtain field or administrative work. The company supports the Los Angeles community by converting some non-operating sites into affordable housing and other socioeconomic needs. Category Score: 90 G – Sentinel’s regulatory compliance has allowed it to succeed despite the headwinds oil and gas companies face in California. The company adopted the California Air Resources Board reporting standards for GHG emissions, an LDAR program, groundwater monitoring, oil spill prevention and other programs. Sentinel employs a third-party whistleblower reporting service, Lighthouse Service, to ensure a safe space for employees to report concerns, and it says it is committed to adopting cybersecurity protocols to ensure system and source integrity. Category Score: 90 Public Services Baker Hughes Final Score: 92 The oilfield services giant demonstrates ESG leadership in its goal setting, its sustainability performance and its investments in new products and services. As an energy technology company, Baker Hughes is committed to not only improving its own ESG performance, but also helping customers meet their ESG challenges and opportunities in support of the energy transition. Baker Hughes’ facility in Massa, Italy, is part of the company’s efforts to run more operations on renewable energies. (Source: Baker Hughes) E – In 2022, Baker Hughes reduced its Scope 1 and 2 CO 2 emissions by 28% from the 2019 baseline, with 10 Scope 3 emissions categories reported with limited assurance. The company recycled 57,666 metric tons of waste and sourced 26% of its electricity from zero-emissions sources. Category Score: 95 S – Baker Hughes pledged $2 million in strategic grants through the Baker Hughes Foundation in support of the UN Sustainable Development Goals in 2022. The company gave $925,000 to support diversity and inclusion programs, as well as education and opportunity initiatives. It donated $417,000 to support health, safety and wellness, and disaster relief. And it gave $650,000 to support environmental programs. Categoy Score: 80 G – Last year, 53,846 Baker Hughes employees had completed annual code of conduct training, including training on ethics, compliance and anti-corruption; 99% of the company’s governance body members had received anti-corruption training; and 100% of enterprise security personnel, including full-time and embedded contractors, were trained in human rights policies. Category Score: 85 ChampionX Final Score: 90 ChampionX is a global leader in upstream and midstream oilfield technology solutions, chemistry programs and services, drilling technology, artificial lift and automation technologies for the oil and gas industry. It defines its overarching corporate purpose as improving lives, and has built a sustainability culture from the ground up. ChampionX chemical solutions and services provide chemistry, technology, engineering support and onsite expertise to improve outcomes for upstream and midstream oil and gas operations. (Source: ChampionX) E – ChampionX says it embedded sustainability into its culture and promoted more sustainable operations internally. It launched an internal carbon footprint calculator, which enables employees to calculate the manufacturing carbon footprint associated with transporting products from facilities to customer assets. In many cases, the calculator has shown the positive impact the company’s products have on reducing customers’ carbon emissions in the field. Category Score: 90 S – ChampionX supports nine resource groups with the voluntary participation of over 1,000 employees. The goal is to create a workplace culture that cultivates a sense of belonging and allows for more purposeful alignment with the principles of the company. ChampionX also launched SEED (Sustainable Energy Empowers Development), a program that connects employees with opportunities to personally support environmental programs. Category Score: 90 G – In support of their goal of continuous improvement and to strengthen the inclusivity of the company, ChampionX established an enterprise-wide Diversity and Inclusion Council, chaired by ChampionX CEO Soma Somasundaram. The council is made up of senior leaders from a cross-section of the company’s business, including a rotating set of employee resource group leaders. Category Score: 90 Private Services Danos Final Score: 93.75 A family-owned oilfield service company, Danos views its commitment to ESG principles as fundamental to its success. The company is a founding member of the National Ocean Industries Association’s (NOIA) ESG network, which shares and develops best practices across the offshore energy industry. Danos works with partner Natrx in Louisiana’s marsh to offload Cajun Coral, a restoration model that uses digital tools to work with mother nature to protect coastlines. (Source: Danos) E – Danos works with wetland conservation groups, and is involved in projects building artificial reefs–nicknamed Cajun coral–using 3D printing that will help regrow coral beds, as well as protect against coastal erosion in Louisiana. Danos utilizes engine-calibration software to reduce its fleet’s fuel consumption and cut its CO 2 emissions by 1,178 total metric tons a year. Category Score: 95 S – The Danos Foundation has given over $1 million to 120 organizations and more than 350 employees in need since it launched in 2017. Danos partners with several technical and community colleges that offer degrees supporting the industry, and the company has a robust on-the-job training program. Category Score: 90 G – Danos’ fabrication facility is fully certified to the International Organization for Standardization's quality management system standards and conducts rotating internal process audits to ensure compliance. The company is a multiyear winner of the National Ocean Industries Association (NOIA) Culture of Safety award for establishing an institutional safety culture through behavior-based safety programs and innovation. Category Score: 90 Integrity BioChem Final Score: 93.25 Integrity BioChem manufactures biopolymer products. (Source: Integrity BioChem) Integrity Bio-Chemicals appointed its first director of sustainability in fall 2021 and touts breakthroughs in sustainability initiatives throughout the organization, committing itself to sustainable natural product solutions for the full product lifecycle. E – Integrity BioChem’s bio-based, 4x-concentrated surfactants reduce combustion engine footprint by 75%. Category Score: 95 S – A small company, Integrity BioChem boasts that, at its core, it is a technology company. The company strives for employee safety, reporting zero lost-time incidents in 2022. Category Score: 85 G – Integrity BioChem made an executive commitment to ESG with the creation of a new role, director of sustainability. Laura Kuri Benavides took on this charge to implement and document the company’s sustainability processes. She also provides guidance on emerging sustainability technologies. Category Score: 90 Public Midstream Archrock Final Score: 94.5 Houston-based Archrock’s mission is to “Power a Cleaner America.” The natural gas compression services provider’s 1,000-plus employees are spread across 21 states. (Source: Archrock) E – Archrock reduced its Scope 1 and 2 carbon intensity by 11% in 2021 compared to 2020 levels. Scope 3 emissions in 2021 were 37% below 2017 levels. In 2022, Archrock acquired a 25% equity position in Ecotec, a company that provides methane emissions monitoring, leak detection and environmental compliance. Archrock is working to connect Ecotec’s proven technology with its U.S. natural gas compression infrastructure and customer support network. Category Score: 95 S – The Archrock Cares organization supports volunteer activities with organizations, such as the Houston Food Bank. In 2022, Archrock added a diversity and inclusion metric to its short-term incentive program, increasing the company’s percentage of employees that self-identify as members of underrepresented groups. Category Score: 90 G – Archrock’s majority independent and annually elected board of directors drive a focus on long-term sustainability and governance standards throughout the organization. Of the annually elected Archrock board of directors, three of the seven independent board members are either female or ethnically diverse, including audit and governance committees led by female board members. In 2022, Archrock increased the weight of safety and sustainability within its short-term incentive plan to 20%. Category Score: 95 Crestwood Equity Partners Final Score: 93.25 Crestwood Equity Partners made significant strides on its second, three-year sustainability strategy, initiated in January 2022, including deliverables achieved through its comprehensive carbon management plan. Crestwood remains committed to seeking ways to enhance its emissions monitoring. (Source: Crestwood Equity Partners LP) E – While the company’s GHG emissions increased in 2022 due to the acquisitions of new gathering, compression and processing assets, Crestwood achieved a 5% reduction in its methane emissions intensity rate from 2021 levels and a 58% reduction since 2018. The company also made advancements on its continuous, methane-monitoring pilot and installed devices on 13% of its assets in 2022, enhancing its approach to methane detection. Category Score: 95 S – In 2022, Crestwood donated $1.5 million to the communities it operates in, and Crestwood employees volunteered over 2,800 hours. Category Score: 85 G – Crestwood continues to increase its female leadership representation and was included in the 2023 Bloomberg Gender-Equality Index for the third consecutive year. Crestwood continues to make significant progress in advancing its approach to corporate governance in alignment with best practices, enhancing disclosures in its annual proxy statement and maintaining a board composition of 89% independent directors, reflecting diverse perspectives and ensuring robust decision-making. Category Score: 90 Aris Water Solutions Final Score: 89.25 Aris Water Solutions, a leading developer and operator of critical water infrastructure assets in the Midland and Delaware basins, has committed to exceeding the high standards set by its customers, global regulators and the global investment community. This enables customers to exceed their own water, safety and community commitments and focus on their core businesses. Aris Water Solutions is a leading developer and operator of critical water infrastructure assets in the Midland and Delaware basins. (Source: Aris Water Solutions) E – Aris recycled 4.6 billion gallons of water in 2022 to offset groundwater withdrawals, reduce wastewater disposal and cut carbon emissions. Aris led the formation of the largest joint industry beneficial reuse project, working with three major operators to develop, pilot and demonstrate desalination and polishing treatment technologies that aim to facilitate safe beneficial reuse of treated water outside of the oil industry. Also, Aris was able to reduce fresh and groundwater consumption by up to 90% in certain instances. Category Score: 90 S – Aris supports local communities by giving to and volunteering with first responders and local charities. Category Score: 90 G – The company is committed to ensuring a diverse and inclusive culture, with over 50% minority and female representation, including at senior leadership and executive levels. Aris has an independent governance with a diverse board, including 33% gender and minority representation. Category Score: 85 Private Midstream XRI Holdings Final Score: 88.75 XRI was founded in 2013 on the tenets of conservation of water resources, environmental sustainability, employee health and safety and corporate stewardship. XRI’s mission is to provide the industry with an environmentally sustainable alternative to groundwater use for hydraulic fracturing operations. XRI has committed to a corporate culture and code of conduct ensuring the highest level of business ethics, including anti-bribery and corruption standards, stakeholder rights and social justice practices, as well as governance of sustainability initiatives. (Source: XRI Holdings) E – The independent water midstream company’s operations avoid the emitting of 225,000 metric tons of CO 2 per year, save over 400 MMbbl of freshwater aquifers per year and prevent reinjection of over 270 MMbbl of wastewater. Category Score: 90 S – XRI engages with the community it serves through volunteering and participating in economic development. Category Score: 85 G – XRI has committed to a corporate culture and code of conduct ensuring the highest level of business ethics, including anti-bribery and corruption standards, stakeholder rights and social justice practices, as well as governance of sustainability initiatives. Category Score: 85","filter_flag":1}
{"title":"Making Renewable, Infinitely Recyclable Plastics Using Bacteria – Berkeley Lab News Center - Lawrence Berkeley National Laboratory (.gov)","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vbmV3c2NlbnRlci5sYmwuZ292LzIwMjMvMDcvMjcvbWFraW5nLXJlbmV3YWJsZS1pbmZpbml0ZWx5LXJlY3ljbGFibGUtcGxhc3RpY3MtdXNpbmctYmFjdGVyaWEv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vbmV3c2NlbnRlci5sYmwuZ292LzIwMjMvMDcvMjcvbWFraW5nLXJlbmV3YWJsZS1pbmZpbml0ZWx5LXJlY3ljbGFibGUtcGxhc3RpY3MtdXNpbmctYmFjdGVyaWEv0gEA?oc=5","id":"CBMiZWh0dHBzOi8vbmV3c2NlbnRlci5sYmwuZ292LzIwMjMvMDcvMjcvbWFraW5nLXJlbmV3YWJsZS1pbmZpbml0ZWx5LXJlY3ljbGFibGUtcGxhc3RpY3MtdXNpbmctYmFjdGVyaWEv0gEA","guidislink":false,"published":"Thu, 27 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=208, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vbmV3c2NlbnRlci5sYmwuZ292LzIwMjMvMDcvMjcvbWFraW5nLXJlbmV3YWJsZS1pbmZpbml0ZWx5LXJlY3ljbGFibGUtcGxhc3RpY3MtdXNpbmctYmFjdGVyaWEv0gEA?oc=5\" target=\"_blank\">Making Renewable, Infinitely Recyclable Plastics Using Bacteria – Berkeley Lab News Center<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Lawrence Berkeley National Laboratory (.gov)<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Making Renewable, Infinitely Recyclable Plastics Using Bacteria – Berkeley Lab News Center - Lawrence Berkeley National Laboratory (.gov)","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vbmV3c2NlbnRlci5sYmwuZ292LzIwMjMvMDcvMjcvbWFraW5nLXJlbmV3YWJsZS1pbmZpbml0ZWx5LXJlY3ljbGFibGUtcGxhc3RpY3MtdXNpbmctYmFjdGVyaWEv0gEA?oc=5\" target=\"_blank\">Making Renewable, Infinitely Recyclable Plastics Using Bacteria – Berkeley Lab News Center<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Lawrence Berkeley National Laboratory (.gov)<\/font>","source.href":"https:\/\/newscenter.lbl.gov","source.title":"Lawrence Berkeley National Laboratory (.gov)","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Key Takeaways Researchers engineered E. coli to turn sugar from plants into the raw materials for biorenewable plastics. Those biorenewable plastics are called PDKs, a new type of plastic that can be efficiently recycled over and over again. Replacing petrochemicals with the bio alternative expanded the PDK’s working temperature, opening applications in the auto industry and beyond With even modest improvements, using bio alternatives could be both greener and cheaper than petrochemicals in the near-term. Plastic waste is a problem. Most plastics can’t be recycled, and many use finite, polluting petrochemicals as the basic ingredients. But that’s changing. In a study published today in Nature Sustainability, researchers successfully engineered microbes to make biological alternatives for the starting ingredients in an infinitely recyclable plastic known as poly(diketoenamine), or PDK. The finding comes from collaboration among experts at three facilities at the Department of Energy’s Lawrence Berkeley National Laboratory (Berkeley Lab): the Molecular Foundry, the Joint BioEnergy Institute (JBEI), and the Advanced Light Source. “This is the first time that bioproducts have been integrated to make a PDK that is predominantly bio-based,” said Brett Helms, staff scientist at the Molecular Foundry who led the project. “And it’s the first time that you see a bio-advantage over using petrochemicals, both with respect to the material’s properties and the cost of producing it at scale.” Unlike traditional plastics, PDK can be repeatedly deconstructed into pristine building blocks and formed into new products with no loss in quality. PDKs initially used building blocks derived from petrochemicals, but those ingredients can be redesigned and produced with microbes instead. Now, after four years of effort, collaborators have manipulated E. coli to turn sugars from plants into some of the starting materials – a molecule known as triacetic acid lactone, or bioTAL – and produced a PDK with roughly 80% bio-content. “We’ve demonstrated that the pathway to 100% bio-content in recyclable plastics is feasible,” said Jeremy Demarteau, a project scientist on the team contributing to biopolymer development. “You’ll see that from us in the future.” PDKs can be used for a variety of products, including adhesives, flexible items like computer cables or watch bands, building materials, and “tough thermosets,” rigid plastics made through a curing process. Researchers were surprised to find that incorporating the bioTAL into the material expanded its working temperature range by up to 60 degrees Celsius compared to the petrochemical version. This opens the door to using PDKs in items that need specific working temperatures, including sports gear and automotive parts such as bumpers or dashboards. Solving the plastic waste problem The United Nations Environment Program estimates that we globally produce about 400 million tons of plastic waste every year, and that number is predicted to climb to more than 1 billion tons by 2050. Of the 7 billion tons of plastic waste already created, only about 10 percent has been recycled, while most is discarded into landfills or burned. “We can’t keep using our dwindling supply of fossil fuels to feed this insatiable desire for plastics,” said Jay Keasling, a professor at UC Berkeley, senior faculty scientist in Berkeley Lab’s Biosciences Area, and the CEO of JBEI. “We want to help solve the plastic waste problem by creating materials that are both biorenewable and circular – and providing an incentive for companies to use them. Then people could have the products they need for the time they need them, before those items are transformed into something new.” The study released today also builds on a 2021 environmental and technological analysis, which showed that PDK plastic could be commercially competitive with conventional plastics if produced at a large scale. “Our new results are extremely encouraging,” said Corinne Scown, a staff scientist in Berkeley Lab’s Energy Technologies Area and a vice president at JBEI. “We found that with even modest improvements to the production process, we could soon be making bio-based PDK plastics that are both cheaper and emit less CO2 than those made with fossil fuels.” Those improvements would include speeding up the rate at which microbes convert sugars to bioTAL, using bacteria that can transform a wider variety of plant-derived sugars and other compounds, and powering the facility with renewable energy. This work was supported by the Department of Energy’s Bioenergy Technologies Office. The Molecular Foundry is a DOE Office of Science, Office of Basic Energy Sciences user facility that specializes in nanoscale science. JBEI is a Bioenergy Research Center funded by DOE’s Office of Science. The Advanced Light Source is a DOE Office of Science user facility. PDK technology is available for licensing and collaboration. If interested, please contact Berkeley Lab’s Intellectual Property Office, [email protected]. # # # Founded in 1931 on the belief that the biggest scientific challenges are best addressed by teams, Lawrence Berkeley National Laboratory and its scientists have been recognized with 16 Nobel Prizes. Today, Berkeley Lab researchers develop sustainable energy and environmental solutions, create useful new materials, advance the frontiers of computing, and probe the mysteries of life, matter, and the universe. Scientists from around the world rely on the Lab’s facilities for their own discovery science. Berkeley Lab is a multiprogram national laboratory, managed by the University of California for the U.S. Department of Energy’s Office of Science. DOE’s Office of Science is the single largest supporter of basic research in the physical sciences in the United States, and is working to address some of the most pressing challenges of our time. For more information, please visit energy.gov\/science.","filter_flag":1}
{"title":"EconiQ retrofill: the sustainable solution that reduces reliance on SF₆ - Hitachi Energy","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LmhpdGFjaGllbmVyZ3kuY29tL25ld3MvYmxvZ3MvMjAyMy8wNy9lY29uaXEtcmV0cm9maWxsLXRoZS1zdXN0YWluYWJsZS1zb2x1dGlvbi1mb3ItcmVkdWNpbmctZ3JlZW4taG91c2UtZ2FzLXNmNtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LmhpdGFjaGllbmVyZ3kuY29tL25ld3MvYmxvZ3MvMjAyMy8wNy9lY29uaXEtcmV0cm9maWxsLXRoZS1zdXN0YWluYWJsZS1zb2x1dGlvbi1mb3ItcmVkdWNpbmctZ3JlZW4taG91c2UtZ2FzLXNmNtIBAA?oc=5","id":"CBMie2h0dHBzOi8vd3d3LmhpdGFjaGllbmVyZ3kuY29tL25ld3MvYmxvZ3MvMjAyMy8wNy9lY29uaXEtcmV0cm9maWxsLXRoZS1zdXN0YWluYWJsZS1zb2x1dGlvbi1mb3ItcmVkdWNpbmctZ3JlZW4taG91c2UtZ2FzLXNmNtIBAA","guidislink":false,"published":"Mon, 03 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=184, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LmhpdGFjaGllbmVyZ3kuY29tL25ld3MvYmxvZ3MvMjAyMy8wNy9lY29uaXEtcmV0cm9maWxsLXRoZS1zdXN0YWluYWJsZS1zb2x1dGlvbi1mb3ItcmVkdWNpbmctZ3JlZW4taG91c2UtZ2FzLXNmNtIBAA?oc=5\" target=\"_blank\">EconiQ retrofill: the sustainable solution that reduces reliance on SF₆<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Hitachi Energy<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"EconiQ retrofill: the sustainable solution that reduces reliance on SF₆ - Hitachi Energy","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LmhpdGFjaGllbmVyZ3kuY29tL25ld3MvYmxvZ3MvMjAyMy8wNy9lY29uaXEtcmV0cm9maWxsLXRoZS1zdXN0YWluYWJsZS1zb2x1dGlvbi1mb3ItcmVkdWNpbmctZ3JlZW4taG91c2UtZ2FzLXNmNtIBAA?oc=5\" target=\"_blank\">EconiQ retrofill: the sustainable solution that reduces reliance on SF₆<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Hitachi Energy<\/font>","source.href":"https:\/\/www.hitachienergy.com","source.title":"Hitachi Energy","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"That means an essential subject like SF 6 and the impact of greenhouse gases could also reach popularity akin to acid rain in the '70s or the ozone layer in the '80s. Something that captures the interest of many, but comprehending all its aspects and implications requires a significant investment of time and effort. SF 6 is a manufactured greenhouse gas with an extremely high global warming potential (GWP). A metric ton of SF 6 in the atmosphere is equivalent to the same GWP as 23,500 metric tons of CO2 in the atmosphere over 100 years. This is equivalent to approximately 125 passenger cars on the road for a year. If accidentally released into the atmosphere, SF 6 remains there for around 3200 years. Rising environmental impact The Earth’s temperatures have been increasing since 1950. Over the last 40 years, each decade has been warmer than the last, with the last 10 years being the hottest on record. SF 6 must be handled with care as it can absorb and emit infrared radiation and prevent it from escaping into space. This trapped heat increases the Earth's surface and atmospheric temperature (the greenhouse effect). The energy sector is among the highest users of SF 6 , accounting for 80 percent of global SF 6 emissions in 2019, according to the Intergovernmental Panel on Climate Change (IPCC). Due to its insulation and current interruption properties, SF 6 has been used for circuit breakers and gas-insulated switchgear in high-voltage substations for decades. Although leakage rates in the manufacturing process and during the operation of modern high-voltage equipment are low, utilities have long recognized the need to minimize the use of SF 6 or replace it altogether. The main challenge? A lack of viable alternatives. Steps to decarbonizing the grid","filter_flag":1}
{"title":"Inside the 'supermarket of the future' promising to waste less energy and less food - FoodNavigator.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDYvMzAvSW5zaWRlLXRoZS1zdXBlcm1hcmtldC1vZi10aGUtZnV0dXJlLXByb21pc2luZy10by13YXN0ZS1sZXNzLWVuZXJneS1hbmQtbGVzcy1mb29k0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDYvMzAvSW5zaWRlLXRoZS1zdXBlcm1hcmtldC1vZi10aGUtZnV0dXJlLXByb21pc2luZy10by13YXN0ZS1sZXNzLWVuZXJneS1hbmQtbGVzcy1mb29k0gEA?oc=5","id":"CBMiggFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDYvMzAvSW5zaWRlLXRoZS1zdXBlcm1hcmtldC1vZi10aGUtZnV0dXJlLXByb21pc2luZy10by13YXN0ZS1sZXNzLWVuZXJneS1hbmQtbGVzcy1mb29k0gEA","guidislink":false,"published":"Mon, 03 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=184, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDYvMzAvSW5zaWRlLXRoZS1zdXBlcm1hcmtldC1vZi10aGUtZnV0dXJlLXByb21pc2luZy10by13YXN0ZS1sZXNzLWVuZXJneS1hbmQtbGVzcy1mb29k0gEA?oc=5\" target=\"_blank\">Inside the 'supermarket of the future' promising to waste less energy and less food<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Inside the 'supermarket of the future' promising to waste less energy and less food - FoodNavigator.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDYvMzAvSW5zaWRlLXRoZS1zdXBlcm1hcmtldC1vZi10aGUtZnV0dXJlLXByb21pc2luZy10by13YXN0ZS1sZXNzLWVuZXJneS1hbmQtbGVzcy1mb29k0gEA?oc=5\" target=\"_blank\">Inside the 'supermarket of the future' promising to waste less energy and less food<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","source.href":"https:\/\/www.foodnavigator.com","source.title":"FoodNavigator.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"The 1,500 sqm flagship store – leased to the discount retailer COOP 365 and built next to the Danfoss headquarters in Nordborg – runs off sustainable energy sources and reuses the excess heat created by cooling cases to cut heating costs by up to 90%. Danfoss claimed the flagship store, which opened to the public on June 29, is expected to be around 50% more energy efficient compared to a typical supermarket with a first-generation CO2 refrigeration system and no energy efficiency solutions. It is also expected to be approximately 20-30% more efficient than an equivalent local store already fitted with multiple energy efficiency solutions. Using advanced heating and cooling technology makes good business sense too, the company claimed. These savings come with a typical payback time of under three years, it said. The store operates both as a functioning supermarket and a development centre for testing new technology. Danfoss hopes it will ‘inspire food retailers in a world of rising energy costs, emissions, and worsening food losses’. “This supermarket is purpose-built for the world ahead of us; a world of more urbanization, larger populations, greater energy demands, a growing need for cooling, and efficient food storage,”​ said Jürgen Fischer, President, Danfoss Climate Solutions. “Danfoss has reimagined what food retail stores could look like in the 21st century,”​ he said. “For the first time, all of Danfoss’ most cutting-edge technology and energy efficient food retail solutions are being brought together into one retail site. But the new Smart Store supermarket is only the beginning. Because it will also serve as an Application Development Center, a ‘live’ testing site for new technologies which we hope will inspire food retailers around the world to move towards zero emissions supermarkets – while making economic sense.”​ The 1,500 sqm flagship 'Smart Store' in Nordborg is now open to the public. Image: Danfoss The efficiency solutions employed to reduce the overall energy needs of the store ​ Supermarkets are big energy consumers. Supermarkets in industrialised countries consume around 3% of a nation’s electricity production. Energy is therefore an area where significant savings can be achieved by food retailers with relatively low investment and good payback times, according to Danfoss. The supermarket will utilize solar power as its primary energy source, with 100 kW solar panels on the building’s roof providing green energy to support the supermarket operations. Heat capture and reuse is also key to the energy efficiency of the supermarket. Excess heat is the world’s largest untapped source of energy. The store is therefore fitted with state-of-the-art heat recovery units, designed to recover the waste heat from all the refrigeration systems: refrigeration systems represent by far the highest share of the total energy consumed in supermarkets. The recovered heat is reused to heat up the store and produce domestic hot water, with any additional heat shared with residents of the surrounding town through a district energy network. Danfoss expects up to a 90% reduction in supermarket heating costs as a result. “In Germany, there are about 30,000 supermarkets which have low temp cooling of minus 18 to minus 24 degrees Celsius,”​ Fischer revealed. “If you use that as energy storage that corresponds to 10 nuclear power plants.”​ Plugging the leaks​ Other initiatives, such as installing doors on refrigerator and freezer cases, will save around a third on energy use, while the choice of LED lighting uses up to 85% less electricity than incandescent bulbs. Automation and monitoring of the ‘Smart Store’ adds another layer of energy saving. Danfoss claimed there is 3% energy leak rate in Europe, which is significantly more in the developing world. Smart refrigeration case control, it said, saves, 8-12% of energy use at system level. To optimize refrigeration efficiency, it’s important to match capacity to demand, Danfoss stressed. Too much cooling, and you waste energy and risk system damage; too little, and you risk food loss. Adapting energy consumption can further allow supermarkets to benefit from cheaper tariffs. The supermarket’s refrigeration system, Danfoss explained, is utilized like a thermal battery, effectively storing or borrowing cooling capacity in the store freezers while energy is cheap or solar electricity is plentiful, then temporarily switching off the compressors during high-cost peak times until the peak has passed. Industry is increasingly seeking ways to save energy via temperature controls ​ The issue of refrigeration systems, energy and the environment is timely. Unilever, for example, is looking to ‘warm up’ ice cream freezers to help tackle emissions​. The downside to this plan is that products will have to withstand the higher storage temperatures. Danfoss said 'Smart Store' products won’t need to be reformulated. “There is no reason why you should not have several temperatures in the supermarket organised in a good way with good technology and digital systems in place,”​ Fischer said. Reducing food loss​ The company does though believe that timely responses to issues in cooling units are critical to preventing food losses. The resources needed to produce the food that becomes lost or wasted have a carbon footprint of about 3.3 billion tonnes of CO2, it claimed. The company is therefore employing solutions at various stages of the value chain to address the problem. In India, for example, solar powered refrigeration units installed in fields can ensure produce lasts up to three days longer and doesn’t spoil by the time it reaches market. The store is fitted with state-of-the-art heat recovery units, designed to recover the waste heat from all the refrigeration systems. Image: Danfoss Its solutions also promise to control temperature during transportation to food retailers. Once in the ‘Smart Store’, meanwhile, it has installed digital, real-time monitoring technology on refrigeration systems and individual products which will alert store managers to problems before they occur. For example, if a supermarket freezer case was to fail overnight then it’s probable that the entire line of frozen foods stocked in that freezer would need to be disposed of as food loss. “Preventing food loss at such scale is critical to preventing lost revenue and reducing emissions,”​ Danfoss said. “Immediately when there is something wrong on the temperature side an alarm will out and we can fix it remotely,”​ elaborated Fischer. Service business model ​ But this kind of technology can be challenging and costly for food retailers to retrofit. Danfoss therefore plans to scale its energy-saving supermarket vison via a service model. “Basically, we run the whole building including the energy system,”​ explained Fischer. “The supermarket can focus fully on selling food. We promise to reduce the energy to a level which is lower than other supermarkets and we promise a Co2 reduction per year as a percentage.” ​Danfoss is first targeting partners in the Nordics and Germany, to be followed by a full European and global push. “Supermarkets will pay a fixed fee just like if you were renting an apartment including heating. In this case, it includes lighting, heating, and we also own and take care of the equipment.”​ Danfoss also takes care of 24\/7 technical support, mostly remotely, but crucial amid a shortage of qualified heating engineers and a significant green energy skills gap across Europe. Danfoss said the fixed fee for supermarkets will 'not be more or less' ​than the rents supermarkets pay already. But the building the 'Smart Store' cost over £10 billion (EUR 11.6 billion), around three times the cost of standard stores with no green technology. “The global financial world is very interested in green technology and there is much more money than opportunity,”​ added Fischer. “That’s why the service model will be a super accelerator.”​","filter_flag":1}
{"title":"New system design for PVT systems coupled with air-to-water reversible heat pump - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA3LzEzL25ldy1zeXN0ZW0tZGVzaWduLWZvci1wdnQtc3lzdGVtcy1jb3VwbGVkLXdpdGgtYWlyLXRvLXdhdGVyLXJldmVyc2libGUtaGVhdC1wdW1wL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA3LzEzL25ldy1zeXN0ZW0tZGVzaWduLWZvci1wdnQtc3lzdGVtcy1jb3VwbGVkLXdpdGgtYWlyLXRvLXdhdGVyLXJldmVyc2libGUtaGVhdC1wdW1wL9IBAA?oc=5","id":"CBMieGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA3LzEzL25ldy1zeXN0ZW0tZGVzaWduLWZvci1wdnQtc3lzdGVtcy1jb3VwbGVkLXdpdGgtYWlyLXRvLXdhdGVyLXJldmVyc2libGUtaGVhdC1wdW1wL9IBAA","guidislink":false,"published":"Thu, 13 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=194, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA3LzEzL25ldy1zeXN0ZW0tZGVzaWduLWZvci1wdnQtc3lzdGVtcy1jb3VwbGVkLXdpdGgtYWlyLXRvLXdhdGVyLXJldmVyc2libGUtaGVhdC1wdW1wL9IBAA?oc=5\" target=\"_blank\">New system design for PVT systems coupled with air-to-water reversible heat pump<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New system design for PVT systems coupled with air-to-water reversible heat pump - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA3LzEzL25ldy1zeXN0ZW0tZGVzaWduLWZvci1wdnQtc3lzdGVtcy1jb3VwbGVkLXdpdGgtYWlyLXRvLXdhdGVyLXJldmVyc2libGUtaGVhdC1wdW1wL9IBAA?oc=5\" target=\"_blank\">New system design for PVT systems coupled with air-to-water reversible heat pump<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Researchers at the University of Zaragoza in Spain have proposed a new design for energy systems based on photovoltaic-thermal (PVT) panels integrated with an air-to-water heat pump via thermal storage tanks. The system is intended to provide space heating, cooling, domestic hot water (DHW), and electricity to industrial buildings. “The space heating\/cooling distribution circuit uses fan coils as terminal units, allowing a minimum supply temperature of 35 C in winter and 7 C in summer,” they said, describing the operational mode of the system. “To increase the use of low-temperature heat, DHW is supplied at 50 C instead of 60 C, performing periodic heat treatments at 60 C to avoid legionellosis according to sanitary regulations.” The scientists tested the proposed system design over a 5-month period in a real system deployed at an industrial facility owned by Spanish PVT specialist Endef in Zaragoza. The hybrid pilot plant consists of eight PVT modules with a combined capacity of 2.6 kW covering a surface of 13.6 m2, two water storage tanks with a capacity of 350 l for DHW and 263 l for space heating and cooling, as well as a Yutaki S6 reversible air-to-water heat pump provided by Japanese manufacturer Hitachi. The heat pump has a nominal capacity of 16 kW in heating mode and of 10.5 kW in cooling mode. Its nominal coefficient of performance (COP) in heating mode is 4.57 and in cooling mode is 3.31. The DHW water tank uses two internal heat exchangers, one for the solar circuit and the other one for the heat pump. The system can provide from 20 C to 60 C in heating mode, from 30 C to 60 C for DHW production, and from 5 C to 22 C in cooling mode. Popular content The research team utilized temperature sensors and flow meters to monitor the thermal performance of the system and a DC\/AC inverter to analyze that of the PV power generation unit. “Real weather data monitored in the pilot plant is integrated in the model. The transient model is run with a 5-min time-step, and the results shown in this work are averaged every hour to smooth out the results, as otherwise fluctuations obscure the graphical interpretation and comparison of results,” it further explained. “Weekly energy results are also calculated, by integration, to compare weekly performance indicators.” Through this analysis, the academics found that the system is potentially “overall self-sufficient” to satisfy the building energy demand. They also ascertained that the pilot plant shows negligible deviation from the simulated setting. “The results show that the heat pump COP estimated in the transient model is similar to the one obtained in the pilot plant, with an average error of -10%,” they further explained. The proposed system is presented in the paper “Experimental validation of a solar system based on hybrid photovoltaic-thermal collectors and a reversible heat pump for the energy provision in non-residential buildings,” published in Renewable and Sustainable Energy Reviews. ","filter_flag":1}
{"title":"4 technology trends driving sustainability in real estate - The Times of India","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2Jsb2dzL3ZhbnRhZ2UtcG9pbnQvNC10ZWNobm9sb2d5LXRyZW5kcy1kcml2aW5nLXN1c3RhaW5hYmlsaXR5LWluLXJlYWwtZXN0YXRlL9IBcmh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2Jsb2dzL3ZhbnRhZ2UtcG9pbnQvNC10ZWNobm9sb2d5LXRyZW5kcy1kcml2aW5nLXN1c3RhaW5hYmlsaXR5LWluLXJlYWwtZXN0YXRlLw?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2Jsb2dzL3ZhbnRhZ2UtcG9pbnQvNC10ZWNobm9sb2d5LXRyZW5kcy1kcml2aW5nLXN1c3RhaW5hYmlsaXR5LWluLXJlYWwtZXN0YXRlL9IBcmh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2Jsb2dzL3ZhbnRhZ2UtcG9pbnQvNC10ZWNobm9sb2d5LXRyZW5kcy1kcml2aW5nLXN1c3RhaW5hYmlsaXR5LWluLXJlYWwtZXN0YXRlLw?oc=5","id":"CBMicmh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2Jsb2dzL3ZhbnRhZ2UtcG9pbnQvNC10ZWNobm9sb2d5LXRyZW5kcy1kcml2aW5nLXN1c3RhaW5hYmlsaXR5LWluLXJlYWwtZXN0YXRlL9IBcmh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2Jsb2dzL3ZhbnRhZ2UtcG9pbnQvNC10ZWNobm9sb2d5LXRyZW5kcy1kcml2aW5nLXN1c3RhaW5hYmlsaXR5LWluLXJlYWwtZXN0YXRlLw","guidislink":false,"published":"Mon, 24 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=24, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=205, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2Jsb2dzL3ZhbnRhZ2UtcG9pbnQvNC10ZWNobm9sb2d5LXRyZW5kcy1kcml2aW5nLXN1c3RhaW5hYmlsaXR5LWluLXJlYWwtZXN0YXRlL9IBcmh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2Jsb2dzL3ZhbnRhZ2UtcG9pbnQvNC10ZWNobm9sb2d5LXRyZW5kcy1kcml2aW5nLXN1c3RhaW5hYmlsaXR5LWluLXJlYWwtZXN0YXRlLw?oc=5\" target=\"_blank\">4 technology trends driving sustainability in real estate<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Times of India<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"4 technology trends driving sustainability in real estate - The Times of India","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2Jsb2dzL3ZhbnRhZ2UtcG9pbnQvNC10ZWNobm9sb2d5LXRyZW5kcy1kcml2aW5nLXN1c3RhaW5hYmlsaXR5LWluLXJlYWwtZXN0YXRlL9IBcmh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2Jsb2dzL3ZhbnRhZ2UtcG9pbnQvNC10ZWNobm9sb2d5LXRyZW5kcy1kcml2aW5nLXN1c3RhaW5hYmlsaXR5LWluLXJlYWwtZXN0YXRlLw?oc=5\" target=\"_blank\">4 technology trends driving sustainability in real estate<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Times of India<\/font>","source.href":"https:\/\/timesofindia.indiatimes.com","source.title":"The Times of India","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Sudhir Pai is the CEO of Magicbricks.com. Under his leadership, Magicbricks has developed cutting edge products and solutions which solve deep rooted problems in the real estate sector. He has been instrumental in scaling up Magicbricks and taking it up to a clear leadership position within the hotly contested online real estate portal segment in India. He is an avid reader, trekker and is passionate about new products and emerging business models in the consumer internet space. LESS ... MORE India’s economy is projected to grow at a rate of 6.5% in FY24, according to the latest Economic Survey (2022-23). This growth is expected to drive up energy demand in the country, particularly as its population is set to reach 1.5 billion by 2030. To ensure sustainability in this changing landscape, the real estate sector must adopt new technologies to make its practices more sustainable, especially as it accounts for 22% of energy demand in India. Recognizing the growing impact of climate change, and the pioneering role that India can play in this regard, the government has already launched several initiatives to promote sustainable energy. Apart from the National Solar Mission and the Energy Conservation Building Code, India also made commitments towards net zero carbon emissions at the COP26 held in 2022. The real estate industry, accounting for almost 40% of global energy-related CO2 emissions, has a critical role to play in mitigating climate change. Green buildings and sustainable architecture are the future of real estate, providing promising environmental and economic impact. With technological advancements, there is an opportunity to build a viable future and elevate the well-being of real estate developers. On National Technology Day, here are top technologies that are changing the present and future of real-estate as we know! Smart Building Systems Smart building systems, in particular, are making a significant contribution to sustainability by converging various building-wide systems into one IT-enabled infrastructure using digital technologies. With an estimated global market value of over $500 billion by 2032, the demand for smart buildings is rapidly growing. Using AI\/ML, smart building systems optimize energy consumption by aligning schedules and intelligently predicting approaches. They also monitor building performance and identify impending failures with real-time analysis, making the infrastructure both smart and secure. For example, occupancy sensors may turn off lights and adjust the temperature in unoccupied rooms, reducing energy waste. Additionally, machine learning algorithms can predict and optimize energy usage based on weather patterns, occupancy, and other factors. This is a fast catching up phenomenon in India and several developers are already leveraging this technology. Renewable energy in vogue Renewable energy, such as solar power, has become a popular topic in recent years due to its potential to reduce greenhouse gas emissions and combat climate change. Moreover, advances in battery technology have made it possible to store renewable energy, enabling buildings to operate entirely on clean energy throughout the year. Mumbai is making strides, and a first of its kind solar power plant to cater exclusively to residential society would soon be operational, and is expected to reduce energy costs by 40%! Solar energy is already being explored for part operations in societies such as for operating lifts or lighting in common areas through solar panel roofs, generally of 25KW capacity. To facilitate transition to renewable energy, frameworks and guidelines such as The Greenhouse Gas Protocol have been developed to assist stakeholders in optimizing energy usage. This protocol also guides developers in adopting strategies such as virtual power purchase agreements (VPPAs), green energy credits, net metering, and Green Tariff mechanisms to promote the use of renewable sources of energy. Green Construction Technologies As the world becomes increasingly focused on sustainability and combating climate change, technology advancements are playing a critical role in creating eco-friendly construction materials. These advancements span from energy-efficient appliances to geothermal heating systems. One of the most promising eco-friendly materials is cellulose insulation, which is made up of 75-80% recycled material, including newspapers. This insulation material is a cost-effective and sustainable alternative to fiberglass insulation, which is commonly used in buildings today. In addition to reducing waste, cellulose insulation provides superior insulation and soundproofing, making it an attractive option for builders. Another promising technology is the development of new construction materials that can capture and store carbon dioxide. This innovation could have a significant impact on reducing the amount of CO2 in the atmosphere. Researchers are experimenting with various materials, such as concrete, that can capture CO2 emissions from industrial processes and store them indefinitely. This process, known as carbon capture and storage (CCS), has the potential to significantly reduce carbon emissions from the construction industry, which is responsible for approximately 39% of global energy-related carbon dioxide emissions. Furthermore, new sustainable construction materials are being developed with renewable resources, such as bamboo, hemp, and mycelium. These materials have a significantly lower carbon footprint than traditional materials like steel and concrete. AI powered tools Artificial intelligence (AI) is revolutionizing the real estate industry by optimizing building performance, reducing energy consumption, and promoting sustainability. AI-powered energy auditing tools analyze consumption patterns and provide recommendations for energy-efficient upgrades, helping building owners save on costs and reduce their carbon footprint. AI-driven waste management systems analyze data from sensors to predict waste production patterns and optimize collection schedules, reducing environmental impact and costs. Occupancy optimization tools optimize lighting, HVAC, and other systems based on occupancy patterns, improving energy efficiency, particularly in commercial buildings. Integration of technology opens more avenues of incorporating sustainable measures , such as setting up charging stations for electric vehicles in parking lots, encouraging the use of sustainable practices and reducing carbon footprints. The primary challenge in technology-adoption is lack of awareness and understanding among stakeholders, and technical expertise and resources to implement these solutions effectively. However, there are growing efforts to facilitate the creation of industry-specific clusters that bring together technology startups, investors, and construction firms to create an ecosystem of innovation. Another challenge is the initial high cost but there is growing sensitivity that the ROI in the long run offsets the initial investment. A study by the World Economic Forum substantiates that digital technologies can renovate ten times the space of traditional technologies within the same budget. The cost of investment can be recouped in less than five years compared to passive energy-efficient solutions, which may take up to 15 years. There are also tax incentives to builders who use sustainable construction materials and technology solutions. As we look towards a more sustainable future, it’s clear that technology will be a key driver of change in the real estate industry and there are countless examples of the same. To fully embrace these technologies, we need to invest in research & development, awareness and collaboration to create innovative solutions that meet the unique needs of this industry. Facebook Twitter Linkedin Email Disclaimer Views expressed above are the author's own.","filter_flag":1}
{"title":"Breweries' leftovers brew up a storm: transforming waste into wealth - Innovation Origins","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vaW5ub3ZhdGlvbm9yaWdpbnMuY29tL2VuL2JyZXdlcmllcy1sZWZ0b3ZlcnMtYnJldy11cC1hLXN0b3JtLXRyYW5zZm9ybWluZy13YXN0ZS1pbnRvLXdlYWx0aC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vaW5ub3ZhdGlvbm9yaWdpbnMuY29tL2VuL2JyZXdlcmllcy1sZWZ0b3ZlcnMtYnJldy11cC1hLXN0b3JtLXRyYW5zZm9ybWluZy13YXN0ZS1pbnRvLXdlYWx0aC_SAQA?oc=5","id":"CBMiZGh0dHBzOi8vaW5ub3ZhdGlvbm9yaWdpbnMuY29tL2VuL2JyZXdlcmllcy1sZWZ0b3ZlcnMtYnJldy11cC1hLXN0b3JtLXRyYW5zZm9ybWluZy13YXN0ZS1pbnRvLXdlYWx0aC_SAQA","guidislink":false,"published":"Mon, 03 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=184, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vaW5ub3ZhdGlvbm9yaWdpbnMuY29tL2VuL2JyZXdlcmllcy1sZWZ0b3ZlcnMtYnJldy11cC1hLXN0b3JtLXRyYW5zZm9ybWluZy13YXN0ZS1pbnRvLXdlYWx0aC_SAQA?oc=5\" target=\"_blank\">Breweries' leftovers brew up a storm: transforming waste into wealth<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Innovation Origins<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Breweries' leftovers brew up a storm: transforming waste into wealth - Innovation Origins","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vaW5ub3ZhdGlvbm9yaWdpbnMuY29tL2VuL2JyZXdlcmllcy1sZWZ0b3ZlcnMtYnJldy11cC1hLXN0b3JtLXRyYW5zZm9ybWluZy13YXN0ZS1pbnRvLXdlYWx0aC_SAQA?oc=5\" target=\"_blank\">Breweries' leftovers brew up a storm: transforming waste into wealth<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Innovation Origins<\/font>","source.href":"https:\/\/innovationorigins.com","source.title":"Innovation Origins","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"The beer brewing industry produces vast amounts of grain waste, which can be efficiently utilized to produce food, biofuel, and valuable chemicals. Recent research elucidates how this waste can be seen as a raw material for new products rather than mere waste. Protein-rich, edible fungi can be grown on the brewery waste, contributing to food security and reducing pressure on agriculture and animal husbandry. Breweries leftovers are not waste anymore; They can be the substrate for protein-rich food; There’s potential for obtaining biofuels and bioplastics, too; A Paris-based start-up, Yeasty, is also revolutionizing brewing byproducts by repurposing spent yeast into nutritious, protein-rich flour. The innovative flour can be used in various applications, from plant-based meats to sports nutrition. Furthermore, the EU LIFE YEAST project has demonstrated how brewing waste can be converted into high-value ingredients for the food, beverage, and cosmetics industries. This innovative approach could decrease emissions and a significant shift towards a circular economy in the brewing industry. Turning waste into a feast: fungi and flour Dr. Mohsen Parchami’s research project at the University of Borås, Sweden, has made significant strides in transforming brewery waste into nutritious, edible fungi, protein-rich food that can be grown directly on the grain waste. This innovative approach aims to reintegrate byproducts of food production back into the same cycle, reducing pressure on agriculture and animal husbandry. The fungi have already been used as an ingredient in a recently developed food product. Moreover, a new method for pre-treating the waste was developed, enabling the separation of various constituents such as starch, protein, and cellulose, all of which are sources of potential new uses. On the other hand, a Paris-based start-up, Yeasty, is upcycling spent yeast from beer brewing into a nutritious flour that can be used as a base for food production. The spent yeast has a high protein content of approximately 50 percent, comparable to animal-based proteins. After debittering, the yeast is dried and concentrated to produce a powder similar to flour. This versatile flour has potential uses in various products, including plant-based meat analogs, sports nutrition, and the cosmetics industry. Beer yeast-derived flour can be the basis for protein-rich food Grains, hops, and water form the basic ingredients for making beer. In addition to these, a fourth one is also essential: yeast. Fueling the future: biofuel and bioplastics Dr. Parchami’s research has further explored the possibilities of using brewery waste to produce a range of new products, such as biofuel, bioplastics, and ingredients for food production. The potential of these uses is vast. Biofuel produced from brewery waste could contribute to developing sustainable energy sources, while bioplastics made from the same waste could offer a more environmentally-friendly alternative to traditional plastics. The project also looked into producing other valuable products such as biogas, biohydrogen, and volatile fatty acids. Support Us! The LIFE YEAST project, another significant contributor to the field, is transforming brewers’ spent yeast into raw materials of high-added value, such as customized yeast extract and Yeast Cell Wall. These raw materials have been found to increase the speed of beer fermentation, offering another potential avenue for optimizing the brewing industry. Avantium builds first bioplastics plant in Dutch Delfzijl: ‘a historic milestone’ On 9 December last year, the tech company Avantium announced to the world that a positive decision had been reached regarding the construction of the world’s first commercial plant for the production of 5 kilotonnes of FDCA (furanic acid) per year. Shaping the future: towards a circular economy These innovative practices are sparking a significant shift towards a circular economy in the brewing industry. The LIFE YEAST project, for instance, aligns with the EU’s priority of transitioning towards a circular economy, aiming to increase the recycling and reuse of products. By transforming waste into valuable resources, these initiatives are contributing to a more sustainable brewing industry and a more circular economy. In addition to their environmental benefits, these innovations also have considerable economic potential. For instance, if breweries understood the opportunities in converting grain waste into various products, it could benefit them both from an economic and environmental point of view. The new fractionation process and biorefinery concept developed by Dr. Parchami’s project could also allow breweries to extract valuable substances such as proteins, fibers, and antioxidants.","filter_flag":1}
{"title":"Direct lithium extraction: The companies at play (part 2\/2) - ShareCafe","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnNoYXJlY2FmZS5jb20uYXUvMjAyMy8wNy8xNC9kaXJlY3QtbGl0aGl1bS1leHRyYWN0aW9uLXRoZS1jb21wYW5pZXMtYXQtcGxheS1wYXJ0LTItMi_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnNoYXJlY2FmZS5jb20uYXUvMjAyMy8wNy8xNC9kaXJlY3QtbGl0aGl1bS1leHRyYWN0aW9uLXRoZS1jb21wYW5pZXMtYXQtcGxheS1wYXJ0LTItMi_SAQA?oc=5","id":"CBMiYWh0dHBzOi8vd3d3LnNoYXJlY2FmZS5jb20uYXUvMjAyMy8wNy8xNC9kaXJlY3QtbGl0aGl1bS1leHRyYWN0aW9uLXRoZS1jb21wYW5pZXMtYXQtcGxheS1wYXJ0LTItMi_SAQA","guidislink":false,"published":"Fri, 14 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=195, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnNoYXJlY2FmZS5jb20uYXUvMjAyMy8wNy8xNC9kaXJlY3QtbGl0aGl1bS1leHRyYWN0aW9uLXRoZS1jb21wYW5pZXMtYXQtcGxheS1wYXJ0LTItMi_SAQA?oc=5\" target=\"_blank\">Direct lithium extraction: The companies at play (part 2\/2)<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ShareCafe<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Direct lithium extraction: The companies at play (part 2\/2) - ShareCafe","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnNoYXJlY2FmZS5jb20uYXUvMjAyMy8wNy8xNC9kaXJlY3QtbGl0aGl1bS1leHRyYWN0aW9uLXRoZS1jb21wYW5pZXMtYXQtcGxheS1wYXJ0LTItMi_SAQA?oc=5\" target=\"_blank\">Direct lithium extraction: The companies at play (part 2\/2)<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ShareCafe<\/font>","source.href":"https:\/\/www.sharecafe.com.au","source.title":"ShareCafe","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"In the previous article, Direct lithium extraction: a potential solution to the lithium supply crisis (Part 1\/2), we outlined what direct lithium extraction (DLE) is, how it works, and how it can alleviate a potential supply crisis. This article will cover the DLE companies, both Australian and international, that are currently using or aiming to use DLE. An overview of some notable DLE companies: Lilac Solutions: Lilac is a Californian-based private company backed by Breakthrough Energy Ventures, helmed by Bill Gates. Investors in the Venture Fund include Jeff Bezos, Jack Ma, Richard Branson, and Warren Buffet, among others. Lilac Technology revolutionises the lithium industry by using disruptive ion-exchange technology to accelerate brine development from years to hours. This energy and water-efficient process extracts lithium from brine without evaporation ponds, yielding lithium chloride for further processing into high-purity lithium carbonate or lithium hydroxide, which is sold to battery makers worldwide. They currently partner with ASX-listed lithium explorer Lake Resources (ASX:LKE) at their flagship Kachi Project in Argentina's Catamarca Province, at the southern end of the Lithium Triangle. EnergyX: Founded in 2018 by Teague Egan, EnergyX is a technology company dedicated to clean energy, specialising in disruptive technologies that harness the power of lithium and batteries to create a sustainable future. EnergyX's product, LiTAS™ (Lithium-Ion Transport and Separation), is a comprehensive suite of lithium selective and processing mechanisms. It utilises proprietary membranes, solvents, and adsorbents to enhance lithium recovery for both current and future lithium-brine resource producers. EnergyX has developed a suite of DLE technologies that can be used in combination to treat any brine type. Sunresin New Materials (SHE:300487): Sunresin is a solution provider involved in the entire process from brine to finished lithium products. With over 10 years of experience, they have executed nine commercial contracts for DLE, totalling 73,000 tonnes per annum. Their technology combines adsorption and membrane separation, enabling the extraction of high-purity lithium carbonate from lean ore brine with significant economic and environmental advantages. They partner with Anson Resources (ASX:ASN), where the company will utilise Sunresin's direct lithium extraction technology to produce battery-grade carbonate at the Paradox lithium project in Utah. Summit Nanotech: Summit Nanotech utilises its patented technology to extract lithium from salar brines while preserving the integrity of the aquifer. The company's unique process allows for the extraction of lithium while enabling the remaining brine to be reinjected back into the reservoir. This innovative approach ensures that the aquifer's integrity is maintained while obtaining valuable lithium resources. International Battery Metals (CNSX:IBAT): IBAT has achieved a groundbreaking milestone by becoming the world's first company to successfully develop and implement Mobile, Modular Direct Lithium Extraction (MDLE) technology on a commercial scale. Their patented extraction technology surpasses traditional methods by recovering a higher quantity of lithium from brine, all while exhibiting remarkable environmental performance. In addition, IBAT's technology boasts a significantly shorter deployment time and lower cost compared to conventional lithium mining models. POSCO (KRX:005490): POSCO is a South Korean steel-making company headquartered in Pohang, South Korea. The company has announced its intentions to increase its lithium production capacity in both Korea and Argentina. The company plans to establish a LiOH conversion plant in Korea and extract lithium from the Salar del Hombre Muerto in Argentina, aiming to achieve a production capacity of 220,000 tonnes per annum by the year 2030. In addition, POSCO has set a goal to raise its annual cathode production capacity to 100,000 tonnes by 2023. While their plans for direct lithium extraction (DLE) have been somewhat shrouded in secrecy, it is evident that POSCO is actively engaged in this area. As of 2021, POSCO boasts a low price-to-earnings ratio of 3.60, indicating a potentially undervalued stock, along with a dividend yield of 5.60%. Analysts have set a consensus price target of KRW 436,500 for the company. It is worth noting that POSCO currently generates the majority of its revenue from steel-making operations, which are currently being affected by issues related to China's property sector. Adionics: Adionics is a private French company established in 2012 following extensive research, aiming to become a leading provider of technology for the utilisation of saline water. Their innovative DLE technology involves the development of a highly selective extractant composition called Flionex, enabling the extraction of lithium salts. Unlike traditional methods with extraction yields of 35 to 60%, Adionics' DLE technology achieves impressive lithium extraction yields ranging from 85 to 99%. Additionally, Adionics' DLE solution is capable of treating brines containing solubilised organics. This technology utilises liquid-liquid extraction techniques to produce a purified and concentrated lithium chloride brine. E3 Lithium (CVE:ETL): E3 Lithium is a lithium resource and technology company focused on producing lithium products to support the growing electric revolution. Based in Alberta, the company draws on the expertise of the mature oil industry to drive its development. The Clearwater Project, supported by E3's Preliminary Economic Assessment, demonstrates significant value, with a Net Present Value (NPV8%) of USD $820 million after tax and a pre-tax value of USD $1.1 billion (NPV8%). The project boasts an Internal Rate of Return (IRR) of 27% after tax and 32% pre-tax. Utilising their DLE technology, E3 Lithium achieves over 90% recovery of lithium while substantially increasing its concentration and reducing impurities by over 98%. With plans to scale up their DLE technology for commercialisation, E3 Lithium aims to produce high-purity, battery-grade lithium products. The company's abundant lithium resources and innovative technological solutions position it as a potential supplier of lithium from one of the world's leading jurisdictions. In line with their vision for a sustainable energy future, E3 Lithium is committed to delivering lithium products with reduced carbon emissions and a minimal environmental footprint. Their projects utilise less than 3% of the land typically required for lithium projects and do not involve tailings or evaporative ponds. Lithium Companies Engaging in Trials for DLE: CleanTech Lithium (AIM:CTL): CleanTech Lithium is an exploration and development company at the forefront of advancing sustainable lithium projects in Chile. With plans to be listed on the ASX by the year's end, CleanTech Lithium is dedicated to shaping the next generation of eco-friendly lithium solutions. Founded in the fourth quarter of 2017, CleanTech Lithium has secured licence rights over three prominent lithium projects located in the esteemed lithium triangle, the world's centre for battery-grade lithium production. At the core of CleanTech Lithium's strategy is the utilisation of DLE, which will be used on the projects through their partnership with Sunresin New Materials. Commenting on the operations, Chief Executive Officer Aldo Boitano stated: \"CleanTech Lithium's mission is to be the leading supplier of green lithium for the transition to electric vehicles. We aim to be 100% powered by renewable energy once in production, utilising Chile's renewable energy capacity near our projects. Using DLE and renewable energy to power the process will represent a major improvement in the sustainability of lithium sourcing and extraction in Chile, and we believe this will create a market advantage for a premium lithium product.\" Lake Resources (ASX:LKE, GR:LK1, OTCQB:LLKKF): As previously stated, lithium explorer Lake Resources uses Lilac Solutions' DLE technology at their flagship Kachi Project, located in Argentina's Catamarca Province at the southern end of the Lithium Triangle, a world-renowned province responsible for 40% of global lithium production. Utilising Lilac's DLE technology, Lake aims to produce a sustainable and high-purity lithium carbonate product at the Kachi project, attracting premium pricing from battery and cathode manufacturers. The environmentally friendly DLE process ensures nearly all the water (brine) is returned to its source, providing the EV and battery industry with a reliable and sustainable source of high-quality lithium for their supply chains. Lake's goal is to complete a definitive feasibility study by December 2023, allowing for enhanced project definition, optimal power solutions, and infrastructure considerations in alignment with the expanding resource base and project reassessment outcomes. Vulcan Energy Resources (ASX:VUL): Vulcan Energy Resources is engaged in the exploration and development of geothermal and lithium resources in Europe and Australia. Its Zero Carbon Lithium™ Project uses DLE and draws on naturally occurring, renewable geothermal energy to power the lithium extraction process and create a renewable energy by-product. *One tonne of lithium hydroxide produced through our process requires: Anson Resources (ASX:ASN): Anson Resources is an Australian-based exploration and development company focused on the Paradox Lithium Project in the Paradox Basin in southern Utah. Anson Resources uses Sunresin's DLE technology at the Paradox Lithium Project. Livent Corp (NYSE:LTHM): Livent Corporation operates as a prominent company in the lithium technology sector. Both Fenix Expansions 1 and 2 by Livent are currently leveraging their DLE technology, whereas Expansion 3 employs traditional brine ponds for its operations. The company is poised to merge with its rival, Allkem (NSE: ALKEM), by the conclusion of this year. Eramet (EPA:ERA): Eramet is a French multinational company working on the Centenario-Ratones project, a commercial-scale DLE facility. Phase 1 is under construction, targeting a commissioning of 24,000 tonnes of Lithium Carbonate Equivalent (LCE) in 1Q24, with full ramp-up by mid-2025. The company is also partnering with China's Tsingshan on a $1.7 billion DLE project in Argentina, aiming to produce 24,000 tonnes of lithium annually starting next year. Eramet believes its own DLE technology is superior to others, after more than a decade of development. Standard Lithium (TSXV: SLI, NYSE:SLI): Standard Lithium is a lithium development company that focuses on utilising DLE technology in their projects located in the USA. Their primary lithium extraction projects include the LANXESS JV Project and the SOUTH-WEST ARKANSAS Project, both situated in Southern Arkansas. Additionally, they have the Mojave Project, which is located at the Bristol Dry Lake in the Mojave Desert, California. Standard Lithium employs their proprietary 'LiSTR' DLE process, which involves partnering with existing projects that already produce brine. By leveraging these partnerships, such as the one with the LANXESS Project, where bromine is extracted from brine but not lithium, Standard Lithium integrates their DLE technology to extract lithium. This extraction process yields a high-purity lithium chloride solution that can be further processed into battery-grade lithium carbonate or hydroxide.","filter_flag":1}
{"title":"Niger Delta Exploration & Production PLC to unveil new brand identity - TheCable","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LnRoZWNhYmxlLm5nL25pZ2VyLWRlbHRhLWV4cGxvcmF0aW9uLXByb2R1Y3Rpb24tcGxjLXRvLXVudmVpbC1uZXctYnJhbmQtaWRlbnRpdHkv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LnRoZWNhYmxlLm5nL25pZ2VyLWRlbHRhLWV4cGxvcmF0aW9uLXByb2R1Y3Rpb24tcGxjLXRvLXVudmVpbC1uZXctYnJhbmQtaWRlbnRpdHkv0gEA?oc=5","id":"CBMiXGh0dHBzOi8vd3d3LnRoZWNhYmxlLm5nL25pZ2VyLWRlbHRhLWV4cGxvcmF0aW9uLXByb2R1Y3Rpb24tcGxjLXRvLXVudmVpbC1uZXctYnJhbmQtaWRlbnRpdHkv0gEA","guidislink":false,"published":"Mon, 31 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=212, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LnRoZWNhYmxlLm5nL25pZ2VyLWRlbHRhLWV4cGxvcmF0aW9uLXByb2R1Y3Rpb24tcGxjLXRvLXVudmVpbC1uZXctYnJhbmQtaWRlbnRpdHkv0gEA?oc=5\" target=\"_blank\">Niger Delta Exploration & Production PLC to unveil new brand identity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TheCable<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Niger Delta Exploration & Production PLC to unveil new brand identity - TheCable","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LnRoZWNhYmxlLm5nL25pZ2VyLWRlbHRhLWV4cGxvcmF0aW9uLXByb2R1Y3Rpb24tcGxjLXRvLXVudmVpbC1uZXctYnJhbmQtaWRlbnRpdHkv0gEA?oc=5\" target=\"_blank\">Niger Delta Exploration & Production PLC to unveil new brand identity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TheCable<\/font>","source.href":"https:\/\/www.thecable.ng","source.title":"TheCable","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Niger Delta Exploration & Production Plc (NDEP), a fully integrated energy group with interests in multiple oil and gas assets, has announced plans to unveil a new brand identity in a grand launch event scheduled for Friday, 4th August 2023. Incorporated on March 25, 1992, originally as the Midas Drilling Fund before assuming the name Niger Delta Exploration & Production Plc (NDEP) in November 1996, NDEP retains a strong legacy as Nigeria’s first integrated oil and gas investment company. Established with the vision to create a company using local capital and a local workforce to benefit the oil and gas sector, NDEP has grown its business operations tremendously to span the upstream, midstream, and downstream value chains of the industry. As a parent company, NDEP consists of several subsidiaries including Niger Delta Petroleum Resources Limited (NDPR), ND Gas Development Company Limited, and NDEP Investments Limited which are all wholly owned. Another subsidiary is ND Refineries Limited – an independent midstream entity, in which NDEP holds 95% equity. In addition, NDEP is a significant equity holder in ND Western – a consortium of four companies that jointly acquired SPDC’s 45% Participating Interest in OML 34 in 2012. Through its new brand identity, NDEP aims to better reflect its current and future portfolio, and its long-term strategy to become the leading African company delivering sustainable energy solutions that support economic growth. It will also be reflective of its rich history, legacy, and future portfolio aspirations. In its new era, NDEP will remain committed to its mission to address Nigeria’s energy deficit by improving access to affordable and sustainable energy. NDEP takes a long-term view of energy provision and the global energy transition,focusing on the production and distribution of gas – the transition fuel that provides a pathway to net zero. With a solid footing in the delivery of gas, NDEP will continue to seek avenues to introduce technology that harnesses the abundant and diverse sources of energy in Nigeria and West Africa into an energy bouquet that is affordable and sustainable in reaching net zero and promotes universal energy access. NDEP invites the public to join its grand unveiling and public launch via livestreamngdelta.rsvpify.com. The momentous occasion is scheduled to hold at 10 am on Friday, 04 August 2023.","filter_flag":1}
{"title":"Exclusive: Anand Group opens new tech centre in Gurugram under Anevolve-Headspring JV - Autocar Professional","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5hdXRvY2FycHJvLmluL25ld3MtbmF0aW9uYWwvZXhjbHVzaXZlLWFuYW5kLWdyb3VwLW9wZW5zLW5ldy10ZWNoLWNlbnRyZS1pbi1ndXJ1Z3JhbS11bmRlci1hbmV2b2x2ZS1oZWFkc3ByaW5nLWp2LTExNTk5MtIBiQFodHRwczovL3d3dy5hdXRvY2FycHJvLmluL25ld3MtbmF0aW9uYWwvZXhjbHVzaXZlLWFuYW5kLWdyb3VwLW9wZW5zLW5ldy10ZWNoLWNlbnRyZS1pbi1ndXJ1Z3JhbS11bmRlci1hbmV2b2x2ZS1oZWFkc3ByaW5nLWp2LTExNTk5Mj9hbXA9MQ?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5hdXRvY2FycHJvLmluL25ld3MtbmF0aW9uYWwvZXhjbHVzaXZlLWFuYW5kLWdyb3VwLW9wZW5zLW5ldy10ZWNoLWNlbnRyZS1pbi1ndXJ1Z3JhbS11bmRlci1hbmV2b2x2ZS1oZWFkc3ByaW5nLWp2LTExNTk5MtIBiQFodHRwczovL3d3dy5hdXRvY2FycHJvLmluL25ld3MtbmF0aW9uYWwvZXhjbHVzaXZlLWFuYW5kLWdyb3VwLW9wZW5zLW5ldy10ZWNoLWNlbnRyZS1pbi1ndXJ1Z3JhbS11bmRlci1hbmV2b2x2ZS1oZWFkc3ByaW5nLWp2LTExNTk5Mj9hbXA9MQ?oc=5","id":"CBMigwFodHRwczovL3d3dy5hdXRvY2FycHJvLmluL25ld3MtbmF0aW9uYWwvZXhjbHVzaXZlLWFuYW5kLWdyb3VwLW9wZW5zLW5ldy10ZWNoLWNlbnRyZS1pbi1ndXJ1Z3JhbS11bmRlci1hbmV2b2x2ZS1oZWFkc3ByaW5nLWp2LTExNTk5MtIBiQFodHRwczovL3d3dy5hdXRvY2FycHJvLmluL25ld3MtbmF0aW9uYWwvZXhjbHVzaXZlLWFuYW5kLWdyb3VwLW9wZW5zLW5ldy10ZWNoLWNlbnRyZS1pbi1ndXJ1Z3JhbS11bmRlci1hbmV2b2x2ZS1oZWFkc3ByaW5nLWp2LTExNTk5Mj9hbXA9MQ","guidislink":false,"published":"Thu, 20 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=201, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5hdXRvY2FycHJvLmluL25ld3MtbmF0aW9uYWwvZXhjbHVzaXZlLWFuYW5kLWdyb3VwLW9wZW5zLW5ldy10ZWNoLWNlbnRyZS1pbi1ndXJ1Z3JhbS11bmRlci1hbmV2b2x2ZS1oZWFkc3ByaW5nLWp2LTExNTk5MtIBiQFodHRwczovL3d3dy5hdXRvY2FycHJvLmluL25ld3MtbmF0aW9uYWwvZXhjbHVzaXZlLWFuYW5kLWdyb3VwLW9wZW5zLW5ldy10ZWNoLWNlbnRyZS1pbi1ndXJ1Z3JhbS11bmRlci1hbmV2b2x2ZS1oZWFkc3ByaW5nLWp2LTExNTk5Mj9hbXA9MQ?oc=5\" target=\"_blank\">Exclusive: Anand Group opens new tech centre in Gurugram under Anevolve-Headspring JV<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Autocar Professional<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Exclusive: Anand Group opens new tech centre in Gurugram under Anevolve-Headspring JV - Autocar Professional","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5hdXRvY2FycHJvLmluL25ld3MtbmF0aW9uYWwvZXhjbHVzaXZlLWFuYW5kLWdyb3VwLW9wZW5zLW5ldy10ZWNoLWNlbnRyZS1pbi1ndXJ1Z3JhbS11bmRlci1hbmV2b2x2ZS1oZWFkc3ByaW5nLWp2LTExNTk5MtIBiQFodHRwczovL3d3dy5hdXRvY2FycHJvLmluL25ld3MtbmF0aW9uYWwvZXhjbHVzaXZlLWFuYW5kLWdyb3VwLW9wZW5zLW5ldy10ZWNoLWNlbnRyZS1pbi1ndXJ1Z3JhbS11bmRlci1hbmV2b2x2ZS1oZWFkc3ByaW5nLWp2LTExNTk5Mj9hbXA9MQ?oc=5\" target=\"_blank\">Exclusive: Anand Group opens new tech centre in Gurugram under Anevolve-Headspring JV<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Autocar Professional<\/font>","source.href":"https:\/\/www.autocarpro.in","source.title":"Autocar Professional","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"The R&D centre will develop e-mobility products and technologies such as on-board chargers, BLDC controllers, and invertors for two-, three- and four-wheeler EV applications. ANHS will develop on-board chargers and invertors for electric four-wheelers, chargers for electric two- and three-wheelers, as well as BLDC controllers. The Anevolve Headspring Engineering Centre will combine in-house expertise in hardware, software, mechanics, and SCM with sophisticated tools to develop new power electronics technologies. New Delhi-headquartered Tier-I automotive major Anand Group has commissioned a new technology centre in Gurugram, Haryana. The facility – Anevolve Headspring Engineering Centre (ANHS) – is part of the JV signed between Anand Group's clean-technology platform Anevolve (majority stakeholder), and Japan's Headspring, in January this year. Under the partnership, the duo has envisioned to conceptualise, design, and develop advanced power electronics solutions for clean-mobility applications in areas such as EV powertrains, converters, and chargers. ANHS will develop e-mobility products such as on-board chargers and invertors for electric four-wheelers, chargers for electric two- and three-wheelers, as well as BLDC controllers for consumer electronics. The tech centre will employ skilled professionals and leverage in-house expertise in hardware, software, mechanics, and supply chain management, and integrate it with sophisticated tools to innovate new products. While Anevolve was launched at the Auto Expo 2023 in January and will house all of Anand Group’s future clean-technology companies, Headspring is a Japanese sustainable energy solutions provider, which boasts cutting-edge power electronics technologies based on Silicon Carbide (SiC) and Gallium Nitride (GaN) semiconductor materials. Headspring also has expertise in bi-directional charging in the four-wheeler automotive domain in Japan, and as per Anevolve, this complements its strength in power electronics manufacturing for mobility and other sectors. Anand Group Chairperson Anjali Singh (right) and Jaisal Singh, Executive Chairman, Anevolve. Diverse product roadmap “At ANHS, we have an exciting roadmap, aimed at offering a comprehensive range of chargers designed specifically for two- and three-wheeler EV applications to cater to their unique power requirements. Our forthcoming product lineup will encompass a diverse selection, ranging from 250W to 3kW chargers, ensuring seamless and efficient charging experiences for various electric two- and three-wheeled vehicles,” said Sunil Kaul, Managing Director, Anevolve, and CTO, Anand Group. “In addition to our focus on two- and three-wheelers, we are diligently developing infrastructure AC chargers available in three power options: 7kW, 11kW, and 22kW. These chargers will be instrumental in enhancing the charging infrastructure for electric vehicles by providing faster and more accessible charging solutions in urban and public settings,” he added. As per Anevolve, the demand for EV chargers in India looks promising with the growing penetration of electric vehicles in the country. The company expects government incentivisation, policy push, and infrastructure development to be the key drivers for EV adoption in the country, and it is the latter it is targeting to support the EV ecosystem. As a result, ANHS is developing DC fast chargers for EVs in India, and aims to be the pioneer in this category. “Looking towards the future, ANHS is dedicated to expanding its offerings and furthering our commitment to sustainable transportation. Our team is actively engaged in the development of infrastructure DC chargers, boasting a powerful 60kW capacity for four-wheelers. These high- capacity DC chargers will significantly contribute to reducing charging times and promote widespread EV adoption in various sectors. ANHS will be at the forefront of supporting India’s EV transition,” Kaul said. During the launch of Anevolve in January 2023, Anand Group Chairperson Anjali Singh, and Jaisal Singh, Executive Chairman, Anevolve, had outlined plans to invest around Rs 1,000 crore in Anevolve to develop solutions for greener products and systems across a broad business landscape. Anevolve, which will operate out of the national capital region, will eventually house an innovation hub, a design centre for advanced technologies (ANHS), as well as manufacturing facilities in several parts of India. The company is targeting revenues of Rs 3,500 crore by FY2028, with an estimated employment generation of 2,500 associates.","filter_flag":1}
