{"title":"EcoFlow Launched DELTA 2 Max - The Ultimate Portable Power Station to Power Every Day for 10 Years - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vjb2Zsb3ctbGF1bmNoZWQtZGVsdGEtMi1tYXgtLXRoZS11bHRpbWF0ZS1wb3J0YWJsZS1wb3dlci1zdGF0aW9uLXRvLXBvd2VyLWV2ZXJ5LWRheS1mb3ItMTAteWVhcnMtMzAxODM0NTk0Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vjb2Zsb3ctbGF1bmNoZWQtZGVsdGEtMi1tYXgtLXRoZS11bHRpbWF0ZS1wb3J0YWJsZS1wb3dlci1zdGF0aW9uLXRvLXBvd2VyLWV2ZXJ5LWRheS1mb3ItMTAteWVhcnMtMzAxODM0NTk0Lmh0bWzSAQA?oc=5","id":"CBMimQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vjb2Zsb3ctbGF1bmNoZWQtZGVsdGEtMi1tYXgtLXRoZS11bHRpbWF0ZS1wb3J0YWJsZS1wb3dlci1zdGF0aW9uLXRvLXBvd2VyLWV2ZXJ5LWRheS1mb3ItMTAteWVhcnMtMzAxODM0NTk0Lmh0bWzSAQA","guidislink":false,"published":"Thu, 25 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=145, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vjb2Zsb3ctbGF1bmNoZWQtZGVsdGEtMi1tYXgtLXRoZS11bHRpbWF0ZS1wb3J0YWJsZS1wb3dlci1zdGF0aW9uLXRvLXBvd2VyLWV2ZXJ5LWRheS1mb3ItMTAteWVhcnMtMzAxODM0NTk0Lmh0bWzSAQA?oc=5\" target=\"_blank\">EcoFlow Launched DELTA 2 Max - The Ultimate Portable Power Station to Power Every Day for 10 Years<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"EcoFlow Launched DELTA 2 Max - The Ultimate Portable Power Station to Power Every Day for 10 Years - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vjb2Zsb3ctbGF1bmNoZWQtZGVsdGEtMi1tYXgtLXRoZS11bHRpbWF0ZS1wb3J0YWJsZS1wb3dlci1zdGF0aW9uLXRvLXBvd2VyLWV2ZXJ5LWRheS1mb3ItMTAteWVhcnMtMzAxODM0NTk0Lmh0bWzSAQA?oc=5\" target=\"_blank\">EcoFlow Launched DELTA 2 Max - The Ultimate Portable Power Station to Power Every Day for 10 Years<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly energy solutions\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"The 2kWh portable power station offers unmatched power and convenience for homes and on the go DUSSELDORF, Germany, May 25, 2023 \/PRNewswire\/ -- EcoFlow, a leading eco-friendly energy solutions company, today launched the DELTA 2 Max, a portable power station designed for 10 years of home or on-the-go use. With a base capacity of 2,048Wh, which can be expanded up to 6,144Wh with two extra batteries, users can customise their energy solutions based on their specific energy needs. \"The DELTA 2 Max represents our commitment to offering eco-friendly and cutting-edge energy solutions to meet the needs of customers who are looking to lead a more energy-efficient and environmentally-conscious lifestyle, as the cost of living rises and energy crises continue,\" said Magda Teresa Partyka, Communications Manager of Europe at EcoFlow. \"With its fast-charging capability, impressive lifespan, and high output, the DELTA 2 Max is the perfect companion.\" Up to 10 Years of Everyday Use The DELTA 2 Max uses premium LFP batteries, providing the longest-lasting battery life currently on the market. On average, most comparable products in the industry lose around 20% of capacity after 500 charging cycles. However, the DELTA 2 Max will only drop to this level after 3,000 charging cycles – six times as long as its competitors. That means the DELTA 2 Max can provide reliable power for up to 10 years when used once a day. In addition, EcoFlow also offers a 5-year warranty for the DELTA 2 Max, for even more reliability. Industry-leading Fast Charging Featuring EcoFlow's patented X-Stream technology, the DELTA 2 Max boasts industry-leading fast charging speeds. With an AC input of 2300W and a maximum solar input of 1000W, the DELTA 2 Max can be charged by AC from 0 to 100% in 81 minutes or by solar from 0 to 100% in 2.3 hours. In addition, if users need to store a great amount of power in a limited time, the DELTA 2 Max can be charged by AC from 0 to 80% in just 53 minutes – four times faster than the industry norm. What's more, the DELTA 2 Max can be charged from 0 to 80% in only 43 minutes[i] with AC and solar dual charging – making it the ideal portable power station for life's unplanned moments. Reliable Energy Source for Almost All Appliances The DELTA 2 Max is equipped with a 2400W AC output that can power 99% of home appliances including hair dryers, water heaters, microwaves, and air conditioners. It can also power up to 13 devices simultaneously, even while charging. With the X-Boost mode, the DELTA 2 Max can even power some appliances up to 3100W. This is especially important for people who live off-grid, as the high output of the DELTA 2 Max enables them to enjoy the same level of convenience as a traditionally-powered home. Lower Energy Bills with EcoFlow PowerStream and More The DELTA 2 Max is compatible with the EcoFlow PowerStream Balcony Solar System, which harnesses and converts solar energy for home use. With the PowerStream which can generate around 1,039kWh[ii] of electricity per year, DELTA 2 Max stores the surplus solar energy captured during the day and helps users save more on electricity bills. Weighing 23kg, DELTA 2 Max is 30% lighter than the industry average on the current market and easy to move around the home or carry on the go. The DELTA 2 Max functions quietly when emitting no more than 30db when the input or output is less than 500W within a 50cm range, making it suitable for indoor use. Price and Availability The EcoFlow DELTA 2 Max will be available for purchase on May 31st on EcoFlow's website and via Amazon, featuring the DELTA 2 Max and 400W Portable Solar Panel bundle, which will enjoy a €149\/￡139 discount and be retailed at €2,899\/￡2,699. The DELTA 2 Max will retail for €2,099\/￡1,899 and will be available with the DELTA 2 Max Extra Battery, which will retail separately for €1,499\/￡1,349. On EcoFlow's website, from May 25th to 31st, users can get 500 EcoCredits by subscribing to the EcoFlow newsletter on DELTA 2 Max's product page. After subscription, users will receive double EcoCredits by purchasing DELTA 2 Max or any of its bundles from May 31st to June 6th. The collective EcoCredits will allow users to redeem a DELTA 2 Max bag. On Amazon, from May 31st, the first 100 customers can get a free DELTA 2 Max bag by purchasing DELTA 2 Max or any of its bundles. About EcoFlow EcoFlow is a leading eco-friendly energy solutions company with the vision to power a new world. Since its founding in 2017, EcoFlow aims to become a reliable and trusted energy companion for individuals and families across the world, providing accessible and renewable power solutions at home, outdoors, and in mobile spaces. Today, with operational headquarters located in the USA, Germany, and Japan, EcoFlow has empowered more than 2.5 million users in over 100 markets worldwide. [i] The charging time is achieved when the combined solar and AC input is 2400W. Actual user experiences may vary. [ii] The amount of electricity generated by PowerStream a year is based on internal testing in Germany. Actual user experiences may vary. Photo - https:\/\/mma.prnewswire.com\/media\/2084370\/image_1.jpg","filter_flag":1}
{"title":"EcoFlow Expands European Reach with PowerStream Balcony Solar System and EU Headquarters in Düsseldorf - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vjb2Zsb3ctZXhwYW5kcy1ldXJvcGVhbi1yZWFjaC13aXRoLXBvd2Vyc3RyZWFtLWJhbGNvbnktc29sYXItc3lzdGVtLWFuZC1ldS1oZWFkcXVhcnRlcnMtaW4tZHVzc2VsZG9yZi0zMDE4Mzc4NzcuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vjb2Zsb3ctZXhwYW5kcy1ldXJvcGVhbi1yZWFjaC13aXRoLXBvd2Vyc3RyZWFtLWJhbGNvbnktc29sYXItc3lzdGVtLWFuZC1ldS1oZWFkcXVhcnRlcnMtaW4tZHVzc2VsZG9yZi0zMDE4Mzc4NzcuaHRtbNIBAA?oc=5","id":"CBMingFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vjb2Zsb3ctZXhwYW5kcy1ldXJvcGVhbi1yZWFjaC13aXRoLXBvd2Vyc3RyZWFtLWJhbGNvbnktc29sYXItc3lzdGVtLWFuZC1ldS1oZWFkcXVhcnRlcnMtaW4tZHVzc2VsZG9yZi0zMDE4Mzc4NzcuaHRtbNIBAA","guidislink":false,"published":"Wed, 31 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=151, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vjb2Zsb3ctZXhwYW5kcy1ldXJvcGVhbi1yZWFjaC13aXRoLXBvd2Vyc3RyZWFtLWJhbGNvbnktc29sYXItc3lzdGVtLWFuZC1ldS1oZWFkcXVhcnRlcnMtaW4tZHVzc2VsZG9yZi0zMDE4Mzc4NzcuaHRtbNIBAA?oc=5\" target=\"_blank\">EcoFlow Expands European Reach with PowerStream Balcony Solar System and EU Headquarters in Düsseldorf<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"EcoFlow Expands European Reach with PowerStream Balcony Solar System and EU Headquarters in Düsseldorf - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vjb2Zsb3ctZXhwYW5kcy1ldXJvcGVhbi1yZWFjaC13aXRoLXBvd2Vyc3RyZWFtLWJhbGNvbnktc29sYXItc3lzdGVtLWFuZC1ldS1oZWFkcXVhcnRlcnMtaW4tZHVzc2VsZG9yZi0zMDE4Mzc4NzcuaHRtbNIBAA?oc=5\" target=\"_blank\">EcoFlow Expands European Reach with PowerStream Balcony Solar System and EU Headquarters in Düsseldorf<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly energy solutions\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"DÜSSELDORF, Germany, May 31, 2023 \/PRNewswire\/ -- EcoFlow, a leading eco-friendly energy solutions company, has reached a new milestone with the launch of its latest innovation: the EcoFlow PowerStream, the first balcony solar system with a portable power station. This groundbreaking system allows users to access solar energy day and night while reducing energy bills and providing backup power. To celebrate the opening of its EU headquarters in Düsseldorf, EcoFlow not only announced its presence in the city but also unveiled its first European showroom, featuring the latest PowerStream along with other EcoFlow innovations. With over 2.5 million users worldwide, EcoFlow has established itself as a leader in the portable power industry. However, the PowerStream marks the company's expansion into the home solar battery solutions market, responding to the growing demand for sustainable and reliable energy solutions that households can depend on. \"Home solar battery solutions have become a crucial need in an age of frequent energy crises, and that's what inspired the EcoFlow PowerStream,\" said Magda Teresa Partyka, Communications Manager of Europe at EcoFlow. \"EcoFlow is committed to a future where everyone can care for their families and combat climate disasters, aging grids, and rising energy bills, and PowerStream is our first step towards that future.\" The first balcony solar system with a portable power station The PowerStream Balcony Solar System is a complete solution that includes the EcoFlow PowerStream Microinverter, solar panels, Smart Plugs and the EcoFlow app for real-time energy usage monitoring and optimisation. The system is designed to provide sustained value for EcoFlow's existing users, by being compatible with all EcoFlow portable power stations including the latest DELTA 2 Max. With a base capacity of 2,048Wh which can be expanded to 6,144Wh, the DELTA 2 Max can provide reliable power for up to 10 years when used once a day, making it one of the best companions of the PowerStream. The PowerStream is able to store excess energy generated during the day in the portable power station, making sure that all solar energy is utilized with zero waste. The stored energy can continue to power the home throughout the night or when the sunlight is insufficient, from heavy-duty appliances like air conditioners and refrigerators, to low-wattage devices like phones and tablets. Additionally, the stored energy can provide users with peace of mind during any unexpected energy shortages, by keeping the essential devices up and running. With a maximum 800W solar input, the PowerStream generates around 1039kWh[i] of electricity per year, and the portable power station makes sure that every bit of the energy can be utilised. In contrast to conventional balcony solar systems which waste the surplus energy, PowerStream allows users to maximise their savings on electricity bills. Intelligent home power ecosystem The PowerStream allows users to monitor and optimise power generation and consumption in real-time, with the help of the Smart Plugs and the EcoFlow app. With the EcoFlow app, users can track the solar energy captured and the potential money saved, and get a clearer picture of their home energy usage. By plugging heavy-duty appliances to the Smart Plugs, the Microinverter can allocate just the right amount of electricity to each appliance, and the surplus to the portable power station. By doing so, users can make sure that they are wasting no energy and minimise their reliance on the grids. Plug and play and flexible use cases The PowerStream is designed to be easy to install. Users can install the entire system by themselves as the Microinverter, portable power station, Smart Plugs and solar panels are all plug and play. With its compact design, PowerStream can be easily mounted on different scenarios including flat or house balconies, house gardens and house Façades. With EcoFlow's special-made flat cables, there's no need to drill a hole on the wall or window since it is easier than ever to wire from outdoor to indoor. If users are looking for a reliable power source for outdoor activities, they can simply unplug the cable to disconnect the portable power station for usage on the go. Price and availability Available on EcoFlow's website and Amazon, the PowerStream comes in three kits. The No Storage Kit includes one EcoFlow PowerStream Microinverter, four 100W flexible solar panels, one EcoFlow BKW-DELTA EB Cable, two EcoFlow Super Flat Cables, two EcoFlow Smart Plugs, and is priced at €893.35 in Germany, €1082 in France, Italy, and Spain, and £950 in Britain. The 1kWh Storage Kit is for both flat and house uses and includes the No Storage Kit and a DELTA 2. It is priced at €2092.35 in Germany, €2281 in France, Italy, and Spain, and £2049 in Britain. The 2kWh Storage Kit is for house use, and includes the 1kWh Storage Kit but with two 400W rigid solar panels instead of four 100W flexible solar panels, and a DELTA Max 2000. It is priced at €2509.39 in Germany, €2709 in France, Italy, and Spain, and £2405 in Britain. For prices in other EU countries, please refer to EcoFlow's website. About EcoFlow EcoFlow is a leading eco-friendly energy solutions company with the vision to power a new world. Since its founding in 2017, EcoFlow aims to become a reliable and trusted energy companion for individuals and families across the world, providing accessible and renewable power solutions at home, outdoors, and in mobile spaces. Today, with operational headquarters located in the USA, Germany, and Japan, EcoFlow has empowered more than 2.5 million users in over 100 markets worldwide. [i] The amount of electricity generated by PowerStream a year is based on internal testing in Germany. Actual user experiences may vary. Photo - https:\/\/mma.prnewswire.com\/media\/2087650\/image_5016319_65821958.jpg","filter_flag":1}
