{"title":"We Have Set a Great Big Goal: Nothing. - Honda Newsroom","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL2hvbmRhbmV3cy5jb20vZW4tVVMvcmVsZWFzZXMvcmVsZWFzZS0yOGEwNDE4ZWI5Zjk2YzI1MDJjNmI5OTQxNzAxNzZjZS1vdXItcGVyc3BlY3RpdmUtd2UtaGF2ZS1hLXNldC1hLWdyZWF0LWJpZy1nb2FsLW5vdGhpbmfSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL2hvbmRhbmV3cy5jb20vZW4tVVMvcmVsZWFzZXMvcmVsZWFzZS0yOGEwNDE4ZWI5Zjk2YzI1MDJjNmI5OTQxNzAxNzZjZS1vdXItcGVyc3BlY3RpdmUtd2UtaGF2ZS1hLXNldC1hLWdyZWF0LWJpZy1nb2FsLW5vdGhpbmfSAQA?oc=5","id":"CBMihAFodHRwczovL2hvbmRhbmV3cy5jb20vZW4tVVMvcmVsZWFzZXMvcmVsZWFzZS0yOGEwNDE4ZWI5Zjk2YzI1MDJjNmI5OTQxNzAxNzZjZS1vdXItcGVyc3BlY3RpdmUtd2UtaGF2ZS1hLXNldC1hLWdyZWF0LWJpZy1nb2FsLW5vdGhpbmfSAQA","guidislink":false,"published":"Fri, 12 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=132, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL2hvbmRhbmV3cy5jb20vZW4tVVMvcmVsZWFzZXMvcmVsZWFzZS0yOGEwNDE4ZWI5Zjk2YzI1MDJjNmI5OTQxNzAxNzZjZS1vdXItcGVyc3BlY3RpdmUtd2UtaGF2ZS1hLXNldC1hLWdyZWF0LWJpZy1nb2FsLW5vdGhpbmfSAQA?oc=5\" target=\"_blank\">We Have Set a Great Big Goal: Nothing.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Honda Newsroom<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"We Have Set a Great Big Goal: Nothing. - Honda Newsroom","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL2hvbmRhbmV3cy5jb20vZW4tVVMvcmVsZWFzZXMvcmVsZWFzZS0yOGEwNDE4ZWI5Zjk2YzI1MDJjNmI5OTQxNzAxNzZjZS1vdXItcGVyc3BlY3RpdmUtd2UtaGF2ZS1hLXNldC1hLWdyZWF0LWJpZy1nb2FsLW5vdGhpbmfSAQA?oc=5\" target=\"_blank\">We Have Set a Great Big Goal: Nothing.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Honda Newsroom<\/font>","source.href":"https:\/\/hondanews.com","source.title":"Honda Newsroom","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"When I was in college, every student at my school was required to take Natural Resources 171 with Dr. Robert Miller, a pioneering environmentalist and a great storyteller. One day a student hurried into the large lecture hall and dropped the empty can for his morning caffeinated sugar buzz into the trash. Dr. Miller began that day's lecture by asking the student: \"Do you know how many joules it takes to extract the aluminum from bauxite ore for one soda can?\" He answered his own question, then extrapolated the number of aluminum cans manufactured, filled, distributed, and recycled per year in the United States, and compared the energy needed for bauxite ore versus recycled aluminum. These and similar lectures about the use of hair dryers, running tap water while brushing your teeth, and many more, instilled in me a sense of responsibility to our planet, and a desire to understand the connections and consequences between our actions and the ecosystems we live in. At the same time, I love cars, especially performance cars that are fun to drive. There's also the important role personal mobility serves in economies around the world, and our daily lives. It's the combination of these seemingly disparate values that attracted me to Honda from a young age and has fueled my career here for the last two and a half decades. Honda recently took three big steps within a single week in North America that illustrate our commitment to achieving our global goal of carbon neutrality – net zero emissions – for all products and corporate activities by 2050: We broke ground for our new joint venture EV battery plant in Ohio with LG Energy Solution. The batteries from this plant will power future EVs we make in North America. We announced a basic agreement with U.S.-based Ascend Elements, Inc., to collaborate toward our goal of achieving a stable supply of recycled lithium-ion battery materials necessary for our future EVs in North America. And we began demonstration operation of a stationary fuel cell power station at our headquarters in California that provides zero emission backup power. The Limitless Potential of Zero Today our industry is focused on electrification, and Honda has announced our clear vision to have 100% of new Honda and Acura vehicle sales to be battery-electric or fuel cell electric by 2040. The EV Hub we're establishing in Ohio will lead the way to our electrified future. However, to achieve carbon neutrality as a company will take more than electrifying our products. We will deliver our carbon neutral commitment through our Triple Action to Zero approach. Every End Creates a New Beginning Our Triple Action to Zero approach is critical to our effort to have zero environmental impact. The concept is simple: by using clean energy, along with reusing and recycling all of the materials in a product we make, we will no longer have to dig holes in the ground for finite materials and energy sources or bury spent materials in a hole in the ground at the end of their usable life. That doesn't change the values that go into our products – clean, safe, and fun vehicles that are high quality and of good value. We create vehicles for our customers to enjoy and to find new value in them for as long as possible. Even after a vehicle is purchased, by Honda and our dealers maintaining a relationship with successive customers and the vehicle, we aim to reclaim the product at end of life. This will enable us to recycle or reuse every bit of the materials from our vehicles, reprocess them back to raw materials and reuse those materials in the creation of new products. In short, to make a new Honda vehicle out of old Honda vehicles. Collaborating with Ascend Elements, POSCO, and other resource recycling businesses is one way we intend to reuse finite materials, toward achieving a consistent supply of recycled nickel, cobalt, and lithium to utilize in our EV battery supply chain from and for vehicles we will make in North America. When we have enough BEVs in circulation, we should be able to create such a closed-loop recycling system. New Applications for Hydrogen Fuel Cell Technology Our plans don't focus only on our mobility products. We also strive to realize zero environmental impact for all of our corporate activities. For that, we believe in using the right energy, in the right place, for the right purpose. Our new stationary fuel cell power station is a great example of this approach. Honda has been a leader in research and development of hydrogen technologies and fuel cell vehicles for more than 30 years. That gives us a lot of know-how we can apply in new zero emission applications and we are collaborating with others to create new energy solutions to maximize the benefit for society. We just announced the next-gen fuel cell system, co-developed with GM to be manufactured in Michigan, that we will apply to the Honda CR-V FCEV next year. Our goal is to use this technology to help facilitate the decarbonization of society through the use of hydrogen. Hydrogen has unique characteristics compared to energy stored in batteries. It has higher energy density, and refueling is faster than recharging. That makes it more suitable than batteries for large mobility vehicles like commercial trucks and in power sources for large infrastructure. That's why our new zero emission stationary fuel cell power station is such a significant development. Data centers require high-quality and reliable power, where any disruption can lead to downtime or problems such as data corruption and damage to servers. Typical stationary backup generators use diesel fuel, resulting in higher carbon emissions and local air pollutants. Utilizing hydrogen fuel cells offers a promising future for clean, reliable and high-quality electricity, especially when operating on \"green hydrogen,\" produced using renewable resources. Our first fuel cell power station is a proof of concept using recycled fuel cell stacks from previously leased Honda Clarity Fuel Cell Electric Vehicles. By connecting multiple fuel cell systems, our demonstration stationary fuel cell unit has a capacity of about 500 kW. But as we expand this concept toward commercialization, we will utilize our next-gen fuel cell system, with plans to apply it to Honda production facilities and data centers in North America. I now find myself in a role at the intersection of our past and our future: Sustainability, building on what we know to create a new future, and developing new business models to enable that future. That's what is so exciting about the combination of announcements we've made in recent weeks. By increasing the use of renewable energy and establishing the ability to make a new Honda out of old Hondas, we are taking tangible steps toward achieving our Triple Action to Zero and our challenging global goal to achieve net zero emissions. That will benefit everyone. Jay Joseph Vice President Sustainability & Business Development American Honda Motor Co., Inc.","filter_flag":1}
{"title":"Boom Supersonic and Dimensional Energy Announce Sustainable Aviation Fuel Offtake Agreement USA - English - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Jvb20tc3VwZXJzb25pYy1hbmQtZGltZW5zaW9uYWwtZW5lcmd5LWFubm91bmNlLXN1c3RhaW5hYmxlLWF2aWF0aW9uLWZ1ZWwtb2ZmdGFrZS1hZ3JlZW1lbnQtMzAxODMxNjgyLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Jvb20tc3VwZXJzb25pYy1hbmQtZGltZW5zaW9uYWwtZW5lcmd5LWFubm91bmNlLXN1c3RhaW5hYmxlLWF2aWF0aW9uLWZ1ZWwtb2ZmdGFrZS1hZ3JlZW1lbnQtMzAxODMxNjgyLmh0bWzSAQA?oc=5","id":"CBMikwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Jvb20tc3VwZXJzb25pYy1hbmQtZGltZW5zaW9uYWwtZW5lcmd5LWFubm91bmNlLXN1c3RhaW5hYmxlLWF2aWF0aW9uLWZ1ZWwtb2ZmdGFrZS1hZ3JlZW1lbnQtMzAxODMxNjgyLmh0bWzSAQA","guidislink":false,"published":"Tue, 23 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=143, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Jvb20tc3VwZXJzb25pYy1hbmQtZGltZW5zaW9uYWwtZW5lcmd5LWFubm91bmNlLXN1c3RhaW5hYmxlLWF2aWF0aW9uLWZ1ZWwtb2ZmdGFrZS1hZ3JlZW1lbnQtMzAxODMxNjgyLmh0bWzSAQA?oc=5\" target=\"_blank\">Boom Supersonic and Dimensional Energy Announce Sustainable Aviation Fuel Offtake Agreement USA - English<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Boom Supersonic and Dimensional Energy Announce Sustainable Aviation Fuel Offtake Agreement USA - English - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Jvb20tc3VwZXJzb25pYy1hbmQtZGltZW5zaW9uYWwtZW5lcmd5LWFubm91bmNlLXN1c3RhaW5hYmxlLWF2aWF0aW9uLWZ1ZWwtb2ZmdGFrZS1hZ3JlZW1lbnQtMzAxODMxNjgyLmh0bWzSAQA?oc=5\" target=\"_blank\">Boom Supersonic and Dimensional Energy Announce Sustainable Aviation Fuel Offtake Agreement USA - English<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Boom furthers net zero carbon commitment with purchase of 5 million gallons of SAF per year made from captured carbon emissions DENVER, May 23, 2023 \/PRNewswire\/ -- Boom Supersonic , the company building the world's fastest airliner, announced today it has signed a sustainable aviation fuel (SAF) offtake agreement with Dimensional Energy , which produces carbon neutral fuels and products by recycling carbon dioxide. Under the agreement with Dimensional Energy, Boom will purchase up to 5 million gallons of SAF on an annual basis over the duration of the Overture flight test program. Overture is the supersonic airliner from Boom that will fly at speeds twice as fast as today's commercial jets on 100% SAF. Boom furthers its net zero carbon commitment with the purchase of 5 million gallons of SAF per year made from captured carbon emissions. \"At Boom, we believe sustainable aviation fuel will be essential to the transformation of air travel,\" said Kathy Savitt, President and Chief Business Officer at Boom. \"Our new collaboration with Dimensional Energy represents another important step to making sustainable supersonic flight a reality for millions of passengers in the coming years.\" Dimensional Energy is a leader in power to liquid SAF technology and production. By combining a proprietary carbon utilization technology and the Fischer-Tropsch process—a century-old proven method—Dimensional Energy expects to rapidly bring power to liquid SAF to market. At its technology center in Tucson, Arizona, Dimensional Energy has already proven that its unique method can effectively produce the net zero carbon SAF from recycled carbon dioxide. \"Boom and Dimensional Energy share a vision for the future of sustainable aviation,\" said Jason Salfi, CEO and co-founder of Dimensional Energy. \"Overture has the potential to completely transform how we experience the world, and we are excited to play a critical role in its net zero flight test program, and beyond.\" Boom has also collaborated with United Airlines, which has committed to helping advance the SAF industry. In 2022, United Airlines announced their own agreement to purchase at least 300 million gallons of SAF from Dimensional Energy over 20 years. \"United Airlines is committed to decarbonizing our operations by 2050, without relying on traditional carbon offsets, that's why we have invested in the production of 5 billion gallons of SAF,\" said Mike Leskinen, President of United Airlines Ventures. \"Boom's purchase agreement with Dimensional sends an important demand signal that the market for SAF has never been stronger.\" The agreement with Dimensional Energy is the latest milestone on Boom's journey to sustainable supersonic flight. To date, Boom has secured 10 million gallons of SAF. Boom plans to achieve net zero carbon by 2025, building on the significant progress outlined in the company's 2021 Environmental Sustainability Report . Notably, Boom achieved carbon neutrality through reduction initiatives and high-quality carbon credits in 2021. Boom's 2022 Environmental Sustainability Report will be released in June. To learn more about Boom's sustainability commitments, please visit: https:\/\/boomsupersonic.com\/sustainability About Boom Supersonic Boom Supersonic is transforming air travel with Overture, the world's fastest airliner, optimized for speed, safety, and sustainability. Serving both civil and government markets, Overture will fly at twice the speed of today's airliners and is designed to run on 100% sustainable aviation fuel (SAF). Symphony™, a Boom-led collaboration with industry leaders, is the propulsion system that will power Overture. Overture's order book, including purchases and options from American Airlines, United Airlines, and Japan Airlines, stands at 130 aircraft. Boom is working with Northrop Grumman for government and defense applications of Overture. Suppliers and partners collaborating with Boom on the Overture program include Collins Aerospace, Eaton, Florida Turbine Technologies (FTT), a business unit of Kratos Defense & Security Solutions, Inc., GE Additive, Safran Landing Systems, StandardAero and the United States Air Force. For more information, visit https:\/\/boomsupersonic.com Photos and video available at https:\/\/boomsupersonic.com\/press Connect with Boom Supersonic on Twitter , LinkedIn , Facebook , Instagram, YouTube About Dimensional Energy Dimensional uses carbon dioxide to make the fuels and products that people use every day. The company's carbon utilization platform closes the loop on industrial carbon dioxide emissions to produce the hydrocarbon molecules needed for a circular economy, thus ending the need for further extraction of oil and gas. Dimensional Energy's revolutionary technology transforms carbon dioxide and water into a one for one replacement for everything that comes from oil, using the lowest amount of renewable power possible. Dimensional Energy envisions a world free from fossil fuel dependency, and a just energy transition in alignment with the globally agreed upon climate justice practices outlined in the United Nations Sustainable Development Goals (SDGs) and Paris Climate Accords. SOURCE Boom Supersonic","filter_flag":1}
{"title":"Fiber Developments: A Focus On Sustainability - Textile World Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LnRleHRpbGV3b3JsZC5jb20vdGV4dGlsZS13b3JsZC9mZWF0dXJlcy8yMDIzLzA1L2ZpYmVyLWRldmVsb3BtZW50cy1hLWZvY3VzLW9uLXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LnRleHRpbGV3b3JsZC5jb20vdGV4dGlsZS13b3JsZC9mZWF0dXJlcy8yMDIzLzA1L2ZpYmVyLWRldmVsb3BtZW50cy1hLWZvY3VzLW9uLXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5","id":"CBMiaWh0dHBzOi8vd3d3LnRleHRpbGV3b3JsZC5jb20vdGV4dGlsZS13b3JsZC9mZWF0dXJlcy8yMDIzLzA1L2ZpYmVyLWRldmVsb3BtZW50cy1hLWZvY3VzLW9uLXN1c3RhaW5hYmlsaXR5L9IBAA","guidislink":false,"published":"Wed, 31 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=151, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LnRleHRpbGV3b3JsZC5jb20vdGV4dGlsZS13b3JsZC9mZWF0dXJlcy8yMDIzLzA1L2ZpYmVyLWRldmVsb3BtZW50cy1hLWZvY3VzLW9uLXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5\" target=\"_blank\">Fiber Developments: A Focus On Sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Textile World Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Fiber Developments: A Focus On Sustainability - Textile World Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LnRleHRpbGV3b3JsZC5jb20vdGV4dGlsZS13b3JsZC9mZWF0dXJlcy8yMDIzLzA1L2ZpYmVyLWRldmVsb3BtZW50cy1hLWZvY3VzLW9uLXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5\" target=\"_blank\">Fiber Developments: A Focus On Sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Textile World Magazine<\/font>","source.href":"https:\/\/www.textileworld.com","source.title":"Textile World Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"As consumers and brands demand sustainable products, the fiber industry plays a vital role in shaping a more environmentally friendly textile industry. TW Special Report In an era of increasing concern about climate change and its impact on the planet, industries, governments and academia are coming together to find sustainable textile solutions that minimize environmental impacts. The textile industry is making significant strides in developing sustain-able fibers and reducing its carbon footprint. In exploring the latest fiber developments with a focus on sustainability, the following highlights the efforts of the Teijin Group, BioFilaments Inc., Renewcell, PrimaLoft Inc., Thai Acrylic Fibre Co., the DITaF – Denkendorf Institute for Textile Chemistry and Chemical Fibres, the Lenzing Group and RadiciGroup as just a few examples of the industry’s active approach to sustain-able fiber solutions. The Teijin Group The Teijin Group has made sustainability a core principle of its business activities. The company reports in recognizing the importance of reducing greenhouse gas emissions, it has set targets to achieve a 30-percent reduction in carbon dioxide (CO2) emissions. The company also aims to reduce the portion of emissions from its supply chain by 15 percent. These targets have been officially validated as science-based targets (SBTs). By aligning its goals with the Paris Agreement’s objectives, Teijin is targeting a carbon-neutral future. Teijin also announced it developed a method to calculate CO2 emissions during the Tenax™ carbon fiber production process. This data allowed Teijin to conduct a life cycle assessment (LCA) of all of its carbon fibers. The Netherlands-based Teijin Aramid, a core business of the Teijin Group, has improved the carbon foot-print of Twaron® by 28 percent com-pared to 2014 according to applicable ISO standards 14040 and 14044. Teijin Frontier, the company’s fibers and product converting company, also has made significant contributions to sustainability. The company offers products such as ECOPET®, a recycled polyester fiber made from used PET bottles and fiber scraps; and SOLOTEX®, which incorporates plant-derived ingredients in its polymers. Teijin Frontier has also developed a system to calculate CO2 emissions in the polyester fiber manufacturing process, allowing for a comprehensive LCA. Nanofibrillated Cellulose Another notable development in the fiber industry is the new nanofibrillated cellulose (NFC) commercial production plant opened by Vancouver, British Columbia-based Performance BioFilaments Inc. The plant, located at Resolute’s Forest Products in Quebec, has a daily production capacity of 21 metric tons. NFC is a natural and renewable biomaterial derived from certified forests. According to the company, it offers a low-carbon additive that enhances the performance of advanced materials and specialty chemicals used in applications such as concrete, nonwovens and biocomposite plastics. The availability of commercial volumes of NFC opens up opportunities for various industries to adopt sustainable solutions. “The Performance BioFilaments team and development partners have dedicated years of effort to bring this low-carbon biomaterial to market,” said Gurminder Minhas, managing director of Performance BioFilaments. “We have collaborated extensively across a range of industrial supply chains, integrating nanofibrillated cellulose to achieve cost, quality and dramatic performance improvements. The availability of commercial volumes means we can readily sup-port large-scale opportunities across a number of major industry sectors.” Renewcell’s CIRCULOSE® Stockholm-based Renewcell, a company dedicated to creating circularity in the fashion industry, has partnered with TextileGenesis™ to establish full pulp-to-retail traceability for its recycled raw material CIRCULOSE®. Renewcell uses a patented process to break down and recycle cotton and other cellulosic textile waste into Circulose, a biodegradable raw material. According to the company, this material can then be used to create regenerated, man-made cellulosic fibers such as viscose, lyocell, modal or acetate. Through its collaboration with TextileGenesis, Renewcell can provide real-time digital traceability across its supply chain, ensuring transparency and authenticity for its products. This traceability is crucial for building trust and promoting sustainability in the fashion industry. “Our new facility in Sundsvall, Sweden, is helping move us towards our goal of recycling the equivalent of more than 1.4 billion T-shirts per year,” said Renewcell CEO Patrik Lundstrom. “But we also need a trusted and transparent supply chain to ensure the authenticity of products made from CIRCULOSE from our facilities all the way to the retail consumer. That is what TextileGenesis brings to the table.” PrimaLoft Inc. Ocean Bound Latham, N.Y.-based PrimaLoft Inc. also is contributing to sustainable products with its PrimaLoft® Insulation with Ocean Bound Plastic. This insulation is made from 100-percent post-consumer recycled content, with 60 percent of the recycled mate-rial sourced from plastic bottles collected near coastlines. By preventing plastic waste from reaching the ocean and using it to create high-performance insulation, PrimaLoft is addressing the issue of plastic pollution while delivering sustainable products. The process is certified by OceanCycle, ensuring the material’s ethical sourcing and traceability. “The quality of plastic quickly degrades once it’s exposed to the elements in ocean water, making it unusable for most recycling efforts,” said Tara Maurer-Mackay, senior vice president, Product Strategy. “By capturing plastic waste before it can reach the ocean, we’re able to use the material to create products that offer our brand partners and consumers the best mix of performance and versatility with a reduced environmental impact.” According to the company, PrimaLoft Insulation with Ocean Bound Plastic offers the same performance benefits for which PrimaLoft is known, including lightweight thermal performance, packability, and durability. By combining performance with sustainability, PrimaLoft is showing its commitment to its “Relentlessly Responsible™” mission. Upgraded Regel™ Fiber Bangkok-based Thai Acrylic Fibre Co. Ltd. (TAF), a part of Aditya Birla Group, recently introduced an upgraded version of Regel™ fiber, incorporating 75-percent recycled content. This new variant of Regel fiber, which already contained 50-percent recycled content, now holds the distinction of being the only GRS certified acrylic fiber in the world, according to the company. Regel is manufactured using a chemical recycling process that produces a warm, comfortable fiber in vibrant shades. “Using recycled materials is a key aspect of sustainability, and products are made from recycled materials are becoming popular among consumers,” said Tuhin Kulshreshtha, head of marketing, TAF. “… increasing the recycled content of Regel from 50 percent to 75 percent will help meet consumers’ demands and provide them with sustainable options. Additionally, [the] higher recycled content in Regel will also allow manufacturers to create sustainable blends without compromising on quality or performance.” Regel with 75-percent recycled content currently is available in staple form and the company reports it plans to introduce other options such as tow and tops in the future. Yarn From Castor Oil RadiciGroup, based in Italy, has introduced Biofeel® Eleven, a naturally sourced yarn made using castor oil, as part of its commitment to technical and environmental performance. Castor oil plantations, primarily located in the Gujarat region of India, provide a source for the beans, which contain approximately 45 percent oil. This oil, rich in ricinolein, serves as the raw material for the bio-polymer polyamide 11 used for RadiciGroup’s Biofeel Eleven yarn. The remaining byproduct after oil extraction is a highly effective bio-fertilizer that promotes soil health, exemplifying circularity and zero waste. “Biofeel Eleven has unique and special properties, such as low water absorption, increased lightness and improved strength properties,” noted Marco De Silvestri, sales and marketing head of RadiciGroup’s Advanced Textile Solutions Business Area. “This means being able to produce fabrics that are both durable and comfortable to the touch and skin. This translates into a wide range of applications, from sportswear to workwear, from fashion garments to textiles for luxury cars.” CELLUN For Composites The Germany-based Denkendorf Institute for Textile Chemistry and Chemical Fibres (DITF) in collaboration with project partners CG TEC, Cordenka, ElringKlinger, Fiber Engineering, and Technikum Laubholz, is developing a new fiber composite material called CELLUN. This material incorporates reinforcing fibers made of cellulose, offering a sustainable alter-native to glass or carbon fibers used in industrial molded parts production. The reinforcing component of CELLUN is a combination of non-fusible fibers and thermoplastic derivatized cellulose fibers — either regenerated fibers from Cordenka or DITF’s HighPerCell® cellulose fibers— as a matrix, which is used to produce a hybrid roving. In DITF’s in-house pilot plants, this roving is further processed into a hybrid roving or hybrid textile, which can be converted into a molded part using pultrusion and thermoforming processes or injection molding. The German Federal Ministry of Economics and Climate Protection (BMWK) has partnered with DITF and is funding a project to develop CELLUN to industry maturity. The project will also look at the possibility to fully recycle CELLUN materials at the end of a product’s life. Two approaches are being researched: thermally reshaping CELLUN molded parts without any quality loss and chemically separating the CELLUN material into its individual components for 100 percent reuse as new starting materials. The development of CELLUN materials offers a sustainable, resource-conserving, and cost-effective alternative to established composites in the lightweight construction and automotive sectors. Carbon-Neutral VEOCEL™ Viscose Austria-based Lenzing Group has announced the expansion of its sustainable viscose fiber portfolio with the launch of carbon-neutral VEOCEL™ branded viscose fibers for Europe and the United States. In Asia, Lenzing plans to convert its existing production capacity for conventional viscose into capacity for responsible specialty fibers in the second half of the year. This expan-sion reflects VEOCEL’s commitment to providing nonwovens value chain partners and brands with environmentally friendly options that contribute to reducing carbon footprints. “Everything we do is centered around VEOCEL’s mission to be a responsible everyday care brand and demonstrate our care for the future of our planet,” said Monique Buch, vice president, Global Nonwovens Business, Lenzing. “We believe it is imperative for us to not only reduce our own carbon emissions, but also to empower our partners to reduce their carbon footprint.” The carbon-neutral VEOCEL viscose fibers are made from sustainably and responsibly managed wood and pulp sources, adhering to the stringent guidelines of the Lenzing Wood and Pulp Policy and trusted forest certification systems. Lenzing’s production plant in Austria employs efficient production methods, such as direct production from wood to fiber and the use of renewable energy sources like solar power and biomass, to reduce carbon emissions. To offer carbon-neutral products, Lenzing measured, reduced, and offset any remaining emissions through financing climate projects. Lenzing partnered with Climate-Partner, a provider of corporate climate action solutions, to develop carbon-neutral VEOCEL viscose fibers. The company has also collaborated with Helsinki-based Suominen to produce the first carbon-neutral nonwoven, BIOLACE® Zero, utilizing VEOCEL lyocell fibers. Nonwoven roll-goods made with VEOCEL viscose fibers are available for Suominen’s clients, demonstrating the importance of collaboration in promoting sustainable product development within the nonwoven market. Fiber Sustainability Focus The fiber industry is investing in developments with a strong focus on sustainability. Companies like the those mentioned above, as well as many more, are laser-focused on these efforts, driving innovation and creating solutions that minimize environmental impact. Through initiatives such as reducing CO2 emissions, implementing life cycle assessments, promoting circularity, and using recycled materials, fiber companies are leaning towards a more sustainable future. As consumers and brands demand sustainable products and the demand for sustainable products continue to grow, the fiber industry plays a vital role in shaping a more environmentally friendly textile industry. May\/June 2023","filter_flag":1}
{"title":"We Can’t Manage Cattle Methane Without… - Breakthrough Institute","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vdGhlYnJlYWt0aHJvdWdoLm9yZy9pc3N1ZXMvZm9vZC1hZ3JpY3VsdHVyZS1lbnZpcm9ubWVudC93ZS1jYW50LW1hbmFnZS1jYXR0bGUtbWV0aGFuZS13aXRob3V0LWJldHRlci1tZWFzdXJlbWVudHPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vdGhlYnJlYWt0aHJvdWdoLm9yZy9pc3N1ZXMvZm9vZC1hZ3JpY3VsdHVyZS1lbnZpcm9ubWVudC93ZS1jYW50LW1hbmFnZS1jYXR0bGUtbWV0aGFuZS13aXRob3V0LWJldHRlci1tZWFzdXJlbWVudHPSAQA?oc=5","id":"CBMieWh0dHBzOi8vdGhlYnJlYWt0aHJvdWdoLm9yZy9pc3N1ZXMvZm9vZC1hZ3JpY3VsdHVyZS1lbnZpcm9ubWVudC93ZS1jYW50LW1hbmFnZS1jYXR0bGUtbWV0aGFuZS13aXRob3V0LWJldHRlci1tZWFzdXJlbWVudHPSAQA","guidislink":false,"published":"Tue, 02 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=122, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vdGhlYnJlYWt0aHJvdWdoLm9yZy9pc3N1ZXMvZm9vZC1hZ3JpY3VsdHVyZS1lbnZpcm9ubWVudC93ZS1jYW50LW1hbmFnZS1jYXR0bGUtbWV0aGFuZS13aXRob3V0LWJldHRlci1tZWFzdXJlbWVudHPSAQA?oc=5\" target=\"_blank\">We Can’t Manage Cattle Methane Without…<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Breakthrough Institute<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"We Can’t Manage Cattle Methane Without… - Breakthrough Institute","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vdGhlYnJlYWt0aHJvdWdoLm9yZy9pc3N1ZXMvZm9vZC1hZ3JpY3VsdHVyZS1lbnZpcm9ubWVudC93ZS1jYW50LW1hbmFnZS1jYXR0bGUtbWV0aGFuZS13aXRob3V0LWJldHRlci1tZWFzdXJlbWVudHPSAQA?oc=5\" target=\"_blank\">We Can’t Manage Cattle Methane Without…<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Breakthrough Institute<\/font>","source.href":"https:\/\/thebreakthrough.org","source.title":"Breakthrough Institute","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"National governments increasingly aim to cut methane emissions from energy, agriculture, and waste. Under U.S. President Joe Biden, the United States became one of 150 countries to have signed the Global Methane Pledge, which means the administration agreed to be a part of a global effort to reduce methane emissions by at least 30% below 2020 levels by 2030. Since methane has a large, but short-term effect on global warming, reducing methane emissions can substantially reduce warming in the coming decades. One priority is reducing emissions from enteric fermentation, part of the digestive process of cattle, sheep, and other ruminants. In the United States, enteric fermentation has accounted for about 25% of all methane emissions over the last ten years. And, with rising global demand for beef—driven largely by population growth and increasing wealth—enteric methane emissions are projected to rise by more than 45% between 2020 and 2050. Companies throughout the livestock supply chain—dairy suppliers like Danone, supermarkets, fast food chains, and others—are now increasingly seeking to cut their methane footprint. Minimizing Peak Warming Requires Methane Reducing Research Today Figure Adapted from Spark Climate Solutions Yet as management guru Peter Drucker famously said, “If you can’t measure it, you can’t manage it.” Such is the case with enteric methane. The technology to accurately estimate emissions at scale—across a dairy or beef company’s supply chain, for instance—generally does not yet exist. In 2020, Burger King notably had to walk back its claims of producing low-methane beef when scientists pointed to the lack of supporting evidence. Since then, other companies such as TruBeef and Silver Fern Farms have claimed to produce carbon-neutral beef. But many researchers and industry actors agree that a lack of verifiable on-farm emissions data undermines such claims, complicates supply chain carbon accounting, and generally obstructs mitigation efforts. To better assess progress toward methane mitigation targets—let alone achieve them—researchers must accomplish at least three things. First, they must make measurement of livestock emissions more accurate, consistent, and affordable. This is critical for assessing the effectiveness of changes in livestock management in reducing emissions, and for estimating emissions embodied in supply chains or particular products. Second, researchers must use measurement data to develop predictive models (for example, carbon footprint calculators) of different practices before those practices are implemented and to inexpensively estimate emissions without on-farm measurement. Third, scientists must measure and test methane reduction strategies in a greater range of environments than has been done thus far, particularly with animals while they’re grazing, which is when they appear to emit the most enteric methane. Governments and the private sector can each contribute to these goals by investing in enteric methane research. Make enteric methane measurement and modeling affordable and accurate Presently, there are several approaches to directly measure enteric methane emissions: respiratory chambers, the SF6 tracer technique, GreenFeed systems, and micrometeorological measurements. Respiratory chambers are generally considered the gold standard for directly measuring individual animal emissions. These are built as enclosures for animals where air at the inlet and outlet is measured for methane and other greenhouse gases. While highly accurate, chambers cannot be used to assess emissions from grazing animals, especially under normal behavior. That requires attaching canisters to animals to capture their respiration and belches, and using the SF6 tracer technique to estimate emissions. Another, newer approach is to use a GreenFeed System, which directly measures snapshots (3-6 minutes) of enteric methane production in the breath of ruminants in pastures or feedlots while they are eating. These measurements are then used to estimate daily emissions. A fourth approach, applicable when animals are grazing, uses ~10m tall towers with tubing that draws air into methane sensors as air circulates in the atmosphere. These tower-based approaches are referred to as micrometeorological measurement techniques. Given their setup, micrometeorological towers measure the net amount of methane emitted from an area of land, capturing not only enteric emissions but also emissions from manure and soils—measuring the whole system. Some such approaches have benefits for individual animal feeding trials of feed additives, yet none are easily deployable on farms—for now—a missing step for accurate supply chain carbon accounting. Greenfeed image, Jennifer Michal from Dr. Kristen Johnson Lab Several indirect measurement methods also help reduce the cost of estimating emissions. In vitro flow systems mimic what happens in an animal’s rumen, the part of the stomach where bacteria turn food into methane and other compounds. They are a lab-based approach to measuring the effect of different feeds, drugs, and other products on methane emissions. They are important for screening new products at a low cost to help determine whether a more expensive animal feeding trial is warranted. Researchers are also developing methods to use proxies, such as blood samples, to estimate emissions. Increasingly airborne measurements—like drones—are also being used to estimate methane emissions over large areas, although are not yet commercially available. In addition, high resolution satellite-based measurements are expected to come online soon. These higher resolution satellites should be able to quantify emissions from some large concentrated animal sources like commercial dairies. However, there are at least two big shortcomings with measurement today. First, there are not enough universities and other institutions with measurement equipment to meet demand. Only a handful of land-grant universities have access to the gold standard in methane emissions measurement technology for individual animals: respiratory chambers. Likewise, according to conversations with experts in the industry, only 18 colleges or universities across the US have the newer ‘snapshot’ measurement system, the GreenFeed System. Within USDA’s internal research arm, the Agricultural Research Service (ARS), only six stations have GreenFeed Systems. Fewer still have the ability to compare GreenFeed and respiratory chamber methods against each other when studying diets and feed additives—a recognized standard operating procedure. Meanwhile, demand for testing of methane-reducing products is growing. This mismatch between supply and demand for methane measurement poses a large bottleneck in advancing knowledge and commercialization of potential enteric methane mitigation options. Second, existing measurement technologies are too expensive, labor intensive, and\/or technical for livestock producers to purchase and operate. They are typically only used in research settings. While the GreenFeed system is perhaps the easiest method for commercial producers to use, it is still cost-prohibitive outside of research institutions (~$90,000 for the device with another ~$10,000 annually for data acquisition) and requires at least several days of work to train cattle to use the system. Additionally, the most common land measurement approaches require extensive technical knowledge to calibrate and maintain sensors or to run gas chromatographs. Aerial and satellite-based measurement can address some of these issues, but is also highly expensive, unable to measure methane from individual animals or groups, and currently not precise enough to measure emissions from most animal agriculture operations such as pastures. Overcoming these two limitations—institutional and technological—would enable greater progress in several types of enteric methane research. First, universities and companies would be able to produce a sufficient number of studies and replications to improve the certainty of efficacy claims about the methane reduction potential of feed additives in the near term. Second, it would facilitate trials that can assess long-term efficacy and animal safety. Third, it would accelerate efforts to breed low-methane cattle, whether using conventional or novel techniques such as gene editing. Greater measurement would also enable development of more accurate predictive models. Since direct measurement will always carry a cost, at least some livestock producers and other companies in the supply chain will likely need to rely on models (for example, carbon footprint calculators) to estimate emissions. Investments in developing and refining both bottom-up diet-based methane predictive models and top-down climate models may be as important to mitigation as investment in better measurement technologies. Ideally, these models could be used to accurately estimate emissions under a wide range of scenarios, such as when producers adopt a new feed additive. Predictive models do exist, but they haven’t been designed to assess the impact of many interventions to reduce emissions. To build these models, researchers must first gather emissions data from a variety of diets, breeds, and management conditions. The more robust those data are, the more reliable the model will become. Eventually, models will eliminate the need for every animal to be sampled. Conduct more regionally specific field trials To understand the efficacy of different livestock management practices in reducing methane emissions, researchers need to conduct trials in diverse locations and across operation types. Studies have shown that the feed additive 3-NOP can decrease methane production between 30% and 70%. However, the efficacy depends on diet, among other factors. In particular, 3-NOP’s efficacy diminishes as the amount of cellulose in the diet increases. This is problematic given that ~77% of methane emissions from beef production result from cattle grazing on cellulosic material in pastures. The few global scholars doing this work also recognize that more animal feeding trials are needed to determine methane reductions from feeding Asparagopsis taxiformis—or red algae. Supplementing ruminants’ diets with A. taxiformis resulted in 9–98% reduction in methane production across studies. Such a range complicates efficacy claims—it must be narrowed through more research. And, much like 3-NOP, some research suggests supplementation is more effective in high-starch diets (for example, at feedlots) compared to high-forage diets (for example, range and pasture). Precise estimates of efficacy therefore require running trials with different types of feed and in different types of rangeland and pasture. Additionally, pre-existing microbial communities in the rumen are very resilient. A single dosing of either 3-NOP or A. taxiformis can reduce enteric methane briefly, but emissions return when it is no longer actively being fed. Thus, current delivery methods of feed additives incorporated into the daily diets of conventionally managed dairy cows and feedlot finished beef cattle work well. However, more appropriate and adaptable delivery methods need to be developed and tested if these products are to be incorporated in less intensively managed grazing production systems across the country. Federal research can drive enteric methane innovation Accurate enteric methane emissions data are at the core of reducing methane emissions from global livestock, and substantially reducing warming in the coming decades. Federal, state, and other governments can improve measurement and data collection by funding enteric methane research and data collection. Data, in turn, can be used to inform decisions about what actions to take to address climate change, for example, which diets and management practices to support. The scientific community estimates that adequately addressing the research needs for methane-reducing feed additives alone will require a $100 million investment in multi-year trials. Congress, USDA, and other policymakers have several tools at their disposal to advance measurement, modeling, and ultimately mitigation of enteric methane emissions. These options include intramural research, extramural research, and public-private partnerships. USDA’s Agricultural Research Service (ARS) conducts intramural research, including on livestock sustainability, at its sites around the country. Some notable sites that have done work on carbon and nitrogen cycling in livestock include the ones in Kimberly, ID and Bushland, TX. Investment in updating ARS facilities will allow for regionally specific diets and breeds to be accounted for in data collection. More ARS sites should be equipped with state-of-the-art methane measurement instruments to ensure standardization in data collection and output. ARS sites are well-suited to quickly address many research gaps since they often have low barriers to launch new projects compared to universities. Structure of U.S. Public Agricultural R&D \"From Lab to Farm,\" Breakthrough Institute USDA also hosts the flagship extramural research funding initiative, the Agriculture and Food Research Initiative (AFRI), which can and does fund enteric research. For example, within the Foundational and Applied Sciences request for application, enteric methane is highlighted as important in the Animal Nutrition, Growth, and Lactation program area. Additionally, at least five other program areas in that request solicit proposals to address greenhouse gas emissions from agriculture. Recently, AFRI devoted up to $5 million in funding under its Sustainable Agriculture Systems program to enteric methane research, as part of a broader international effort to accelerate enteric innovation. These funding opportunities are steps in the right direction. Still, between 2017 and 2021, projects to understand, measure, and reduce enteric methane emissions accounted for less than 2% of non-ARS funding for agricultural climate mitigation. Thus, despite the potential opportunities to fund enteric methane research through extramural grants, barriers to advancements exist, one of which may be the highly competitive nature of these grant programs. About 70% of AFRI proposals that are deemed worthy by expert review panels are not funded. Other funding mechanisms exist. Through a Congressional mandate, Foundation for Food and Agriculture Research (FFAR) is funded to deliver public-private partnership-type research grants. The Greener Cattle Initiative, housed within FFAR, is an industry-oriented research consortium that will award approximately $5 million over the next five years to support research to mitigate enteric methane emissions from cattle. Together with the new sustainable agriculture systems request, these efforts will distribute $10 million over the next five years. While the $10 million directed toward enteric methane research is certainly needed, it comes far short of the $100 million needed to adequately address the issue. Meeting the scientific capacity is also contingent upon continued expertise. Unfortunately, methane-related livestock expertise dwindles with increased retirements. To reduce any gaps in knowledge, the next generation of scientists need funding to be trained under current experts. One avenue to address the shrinking pool of methane-related talent is the AFRI Education and Workforce Development program which funds research experiences for undergraduates, predoctoral fellowships, and postdoctoral fellowships. Additionally, FFAR provides scholarships to help veterinary students perform research in areas like climate change. Scientific and Human Capacity Needs for Addressing Enteric Methane Breakthrough Institute Ultimately, enteric methane research and innovation is an important part of minimizing emissions and peak warming. While some federal programs and grants do fund relevant research, the amount of funding is far below what researchers say is needed. Recognizing the gaps in methane emissions measurement and research capacity, researchers, industry, and companies must work collaboratively to build scientific expertise, improve measurement technology, develop mitigation options, create robust models, and increase adoption of emerging technologies. Only then can farmers, processors, retailers, and others throughout the supply chain account for and verify emissions, and work effectively to rapidly reduce their carbon footprint. ","filter_flag":1}
{"title":"Winning ways - Economist Impact","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vaW1wYWN0LmVjb25vbWlzdC5jb20vc3VzdGFpbmFiaWxpdHkvbmV0LXplcm8tYW5kLWVuZXJneS93aW5uaW5nLXdheXPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vaW1wYWN0LmVjb25vbWlzdC5jb20vc3VzdGFpbmFiaWxpdHkvbmV0LXplcm8tYW5kLWVuZXJneS93aW5uaW5nLXdheXPSAQA?oc=5","id":"CBMiTGh0dHBzOi8vaW1wYWN0LmVjb25vbWlzdC5jb20vc3VzdGFpbmFiaWxpdHkvbmV0LXplcm8tYW5kLWVuZXJneS93aW5uaW5nLXdheXPSAQA","guidislink":false,"published":"Wed, 03 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=123, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vaW1wYWN0LmVjb25vbWlzdC5jb20vc3VzdGFpbmFiaWxpdHkvbmV0LXplcm8tYW5kLWVuZXJneS93aW5uaW5nLXdheXPSAQA?oc=5\" target=\"_blank\">Winning ways<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Economist Impact<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Winning ways - Economist Impact","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vaW1wYWN0LmVjb25vbWlzdC5jb20vc3VzdGFpbmFiaWxpdHkvbmV0LXplcm8tYW5kLWVuZXJneS93aW5uaW5nLXdheXPSAQA?oc=5\" target=\"_blank\">Winning ways<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Economist Impact<\/font>","source.href":"https:\/\/impact.economist.com","source.title":"Economist Impact","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"In 2022 Collins Dictionary’s word of the year was “permacrisis” [1]. It describes the continuous wave of interconnected challenges the world faces: the covid-19 pandemic, the war in Ukraine, the energy crisis, inflation and increasingly frequent extreme weather events. With so many short-term issues, it is easy for businesses to lose sight of longer-term sustainability goals. But to do so could be disastrous. The final section of the Intergovernmental Panel on Climate Change’s Sixth Assessment Report was published in March 2023, and makes sobering reading [2]. The report argues that global warming is more likely than not to reach 1.5 degrees above pre-industrial levels this century. The report does provide some cause for optimism, insisting that the tools to significantly reduce emissions are already available. The problem is not just that too few companies are leveraging these tools, it is also that they have made no clear sustainability commitments and have no defined targets or plan of action. Only 57% of industrial companies have carbon-neutral targets and, of these, nearly half are yet to fully deploy their sustainability initiatives [3]. Gwenaelle Avice-Huet, chief strategy and sustainability officer at Schneider Electric, argues that just 5% of large companies are embracing the UN’s Sustainable Development Goals (SDGs).","filter_flag":1}
{"title":"18 Clothing Brands Making Progress Towards Sustainability - Earth911.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vZWFydGg5MTEuY29tL3N0eWxlL2Nsb3RoaW5nLWJyYW5kcy1tYWtpbmctcHJvZ3Jlc3MtdG93YXJkcy1zdXN0YWluYWJpbGl0eS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vZWFydGg5MTEuY29tL3N0eWxlL2Nsb3RoaW5nLWJyYW5kcy1tYWtpbmctcHJvZ3Jlc3MtdG93YXJkcy1zdXN0YWluYWJpbGl0eS_SAQA?oc=5","id":"CBMiUmh0dHBzOi8vZWFydGg5MTEuY29tL3N0eWxlL2Nsb3RoaW5nLWJyYW5kcy1tYWtpbmctcHJvZ3Jlc3MtdG93YXJkcy1zdXN0YWluYWJpbGl0eS_SAQA","guidislink":false,"published":"Tue, 02 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=122, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vZWFydGg5MTEuY29tL3N0eWxlL2Nsb3RoaW5nLWJyYW5kcy1tYWtpbmctcHJvZ3Jlc3MtdG93YXJkcy1zdXN0YWluYWJpbGl0eS_SAQA?oc=5\" target=\"_blank\">18 Clothing Brands Making Progress Towards Sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Earth911.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"18 Clothing Brands Making Progress Towards Sustainability - Earth911.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vZWFydGg5MTEuY29tL3N0eWxlL2Nsb3RoaW5nLWJyYW5kcy1tYWtpbmctcHJvZ3Jlc3MtdG93YXJkcy1zdXN0YWluYWJpbGl0eS_SAQA?oc=5\" target=\"_blank\">18 Clothing Brands Making Progress Towards Sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Earth911.com<\/font>","source.href":"https:\/\/earth911.com","source.title":"Earth911.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Fashion is one of the biggest industries globally, and there are more than 60 million workers in the clothing, footwear, leather, and textiles industry. The sheer scale of the apparel industry means it has a significant impact on greenhouse gas emissions, working conditions, water quality, and resource consumption. But in recent years, numerous clothing companies have been sprouting up or shifting practices to embrace sustainability. We reviewed many clothing companies to identify those using recycled materials, eliminating the use of toxic chemicals from their supply chains, minimizing packaging, and paying employees a living wage. Many companies are relatively young and were started with a vision of helping the world. Others have been in business for decades and are embracing greener practices. Shopping is a personal experience, and every choice you make will have an environmental impact. We urge you to learn about the certifications and brands below to make informed, responsible, and fashionable choices. Third-Party Certifications, Ratings, & Initiatives During our reviews of the clothing brands, we relied on the most reliable environmental and responsible business labeling and certification programs to identify the best options. Look for these labels to help distinguish companies that are leaders in adopting green, socially responsible, and humane practices. B Corp Certified To qualify for B Corp certifications, candidates must take the B Impact Assessment, which evaluates its impact on workers, customers, suppliers, the community, and the environment. To qualify, organizations must achieve a minimum verified score of at least 80 out of 200. The average score of an ordinary business that completes the B Impact Assessment is 50.9. Bluesign Certified Materials The Bluesign certification ensures textiles are tested for harmful substances and certifies high product safety in the apparel and footwear industry. Bluesign guarantees that certified products are not harmful to human health. Climate Neutral Certified This is a globally-recognized certification for climate accountability that entails measuring the organization’s carbon footprint and offsetting emissions. Participants must document carbon emissions reduction plans and progress annually. Fair Labor Association Accreditation Companies accredited by FLA meet international standards for labor rights by implementing a systems-level approach to human rights compliance and social responsibility. Fair Labor Accredited companies are evaluated on an ongoing basis and must demonstrate continuous improvement efforts to address working conditions and protect workers’ rights. Responsible Down Certified The Responsible Down Standard (RDS) ensures that geese and ducks are raised in compliance with animal welfare standards. It certifies products containing feathers and down from certified farms. Responsible Packaging Movement prAna created the Responsible Packaging Movement (RPM) to encourage like-minded companies to use sustainable packaging. Member brands set responsible packaging goals and collaborate and share sustainable packaging concepts with one another. Climate Action Corps This initiative by the Outdoor Industries Association (OIA) fosters collaboration in the outdoor industry to lead on climate action. Companies that join commit to measuring and reducing their greenhouse gas emissions and sharing their progress annually. Textile Exchange Recycled Polyester Challenge The United Nations Framework Convention on Climate Change’s Fashion Industry Charter for Climate Action and Textile Exchange partnered up to challenge to accelerate the use of recycled polyester. The 2025 Recycled Polyester Challenge calls on businesses to commit to sourcing from 45% to 100% of polyester from recycled sources by 2025. Sustainable Clothing Brands When we used the labels above and dug into their business practices, 18 clothing companies made the cut. They represent the best-in-class fashion brands and we recommend them as a starting point in your conscious shopping. While no company is perfect, they make efforts to reduce emissions, water use, waste in their manufacturing and distribution systems, and treat the people who make the materials and clothing fairly. We sampled women’s joggers, hiking pants, dresses, sunhats, sleepwear, bikinis, rain gear, and jackets from some of the leaders in sustainable clothing to give you the inside scoop. All of the items we sampled were for women or unisex, although many of the brands also feature men’s clothing. Dive in, and find the environmentally responsible look you love. Allbirds This green footwear company also has a line of men’s and women’s apparel, including socks, activewear, and loungewear. It has been Climate Neutral Certified since 2020, and its online product descriptions include information on the carbon footprint of products. It has set clear goals for reducing emissions, which includes greener materials sourcing and reduced supply chain energy use. Allbirds uses innovative materials in its products, such as Trino. It is made from Eucalyptus tree fibers from sustainably managed forests and ZQ Merino wool, which has high standards for animal welfare, sustainability, and social performance. TrinoXO also contains chitosan fiber, which reduces odors and is harvested from discarded snow crab shells. We sampled Allbird’s R&R Sweatpants with organic pima cotton, hemp, and Tencel; Long Sleeve Sea Tea; and Trino Briefs. Arms of Andes This company has a very compact supply chain that’s based exclusively in Peru, where it sources alpaca yarn and fleece and manufactures fabric and garments. This approach gives Arms of Andes a smaller carbon footprint and enables traceability. Its clothing is made of 100% alpaca wool and natural dyes, so the garments are biodegradable and soft, and it uses plastic-free packaging. Arms of Andes was founded by a Peruvian-American bother-sister duo that works with family-run Peruvian alpaca farmers with small, free-roaming herds. Alpacas have been domesticated in the Andes Mountains of South America since pre-Inca times. There is a way of life surrounding breeding and herding alpacas that continues in some highland communities to this day. Alpaca fibers are durable, breathable, and moisture-wicking, which helps with thermo-regulation. We sampled the Women’s Alpaca V-neck shirt, a soft and breathable base layer for hikes and other physical activities. Athleta Based in San Francisco, California, this women’s activewear manufacturer and retailer has realized some impressive sustainability achievements since it was founded in 1998. To date, it has repurposed 441 million plastic bottles into recycled materials, and it has partnered with TENCEL to source modal made from responsibly managed European forests. In 2019, it announced that 60% of its materials are from sustainable fibers, including recycled polyester and nylon, TENCEL® Modal, TENCEL® Lyocell, and organic cotton. It also joined the Textile Exchange Recycled Polyester Challenge and agreed to use 45% recycled polyester by 2025 and 90% by 2030. Athleta operates over 200 retail locations across North America, which are all powered by renewable electricity offsets. It has been part of the GAP portfolio of companies since 2008, along with Banana Republic and Old Navy, and four of its factories are Fair Trade Certified. However, it would be helpful to know more about the working conditions in other factories and if it plans to certify the remaining ones. We sampled the Balance Jogger, Seasoft Pants, and the Seasoft 1\/4 Zip Sweatshirt, which all contain TENCEL Modal. The fabric is super soft yet dries quickly, making it easy to line-dry to save energy. Avocado This natural and certified organic mattress, bedding, and pillow company also has a line of bath robes and pajamas. Avocado has a very impressive list of third-party certifications verifying its strong commitment to sustainability and slowing climate change. For example, it was one of the first Climate Neutral Certified companies in 2019. The following year, Avocado became carbon negative by reducing its carbon emissions and then offsetting more than its entire carbon footprint. We appreciate that Avocado uses GOTS-certified organic cotton, as cotton marketed as organic isn’t always actually organic, according to the New York Times. It also uses Lenzing-certified modal in its pajamas, which ensures it is ethically and sustainably sourced. In addition, Avocado donates 1% of its revenue to environmental nonprofits. We sampled the organic terry cloth robe and the modal pajama shorts, which are both incredibly cozy. Baukjen This sustainable and ethical women’s fashion company believes in balancing “purpose and profit.” This certified B Corp scores especially high in the governance category, which assesses an organization’s mission, engagement for social and environmental impact, transparency, and ethics. It won the 2021 UN Global Climate Action Award, which shows Baukjen’s dedication to the green fashion movement. Baukjen is increasing the use of recycled fibers in its clothing and shortening its supply chain. In 2020, it became carbon-negative across its supply chain by reducing carbon emissions and then offsetting more than it generates. It also vets garment factories, and has them agree to a rigorous Code of Conduct, and performs regular visits. We sampled the Jo Top with Lenzing Ecover and the Lilith Shirt with Tencel, which use materials sourced from certified sustainably managed forests. Big Agnes Fifteen years ago, Big Agnes introduced two sleeping bags and a tent that were made from 100% recycled materials, which was radically green at that time. This outdoor gear company has made some big strides in recent years in sustainable materials, fabrics, and packaging. All its products are 100% PFAS free, and it uses Downtek™, which has a PFC-Free, Bluesign® Certified water-repellant chemistry. Big Agnes is reducing water and energy consumption during the manufacturing process of its tents with the use of solution-dyed fabrics, and many of its synthetic sleeping bags have recycled insulation and linings. It is even making its TwisterCane™ pad from sugarcane harvested in a carbon-negative process. Three of its U.S. facilities purchase 100% renewable electricity through offset programs, and it has joined the Outdoor Industry Association’s Climate Action Corps. We tried out the Big Agnes Women’s Larkspar Insulated Jacket, which features post-consumer recycled content in the shell, lining, and shell. It’s lightweight, packable, and surprisingly warm without being bulky. Coalatree Coalatree launched its first clothing line in 2010 to create workwear for its organic farm in Colorado. This eco-minded apparel and gear company goes the extra mile to recycle or repurpose materials and is taking some impressive strides in producing clothing from recycled plastic bottles and coffee grounds. Coalatree has repurposed more than 83,000 cups of coffee grounds to date and uses a waterless dying system that conserves both water and energy. According to the Coalatree blog, “Yarn infused with coffee saves landfills from coffee waste, reduces the amount of petroleum based products in production, lowers carbon emissions and uses less energy to manufacture.” Also, all the factories overseas that make its goods are Bluesign-certified. Although Coalatree is incorporating environmentally responsible practices, we’d like to see more concrete sustainability commitments and third-party certifications. Coalatree produces a full line of women’s and men’s apparel and gear, such as 100% recycled nylon blankets. We sampled the Evolution Joggers, made with recycled coffee grounds, and the waterproof Trailhead Pants, which was made in a factory with an on-site wetland. Cotopaxi This company creates a variety of colorful outerwear and apparel for enjoying the great outdoors. Founded in 2013, its Gear for Good® promise shapes all aspects of the company and how it operates. Although this promise may sound like greenwashing, the outdoor gear company has numerous certifications and sustainability achievements that demonstrate its commitment, and it is both a B Corp and Climate Neutral certified. According to Cotopaxi, its total carbon footprint is 13,859 tCO2e (tonnes of carbon dioxide equivalent). It has been working to reduce emissions by eliminating single-use plastics from its packaging and replacing them with recycled or biodegradable alternatives. Cotopaxi has also been working with its suppliers to reduce emissions with recycled, repurposed, or third-party-certified responsible materials. In addition, Cotopaxi provides multi-year grants to nonprofits addressing extreme poverty in Latin America by investing in health, education, and livelihood. It is a member of 1% for the Planet, a network of organizations that donate at least 1% of annual revenue to address pressing environmental issues. We sampled the Cotopaxi Fuego Hooded Down Jacket, with responsibly sourced down and many colorful options. It’s relatively thin yet very warm even in winter weather and has a snug-fitting scuba hood. Girlfriend Collective This company makes ethically sourced activewear for women from size XXS to 6XL and uses 100% recycled and recyclable packaging. It sources recycled fabrics that are certified Standard 100 by Oeko-Tex, so they are tested for harmful substances. “Did you know almost all synthetic activewear is made from plastic? We just make ours with materials that would otherwise clog landfills and pollute the earth. It all starts with post-consumer water bottles that have their labels removed, are crushed into billions of minuscule chips, and then washed until they’re sparkling clean,” according to the website. The Girlfriend Collective works with recycling partners in Taiwan and sewing partners in Vietnam, where products are manufactured in factories with third-party certifications like SA 8000. Such certifications help ensure workers are paid a living wage and have safe working conditions. We sampled the Comet Reset Swing Shorts, with delightfully soft fabric, and the Moss Trail Shorts. Both are made from recycled plastic bottles. Mountain Equipment Company (MEC) This Canadian outdoor retailer was founded in 1971, initially as a coop. It produces a variety of outdoor apparel, often with recycled and Bluesign-approved materials. MEC permanently phased out the use of long-chain (C8) PFC DWR chemistry from products in 2016 and is using safer alternatives. Many of its outdoor clothing uses recycled materials, such as nylon and insulation. Many items in its lineup are also Fair Trade certified, which shows a dedication to the social impact of its products. MEC developed its first supplier code of conduct and factory audit program in the early 2000s and has standards in place for every factory that produces its products. Over the years, it has discovered and remediated issues in health and safety, excessive overtime, forced labor, and child labor. MEC has a full line of women’s and men’s outdoor clothing and gear, including duffle bags made of 100% recycled material and totes made with salvaged fabric. We sampled the Aquanator Rain Pants, Aquanator Long Rain Coat, and Hybrid Softshell Pants made with recycled materials. Orvis Orvis was founded in 1856 in Vermont as a company offering fly-fishing equipment. Conservation and a deep connection with the natural world are key aspects of the Orvis brand, and it has committed to protecting and restoring 50 million acres of vital habitat by 2030. It donates 5% of pre-tax profits to “to protecting nature, supporting communities, and advancing canine health and well-being.” The Orvis fly-fishing blog shows its dedication to education and preserving wildlife habitat. It’s great to see an older company embracing sustainability and making its operations and products more sustainable over time. Numerous Orvis products contain recycled nylon and polyester and Bluesign-certified fabrics. It is a founding member of the OIA’s Climate Action Corps, has a goal to be climate positive by 2030, and use exclusively plastic-free packaging. We sampled the Women’s Horseshoe Hills Jacket and the Pro Insulated Hoodie, which both contain recycled materials. Passion Lilie This fair trade fashion brand is based in New Orleans and produces loungewear, dresses, jumpsuits, sarongs, outwear, and more. Passion Lilie was founded to make fair trade clothing more stylish, affordable, and well-fitting, and each item is made in small batches in India. The company purchases carbon offsets for the emissions generated from shipping goods from India to the U.S. and encourages customers to offset their shipping emissions. It uses GOTS-certified organic dyes and no toxic azo dyes. Passion Lilie’s dedication to fair trade goes beyond paying a livable wage and safe working conditions. It promotes gender equity in the workplace with a free job training program for women in the apparel industry in India to help them advice to a higher-paying tailor position. The 3-month training includes a salary, a loaned sewing machine, and free space to work. We sampled the Badru Button Dress with hand-woven cotton ikat fabric. Patagonia This is one of the most impressive companies featured in this article from a sustainability standpoint, and its high B Corp score is a reflection of this. Each year, B Lab recognizes companies with the highest verified scores in five impact areas. Patagonia made the Best for the World: Community and Best for the World: Environment lists for the last two years. It has also been a certified B Corp since 2011, which shows it is a pioneer in environmentally friendly and ethical business. Patagonia has some innovative materials which help conserve resources. It uses Infinna Fiber from post-consumer recycled cotton from its take-back program, recycled spandex, and all the virgin cotton it uses is organic. Patagonia even promotes Regenerative Organic Certified cotton practices with farmers in India, and over 2,200 farmers are participating. We sampled the Nano Air Light Hybrid Hoodie, which is Fair Trade-certified sewn and contains recycled materials. prAna This brand has produced performance clothing, such as activewear and yoga accessories, since 1992. The company embarked on a journey to reduce the use of plastic waste in its packaging in 2010 and has realized many sustainability goals since. It then launched the Responsible Packaging Movement in 2020 to promote sustainable packaging practices in the consumer goods industry. To date, more than 150 like-minded brands have joined, including MEC and Smartwool and nonprofit partners 5 Gyres and Canopy, to help with education and advocacy. One way that prAna is unique from a sustainability standpoint is that it works to bring organizations together to collaborate and realize shared goals. It also works with the Fair Labor Association to promote workers’ rights, and with Bluesign to minimize its chemical impact. Many of its products feature recycled cotton and nylon materials. We sampled the comfortable Hall Pant II made with 95% recycled fabric. Sensi Graves This functional swimwear brand for women has products from size XS to XXL that are designed by a professional kiteboarder. The company was launched in 2012 and has a vision of “A world in which women no longer doubt themselves.” Sensi Graves uses recycled fabrics from Spain and produces its performance swimwear in the U.S. It uses recycled packaging and compostable poly bags and donates 1% of revenue to environmental and women’s empowerment causes. Starting in 2020, Sensi Graves started measuring and offsetting its carbon footprint and is working on reducing future emissions. The swimwear company is now Carbon Neutral certified. We sampled the Alexa Surf Bikini Top and Jennifer Eco Friendly Bikini Bottom. Both are made in the USA of recycled fabrics. Smartwool Founded in 1994 by ski instructors Smartwool makes a variety of apparel from merino wool, including socks, base layers, tops, gloves, and beanies. It sources ZQ-certified merino wool, a wool accreditation program from the New Zealand Merino Company that ensures operations meet sustainability, social, and animal welfare criteria. Smartwool has set several impressive 2030 sustainability targets, such as using exclusively climate-positive wool and only regenerative, recycled, and responsibly sourced renewable materials. It is also working towards a circular business model by minimizing waste and collecting old socks to be repurposed into new products. We sampled the Women’s Active Lined Short and the Active Fleece Insulated Glove with ZQ-certified wool. Sunday Afternoons This family-owned business started 30 years ago and has shown a strong dedication to going “Beyond the Brim” by becoming more sustainable over time. Sunday Afternoons recently became Climate Neutral certified by measuring its carbon emissions, taking actions to reduce its emissions through its operations and supply chain, and offsetting with solar energy. Currently, 78% of its products use recycled or responsibly sourced materials and 63% are Bluesign certified. It is also using CoolCare in its products, a cooling technology built into the fibers of the fabric, and it produces numerous hats that are PFAS free. We sampled the Luna hat, which contains 44% paper, and the Sunseeker hat. Vuori This performance clothing brand is inspired by a coastal California style and was founded in 2015. Vuori believes in ethical manufacturing, sustainability, and community. Manufacturing partners must adhere to the Vuori Code of Conduct for fair treatment and environmental performance. Vuori started measuring its scope 1, 2, and 3 carbon emission and offsetting them with forestry and renewable energy projects, becoming carbon-neutral. Now, Vuori is working towards rigorous carbon emission reduction goals by 2030. We sampled the Performance Jogger, made with 89% recycled polyester, and the Seabreeze Short.","filter_flag":1}
{"title":"Contributing to the Advancement of Biological science and Drug discovery: The Current Position of Nikon's Healthcare ... - Nikon","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vd3d3Lm5pa29uLmNvbS92aXNpb24yMDMwbWFnYXppbmVlL3F1YWxpdHlfb2ZfbGlmZS8yMC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vd3d3Lm5pa29uLmNvbS92aXNpb24yMDMwbWFnYXppbmVlL3F1YWxpdHlfb2ZfbGlmZS8yMC_SAQA?oc=5","id":"CBMiPWh0dHBzOi8vd3d3Lm5pa29uLmNvbS92aXNpb24yMDMwbWFnYXppbmVlL3F1YWxpdHlfb2ZfbGlmZS8yMC_SAQA","guidislink":false,"published":"Wed, 31 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=151, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vd3d3Lm5pa29uLmNvbS92aXNpb24yMDMwbWFnYXppbmVlL3F1YWxpdHlfb2ZfbGlmZS8yMC_SAQA?oc=5\" target=\"_blank\">Contributing to the Advancement of Biological science and Drug discovery: The Current Position of Nikon's Healthcare ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nikon<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Contributing to the Advancement of Biological science and Drug discovery: The Current Position of Nikon's Healthcare ... - Nikon","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vd3d3Lm5pa29uLmNvbS92aXNpb24yMDMwbWFnYXppbmVlL3F1YWxpdHlfb2ZfbGlmZS8yMC_SAQA?oc=5\" target=\"_blank\">Contributing to the Advancement of Biological science and Drug discovery: The Current Position of Nikon's Healthcare ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nikon<\/font>","source.href":"https:\/\/www.nikon.com","source.title":"Nikon","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"This is all possible thanks to the work of our Healthcare Business Unit and Nikon’s subsidiary company, Nikon Solutions Co., Ltd. Today, we do not limit ourselves to the sales of products like microscopes and retinal diagnostic systems. By providing solutions utilizing Nikon’s core technology of precision optics and imaging\/analysis technology, we are shifting from “sales of things” to “sales of solution,” contributing to the improvement of people’s quality of life (QOL). So what are Nikon’s current efforts? And what is the Organ-on-a-Chip Imaging and Analysis contract service conducted at the Nikon BioImaging Lab, which supports drug discovery research using cells? We sat down with two employees knowledgeable of onsite operations, Kenji Miyamoto, Ph.D (Manager of Drug Discovery Research Support Department,Bioscience Sales Division, Nikon Solutions Co., Ltd.) and Kazuaki Tokunaga, Ph.D (Section Manager of East Japan Application Specialist Section, Application Engineering Department, Bioscience Sales Division, Nikon Solutions Co., Ltd.), to ask about Nikon’s future vision. Going beyond offering microscopes and supporting applications —Please tell us what values Nikon is providing in the healthcare field. Miyamoto: Throughout Nikon’s 100-year history, we have established businesses like the Imaging Products Business, which handles cameras; the Precision Equipment Business, which handles lithography systems to manufacture semiconductors and flat panel displays; the Components Business, which handles light sources\/optical instruments, optical processing, etc.; the Industrial Metrology Business, which handles industrial measuring instruments and industrial microscopes; and the Healthcare Business, which deals with ophthalmology instruments and biological microscopes. Of these, the biological microscope possesses the longest history. Nikon has always utilized state-of-the-art optical technologies to develop high-precision observation of microscopic structures, and as a result, we have provided value by contributing to the advancement of science. However, we are now taking our efforts a step further by focusing on providing solutions through application support for customers. JOICO, the first microscope designed by Nikon (released in 1925) AX\/AX R with NSPARC Super-resolution Multiphoton Confocal Microscope —I see, so this is what you were alluding to when you mentioned shifting from “sales of things” to “sales of solution.” What kind of solutions are you providing to solve customers’ issues? Miyamoto: For example, a solution we are providing for pharmaceutical companies is the image acquiring and analysis contract services for organs-on-a-chip. Organs-on-a-chip are gaining attention as an alternative for animal testing. Nikon has collaborated with organ-on-a-chip makers to obtain knowledge on how to observe a variety of organs-on-a-chip through microscopes, aiding pharmaceutical companies looking to utilize them to study the toxicity of drugs and medicine. Another example of our solutions is in the field of regenerative medicine—specifically, the proposal of cell culture observation system and image analysis software during the cell culturing process. By acquiring images of the cultured cell and analyzing them, we can assess the cell’s status with numbers during the culture process, allowing for indicators and objective process management. We believe that by contributing to the achievement of efficient process management, we can reduce the workload of professionals in the field of regenerative cellular medicine. Stabilizing cell culture through objective indicators and process management —How are Nikon’s technologies aiding cell culture? Tokunaga: We can broadly categorize our contributions into three main areas of “culture,” “evaluation,” and “analysis.” The first is the area of “culture.” In the bioscience field, it is extremely important to culture cells suited for each experiment, as its subjects are organisms like cells and tissues. Precautions and processes for cell culture differ according to each cell type, and researchers much proceed with caution so that the cell’s characteristics do not change during the experiment due to mishandling. Up until now, the difficult nature of this process caused discrepancies depending on the handlers. However, as we previously mentioned, cell culture imaging technologies can allow for stable processes to eliminate discrepancies among individuals. Moving forward, we intend to begin offering customer support from the cell culture phase as well, rather than exclusively acquiring images after the culture process is finished. Miyamoto: Next are “evaluation” and “analysis.” To review the multiplication of cultured cells, researchers use microscopes to visually inspect changes in cell count or area over time. In cases like this, one researcher may conclude the difference as a 30% increase, while another researcher may observe the same sample as showing a 40% increase. But ideally, these discrepancies should be minimized from a process management perspective. We aid in doing so by acquiring images and analyzing them to provide objective data that indicate changes in cell count, area, viability, and characteristics. We hope to lift researchers’ workload and support reproducible process management through these efforts. —So you removed elements contingent on individual characteristics and formed an objective indicator? Miyamoto: Yes, that is our description. In addition to what we just discussed, I also believe objective indicators can contribute to education and training, not just efficient process management. Specifically, researchers can compare their own visual inspections—say, the rate of cell increase—with that determined by image analysis to review their own instinct in comparison to objective assessments. Each user can utilize analysis results to reflect on their own evaluations—perhaps they thought there was more growth than there actually was, or maybe they see themselves becoming more accurate over time. Tokunaga: In the case of one company that manufactures vaccines utilizing cells, the timing of collecting cultured cells becomes critical in the creation of vaccines. Formerly, each researcher timed collection at their own discretion, which inherently caused discrepencies in cell quality. Under these circumstances, the main concern centered around how accurately skills could be transferred from veteran researchers to the next generation. However, by implementing Nikon’s software, collecting cells at the most appropriate timing is possible with any handler. —What kind of innovation do you expect to see in the future as people gain the abilities of veteran researchers? Miyamoto: One possibility is that organizations with few veterans can receive equipment support through implementing state-of-the-art devices and software, allowing for efficient training of researchers. We may also see more case studies of experiments utilizing new cells. Or perhaps implementing automated systems can lift the workload of researchers so that they may utilize that time for more innovate work, contributing to business expansion. In the future, we also hope to provide a package solution for system fabrication from Nikon. We believe that this is another area in which we can realize becoming “a key technology solutions company in a global society where humans and machines co-create seamlessly.” Tokunaga: Until now, cell culture followed an experience-based method, but digitalization can realize the difficult task of 24-hour management for efficient culturing in a more stable environment. Providing innovations that society needs will become possible by standardizing cell quality management in alignment with past experiences. Aiding abolishment of animal testing with “organ-on-a-chip” and its contributions towards SDGs —Please tell us about Nikon BioImaging Lab. What technologies and services do you provide? Miyamoto: Nikon BioImaging Lab of Japan was established in May 2022 within the Shonan Health Innovation Park (Shonan iPark) in Kanagawa Prefecture. Outside of Japan, we also have labs in the U.S. and Netherlands. Nikon Group’s veteran workers skilled in microscopic cell imaging work here, providing optimal solutions for customers’ issues related to image analysis through advising on various tasks, including equipment setting and specific imaging methods. From our position, this gives us an opportunity consult with numerous companies and grasp the needs of a wide range of customers. We hope to provide even more solutions by accumulating knowledge during this process. Ultimately, operating Nikon BioImaging Lab will boost trust in Nikon as a company, leading to the purchase of products later on. Shonan Health Innovation Park (Shonan iPark) —Why is Nikon’s service to provide imaging and analysis of organs-on-a-chip necessary? Miyamoto: Currently, there is a shift towards eliminating animal testing, which is partly in correlation with achieving SDGs looking towards 2030. While the EU has already prohibited animal testing for cosmetic products, the field of pharmaceuticals has continued testing on animals to assess the effects and toxicity of drugs. In order to eliminate animal testing altogether, organs-on-a-chip can be extremely valuable. Organs-on-a-chip are created by curating cells in a container small enough to fit in the palm of a hand. It is a reproduction of select organs that make up the human body, such as blood vessels and nerves. By administering drugs to reproductions of the human body that are organs-on-a-chip, we can evaluate the effect and toxicity of certain drugs without the need for animal testing. Organs-on-a-chip have already been implemented in many settings, but selecting which chips to choose among a broad and diverse lineup can pose a dilemma for companies, as implementing special equipment by various makers can add up to become a costly investment. At Nikon BioImaging Lab, we consult customers on what experiments they plan to conduct, and collaborate with organs-on-a-chip makers to advise customers on what chips are best suited for their objective while providing knowledge on imaging and analysis. By conducting prior consultations, we help customers to evaluate organs-on-a-chip without the immediate need for implementing special equipment. Co-creating with customers for solutions that enrich society —What contributions can Nikon make by shifting from “sales of things” to “sales of solution?” Miyamoto: By shifting from “sales of things” to “sales of solution,” Nikon can propose specific solutions to customers with issues on image acquiring\/analyzing, rather than just offering products. This can also allow us to accumulate more knowledge through interactions with a wider range of customers, which can later help us to provide solutions to even more customers. These are some ways we hope to contribute to society. Instead of ending our services with sales of products, our aim is to take another step further to provide solutions to customers’ issues. —So you intend to offer total support for customers rather than simply selling products. Miyamoto: Customer feedback are also reflected in development of new products. What functions are customers anticipating from Nikon products? And what difficulties are users encountering with them? Unfiltered opinions to questions like these are extremely valuable. While market research is also a significant element of product development, raw feedback often reveals the true needs of customers that are not reflected in marketing activities, so we hope to utilize them in the future, as well. —Please tell us of your future prospects. Miyamoto: By focusing more on “sales of solution,” we hope to construct even closer relations with customers and promote co-creation. This will help us to develop appealing new products and launch solutions that can contribute to solving issues held by a number of people. Nikon holds a corporate philosophy of “trustworthiness and creativity.” We will continue co-creating with customers to offer results that uphold both of these philosophies.","filter_flag":1}
{"title":"SUBMARINER Network launches AlgaeProBANOS to cultivate sustainable algae products: Know more - Silicon Canals","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vc2lsaWNvbmNhbmFscy5jb20vc3VibWFyaW5lci1uZXR3b3JrLWxhdW5jaGVzLWFsZ2FlcHJvYmFub3Mv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vc2lsaWNvbmNhbmFscy5jb20vc3VibWFyaW5lci1uZXR3b3JrLWxhdW5jaGVzLWFsZ2FlcHJvYmFub3Mv0gEA?oc=5","id":"CBMiRGh0dHBzOi8vc2lsaWNvbmNhbmFscy5jb20vc3VibWFyaW5lci1uZXR3b3JrLWxhdW5jaGVzLWFsZ2FlcHJvYmFub3Mv0gEA","guidislink":false,"published":"Fri, 26 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=146, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vc2lsaWNvbmNhbmFscy5jb20vc3VibWFyaW5lci1uZXR3b3JrLWxhdW5jaGVzLWFsZ2FlcHJvYmFub3Mv0gEA?oc=5\" target=\"_blank\">SUBMARINER Network launches AlgaeProBANOS to cultivate sustainable algae products: Know more<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Silicon Canals<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"SUBMARINER Network launches AlgaeProBANOS to cultivate sustainable algae products: Know more - Silicon Canals","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vc2lsaWNvbmNhbmFscy5jb20vc3VibWFyaW5lci1uZXR3b3JrLWxhdW5jaGVzLWFsZ2FlcHJvYmFub3Mv0gEA?oc=5\" target=\"_blank\">SUBMARINER Network launches AlgaeProBANOS to cultivate sustainable algae products: Know more<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Silicon Canals<\/font>","source.href":"https:\/\/siliconcanals.com","source.title":"Silicon Canals","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"The SUBMARINER Network, a consortium of top industry and research partners working in the blue economy sector, announced on Wednesday, May 24,the launch of AlgaeProBANOS project. Funded by the European Union’s Horizon Europe programme, the AlgaeProBANOS project aligns with the Blue Mission BANOS lighthouse initiative, which engages and supports stakeholders across the Baltic and North Sea to reach a carbon-neutral and circular blue economy. The SUBMARINER Network’s initiative falls under the EU’s Mission Restore our Ocean and Waters initiative, which aims to protect and restore the health of our ocean and waters through research and innovation, citizen engagement, and blue investments. The AlgaeProBANOS project The AlgaeProBANOS project is scheduled to span four years and has been allocated a substantial budget exceeding €12M, including contributions of around €1M from small and medium-sized enterprises (SMEs). The primary focus lies in harnessing the exceptional properties of algae to develop new and valuable products and services for various applications. During this project, the consortium, comprising 26 partners and affiliated entities, will establish acceleration networks and digital solutions to support algae-based businesses. - A message from our partner - Additionally, they will conduct six business pilots across the Baltic and North Sea regions, utilising microalgae and macroalgae for applications in food, feed, nutraceuticals, textiles, cosmetics, and plant biostimulants. The project will bring eight innovative algae-based products to market, helping to meet the growing demand for ecologically friendly, high-quality circular bio-based goods. To ensure the social, environmental and economic sustainability and circularity of the algae sector, partners will develop a framework, while working directly with consumers to raise awareness and ensure new products meet end-user demands and trends. Speaking from the project launch event in Berlin, Angela Schultz-Zehden, Managing Director of the SUBMARINER Network, says, “We are super excited to be embarking on this new Baltic and North Sea lighthouse project which is among the largest EU-funded algae projects. Only a decade ago, the cultivation and use of algae in Europe was very much at the research stage.” “Today, many large-scale industry players are highly interested in algae as a new bio-resource to improve the environmental footprint of their products. AlgaeProBANOS will make a big contribution to mainstreaming the use of algae in very different industries throughout Europe, making it an everyday commodity for future generations,” adds Schultz-Zehden. The SUBMARINER Network The SUBMARINER Network aims to bring actors from the whole Baltic Sea Region together to actively promote innovative and sustainable uses of marine resources. The platform operates across the whole knowledge triangle integrating perspectives from local to international scale, different science disciplines as well as policy and economic stakeholders. Through meetings, workshops, conferences, and a comprehensive set of dissemination tools, network members are provided with a continuous platform for communication, exchanges of experience, joint project development, and implementation.","filter_flag":1}
{"title":"Dow and New Energy Blue announce collaboration to develop renewable plastic materials from corn residue - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMinwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Rvdy1hbmQtbmV3LWVuZXJneS1ibHVlLWFubm91bmNlLWNvbGxhYm9yYXRpb24tdG8tZGV2ZWxvcC1yZW5ld2FibGUtcGxhc3RpYy1tYXRlcmlhbHMtZnJvbS1jb3JuLXJlc2lkdWUtMzAxODM0NTg2Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMinwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Rvdy1hbmQtbmV3LWVuZXJneS1ibHVlLWFubm91bmNlLWNvbGxhYm9yYXRpb24tdG8tZGV2ZWxvcC1yZW5ld2FibGUtcGxhc3RpYy1tYXRlcmlhbHMtZnJvbS1jb3JuLXJlc2lkdWUtMzAxODM0NTg2Lmh0bWzSAQA?oc=5","id":"CBMinwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Rvdy1hbmQtbmV3LWVuZXJneS1ibHVlLWFubm91bmNlLWNvbGxhYm9yYXRpb24tdG8tZGV2ZWxvcC1yZW5ld2FibGUtcGxhc3RpYy1tYXRlcmlhbHMtZnJvbS1jb3JuLXJlc2lkdWUtMzAxODM0NTg2Lmh0bWzSAQA","guidislink":false,"published":"Thu, 25 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=145, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Rvdy1hbmQtbmV3LWVuZXJneS1ibHVlLWFubm91bmNlLWNvbGxhYm9yYXRpb24tdG8tZGV2ZWxvcC1yZW5ld2FibGUtcGxhc3RpYy1tYXRlcmlhbHMtZnJvbS1jb3JuLXJlc2lkdWUtMzAxODM0NTg2Lmh0bWzSAQA?oc=5\" target=\"_blank\">Dow and New Energy Blue announce collaboration to develop renewable plastic materials from corn residue<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Dow and New Energy Blue announce collaboration to develop renewable plastic materials from corn residue - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Rvdy1hbmQtbmV3LWVuZXJneS1ibHVlLWFubm91bmNlLWNvbGxhYm9yYXRpb24tdG8tZGV2ZWxvcC1yZW5ld2FibGUtcGxhc3RpYy1tYXRlcmlhbHMtZnJvbS1jb3JuLXJlc2lkdWUtMzAxODM0NTg2Lmh0bWzSAQA?oc=5\" target=\"_blank\">Dow and New Energy Blue announce collaboration to develop renewable plastic materials from corn residue<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"First-of-its-kind agreement in North America would create bio-based ethylene for Dow's U.S. Gulf Coast assets to produce renewable plastics across fast-growing end-markets MIDLAND, Mich., May 25, 2023 \/PRNewswire\/ -- Today, Dow (NYSE: DOW) and New Energy Blue announced a long-term supply agreement in North America in which New Energy Blue will create bio-based ethylene from renewable agricultural residues. Dow expects to purchase this bio-based ethylene, reducing carbon emissions from plastic production, and using it in recyclable applications across transportation, footwear, and packaging. Dow and New Energy Blue to develop renewable plastic materials from corn residue. New Energy Blue, a design\/build\/operate bio-conversion company, envisions a world that runs on green energy in harmony with nature’s carbon cycle and developed the New Energy Biomass Refinery™, a bio-based platform for replacing fossil fuels and chemicals by converting annual agricultural residues and grasses into green renewables for zero-carbon markets. Dow's agreement with New Energy Blue, staffed by experts with deep experience in bio-conversion ventures, is the first agreement in North America to generate plastic source materials from corn stover (stalks and leaves). This is also Dow's first agreement in North America to utilize agriculture residues for plastic production. \"We are unlocking the value of agriculture residues in this new partnership with New Energy Blue,\" said Karen S. Carter, Dow President of Packaging & Specialty Products. \"By committing to purchase their bio-based ethylene, we are helping to enable innovations in waste recycling, meeting demands for bio-based plastics from customers, and strengthening an ecosystem for diverse and renewable solutions.\" Under the terms of the agreement, Dow is supporting the design of New Energy Freedom, a new facility in Mason City, Iowa, that is expected to process 275KT of corn stover per year and produce commercial quantities of second-generation ethanol and clean lignin. Nearly half of the ethanol will be turned into bio-based ethylene feedstock for Dow products. This agreement also gives Dow similar commercial supply options for the next four future New Energy Blue projects, supporting New Energy Blue's ability to scale its production and support farmers by providing a reliable market for agricultural residues. The five projects are expected to displace over one million tons of greenhouse gas (GHG) emissions every year. Dow's share of these five projects will also lead to a reduction in its sourcing of fossil fuels and subsequent GHG emissions. This agreement would play a pivotal role in Dow's approach to building material ecosystems that value, source, and transform waste into circular products. By collaborating with the best partners and technologies for collection, reuse, and recycling of waste – in this case, using a renewable resource – Dow enables global material ecosystems to scale. \"This collaboration can help redefine how we source raw materials for our products, allowing us to expand to include renewable feedstocks,\" said Manav Lahoti, Dow Global Sustainability Director -Olefins, Aromatics & Alternatives. \"We're excited by the possibility for agriculture-based plastics to help our company achieve both our Transform the Waste goal and our Net Zero CO2 goal. It also aligns with our ambition to increase renewable resource use, paving the way for future commitments.\" \"We're excited to be working with Dow to find solutions that create bio-based plastics from renewable resources,\" said Thomas Corle, CEO of New Energy Blue. \"Together, we're building a future not only in the farm fields of Iowa using corn stover, but across America and around the world using a variety of biomass from grain straws to tall perennial grasses—wherever there's an opportunity to reduce carbon emissions from farming, support farmers in rural communities, and enable the production of the sustainable, low-carbon plastics used in everyday life.\" Through this agreement, Dow would increase its use of renewable yet still recyclable resources, transforming them into products that consumers use every day. Since corn stover releases carbon dioxide into the atmosphere as it decomposes, Dow's agreement with New Energy Blue would also help reduce carbon emissions from agriculture by reusing this otherwise wasted carbon. Dow's use of bio-based feedstocks from New Energy Blue is expected to be certified by ISCC Plus, an international sustainability certification program with a focus on traceability of raw materials within the supply chain. While Dow intends to mix agriculture-based ethylene into its existing manufacturing process, ISCC Plus's chain of custody certification would allow Dow's customers to account for bio-based materials in their supply chains. Dow's supply agreement with New Energy Blue would create additional economic value for farmers by opening a dependable new market. New Energy Blue's forthcoming Iowa processing facility would source corn stover directly from local farmers every year. Because U.S. farmers' grain yield per acre is among the world's highest, their stover density is correspondingly high. By selling their excess stover for biomass refining, they could reap an excellent second income from the same crop while using farming practices that increase carbon retention in the soil. About Dow Dow (NYSE: DOW) combines global breadth; asset integration and scale; focused innovation and materials science expertise; leading business positions; and environmental, social and governance leadership to achieve profitable growth and help deliver a sustainable future. The Company's ambition is to become the most innovative, customer centric, inclusive and sustainable materials science company in the world. Dow's portfolio of plastics, industrial intermediates, coatings and silicones businesses delivers a broad range of differentiated, science-based products and solutions for its customers in high-growth market segments, such as packaging, infrastructure, mobility and consumer applications. Dow operates manufacturing sites in 31 countries and employs approximately 37,800 people. Dow delivered sales of approximately $57 billion in 2022. References to Dow or the Company mean Dow Inc. and its subsidiaries. For more information, please visit www.dow.com or follow @DowNewsroom on Twitter. About New Energy Blue New Energy Blue, a design\/build\/operate bio-conversion company, envisions a world that runs on green energy in harmony with nature's carbon cycle and developed the New Energy Biomass Refinery™, a bio-based platform for replacing fossil fuels and chemicals by converting annual agricultural residues and grasses into green renewables for zero-carbon markets. Learn more at newenergyblue.com. Media Contact Whitney Bolger – [email protected] Kyle Bandlow - [email protected] Roger Moore – [email protected] SOURCE The Dow Chemical Company","filter_flag":1}
{"title":"Why This CEO Says Plant-Based Meat Is a Lot Like Electric Cars - VegNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vdmVnbmV3cy5jb20vZnV0dXJlLWZhcm0tcGxhbnQtYmFzZWQtbWVhdC1lbGVjdHJpYy1jYXJz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vdmVnbmV3cy5jb20vZnV0dXJlLWZhcm0tcGxhbnQtYmFzZWQtbWVhdC1lbGVjdHJpYy1jYXJz0gEA?oc=5","id":"CBMiPmh0dHBzOi8vdmVnbmV3cy5jb20vZnV0dXJlLWZhcm0tcGxhbnQtYmFzZWQtbWVhdC1lbGVjdHJpYy1jYXJz0gEA","guidislink":false,"published":"Tue, 30 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=30, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=150, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vdmVnbmV3cy5jb20vZnV0dXJlLWZhcm0tcGxhbnQtYmFzZWQtbWVhdC1lbGVjdHJpYy1jYXJz0gEA?oc=5\" target=\"_blank\">Why This CEO Says Plant-Based Meat Is a Lot Like Electric Cars<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why This CEO Says Plant-Based Meat Is a Lot Like Electric Cars - VegNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vdmVnbmV3cy5jb20vZnV0dXJlLWZhcm0tcGxhbnQtYmFzZWQtbWVhdC1lbGVjdHJpYy1jYXJz0gEA?oc=5\" target=\"_blank\">Why This CEO Says Plant-Based Meat Is a Lot Like Electric Cars<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","source.href":"https:\/\/vegnews.com","source.title":"VegNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Alexandre Ruberti, CEO of Brazilian plant-based protein company Future Farm, says the growth of the vegan meat market is a lot like that of electric cars. In other words, the plant-based industry will ebb and flow before becoming fully established. “Like any new market, they often see rapid growth, a decline, and then stabilization,” Ruberti tells VegNews. “We’re still early on in this category and it’s going to have its natural ebbs and flows.” Future Farm Prior to Future Farm, Ruberti worked at now-popular energy drink brand Red Bull for 16 years, serving in executive positions at Red Bull Distribution Company USA and Red Bull North America. He is credited with steering the business through incremental growth, and he now brings his wealth of experience to the plant-based industry. As an expert in consumer packaged goods like Red Bull, Ruberti knows a thing or two about bringing innovative products to market. His comparison of the plant-based meat market to the electric vehicles and energy drinks categories highlights the similarities those industries saw. “If you look at where EVs and energy drinks are now, you can’t drive down the street without seeing an electric car or go into practically any shop without seeing cases full of energy drinks,” Ruberti says. “My point is that plant-based isn’t much different, we’re in it for the long run and will continue to innovate to meet consumer demand,” he says. A future without animal meat Founded in 2019 by Brazilian entrepreneur Marcos Leta and business partner Alfredo Strechinsky, Future Farm’s mission is encapsulated in its name: to create the farm of the future, where plant-based products replace the cruel and unsustainable animal-derived counterparts of the past. Future Farm For his part, Ruberti joined the business because he knows humanity cannot keep consuming traditional animal protein at the rate we do today. And he’s onboard with Future Farm’s mission to change the way the world eats. “At Future Farm, we envision a world where people choose to eat plants, not animals,” Ruberti says. “That means shifting from an animal-heavy diet to a plant-heavy diet.” Yet he’s also conscious of the sacrifices consumers think they have to make when it comes to sustainable food. “Consumers should know we’re not asking them to ditch traditional protein 100 percent of the time,” Ruberti says. “We understand the process is not from one day to the next, but rather it’s the small choices over time in everyday meals that will leave a positive and lasting impact on the environment.” In other words, small changes in one’s diet—choosing plant-based meat for a meal, for example—actually does make a difference. And educating consumers on this fact is key to adoption. “I think the industry as a whole has to recognize that we’re also in the business of educating people—to show them that they have a choice in what they eat,” Ruberti says. “They can get delicious-tasting protein that doesn’t sacrifice the environment and sustainability.” Future Farm This also means educating them on the sustainability metrics of plant-based food products versus animal products. “Our Future Burger is 100-percent carbon neutral; we’ve partnered with ClimatePartner to track our carbon emissions and plant trees in our backyard, the Amazon Rainforest, to offset those emissions,” Ruberti points out. What sets Future Farm apart The growing plant-based protein industry constantly welcomes new players creating sustainable products. What sets Future Farm apart from these brands? “It’s really all in our name,” Ruberti says. “We’re creating the farm of the future, where consumers can get delicious food of the future, today.” “We’re forward thinkers and conscious about the environment, so we’re creating products like Future Tuna that continue to push the boundaries and provide some of the highest quality and best-tasting plant-based products on the market,” he says. The company first tackled beef with the launch of its hero product Future Burger, followed by its Future Meatball, Future Beef, and Future Sausage—all of which expanded to the United States in 2021. Future Farm This year, Future Farm is tackling new categories with the launch of Future Chik’n and shelf-stable Future Tuna. Ultimately, it is working on 12 new vegan staples, including honey, milk, hot dogs, and more, to support a transition to a plant-based food system. And because Future Farm products are made with natural ingredients, it allows the brand to create plant-based versions that are comparable in nutritional value to animal protein—but without the downsides. “Future Farm products mimic the flavor, appearance, and juiciness of traditional protein, but all are non-GMO, gluten-free, 0 percent cholesterol, and most impressive, 0 percent trans fat,” Ruberti says. “We’re sophisticating technology to the point where consumers don’t recognize what is animal protein and what is vegetable protein,” Ruberti says. Ultimately, Ruberti says that in order to get to the point where plant-based meat is as accepted and established as electric cars and energy drinks, we need to shift the conversation to plant-based meat as a food solution to our environmental crisis. “It’s a huge step forward in the right direction of making food that is sustainable,” Ruberti says. “Naturally, it takes time for consumers to adopt different diets and the industry will continue to grow.”","filter_flag":1}
{"title":"Check out the latest ASUS innovations at Computex 2023 - Edge Up - ASUS Edge Up","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vZWRnZXVwLmFzdXMuY29tLzIwMjMvY2hlY2stb3V0LXRoZS1sYXRlc3QtYXN1cy1pbm5vdmF0aW9ucy1hdC1jb21wdXRleC0yMDIzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vZWRnZXVwLmFzdXMuY29tLzIwMjMvY2hlY2stb3V0LXRoZS1sYXRlc3QtYXN1cy1pbm5vdmF0aW9ucy1hdC1jb21wdXRleC0yMDIzL9IBAA?oc=5","id":"CBMiVGh0dHBzOi8vZWRnZXVwLmFzdXMuY29tLzIwMjMvY2hlY2stb3V0LXRoZS1sYXRlc3QtYXN1cy1pbm5vdmF0aW9ucy1hdC1jb21wdXRleC0yMDIzL9IBAA","guidislink":false,"published":"Tue, 30 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=30, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=150, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vZWRnZXVwLmFzdXMuY29tLzIwMjMvY2hlY2stb3V0LXRoZS1sYXRlc3QtYXN1cy1pbm5vdmF0aW9ucy1hdC1jb21wdXRleC0yMDIzL9IBAA?oc=5\" target=\"_blank\">Check out the latest ASUS innovations at Computex 2023 - Edge Up<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ASUS Edge Up<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Check out the latest ASUS innovations at Computex 2023 - Edge Up - ASUS Edge Up","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vZWRnZXVwLmFzdXMuY29tLzIwMjMvY2hlY2stb3V0LXRoZS1sYXRlc3QtYXN1cy1pbm5vdmF0aW9ucy1hdC1jb21wdXRleC0yMDIzL9IBAA?oc=5\" target=\"_blank\">Check out the latest ASUS innovations at Computex 2023 - Edge Up<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ASUS Edge Up<\/font>","source.href":"https:\/\/edgeup.asus.com","source.title":"ASUS Edge Up","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"At the yearly Computex expo, we love to pull back the curtain on our relentless pursuit of incredible experiences and showcase our latest innovations. Computex 2023 is no different. Visitors to our booth in Taipei will find new monitors, new laptops, trailblazing sustainability achievements, and more. But even if you can’t make it out to Taiwan for the event, we’re happy to share all the details of our Computex 2023 announcements. A complete lineup of thin-and-light laptops Once again, we’re demonstrating our commitment to delivering innovation and cutting-edge technology with the latest Zenbook and Vivobook series laptops. Among the standout features is our latest innovation in laptop displays — ASUS Lumina OLED technology, which offers unprecedented visual quality. This new display name standardizes highly crafted solutions around the best OLED experience. Its name also highlights the unique advantages of ASUS OLED displays, which provide a superior visual experience that goes beyond the standard of traditional OLED displays. ASUS Lumina OLED displays are now available for all ASUS 2023 OLED models. Beyond the traditional OLED display benefits, such as higher contrast range and wider color range, ASUS Lumina OLED displays are Pantone® Validated, VESA DisplayHDR™ True Black certified, and factory-calibrated to Delta E < 1 to deliver more accuracy. Additionally, the ASUS Splendid customized color gamut, OLED Power Saving, and ASUS Tru2Life technology help deliver better and more intelligent tools. Furthermore, their TUV low blue light certification, ASUS OLED Care burn-in prevention, and US military-grade durability makes them more reliable and helps them maintain quality and comfort over time. We also provide free OLED screen exchange for any burn-in issue while under warranty. Among the most impressive thin-and-light models presented during Computex 2023, the Zenbook S 13 OLED (UX5304) — the world’s slimmest OLED laptop — is carbon neutral and weighs only 1 kg with a thickness of 1 cm. Available in Basalt Gray or Ponder Blue, it features a revolutionary Plasma Ceramic Aluminum lid that provides wear resistance, corrosion protection, and thermal management. It has a 16:10 2.8K OLED NanoEdge display with Dolby Vision, Pantone Validated colors, a VESA DisplayHDR True Black 500 certification, and a long-lasting 63 Wh battery. We’re also showcasing our young, trendy, thin, and light OLED laptops, including the ASUS Vivobook S 15 OLED (K5504). These colorful models feature lightweight designs, and are powered by Intel® Core™ i9-13900H processors able to handle any task. The Vivobook S 15 OLED is Intel Evo™ certified, providing long-lasting battery life, speedy connectivity, and all the essential features for everyday living. These laptops are available in a variety of finishes and are built for easy portability, with a 2.8K 120 Hz OLED HDR NanoEdge display, up to 88% screen-to-body ratio panels, and Harman Kardon-certified audio system. The Vivobook S 15 OLED also comes in an upcoming exclusive BAPE® Edition, a special collaboration between ASUS and legendary streetwear brand A Bathing Ape®. This limited-edition laptop bundle will release later in 2023 and combines the Vivobook vibrant style with the iconic BAPE aesthetic, featuring exclusive camo designs and accompanying accessories. We’ve also partnered with Dirac on the Vivobook series to deliver superior sound for everyone. The Dirac-designed audio system delivers an immersive, clear, and balanced sound experience, unleashing the full audio potential of the laptops with a wider and deeper soundscape. To ensure long-lasting value, reliability, and durability, all new ASUS consumer laptop models in 2023 and beyond will undergo rigorous MIL-STD 810H US military-grade testing, encompassing 12 test methods and 26 test procedures. These laptops are built to withstand the toughest conditions, setting a new standard in durability for the consumer laptop market. ASUS solutions for creators at Computex 2023 We’re revolutionizing the world of content creation with a full suite of powerful creator solutions, including laptops, displays, motherboards, graphics cards, all-in-one CPU cooler, software, and much more, all designed to bring creative visions to life. The ProArt Studiobook 16 3D OLED (H7604), the world’s first 3D OLED creator mobile workstation, offers exceptional versatility with a stepped-hinge design enabling slimmer screen bezels, rear air vents, and a lay-flat screen that can be viewed from any angle. Its glasses-free 3D OLED display makes creating 3D content faster and more intuitive, while Spatial Vision technology converts 2D visual content to 3D in real-time. This technology provides glasses-free 3D OLED displays with built-in eye-tracking, delivering an unmatched 3D experience that incorporates breakthrough optical and real-time rendering technology, as well as exclusive software tools. On the display side, the ASUS ProArt Display PA32UCXR is a 31.5-inch 4K monitor that features a 2304-zone mini-LED IPS panel, delivering stunningly vibrant and accurate colors with 97% DCI-P3 coverage. It boasts an impressive peak brightness of 1600 nits and sustained brightness of 1000 nits, ensuring a visually captivating experience. With a built-in motorized flip colorimeter, it supports auto\/self-calibration, allowing for easy and accurate recalibration over time. The true 10-bit color depth enables the display of HDR content with deep blacks and precise highlights. Additionally, it supports multiple HDR formats, including HDR-10 and HLG, and offers world-leading Delta E color difference value and ASUS ProArt Hardware Calibration technology for optimal color accuracy. The ASUS ProArt Display PA24ACRV is a 23.8-inch QHD monitor that offers a wide color gamut coverage of 95% DCI-P3. It delivers high-quality visuals with its VESA DisplayHDR400 compliance and support for the HDR-10 format. The monitor is Calman Verified and factory pre-calibrated to Delta E < 2, ensuring exceptional color accuracy out of the box. It provides extensive connectivity options, including DisplayPort™ over USB-C with 96-watt power delivery, HDMI®, and a USB hub for enhanced versatility. Additionally, with its commitment to sustainability, the PA24ACRV features paper packaging and energy-efficient performance to meet ENERGY STAR and EPEAT standards, as well as TCO Certification later in 2023. Wer’e also ready to introduce the upgraded ASUS Control Panel, the enhanced and customizable software for creators. With a new user interface, resizable layout, and integration with various apps, Control Panel offers more possibilities for enhancing creative work. It automatically switches profiles when launching specific applications, now extending beyond Adobe apps to include Microsoft Office, Spotify, YouTube, browsers, and more. The new Control Panel also expands its support to include all ASUS touch monitors, in addition to ScreenPad Plus laptops and ProArt touch monitors. At the ProArt section of our Computex 2023 booth, we will also display the complete ProArt component ecosystem, featuring the new ProArt LC 420 all-in-one CPU cooler, as well as a range of ProArt motherboards and graphics cards renowned for their minimalist design. Another impressive thin-and-light solution for creators is the Zenbook Pro 16X OLED (UX7602BZ) – the most powerful Zenbook yet thanks to its partnership with Intel and its ASUS Supernova System-on-Module (SoM) design. The Zenbook Pro 16X OLED boasts a world-leading 16:10 3.2K 120 Hz OLED HDR NanoEdge touchscreen, and the Active Aerodynamic System Ultra (AAS Ultra) mechanism powers the auto-tilting keyboard that ensures a comfortable typing angle and enhances system cooling for maximum performance. Cutting-edge monitors, peripherals, PC DIY, and more at Computex 2023 ROG will once again raise the bar for PC DIY and peripherals when it showcases its latest products at Computex 2023. Among the highlights is the ROG Matrix RTX 4090 liquid-cooled graphics card, which will be available on the market in Q3 2023. The ROG Matrix RTX 4090 boasts the industry’s first liquid metal thermal solution directly on the graphics card’s GPU die, allowing for even lower temperatures for superior sustained performances, and lower noise. Plus, a 360 mm radiator with innovative magnetic daisy-chainable fans, and a more powerful pump and larger full-covered cold plate come together to keep the graphics card cool at all times. This allows for unrivalled performance with the highest GPU boost clock. What’s more, this card features an incredibly bold and modern design, perfect for the most advanced gaming builds. If you’ve been looking for a super-ultra-wide OLED gaming monitor, your wait is over. The ROG Swift OLED PG49WCD monitor, a 49-inch super-ultrawide (5120 x 1440) gaming monitor, feautres an 1800R QD-OLED panel with 144 Hz refresh rate and 0.03 ms response time for immersive gaming experiences. To ensure QD-OLED longevity and better performance, it includes a custom heatsink and graphene film, the thinnest yet strongest nanomaterial in the world, behind the whole QD-OLED panel, for better heat dissipation to reduce the risk of burn-in and boost the peak brightness up to 1000 nits. The monitor offers a range of connectivity including DisplayPort 1.4, HDMI 2.1, and a USB-C port with 90 W power delivery. It also offers user-friendly features such as uniform brightness to maintain the even luminance level, ASUS DisplayWidget Center software to adjust the system settings via a mouse, and dual-device Smart KVM that allows users to effortlessly manage two devices with a single keyboard and mouse, with no additional hardware or software required. Users can also seamlessly switch between gaming and work on a single screen with ease and conveniently copy and paste content across both devices, simplifying their setup and enhancing productivity with this versatile solution. Another major product making its entrance at Computex is the ROG Swift PG38UQ, the world’s first 38-inch 4K UHD gaming display, offering truly immersive visuals. With a 144 Hz refresh rate and Adaptive-Sync technology, it ensures super-smooth gaming experiences. The display features ASUS Fast IPS technology, providing a 1 ms response time (GTG) for sharp and high-frame-rate gaming visuals. It is HDR-compatible with DisplayHDR 600 certification and boasts a 98% DCI-P3 professional color gamut, delivering exceptional contrast and color performance. HDMI 2.1 support allows for native 4K 120 Hz gaming without chroma subsampling, enhancing gameplay on PlayStation® 5 and Xbox Series X. The monitor offers extensive connectivity options, including DisplayPort 1.4 with Display Stream Compression (DSC), HDMI 2.1, USB hub, and a tripod socket for versatile usage. It is NVIDIA G-SYNC compatible, supports AMD FreeSync Premium Pro, and incorporates VESA AdaptiveSync 144 Hz technology for tear-free visuals with low latency. Additionally, the new ROG Strix XG259QN is a 24.5-inch FHD gaming monitor equipped with a Fast IPS panel for stunning visuals. With a 360 Hz refresh rate (overclockable to 380 Hz) and less than 1 ms response time (GTG), it ensures smooth and responsive gaming performance. The display is DisplayHDR400 certified, delivering vivid and vibrant colors. It supports FreeSync Premium, providing tear-free gaming experiences. Equipped with ASUS Extreme Low Motion Blur Sync (ELMB SYNC) technology, it combines ELMB with variable refresh rate (VRR), eliminating ghosting and tearing for sharp visuals at high frame rates. The monitor offers versatile connectivity with a DisplayPort 1.4 port, two HDMI 2.0 ports, two USB 3.2 ports, and a headphone jack, catering to various device connections. For gamers seeking the ultimate in image clarity, ROG and NVIDIA have introduced G-SYNC Ultra Low Motion Blur 2 (ULMB 2) to the ROG Swift 360 Hz PG27AQN with a firmware update. With over 1000 Hz of effective motion clarity, ULMB 2 offers the best motion blur reduction for competitive gamers available today. To do this, ULMB 2 ensures that each pixel shows the right color at the right time to help get rid of the blurry look gamers sometimes face when objects are moving fast on their screen. ULMB 2 turns the screen’s backlight on and off at a high frequency to handle these scenarios. Furthermore, in instances where the backlight turns on when pixels are still changing colors, this sometimes doubles images and creates unwanted visuals in other monitors. To avoid this, ULMB 2 uses a special technique called Vertical Dependent Overdrive to ensure that the backlight only turns on when all the pixels are showing the right color. This results in clearer pictures and visuals even when scenes and objects are moving fast. It also delivers full refresh rate backlight strobing, nearly 2X-higher brightness than the original ULMB, and zero crosstalk\/double images. ROG Swift 360 Hz PG27AQN users can enjoy ULMB 2 now by installing the new firmware. Another standout product at Computex 2023 is the ROG Strix Scope II 96 Wireless, ROG’s first 96% gaming keyboard with hot-swappable switches, featuring the all-new ROG NX Snow mechanical switches, unique dampening foam with integrated switch-dampening pads, tri-mode connection with ROG SpeedNova wireless technology, and the ROG Omni Receiver. The ROG Omni Receiver allows users to connect their compatible mouse and keyboard via a single dongle, all without compromising performance. Also new in the Scope II series are the ROG Strix Scope II 100% keyboard, also featuring the new ROG NX Snow switches, and ROG Strix Scope II RX, featuring IP57 water and dust resistance and ROG RX optical switches. We’re also showcasing other new products for the ROG Ace esports collection, a peripheral lineup dedicated to delivering the best performance for esports gaming. A Moonlight White version of the ROG Harpe Ace Aim Lab Edition is added to the midst, and now also supports the ROG Omni Receiver. Additionally, we’re introducing two new mouse pads to the lineup: the ROG Moonstone Ace L, a large sized mouse pad featuring a tempered glass surface for ultra-fast glides, and the ROG Hone Ace XXL, which is an extended, table-sized version of the ROG Hone Ace Aim Lab Edition launched earlier this year, with an extra-soft, anti-slip polyurethane base. Cutting-edge commercial solutions At Computex 2023, we’re showcasing a range of impressive commercial solutions designed to meet the needs of modern businesses. Among the highlights are the ExpertBook B9 OLED (B9403) and ExpertBook B5 OLED (B5602) laptops, both of which offer top-of-the-line performance and sleek, professional designs. The ExpertBook B9 OLED boasts a 14-inch OLED display with a 2.8K resolution, making it perfect for professionals who demand exceptional image quality. With a weight of just 990 g and a slim 15.78 mm profile, it is highly portable and easy to carry around. The ExpertBook B5 OLED, on the other hand, is designed for professionals who need a reliable laptop for everyday use. Weighing merely 1.4 kg, the ExpertBook B5 OLED is the world’s lightest 16-inch business laptop, featuring a 4K OLED display and a 13th Gen Intel Core i7 processor. In addition, this year we’re introducing the ASUS Pre-Deployment Service (APDS) and ASUS Endpoint Management Service (AEMS), two complete services for modern IT management. These business solution services provide a suite of enterprise-grade security and management tools to help businesses protect their sensitive data and streamline their IT operations. The services include features such as data encryption, endpoint management, and remote device management, which help to streamline operations and boost productivity. Ideal for education and built with flexibility in mind, the ASUS BR1402F is the world’s first 14-inch 2-in-1 rugged laptop for education. Designed for K-12 students, this device boasts a rugged 14-inch form factor with protective features, upgradable memory and storage, a technician-friendly modular design, a touchscreen panel, ASUS Antimicrobial Guard protection, and easy-charging USB-C® ports for uninterrupted learning. For Computex 2023, we’re also highlighting our reliable and easy-to-use business network solution, the ASUS ExpertWiFi series. The lineup includes the ExpertWiFi EBG15 wired router, the ExpertWiFi EBR63 wireless router, the ExpertWiFi EBP15 PoE switch, the ExpertWiFi EBA63 PoE access point, and the ExpertWiFi EBM68 mesh WiFi system. These devices offer ease of use, easy scalability, and extendibility, as well as low total cost of ownership, making them perfect for businesses looking to establish their networks without requiring specialized networking knowledge. The ExpertWiFi series provides a Self-Defined Network, offering pre-set WiFi network profiles that allow businesses to easily create multiple WiFi networks with suitable settings for different usages. It also includes a customizable guest portal, commercial-grade network security, site-to-site VPN, and support for a dual WAN connection, ensuring an always-on network by connecting the USB port to a USB dongle or to a smartphone with personal hotspot. The new ASUS RT-BE96U WiFi 7 router and ZenWiFi BQ16 Pro WiFi 7 mesh systems, which offer speeds up to 19000 Mbps and 30000 Mbps respectively, will also be featured. Visitors will also be able to see the ASUS RT-AX57 Go during the event. This compact-sized device provides fast on-the-go WiFi with up to 3000 Mbps speed and comprehensive security protection. It is the perfect companion for business trips thanks to its portability and ability to connect to a secured VPN network simply by plugging in an Ethernet cable. Additionally, ASUS has teamed up with Siemens to provide a smart manufacturing solution, with ASUS offering a 2U server to support Siemens’s initiative from Q1 2023. Both companies will collaborate to provide additional solutions, with ASUS expanding its server portfolio by releasing the latest 5G edge servers, NVIDIA HGX 8 GPU servers, and PCIe® GPU servers. ASUS will host a server VIP room at 504b, Hall 1, Nangang Exhibition Center during Computex. Making sustainability a priority We’re fully committed to sustainability, and we continuously search for innovative methods to decrease our environmental footprint and achieve a net-zero impact. This approach revolves around four main principles: climate action, circular economy, responsible manufacturing, and value creation. We continuously leverage our technological expertise, data-driven methodology, and human-centric approach to develop a net-zero enterprise that supports a circular economy and a responsible supply chain that creates shared value for all. By 2035, we aim to have 100% renewable energy use across all our global operations and achieve net zero by 2050. Additionally, throughout 2022 ASUS laptops exceeded ENERGY STAR® efficiency standards by an average of 34%, and ASUS was listed in the 2023 Corporate Knights Clean200 Index. To further our net-zero roadmap, we’ve expanded our range of eco-friendly products, including the world’s first commercial carbon footprint and carbon-neutral laptop, the ExpertBook B9 (B9400), and the world’s slimmest OLED laptop, the Zenbook S 13 OLED (UX5304), which is also carbon neutral. These products incorporate multiple environmentally friendly materials, such as post-consumer recycled plastic, post-industrial recycled metal, FSC™ Mix-certified packaging, and use nature-based carbon credits to offset residual emissions. The company verifies all this with SGS, a world leader in verification, inspection, and testing. For Computex 2023, we have unveiled our latest initiative towards a net zero roadmap with the introduction of a carbon offset service. ASUS Carbon Partner Services enable commercial customers to offset carbon emissions associated with their ASUS products. The service provides an end-to-end delivery service, with reliable quality, accountability, assurance, transparency, flexibility, and competitive pricing. Initially, the service will focus on commercial notebooks and desktops, starting with the ExpertBook B9 OLED (B9403) and D9 Series (D900MDR and D900SDR). We’re proud to showcase our commitment to sustainability through two carbon neutral laptops and a range of environmentally friendly products. Among the models on view, the ASUS BE279QSK meets ENERGY STAR standards and stands out as the ‘Most Efficient’ display in 2022 and 2023 — it is verified by TCO and EPEAT, and it’s made with 85% post-consumer recycled plastic. The ASUS Mini PC PB62 demonstrates energy-saving and eco-friendly designs, certified by ENERGY STAR and verified as EPEAT Gold. Beyond tech products, ASUS will showcase the ProArt Backpack, made of recycled polyester fabric (rPET), which requires fewer resources and generates less CO2 emissions during production, resulting in 80% energy savings compared to a regular bag.","filter_flag":1}
{"title":"Vulcan and Stellantis in Joint Project to Develop Geothermal Renewable Energy to Supply Mulhouse Plant in France - Stellantis.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMitgFodHRwczovL3d3dy5tZWRpYS5zdGVsbGFudGlzLmNvbS9lbS1lbi9jb3Jwb3JhdGUtY29tbXVuaWNhdGlvbnMvcHJlc3MvdnVsY2FuLWFuZC1zdGVsbGFudGlzLWluLWpvaW50LXByb2plY3QtdG8tZGV2ZWxvcC1nZW90aGVybWFsLXJlbmV3YWJsZS1lbmVyZ3ktdG8tc3VwcGx5LW11bGhvdXNlLXBsYW50LWluLWZyYW5jZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMitgFodHRwczovL3d3dy5tZWRpYS5zdGVsbGFudGlzLmNvbS9lbS1lbi9jb3Jwb3JhdGUtY29tbXVuaWNhdGlvbnMvcHJlc3MvdnVsY2FuLWFuZC1zdGVsbGFudGlzLWluLWpvaW50LXByb2plY3QtdG8tZGV2ZWxvcC1nZW90aGVybWFsLXJlbmV3YWJsZS1lbmVyZ3ktdG8tc3VwcGx5LW11bGhvdXNlLXBsYW50LWluLWZyYW5jZdIBAA?oc=5","id":"CBMitgFodHRwczovL3d3dy5tZWRpYS5zdGVsbGFudGlzLmNvbS9lbS1lbi9jb3Jwb3JhdGUtY29tbXVuaWNhdGlvbnMvcHJlc3MvdnVsY2FuLWFuZC1zdGVsbGFudGlzLWluLWpvaW50LXByb2plY3QtdG8tZGV2ZWxvcC1nZW90aGVybWFsLXJlbmV3YWJsZS1lbmVyZ3ktdG8tc3VwcGx5LW11bGhvdXNlLXBsYW50LWluLWZyYW5jZdIBAA","guidislink":false,"published":"Wed, 31 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=151, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMitgFodHRwczovL3d3dy5tZWRpYS5zdGVsbGFudGlzLmNvbS9lbS1lbi9jb3Jwb3JhdGUtY29tbXVuaWNhdGlvbnMvcHJlc3MvdnVsY2FuLWFuZC1zdGVsbGFudGlzLWluLWpvaW50LXByb2plY3QtdG8tZGV2ZWxvcC1nZW90aGVybWFsLXJlbmV3YWJsZS1lbmVyZ3ktdG8tc3VwcGx5LW11bGhvdXNlLXBsYW50LWluLWZyYW5jZdIBAA?oc=5\" target=\"_blank\">Vulcan and Stellantis in Joint Project to Develop Geothermal Renewable Energy to Supply Mulhouse Plant in France<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Stellantis.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Vulcan and Stellantis in Joint Project to Develop Geothermal Renewable Energy to Supply Mulhouse Plant in France - Stellantis.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMitgFodHRwczovL3d3dy5tZWRpYS5zdGVsbGFudGlzLmNvbS9lbS1lbi9jb3Jwb3JhdGUtY29tbXVuaWNhdGlvbnMvcHJlc3MvdnVsY2FuLWFuZC1zdGVsbGFudGlzLWluLWpvaW50LXByb2plY3QtdG8tZGV2ZWxvcC1nZW90aGVybWFsLXJlbmV3YWJsZS1lbmVyZ3ktdG8tc3VwcGx5LW11bGhvdXNlLXBsYW50LWluLWZyYW5jZdIBAA?oc=5\" target=\"_blank\">Vulcan and Stellantis in Joint Project to Develop Geothermal Renewable Energy to Supply Mulhouse Plant in France<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Stellantis.com<\/font>","source.href":"https:\/\/www.media.stellantis.com","source.title":"Stellantis.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Vulcan and Stellantis sign fourth agreement together after: a binding lithium hydroxide supply agreement signed in 2021 an equity investment and lithium hydroxide supply agreement in 2022 a joint renewable energy project development term sheet for the Stellantis Rüsselsheim plant in Germany signed in 2023 Agreement represents first joint project in France for the potential use of geothermal energy to decarbonize and localize the energy supply for Stellantis’ European operations Stellantis’ ambitious decarbonization strategy includes achieving carbon net zero by 2038 with a 50% reduction by end of the decade Vulcan is developing integrated lithium chemicals and geothermal renewable energy production, from its Zero Carbon Lithium™ Project in the Upper Rhine Valley in Germany and France with its sorption-type direct lithium extraction (DLE) optimization plant under construction in Germany following two years of successful pilot plant operations Agreement with Stellantis increases Vulcan’s decarbonizing impact on the European electric vehicle industry, complementing the carbon avoidance from its Zero Carbon Lithium™ Project AMSTERDAM, May 31, 2023 – Stellantis N.V. and Vulcan Energy Resources Limited have signed a binding term sheet for the first phase of a multiphase project to develop new geothermal projects aimed at decarbonizing the energy mix of Stellantis’ Mulhouse industrial site in France, which is home to the DS 7, Peugeot 308 and e-308, 508, and the new 408. Based upon current assumptions, the project could provide a significant portion of the industrial site’s annual energy needs starting in 2026. “We are proud to announce another step in our partnership with Vulcan, which demonstrates our commitment to increase the use of decarbonized energy solutions across our facilities,” said Arnaud Deboeuf, Stellantis Chief Manufacturing Officer. “Geothermal is one of many solutions we are exploring to achieve our carbon net zero goal by 2038, in alignment with our Dare Forward 2030 strategic plan.” The first phase of the project, located at the southernmost extent of Vulcan’s focus area in the Upper Rhine Valley, will include a pre-feasibility study (PFS) for the construction of geothermal renewable energy assets for Stellantis’ facility, carried out by Vulcan which will also assess potential for lithium production. If successful, the next phase will focus on 3D seismic exploration and more advanced studies and development. Subject to a successful PFS, Stellantis and Vulcan aim to develop the project jointly on a 50:50 basis. In November 2022, Vulcan announced that it had started a number of initiatives to expand its geothermal renewable energy and Zero Carbon Lithium™ business into France and specifically Alsace, which accounts for roughly one third of the Upper Rhine Graben. Vulcan has applied over the Mulhouse area for an exclusive lithium and geothermal license to secure another 480 km² of development area within the Upper Rhine Graben Valley Brine Field. According to the term sheet, Vulcan’s team will perform a lithium mineral resource assessment according to the JORC Code. Vulcan Zero Carbon LithiumTM project is aligned with the creation of the “French Mineral Resources Observatory” that aims to analyse the French critical raw materials resources and provide recommendations for public investment that will be supported by the recently announced new 2 billion euro “French Critical Raw Materials Fund”. Stellantis embraces a holistic approach to decarbonization and is on track to become a carbon net zero corporation, all scopes included, by 2038 , with single-digit percentage compensation of remaining emissions. The agreement with Vulcan Energy marks Stellantis’ second potential use of renewable geothermal energy to decarbonize and localize its energy supply at an industrial site. “Vulcan’s core mission is decarbonisation, through renewable energy and carbon neutral lithium supply,” said Vulcan Managing Director and CEO, Dr. Francis Wedin. “Vulcan is here to support Stellantis, our largest lithium customer and one of our major shareholders, to decarbonise its operations in Europe. While we remain focused on our Phase One geothermal-lithium developments in the center of the Upper Rhine Valley Brine Field, this project is a complementary opportunity to expand our future development pipeline to some of the outer lying areas in the Upper Rhine Valley, supported by industrial partners like Stellantis.” “Stellantis is a major industrial player in the automotive sector in the Grand Est. This is why the Region wanted to support the group in its transition to electric. With this strategic partnership, transformation to create the industry of the future and the fight against global warming are taking shape in our Region thanks to a rational exploitation of geothermal energy,” said Franck Leroy, President of the Grand Est Region. The agreement with Stellantis also increases Vulcan’s decarbonizing impact on the European electric vehicle industry, complementing the carbon avoidance from its Zero Carbon Lithium™ Project, and creating shareholder value. # # # About Stellantis Stellantis N.V. (NYSE: STLA \/ Euronext Milan: STLAM \/ Euronext Paris: STLAP) is one of the world’s leading automakers and a mobility provider. Its storied and iconic brands embody the passion of their visionary founders and today’s customers in their innovative products and services, including Abarth, Alfa Romeo, Chrysler, Citroën, Dodge, DS Automobiles, Fiat, Jeep®, Lancia, Maserati, Opel, Peugeot, Ram, Vauxhall, Free2move and Leasys. Powered by our diversity, we lead the way the world moves – aspiring to become the greatest sustainable mobility tech company, not the biggest, while creating added value for all stakeholders as well as the communities in which it operates. For more information, visit www.stellantis.com. About Vulcan Founded in 2018, Vulcan’s unique Zero Carbon Lithium™ Project aims to decarbonise lithium production, through developing the world’s first net carbon neutral business, with the co-production of renewable geothermal energy on a mass scale. By adapting existing technologies to efficiently extract lithium from geothermal brine, Vulcan aims to deliver a local source of sustainable lithium for Europe, built around a net zero carbon strategy with strict exclusion of fossil fuels. Already an operational renewable energy producer, Vulcan will also provide renewable electricity and heat to local communities. Vulcan’s combined geothermal energy and lithium resource is the largest in Europe18F4, with license areas focused on the Upper Rhine Valley, Germany. Strategically placed in the heart of the European electric vehicle market to decarbonise the supply chain, Vulcan is rapidly advancing the Zero Carbon Lithium™ Project to target timely market entry, with the ability to expand to meet the unprecedented demand that is building in the European markets. Guided by our Values of Integrity, Leadership, Future-focused and Sustainability, and united by a passion for environmentalism and leveraging scientific solutions, Vulcan has a unique, world-leading scientific and commercial team in the fields of lithium chemicals and geothermal renewable energy. Vulcan is committed to partnering with organisations that share its decarbonisation ambitions and has binding lithium offtake agreements with some of the largest cathode, battery, and automakers in the world. As a motivated disruptor, Vulcan aims to leverage its multidisciplinary expert team, leading geothermal technology and position in the European EV supply chain to be a global leader in producing zero fossil fuel, net carbon neutral lithium while being nature positive. Vulcan aims to be the largest, most preferred, strategic supplier of lithium chemicals and renewable power and heating from Europe, for Europe; to empower a net zero carbon future. Contacts: Stellantis Fernão Silveira Stellantis Global Communications +31 6 43 25 43 41 fernao.silveira@stellantis.com Valerie Gillot Stellantis France Communications +33 6 83 92 92 96 valerie.gillot@stellantis.com Vulcan International Annabel Roedhammer Director Communications and Investor Relations aroedhammer@v-er.eu +49 1511 4101585 Germany Mareike Inhoff PR Manager minhoff@v-er.eu France Vincent Ledoux Pedailles vpedailles@v-er.eu +44 7551 522444 STELLANTIS FORWARD-LOOKING STATEMENTS This communication contains forward-looking statements. In particular, statements regarding future events and anticipated results of operations, business strategies, the anticipated benefits of the proposed transaction, future financial and operating results, the anticipated closing date for the proposed transaction and other anticipated aspects of our operations or operating results are forward-looking statements. These statements may include terms such as “may”, “will”, “expect”, “could”, “should”, “intend”, “estimate”, “anticipate”, “believe”, “remain”, “on track”, “design”, “target”, “objective”, “goal”, “forecast”, “projection”, “outlook”, “prospects”, “plan”, or similar terms. Forward-looking statements are not guarantees of future performance. Rather, they are based on Stellantis’ current state of knowledge, future expectations and projections about future events and are by their nature, subject to inherent risks and uncertainties. They relate to events and depend on circumstances that may or may not occur or exist in the future and, as suh, undue reliance should not be placed on them. Actual results may differ materially from those expressed in forward-looking statements as a result of a variety of factors, including: the impact of the COVID-19 pandemic, the ability of Stellantis to launch new products successfully and to maintain vehicle shipment volumes; changes in the global financial markets, general economic environment and changes in demand for automotive products, which is subject to cyclicality; changes in local economic and political conditions, changes in trade policy and the imposition of global and regional tariffs or tariffs targeted to the automotive industry, the enactment of tax reforms or other changes in tax laws and regulations; Stellantis’ ability to expand certain of their brands globally; its ability to offer innovative, attractive products; its ability to develop, manufacture and sell vehicles with advanced features including enhanced electrification, connectivity and autonomous-driving characteristics; various types of claims, lawsuits, governmental investigations and other contingencies, including product liability and warranty claims and environmental claims, investigations and lawsuits; material operating expenditures in relation to compliance with environmental, health and safety regulations; the intense level of competition in the automotive industry, which may increase due to consolidation; exposure to shortfalls in the funding of Stellantis’ defined benefit pension plans; the ability to provide or arrange for access to adequate financing for dealers and retail customers and associated risks related to the establishment and operations of financial services companies; the ability to access funding to execute Stellantis’ business plans and improve its businesses, financial condition and results of operations; a significant malfunction, disruption or security breach compromising information technology systems or the electronic control systems contained in Stellantis’ vehicles; Stellantis’ ability to realize anticipated benefits from joint venture arrangements; disruptions arising from political, social and economic instability; risks associated with our relationships with employees, dealers and suppliers; increases in costs, disruptions of supply or shortages of raw materials, parts, components and systems used in Stellantis’ vehicles; developments in labor and industrial relations and developments in applicable labor laws; exchange rate fluctuations, interest rate changes, credit risk and other market risks; political and civil unrest; earthquakes or other disasters; risks and other items described in the Company’s Annual Report on Form 20-F for the year ended December 31, 2022 and Current Reports on Form 6-K and amendments thereto filed with the SEC; and other risks and uncertainties. Any forward-looking statements contained in this communication speak only as of the date of this document and Stellantis disclaims any obligation to update or revise publicly forward-looking statements. Further information concerning Stellantis and its businesses, including factors that could materially affect Stellantis’ financial results, is included in Stellantis’ reports and filings with the U.S. Securities and Exchange Commission and AFM. VULCAN DISCLAIMER Some of the statements appearing in this announcement may be in the nature of forward-looking statements. You should be aware that such statements are only predictions and are subject to inherent risks and uncertainties. Those risks and uncertainties include factors and risks specific to the industries in which Vulcan operates and proposes to operate as well as general economic conditions, prevailing exchange rates and interest rates and conditions in the financial markets, among other things. Actual events or results may differ materially from the events or results expressed or implied in any forward-looking statement. No forward-looking statement is a guarantee or representation as to future performance or any other future matters, which will be influenced by a number of factors and subject to various uncertainties and contingencies, many of which will be outside Vulcan’s control. Vulcan does not undertake any obligation to update publicly or release any revisions to these forward-looking statements to reflect events or circumstances after today's date or to reflect the occurrence of unanticipated events. No representation or warranty, express or implied, is made as to the fairness, accuracy, completeness or correctness of the information, opinions or conclusions contained in this announcement. To the maximum extent permitted by law, none of Vulcan, its Directors, employees, advisors or agents, nor any other person, accepts any liability for any loss arising from the use of the information contained in this announcement. You are cautioned not to place undue reliance on any forward-looking statement. The forward-looking statements in this announcement reflect views held only as at the date of this announcement. This announcement is not an offer, invitation or recommendation to subscribe for, or purchase securities by Vulcan. Nor does this announcement constitute investment or financial product advice (nor tax, accounting or legal advice) and is not intended to be used for the basis of making an investment decision. Investors should obtain their own advice before making any investment decision.","filter_flag":1}
{"title":"Old tyres can become a climate-friendly fuel - The Economist","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LmVjb25vbWlzdC5jb20vc2NpZW5jZS1hbmQtdGVjaG5vbG9neS8yMDIzLzA1LzI0L29sZC10eXJlcy1jYW4tYmVjb21lLWEtY2xpbWF0ZS1mcmllbmRseS1mdWVs0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LmVjb25vbWlzdC5jb20vc2NpZW5jZS1hbmQtdGVjaG5vbG9neS8yMDIzLzA1LzI0L29sZC10eXJlcy1jYW4tYmVjb21lLWEtY2xpbWF0ZS1mcmllbmRseS1mdWVs0gEA?oc=5","id":"CBMiaGh0dHBzOi8vd3d3LmVjb25vbWlzdC5jb20vc2NpZW5jZS1hbmQtdGVjaG5vbG9neS8yMDIzLzA1LzI0L29sZC10eXJlcy1jYW4tYmVjb21lLWEtY2xpbWF0ZS1mcmllbmRseS1mdWVs0gEA","guidislink":false,"published":"Wed, 24 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=24, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=144, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LmVjb25vbWlzdC5jb20vc2NpZW5jZS1hbmQtdGVjaG5vbG9neS8yMDIzLzA1LzI0L29sZC10eXJlcy1jYW4tYmVjb21lLWEtY2xpbWF0ZS1mcmllbmRseS1mdWVs0gEA?oc=5\" target=\"_blank\">Old tyres can become a climate-friendly fuel<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Economist<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Old tyres can become a climate-friendly fuel - The Economist","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LmVjb25vbWlzdC5jb20vc2NpZW5jZS1hbmQtdGVjaG5vbG9neS8yMDIzLzA1LzI0L29sZC10eXJlcy1jYW4tYmVjb21lLWEtY2xpbWF0ZS1mcmllbmRseS1mdWVs0gEA?oc=5\" target=\"_blank\">Old tyres can become a climate-friendly fuel<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Economist<\/font>","source.href":"https:\/\/www.economist.com","source.title":"The Economist","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"G ETTING rid of old tyres has long been a problem. Every year more than a billion reach the end of the road. Until recently, most were thrown into landfills or piled up in storage yards, which occasionally caught fire. Tougher environmental laws mean many countries now insist tyres are recycled. And they are, sort of. Some of the methods might be better than dumping them, but they are not especially green. Energy recovery is one common method. This involves burning tyres in an incinerator to generate electricity, or as a supplementary fuel to provide heat for cement kilns and other industrial processes. But that produces planet-warming pollution. Tyres can be used whole or shredded in construction projects, such as building embankments or repairing roads. There are, however, concerns about chemicals from the tyres leaching out and contaminating the ground.","filter_flag":1}
{"title":"Logitech Offers First Ever MX Keyboard Combo with New Software to Increase Flow and Productivity - businesswire.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimQFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDUzMTAwNTI2NS9lbi9Mb2dpdGVjaC1PZmZlcnMtRmlyc3QtRXZlci1NWC1LZXlib2FyZC1Db21iby13aXRoLU5ldy1Tb2Z0d2FyZS10by1JbmNyZWFzZS1GbG93LWFuZC1Qcm9kdWN0aXZpdHnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimQFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDUzMTAwNTI2NS9lbi9Mb2dpdGVjaC1PZmZlcnMtRmlyc3QtRXZlci1NWC1LZXlib2FyZC1Db21iby13aXRoLU5ldy1Tb2Z0d2FyZS10by1JbmNyZWFzZS1GbG93LWFuZC1Qcm9kdWN0aXZpdHnSAQA?oc=5","id":"CBMimQFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDUzMTAwNTI2NS9lbi9Mb2dpdGVjaC1PZmZlcnMtRmlyc3QtRXZlci1NWC1LZXlib2FyZC1Db21iby13aXRoLU5ldy1Tb2Z0d2FyZS10by1JbmNyZWFzZS1GbG93LWFuZC1Qcm9kdWN0aXZpdHnSAQA","guidislink":false,"published":"Wed, 31 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=151, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimQFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDUzMTAwNTI2NS9lbi9Mb2dpdGVjaC1PZmZlcnMtRmlyc3QtRXZlci1NWC1LZXlib2FyZC1Db21iby13aXRoLU5ldy1Tb2Z0d2FyZS10by1JbmNyZWFzZS1GbG93LWFuZC1Qcm9kdWN0aXZpdHnSAQA?oc=5\" target=\"_blank\">Logitech Offers First Ever MX Keyboard Combo with New Software to Increase Flow and Productivity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">businesswire.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Logitech Offers First Ever MX Keyboard Combo with New Software to Increase Flow and Productivity - businesswire.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimQFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDUzMTAwNTI2NS9lbi9Mb2dpdGVjaC1PZmZlcnMtRmlyc3QtRXZlci1NWC1LZXlib2FyZC1Db21iby13aXRoLU5ldy1Tb2Z0d2FyZS10by1JbmNyZWFzZS1GbG93LWFuZC1Qcm9kdWN0aXZpdHnSAQA?oc=5\" target=\"_blank\">Logitech Offers First Ever MX Keyboard Combo with New Software to Increase Flow and Productivity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">businesswire.com<\/font>","source.href":"https:\/\/www.businesswire.com","source.title":"businesswire.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"LAUSANNE, Switzerland & NEWARK, Calif.--(BUSINESS WIRE)--Today, Logitech International (SIX: LOGN) (NASDAQ: LOGI) announced MX Keys S Combo, MX Keys S, and MX Anywhere 3S, the latest additions to the premium Master Series designed for advanced users, such as software developers and creative professionals. With the addition of Smart Actions, a new feature in Logi Options+, these new products – MX Keys S Combo, upgraded MX Keys S keyboard and MX Anywhere 3S mouse – achieve your “flow state,” the period of time when you feel the most productive, with greater ease. “MX Users aim to achieve a state of flow where they become fully immersed in their creative process, finding balance between the challenge of the task at hand and their individual skills,” said Anatoliy Polyanker, general manager of MX business at Logitech. “Our new Master Series products featuring Smart Actions in the Options + are designed for anyone seeking precision, speed and comfort to reach optimal performance and a feeling of enjoyment.” Smart Actions Smart Actions in the Logi Options+ App gives you the power to skip repetitive actions by automating multiple tasks with a single keystroke so you can streamline your workflow with macros. Predefined customizable Smart Actions are included to help automate common tasks to get more done. MX Keys S Combo MX Keys S Combo features the new MX Keys S keyboard, fan-favorite MX Master 3S mouse and comfortable MX Palm Rest. Better together, this set enables faster and more precise work, ideal for skilled professionals focused on high levels of creation and maximum output. The keyboard’s smart backlighting and customizable keys complement the mouse’s quiet clicks, fast and precise scrolling and 8K DPI sensor that tracks on all surfaces, including glass. MX Keys S The MX Keys S Advanced Wireless Illuminated Keyboard provides a superior low-profile typing experience from Logitech, with keys shaped for your fingertips so the keyboard delivers fast, fluid and Perfect Stroke typing in a comfortable design. Equipped with smart illumination, the backlighting detects as the hands approach to illuminate the keyboard and automatically adjust depending on the room lighting condition, which can now be personalized in the Logi Options+ app. Available in Graphite and Pale Gray, MX Keys S features an improved keyboard layout with three new keys for ultimate productivity and collaboration: talk to text, mute\/unmute microphone and emoji. MX Anywhere 3S Experience the speed, precision and silence of MagSpeed electromagnetic scrolling in Logitech’s most advanced wireless compact mouse, ideal for advanced users who seek performance, portability and comfort anywhere. Enjoy Quiet Click technology, making clicking quieter than its predecessor (MX Anywhere 3). MX Anywhere 3S features an 8,000 DPI optical sensor that tracks on virtually any surface, including glass, as you move it with you to varied work spaces around the home or office. MX Anywhere 3S for Business comes with our Logi Bolt receiver to provide secure wireless and improved RF performance and includes Sync support for remote monitoring. Approach to Sustainability Logitech is committed to creating a more equitable and climate positive world by actively working to reduce our carbon impact. The design of the new MX products makes it a choice you can feel good about. The plastic parts in the MX Keys S, MX Keys S Combo and MX Anywhere 3S include certified post-consumer recycled plastic to give a second life to end-of-use plastic from old consumer electronics – minimum 11% for MX Keys S, minimum 22% for MX Master 3S (as part of MX Keys S Combo), and minimum 61% for MX Anywhere 3S. The aluminum plate inside the MX Keys S is made with renewable energy rather than fossil fuels for a lower carbon impact. The paper packaging comes from FSC™-certified forests and other controlled sources. By choosing this product, you are supporting responsible management of the world’s forests. All Logitech products are certified carbon neutral and use renewable energy where possible during manufacturing. When you purchase a Logitech product, the carbon footprint of that product has been reduced to zero by supporting forestry, renewables and climate-impacted communities. Pricing and Availability The MX Keys S, MX Keys S Combo and MX Anywhere 3S will be available globally in early June 2023 on logitech.com and at other global retailers. The suggested retail price for the MX Keys S is $109.99, the MX Keys S Combo is $199.99 and the MX Anywhere 3S is $79.99. The Logi Options+ app is available for download for free at logi.com\/optionsplus. MX Anywhere 3S for Business will be available globally at $89.99. About Logitech Logitech helps all people pursue their passions and is committed to doing so in a way that is good for people and the planet. We design hardware and software solutions that help businesses thrive and bring people together when working, creating, gaming and streaming. Founded in 1981 and headquartered in Lausanne, Switzerland, Logitech International is a Swiss public company listed on the SIX Swiss Exchange (LOGN) and on the Nasdaq Global Select Market (LOGI). Find Logitech and more of its business products and enterprise solutions at www.logitech.com\/business, the company blog, Logitech Business or @LogitechBiz. Logitech and other Logitech marks are trademarks or registered trademarks of Logitech Europe S.A and\/or its affiliates in the U.S. and other countries. All other trademarks are the property of their respective owners. For more information about Logitech and its products, visit the company’s website at www.logitech.com.","filter_flag":1}
{"title":"Japan's newest vending machine absorbs CO2 from the environment - Japan Today","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vamFwYW50b2RheS5jb20vY2F0ZWdvcnkvbmF0aW9uYWwvamFwYW4lRTIlODAlOTlzLW5ld2VzdC12ZW5kaW5nLW1hY2hpbmUtYWJzb3Jicy1jbzItZnJvbS10aGUtZW52aXJvbm1lbnTSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vamFwYW50b2RheS5jb20vY2F0ZWdvcnkvbmF0aW9uYWwvamFwYW4lRTIlODAlOTlzLW5ld2VzdC12ZW5kaW5nLW1hY2hpbmUtYWJzb3Jicy1jbzItZnJvbS10aGUtZW52aXJvbm1lbnTSAQA?oc=5","id":"CBMicGh0dHBzOi8vamFwYW50b2RheS5jb20vY2F0ZWdvcnkvbmF0aW9uYWwvamFwYW4lRTIlODAlOTlzLW5ld2VzdC12ZW5kaW5nLW1hY2hpbmUtYWJzb3Jicy1jbzItZnJvbS10aGUtZW52aXJvbm1lbnTSAQA","guidislink":false,"published":"Sun, 21 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=141, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vamFwYW50b2RheS5jb20vY2F0ZWdvcnkvbmF0aW9uYWwvamFwYW4lRTIlODAlOTlzLW5ld2VzdC12ZW5kaW5nLW1hY2hpbmUtYWJzb3Jicy1jbzItZnJvbS10aGUtZW52aXJvbm1lbnTSAQA?oc=5\" target=\"_blank\">Japan's newest vending machine absorbs CO2 from the environment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Japan Today<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Japan's newest vending machine absorbs CO2 from the environment - Japan Today","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vamFwYW50b2RheS5jb20vY2F0ZWdvcnkvbmF0aW9uYWwvamFwYW4lRTIlODAlOTlzLW5ld2VzdC12ZW5kaW5nLW1hY2hpbmUtYWJzb3Jicy1jbzItZnJvbS10aGUtZW52aXJvbm1lbnTSAQA?oc=5\" target=\"_blank\">Japan's newest vending machine absorbs CO2 from the environment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Japan Today<\/font>","source.href":"https:\/\/japantoday.com","source.title":"Japan Today","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"By Oona McGee, SoraNews24 Japan is known around the world for its vast array of vending machines, selling everything from plastic food samples right through to scary stories. Now, though, there’s a new type of vending machine attracting attention, and it’s not what it sells but how it sells that’s making headlines. The new machine, developed by beverages giant Asahi, paves the way for a new era in automatic vending systems, because it actually absorbs carbon dioxide (CO2) from the atmosphere. What’s more, the CO2 absorbed by the machine will then be used to make industrial materials such as fertilizer and concrete, some of which will be utilized in the building of seaweed beds in the sea, creating a “blue carbon ecosystem”. Asahi says this is the first-ever machine of its type in Japan to contribute to “the realization of a decarbonised society”. Making the initiative even more impressive is the fact that it’s now past the initial development stage, with patents pending for both the CO2-absorbing vending machine and the CO2-resource recycling initiative that utilizes the vending machine. That means the new machines are ready to be deployed out in the wild, with Asahi planning to install a total of 30 machines in places with high carbon dioxide levels, such as indoor environments, and outdoors in the Kanto and Kansai areas — the country’s most populous regions in and around Tokyo and Osaka — in order to compare and verify the amount and speed of CO2 absorption. According to Asahi, vending machines work by sucking in the surrounding air, which it then uses to cool or warm the products inside. The new machines, however, contain a special material that allows the unit to absorb only CO2 from the atmosphere, essentially giving it the same function as a tree, which also absorbs CO2 from its environment. ▼ More trees means less carbon, which creates a healthier environment, and in a hay-fever-prone country like Japan, it’s a bonus if they don’t produce pollen. Image: SoraNews24 The annual CO2 absorption per unit is expected to set off around 20 percent of the CO2 emissions from the electricity used, which is equivalent to the annual absorption of about 20 Japanese cedar trees aged 56-60 years. Following the initial rollout in June, Asahi plans for full-scale deployment of the machines from 2024. The company says it aims to continue developing materials with high CO2 absorption capacity, in order to eventually develop vending machines that are totally carbon neutral in the future. Source: PR Times Read more stories from SoraNews24. -- Synthetic fossil fuels made from light, water, and CO2 in the air tested in Osaka -- Self-freezing bottled Coca-Cola now available at convenience store vending machines in Japan -- Japanese vending machines set to become cooler than ever by selling sub-zero soft drinks © SoraNews24","filter_flag":1}
{"title":"Brooks Running races into Q1 with 20% revenue growth - businesswire.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmJ1c2luZXNzd2lyZS5jb20vbmV3cy9ob21lLzIwMjMwNTAzMDA1MjAxL2VuL0Jyb29rcy1SdW5uaW5nLXJhY2VzLWludG8tUTEtd2l0aC0yMC1yZXZlbnVlLWdyb3d0aNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmJ1c2luZXNzd2lyZS5jb20vbmV3cy9ob21lLzIwMjMwNTAzMDA1MjAxL2VuL0Jyb29rcy1SdW5uaW5nLXJhY2VzLWludG8tUTEtd2l0aC0yMC1yZXZlbnVlLWdyb3d0aNIBAA?oc=5","id":"CBMibGh0dHBzOi8vd3d3LmJ1c2luZXNzd2lyZS5jb20vbmV3cy9ob21lLzIwMjMwNTAzMDA1MjAxL2VuL0Jyb29rcy1SdW5uaW5nLXJhY2VzLWludG8tUTEtd2l0aC0yMC1yZXZlbnVlLWdyb3d0aNIBAA","guidislink":false,"published":"Wed, 03 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=123, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmJ1c2luZXNzd2lyZS5jb20vbmV3cy9ob21lLzIwMjMwNTAzMDA1MjAxL2VuL0Jyb29rcy1SdW5uaW5nLXJhY2VzLWludG8tUTEtd2l0aC0yMC1yZXZlbnVlLWdyb3d0aNIBAA?oc=5\" target=\"_blank\">Brooks Running races into Q1 with 20% revenue growth<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">businesswire.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Brooks Running races into Q1 with 20% revenue growth - businesswire.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmJ1c2luZXNzd2lyZS5jb20vbmV3cy9ob21lLzIwMjMwNTAzMDA1MjAxL2VuL0Jyb29rcy1SdW5uaW5nLXJhY2VzLWludG8tUTEtd2l0aC0yMC1yZXZlbnVlLWdyb3d0aNIBAA?oc=5\" target=\"_blank\">Brooks Running races into Q1 with 20% revenue growth<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">businesswire.com<\/font>","source.href":"https:\/\/www.businesswire.com","source.title":"businesswire.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Brooks builds performance gear for every speed and surface. The brand introduced the new High Point head-to-toe trail apparel collection, expanding its trail product offerings. (Photo: Business Wire) Brooks builds performance gear for every speed and surface. The brand introduced the new High Point head-to-toe trail apparel collection, expanding its trail product offerings. (Photo: Business Wire) SEATTLE--(BUSINESS WIRE)--After a record 2022, Brooks Running carried momentum into the first quarter of 2023 with 20% year-over-year global revenue growth, including a record 32% increase in the Europe, Middle East, and Africa (EMEA) region. In the first quarter, Brooks saw strong brand demand across retail channels as it overcame pandemic-related supply chain and inventory hurdles, and brought innovation to market through new products and experiences. Through quarter end, Brooks again ranked as the top brand at U.S. retail in adult performance running footwear, maintaining 23% retail share at market.1 The Ghost and Adrenaline GTS were the top two franchise lines sold, together accounting for more than 13% share in adult performance run.2 Brooks also captured strong momentum in the U.S. specialty run channel, with year-over-year revenue up 42% in the first quarter. In direct e-commerce, Brooks’ Q1 global revenue grew 33% year over year. “In the face of continued uncertainty in the global consumer marketplace, the premium running category remains a bright spot as getting outdoors and moving is a positive force in people’s lives,” said Jim Weber, CEO. “With participation rates healthy and the demand for quality, premium product as strong as ever, Brooks is executing uniquely and earning the trust of retailers and runners. Every runner and walker deserves performance product.” Building performance gear for every speed and surface Brooks’ product innovation and human-based insights continue to shine as the brand looks to meet the evolving needs of runners. Brooks’ advancements in nitrogen-infused midsoles—now offered in its cushion, speed, and trail shoes—provide a growing community of runners with products that meet their unique needs. In January, Brooks introduced the Hyperion Max to its speed category, featuring nitrogen-infused DNA FLASH and Rapid Roll rocker technology, with plans to introduce amplified cushioning and additional rocker technology in new styles later this year. Brooks’ cushioning innovation is also winning with runners and walkers with Glycerin franchise sales up 200% year over year. The Glycerin GTS 20 took lead market share in premium priced adult running stability shoes ($150+) at U.S. retail in March.3 In April, the Glycerin 20 was named a finalist by SHAPE magazine in the Best Shoes for Walking category. Brooks expanded its performance trail product offerings with the introduction of the new High Point head-to-toe trail apparel collection. The collection is engineered to deliver optimal range of motion and weather-proof technology to meet the specific needs of trail runners. The brand also launched the Catamount 2 trail shoe, featuring a new SkyVault propulsion plate and TrailTrack rubber outsole for stability and traction on a variety of wet and dry terrain. Furthering commitment to Running Responsibly In April, Brooks issued its annual Corporate Responsibility Performance Report, which communicates the brand’s progress toward its corporate responsibility commitments. In January, Brooks’ near and long-term science-based emission targets were approved by the Science Based Targets initiative (SBTi). In accordance with those targets, Brooks reduced Scope 3 carbon emissions per unit of production by 6% from 2021. Brooks also launched the carbon neutral Ghost 15 in 2022, offsetting 53,140 metric tons of greenhouse gas emissions through high-quality offsets to make its largest volume product carbon neutral. In line with its commitment to maintain an ethical and sustainable supply chain, Brooks implemented TrusTrace, a leading traceability software, to deepen visibility across our manufacturing supply chain and help identify and mitigate responsible sourcing and business continuity risks. Also summarized in the report was Brooks’ progress against fostering a more diverse, equitable, and inclusive workplace. In 2022, Brooks’ representation of women among global employees was at 54% (up 1% from 2021 and outpacing its goal of 50%), and the company exceeded its goal of 30%+ representation of BIPOC among U.S. employees (35% in 2022). For the third consecutive year, Brooks achieved a score of 100 on the Human Rights Campaign Foundation's Corporate Equality Index, a national benchmarking tool on corporate policies, practices, and benefits pertinent to LGBTQ+ employees. Investing in the community, advancing the sport In 2022, Brooks invested $5.4 million in community impact initiatives, with a focus on supporting youth running and partners that advance people's health and wellbeing. In March, Brooks launched Future Run, its new youth running initiative to champion youth and help them discover the lifelong benefits of the run and its community. Future Run aims to reach one million young runners in the U.S. over the next five years, supported by a $10 million investment in youth running teams, organizations, and coaches. parkrun, the largest weekly free community event for runners and walkers and Brooks’ new global partner, hit a new participation record in April at over 320,000 runners and walkers worldwide. Brooks and parkrun are working together to foster continual growth of the global running community. At the 127th Boston Marathon, 10 Brooks athletes raced in the elite men’s, women’s, and para-athletic fields. In her debut marathon performance, Erika Kemp, who joined team Brooks in March, ran 2:33:57, making her the fastest U.S.-born Black woman marathoner and a trailblazer for expanding participation in the sport. Timed to Boston, Brooks launched the first-ever Des x Run Boston collection, designed in collaboration with Brooks’ Chief Running Advisor Des Linden to celebrate the five-year anniversary of her 2018 Boston Marathon win. The collection features Linden’s trusted Hyperion Tempo training shoe accented with iridescent raindrops, apparel emblazoned with her “Keep Showing Up” mantra, and a reflective, weather-proof Run Visible jacket. About Brooks Running Brooks Running creates market-leading performance footwear, apparel, run bras, and accessories distributed to runners worldwide. Brooks’ purpose is to inspire everyone to run their path by creating the best gear, tools, and experiences. Founded in 1914, the company continues to deliver accelerated product innovation and engagement with runners, walkers, and everyone who puts one foot in front of the other. Brooks is a subsidiary of Berkshire Hathaway Inc. and is headquartered in Seattle, Washington. Visit www.brooksrunning.com for more information or follow @brooksrunning.","filter_flag":1}
{"title":"Banana fibre fabric and houses made of rice: The circular innovations of May 2023 - edie.net","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmVkaWUubmV0L2JhbmFuYS1maWJyZS1mYWJyaWMtYW5kLWhvdXNlcy1tYWRlLW9mLXJpY2UtdGhlLWNpcmN1bGFyLWlubm92YXRpb25zLW9mLW1heS0yMDIzL9IBb2h0dHBzOi8vd3d3LmVkaWUubmV0L2JhbmFuYS1maWJyZS1mYWJyaWMtYW5kLWhvdXNlcy1tYWRlLW9mLXJpY2UtdGhlLWNpcmN1bGFyLWlubm92YXRpb25zLW9mLW1heS0yMDIzLz9hbXA9dHJ1ZQ?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmVkaWUubmV0L2JhbmFuYS1maWJyZS1mYWJyaWMtYW5kLWhvdXNlcy1tYWRlLW9mLXJpY2UtdGhlLWNpcmN1bGFyLWlubm92YXRpb25zLW9mLW1heS0yMDIzL9IBb2h0dHBzOi8vd3d3LmVkaWUubmV0L2JhbmFuYS1maWJyZS1mYWJyaWMtYW5kLWhvdXNlcy1tYWRlLW9mLXJpY2UtdGhlLWNpcmN1bGFyLWlubm92YXRpb25zLW9mLW1heS0yMDIzLz9hbXA9dHJ1ZQ?oc=5","id":"CBMiZmh0dHBzOi8vd3d3LmVkaWUubmV0L2JhbmFuYS1maWJyZS1mYWJyaWMtYW5kLWhvdXNlcy1tYWRlLW9mLXJpY2UtdGhlLWNpcmN1bGFyLWlubm92YXRpb25zLW9mLW1heS0yMDIzL9IBb2h0dHBzOi8vd3d3LmVkaWUubmV0L2JhbmFuYS1maWJyZS1mYWJyaWMtYW5kLWhvdXNlcy1tYWRlLW9mLXJpY2UtdGhlLWNpcmN1bGFyLWlubm92YXRpb25zLW9mLW1heS0yMDIzLz9hbXA9dHJ1ZQ","guidislink":false,"published":"Thu, 25 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=145, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmVkaWUubmV0L2JhbmFuYS1maWJyZS1mYWJyaWMtYW5kLWhvdXNlcy1tYWRlLW9mLXJpY2UtdGhlLWNpcmN1bGFyLWlubm92YXRpb25zLW9mLW1heS0yMDIzL9IBb2h0dHBzOi8vd3d3LmVkaWUubmV0L2JhbmFuYS1maWJyZS1mYWJyaWMtYW5kLWhvdXNlcy1tYWRlLW9mLXJpY2UtdGhlLWNpcmN1bGFyLWlubm92YXRpb25zLW9mLW1heS0yMDIzLz9hbXA9dHJ1ZQ?oc=5\" target=\"_blank\">Banana fibre fabric and houses made of rice: The circular innovations of May 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">edie.net<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Banana fibre fabric and houses made of rice: The circular innovations of May 2023 - edie.net","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmVkaWUubmV0L2JhbmFuYS1maWJyZS1mYWJyaWMtYW5kLWhvdXNlcy1tYWRlLW9mLXJpY2UtdGhlLWNpcmN1bGFyLWlubm92YXRpb25zLW9mLW1heS0yMDIzL9IBb2h0dHBzOi8vd3d3LmVkaWUubmV0L2JhbmFuYS1maWJyZS1mYWJyaWMtYW5kLWhvdXNlcy1tYWRlLW9mLXJpY2UtdGhlLWNpcmN1bGFyLWlubm92YXRpb25zLW9mLW1heS0yMDIzLz9hbXA9dHJ1ZQ?oc=5\" target=\"_blank\">Banana fibre fabric and houses made of rice: The circular innovations of May 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">edie.net<\/font>","source.href":"https:\/\/www.edie.net","source.title":"edie.net","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"“I believe we must base the next industrial revolution – a planned one – on the thesis that there is no such thing as waste, that waste is simply some useful substance that we do not yet have the wit to use.” It may surprise you to learn that these words are not from the past decade, during which time the concept of the circular economy has taken off in popularity, but were rather published in a March 1970 edition of the Journal Science. A circular economy is one where stakeholders are incentivised to reuse and recycle resources. It stands in contrast to a linear economic process whereby raw materials are extracted, converted into products, then thrown away at the end of their useful life. While the concept has deep roots, we today remain overwhelmingly dependent on non-circular consumption. For example, the Circularity Gap Report 2023, produced by global impact organisation Circle Economy in partnership with Deloitte, found that ‘secondary materials’ – used materials cycled back into the economy – only make up 7.2% of all material inputs. Part of the solution for delivering a circular economy is behaviour change from consumers, and supportive policy from regulators and lawmakers. But innovation in technology and processes is also essential. For this reason, and as part of edie’s focus week on the circular economy, our innovations of the month for May are all those that embody circular principles. From green chemicals made from coffee waste to a backpack made of recycled plastic and captured carbon, these solutions give meaning to the proverb ‘one man’s trash is another man’s treasure.’ Photo source GroundTruth A BACKPACK MADE FROM RECYCLED PLASTIC AND CAPTURED CARBON The outdoor recreation industry accounts for around 2% of US GDP. And although the sector promotes connection to nature, many of the materials traditionally used in outdoor apparel are unsustainable. But now materials science company GroundTruth has developed carbon-neutral, vegan, recycled plastic backpacks and carryalls that have a 10-year performance guarantee. The latest product is the 38L Hybrid Duffle Pack that incorporates the company’s latest technology – hardware that incorporates captured carbon. The packs can be carried by hand, on the back, and across the body, with bottle holders on the front of the pack to make hydrating easy. The bags also open a full 180 degrees for swift accessibility. Notably, each duffle uses 123 plastic bottles for the exterior fabric, and the interior fabric is made from recycled fishing nets. In tests, the captured carbon material performed 40% better than virgin plastic. The waterproof coating on the material contains no volatile organic compounds, and the company works with Bluesign-certified manufacturers that meet Global Recycled Standards for safe and healthy production processes. Photo source Tania Melnyczuk on Unsplash CELLULOSE-BASED INSULATION MADE FROM RECYCLED CARDBOARD The residential sector accounts for 21% of total energy consumption in the US, with over half of a house’s energy usage coming from heating and cooling. Home insulation is one of the swiftest, easiest ways to improve the energy efficiency of a home, and cellulose could be one of the best materials for preventing heat loss. Cleantech company CleanFiber uses recycled cardboard boxes – many of them from the millions of Amazon orders placed locally – as the base for its innovative new building insulation. CleanFiber insulation is made by using a proprietary liquid to separate the fibres that make up a cardboard box. The fibres are then infused with an all-borate, liquid fire-retardant before being dried and shredded. Borates help reduce smouldering and combustion should a fire break out. Adding the retardant to the insulation when it is wet creates a cleaner manufacturing process, by eliminating the need to add additional powders to the insulation after it is dried. The final product is a soft, dust-free insulation fibre and tests on building sites indicate that the cellulose insulation is easier to install because it doesn’t get caught in machinery during application. Additionally, during production, CleanFiber removes contaminants from the boxes, making the insulation better for the health of those that produce and install it, and those who live and work in buildings insulated with it. Photo source The University of East London CONSTRUCTION BLOCKS MADE FROM SUGARCANE Sugarcane is the world’s most-produced crop as of 2021 and is grown mostly for use as sugar and ethanol. Bagasse is the waste product left behind after the sugarcane is crushed to harvest the juice. Some of this leftover material is used for biofuel, but much is left to go to waste. And many of the world’s developing countries are key sugarcane producers, so finding a way to turn the bagasse waste into a valuable new product would provide significant support in further developing local economies. Now, a collaborative project based in the University of East London has brought together researchers, commercial partners, sustainability experts, and architects to create Sugarcrete, a concrete brick replacement. According to the team, if only 30% of the world’s bagasse waste was used for Sugarcrete production, the global brick industry could be completely replaced. Sugarcrete bricks are ultra-low carbon and are made by mixing bagasse with mineral binders. A fast-growing crop, sugarcane is an extremely efficient carbon sink. When combined with the low-emission manufacturing process, the final product becomes a particularly sustainable building option. The polyhedral bricks are designed to lock together to create strength without the need for additional supplies. Square slabs of the bricks are held together with only perimeter ties, and the team is working on strengthening the bricks further. The bricks meet industry standards for strength, durability, fire resistance, and thermal properties, and are four times lighter than traditional bricks with only 15% of the carbon footprint. The team has made its research open source to support communities in developing new industries to replace the need to import expensive building supplies. Photo source Mike Kenneally on Unsplash CREATING SUSTAINABLE CHEMICALS AND PRODUCTS WITH COFFEE WASTE It is estimated that 6 million tonnes of coffee grounds are sent to landfills each year, where they create methane – a greenhouse gas that has a greater impact on global warming than carbon dioxide. Now, a technology company from Warsaw, EcoBean, has created a spent coffee grounds collection service that processes waste into green raw materials and products. By doing this, the startup is extending the coffee value chain and making it more sustainable by introducing a circular economy. And for every tonne of coffee ground waste that is collected by EcoBean, 600 kilogrammes of carbon dioxide are prevented from being emitted. EcoBean processes the coffee waste into raw materials, including coffee oil, coffee lignin, lactic acid, and protein feed additives, with a focus on zero-waste production. With these green raw materials, EcoBean has developed a range of circular and sustainable coffee-based products. These usable and recyclable products include EcoBean Flowerpots and EcoBean Straws. The company has also partnered with Dutch startup You Lucky Bird (YLB) to create the You Lucky Bird eco-friendly cups, which are 100%recycled – made from coffee waste and other vegetable-derived materials. Photo source Max Ducourneau on Unsplash FABRIC PRODUCTS MADE FROM BANANA FIBRES As innovators create new sustainable fibres, the options available to those working in the fashion industry are expanding, making it easier to design and produce products with lower carbon footprints. The new fabrics are exciting, bringing with them increased options and challenges for designers. Additionally, many of the companies behind the latest offerings have broader social goals embedded into their working philosophy. Uganda’s Mawejje Creations, for instance, is a socially minded company that produces textiles made from waste banana plants, fabric offcuts, secondhand clothes, and organic cotton. The business’s Commune Fabric is made for use in fashion and consists entirely of banana crop biowaste. Much like hemp, when grown as part of a sustainable, mixed agricultural crop, the banana plant requires little to no maintenance, making it an excellent replacement for water-heavy cotton crops. Easily grown in Uganda, the banana plant requires no fertiliser or pesticides, and the production process for the fibres ensures that the final fabric is chemical-free. Mawejje Creations also trains young people in the fabric production process and encourages local farmers to use sustainable methods for the highest quality plants. Importantly, part of the training process includes learning certain styles of weaving as a means of preserving and passing along some of the area’s heritage skills. Photo source Barbara Corsico HOUSES MADE FROM RICE The International Energy Agency (IEA) estimates that the buildings and construction industry was responsible for 39% of process and energy-related carbon emissions in 2018, 11% of which come from the production of building materials. Italy-based architectural firm Ricehouse is on a mission to build houses more sustainably, by using rice by-products. The company uses natural waste residues, such as rice straw, husk, and chaff from the rice industry to create circular construction materials, including thermal insulating plasters, finishings, lightweight screeds, and prefabricated panels. Ricehouse obtains the waste directly from local farmers in northern Italy, where the company is based, and rice processing factories. The company believes that engaging in the circular economy, by turning organic waste into a source of value, is vital to green construction and sustainable built environments. And once Ricehouse’s products reach the end of their usable lives, they can either be used in new products or harmlessly returned to nature to break down. The products have high-performance acoustic insulation, as well as having high durability. And because the final rice-based products are effective thermal insulators, it will help houses achieve energy efficiency standards and cut carbon footprints associated with heating. They are also breathable and resistant to harmful biological agents such as viruses, bacteria, and fungi – making them mould-proof. Crucially, the products can be applied using traditional layering techniques and do not require the use of any specialised equipment.","filter_flag":1}
{"title":"„Made by nature, not by rules“ – Annabel Thomas about the Nc'nean Distillery - about-drinks.com - About Drinks","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LmFib3V0LWRyaW5rcy5jb20vZW4vbWFkZS1ieS1uYXR1cmUtbm90LWJ5LXJ1bGVzLWFubmFiZWwtdGhvbWFzLWFib3V0LXRoZS1uY25lYW4tZGlzdGlsbGVyeS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LmFib3V0LWRyaW5rcy5jb20vZW4vbWFkZS1ieS1uYXR1cmUtbm90LWJ5LXJ1bGVzLWFubmFiZWwtdGhvbWFzLWFib3V0LXRoZS1uY25lYW4tZGlzdGlsbGVyeS_SAQA?oc=5","id":"CBMiZ2h0dHBzOi8vd3d3LmFib3V0LWRyaW5rcy5jb20vZW4vbWFkZS1ieS1uYXR1cmUtbm90LWJ5LXJ1bGVzLWFubmFiZWwtdGhvbWFzLWFib3V0LXRoZS1uY25lYW4tZGlzdGlsbGVyeS_SAQA","guidislink":false,"published":"Wed, 17 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=137, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LmFib3V0LWRyaW5rcy5jb20vZW4vbWFkZS1ieS1uYXR1cmUtbm90LWJ5LXJ1bGVzLWFubmFiZWwtdGhvbWFzLWFib3V0LXRoZS1uY25lYW4tZGlzdGlsbGVyeS_SAQA?oc=5\" target=\"_blank\">„Made by nature, not by rules“ – Annabel Thomas about the Nc'nean Distillery - about-drinks.com<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">About Drinks<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"„Made by nature, not by rules“ – Annabel Thomas about the Nc'nean Distillery - about-drinks.com - About Drinks","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LmFib3V0LWRyaW5rcy5jb20vZW4vbWFkZS1ieS1uYXR1cmUtbm90LWJ5LXJ1bGVzLWFubmFiZWwtdGhvbWFzLWFib3V0LXRoZS1uY25lYW4tZGlzdGlsbGVyeS_SAQA?oc=5\" target=\"_blank\">„Made by nature, not by rules“ – Annabel Thomas about the Nc'nean Distillery - about-drinks.com<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">About Drinks<\/font>","source.href":"https:\/\/www.about-drinks.com","source.title":"About Drinks","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Nc’nean is an award-winning, independent organic whisky distillery in Scotland. Founded by Annabel Thomas in March 2017, it is revolutionizing the whisky industry through new flavors and carbon-neutral production in harmony with nature. The distillery became the first in the UK to achieve verified net zero carbon emissions status in July 2021. All Nc’nean products are certified organic, bottles are made from 100 percent recycled glass, and waste is almost entirely recycled or reused. Nc’nean received B Corp accreditation in February 2022 and was named “Best for World B Corp. 2022” in July 2022 for its exceptionally positive impact on the environment. We spoke with founder Annabel Thomas in an interview. She talks about the brand philosophy, products and future plans. Please briefly introduce yourself to our readers. Annabel Thomas: Hello, I’m Annabel Thomas, CEO of Nc’nean distillery. Nc’nean is an independent, organic whisky distillery on the west coast of Scotland. Could you please tell us something about the history of Nc´nean Whisky and how the idea to start your own distillery came about? Annabel Thomas: The distillery is on my parent’s farm and it started as a family idea – something we talked about around the dinner table. When I had the opportunity to take some time off from my previous job (I was a management consultant in London), I decided to do some more research on the idea, and, especially in contrast to some of the businesses I had worked with previously, I felt there was very little focus on sustainability and very much a ‘doing things the way they have always been done’ approach. Tradition is so important in Scotch but I felt there was also a role for a distillery that was focused on sustainability and with a more forward looking approach. This was the point that ‘clicked’ for me – I felt like this was something I needed to do. So without too much further thought I quit my job and set off on this epic adventure! Two years of fundraising, two years of building later and we finally started production in 2017. How is Nc´nean whisky different from other Scotch whiskies and what are its distinctive features? Annabel Thomas: From a taste perspective, there are a couple of important things – firstly it’s organic, and that generates a lovely depth of flavour and texture. Just like organic vegetables, our organic barley grows without the help of fertilizers and pesticides – richer soils and a tougher life create additional flavours in the grain and this translates through into the spirit. Secondly, we create a really delicious fruity spirit by concentrating on fermentation – using two yeasts and fermenting for up to 114 hours really allows the flavours to develop in that stage of the process. After maturation in a combination of ex-bourbon, STR red wine and sherry casks, our resulting single malt has delicious notes of citrus, soft fruits and spice. How important is it for Nc´nean Whisky to consider sustainability and environmental protection and how does that shape the whole production process? Annabel Thomas: Absolutely essential! It is the principle on which we are founded, central to our whole philosophy and deeply embedded within our team. I believe it is incumbent on any modern business to design the business around these principles – it is clear that we need to move and act quickly to combat climate change. This approach has influenced almost every stage in our production process from using local timber as a renewable source of energy for distillation, buying 100% Scottish organic barley to creating a closed loop cooling pond for our cooling water. We also bottle in 100% recycled clear glass – this was an industry first and saves 40% of the carbon emissions in its product per bottle. How does the Scottish landscape and environment influence the production of Nc´nean whisky? Annabel Thomas: On the one hand, completely, and on the other hand, not at all! We are located in such a beautiful, remote and wild part of the world that serves as much of the inspiration for continuous improvement in our sustainability. We also make a botanical spirit which includes several herbs and plants foraged from the local area (which is then combined with our new make spirit to create a really delicious spirit, in the style of a gin). But on the other hand, I am not much of a believer in some of the myths created around Scotch – and in particularly the emphasis on the water, or the regions of production seem to me to be misleading or overly complicated. We are technically in the Highlands region, but I’m not sure our whisky is typical of that! As a woman, how did you manage to succeed in such a traditionally male-dominated industry, and what challenges did you overcome along the way? Annabel Thomas: I think I have been lucky not to face too many challenges specifically because I am female (though we have faced many many challenges!). The industry is an incredibly friendly place and I have always felt welcomed by everyone – men and women. And whilst there are not many women in senior roles, there are perhaps more women in the industry than people realise. For distribution in Germany you cooperate Kirsch Whisky. What impact does this partnership have on Nc´nean Whisky’s business? Annabel Thomas: We have a fantastic partnership with Kirsch and have benefitted hugely from their knowledge of the German market. They are also fun and supportive to work with as a team! Your Organic Single Malt Scotch Whisky struck gold with 95 points at the highly regarded International Wine and Spirits Competition. Congratulations! What does this mean to you and your team? And how did you celebrate? Annabel Thomas: It is always fantastic to receive these lovely validations of our hard work – from the care the team take in the distillation and looking after our casks to the skill our blender, Matt, we love it! What does the future hold for Nc´nean Whisky and what plans do you have for new products or developments in production? Annabel Thomas: We are still early on our journey and are focused largely on spreading the Nc’nean word far and wide – we’re about to launch in the US and will consider a few countries in Asia after that. We obviously have lots of fun experiments still in the warehouse too which we are looking forward to sharing with the world as they reach maturation – be that more unique yeast trials or some interesting cask types. Watch this space… In conclusion: If you had to convince a whisky novice to try Nc´nean whisky, what would be your top three arguments for this exceptional whisky? Annabel Thomas: It’s delicious, pairs brilliantly with soda water, and you’ll be doing great things for the plant at the same time. Nc’nean Distillery | Website | Instagram | Facebook +++ We thank Annabel Thomas for the open and very interesting interview! If you too have an interesting brand, then we should talk. Just send us an email with the subject “about-drinks interview” to redaktion@about-drinks.com – we look forward to hearing from you! +++","filter_flag":1}
{"title":"What is greenwashing, and how can we avoid it? - Luxury London","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL2x1eHVyeWxvbmRvbi5jby51ay9zdHlsZS9oZXJzL3doYXQtaXMtZ3JlZW53YXNoaW5nLWFuZC1ob3ctY2FuLXdlLXNwb3QtaXQtZWNvLWZyaWVuZGx5LWVudmlyb25tZW50LXN1c3RhaW5hYmlsaXR5LWZhc2hpb24taW5kdXN0cnkv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL2x1eHVyeWxvbmRvbi5jby51ay9zdHlsZS9oZXJzL3doYXQtaXMtZ3JlZW53YXNoaW5nLWFuZC1ob3ctY2FuLXdlLXNwb3QtaXQtZWNvLWZyaWVuZGx5LWVudmlyb25tZW50LXN1c3RhaW5hYmlsaXR5LWZhc2hpb24taW5kdXN0cnkv0gEA?oc=5","id":"CBMiiwFodHRwczovL2x1eHVyeWxvbmRvbi5jby51ay9zdHlsZS9oZXJzL3doYXQtaXMtZ3JlZW53YXNoaW5nLWFuZC1ob3ctY2FuLXdlLXNwb3QtaXQtZWNvLWZyaWVuZGx5LWVudmlyb25tZW50LXN1c3RhaW5hYmlsaXR5LWZhc2hpb24taW5kdXN0cnkv0gEA","guidislink":false,"published":"Thu, 04 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=4, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=124, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL2x1eHVyeWxvbmRvbi5jby51ay9zdHlsZS9oZXJzL3doYXQtaXMtZ3JlZW53YXNoaW5nLWFuZC1ob3ctY2FuLXdlLXNwb3QtaXQtZWNvLWZyaWVuZGx5LWVudmlyb25tZW50LXN1c3RhaW5hYmlsaXR5LWZhc2hpb24taW5kdXN0cnkv0gEA?oc=5\" target=\"_blank\">What is greenwashing, and how can we avoid it?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Luxury London<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"What is greenwashing, and how can we avoid it? - Luxury London","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL2x1eHVyeWxvbmRvbi5jby51ay9zdHlsZS9oZXJzL3doYXQtaXMtZ3JlZW53YXNoaW5nLWFuZC1ob3ctY2FuLXdlLXNwb3QtaXQtZWNvLWZyaWVuZGx5LWVudmlyb25tZW50LXN1c3RhaW5hYmlsaXR5LWZhc2hpb24taW5kdXN0cnkv0gEA?oc=5\" target=\"_blank\">What is greenwashing, and how can we avoid it?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Luxury London<\/font>","source.href":"https:\/\/luxurylondon.co.uk","source.title":"Luxury London","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"The fashion industry is one of the most polluting out there. In 2022, Bloomberg reported that the sector accounts for up to ten per cent of global carbon dioxide output, and a fifth of the plastic produced globally every year. So what happens when you love fashion, but have a conscience? You look for labels with sustainable credentials – brands that recycle, use bio-based and degradable materials, minimise their water consumption, provide supply chain transparency, and so on. Sounds easy, right? Well, not so much. With sustainability rising higher on the list of consumer priorities, brands are desperate to tout their green credentials… even if they don’t really have any. Thus, marketing becomes a minefield of half-truths, vagaries and deliberately nebulous claims, making it harder than ever to decipher whether or not a company actually cares about the environment, or just shareholder profits. Here’s how to navigate the maze. What is greenwashing? “Greenwashing is when companies make sustainability claims without evidence – this could be from a social and or environmental standpoint,” says Diana Verde Nieto, co-founder and co-CEO at sustainability group Positive Luxury. The term was coined by Jay Westerveld in 1986. He was staying in a hotel that encouraged guests to reuse their towels in the name of the environment, which struck him as ironic considering the establishment’s many other unsustainable practices. Greenwashing is a play on whitewashing, which means hiding or falsifying a situation to make it seem better than it is; companies that greenwash convey a distorted impression of how green their products or practices really are. Trainer company Veja is a B Corp. Image: Vincent Desailly Why do companies greenwash? Greenwashing is an attempt to capitalise on the growing demand for environmentally-friendly products. Companies that do it are “tapping into the customer appeal of being sustainable,” says Verde Nieto. When you look at the numbers, the motive becomes clear. According to GreenPrint’s 2021 Business of Sustainability Index, 64 per cent of Gen X consumers would be willing to pay extra for products deemed green; that figure jumps to 75 per cent for Millennials. A Deloitte survey found that 34 per cent of shoppers had stopped purchasing from certain brands due to ethical concerns. In the UK, the Competition and Market Authority says more than half of consumers take sustainability claims into account when making purchasing decisions. Examples of greenwashing The practice goes back as far as the mid-’80s and the infamous case of Chevron. The oil company ran an advertising campaign showing employees protecting bears, butterflies and sea turtles before it emerged that, during this time, Chevron was actively violating the Clean Air and Clean Water Act. In 1991, chemical company DuPont came out with a similarly ironic campaign, announcing the launch of its double-hulled oil tankers with adverts featuring marine animals prancing in chorus to Beethoven’s Ode to Joy. The company was the largest corporate polluter in the US that year. In a 2015 case that took greenwashing to a pretty extreme conclusion, Volkswagen admitted to cheating emissions tests by fitting vehicles with software that could detect when it was undergoing testing and reduce emissions – all while touting the green credentials of the model. Ninety Percent puts 90 per cent of its profits towards charitable and sustainable initiatives In recent years, fast fashion has emerged as a big greenwashing culprit; in a 2021 report, Changing Markets Foundation claimed that as many as 59 per cent of all environmental claims by European and UK fashion brands are misleading. Last year, Zara sparked suspicion for failing to release internal audits after committing to switch to 100 per cent renewable electric energy. H&M and Decathlon, too, have had to revise environmental claims after investigations by The Netherlands’ Authority for Consumer Markets; both promised to “adjust or no longer use sustainability claims on their clothes and\/or websites”. Ultra-fast fashion brands Boohoo and Shein have also caught heat for dubious green practices. The former’s ‘sustainable’ collaboration with Kourtney Kardashian Barker, and the latter’s decision to appoint a head of sustainability, appeared to be textbook cases of not seeing the wood for the trees. After all, what does one sustainable collection (declared so for containing an unspecified amount of recycled fibres) really mean at a brand that churns out 700 new petrochemical-manufactured styles per week, in Boohoo’s case? And surely a head of sustainability can only be symbolic at Shein, which blows its fast-fashion competitors out of the water with a staggering 10,000 new products being uploaded to its website per day, only six per cent of inventory remaining in stock for more than 90 days, and returns often going into landfill, as it’s cheaper than putting them back into circulation? How do companies greenwash? Greenwashing can manifest itself in many ways. “Companies might use misleading labelling or imagery – often nature-based or green ­– which suggests to people, even subconsciously, that a product is positive,” says Verde Nieto. “It can also look like vague statements, claims without substantiation, or misleading facts,” she continues. Brands may also use meaningless or unverifiable terminology such as ‘organic’ or ‘eco-friendly’ – alternatively, these claims may refer to only a small percentage of materials used. Labels that greenwash will advertise the use of recycled polyester, for example, in one of 30 steps in the creation of a garment, while the rest of the chain involves unsustainable methods. Stella McCartney has long been a pioneer in green and vegan garments In this vein, companies might market a small, one-off sustainable capsule in a way that implies their entire range is sustainable. They could also try to present standard industry practice as something special; for example, touting a material as having ‘chrome-free tanning’ makes it seem like an extra, green feature, when actually it’s a basic method of production. Greenwashing may also see brands cherry-picking data (or conducting biased research), or using impressive-sounding credentials that, in actual fact, don’t prove anything. Being OEKO-TEX Standard 100-certified sounds good – broadly – but all it means is that the product poses no harm to human wellbeing, and has nothing to do with the environment. Another term that sounds positive, but requires more digging into, is ‘net zero’. Companies that claim to be ‘net zero’ probably haven’t put the work in to reduce their carbon footprint; they may instead have paid for carbon offsetting, which has been found to be massively flawed. An analysis by The Guardian earlier this year suggested that more than 90 per cent of rainforest carbon offsets by the biggest certifier are worthless. Another thing to watch out for is vegan leather – just because it isn’t an animal product, it doesn’t mean it’s better for the planet. Many vegan garments are simply made out of plastic, rather than genuinely sustainable alternatives like grape or mushroom leather. How to spot – and avoid – greenwashing Buildings have energy efficiency ratings. There are health grading systems on most packaged foods in the UK – these metrics may be imperfect, but they push the needle. There’s no real, standardised rating system for environmental friendliness in fashion. So, until we get this, what can you do to ensure you’re buying sustainably? There are a number of fairly foolproof certifications you can look for, says Verde Nieto: “FSC for packaging, or the Butterfly Mark for luxury brands, show[s] they are on a journey of sustainability and ESG (environmental, social and governance) excellence. Cruelty Free ensures that the products are not tested on animals.” Is the brand a B Corp or Fair Trade certified? These organisations go some way to substantiating ethical claims. In 2021, Swarovski released a measurable and science-based six-point sustainability mission As a more general rule, Verde Nieto reminds that “when something is too good to be true, it probably is!”, and urges consumers to “question it”. If a company is shouting about a sustainable initiative, look into its wider practices. Do they live up to that one capsule or collection more broadly? The same goes for throwing around noncommittal terms like ‘eco-friendly’ with no context. Don’t be taken in by claims about production methods or random certifications: they may not mean what you think they do. Check the source of data or research. Don’t be fooled by packaging. If something is described as ‘recycled’, how much of it? If something is ‘net zero’, how have they achieved this? What is a vegan product actually made of? Can fashion brands be sustainable? What are some genuinely sustainable practices that brands can engage in? “Have ESG targets beyond net zero (carbon is just one part of the puzzle). Have an ESG baseline. Have a transitional plan in order to meet your targets,” says Verde Nieto. “Be transparent in the communication of all the above, acknowledging where there is work to do as well as the good stuff.” Take apparel and beauty brand Bamford as an example. 94 per cent of the brand’s collections are made using renewable and biodegradable fibres, produced responsibly (think certified dyestuffs and water recycling systems). Or Pangaia, which has developed materials such as FLWRDWN™ (a down alternative created from wildflowers) and C-FIBER™ (a material developed from eucalyptus pulp and seaweed). Pangaia has developed innovate eco-friendly materials Few brands have taken the plunge and rejected the seasonal cycle of fashion, which constantly renders clothes obsolete and encourages consumers to buy more. Stockholm brand Asket, however, sells a single, permanent collection of timeless pieces. Then there’s Ninety Percent, which shares 90 per cent of its profits between charitable causes and the production of sustainable materials – that’s what you call putting your money where your mouth is. The concept behind Re\/Done, meanwhile, is repurposing old jeans, while footwear brand Alohas operates an on-demand shopping platform, meaning that users order in advance of production to eliminate waste. There are plenty of small brands out there whose whole raison d’etre is sustainability. But what about brands with lots of skin in the game? Can you change an established business model? Well, yes – legacy brands can engage in meaningful sustainability initiatives too, if the inclination is there. In 2021, Swarovski released a seemingly genuinely measurable and science-based six-point sustainability mission. Stella McCartney has long been a pioneer in green and vegan garments; its AW23 collection includes both mushroom and grape leather, as well as hidden QR codes that take you to details about a garment’s production – talk about transparency. Gabriela Hearst has similarly put sustainability at the heart of her brand. The designer staged the first carbon-neutral fashion show during SS20’s New York Fashion Week, and around 25 per cent of collections are made from deadstock. Gabriela Hearst staged the first carbon-neutral fashion show during SS20’s New York Fashion Week The future of greenwashing “Sustainability is now becoming a regulated area – there are rules about what companies can and cannot do, and the same applies to their communications,” says Verde Nieto. Under the soon-to-pass Digital Markets, Competition And Consumer Bill, the CMA will have the power to impose civil penalties on companies that make misleading environmental claims, which will count as a breach of consumer law. Verde Nieto believes that the days of greenwashing “are almost gone”, but, clearly, there are still hundreds of thousands of consumers willing to buy from the Sheins of the world. As long as there is demand for rock-bottom-cheap, readily-available fashion, the industry will struggle to shake its polluting reputation. That said, a crackdown on deceptive marketing may be the first stone laid in the building of a greener industry. Read more: The rise of the celebrity creative director","filter_flag":1}
{"title":"Wyke Farms to launch UK-first carbon neutral butter - The Grocer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnRoZWdyb2Nlci5jby51ay9uZXctcHJvZHVjdC1kZXZlbG9wbWVudC93eWtlLWZhcm1zLXRvLWxhdW5jaC11ay1maXJzdC1jYXJib24tbmV1dHJhbC1idXR0ZXIvNjc5NjIwLmFydGljbGXSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnRoZWdyb2Nlci5jby51ay9uZXctcHJvZHVjdC1kZXZlbG9wbWVudC93eWtlLWZhcm1zLXRvLWxhdW5jaC11ay1maXJzdC1jYXJib24tbmV1dHJhbC1idXR0ZXIvNjc5NjIwLmFydGljbGXSAQA?oc=5","id":"CBMidmh0dHBzOi8vd3d3LnRoZWdyb2Nlci5jby51ay9uZXctcHJvZHVjdC1kZXZlbG9wbWVudC93eWtlLWZhcm1zLXRvLWxhdW5jaC11ay1maXJzdC1jYXJib24tbmV1dHJhbC1idXR0ZXIvNjc5NjIwLmFydGljbGXSAQA","guidislink":false,"published":"Fri, 26 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=146, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnRoZWdyb2Nlci5jby51ay9uZXctcHJvZHVjdC1kZXZlbG9wbWVudC93eWtlLWZhcm1zLXRvLWxhdW5jaC11ay1maXJzdC1jYXJib24tbmV1dHJhbC1idXR0ZXIvNjc5NjIwLmFydGljbGXSAQA?oc=5\" target=\"_blank\">Wyke Farms to launch UK-first carbon neutral butter<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Grocer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Wyke Farms to launch UK-first carbon neutral butter - The Grocer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnRoZWdyb2Nlci5jby51ay9uZXctcHJvZHVjdC1kZXZlbG9wbWVudC93eWtlLWZhcm1zLXRvLWxhdW5jaC11ay1maXJzdC1jYXJib24tbmV1dHJhbC1idXR0ZXIvNjc5NjIwLmFydGljbGXSAQA?oc=5\" target=\"_blank\">Wyke Farms to launch UK-first carbon neutral butter<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Grocer<\/font>","source.href":"https:\/\/www.thegrocer.co.uk","source.title":"The Grocer","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Wyke Farms is to launch the UK’s first carbon neutral block butter under its Ivy’s Reserve brand. The Somerset-based supplier’s Ivy’s Reserve Salted Farmhouse Butter will be available from September, with Wyke said to be in discussions with retailers over potential listings now (rsp: TBC). The NPD will join Wyke’s carbon neutral Ivy’s Reserve Vintage Cheddar, which launched last year. The creation of a new carbon neutral butter was made possible due to investment in a new “super-efficient” butter dairy powered by home-produced renewable electricity and gas. It was both energy and water efficient, the business said. The new product is part of Wyke Farms’ five-year plan for growth, underpinned by sustainably increasing volume and strategically targeting specific export regions worldwide. Wyke Farms partnered with Carbon Trust to undertake a cradle-to-grave footprint analysis, which certified the footprint of Ivy’s Reserve salted farmhouse butter as carbon neutral in accordance with PAS2050, an internationally recognised specification. The company will now produce freshly churned butter with longer shelf-lives allowing for shipping to premium export markets, as well as driving a reduction in waste both in store and at home. “Increasingly, people across the world are looking for premium dairy products with provenance and history – butter is no exception and Ivy’s Reserve salted farmhouse butter is a best-in-class product in terms of quality and sustainability, and it articulates our unique set of values that fit with this trend,” said Rich Clothier, managing director of Wyke Farms. The butter is made with whey cream from cows in the southwest and is formulated according to Grandmother Ivy’s secret family recipe.","filter_flag":1}
{"title":"Sneaker artist designs custom running shoes - that look just like cheeseburgers - Express","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmV4cHJlc3MuY28udWsvbGlmZS1zdHlsZS9mb29kLzE3NjYwNDMvc3R5bGUtcnVubmluZy1zaG9lcy1hcnQtZm9vZC1jaGVlc2VidXJnZXJzLXZlZ2Fu0gFmaHR0cHM6Ly93d3cuZXhwcmVzcy5jby51ay9saWZlLXN0eWxlL2Zvb2QvMTc2NjA0My9zdHlsZS1ydW5uaW5nLXNob2VzLWFydC1mb29kLWNoZWVzZWJ1cmdlcnMtdmVnYW4vYW1w?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmV4cHJlc3MuY28udWsvbGlmZS1zdHlsZS9mb29kLzE3NjYwNDMvc3R5bGUtcnVubmluZy1zaG9lcy1hcnQtZm9vZC1jaGVlc2VidXJnZXJzLXZlZ2Fu0gFmaHR0cHM6Ly93d3cuZXhwcmVzcy5jby51ay9saWZlLXN0eWxlL2Zvb2QvMTc2NjA0My9zdHlsZS1ydW5uaW5nLXNob2VzLWFydC1mb29kLWNoZWVzZWJ1cmdlcnMtdmVnYW4vYW1w?oc=5","id":"CBMiYmh0dHBzOi8vd3d3LmV4cHJlc3MuY28udWsvbGlmZS1zdHlsZS9mb29kLzE3NjYwNDMvc3R5bGUtcnVubmluZy1zaG9lcy1hcnQtZm9vZC1jaGVlc2VidXJnZXJzLXZlZ2Fu0gFmaHR0cHM6Ly93d3cuZXhwcmVzcy5jby51ay9saWZlLXN0eWxlL2Zvb2QvMTc2NjA0My9zdHlsZS1ydW5uaW5nLXNob2VzLWFydC1mb29kLWNoZWVzZWJ1cmdlcnMtdmVnYW4vYW1w","guidislink":false,"published":"Thu, 04 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=4, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=124, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmV4cHJlc3MuY28udWsvbGlmZS1zdHlsZS9mb29kLzE3NjYwNDMvc3R5bGUtcnVubmluZy1zaG9lcy1hcnQtZm9vZC1jaGVlc2VidXJnZXJzLXZlZ2Fu0gFmaHR0cHM6Ly93d3cuZXhwcmVzcy5jby51ay9saWZlLXN0eWxlL2Zvb2QvMTc2NjA0My9zdHlsZS1ydW5uaW5nLXNob2VzLWFydC1mb29kLWNoZWVzZWJ1cmdlcnMtdmVnYW4vYW1w?oc=5\" target=\"_blank\">Sneaker artist designs custom running shoes - that look just like cheeseburgers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Express<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sneaker artist designs custom running shoes - that look just like cheeseburgers - Express","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmV4cHJlc3MuY28udWsvbGlmZS1zdHlsZS9mb29kLzE3NjYwNDMvc3R5bGUtcnVubmluZy1zaG9lcy1hcnQtZm9vZC1jaGVlc2VidXJnZXJzLXZlZ2Fu0gFmaHR0cHM6Ly93d3cuZXhwcmVzcy5jby51ay9saWZlLXN0eWxlL2Zvb2QvMTc2NjA0My9zdHlsZS1ydW5uaW5nLXNob2VzLWFydC1mb29kLWNoZWVzZWJ1cmdlcnMtdmVnYW4vYW1w?oc=5\" target=\"_blank\">Sneaker artist designs custom running shoes - that look just like cheeseburgers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Express<\/font>","source.href":"https:\/\/www.express.co.uk","source.title":"Express","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Now that's fast food – a pair of trainers designed to look like cheeseburgers. Plant based company, Future Farm, has partnered with sneaker artist, Matt B Customs, to create a one-of-a-kind, vegan couture running shoe that’s good enough to eat. The detail is second to none – from the realistic burger bun seeds to the texture of the meat, down to the movement of the lettuce. Taking inspiration from the popular fast food, Matt B Customs hand painted the design onto the carbon-neutral Hylo trainers using vegan paint – creating the sneakers “in a matter of days”. They were created to celebrate the launch of the brand’s new burger, in hopes of highlighting how plant-based foods are not only good for the environment, but can be plenty of fun too. Matt B Customs said: “Part of the beauty of customising is bringing things together that wouldn't usually be seen before – and this project is a perfect example of that. “We wanted to create something that looked both mouth-watering and illusive, but still housing it within a running shoe that's clearly functional, and that's why we left some elements of the shoe untouched. “I loved working on this project, and it's the first time we've wanted to take a bite out of something we've created.”","filter_flag":1}
{"title":"Asda lists British vodka brand in 50 Yorkshire stores - Grocery Gazette","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3Lmdyb2NlcnlnYXpldHRlLmNvLnVrLzIwMjMvMDUvMjUvYXNkYS1icml0aXNoLXZvZGthLWxpc3Rpbmcv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3Lmdyb2NlcnlnYXpldHRlLmNvLnVrLzIwMjMvMDUvMjUvYXNkYS1icml0aXNoLXZvZGthLWxpc3Rpbmcv0gEA?oc=5","id":"CBMiR2h0dHBzOi8vd3d3Lmdyb2NlcnlnYXpldHRlLmNvLnVrLzIwMjMvMDUvMjUvYXNkYS1icml0aXNoLXZvZGthLWxpc3Rpbmcv0gEA","guidislink":false,"published":"Thu, 25 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=145, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3Lmdyb2NlcnlnYXpldHRlLmNvLnVrLzIwMjMvMDUvMjUvYXNkYS1icml0aXNoLXZvZGthLWxpc3Rpbmcv0gEA?oc=5\" target=\"_blank\">Asda lists British vodka brand in 50 Yorkshire stores<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Grocery Gazette<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Asda lists British vodka brand in 50 Yorkshire stores - Grocery Gazette","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3Lmdyb2NlcnlnYXpldHRlLmNvLnVrLzIwMjMvMDUvMjUvYXNkYS1icml0aXNoLXZvZGthLWxpc3Rpbmcv0gEA?oc=5\" target=\"_blank\">Asda lists British vodka brand in 50 Yorkshire stores<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Grocery Gazette<\/font>","source.href":"https:\/\/www.grocerygazette.co.uk","source.title":"Grocery Gazette","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Asda will start stocking British vodka brand Dutch Barn, which will be hitting the shelves of 50 stores across the Yorkshire region this month. Produced by Ellers Farm Distillery, the award-winning vodka brand is made from apple and was one of the success stories from Asda’s Nurture Programme in 2022, which supported emerging brands by offering dedicated on-shelf recognition. The brewery – based in North Yorkshire – launched Dutch Barn Orchard Vodka last year to offer drinkers the opportunity to ‘rediscover vodka’. Made with British apples, the vodka brand is committed to making planet-friendly choices and has been carbon neutral in its operations since day one. It comes in brown glass bottles which use a higher percentage of recycled glass and cut down transport emissions. Subscribe to Grocery Gazette for free Sign up here to get the latest grocery and food news each morning The new launch comes as Asda enhanced its range of local products back in March, by adding 140 lines from new and existing Scottish suppliers. Ellers Farm Distillery sales and marketing director Steve Hickey said: “We’re incredibly proud to be announcing a listing with 50 Asda stores, and celebrating a true Yorkshire partnership. “Being chosen as part of the Nurture Programme last year was a real honour, and the fact that Asda has chosen to continue working with us is real testament to the quality of Dutch Barn Orchard Vodka and our team’s commitment to making the highest quality products in the most sustainable way. “We’re excited to see it hit the shelves across the region this month and give consumers a chance to rediscover Vodka.” Asda’s local buyer for England and Wales Gruffudd Roberts added: “We’re proud that we’re able to give brilliant small suppliers like Ellers Farm Distillery a platform to help grow their brand and reach more customers.”","filter_flag":1}
{"title":"Top 10 Best Dairy Farming Companies In Europe 2023 - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvZGFpcnktZmFybWluZy1jb21wYW5pZXMtaW4tZXVyb3BlLTIwMjMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvZGFpcnktZmFybWluZy1jb21wYW5pZXMtaW4tZXVyb3BlLTIwMjMv0gEA?oc=5","id":"CBMiSmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvZGFpcnktZmFybWluZy1jb21wYW5pZXMtaW4tZXVyb3BlLTIwMjMv0gEA","guidislink":false,"published":"Mon, 01 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=121, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvZGFpcnktZmFybWluZy1jb21wYW5pZXMtaW4tZXVyb3BlLTIwMjMv0gEA?oc=5\" target=\"_blank\">Top 10 Best Dairy Farming Companies In Europe 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 10 Best Dairy Farming Companies In Europe 2023 - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvZGFpcnktZmFybWluZy1jb21wYW5pZXMtaW4tZXVyb3BlLTIwMjMv0gEA?oc=5\" target=\"_blank\">Top 10 Best Dairy Farming Companies In Europe 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Dairy farming is the process of breeding and raising dairy cows for the production of milk, which is used to make various dairy products such as butter, cheese, and yogurt. Dairy farming is an important sector of agriculture and plays a vital role in food production, both in Europe and globally. Here are some key points about dairy farming: Breeds: There are many different breeds of dairy cows, but the most common ones in Europe include Holstein, Jersey, and Brown Swiss. Each breed has its unique characteristics, such as milk yield, butterfat content, and temperament. Milk production: The amount of milk a cow produces depends on various factors, including genetics, nutrition, and management practices. In Europe, cows are typically milked two to three times a day using automated milking systems or traditional methods. Sustainability: Many dairy farms in Europe have implemented sustainable practices to reduce their environmental impact. These include using renewable energy sources, reducing water usage, and managing manure and other waste products. Regulations: The dairy industry in Europe is subject to strict regulations, including animal welfare standards, food safety regulations, and environmental regulations. These regulations aim to ensure that dairy products are safe and of high quality. Technological advances: The dairy industry has seen significant technological advances in recent years, such as the use of precision farming techniques, automated milking systems, and data analytics. These advances have enabled dairy farmers to improve milk production and reduce their environmental impact. Overall, dairy farming is an important and complex sector of agriculture, with many challenges and opportunities for innovation and sustainability. here are the Top 10 Best Dairy Farming Companies In Europe 2023 Arla Foods: Arla Foods is a Danish-Swedish multinational dairy company that was formed in 2000 following a merger between Swedish dairy cooperative Arla and Danish dairy company MD Foods. The company has a presence in over 100 countries and is the largest producer of organic milk in the world. Arla Foods operates under a cooperative model with over 10,000 farmers who supply milk to the company. The company produces a wide range of dairy products including milk, cheese, butter, and yogurt. Arla Foods is committed to sustainability and has set ambitious goals to reduce its carbon footprint and become carbon net zero by 2050. Arla Foods is a Danish-Swedish multinational dairy company that was formed in 2000 by the merger of two companies, Arla of Sweden and MD Foods of Denmark. The company has a presence in over 100 countries and employs more than 19,000 people worldwide. Arla Foods is the largest producer of organic milk in the world and produces a wide range of dairy products including milk, cheese, butter, and yogurt. One of the unique aspects of Arla Foods is that it operates under a cooperative model, with over 10,000 farmers who supply milk to the company. The company places a strong emphasis on sustainability, with a goal of reducing its carbon emissions by 30% by 2030. Arla Foods also has a commitment to animal welfare, with a comprehensive animal welfare program in place. Arla Foods has a diverse product portfolio, with well-known brands such as Lurpak, Castello, and Arla. The company has a strong focus on innovation and has invested in technology to improve its products and processes. For example, Arla Foods has developed a technology called ARLA Food Scanner that allows consumers to scan a product with their phone and receive information about its ingredients and nutritional value. In addition to its focus on sustainability and innovation, Arla Foods has a strong commitment to social responsibility. The company has established the Arla Foundation, which supports initiatives to promote sustainable agriculture, food security, and education in developing countries. Overall, Arla Foods is a leader in the dairy industry, known for its high-quality products, commitment to sustainability and animal welfare, and innovative approach to technology Danone: Danone is a French multinational food and beverage company that is known for its dairy products such as yogurt, cheese, and milk. The company was founded in 1919 and operates in over 120 countries. Danone has a strong commitment to sustainability and social responsibility and has set ambitious goals to reduce its carbon footprint and achieve carbon neutrality by 2050. The company also supports small-scale farmers and promotes sustainable agriculture practices. In addition to dairy products, Danone also produces bottled water, baby food, and medical nutrition products. Danone is a French multinational food and beverage company that was founded in 1919. It is known for its wide range of dairy products such as yogurt, cheese, and milk. The company also produces bottled water, baby food, and medical nutrition products. Danone operates in over 120 countries and has a strong commitment to sustainability and social responsibility. Danone’s dairy business is divided into two segments: Fresh Dairy Products and Water. The Fresh Dairy Products segment produces and sells yogurt, cheese, and other dairy products under various brands such as Activia, Actimel, and Danette. The Waters segment produces and sells bottled water under brands such as Evian, Volvic, and Badoit. Danone is committed to sustainability and has set ambitious goals to reduce its environmental footprint. The company aims to achieve carbon neutrality by 2050 and to use 100% renewable energy by 2030. It has also set a goal to achieve zero net carbon emissions for its entire value chain by 2050. In addition to its commitment to sustainability, Danone has a strong focus on social responsibility. The company has established the Danone Ecosystem Fund, which provides financing and support to small farmers and entrepreneurs in the food industry. The fund has supported over 3,500 projects in 30 countries since its inception in 2009. Danone has received numerous awards and recognitions for its sustainability and social responsibility efforts. It was ranked first in the food and beverage industry in the 2019 Dow Jones Sustainability Index and has been included in the Corporate Knights Global 100 Most Sustainable Corporations in the World for the past 12 years. Overall, Danone’s commitment to sustainability and social responsibility, combined with its strong brand portfolio and global presence. FrieslandCampina: FrieslandCampina is a Dutch multinational dairy cooperative that was formed in 2008 following a merger between Friesland Foods and Campina. The company produces and sells dairy products such as milk, cheese, butter, and yogurt. FrieslandCampina operates in over 100 countries and has over 24,000 member farmers. The company is committed to sustainability and has set ambitious goals to reduce its carbon footprint and become climate-neutral by 2050. Müller: Müller is a German dairy company that was founded in 1896 and produces and sells dairy products such as milk, yogurt, cheese, and butter. The company operates in Europe and the United States and has a strong focus on innovation and sustainability. Müller is committed to reducing its environmental impact and has set ambitious goals to reduce its carbon footprint and water usage. Savencia Fromage & Dairy: Savencia Fromage & Dairy is a French multinational dairy company that specializes in cheese production. The company has a portfolio of over 100 cheese brands and operates in over 120 countries. Savencia is committed to sustainability and has set ambitious goals to reduce its environmental impact and support sustainable agriculture practices. Hochwald Foods: Hochwald Foods is a German dairy cooperative that was founded in 1932 and produces and sells dairy products such as milk, cheese, yogurt, and butter. The company operates under a cooperative model with over 4,000 farmers. Hochwald Foods is committed to sustainability and has set ambitious goals to reduce its carbon footprint and water usage. Hochwald Foods is a German dairy cooperative that was founded in 1932. It is one of the largest dairy companies in Germany and produces a wide range of dairy products including milk, cheese, yogurt, and butter. The company operates under a cooperative model with over 4,000 farmers who supply milk to the company. Hochwald Foods has a strong focus on sustainability and has implemented several initiatives to reduce its environmental impact. For example, the company has invested in renewable energy sources such as wind and solar power and has implemented a closed-loop system for milk production to reduce waste and conserve resources. The company also works closely with its suppliers to ensure that they adhere to high standards of animal welfare and environmental sustainability. In addition to its commitment to sustainability, Hochwald Foods has a strong focus on innovation. The company has invested heavily in research and development and has developed several innovative products such as lactose-free milk and low-fat cheese. The company also operates a state-of-the-art research and development center where scientists and researchers work to develop new products and improve existing ones. Overall, Hochwald Foods is a well-respected dairy company that is known for its high-quality products and a strong commitment to sustainability and innovation. With its cooperative model and focus on environmental and social responsibility, the company is well-positioned to continue to grow and succeed in the highly competitive dairy industry. Lactalis: Lactalis is a French multinational dairy company that was founded in 1933 and produces and sells dairy products such as milk, cheese, yogurt, and butter. The company operates in over 100 countries and is the largest producer of cheese in the world. Lactalis is committed to sustainability and has set ambitious goals to reduce its environmental impact and support sustainable agriculture practices. Emmi: Emmi is a Swiss multinational dairy company that was founded in 1907 and produces and sells dairy products such as milk, cheese, and yogurt. The company operates in Europe, the United States, and Asia and has a strong commitment to sustainability. Emmi is committed to reducing its carbon footprint and has set ambitious goals to achieve carbon neutrality by 2027. Valio is a Finnish dairy cooperative that was founded in 1905. The company is owned by 4,000 Finnish dairy farmers and produces a wide range of dairy products such as milk, cheese, and yogurt. Valio is known for its high-quality dairy products and has a strong commitment to sustainability. Valio’s focus on sustainability is evident in its operations, as the company has set a target to be carbon neutral by 2035. To achieve this, the company is investing in renewable energy sources such as wind and solar power, as well as increasing the energy efficiency of its production facilities. Valio is also working to reduce the carbon footprint of its products by optimizing the use of raw materials and minimizing waste. In addition to its focus on sustainability, Valio is known for its innovation in the dairy industry. The company has developed a range of patented technologies that enable the production of lactose-free and protein-rich dairy products. Valio’s lactose-free products are particularly popular in the Finnish market, where lactose intolerance is common. Valio is also committed to animal welfare, and all of the company’s member farmers are required to adhere to strict animal welfare standards. The company’s cows are kept in spacious barns with access to outdoor areas, and the use of antibiotics is minimized. Overall, Valio’s commitment to sustainability, innovation, and animal welfare has helped the company establish itself as a leading dairy producer in Finland and beyond. Meggle is a German dairy company founded in 1887 that produces and sells dairy products such as milk, cheese, and butter. The company operates in Europe and Asia, with production sites in Germany, Poland, and Ukraine. Meggle’s products are sold in over 120 countries worldwide. Meggle has a strong focus on innovation and sustainability. The company’s research and development team is constantly working on new products and technologies to improve the quality and safety of its products. Meggle’s innovative approach has led to the development of products such as lactose-free milk and butter, and vegan cheese alternatives. In terms of sustainability, Meggle is committed to reducing its environmental impact and has implemented various initiatives to achieve this goal. The company has invested in renewable energy sources such as wind turbines and solar panels and has implemented energy-efficient technologies in its production facilities. Meggle also works closely with its suppliers to ensure sustainable sourcing of raw materials and is a member of the Roundtable on Sustainable Palm Oil (RSPO). Meggle’s commitment to quality and innovation has earned it numerous awards and recognitions, including the prestigious German Innovation Award in 2019 for its lactose-free butter. The company also holds various certifications for its production processes and quality management, such as ISO 9001 and ISO 14001. Overall, Meggle’s focus on innovation and sustainability has enabled it to maintain its position as a leading player in the European dairy industry, with a strong presence in both domestic and international markets.","filter_flag":1}
