{"title":"New Holland Agriculture Publicly Launches the Industry's First All-Electric Utility Tractor with Autonomous Features ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi2AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1ob2xsYW5kLWFncmljdWx0dXJlLXB1YmxpY2x5LWxhdW5jaGVzLXRoZS1pbmR1c3RyeXMtZmlyc3QtYWxsLWVsZWN0cmljLXV0aWxpdHktdHJhY3Rvci13aXRoLWF1dG9ub21vdXMtZmVhdHVyZXMtLXRoZS1yZXZvbHV0aW9uYXJ5LXQ0LWVsZWN0cmljLXBvd2VyLXRyYWN0b3ItMzAxOTEwNTczLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi2AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1ob2xsYW5kLWFncmljdWx0dXJlLXB1YmxpY2x5LWxhdW5jaGVzLXRoZS1pbmR1c3RyeXMtZmlyc3QtYWxsLWVsZWN0cmljLXV0aWxpdHktdHJhY3Rvci13aXRoLWF1dG9ub21vdXMtZmVhdHVyZXMtLXRoZS1yZXZvbHV0aW9uYXJ5LXQ0LWVsZWN0cmljLXBvd2VyLXRyYWN0b3ItMzAxOTEwNTczLmh0bWzSAQA?oc=5","id":"CBMi2AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1ob2xsYW5kLWFncmljdWx0dXJlLXB1YmxpY2x5LWxhdW5jaGVzLXRoZS1pbmR1c3RyeXMtZmlyc3QtYWxsLWVsZWN0cmljLXV0aWxpdHktdHJhY3Rvci13aXRoLWF1dG9ub21vdXMtZmVhdHVyZXMtLXRoZS1yZXZvbHV0aW9uYXJ5LXQ0LWVsZWN0cmljLXBvd2VyLXRyYWN0b3ItMzAxOTEwNTczLmh0bWzSAQA","guidislink":false,"published":"Mon, 28 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=240, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi2AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1ob2xsYW5kLWFncmljdWx0dXJlLXB1YmxpY2x5LWxhdW5jaGVzLXRoZS1pbmR1c3RyeXMtZmlyc3QtYWxsLWVsZWN0cmljLXV0aWxpdHktdHJhY3Rvci13aXRoLWF1dG9ub21vdXMtZmVhdHVyZXMtLXRoZS1yZXZvbHV0aW9uYXJ5LXQ0LWVsZWN0cmljLXBvd2VyLXRyYWN0b3ItMzAxOTEwNTczLmh0bWzSAQA?oc=5\" target=\"_blank\">New Holland Agriculture Publicly Launches the Industry's First All-Electric Utility Tractor with Autonomous Features ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New Holland Agriculture Publicly Launches the Industry's First All-Electric Utility Tractor with Autonomous Features ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi2AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1ob2xsYW5kLWFncmljdWx0dXJlLXB1YmxpY2x5LWxhdW5jaGVzLXRoZS1pbmR1c3RyeXMtZmlyc3QtYWxsLWVsZWN0cmljLXV0aWxpdHktdHJhY3Rvci13aXRoLWF1dG9ub21vdXMtZmVhdHVyZXMtLXRoZS1yZXZvbHV0aW9uYXJ5LXQ0LWVsZWN0cmljLXBvd2VyLXRyYWN0b3ItMzAxOTEwNTczLmh0bWzSAQA?oc=5\" target=\"_blank\">New Holland Agriculture Publicly Launches the Industry's First All-Electric Utility Tractor with Autonomous Features ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"New Holland introduces a new tractor class in the market, the Utility Electric, and paves a new chapter in sustainable zero emission farming with its first all-electric utility tractor with autonomous features. Better performance than diesel, the T4 Electric Power offers powerful, emission-free and silent energy power with high torque and fast response achieved at the lowest speeds, promoting a new level of driving experience . The pioneering and innovative New Holland tractor is launching for 2024 and will be on display at the 2023 Farm Progress Show in Decatur, Illinois . NEW HOLLAND, Pa., Aug. 28, 2023 \/PRNewswire\/ -- The future is here, and it just got more electric. For 2024, New Holland Agriculture is introducing the first all-electric utility tractor with autonomous features: the T4 Electric Power. This cutting-edge tractor opens a new class in the market, the Utility Electric, focused on offering solutions for more efficient field operations. The T4 Electric Power addresses current farming challenges, such as increased total cost ownership and labor shortage, while delivering upon New Holland's unwavering commitment to help customers build more sustainable agriculture for this generation and beyond. The new T4 Electric Power from New Holland is the first all-electric utility tractor with autonomous features. Post this The new T4 Electric Power from New Holland is the first all-electric utility tractor with autonomous features. The T4 Electric Power is a game-changing innovation that ushers in a new era of modern agriculture. An ideal solution for lower horsepower field operations, it is suitable for multiple applications, such as mixed farm, hay and forage, dairy, livestock, municipality, greenhouse and specialty crops (vegetable and orchard). The tractor is the latest development in New Holland's strategic plan for electrification and the newest addition to the brand's lineup of alternative energy sources powered equipments, like the T7 Methane Power LNG (Liquified Natural Gas) and the T6.180 Methane Power. Equipped with a state-of-the-art lithium-ion battery pack, the T4 Electric Power delivers gradual power and continuous torque achieved at the lowest speeds, ensuring a completely new driving experience and seamless operation during loader work cycle and daily farm routines. \"This tractor is a significant step forward for growers, producers and municipalities. The T4 Electric Power addresses a number of challenges they are facing everyday on their operations,\" states Lena Bioni, product marketing manager for New Holland Agriculture North America. \"What New Holland is bringing to our farmers is a convergence of technology – electric propulsion, autonomous features, better performance – in the body of a utility tractor that's setting the stage for a more efficient, sustainable and resilient future our customers are striving for.\" Performance and Battery Technology Redefined Under the hood of the T4 Electric Power lies a state-of-the-art battery system partnered with a fully electrified drivetrain that's proven to deliver relentless power and productivity. Featuring a 110-kWh maximum energy storage capacity in a 400V nominal high-voltage circuit, it provides 74 hp (55 kW) rated power and 65 hp (48 kW) PTO power. Using an efficient high voltage powertrain with integrated cooling features in the single devices from established mass production vendors, as well as material currently in production, makes this tractor a pioneering and revolutionary solution. Compared to its diesel-powered counterparts, the T4 Electric Power delivers superior performance. It offers 4-wheel drive, a proven 12x12 transmission, clutch-less electronic power shuttle reverser and all the regular power outputs of a traditional diesel utility. This includes rear electro-hydraulic PTO, drawbar, multiple rear remotes, mid-mount valves and a robust, and complete, 725LU mechanical self-leveling front loader with 3rd function and 84'' bucket included. Due to the greater control, enhanced precision and faster responsiveness, the tractor boosts the field capacity by reducing the applications cycle time. The tractor's electrified drivetrain promotes silent power with high torque and fast response achieved at the lowest speeds. These two intrinsic electric motor's characteristics, combined with the 12x12 electronic power shuttle transmission, means that even an inexperienced operator can run the implements during the applications without the need for precise gear selection and throttle control. Meanwhile, experienced operators will have infinite speed adjustments just by controlling motor RPM. Smooth and gradual delivery of power at low speeds and constant delivery in high speeds increase control and precision during field operations. \"The T4 Electric Power's quiet electric motor is definitely a big advantage and important tool in noise sensitive areas,\" Bioni explains. \"Outside, the tractor omits less noise and vibrations compared to diesel ones. Take for example, operating within equestrian barns or on college campuses running mowers and plowing snow alongside dorms.\" The T4 Electric Power was designed by CNH Industrial engineering in the United States (Burr Ridge, Ill., Detroit) and Italy (Modena) with state-of-the-art features and components aimed at durability, long service life and improved uptime. In general, considering light, medium and heavy-duty applications over its daily task routines, it's estimated the tractor can provide 4 hours of average runtime. However, this can easily be extended up to 8 working hours for low energy demand applications. In fact, its extended runtime empowers operators to tackle a variety of jobs without the need for frequent recharging, enhancing even more the overall productivity and reducing operational downtime. The tractor can be recharged by multiple energy sources such as regular grids, solar panels, biodigesters and wind power in both Alternate Current (AC) and Direct Current (DC). Operating in DC, it takes just one hour to reach 100% power when using commercially available fast charging systems. In addition, the T4 Electric Power can provide power availability wherever and whenever a customer needs it. This is the main goal of the practical and convenient Exportable Power feature. Equipped with common 110V and 220V outlets used in workshops and farmyard electrical installations, the tractor can serve as a power source for electric power tools such as welding, drilling and cutting machines. Technology Drives Productivity Smart autonomous features and creative driver assistance modes are part of the T4 Electric Power tractor's innovative character to improve daily farming operations with Precision Solutions & Telematics (PS&T), safety, diagnostics and service. With the design focused on addressing current farming challenges, such as increased total cost ownership, these outstanding features make the T4 Electric Power even more unique in the market. Driver-assisted features – Follow Me Mode, the Invisible Bucket and 360 Degree Awareness – are complemented by other fully digital and connected functions like Over the Air Updates, Live View and Map Maker, which make this tractor the first of its kind in the world. The tractor utilizes cameras and sensors in the Smart Roof, while modes are activated via a modern touchscreen display. The result is improved performance and safety both inside and outside of the cab full-time. A Bold New Blue A tractor as innovative as the T4 Electric Power requires its styling to match. The new Clean Blue paint scheme denotes a New Holland tractor that's powered by an alternative fuel source. First debuted on the New Holland T7 Methane Power LNG tractor, this head-turning shade of blue compliments the CNH grey decals, while an all-new hood design sports powerful LED headlights and worklights with illuminated accents. \"You're looking at the style of sustainability. Along with the head-turning paint scheme, customers can expect the T4 Electric Power tractor to redefine operating comfort with in-cab ergonomics, a new digital instrument cluster and a color touchscreen additional display,\" Bioni adds. The T4 Electric Power Tractor Being Introduced at Farm Progress Show The T4 Electric Power tractor will make its public debut at the 2023 Farm Progress Show, August 29-31, 2023, in Decatur, Illinois. It will be on display at the New Holland booth #967 in the northwest quadrant of the show grounds. The tractor is anticipated to be commercially available in North America with select dealers in early 2024. To explore the T4 Electric Power tractor and learn more about New Holland's Clean Energy Leader strategy, visit agriculture.newholland.com. Imagery and additional resources Images and additional product resources for the T4 Electric Power tractor can be downloaded here and used for publication purposes. New Holland Agriculture's reputation is built on the success of our customers, cash crop producers, livestock farmers, contractors, vineyards, or grounds care professionals. They can count on the widest offering of innovative products and services: a full line of equipment, from tractors to harvesting, material handling equipment, complemented by tailored financial services from a specialist in agriculture. A highly professional global dealer network and New Holland's commitment to excellence guarantees the ultimate customer experience for every customer. For more information on New Holland visit www.newholland.com New Holland Agriculture is a brand of CNH Industrial N.V. (NYSE: CNHI \/MI: CNHI) a global leader in the capital goods sector with established industrial experience, a wide range of products and a worldwide presence. More information about CNH Industrial can be found online at www.cnhindustrial.com For the latest press releases from New Holland brand on the CNH Industrial Newsroom visit: AMEA & ANZ I EUROPE I NORTH AMERICA I SOUTH AMERICA SOURCE New Holland Agriculture North America","filter_flag":1}
{"title":"Prairie Farmer editors: Welcome to 70th FPS - Farm Progress","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmZhcm1wcm9ncmVzcy5jb20vZmFybS1wcm9ncmVzcy1zaG93L3ByYWlyaWUtZmFybWVyLWVkaXRvcnMtd2VsY29tZS10by03MHRoLWZhcm0tcHJvZ3Jlc3Mtc2hvd9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmZhcm1wcm9ncmVzcy5jb20vZmFybS1wcm9ncmVzcy1zaG93L3ByYWlyaWUtZmFybWVyLWVkaXRvcnMtd2VsY29tZS10by03MHRoLWZhcm0tcHJvZ3Jlc3Mtc2hvd9IBAA?oc=5","id":"CBMiaWh0dHBzOi8vd3d3LmZhcm1wcm9ncmVzcy5jb20vZmFybS1wcm9ncmVzcy1zaG93L3ByYWlyaWUtZmFybWVyLWVkaXRvcnMtd2VsY29tZS10by03MHRoLWZhcm0tcHJvZ3Jlc3Mtc2hvd9IBAA","guidislink":false,"published":"Mon, 28 Aug 2023 07:03:32 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=28, tm_hour=7, tm_min=3, tm_sec=32, tm_wday=0, tm_yday=240, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmZhcm1wcm9ncmVzcy5jb20vZmFybS1wcm9ncmVzcy1zaG93L3ByYWlyaWUtZmFybWVyLWVkaXRvcnMtd2VsY29tZS10by03MHRoLWZhcm0tcHJvZ3Jlc3Mtc2hvd9IBAA?oc=5\" target=\"_blank\">Prairie Farmer editors: Welcome to 70th FPS<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Farm Progress<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Prairie Farmer editors: Welcome to 70th FPS - Farm Progress","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmZhcm1wcm9ncmVzcy5jb20vZmFybS1wcm9ncmVzcy1zaG93L3ByYWlyaWUtZmFybWVyLWVkaXRvcnMtd2VsY29tZS10by03MHRoLWZhcm0tcHJvZ3Jlc3Mtc2hvd9IBAA?oc=5\" target=\"_blank\">Prairie Farmer editors: Welcome to 70th FPS<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Farm Progress<\/font>","source.href":"https:\/\/www.farmprogress.com","source.title":"Farm Progress","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Good to see you, old friends and new by Holly Spangler For many of you — just as it is for many of us — heading to the Farm Progress Show is a rite of passage. I’d argue it’s also a good chance to expose your kids to one of the most exciting and diverse displays of agricultural career opportunities they’re likely to find anywhere. Sidle up to anyone wearing an official polo in a tent and ask them what they do. I guarantee they’ll enjoy telling you about it. I started bringing my kids to the show young — before they were even born! Today, my son is heading off to college and he’s hardly missed a show in all his 18 years. I’d nearly guarantee that the Farm Progress Show is where he nurtured his love of equipment and technology, the exact field he’s pursuing in college. This year is the 70th anniversary of the Farm Progress Show, which began in 1953 on the Earl Buss farm in Armstrong, Ill. And here we are, 70 years later, celebrating agriculture and innovation, at the nation’s largest outdoor farm show. Since 1953, FPS has become the place for new product rollouts — so much so that in recent years, we’ve convened an editorial New Products Team to fan out across the showgrounds in search of every single new product. We’ll tell you about those new products in upcoming issues of your Farm Progress magazine, as well as online. Related:Step into the Autonomy Zone at FPS As we’ve prepared for this year's show, including publishing the official program, I’ve marveled over every story, every innovation, every plan. It’s clear this industry has emerged from the pandemic with bigger ideas and better products. And even better, you can actually get most of it now! So whether it’s your first show, your seventh or your 70th, don’t be a stranger. Stop by the Farm Progress Show Hospitality Building, located in the center of the exhibit field, get a cool drink and say hello to the editors on hand. We’d love to hear what you think of the magazine, the latest story and the stories you’d like to see us cover. And we look forward to hearing what’s important to you. So to our old friends and those yet to be made, we say welcome back. It’s good to see you again. New technology abounds at this year’s event by Tom J. Bechman The Farm Progress Show was born in 1953 based on history, with an eye toward the present and the future. Prairie Farmer staff were looking for a way to rekindle the spirit of the old corn-husking contests, where thousands of people showed up to watch and visit, while creating a living magazine so advertisers could show off their latest technology. The result was the Farm Progress Show, and the concept is as vibrant today as it was then. The 2023 show builds off agriculture’s rich past, with a nod to those who own red Farmall tractors celebrating 100 years of the Farmall. You can find red tractors in a special display on 12th Street, just west of Central Avenue. Want to see other colors? Check out Antique Row. For everywhere else on the showgrounds, the past gives way to the present and future. Hundreds of exhibitors display their current products for sale. Many have one or more new products in the lineup that didn’t exist at the 2022 Farm Progress Show in Boone, Iowa, which will be the site for the 2024 show. A team of Farm Progress editors will look for those products and publish stories so you can see the ones you missed. Every year, this team finds more than 200 new products. That’s ag technology in overdrive! Some of you come to FPS to check out technology coming soon to market — and you won’t be disappointed. Autonomous farming, for example, is already here and growing in acceptance. In 2022, one company displayed a working autonomous machine. This year, five companies — Raven, Sabanto, Greeneye, Ryse and Ag Leader — will be demonstrating their autonomous machines. Look for them in the Autonomy Zone located near the exhibit field. Electric vehicles were once rare at the show, but they’re becoming more commonplace. Expect to find exhibitors offering everything from electric lawn mowers to all-electric utility tractors and pickups. In the Varied Industries Tent, you’ll likely find information on alternative energy sources. These up-and-coming topics could shape the future of agriculture. Yes, the past, present and future of agriculture are all waiting for you. We hope uncovering details about them makes your visit to the 2023 Farm Progress Show one to remember. The 2023 Farm Progress Show is Aug. 29-31. Learn more at FarmProgressShow.com, and check out the digital edition of the official program.","filter_flag":1}
{"title":"Top 5 Perks Of Embracing Green Computing In Your Company - Spiceworks News and Insights","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LnNwaWNld29ya3MuY29tL3RlY2gvZWRnZS1jb21wdXRpbmcvZ3Vlc3QtYXJ0aWNsZS9hZHZhbnRhZ2VzLW9mLWdyZWVuLWNvbXB1dGluZy1wcmFjdGljZXMv0gFlaHR0cHM6Ly93d3cuc3BpY2V3b3Jrcy5jb20vdGVjaC9lZGdlLWNvbXB1dGluZy9ndWVzdC1hcnRpY2xlL2FkdmFudGFnZXMtb2YtZ3JlZW4tY29tcHV0aW5nLXByYWN0aWNlcy8?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LnNwaWNld29ya3MuY29tL3RlY2gvZWRnZS1jb21wdXRpbmcvZ3Vlc3QtYXJ0aWNsZS9hZHZhbnRhZ2VzLW9mLWdyZWVuLWNvbXB1dGluZy1wcmFjdGljZXMv0gFlaHR0cHM6Ly93d3cuc3BpY2V3b3Jrcy5jb20vdGVjaC9lZGdlLWNvbXB1dGluZy9ndWVzdC1hcnRpY2xlL2FkdmFudGFnZXMtb2YtZ3JlZW4tY29tcHV0aW5nLXByYWN0aWNlcy8?oc=5","id":"CBMiZWh0dHBzOi8vd3d3LnNwaWNld29ya3MuY29tL3RlY2gvZWRnZS1jb21wdXRpbmcvZ3Vlc3QtYXJ0aWNsZS9hZHZhbnRhZ2VzLW9mLWdyZWVuLWNvbXB1dGluZy1wcmFjdGljZXMv0gFlaHR0cHM6Ly93d3cuc3BpY2V3b3Jrcy5jb20vdGVjaC9lZGdlLWNvbXB1dGluZy9ndWVzdC1hcnRpY2xlL2FkdmFudGFnZXMtb2YtZ3JlZW4tY29tcHV0aW5nLXByYWN0aWNlcy8","guidislink":false,"published":"Wed, 09 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=221, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LnNwaWNld29ya3MuY29tL3RlY2gvZWRnZS1jb21wdXRpbmcvZ3Vlc3QtYXJ0aWNsZS9hZHZhbnRhZ2VzLW9mLWdyZWVuLWNvbXB1dGluZy1wcmFjdGljZXMv0gFlaHR0cHM6Ly93d3cuc3BpY2V3b3Jrcy5jb20vdGVjaC9lZGdlLWNvbXB1dGluZy9ndWVzdC1hcnRpY2xlL2FkdmFudGFnZXMtb2YtZ3JlZW4tY29tcHV0aW5nLXByYWN0aWNlcy8?oc=5\" target=\"_blank\">Top 5 Perks Of Embracing Green Computing In Your Company<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Spiceworks News and Insights<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 5 Perks Of Embracing Green Computing In Your Company - Spiceworks News and Insights","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LnNwaWNld29ya3MuY29tL3RlY2gvZWRnZS1jb21wdXRpbmcvZ3Vlc3QtYXJ0aWNsZS9hZHZhbnRhZ2VzLW9mLWdyZWVuLWNvbXB1dGluZy1wcmFjdGljZXMv0gFlaHR0cHM6Ly93d3cuc3BpY2V3b3Jrcy5jb20vdGVjaC9lZGdlLWNvbXB1dGluZy9ndWVzdC1hcnRpY2xlL2FkdmFudGFnZXMtb2YtZ3JlZW4tY29tcHV0aW5nLXByYWN0aWNlcy8?oc=5\" target=\"_blank\">Top 5 Perks Of Embracing Green Computing In Your Company<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Spiceworks News and Insights<\/font>","source.href":"https:\/\/www.spiceworks.com","source.title":"Spiceworks News and Insights","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Allen Drennan of Cordoniq discusses the significant advantages of green computing for businesses: from lowering energy costs and gaining a competitive edge to attracting and retaining top talent. By implementing sustainable practices, companies can reduce their carbon footprint and contribute to a greener future while driving innovation and strengthening their brand. Embrace green computing today for a brighter tomorrow! What Is Green Computing? Green computing, sometimes called “sustainable IT,” refers to practices aimed at reducing greenhouse gas emissions, thus reducing the carbon footprint of either individuals or businesses. In today’s modern business climate, green computing is a vital consideration. Achieving “net zero” (or reducing greenhouse gas emissions to as close to zero as possible) has become a priority for most organizations today. Businesses and individuals can reduce their carbon footprint by implementing green computing practices. IBM defines green computing as “the design, manufacture, use, and disposal of computers, chips, other technology components, and peripherals in a way that limits the harmful impact on the environment, including reducing carbon emissions and the energy consumed by manufacturers, data centers and end-users.” While the main objective of green IT practices is reducing energy consumption, businesses must be aware of how green computing can also increase their bottom line. Organizations, including SMBs, can implement changes to increase energy efficiency and lower energy consumption. However, green computing is ideal for enterprise firms as part of an organization’s overall environmental, social, and governance (ESG) strategy and journey. Implementing a sustainable strategy can lessen the environmental impact of a business while contributing to overall growth over time. See More: The Impact of ESG Regulations Why Green Computing Is an Essential Part of Sustainability The information and communications technology (ICT) sector is responsible for 2% or more of global greenhouse emissions. According to a study in Patterns, “peer-reviewed studies estimate ICT’s current share of global greenhouse gas (GHG) emissions at 1.8%–2.8% of global GHG emissions; adjusting for truncation of supply chain pathways, we find that this share could be between 2.1% and 3.9%.” The ICT sector’s impact on the environment has worsened in recent years. The rise in cloud computing, blockchain, cryptocurrency, and the explosion of smartphones and other mobile devices contribute to the increase. Data centers are responsible for over 3% of all annual energy consumption. See More: 4 Ways to Ensure Energy Efficiency in Data Centers Key Business Benefits From Green Computing Practices Green computing aims to reduce environmental impact while encouraging the widespread use of more sustainable technologies. Still, there are additional benefits to employing sustainable methods that can lead to steady business growth and profitability. By taking a proactive and achievable approach to sustainable IT, businesses can work toward achieving greater environmental stewardship. Five top benefits of implementing a green IT strategy include the following: Lowering energy costs: Efforts to reduce electricity can lower energy costs for businesses. Changes such as using more energy-efficient devices or alternative energy sources can contribute to lower electricity on a large scale if widely adopted. Gaining a competitive advantage : Pursuing sustainability goals can lead to more profitability and interest from potential investors. A recent Gartner survey Opens a new window revealed ESG is now a top priority for CEOs and CIOs. In contrast, 74% of CEOs agree that increasing ESG efforts will attract more investors expecting firms to do more for the environment. Strengthening your brand: Building a track record of tangible sustainability practices is key to a stronger brand in today’s marketplace. Customers reward sustainable companies with loyalty and repeat business and often prefer ESG-backed products and services. Attracting and retaining talent: Potential employees are interested in working for companies with demonstrated sustainability practices – especially Gen Z job seekers. A recent KPMG survey Opens a new window revealed that one in three Gen Z respondents “said they had turned down a job because the company’s ESG commitments were not in line with their values.” Gen Z employees are also willing to leave a company if they don’t follow through with their ESG commitments. Increasing innovation: Green computing practices can drive sustainable innovation, which refers to developing new products, services, processes, and methods that are both sustainable and profitable. Technology organizations can deliver better client experiences that benefit the environment through green computing. Green Computing Techniques for Various IT Functions Green computing techniques can mitigate some of the environmental impacts of the computing industry. These techniques encompass different areas of the IT process and involve several participants. Generally, green IT practices can be applied in the following areas: Design and manufacturing of computer chips, hardware, components, and devices. This includes designing energy-efficient computers and systems. Green disposal of hardware and devices. The implementation of higher efficiency energy practices in the operation of data centers. Employing sustainable practices in computing and software engineering. Some practices are focused on ways to reduce the energy consumption of data centers, such as implementing higher efficiency sustainable cooling technologies. Organizations can also invest in more energy-efficient computer systems with extended life cycles. Other methods for sustainable computing include extending the life cycle of hardware and devices. Edge computing, a type of distributed storage framework, is one technique that can lower energy use in data centers by lowering network traffic. Developers and software engineers can explore various ways to incorporate green computing methods. Green coding, a concept that involves writing leaner and less wasteful lines of code, can reduce the energy consumption of processing. Programming methods can also be modified to utilize devices and the hardware available better. It is important to fully utilize the device’s processing capabilities with clean, native code concepts (embedded NEON, ARM64, and Intel SIMD). This approach can improve the overall collaborative experience while reducing the carbon footprint and delivering more engaging live experiences even on older, less capable devices. Becoming Energy-efficient Energy efficiency can improve overall by utilizing the GPU and CPU. Originating with gaming software development, the GPU approach means that computing is offloaded to the graphics processor unit rather than relying solely on the CPU and main memory. This method lowers the number of cycles needed to complete the processes, thus saving energy. This approach effectively lowers the carbon footprint of devices because they achieve better utilization rates. The potential to reduce the impact of computing on the environment will require a collaborative effort across industries. However, individual businesses can progress by finding ways to use technology sustainably throughout their organization. What steps have you taken to revolutionize your business for a sustainable and prosperous future? Let us know on FacebookOpens a new window , TwitterOpens a new window , and LinkedInOpens a new window . We’d love to hear from you! Image Source: Shutterstock","filter_flag":1}
{"title":"Why Are Chocolate Prices Rising? In Part, the Climate Crisis Is to Blame - VegNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiOmh0dHBzOi8vdmVnbmV3cy5jb20vY2hvY29sYXRlLXByaWNlcy1yaXNpbmctY2xpbWF0ZS1jcmlzaXPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiOmh0dHBzOi8vdmVnbmV3cy5jb20vY2hvY29sYXRlLXByaWNlcy1yaXNpbmctY2xpbWF0ZS1jcmlzaXPSAQA?oc=5","id":"CBMiOmh0dHBzOi8vdmVnbmV3cy5jb20vY2hvY29sYXRlLXByaWNlcy1yaXNpbmctY2xpbWF0ZS1jcmlzaXPSAQA","guidislink":false,"published":"Thu, 31 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=243, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOmh0dHBzOi8vdmVnbmV3cy5jb20vY2hvY29sYXRlLXByaWNlcy1yaXNpbmctY2xpbWF0ZS1jcmlzaXPSAQA?oc=5\" target=\"_blank\">Why Are Chocolate Prices Rising? In Part, the Climate Crisis Is to Blame<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why Are Chocolate Prices Rising? In Part, the Climate Crisis Is to Blame - VegNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOmh0dHBzOi8vdmVnbmV3cy5jb20vY2hvY29sYXRlLXByaWNlcy1yaXNpbmctY2xpbWF0ZS1jcmlzaXPSAQA?oc=5\" target=\"_blank\">Why Are Chocolate Prices Rising? In Part, the Climate Crisis Is to Blame<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","source.href":"https:\/\/vegnews.com","source.title":"VegNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"As the cost of living crisis continues, food prices are rising all over the world. In the UK, Brits are paying up to 80 percent more for grocery store essentials, and across the pond, American consumers have seen the largest annual increase in food prices since the 1980s. Everything is going up right now, and we’re sorry to say, chocolate is no exception. In June, the price of cocoa reached a 46-year high, and unfortunately, it doesn’t look like it’s about to decrease anytime soon. The chocolate price hike is happening for a few reasons, and, as you may find unsurprising, the climate crisis is one of them. Here’s what you need to know about the rising price of chocolate, including whether or not your favorite vegan sweet treat is affected. Why has the price of chocolate increased? According to Time, Russia is partly to blame for rising chocolate prices. This, the magazine notes, is because chocolate manufacturers in Europe (where a significant percentage of the world’s cocoa is imported) placed fewer orders for cocoa last year, due to concerns over energy shortages and price hikes impacting their workers and factories. “But Europe transitioned relatively easily away from Russia’s fuel, as it found alternative energy sources and as it weathered a relatively warm winter,” Time reports. “By the time fuel prices started dropping in August of 2022, and chocolate companies realized that they could keep running their factories, they were all competing for a limited supply of cocoa.” But this is only one part of the story. In the last year, chocolate prices have risen by around 25 percent, and that’s partly because of the changing climate. Pexels Most of the world’s cocoa beans are grown in West Africa, where flooding and generally wet conditions have created unfavorable conditions for a decent crop of cocoa. “The major production regions, particularly in Ivory Coast (also called Côte d’Ivoire), which accounts for more than 40 percent of global cocoa production, have had very wet conditions and flooding, which has been causing rotting and disease in the trees,” Pia Piggott, an analyst for Rabobank, told the Guardian. While it is the rainy season in the Ivory Coast, the rain has been above average in the region. “It is not good here, showers come one after the other. Farmers can no longer go to the fields because rivers have broken their banks and there is flooding,” one farmer told Reuters in June. The conditions follow from last year’s period of extreme flooding in West Africa, which, according to experts, was made “about 80 times more likely” by human-driven climate change. Is vegan chocolate impacted by rising prices? While the vegan milk chocolate market is growing, most dairy-free chocolate options on the market are dark, which is the worst-impacted sector. This is because dark chocolate is usually comprised of more cocoa solids. In fact, some bars can contain up to 90 percent cocoa. “As a result, the most heavily impacted chocolate price will be dark, which is driven nearly entirely by cocoa ingredient prices,” Andrew Moriarty, the Director of Commodity Insights for Mintec, told NBC News. Ethical problems in the chocolate industry While higher chocolate prices are inconvenient for consumers, it is, of course, cocoa farmers who are suffering the most from the impact of extreme weather. But it’s important to note that this is an industry already rife with issues. According to the Food Empowerment Project, in Ghana, one study found that 23 percent of surveyed cocoa laborers were working without any compensation. It also notes that both adults and children are enslaved in the cocoa industry. It is possible to buy from brands that don’t engage with exploitative practices, however. Beyond Good Chocolate, for example, is based in Brooklyn, but its dark chocolate bars are made at its own factory in Madagascar, with cocoa beans that are purchased for a premium price from local farmers. “Our supply chain is unique,” the brand notes. “[It’s] 100 percent traceable and fully transparent.” Beyond Good The Seattle Chocolate Company is another vegan-friendly brand committed to ethical sourcing from countries like Peru, Ivory Coast, and Ghana. For that reason, these bars are more expensive than the alternatives, and they always have been. But in this case, it is actually worth paying a little extra—the quality is superior, the supply chain isn’t associated with enslavement or child labor, and the people who actually grew the beans will see more of your hard-earned cash. “Seventy-five percent of the people in the Côte d’Ivoire rely on chocolate, or cacao, for their livelihood,” Jean Thompson, CEO of the Seattle Chocolate Company, told Ted back in 2021. “With today’s chocolate prices, we ensure that they will remain poor forever.” “It’s going to take newfound and widespread respect, understanding, and appreciation of chocolate to elevate cacao and give its farmers the sustainable and prosperous future that they deserve,” she said.","filter_flag":1}
{"title":"Decarbonization Opens Pathway to a Sustainable Future - Eetasia.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmVldGFzaWEuY29tL2RlY2FyYm9uaXphdGlvbi1vcGVucy1wYXRod2F5LXRvLWEtc3VzdGFpbmFibGUtZnV0dXJlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmVldGFzaWEuY29tL2RlY2FyYm9uaXphdGlvbi1vcGVucy1wYXRod2F5LXRvLWEtc3VzdGFpbmFibGUtZnV0dXJlL9IBAA?oc=5","id":"CBMiTmh0dHBzOi8vd3d3LmVldGFzaWEuY29tL2RlY2FyYm9uaXphdGlvbi1vcGVucy1wYXRod2F5LXRvLWEtc3VzdGFpbmFibGUtZnV0dXJlL9IBAA","guidislink":false,"published":"Tue, 15 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=15, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=227, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmVldGFzaWEuY29tL2RlY2FyYm9uaXphdGlvbi1vcGVucy1wYXRod2F5LXRvLWEtc3VzdGFpbmFibGUtZnV0dXJlL9IBAA?oc=5\" target=\"_blank\">Decarbonization Opens Pathway to a Sustainable Future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Eetasia.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Decarbonization Opens Pathway to a Sustainable Future - Eetasia.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmVldGFzaWEuY29tL2RlY2FyYm9uaXphdGlvbi1vcGVucy1wYXRod2F5LXRvLWEtc3VzdGFpbmFibGUtZnV0dXJlL9IBAA?oc=5\" target=\"_blank\">Decarbonization Opens Pathway to a Sustainable Future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Eetasia.com<\/font>","source.href":"https:\/\/www.eetasia.com","source.title":"Eetasia.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Decarbonization Opens Pathway to a Sustainable Future Article By : Maurizio Di Paolo Emilio Decoupling economic growth from carbon dioxide emissions is crucial to fighting climate change. Decarbonization is a crucial global initiative that aims to reduce greenhouse gas (GHG) emissions to mitigate climate change and transition to a sustainable, low-carbon economy. The primary goal of decarbonization is to reduce or eliminate CO 2 emissions and other GHGs associated with human activities. The combustion of fossil fuels—the primary source of carbon emissions—releases significant amounts of CO 2 into the atmosphere, contributing to the greenhouse effect and global warming. To effectively combat climate change, it’s crucial to decouple economic growth from GHG emissions, ultimately achieving a carbon-neutral or carbon-negative state. The semiconductor industry contributes substantially to global GHG emissions. Global CO 2 emissions increased by 0.9% in 2020, with 37,000 gigatons of CO 2 emitted, according to reports. The use of renewable energy and the transition to electric vehicles helped avoid 550 million tons of CO 2 emissions, even though the increase in emissions has been less than anticipated. Net–zero GHG emissions Due to the energy needed to produce chips and the specifications of the manufacturing processes, reducing GHG emissions is one of the semiconductor industry’s most difficult tasks. The need to expand the semiconductor ecosystem globally to meet the escalating chip demand adds to this complexity. To achieve net zero, new designs that don’t exist must be found, created and tested. To create a more sustainable computer future, Intel, one of the biggest semiconductor firms in the world, is strengthening its long-standing ecosystem partnership. In April last year, CEO Pat Gelsinger announced Intel’s commitment to reach net-zero emissions across its operations, known as Scope 1 and Scope 2, by 2040. Intel has made major investments in various processes, including chemical substitution, abatement, energy conservation, process enhancement and renewable and alternative energy sources. As a result, Intel’s cumulative GHG emissions over the past 10 years have fallen by more than 80%. Intel is also committed to addressing climate impacts across its upstream and downstream value chain, or Scope 3 emissions. The company’s Scope 3 strategy focuses on forming partnerships with suppliers and customers to implement aggressive measures to reduce overall emissions. Renewable energy transition Shifting from fossil-fuel–based energy sources to renewable energy is a key aspect of decarbonization. Renewable energy technologies, such as solar, wind, hydro and geothermal power, generate electricity with minimal or zero GHG emissions. Governments and private entities must invest in developing and deploying renewable energy infrastructures to drive this transition. Intel is increasing its commitment to sustainability by investing in solar- and wind-generated renewable electricity. According to Intel, it exceeded 93% of global renewable electricity consumption by the end of 2022. In addition, the company has collaborated with industry and academic institutions to develop semiconductor-processing alternatives and energy efficiency across the value chain, established standard reporting metrics, increased energy efficiency and decreased the total carbon footprint of products and platforms. Intel has over 110 alternative and renewable electricity installations, with a combined capacity of over 50,000 kW across 22 campuses, which employ distinct technologies, including solar water-heating and -cooling systems, solar electric photovoltaic (PV)-covered parking lots, solar windows, mini bioenergy, motion power, geothermal energy and micro wind turbine array systems. The company is also in collaboration with various business organizations, such as SEMI, the Semiconductor Research Corporation and the Semiconductor Climate Consortium. This newly formed organization brings semiconductor industry suppliers, manufacturers, designers and customers together to accelerate solutions for reducing GHG emissions. The Green Industrial Power division In April 2023, Infineon Technologies renamed its sector that provides power electronics solutions to Green Industrial Power (GIP) to demonstrate its commitment to the decarbonization of its industrial application sectors (see Figure 1). The reason for renaming this sector to GIP is to emphasize the company’s commitment to green-energy transition and to reflect and empower a world where natural energy sources provide limitless energy. Infineon is working in the fields of wind energy and solar power, with its power semiconductors establishing the standard for higher levels of efficiency throughout the entire energy-conversion chain. The concentration on the industrial sector has proved highly successful. It’s anticipated to continue to grow, with the decarbonization of energy supplies and mobility leading to the expansion of renewable energy, grid expansion and charging infrastructures. The transition to non-fossil energy sources must accelerate faster if decarbonization objectives are to be met, according to Infineon. This acceleration is primarily because renewable energy resources have become competitive, making them attractive to invest in and implement, be they PV or wind. Although the initial investment in renewable energy sources is substantial, the long-term cost savings and reduced emissions make it a commercially beneficial investment. Renewable energy storage is a challenge that must be addressed, and the price of electrical storage is decreasing due to technological advancements. Hydrogen is also an option for energy storage with a high energy density, and it can be produced from renewable electricity used in the combustion process, making it a carbon-free energy source. Energy efficiency Improving energy efficiency across various sectors plays a vital role in decarbonization. By reducing energy consumption through efficient technologies and practices, the demand for energy production decreases, leading to a corresponding decline in carbon emissions. Energy-efficient buildings, transportation systems and industrial processes are instrumental in achieving this objective. To completely realize the potential of renewable energy sources, improvements in the efficiency of energy generation, transmission and consumption must occur simultaneously. PV is anticipated to become the world’s primary energy source by 2025 due to anticipated cost reductions. Infineon boasts that 50% of all installed wind farms are powered by their semiconductors, claiming to be the leading semiconductor-enabled enterprise in the field of energy generation. The generated electricity must be efficiently transformed and distributed to all consumers with minimal losses, necessitating energy infrastructure. Infineon views green energy as a sector with double-digit development, which will increase its annual growth opportunities to more than 10%. Compared with the amount of energy consumed by humans, the potential of renewable energy sources like solar and wind is practically limitless. The transition toward green energy and novel materials, such as silicon carbide and gallium nitride, presents the semiconductor industry with significant challenges and opportunities. The market forecast for 2023 indicates that automation, motors and renewable energy will experience substantial expansion. The future is sustainable, and renaming the industrial division is a step in the right direction. Electrification Lithium-ion (Li-ion) batteries play a crucial role in the battle against climate change. Li-ion–based technology is widely used in EVs, which require lightweight, high-performance batteries capable of withstanding many charge\/discharge cycles and storing intermittently produced renewable energy. However, the basic materials necessary to produce Li-ion batteries will likely not be sufficient to meet the rising market demand and potential supply issues that could threaten the complete transition to electric mobility. Consequently, alternative technologies must be developed to address the impending paucity of raw materials. Salient Energy, a company founded in 2017 in Waterloo, Canada, has developed a method for producing secure, affordable and environmentally friendly zinc-ion batteries for temporary storage in renewable energy plants. These facilities store pure electricity when it’s abundant and distribute it when required. Zinc is approximately 100× more abundant than lithium, and the production of zinc-ion reduces GHG emissions by two-thirds. Salient Energy reduces its reliance on hazardous and high-risk supply chains by utilizing metals mined, processed and manufactured exclusively in North America. To decarbonize the global electricity system to prevent catastrophic climate change, we need a stationary energy-storage industry that utilizes as many batteries as the current EV industry within the next 10 years, according to Salient Energy. Because the EV industry is already causing a deficit in Li-ion raw materials within the market, it can’t serve as a solution. Alternative battery technology is required to supplant Li-ion batteries. The zinc-ion battery manufactured by Salient Energy (see Figure 2) comprises zinc and manganese dioxide sourced from standard commercial sources. These are abundant, inexpensive and non-toxic materials. In addition, the innovative technology is founded on a water-based design that eliminates the risk of fire. This article was originally published on EE Times. Maurizio Di Paolo Emilio has a Ph.D. in Physics and is a Telecommunications Engineer. He has worked on various international projects in the field of gravitational waves research designing a thermal compensation system, x-ray microbeams, and space technologies for communications and motor control. Since 2007, he has collaborated with several Italian and English blogs and magazines as a technical writer, specializing in electronics and technology. From 2015 to 2018, he was the editor-in-chief of Firmware and Elettronica Open Source. Maurizio enjoys writing and telling stories about Power Electronics, Wide Bandgap Semiconductors, Automotive, IoT, Digital, Energy, and Quantum. Maurizio is currently editor-in-chief of Power Electronics News and EEWeb, and European Correspondent of EE Times. He is the host of PowerUP, a podcast about power electronics. He has contributed to a number of technical and scientific articles as well as a couple of Springer books on energy harvesting and data acquisition and control systems.","filter_flag":1}
{"title":"Hy-fcell Conference Will Highlight Prospects in The Energy Sector - Hydrogen Central","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vaHlkcm9nZW4tY2VudHJhbC5jb20vaHktZmNlbGwtY29uZmVyZW5jZS1oaWdobGlnaHQtcHJvc3BlY3RzLWVuZXJneS1zZWN0b3Iv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vaHlkcm9nZW4tY2VudHJhbC5jb20vaHktZmNlbGwtY29uZmVyZW5jZS1oaWdobGlnaHQtcHJvc3BlY3RzLWVuZXJneS1zZWN0b3Iv0gEA?oc=5","id":"CBMiU2h0dHBzOi8vaHlkcm9nZW4tY2VudHJhbC5jb20vaHktZmNlbGwtY29uZmVyZW5jZS1oaWdobGlnaHQtcHJvc3BlY3RzLWVuZXJneS1zZWN0b3Iv0gEA","guidislink":false,"published":"Wed, 09 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=221, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vaHlkcm9nZW4tY2VudHJhbC5jb20vaHktZmNlbGwtY29uZmVyZW5jZS1oaWdobGlnaHQtcHJvc3BlY3RzLWVuZXJneS1zZWN0b3Iv0gEA?oc=5\" target=\"_blank\">Hy-fcell Conference Will Highlight Prospects in The Energy Sector<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Hydrogen Central<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Hy-fcell Conference Will Highlight Prospects in The Energy Sector - Hydrogen Central","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vaHlkcm9nZW4tY2VudHJhbC5jb20vaHktZmNlbGwtY29uZmVyZW5jZS1oaWdobGlnaHQtcHJvc3BlY3RzLWVuZXJneS1zZWN0b3Iv0gEA?oc=5\" target=\"_blank\">Hy-fcell Conference Will Highlight Prospects in The Energy Sector<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Hydrogen Central<\/font>","source.href":"https:\/\/hydrogen-central.com","source.title":"Hydrogen Central","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Hy-fcell Conference will highlight prospects in the energy sector. Around six weeks before the start of the event, Messe Stuttgart is now announcing the programme of the hy-fcell 2023 Conference. This annual English-speaking Conference is an important platform for the transfer of know-how in the hydrogen and fuel cell industry. Participants from all over the world can look forward to a total of 25 sessions with over 60 first-class speakers and will have ample opportunity to hold discussions on global challenges and prospects in the energy sector. The hy-fcell Conference will be held in the International Congress Center (ICS) of Messe Stuttgart on 13 and 14 September 2023 concurrently with the exhibition in the Mahle Hall (Hall 4). Meeting point for the Who’s who in the industry The event has been given a top-class line-up by Messe Stuttgart. It will be opened by Daria Nochevnik, Director Policy & Partnerships at the Hydrogen Council. She is looking forward full of expectation to hy-fcell 2023: Daria Nochevnik, Director Policy & Partnerships at the Hydrogen Council said: Germany has always played an important role in introducing the hydrogen economy in Europe and on a global scale. “I am looking forward to discussing best practices and solutions with government and industry participants in order to drive the adoption of global, cross-border hydrogen supply chains.” The other speakers in the first panel at this year’s hy-fcell Conference are Andreas Haller from Quantron AG, Roland Bleinroth from Messe Stuttgart, and Matthias Ziebell from Robert Bosch GmbH. The latter will provide insights into efficient electrolysis with the aid of PEMEL stack technology. Matthias Ziebell from Robert Bosch GmbH said: We will show how hydrogen production capacities can be extended. “In conjunction with our talk, we will also present on our stand an exhibit which interactively explains the hydrogen landscape from production, transportation and storage through to use. As a large company from the Stuttgart region and a pioneer of the change to alternative energy sources, it is only natural for us to present our H2 solutions in Baden-Württemberg.” Insights into production and value-added chains The Fraunhofer Institute is organising several interesting sessions this year. As part of the H2GO Project funded by the German Federal Ministry for Digital and Transport (BMDV), the Fraunhofer Institute will stage, for example, a two-day session on production technologies that will provide an overview of aspects of the complete value-added chain from catalyst powder production through to stack assembly and recycling at the end of the life cycle. One highlight will be the opportunity to examine the complete production chain of a fuel cell stack. Ulf Groos, Head of the Fuel Cell Department at the Fraunhofer Institute for Solar Energy Systems said: It is very positive that we are also able to introduce the viewpoint of global markets to the Conference with some international speakers. “hy-fcell is the right platform for our topics since it has been well-established in the fuel cell industry for many years and is predestined with its location in Baden-Württemberg for positioning the mechanical engineering and plant construction industry in the global hydrogen community.” Solutions for heavy-duty transportation The session on the highly topical subject of heavy-duty transportation, in which three leading experts will have their say, is also awaited with interest: Dr. Matthias Jurytko, CEO of cellcentric GmbH & Co. KG, Hans-Joachim Schulz, Director Product Management Fuel Cell Mobility Solutions at Robert Bosch GmbH, and Christophe Schramm, Vice-President of Products, Marketing and Strategy at Symbio SAS. Christophe Schramm will present Symbio’s product and industry roadmap in his talk entitled “Hydrogen Fuel Cell Solutions as Enablers for the Decarbonization of Heavy Duty Transportation”. His word about the event: “hy-fcell Stuttgart is a key event for the European fuel cell ecosystem and a great opportunity to discuss zero-emission mobility solutions. I am looking forward to presenting the latest status of the Symbio roadmap.” Networking Night will honour winners of the hy-fcell Award Attendance at the hy-fcell Networking Night is included in the ticket for the two-day Conference. The hy-fcell Networking Night will be held on the first day of the Exhibition and Conference, and will offer the opportunity to meet and network with players in the industry. The highlight of the event will be the presentation of the winners of the hy-fcell Award, which this year will also again recognise outstanding developments and innovations in the hydrogen and fuel cell sector. About hy-fcell Founded in 2001, hy-fcell is one of the oldest and most important international technical exhibitions for the hydrogen and fuel cell industry. It provides an extensive overview of relevant international markets and technological advances. Visitors forge contacts and meet decision-makers at hy-fcell. The interactive format is an ideal platform for experts and newcomers to develop lasting business relationships. hy-fcell is staged annually and comprises an international exhibition, a first-class conference, interactive workshops and a festive evening event. In 2022 hy-fcell in Stuttgart attracted 2,027 participants from all over the world who obtained information about the latest new products and innovations on the stands of the 126 exhibitors. READ the latest news shaping the hydrogen market at Hydrogen Central hy-fcell Conference will highlight prospects in the energy sector, August 8, 2023","filter_flag":1}
{"title":"Hendrickson all set to revolutionize Indian trailer market – Motorindia - Motorindia","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3Lm1vdG9yaW5kaWFvbmxpbmUuaW4vaGVuZHJpY2tzb24tYWxsLXNldC10by1yZXZvbHV0aW9uaXplLWluZGlhbi10cmFpbGVyLW1hcmtldC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3Lm1vdG9yaW5kaWFvbmxpbmUuaW4vaGVuZHJpY2tzb24tYWxsLXNldC10by1yZXZvbHV0aW9uaXplLWluZGlhbi10cmFpbGVyLW1hcmtldC_SAQA?oc=5","id":"CBMiW2h0dHBzOi8vd3d3Lm1vdG9yaW5kaWFvbmxpbmUuaW4vaGVuZHJpY2tzb24tYWxsLXNldC10by1yZXZvbHV0aW9uaXplLWluZGlhbi10cmFpbGVyLW1hcmtldC_SAQA","guidislink":false,"published":"Thu, 24 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=24, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=236, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3Lm1vdG9yaW5kaWFvbmxpbmUuaW4vaGVuZHJpY2tzb24tYWxsLXNldC10by1yZXZvbHV0aW9uaXplLWluZGlhbi10cmFpbGVyLW1hcmtldC_SAQA?oc=5\" target=\"_blank\">Hendrickson all set to revolutionize Indian trailer market – Motorindia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Motorindia<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Hendrickson all set to revolutionize Indian trailer market – Motorindia - Motorindia","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3Lm1vdG9yaW5kaWFvbmxpbmUuaW4vaGVuZHJpY2tzb24tYWxsLXNldC10by1yZXZvbHV0aW9uaXplLWluZGlhbi10cmFpbGVyLW1hcmtldC_SAQA?oc=5\" target=\"_blank\">Hendrickson all set to revolutionize Indian trailer market – Motorindia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Motorindia<\/font>","source.href":"https:\/\/www.motorindiaonline.in","source.title":"Motorindia","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Innovative new range of air and mechanical suspensions and axles launched Hendrickson, a world leader in engineering medium and heavy-duty mechanical, elastomeric, and air suspensions, along with integrated and non-integrated axles, has unveiled an impressive range of innovative air and mechanical suspensions and axles tailored specifically for India’s thriving trailer industry. Our associate editor, Rajesh Rajgor, had the honor of attending the remarkable product launch event in Pune. During this event, he engaged in an insightful dialogue with Hendrickson’s senior leadership, delving into the company’s strategic outlook and product categorization aimed at propelling the growth of India’s dynamic trailer market. Hendrickson, a well-known player in the global commercial vehicle industry, has positioned itself with the goal of becoming a significant contender in India’s organized trailer supplier sector. Boasting a heritage spanning 110 years in spearheading technological advancement, inventive design, and innovation, Hendrickson remains at the forefront of establishing fresh standards in delivering tailor-made components and suspension systems for the worldwide commercial transportation sector. Hendrickson, affiliated with the Boler Company, made its debut in India back in 2006 via a strategic partnership with Tata AutoComp Systems. Subsequently, in 2011, the company took a significant stride by establishing Watson & Chalin India Pvt Ltd, a wholly-owned subsidiary. This move aimed at broadening its manufacturing presence for truck and trailer products, serving as a pivotal production hub to cater to the needs of global clientele across Europe, the Middle East, and Asia. With an illustrious history spanning over a century and marked by technological innovation, Hendrickson continues to redefine industry standards by offering tailor-made components and suspension systems to the commercial transportation sector worldwide. Today, Hendrickson boasts a comprehensive network of sales, distribution, manufacturing, and research and development facilities across various countries, including the United States, Canada, Mexico, Colombia, United Kingdom, Germany, and India, to name a few. Aligning with its commitment to delivering top-notch products, Hendrickson’s manufacturing facilities for truck and trailer axles and suspensions in India underline its dedication to providing solutions tailored to local terrains and conditions. The latest cutting-edge offerings reiterate this commitment. Hendrickson’s Latest Offerings Equipped with a remarkable range of advanced solutions, the company is poised to revolutionize the benchmarks for trailer suspensions and axles in India through its latest offerings. TA 14 – Heavy Duty Air Suspension Crafted for Indian conditions, the TA 14 Heavy Duty Air Suspension offers a lightweight design coupled with advanced technology, delivering superior ride quality and high reliability. Its robust construction suits various applications, promising minimized vehicle downtime and operational efficiency. Single Axle – Heavy Duty Trailer Axle Designed for Indian and global markets, the Single Axle guarantees durability and long service life. Manufactured using high-strength alloy steel, it comes with AIS 113 certified brake liners, ensuring safety and optimal braking performance. MS 16 – Heavy Duty Mechanical Suspension Engineered to excel in on-road and off-road scenarios, the MS 16 Suspension offers exceptional load-carrying capability and performance. Its construction, incorporating high-quality components, ensures low maintenance costs and enhanced operational efficiency. Hendrickson Severe Duty Suspension (HSDS®): Premium Suspension Introduced in 2011, Hendrickson’s HSDS® system has emerged as a trusted solution for heavy-duty trailer applications. Its lightweight design ensures maximum payloads, combining reliability and durability. The system incorporates the Tyre Inflation and Deflation System (Tyremaax Pro), contributing to optimal tyre pressure and reduced operational costs. Catering to Diverse Customer Needs The launch of these pioneering products in India has been met with enthusiasm amongst customers and media. As Matthew Joy, the President and CEO of Hendrickson, remarked, “Today, we are thrilled to introduce these innovative Ride Solutions for trailer applications in India, with the objective of meeting and supporting the evolving needs of the industry. Our suspension systems and components, utilized globally, bear testament to our commitment to supplying durable, lightweight, and high-performance solutions. The resonance of our brand’s spirit, captured in the tagline ‘The World Rides on Us’, echoes our legacy of 110 years of innovation.” Richardo Martin, Vice President of International Operations, noted the company’s formidable presence in the industry, attributing its success to an entrepreneurial mindset that nurtures innovation. Martin highlighted, “Hendrickson’s close collaboration with fleets, truck, and trailer manufacturers worldwide, underscores our focus on new product development. Beyond innovative offerings, Hendrickson prioritizes technical support and training services to ensure the proper functioning and maintenance of their equipment and components.” Mohit Khosla, Whole-time Director & CEO for India & Middle East, reinforced the commitment to innovation, accentuating the incorporation of unique features and patented technologies in their products for the Indian market. Khosla stated, “The new Air and Mechanical Suspensions, designed specifically for the Indian terrain, demonstrate Hendrickson’s dedication to delivering rugged, high-performance, and cost-effective solutions, aligning seamlessly with the ‘Make in India’ initiative.” Innovative Production Strategy Matthew Joy underscores the company’s focus on durable, cost-effective products that enhance resale value and customer support, with the new trailer offerings aligning seamlessly with these goals. He said, “When evaluating the market, Hendrickson places emphasis on three core aspects: delivering durable, top-notch products with reduced ownership costs for end users, enhancing resale value for OEMs, and providing exceptional product service and engineering assistance. The introduction of these new trailer products aligns perfectly with these objectives and extends these advantages to our clientele.” Highlighting the company’s varied solutions, including premium and cost-effective products, customized to meet specific customer needs and preferences, Mohit Khosla stated, “We’re presenting a diverse array of solutions and choices to our customers. Our offerings encompass premium products and locally manufactured, competitively priced options, encompassing slack adjusters, disc brakes, drum brake alternatives, and tyre inflation\/deflation systems. Our solutions are tailored to address the specific needs and motivations of individual customers.” Emphasizing significant investments in advanced manufacturing technologies to ensure the production of top-quality trailer suspensions, Richardo Martin, said, “While we’ve primarily supported truck operations, we’re now broadening our product portfolio to include the trailer sector. Substantial investments have been made in developing and producing trailer suspensions. Our capabilities encompass advanced technologies like high definition cutting, folding and forming, as well as robotics, ensuring the delivery of high-quality products.” Gerry Remus, VP and GM at Hendrickson, highlights successful product introductions post-Covid, emphasizes the positive performance of the joint venture in India, and expresses optimism for a bright future. He acknowledged, “After the resurgence of market volume following Covid, we’ve introduced new products that are gaining traction. Our joint venture is going well in India, and we see a promising future ahead.” India’s trailer market, witnessing an annual demand of approximately 40,000 units, is transitioning towards air suspensions from traditional mechanical ones. To cater to this dynamic market, Hendrickson has adopted a dual brand strategy, offering premium products under the Hendrickson brand and cost-effective solutions under the Watson & Chalin brand. Diverse Operations and Unwavering Commitment Hendrickson’s operations in India span two distinct domains. Through its collaboration with Tata AutoComp Systems, the company serves the truck and bus segment. Simultaneously, it strategically focuses on the trailer sector through its subsidiary, Watson & Chalin India. Presently, Hendrickson’s manufacturing capacity in India is robust, boasting an annual production of 30,000 trailer axles and suspensions. This aligns seamlessly with India’s estimated annual trailer production of 30,000 to 40,000 units, affirming Hendrickson’s strategic alignment with market dynamics. The company’s proactive stance towards industry changes also encompasses exploring opportunities presented by electrification. While the transition from internal combustion engines to alternative energy sources may not directly impact the company, it positions Hendrickson to develop lightweight, high-uptime solutions for customers. The company’s engagement with the global commercial vehicle market uniquely positions it to cater to evolving requirements, such as the need for roll-stable solutions in the era of electric vehicles. In pursuit of heightened efficiency, Hendrickson is embracing composite materials as a viable alternative to steel. This paradigm shift not only reduces weight but also introduces enhanced features and a higher cost structure. Ricardo Martin emphasizes that this strategy is a response to industry trends and the evolving needs of customers. By continuously improving its offerings, Hendrickson positions itself as a reliable partner in providing tailored solutions to a diverse range of clients. “While we don’t have specific plans for electric axles in India, our focus is on weight reduction as vehicles become heavier due to factors like batteries. We have technologies that address both the changing dynamics and the need for weight reduction,” added, Gerry Remus. Hendrickson’s strategic maneuvers within India’s commercial vehicle landscape underscore its commitment to delivering innovative and value-driven solutions across various segments. This approach positions the company for sustained growth and influence in India’s evolving trailer market in the commercial vehicle segment.","filter_flag":1}
{"title":"Komatsu: Driving innovation, enhancing safety - Mining Review Africa","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3Lm1pbmluZ3Jldmlldy5jb20vcGxhdGludW0tZ3JvdXAtbWV0YWxzL2tvbWF0c3UtZHJpdmluZy1pbm5vdmF0aW9uLWVuaGFuY2luZy1zYWZldHkv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3Lm1pbmluZ3Jldmlldy5jb20vcGxhdGludW0tZ3JvdXAtbWV0YWxzL2tvbWF0c3UtZHJpdmluZy1pbm5vdmF0aW9uLWVuaGFuY2luZy1zYWZldHkv0gEA?oc=5","id":"CBMiX2h0dHBzOi8vd3d3Lm1pbmluZ3Jldmlldy5jb20vcGxhdGludW0tZ3JvdXAtbWV0YWxzL2tvbWF0c3UtZHJpdmluZy1pbm5vdmF0aW9uLWVuaGFuY2luZy1zYWZldHkv0gEA","guidislink":false,"published":"Thu, 24 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=24, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=236, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3Lm1pbmluZ3Jldmlldy5jb20vcGxhdGludW0tZ3JvdXAtbWV0YWxzL2tvbWF0c3UtZHJpdmluZy1pbm5vdmF0aW9uLWVuaGFuY2luZy1zYWZldHkv0gEA?oc=5\" target=\"_blank\">Komatsu: Driving innovation, enhancing safety<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mining Review Africa<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Komatsu: Driving innovation, enhancing safety - Mining Review Africa","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3Lm1pbmluZ3Jldmlldy5jb20vcGxhdGludW0tZ3JvdXAtbWV0YWxzL2tvbWF0c3UtZHJpdmluZy1pbm5vdmF0aW9uLWVuaGFuY2luZy1zYWZldHkv0gEA?oc=5\" target=\"_blank\">Komatsu: Driving innovation, enhancing safety<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mining Review Africa<\/font>","source.href":"https:\/\/www.miningreview.com","source.title":"Mining Review Africa","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Safety and reducing greenhouse gas emissions are some of the key considerations that mining companies are considering when selecting open-pit mining equipment in Africa. This is according to HERMANN HOLLHUMER, General Manager: Mining at Komatsu South Africa. GERARD PETER reports. Komatsu is the world’s largest producer of electric mining rope shovels, electric dump trucks and a leading producer of electric wheel loaders and support equipment for open-pit mining operations. Its products are used in the mining and processing of coal, copper, iron ore, gold and other minerals and ores. The company has a strong African footprint with its equipment in operation in many tier one mines on the continent. Hollhumer states that Africa is a strategic region for the company. “Komatsu has been in the southern African mining sector for more than 60 years and has now identified other countries for growth such as the Democratic Republic of Congo, Ghana and Côte d’Ivoire. As Komatsu South Africa, we play a key role in offering equipment and technical support to the rest of southern Africa.” Komatsu places great emphasis on research and development (R&D) which enables it to build equipment for the future. In fact, the company has technology roadmaps that run until 2040 with a focus on three key areas: sustainability, safety and productivity. Its R&D strategy is very much centred around the needs of the customer. “We call it ‘the voice of the customer’ and it is at the centre of our world. Most of our work in GHG reduction and safety is done in collaboration with our customers. “For example, we host a safety roundtable with our customers to share our ideas and find out what is important to them. The roundtable ensures that we are all on the same page and we know what to prioritise. This helps us to mature our technology and introduce new products into the market,” explains Hollhumer. While there is a strong emphasis on reducing a mine’s carbon footprint, Hollhumer says Komatsu’s number one priority is safety. “As a case in point, our work in South Africa is currently focused on collision avoidance, something that is very topical in the country at the moment. We are also looking to enhance safety in high-risk activities such as elimination of live work, working at heights and lifting.” Komatsu’s footprint spans far and wide in the global mining sector. However, the company does not take a one size fits all approach when it comes to supplying equipment to different regions. “There are many different operating environments. For instance, in the Arctic mines operate in extremely cold temperatures while in Africa they operate in warmer climates. As such, we supply equipment based on the environment and customer needs,” says Hollhumer. Currently, models that are used in South Africa include the 730E, a 180-tonne electric dump truck which is used in coal and iron ore mines. In fact, South Africa has the largest fleet of 730s in the world. Another popular model is the 830, a 220-tonne automated dump truck. Electric Dump Trucks lend themselves to the transition of alternative energy sources, albeit from the grid or solar-driven trolley with battery propulsion or hydrogen internal combustion engine or hydrogen fuel cell. The company is also the biggest supplier of rope shovels in southern Africa. Later this year, Komatsu will deliver the world’s largest rope shovel to Mogalakwena platinum mine in Limpopo. In addition, he points out that the company also prefers to supply a number of similar models in a country- to ensure that it can provide spares, maintenance and after-sales support. To this end, Komatsu has 37 branches and depots across the southern African region. Each facility has a spares holding and offers technical support. The company also ensures that its branches and depots are located close to its customers’ operations so that support is readily available. “We ensure that we evolve with the industry. For example, the smaller diamond miners will operate in an area for up to two years and then relocate. We need to be flexible and open new depots in other areas to provide service that our customers expect,” Hollhumer adds. In addition, Komatsu offers training for both employees and customers at its Johannesburg campus. Along with lecture-based and hands-on training, the company also uses simulators which help to develop troubleshooting capabilities. It also offers online courses and training to customers outside of South Africa. As technology advances, the key question is whether Africa is ready for autonomous or semi-autonomous open-pit equipment. Hollhumer says this is already gaining traction on the continent. He cites mining operations currently making use of autonomous drills in South Africa, with tele- remote hydraulic shovels and track dozers being available for deployment. Autonomous capability is currently being developed for this energy transition that include trolley\/battery driven trucks. “I believe that automation can be successful in Africa. I think that the critical path to delivery is not the technology, it’s about the operational readiness,” he concludes.","filter_flag":1}
