{"title":"SAYSO, The World's First Craft Cocktail Tea Bags, Unveils New Sustainable Packaging And New Cocktails - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NheXNvLXRoZS13b3JsZHMtZmlyc3QtY3JhZnQtY29ja3RhaWwtdGVhLWJhZ3MtdW52ZWlscy1uZXctc3VzdGFpbmFibGUtcGFja2FnaW5nLWFuZC1uZXctY29ja3RhaWxzLTMwMTg0MTk2Mi5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NheXNvLXRoZS13b3JsZHMtZmlyc3QtY3JhZnQtY29ja3RhaWwtdGVhLWJhZ3MtdW52ZWlscy1uZXctc3VzdGFpbmFibGUtcGFja2FnaW5nLWFuZC1uZXctY29ja3RhaWxzLTMwMTg0MTk2Mi5odG1s0gEA?oc=5","id":"CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NheXNvLXRoZS13b3JsZHMtZmlyc3QtY3JhZnQtY29ja3RhaWwtdGVhLWJhZ3MtdW52ZWlscy1uZXctc3VzdGFpbmFibGUtcGFja2FnaW5nLWFuZC1uZXctY29ja3RhaWxzLTMwMTg0MTk2Mi5odG1s0gEA","guidislink":false,"published":"Mon, 05 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=156, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NheXNvLXRoZS13b3JsZHMtZmlyc3QtY3JhZnQtY29ja3RhaWwtdGVhLWJhZ3MtdW52ZWlscy1uZXctc3VzdGFpbmFibGUtcGFja2FnaW5nLWFuZC1uZXctY29ja3RhaWxzLTMwMTg0MTk2Mi5odG1s0gEA?oc=5\" target=\"_blank\">SAYSO, The World's First Craft Cocktail Tea Bags, Unveils New Sustainable Packaging And New Cocktails<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"SAYSO, The World's First Craft Cocktail Tea Bags, Unveils New Sustainable Packaging And New Cocktails - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NheXNvLXRoZS13b3JsZHMtZmlyc3QtY3JhZnQtY29ja3RhaWwtdGVhLWJhZ3MtdW52ZWlscy1uZXctc3VzdGFpbmFibGUtcGFja2FnaW5nLWFuZC1uZXctY29ja3RhaWxzLTMwMTg0MTk2Mi5odG1s0gEA?oc=5\" target=\"_blank\">SAYSO, The World's First Craft Cocktail Tea Bags, Unveils New Sustainable Packaging And New Cocktails<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Innovative Ready-to-Drink Startup Celebrates First Year Anniversary with Momentous Growth, Expands Product Line with Espresso Martini and Hibiscus Cosmopolitan Coming Soon NEW YORK, June 5, 2023 \/PRNewswire\/ -- Today, SAYSO , the world's first craft cocktail tea bags creating a new category in the ready-to-drink space, is unveiling new product packaging and two new flavors just in time for the brand's 1-year anniversary. The packaging redesign follows a successful retail expansion across 36 premium specialty stores and boutiques nationwide and is a result of the brand's commitment to offering a more eco-friendly product at an even more affordable price point. SAYSO New Sustainable Packaging Starting in June, SAYSO will replace its current box packaging with pouches made from post-consumer recycled materials, which will be available for purchase on the brand's website. As a result of this packaging redesign, consumers will enjoy a lower price point of $16 for eight cocktail tea bags, down from the previous price of $24. Since July 2022, monthly sales have grown 600% with an average of 38% per month. \"As SAYSO celebrates our first-year anniversary, we are thrilled to introduce our new sustainable packaging and two new cocktails to our customers. Our goal is to provide an exceptional experience with high-quality ingredients, convenience, and sustainability at the forefront,\" said Co-Founder, Chloe Bergson. The certified women-owned beverage category disrupter is bridging the gap between ready-to-drink mixers and labor-intensive cocktail kits offering a versatile option for cocktail enthusiasts and non-drinkers alike in a sophisticated, easy format. Unlike traditional cocktail mixers that are loaded with artificial flavors and excessive amounts of sugar, SAYSO offers an all-natural alternative using only the freshest, granulated ingredients including dehydrated fruits and herbs dried at peak flavor. SAYSO's successful product lineup, including the Skinny Spicy Margarita (TikTok viral best seller), Rosemary Honey Moscow Mule (best seller in non-alcoholic bottle shops), Skinny Cardamon Paloma, and the classic Old Fashioned, will be joined by two new exciting cocktails. Launching this summer, the classic Espresso Martini is a trending favorite and the upcoming Hibiscus Cosmopolitan in early Fall offers an approachable, low-sugar option with an elevated SAYSO twist. The ingenious biodegradable tea bags, expertly portioned, provide the perfect balance of taste and convenience requiring no shaking, blending, or mess when cocktail crafting. Just steep the bag in cold water for 3 minutes, add your spirit of choice (or skip it for a mocktail!), and add ice, for the fastest and easiest way to create a premium craft cocktail at home or on-the-go. Co-founder Alison Evans added, \"We look forward to continuing to expand our retail footprint, partnerships, and collaborations this year to bring SAYSO to even more cocktail lovers nationwide. We're excited to see our products hit the shelf at Citarella, Fairway, Gourmet Garage, and Bristol Farms this month.\" SAYSO products can be purchased on its website, Amazon, and in select retail stores. For more information, visit www.drinksayso.com . Media Contact: [email protected] About SAYSO Launched in 2022 by Harvard Business School graduates Chloe Bergson and Alison Evans, SAYSO came to life when, mid-pandemic, they became frustrated trying to recreate the delicious cocktails they once fancied at bars… while at home. Tired of carbon copy, high sugar RTD's and seltzers, or shopping for a multitude of ingredients to make one drink, they began experimenting with all-natural ingredients, dehydrated, and encased in a tea bag. The result? Easy to create, cocktails or mocktails at home in minutes, or to take on-the-go. SAYSO is revolutionizing the way we cocktail. SOURCE SAYSO","filter_flag":1}
{"title":"Great American Packaging (GAP) Launches New Sustainable Packaging - WholeFoods Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3Lndob2xlZm9vZHNtYWdhemluZS5jb20vYXJ0aWNsZXMvMTYxOTYtZ3JlYXQtYW1lcmljYW4tcGFja2FnaW5nLWdhcC1sYXVuY2hlcy1uZXctc3VzdGFpbmFibGUtcGFja2FnaW5n0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3Lndob2xlZm9vZHNtYWdhemluZS5jb20vYXJ0aWNsZXMvMTYxOTYtZ3JlYXQtYW1lcmljYW4tcGFja2FnaW5nLWdhcC1sYXVuY2hlcy1uZXctc3VzdGFpbmFibGUtcGFja2FnaW5n0gEA?oc=5","id":"CBMicWh0dHBzOi8vd3d3Lndob2xlZm9vZHNtYWdhemluZS5jb20vYXJ0aWNsZXMvMTYxOTYtZ3JlYXQtYW1lcmljYW4tcGFja2FnaW5nLWdhcC1sYXVuY2hlcy1uZXctc3VzdGFpbmFibGUtcGFja2FnaW5n0gEA","guidislink":false,"published":"Thu, 08 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=159, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3Lndob2xlZm9vZHNtYWdhemluZS5jb20vYXJ0aWNsZXMvMTYxOTYtZ3JlYXQtYW1lcmljYW4tcGFja2FnaW5nLWdhcC1sYXVuY2hlcy1uZXctc3VzdGFpbmFibGUtcGFja2FnaW5n0gEA?oc=5\" target=\"_blank\">Great American Packaging (GAP) Launches New Sustainable Packaging<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">WholeFoods Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Great American Packaging (GAP) Launches New Sustainable Packaging - WholeFoods Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3Lndob2xlZm9vZHNtYWdhemluZS5jb20vYXJ0aWNsZXMvMTYxOTYtZ3JlYXQtYW1lcmljYW4tcGFja2FnaW5nLWdhcC1sYXVuY2hlcy1uZXctc3VzdGFpbmFibGUtcGFja2FnaW5n0gEA?oc=5\" target=\"_blank\">Great American Packaging (GAP) Launches New Sustainable Packaging<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">WholeFoods Magazine<\/font>","source.href":"https:\/\/www.wholefoodsmagazine.com","source.title":"WholeFoods Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Great American Packaging (GAP) has announced the launch of OneEarth Packaging solutions, focused on meeting consumer demands for a healthier, more sustainable future. It is made without PFAS (per- and polyfluoroalkyl substances), which are chemical additives found in many consumer products that can be harmful to human health and the environment, according to the company. The new packaging comes in compostable and recyclable options. It is meant to appeal to consumers who want cleaner and safer choices without sacrificing packaging performance and manufacturability. www.greatampack.com","filter_flag":1}
{"title":"Mono-Material Lipstick Tubes - Trend Hunter","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiOmh0dHBzOi8vd3d3LnRyZW5kaHVudGVyLmNvbS90cmVuZHMvbW9uby1tYXRlcmlhbC1wYWNrYWdpbmfSAT5odHRwczovL3d3dy50cmVuZGh1bnRlci5jb20vYW1wL3RyZW5kcy9tb25vLW1hdGVyaWFsLXBhY2thZ2luZw?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiOmh0dHBzOi8vd3d3LnRyZW5kaHVudGVyLmNvbS90cmVuZHMvbW9uby1tYXRlcmlhbC1wYWNrYWdpbmfSAT5odHRwczovL3d3dy50cmVuZGh1bnRlci5jb20vYW1wL3RyZW5kcy9tb25vLW1hdGVyaWFsLXBhY2thZ2luZw?oc=5","id":"CBMiOmh0dHBzOi8vd3d3LnRyZW5kaHVudGVyLmNvbS90cmVuZHMvbW9uby1tYXRlcmlhbC1wYWNrYWdpbmfSAT5odHRwczovL3d3dy50cmVuZGh1bnRlci5jb20vYW1wL3RyZW5kcy9tb25vLW1hdGVyaWFsLXBhY2thZ2luZw","guidislink":false,"published":"Sat, 10 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=161, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOmh0dHBzOi8vd3d3LnRyZW5kaHVudGVyLmNvbS90cmVuZHMvbW9uby1tYXRlcmlhbC1wYWNrYWdpbmfSAT5odHRwczovL3d3dy50cmVuZGh1bnRlci5jb20vYW1wL3RyZW5kcy9tb25vLW1hdGVyaWFsLXBhY2thZ2luZw?oc=5\" target=\"_blank\">Mono-Material Lipstick Tubes<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Trend Hunter<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Mono-Material Lipstick Tubes - Trend Hunter","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOmh0dHBzOi8vd3d3LnRyZW5kaHVudGVyLmNvbS90cmVuZHMvbW9uby1tYXRlcmlhbC1wYWNrYWdpbmfSAT5odHRwczovL3d3dy50cmVuZGh1bnRlci5jb20vYW1wL3RyZW5kcy9tb25vLW1hdGVyaWFsLXBhY2thZ2luZw?oc=5\" target=\"_blank\">Mono-Material Lipstick Tubes<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Trend Hunter<\/font>","source.href":"https:\/\/www.trendhunter.com","source.title":"Trend Hunter","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Quadpack's Emerald is a Mono-Material Packaging Innovation To better align with circular economy principles, brands are favoring mono-material packaging over multi-material cosmetic components, and Quadpack's Emerald is a new option for brands that make everything from lip products to balms and solid fragrances. This mono-material tube is minimalist in form and available in either square or cylindrical shapes with a capacity of 4-4.5 grams, making it suitable for most lipsticks on the market. Brands that are interested in either style can opt for their choice of materials: recyclable PET and recycled PET (rPET) up to 100%. Multi-material cosmetic components have long presented challenges in terms of recyclability, as the combination of different materials makes it difficult to separate and process them effectively. In response, sustainably minded beauty brands are favoring mono-material packaging, making it easier for consumers to recycle and reduce waste. Trend Themes 1. Mono-material Packaging - Brands are favoring mono-material packaging over multi-material cosmetic components, presenting an opportunity for companies to develop new mono-material packaging solutions that align with circular economy principles. 2. Recyclable PET and Rpet Materials - Brands are opting for recyclable PET and rPET up to 100% as their choice of materials for mono-material packaging, presenting an opportunity for companies to develop new products that focus on sustainable materials. 3. Sustainable Beauty - Sustainably minded beauty brands are favoring mono-material packaging, making it easier for consumers to recycle and reduce waste, presenting an opportunity for companies to develop new sustainable beauty products and packaging solutions. Industry Implications 1. Cosmetics - New mono-material packaging solutions for cosmetics like lipstick and solid fragrances are becoming popular among sustainably minded beauty brands, presenting an opportunity for companies to develop new sustainable packaging solutions for cosmetics. 2. Packaging - The shift toward mono-material packaging presents an opportunity for packaging companies to develop new products and services that focus on sustainable and recyclable materials. 3. Sustainability - The trend toward sustainable beauty and packaging presents a major opportunity for companies to develop new products and services that meet consumer demand for sustainable and environmentally friendly options.","filter_flag":1}
{"title":"The future of beauty packaging: Three questions for Frédéric Dreux, Unilever - Premium beauty","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi90aGUtZnV0dXJlLW9mLWJlYXV0eS1wYWNrYWdpbmcsMjIyNTHSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi90aGUtZnV0dXJlLW9mLWJlYXV0eS1wYWNrYWdpbmcsMjIyNTHSAQA?oc=5","id":"CBMiSWh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi90aGUtZnV0dXJlLW9mLWJlYXV0eS1wYWNrYWdpbmcsMjIyNTHSAQA","guidislink":false,"published":"Tue, 27 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=178, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi90aGUtZnV0dXJlLW9mLWJlYXV0eS1wYWNrYWdpbmcsMjIyNTHSAQA?oc=5\" target=\"_blank\">The future of beauty packaging: Three questions for Frédéric Dreux, Unilever<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The future of beauty packaging: Three questions for Frédéric Dreux, Unilever - Premium beauty","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi90aGUtZnV0dXJlLW9mLWJlYXV0eS1wYWNrYWdpbmcsMjIyNTHSAQA?oc=5\" target=\"_blank\">The future of beauty packaging: Three questions for Frédéric Dreux, Unilever<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","source.href":"https:\/\/www.premiumbeautynews.com","source.title":"Premium beauty","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Premium Beauty News - How to put an end to virgin plastic of fossil origin? Frédéric Dreux - Plastic is a very valuable packaging material - and, compared to many other alternative materials, it often has a lower carbon footprint. But plastic has no place in the environment. Globally, it’s clear that the world must reduce its use of virgin plastic to further limit its environmental impact and, ultimately, prevent plastic from leaking into the environment. In this sense, it all starts with the reduction of virgin plastic and the scaling of new business models, materials, and technologies that support circularity to help – a top priority for Unilever, as part of our commitment to halve our use of virgin plastic through our “less plastic, better plastic, no plastic” sustainable packaging framework. One of the most significant opportunities is in our sourcing of post-consumer recycled (PCR) plastic. Not only does PCR move us away from virgin fossil sources, but it also has approximately a 60% lower greenhouse gas footprint compared to virgin plastic. Unilever has made tremendous progress in this regard; globally, we’ve increased our use of recycled plastic to around 21% of our total plastic footprint since 2018, with many of our Prestige beauty brands also accelerating their use of PCR. Two examples that come to mind include Dermalogica’s cleanser bottle which uses 50% PCR, and, in France, our Garancia brand using 100% PCR for the bottle of its cult micropeel product “Pschitt Magique”. Premium Beauty News - What are the alternative materials of interest? Frédéric Dreux - Innovating with alternative materials – such as paper, aluminium, glass, and board – is a key part of our sustainable packaging strategy and plays an important role in reducing our use of virgin plastic. Our Prestige brands are increasingly experimenting with new formats that use alternative materials to remove plastic entirely from some of our products and packaging. For example, in 2021, REN Clean Skincare launched a beauty world-first through the introduction of re-closeable aluminium sample tube made with 100% recycled aluminium (95% PCR), providing consumers with a brand-new sampling experience without the need for mini plastic caps or tamper seals. When using alternative materials, however, it’s important that we still take steps to minimise the environmental impact wherever possible – for example, by using recycled materials and ensuring a life cycle assessment approach is applied to compare materials and inform packaging decisions. Premium Beauty News - How do you approach the path of reuse? Frédéric Dreux - Supporting an industry-wide shift towards reusable and refillable packaging at scale – in addition to scaling our own successful models – is an important part of our plan to reduce the amount of plastic we use. We’ve tested a variety of reuse-refill models across our portfolio, building expertise, testing, learning, and exploring different approaches. One such example, on the market right now in France, is Garancia’s “Étoile du Jour” face cream, which features a recyclable glass jar that can be refilled easily by consumers at home. What we’ve found is that different consumers have different wants and needs (based on where they live, how they shop, and what they buy) and that some product categories perform better as “refill-at-home” solutions, compared to “refill in-store” (and vice versa). The common thread is that any innovative solutions (particularly those that require considerable behaviour change) must still guarantee a positive consumer experience overall. This is why it’s so important that we adapt solutions accordingly and remove barriers to entry, to help consumers form new habits. To ensure consumers come with us on the journey towards a global reuse-refill revolution, we’ll also need buy-in right across the value chain – for example, from retailers, other businesses, and policymakers. We can’t change a global system alone, which is why we are collaborating across the industry to help make this happen. For example, we’re working with the World Economic Forum’s Consumers Beyond Waste initiative, which seeks to create harmonised definitions, measurements, and reporting frameworks that will not only allow businesses to better track these new models of consumption, but also support well-drafted policy in the future.","filter_flag":1}
{"title":"The packaging paradox: the balance between clean labels and shelf life - FoodNavigator.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8wNi8yMS9UaGUtcGFja2FnaW5nLXBhcmFkb3gtdGhlLWJhbGFuY2UtYmV0d2Vlbi1jbGVhbi1sYWJlbHMtYW5kLXNoZWxmLWxpZmXSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8wNi8yMS9UaGUtcGFja2FnaW5nLXBhcmFkb3gtdGhlLWJhbGFuY2UtYmV0d2Vlbi1jbGVhbi1sYWJlbHMtYW5kLXNoZWxmLWxpZmXSAQA?oc=5","id":"CBMidmh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8wNi8yMS9UaGUtcGFja2FnaW5nLXBhcmFkb3gtdGhlLWJhbGFuY2UtYmV0d2Vlbi1jbGVhbi1sYWJlbHMtYW5kLXNoZWxmLWxpZmXSAQA","guidislink":false,"published":"Thu, 22 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=173, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8wNi8yMS9UaGUtcGFja2FnaW5nLXBhcmFkb3gtdGhlLWJhbGFuY2UtYmV0d2Vlbi1jbGVhbi1sYWJlbHMtYW5kLXNoZWxmLWxpZmXSAQA?oc=5\" target=\"_blank\">The packaging paradox: the balance between clean labels and shelf life<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The packaging paradox: the balance between clean labels and shelf life - FoodNavigator.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8wNi8yMS9UaGUtcGFja2FnaW5nLXBhcmFkb3gtdGhlLWJhbGFuY2UtYmV0d2Vlbi1jbGVhbi1sYWJlbHMtYW5kLXNoZWxmLWxpZmXSAQA?oc=5\" target=\"_blank\">The packaging paradox: the balance between clean labels and shelf life<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","source.href":"https:\/\/www.foodnavigator.com","source.title":"FoodNavigator.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"A new report from food consultancy Campden BRI called ‘Maximising Shelf Life’ shares valuable insights on how the combination of packaging and processes need to be optimised to reduce waste and increase shelf life, while maintaining consumer confidence without compromising product safety or quality. Research suggests food wastage is a bigger problem than previously thought​, which if cut in half would help remove around one-quarter of total greenhouse gas emissions from the global food system. Studies by climate-action NGO WRAP from the last decade suggest that around 50% of consumer food waste can be prevented simply by extending the shelf life of products. The World Health Organization puts this into context: global reversal of food waste could save enough spoiled food to feed two billion people worldwide. Microbial profiling, super-chilling, heat pasteurisation and modified atmosphere packaging are just of a few of the preservation techniques that food and beverage processors can adopt. Yet, with so many different quality, waste, sensory, taste and production factors to consider, uncovering the best and most sustainable option to extend the shelf life of individual fresh, frozen, ambient and bottled brands can feel like an endurance test in itself. Given the volume of interconnecting factors, Campden BRI’s report explains step-by-step the approach food and beverage processors need to consider for any shelf-life extension project. This includes how its scientific processing and packaging experts can assist with uncovering, validating, reviewing, proving and implementing a shelf-life strategy aligned to individual product applications that meet HACCP and country-specific food safety legislation. The need to look beyond the 'smoke and mirrors of sustainable packaging’​ But there are risks and unintended consequences which also need to be carefully weighed up – for instance, for FMCG brands switching to more sustainable packaging, composite materials or plant-based formulations to minimise environmental impact. Despite every best ethical intention, processors need to look beyond the smoke and mirrors of ‘sustainable packaging’, the report warned. For instance, if the packaging material allows gases, moisture, light and microbial contaminants in, then it inevitably shortens shelf life, leads to higher food waste and the squandering of valuable resources. Consequently, resulting in a far bigger carbon footprint. Although packaging suppliers typically perform their own tests, the responsibility rests with manufacturers to ensure that each packaging substrate is the right one for the food and beverage type, storage conditions and protects against contamination. Many tests determine whether packaging is fit for purpose. Campden BRI advocates testing packaging over every product’s shelf life. The rational, explained Campden BRI’s microbiological expert, Linda Everis, is threefold. To mitigate the transfer of constituents; to ensure pack and seal integrity is maintained and testing barrier properties from microorganisms. “Given the number of new materials entering the market, many with little historical data, testing the material in conjunction with the product to ensure they are both compatible over the product’s shelf-life is vital.”​ This has implications for food manufacturers attempting to balance shelf-life versus clean label. “Extending the shelf life of a food or drink product can be tricky as many preservatives and additives have unfamiliar names which can put people off buying the products,\"​ Jo Baker Perrett, Food & Drink Microstructure Team Lead at Campden BRI, explained to FoodNavigtor. “Understanding your shelf life limiting factor is key to determining how you might get around this. If it is microbial growth that you need to limit, you may be able to reduce pH and\/or add in a pasteurisation step. If it a quality issue, you can reassess your packaging, use enzymes or use a natural antioxidant such as extract of rosemary. So there are sometimes other options to having to move away from a clean label, if you want a longer shelf life.”​ The options that can keep labels short and lengthen shelf life ​ The message for food manufacturers is to explore different ingredients, processes and packaging options that can keep labels short and also allow manufacturers to significantly affect the achievable shelf-life of a final product. Coleslaw, for example, contains just three recognisable raw ingredients: onion, carrot and cabbage. But these raw ingredients contain potentially high microbial levels that could increase over time during storage. Microbiologists at Campden BRI designed a study to investigate the impact of the age of these ingredients on the achievable shelf-life of coleslaw. The shelf-life end point was based on microbial levels reached within the product, the unacceptable limit of which was defined using levels stated in guidelines published in November 2009 by the then Health Protection Agency regarding assessing the microbiological safety of ready-to-eat foods. Coleslaw made with two-day-old ingredients reached an unacceptable level of microorganisms (and therefore the end of its shelf-life) in just nine days. Whereas coleslaw made using one-day-old ingredients reached the same level after 10 days, and that made with fresh ingredients lasted 12 days. Though a UK source was used to define the microbial limit here, the overarching principal and its relationship to shelf-life is universal; whatever limit is set, it may be reached more quickly if the ingredients used contain a higher number of certain microorganisms. This work provided invaluable insight that could be used when carefully balancing the management of ingredient waste and finished product safety and quality. Other methods – such as 'superchilling' – allow for a longer shelf life without adding to the ingredient list. Superchilling is the point at which a product starts to freeze, and facilitates a long shelf-life without affecting the product’s sensory attributes. The reduced temperature drastically slows the rate at which microbial and chemical spoilage defects develop. In collaboration with Campden, Lyons Seafoods adopted the superchilling technique and was able to extend the shelf-life of their cooked prawn products. What’s more, the project brought a 20% decrease in water and electricity use and meant that Lyons were able to cook bigger batches less often (which reduced their product waste and hygiene costs). Similarly, Innocent Drinks partnered with Campden BRI to employ high pressure processing (HPP) to destroy the types of microorganisms that can limit the shelf-life of this type of product. Manufacturers can also explore predictive modelling to best maintain the balance between shelf-life and clean labels. Predictive modelling is the computer simulation of the growth of microorganisms in food and beverage products and is by far the quickest method to assess levels of microbial growth, allowing cost effective exploration of different ‘what if’ scenarios when developing new products, reformulating or extending shelf-life.","filter_flag":1}
{"title":"ProAmpac Unveils Fiber-Based Fresh Sandwich Packaging - Packaging Strategies","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzEwMzkwNy1wcm9hbXBhYy11bnZlaWxzLWZpYmVyLWJhc2VkLWZyZXNoLXNhbmR3aWNoLXBhY2thZ2luZ9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzEwMzkwNy1wcm9hbXBhYy11bnZlaWxzLWZpYmVyLWJhc2VkLWZyZXNoLXNhbmR3aWNoLXBhY2thZ2luZ9IBAA?oc=5","id":"CBMiaWh0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzEwMzkwNy1wcm9hbXBhYy11bnZlaWxzLWZpYmVyLWJhc2VkLWZyZXNoLXNhbmR3aWNoLXBhY2thZ2luZ9IBAA","guidislink":false,"published":"Mon, 19 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=170, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzEwMzkwNy1wcm9hbXBhYy11bnZlaWxzLWZpYmVyLWJhc2VkLWZyZXNoLXNhbmR3aWNoLXBhY2thZ2luZ9IBAA?oc=5\" target=\"_blank\">ProAmpac Unveils Fiber-Based Fresh Sandwich Packaging<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Strategies<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ProAmpac Unveils Fiber-Based Fresh Sandwich Packaging - Packaging Strategies","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzEwMzkwNy1wcm9hbXBhYy11bnZlaWxzLWZpYmVyLWJhc2VkLWZyZXNoLXNhbmR3aWNoLXBhY2thZ2luZ9IBAA?oc=5\" target=\"_blank\">ProAmpac Unveils Fiber-Based Fresh Sandwich Packaging<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Strategies<\/font>","source.href":"https:\/\/www.packagingstrategies.com","source.title":"Packaging Strategies","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"ProAmpac, a leader in flexible packaging and material science, has introduced its fiber-based Modified Atmosphere Packaging RAP Sandwich Wedge to the North American market. Designed for sandwiches and wraps, this groundbreaking package introduces the concept of modified atmosphere packaging to a fiber-based format. By combining the benefits of modified atmosphere packaging with sustainable fiber materials, ProAmpac addresses the demand for reduced food spoilage, environmentally friendly packaging, and an enhanced consumer experience in the food-to-go market. With the capability to keep a fresh sandwich or wrap preserved for up to 28 days, ProAmpac’s RAP Sandwich wedge is a pioneering approach that sets a new standard for freshness and sustainability in on-the-go meals. \"Sustainability lies at the heart of ProAmpac's business strategy, and we are thrilled to unveil the fiber-based Modified Atmosphere Packaging (MAP) RAP Sandwich Wedge,\" said Irma Randles, ProAmpac's market manager for Fresh Food To-Go. \"Our packaging solution represents a more sustainable alternative to conventional plastic sandwich packs while reducing food spoilage costs.\" ProAmpac's RAP Sandwich Wedge incorporates a carton board structure with a thin film lining to optimize product preservation and visibility. Engineered for hermeticity, this innovative solution utilizes high barrier technology to extend product shelf-life, especially when incorporated with gas-flush filling technology. The RAP Sandwich Wedge enables longer transit and selling time, enhancing sales potential while minimizing food waste. “The RAP Sandwich Wedge boasts wide recyclability,” added Kevin Vyse, head of technical of RAP products for ProAmpac. “Consumers can peel away the film liner, and the carton board is easily recycled in paper streams. Crafted from responsibly sourced fiber and utilizing less plastic packaging than conventional rigid containers, the RAP Sandwich Wedge significantly reduces packaging waste.” Furthermore, with custom graphics and branding printed directly on the pack, the RAP Sandwich Wedge elevates the grab-and-go sandwich or wrap into a premium option. Food retailers gain operational efficiencies when sandwiches are packed upstream using MA technology and can maximize onsite labor. To learn more about our award-winning RAP Sandwich Wedge or fresh food to-go packaging, watch this video found here.","filter_flag":1}
{"title":"Luxury, sustainability and customisation – inside Inca's packaging strategy - CosmeticsDesign-Europe.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5jb3NtZXRpY3NkZXNpZ24tZXVyb3BlLmNvbS9BcnRpY2xlLzIwMjMvMDYvMDgvbHV4dXJ5LXN1c3RhaW5hYmlsaXR5LWFuZC1jdXN0b21pc2F0aW9uLWluc2lkZS1pbmNhLXMtcGFja2FnaW5nLXN0cmF0ZWd50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5jb3NtZXRpY3NkZXNpZ24tZXVyb3BlLmNvbS9BcnRpY2xlLzIwMjMvMDYvMDgvbHV4dXJ5LXN1c3RhaW5hYmlsaXR5LWFuZC1jdXN0b21pc2F0aW9uLWluc2lkZS1pbmNhLXMtcGFja2FnaW5nLXN0cmF0ZWd50gEA?oc=5","id":"CBMiggFodHRwczovL3d3dy5jb3NtZXRpY3NkZXNpZ24tZXVyb3BlLmNvbS9BcnRpY2xlLzIwMjMvMDYvMDgvbHV4dXJ5LXN1c3RhaW5hYmlsaXR5LWFuZC1jdXN0b21pc2F0aW9uLWluc2lkZS1pbmNhLXMtcGFja2FnaW5nLXN0cmF0ZWd50gEA","guidislink":false,"published":"Thu, 08 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=159, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5jb3NtZXRpY3NkZXNpZ24tZXVyb3BlLmNvbS9BcnRpY2xlLzIwMjMvMDYvMDgvbHV4dXJ5LXN1c3RhaW5hYmlsaXR5LWFuZC1jdXN0b21pc2F0aW9uLWluc2lkZS1pbmNhLXMtcGFja2FnaW5nLXN0cmF0ZWd50gEA?oc=5\" target=\"_blank\">Luxury, sustainability and customisation – inside Inca's packaging strategy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign-Europe.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Luxury, sustainability and customisation – inside Inca's packaging strategy - CosmeticsDesign-Europe.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5jb3NtZXRpY3NkZXNpZ24tZXVyb3BlLmNvbS9BcnRpY2xlLzIwMjMvMDYvMDgvbHV4dXJ5LXN1c3RhaW5hYmlsaXR5LWFuZC1jdXN0b21pc2F0aW9uLWluc2lkZS1pbmNhLXMtcGFja2FnaW5nLXN0cmF0ZWd50gEA?oc=5\" target=\"_blank\">Luxury, sustainability and customisation – inside Inca's packaging strategy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign-Europe.com<\/font>","source.href":"https:\/\/www.cosmeticsdesign-europe.com","source.title":"CosmeticsDesign-Europe.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Eco-sustainable packaging business Inca has been manufacturing aluminium and primary plastic packaging for perfumes, cosmetics and personal care products since 1951. There isn’t anything the team doesn’t know about using aluminium to create luxurious packaging, but in recent years, the business has also been able to capitalise on the increased focus on sustainability, as aluminium is a 100%-recyclable material to work with. Inca, which is based in Porto Valtravaglia, just north of Milan, uses its expertise to create all shapes, sizes and quantities of aluminium-based packaging and offers a \"turnkey\" service to its clients – from the design to the final production of the part. “We master all the stages,” ​explains CEO ​Stefano Parodi. “We have a wide range of stamping machines, allowing us to shape aluminium into simple or complex forms in small or large series. We are fully equipped with polishing and brushing equipment suited for working on cylindrical or shaped parts.” ​ Eco-luxe packaging for Collistar and Diptyque One of the company’s proudest recent collaborations was revamping the packaging of Italian beauty brand Collistar's Puro lipstick. The elegant and eco-friendly new pack has a polypropylene base and cap with a refillable aluminium mechanism. This lipstick was so popular that the range has been extended with two additional items – another lipstick and a lid for cream containers. For the second lipstick, the design featured a 100%-recyclable aluminium cap and base with a plastic mechanism. The company also offers clients a range of customisation possibilities, from hot foil stamping to pad printing, screen printing and engraving, which allows beauty companies to create packaging that reflects their brand. “Our two anodising lines allow us great flexibility in terms of production and finishing,” ​says Parodi. “Screen printing, pad printing or hot stamping are part of our decoration techniques but we also master sublimation technology to provide an unlimited number of colours and shapes.”​ For plastic parts, Inca has a range of injection moulding machines to produce all types of components. “We also have a wide range of machines to assemble various combinations of materials, whether they are aluminium, plastic or glass,” ​says Parodi. “A big advantage today, as you know, is that aluminium is a 100% recyclable material that can be reused indefinitely​.” Inca has also worked with the Parisian fragrance brand Diptyque to create packaging for a candle. The elegant lid design displays a dark background with four colour gradients made using vegetable dyes. The company’s flexible manufacturing process can be an especially good fit for niche perfumers that want high-quality packaging and high levels of customisation, even for a small series. Transforming aluminium into sustainable works of art Inca says its manufacturing and transformation process of aluminium is fairly simple. It starts by extracting bauxite from the mine, which contains 15 to 25% aluminium, and then refines it to produce aluminium oxide (also known as alumina). Then finally, using electrolysis this is smelted into aluminium. The company claims that around 1kg of aluminium is produced from 5kg of bauxite. It also says that it’s possible to reintroduce used aluminium parts back into the manufacturing process with no loss of quality to achieve 95% energy savings and reduce CO2 emissions and mining activity, as well as waste disposal costs. Inca's teams are currently focusing on modifying and improving production processes to reduce their environmental impact. The company currently uses recycled plastics in various percentages, depending on the customer's wishes for the project. And for its \"mono-material\" designs, Inca has a series of standard aluminium lids with no plastic insert that can be used on glass jars for \"skincare\" applications. For the future, the teams are also working on designing products using recycled aluminium (RE-AL) and recycled plastics, as well as further developing its mono-material packaging and refillable packaging options to make them more sustainable. Right now, Inca says it is currently working on overcoming two small hurdles to be able to use RE-AL for more packaging solutions. One is: to ensure it “finds quality recycled aluminium on the market”,​ and the other is to “be able to maintain the same level of brightness as with pure aluminium.​”","filter_flag":1}
{"title":"Best practices in logistics sustainability Part 2: A look at packaging, reverse logistics, and technology - DC Velocity","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5kY3ZlbG9jaXR5LmNvbS9hcnRpY2xlcy81NzYwMS1iZXN0LXByYWN0aWNlcy1pbi1sb2dpc3RpY3Mtc3VzdGFpbmFiaWxpdHktcGFydC0yLWEtbG9vay1hdC1wYWNrYWdpbmctcmV2ZXJzZS1sb2dpc3RpY3MtYW5kLXRlY2hub2xvZ3nSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5kY3ZlbG9jaXR5LmNvbS9hcnRpY2xlcy81NzYwMS1iZXN0LXByYWN0aWNlcy1pbi1sb2dpc3RpY3Mtc3VzdGFpbmFiaWxpdHktcGFydC0yLWEtbG9vay1hdC1wYWNrYWdpbmctcmV2ZXJzZS1sb2dpc3RpY3MtYW5kLXRlY2hub2xvZ3nSAQA?oc=5","id":"CBMikAFodHRwczovL3d3dy5kY3ZlbG9jaXR5LmNvbS9hcnRpY2xlcy81NzYwMS1iZXN0LXByYWN0aWNlcy1pbi1sb2dpc3RpY3Mtc3VzdGFpbmFiaWxpdHktcGFydC0yLWEtbG9vay1hdC1wYWNrYWdpbmctcmV2ZXJzZS1sb2dpc3RpY3MtYW5kLXRlY2hub2xvZ3nSAQA","guidislink":false,"published":"Thu, 08 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=159, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5kY3ZlbG9jaXR5LmNvbS9hcnRpY2xlcy81NzYwMS1iZXN0LXByYWN0aWNlcy1pbi1sb2dpc3RpY3Mtc3VzdGFpbmFiaWxpdHktcGFydC0yLWEtbG9vay1hdC1wYWNrYWdpbmctcmV2ZXJzZS1sb2dpc3RpY3MtYW5kLXRlY2hub2xvZ3nSAQA?oc=5\" target=\"_blank\">Best practices in logistics sustainability Part 2: A look at packaging, reverse logistics, and technology<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">DC Velocity<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Best practices in logistics sustainability Part 2: A look at packaging, reverse logistics, and technology - DC Velocity","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5kY3ZlbG9jaXR5LmNvbS9hcnRpY2xlcy81NzYwMS1iZXN0LXByYWN0aWNlcy1pbi1sb2dpc3RpY3Mtc3VzdGFpbmFiaWxpdHktcGFydC0yLWEtbG9vay1hdC1wYWNrYWdpbmctcmV2ZXJzZS1sb2dpc3RpY3MtYW5kLXRlY2hub2xvZ3nSAQA?oc=5\" target=\"_blank\">Best practices in logistics sustainability Part 2: A look at packaging, reverse logistics, and technology<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">DC Velocity<\/font>","source.href":"https:\/\/www.dcvelocity.com","source.title":"DC Velocity","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Editor’s Note: This is the second in a two-part series of articles addressing best practices in sustainability for logistics management. The first article, “Best practices in logistics sustainability,” appeared in the Q1\/2023 issue of CSCMP’s Supply Chain Quarterly and the May issue of DC Velocity. Society is demanding that companies and the products they sell become more sustainable. Logistics management has a significant role in making that happen. By making changes in how they transport, store, package, and source products, companies can significantly reduce their environmental footprint. In the first article on this topic, which appeared in our May 2023 issue as well as the Q1\/2023 issue of our sister publication, CSCMP’s Supply Chain Quarterly, we defined “sustainability” as the ability to meet the needs of current generations without compromising the ability of future generations to meet their needs. To accomplish this, many experts recommend thinking about sustainability from a “triple bottom line” perspective, where companies consider their impact in three key areas: “people, planet, and profit.” But although there is growing pressure from consumers, shareholders, and employees to increase sustainability in the supply chain, many companies struggle to know which initiatives to pursue. This two-part series attempts to provide a collection of best practices that could be implemented by multiple organizations and accomplished quickly and\/or at a reasonable cost. For our first article, we examined sustainability best practices in: (1) purchasing\/procurement; (2) transportation; and (3) warehousing. In this follow-up article, we examine additional areas of logistics management sustainability: (1) packaging; (2) reverse logistics, product returns, and recycling; and (3) technology. PACKAGING Sustainability has been a driving trend in the packaging space for many years and is only expected to grow in importance. Environmentally friendly products and packaging is especially important to millennials, who will represent the largest consumer segment by 2026, with an estimated 46% of the market.1 Packaging utilizes many materials, including paper, cardboard, and plastics as well as a number of others. Many sustainable packaging initiatives are focused on plastic packaging due to the climate and environmental pollution issues associated with plastic’s creation and disposal. The production of the majority of plastics used today currently requires the consumption of nonrenewable fossil fuels and produces significant carbon dioxide emissions. At the other end of the product life cycle, almost 95% of plastic packaging is lost to the economy after being used one time.2 There have been several research efforts focused on making plastic production more sustainable. Chemists at the University of Toronto and Stanford University, for example, have produced small quantities of plastics from CO 2 , water, and electricity instead of using fossil fuels.3 However, there is still a long way to go in these and other approaches to creating renewable plastics. In the meantime, many companies, industries, and governments have attempted to reduce the use of these materials. Both large companies and small entrepreneurs have implemented innovative approaches to minimizing packaging, reducing plastic waste, and identifying substitutes for plastic packaging. Below are brief descriptions of some innovative ways that organizations have addressed the issue of packaging sustainability within logistics management. Some organizations have shifted from plastic packages to various forms of nonplastic packaging. Others are reducing their packaging, and still others are utilizing reusable packaging. Use returnable corrugated packaging. P2 Packaging has developed a returnable corrugated package for the automotive industry as an alternative to the plastic totes and one-time use cardboard containers that were traditionally used. The P2 boxes can be collapsed for return and can be reused more than 10 times. P2 customer Yangfeng Automotive Interiors has calculated the costs to reuse the packages as $0.60 to $1.10 each. P2 estimates that by using its packaging, a company can save 2,134 trees (or 53 acres) and reduce CO 2 emissions by 372,000 pounds. 4 Because the P2 packages are stronger than normal corrugated boxes, they can safely carry more parts in the same footprint. Yangfeng, for example, was able to use 58 fewer truck shipments to move parts from its facility in Michigan to a Tesla plant in California simply by switching to P2 packaging. P2 Packaging has developed a returnable corrugated package for the automotive industry as an alternative to the plastic totes and one-time use cardboard containers that were traditionally used. The P2 boxes can be collapsed for return and can be reused more than 10 times. P2 customer Yangfeng Automotive Interiors has calculated the costs to reuse the packages as $0.60 to $1.10 each. P2 estimates that by using its packaging, a company can save 2,134 trees (or 53 acres) and reduce CO emissions by 372,000 pounds. Because the P2 packages are stronger than normal corrugated boxes, they can safely carry more parts in the same footprint. Yangfeng, for example, was able to use 58 fewer truck shipments to move parts from its facility in Michigan to a Tesla plant in California simply by switching to P2 packaging. Explore plant-based packaging. The deodorant brand Each & Every has switched from plastic to new sugarcane packaging, which has reduced the company’s carbon footprint. Not only is the deodorant’s primary packaging recyclable but the product is also mailed to customers in compostable envelopes.5 Similarly, the Italian food company Pedon, which makes snacks from legumes, partnered with the paper company Favini to create paper made from the vegetable waste accumulated during the cultivation and processing of its legumes. This paper is then used in the company’s primary packaging. The packaging is 100% recyclable and is certified for direct contact with food. As a result of the switch, Pedon was able to eliminate the inner sleeve within the pack. The packaging reduces the use of virgin tree pulp by 15% and decreases greenhouse gas emissions by 20%.6 Eliminate unnecessary secondary packaging. e.l.f. Beauty eliminated 650,000 pounds of secondary packaging material in its cosmetic line by getting rid of secondary cartons, vacuum-formed trays, and paper inset cards. It was a win-win for the company and its customers. In total, packaging was reduced for more than 200 stock-keeping units (SKUs). 7 e.l.f. Beauty eliminated 650,000 pounds of secondary packaging material in its cosmetic line by getting rid of secondary cartons, vacuum-formed trays, and paper inset cards. It was a win-win for the company and its customers. In total, packaging was reduced for more than 200 stock-keeping units (SKUs). Reduce packaging weight and dimensions. An international manufacturer of consumer products has achieved significant material and cost savings by “light-weighting” cardboard and paper from its carton and item packages. Many of its products are placed on cards that can be attached to hangers on vertical displays. For one product, which contains cutting blades, the item slides into the card-locking package for transport to retail stores. That packaging design change has reduced the product’s shipping footprint, allowing more items to be included in a carton. Once the items reach the retail stores, they are slid out of the card-locking package and hung on the pegs. This innovation has resulted in 30% more efficient pallet loading and reduced transportation and warehousing space requirements. For other products, the company has reduced the amount of cardboard packaging by 16.2%, resulting in a raw material savings of 16,500 pounds. Additional cartons and item packaging have also been redesigned to reduce their dimensions. 8 An international manufacturer of consumer products has achieved significant material and cost savings by “light-weighting” cardboard and paper from its carton and item packages. Many of its products are placed on cards that can be attached to hangers on vertical displays. For one product, which contains cutting blades, the item slides into the card-locking package for transport to retail stores. That packaging design change has reduced the product’s shipping footprint, allowing more items to be included in a carton. Once the items reach the retail stores, they are slid out of the card-locking package and hung on the pegs. This innovation has resulted in 30% more efficient pallet loading and reduced transportation and warehousing space requirements. For other products, the company has reduced the amount of cardboard packaging by 16.2%, resulting in a raw material savings of 16,500 pounds. Additional cartons and item packaging have also been redesigned to reduce their dimensions. Conduct a packaging audit. A European grocery chain conducted an audit of its SKUs to determine if packaging costs could be reduced and, at the same time, a sustainability advantage could be gained. Based on its initial research, the company selected a single product supplied by Nestlé. The company developed a research team with representatives from all of the companies that had some impact on the item’s supply chain, including the manufacturer, road transporters, warehousing companies, logistics software providers, packaging providers, and others. The firm invested $35,000 in the project and netted first-year savings of almost $100,000. The $100,000 savings were achieved through various retailer savings, warehousing and transport efficiencies, and packaging reductions in weight.9 REVERSE LOGISTICS, PRODUCT RETURNS, AND RECYCLING Throughout the world’s economies, getting rid of waste has been an issue for centuries. However, it was not until the 20th century that organizations began to think about new ways of disposing of waste materials, minimizing the creation of waste, and the possible reuse of waste materials. With the advent of omnichannel retailing, which was accelerated by the Covid-19 pandemic, the number of products being purchased online has increased significantly, and concomitantly, the volume of products being returned has increased dramatically. Given the rising importance of reverse logistics, firms that are able to innovate in this area will reap market advantages. Some innovative practices include the following: Repurpose your trash. A classic example of the overlap between reducing waste materials, marketing strategy, and logistics management is the story of how Doritos, a highly successful snack food manufactured by Frito-Lay, was invented. In 1955, a Mexican restaurant called Casa de Fritos that incorporated Fritos into most of its meals opened in Disneyland. When a sales representative from the restaurant’s tortilla vendor, Alex Foods, visited the restaurant, he noticed that stale tortillas were being thrown into the garbage. He suggested to the chef that instead of throwing the tortillas away, Casa de Fritos could fry them and sell them as chips, similar to what the restaurant was already doing with Fritos. The restaurant tried it, and the chips became very popular with customers. A marketing executive with Frito-Lay noted the popularity of the new product and made a deal with Alex Foods to start mass producing it. The chips were branded as “Doritos.” In this way, an item that was once garbage at Disneyland became a billion-dollar product for Frito-Lay.10 Another example of remanufacturing waste comes from clothing manufacturer Sea Threads. Sea Threads has become one of the first companies to make clothing from 100% Certified Ocean Plastic. Sea Threads sources raw plastics for textile production directly from the ocean, a source from which very few plastics are recycled. The company collects ocean plastics from the region around Indonesia, where 60% of plastic pollution occurs. The plastics are cleaned, broken down, and extruded into fibers for yarn. They are then woven with textiles and shipped primarily to U.S. companies that then cut the fabric and sew and\/or print it into finished garments. One shirt requires one pound of plastics. The effort thus far is limited, but it has significant potential growth as more companies shift toward marine plastics, resulting in economies of scale and the potential for greater growth in various types of clothing. While this company is utilizing marine plastic waste, all types of recycled or used plastic could be utilized. The firm hopes to be a catalyst for companies to move away from the use of virgin plastics to make clothing.11 Utilize other companies’ waste as raw materials for your products. A chemical company in Europe views resource efficiency as an innovation-driver and source of competitive advantage. It takes waste materials, including chemicals, from other manufacturing sectors and utilizes them as raw materials for the production of many of its standard product offerings. The firm utilizes a full-time committee of scientists, manufacturing personnel, engineers, and other company personnel to identify and investigate raw materials that could be obtained at low cost from other companies’ scrap. By using those waste products, the firm has been able to reduce the cost of manufacturing its chemicals. The company is presently buying more than 50% of its raw materials as scrap from other companies at a much lower cost than acquiring those raw materials in the traditional way. It is interesting to note that this approach has also been employed by a few other chemical companies in Europe and Asia, but it is not yet a widespread practice.12 A similar thought process is utilized by the ethical and sustainable clothing enterprise Progetto Quid. Quid uses production surpluses and end-of-series fabrics that are either donated or purchased at a low cost from other fashion and textile companies to create its own line of limited-edition “unique casual-chic clothes.” Consider “advanced recycling” for plastics. Advanced recycling goes beyond the traditional process for recycling plastics, which involves grinding up and melting down plastic and then compounding it into new material to replace virgin plastic. While the traditional or mechanical recycling of plastic is effective, it can only be used for specific types of plastic. Advanced recycling, according to an article by the chemical company Dow, “works by breaking down plastic through pyrolysis-based heating (thermal heating in the absence of oxygen) into its original molecules to rebuild them into new products.” 13 The molecules can be reused over and over without any deterioration in quality of the plastic. According to Dow, this process can be used for almost all types of plastics. Advanced recycling goes beyond the traditional process for recycling plastics, which involves grinding up and melting down plastic and then compounding it into new material to replace virgin plastic. While the traditional or mechanical recycling of plastic is effective, it can only be used for specific types of plastic. Advanced recycling, according to an article by the chemical company Dow, “works by breaking down plastic through pyrolysis-based heating (thermal heating in the absence of oxygen) into its original molecules to rebuild them into new products.” The molecules can be reused over and over without any deterioration in quality of the plastic. According to Dow, this process can be used for almost all types of plastics. Recycle and resell products that aren’t your own. There are economies of scale associated with reverse logistics, product returns, and refurbishing. For this reason, a large general merchandise retailer in Europe takes back not only all the products that it sells but also products in certain categories (such as electronics and kitchen equipment) that it doesn’t sell. The retailer is able to sell these products to various companies that remanufacture and\/or refurbish the items.14 The approach is similar to what Volvo does at a facility in Sweden where end-of-life automobiles are disassembled and recycled or refurbished and sold as spare parts. In order to get full utilization of its processes and equipment, Volvo takes in other brands of automobiles as well as its own. With product stewardship directives and regulations proliferating in the European Union (EU), this approach helps Volvo reduce the costs of its reverse logistics activities, which transforms the process from a cost center into a profit center. Take a zero-waste approach. According to ReFed, a nonprofit focused on reducing food waste, U.S. restaurants send 11.4 million tons of food waste to landfills each year. Rhodora, a natural wine bar and restaurant in New York City, however, chooses to dispose of food trash a bit differently. Taking a “zero-waste approach,” Rhodora does not send any trash or food waste to landfills. To reach zero-waste, the restaurant has eliminated all vendors that wrap deliveries in single-use plastics. It also shreds its wine boxes into composting material and has a dishwashing setup that converts salt into soap. Instead of plastic wrap, it uses beeswax wrap, which can be reused or composted. Paper menus and anything customers do not eat are composted. All glass products, such as wine bottles, are recycled. Corks are donated to a firm that repurposes the material for shoe soles and yoga blocks. One financial benefit of the restaurant’s zero-waste efforts has been a monthly savings of $300 because trash pickup is not needed. 15 Rhodora can serve as a model not only for other restaurants but also for organizations operating their own in-house lunchrooms or cafeterias. According to ReFed, a nonprofit focused on reducing food waste, U.S. restaurants send 11.4 million tons of food waste to landfills each year. Rhodora, a natural wine bar and restaurant in New York City, however, chooses to dispose of food trash a bit differently. Taking a “zero-waste approach,” Rhodora does not send any trash or food waste to landfills. To reach zero-waste, the restaurant has eliminated all vendors that wrap deliveries in single-use plastics. It also shreds its wine boxes into composting material and has a dishwashing setup that converts salt into soap. Instead of plastic wrap, it uses beeswax wrap, which can be reused or composted. Paper menus and anything customers do not eat are composted. All glass products, such as wine bottles, are recycled. Corks are donated to a firm that repurposes the material for shoe soles and yoga blocks. One financial benefit of the restaurant’s zero-waste efforts has been a monthly savings of $300 because trash pickup is not needed. Rhodora can serve as a model not only for other restaurants but also for organizations operating their own in-house lunchrooms or cafeterias. Reduce the price of products nearing their “best by” date. Forty percent of all food produced in the United States ends up in landfills, where it rots and emits methane.16 Landfills currently account for approximately 14% of total U.S. methane emissions.17 Some companies are implementing innovative strategies to reduce the amount of food that is unsold. The grocery chain Albertsons marks down prices or uses “buy one get one” (BOGO) deals to get customers to buy food items nearing their “best by” date. Albertsons also takes blemished food items and remarkets them under its Fresh Cut program, which repurposes the item, without the blemish, into an item that customers will purchase.18 A grocery retailer in Europe sends texts and emails to members of its frequent shopper club offering price reductions on items nearing expiration. Those price reductions increase as the items get closer to their “best by” date.19 Similarly, New York-based Tops Market has established a “Flashfood” program. Shoppers access the store’s Flashfood app, which lists produce, meat, deli, and bakery products that are nearing their “best-by” dates. These items are marked down and located in a special area of the store where shoppers can pick them up. The discounts are then applied at checkout. As a result of the program, more than 150,000 pounds of food has been diverted from landfills, customers have saved an average of $108 on their grocery spend each month, earnings before interest and taxes (EBIT) have increased by 3% to 5%, and vehicle emissions have been reduced by the equivalent of 667,885 miles driven.20 Implement a closed-loop return service for your products. Touchpoint Oy is a clothing company that manufactures sustainably produced workwear for a variety of businesses in Finland. The company also wants to be “a leading pioneer globally in building textile recycling value chains.”21 According to Touchpoint, Finland produces approximately 100 million kilograms of textile waste every year, with most of that waste being incinerated rather than recycled. Touchpoint is trying to reduce that waste by providing a closed-loop return service for the textiles it sells. The firm takes back the used clothes and recycles them into new textile fiber in its own recycling plant in Rester, Finland. Touchpoint uses the recycled fibers to make yarn and fabric as well as insulating materials for the shipbuilding and construction industries, acoustic panels, composites, nonwoven and filter materials, and other technical textiles, such as the geotextiles. TECHNOLOGY Customers and companies utilize many connected devices that can sense, measure, order, and send alerts to all members of the supply chain. Just as these technologies are changing consumer behaviors, technology is changing the end-to-end supply chain. Companies are finding innovative ways to use not just these new digital solutions but also older technology to address sustainability concerns by improving manufacturing processes, forecasting future technological breakthroughs that have sustainability implications, optimizing transportation routing and scheduling, and calculating carbon emissions. A few examples of innovative approaches include the following: Install solar panels. In 2019, Nestlé unveiled the world’s first solar-powered ice cream kiosk in Malaysia. Each kiosk utilizes solar power from panels installed on its roof. Enough power is generated to keep the ice cream at -25 degrees Celsius and to keep the kiosk operating for three days. Because the kiosk generates its own power, each unit saves up to 263 kg of carbon dioxide emissions each year. From a marketing perspective, kiosks can be set up in remote areas and at high-traffic locations. There is no need to have a source of electricity, which makes the kiosk ideal for recreational locations such as parks and beaches. 22 In 2019, Nestlé unveiled the world’s first solar-powered ice cream kiosk in Malaysia. Each kiosk utilizes solar power from panels installed on its roof. Enough power is generated to keep the ice cream at -25 degrees Celsius and to keep the kiosk operating for three days. Because the kiosk generates its own power, each unit saves up to 263 kg of carbon dioxide emissions each year. From a marketing perspective, kiosks can be set up in remote areas and at high-traffic locations. There is no need to have a source of electricity, which makes the kiosk ideal for recreational locations such as parks and beaches. Proactively forecast future environmental legislation and regulations. A food company in Europe created a permanent working group that is charged with tracking and forecasting potential country or EU environmental legislation and regulations that could impact the firm’s products and supply chains. The working group utilizes the firm’s existing management information systems (MIS) coupled with various external published databases to capture market information about what various national, regional, and local government entities are considering with respect to environmental and sustainability laws, regulations, and directives. As part of the process, it identifies not just potential laws and regulations but also proactive strategies and tactics that would optimize the company’s response to the potential regulation. By doing this, it ensures the company is not caught off guard. The group can develop calculated and structured responses that benefit the firm whenever those laws and regulations are implemented by the country or the EU. 23 A food company in Europe created a permanent working group that is charged with tracking and forecasting potential country or EU environmental legislation and regulations that could impact the firm’s products and supply chains. The working group utilizes the firm’s existing management information systems (MIS) coupled with various external published databases to capture market information about what various national, regional, and local government entities are considering with respect to environmental and sustainability laws, regulations, and directives. As part of the process, it identifies not just potential laws and regulations but also proactive strategies and tactics that would optimize the company’s response to the potential regulation. By doing this, it ensures the company is not caught off guard. The group can develop calculated and structured responses that benefit the firm whenever those laws and regulations are implemented by the country or the EU. Use Google Maps to find the most sustainable route. To reduce fuel consumption of consumers and businesses, Google implemented a new routing model for Google Maps that identifies the most sustainable routes that use the least amount of fuel. 24 To reduce fuel consumption of consumers and businesses, Google implemented a new routing model for Google Maps that identifies the most sustainable routes that use the least amount of fuel. Use software to calculate carbon emissions. C.H. Robinson, one of the world’s largest freight brokerage companies, has developed Emissions IQ, a self-service software that calculates carbon emissions across all forms of transportation. The software analyzes past shipments and calculates an “emission intensity,” or carbon, score. Emissions IQ is available for all truckload and less-than-truckload shipments, as well as rail movements and air and ocean shipments. During the pilot phase, the 125 companies that used Emissions IQ were able to reduce their carbon emissions by 350,000 metric-tons, according to Angie Freeman, chief human resources officer and environmental, social, and corporate governance officer at C.H. Robinson.25 NO LIMITS As the examples in this article show, logistics sustainability initiatives are increasing and are not limited by geography or industry. The examples included in this article are illustrative of the many innovations occurring around the globe. Furthermore, these innovations are happening at small entrepreneurial operations as well as global Fortune 500 companies. It is hoped that readers will gain a broader understanding of the breadth and scope of innovations taking place in logistics management and incorporate them into their own innovative practices and strategies. Notes: 1. PMMI, “2021 Beverage Trends Driving Change,” white paper (May 2021): https:\/\/pmg-designer.s3.amazonaws.com\/FreeDownloads\/PW\/159_PW_Beverage%20Industry%20Trends%20White%20Paper-FINAL.pdf 2. J. Johnson, “Year 2030: The End of Waste-generating Supply Chains,” Supply Chain Brain (February 9, 2020): https:\/\/www.supplychainbrain.com\/articles\/30862-preparing-for-2029-when-cp-supply-chains-can-no-longer-produce-waste 3. R. F. Service, “Hunt for Renewable Plastics Clears a Hurdle,” Science, 371, Issue 6532 (February 2021): 873. 4. A. M. Mohan, “Reusable Corrugated Cases Save Auto Parts Supplier $10M in 24 Months,” Packaging World (March 9, 2022): https:\/\/www.packworld.com\/design\/materials-containers\/article\/22044077\/yanfeng-saves-10m-with-reusable-p2-shipper 5. C. Esposito, “A Sweet Switch,” Happi (April 26, 2020): https:\/\/www.happi.com\/contents\/view_online-exclusives\/2020-04-26\/a-sweet-switch 6. Favini, “Crush Bean: The New Eco-friendly Paper” (September 24, 2015): https:\/\/www.favini.com\/en\/news\/crush-bean-the-new-eco-friendly-paper 7. Happi Staff, “e.l.f. Streamlines Packaging Footprint,” Happi (November 13, 2020): https:\/\/www.happi.com\/contents\/view_breaking-news\/2020-11-13\/elf-streamlines-packaging-footprint 8. Company interview. 9. Company interview. 10. E. Del Valle, “The Surprising Story of How Doritos Were Invented at Disneyland,” Business Insider (May 5, 2014): https:\/\/www.businessinsider.com\/doritos-are-from-disneyland-garbage-the-surprising-history-2014-5 11. T. Duong, “From Pollution to Performance Wear: Fair-Trade Clothes Made From 100% Ocean Plastic,” EcoWatch (August 6, 2021): https:\/\/www.ecowatch.com\/clothes-made-from-ocean-plastic-2654502640.html 12. Company interview. 13. Dow, “Meeting your Corporate Circularity Commitments: Welcome to the Age of Advanced Recycling,” Sustainable Brands Newsletter (November 17, 2021): https:\/\/sustainablebrands.com\/read\/from-purpose-to-action-building-a-sustainable-future-together\/meeting-your-corporate-circularity-commitments-welcome-to-the-age-of-advanced-recycling 14. Company interview. 15. M. Sedacca, “A Restaurant with No Leftovers,” The New York Times (January 1, 2020): https:\/\/www.nytimes.com\/2020\/01\/01\/business\/zero-waste-restaurants.html 16. D. Bernabe, “‘Ugly’ Produce Is Finally Finding a Second Life on the Shelves of Major Grocery Chains,” Fortune (June 7, 2021): https:\/\/fortune.com\/2021\/06\/07\/ugly-produce-grocery-stores-food-waste-walmart-amazon-kroger-albertsons 17. U.S. Environmental Protection Agency, “Basic Information about Landfill Gas,” (April 21, 2023): https:\/\/www.epa.gov\/lmop\/basic-information-about-landfill-gas#methane 18. Bernabe, 202. 19. Company interview. 20. M. Zboraj, “Tops Expands Flashfood Program to 50 Locations,” Progressive Grocer (July 8, 2021): https:\/\/progressivegrocer.com\/tops-expands-flashfood-program-50-locations 21. Touchpoint Oy, “Rester Is Finland’s First Large-scale Textile Recycling Plant” (September 6, 2021): https:\/\/www.touchpoint.fi\/rester 22. N. Z. Othman, “Nestlé Launches World's First Solar-powered Ice Cream Kiosk,” New Straits Times, (March 18, 2019): https:\/\/www.nst.com.my\/lifestyle\/bots\/2019\/03\/470568\/nestl%C3%A9-launches-worlds-first-solar-powered-ice-cream-kiosk 23. Company interview. 24. M. Douglas, “You Bet, We still Care About Sustainability,” Inbound Logistics, 41, no. 6 (June 2021): 34-39. 25. Ibid.","filter_flag":1}
{"title":"The future of materials - Deloitte","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvdGhlLWZ1dHVyZS1vZi1tYXRlcmlhbHMuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvdGhlLWZ1dHVyZS1vZi1tYXRlcmlhbHMuaHRtbNIBAA?oc=5","id":"CBMiWmh0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvdGhlLWZ1dHVyZS1vZi1tYXRlcmlhbHMuaHRtbNIBAA","guidislink":false,"published":"Fri, 02 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=153, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvdGhlLWZ1dHVyZS1vZi1tYXRlcmlhbHMuaHRtbNIBAA?oc=5\" target=\"_blank\">The future of materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deloitte<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The future of materials - Deloitte","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvdGhlLWZ1dHVyZS1vZi1tYXRlcmlhbHMuaHRtbNIBAA?oc=5\" target=\"_blank\">The future of materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deloitte<\/font>","source.href":"https:\/\/www2.deloitte.com","source.title":"Deloitte","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Introduction: Eastman was founded in 1920 in Kingsport, Tennessee, by Eastman Kodak and spun off by Kodak as a new entity in 1994. Today, it is a global specialty materials company that produces a broad range of products for everyday life, such as innovative films for electric vehicles and resins for high-performance medical devices.50 The company’s vision is to continue innovating to make materials that enhance the quality of life while also being a thought and action leader to define the path for circularity globally. To that end, Eastman works closely with others to address the triple challenge: climate change, the global water crisis, and caring for the global population.51 Problem: Kodak operated a methanolysis plant from the mid-1980s to the mid-2000s to chemically recycle used polyesters and manufacture the recycled content into new products. However, customer demand for a sustainable solution was not there, and the economics of that plant declined, eventually leading to its closure.52 Eastman began considering sustainability in its strategy again in the early 2000s.53 At that time, Eastman started to explore once again whether it could innovate around its existing assets to develop more sustainable business practices and how it could work with partners toward common goals to reduce waste and emissions. Solution: In 2019, Eastman announced that it would start two chemical-recycling projects. The first would leverage an existing coal-gasification facility in Kingsport that had initially been completed in 1983 to produce chemicals from syngas rather than from petroleum. This plant would use Carbon Renewal Technology (CRT) to recycle most complex waste plastics (with the exception of PVC (polyvinyl chloride)) into syngas.54 Eastman would then use that syngas to produce acetic acid and other acetyls, building blocks for advanced materials, additives, and fibers.55 The second project would leverage the methanolysis technology originally developed by Kodak in the 1980s to break down PET into MEG and DMT, which Eastman would further manufacture into specialty copolyesters.56 This Polyester Renewal Technology (PRT), a form of depolymerization known as molecular recycling, allows Eastman to recycle polyester waste repeatedly without degradation over time and reduces greenhouse gas (GHG) emissions by 20%–30% compared to processes using fossil fuels.57 One of the biggest challenges facing Eastman within its commercial-scale recycling plants is collecting enough quality feedstock to feed the plant. To help ensure adequate feedstock, Eastman partnered with feedstock providers, invested in its ability to sort plastics (to avoid contamination), identified several different feedstock prototypes based on what’s available in the market, and used process chemistry to optimize those feedstocks. Eastman focused on a low feedstock cost and a premium for recycled products to make the economics work this time.58 Second, Eastman uses a mass-balance approach to track recycled content to receive revenue from its product and associated recycled content. The mass-balance approach traces, measures, and reports the amount of recycled materials used to create a product.59 This method is certified by International Sustainability and Carbon Certification (ISCC) and allows brands to report the percentage of recycled content allocated to their manufactured products. This way, brands can demonstrate that they have met their recycled content targets. Benefits: Chemical recycling has already helped reduce waste and emissions for Eastman and its partners. Eastman reports that it recycled more than 12 million pounds (about 5,500 metric tons) of plastic waste in 2021.60 And Eastman’s customers can benefit by acquiring recycled content to meet their emissions and waste targets. Eastman’s CRT process is also estimated to reduce GHG emissions by 20%–50% compared to processes using fossil fuels,61 and its PRT process is expected to reduce emissions by 20%–30%.62 The future: Eastman is expected to begin operations at its PRT plant in Kingsport later this year and has already announced two new PRT projects—one in France and another in the United States. The plant in France is expected to come online in 2026,63 with more than 80% of feedstock under definitive agreements and most rPET-packaging offtake under definitive agreements.64 Eastman has committed to recycling more than 250 million pounds (about 114,000 metric tons) of plastic by 2025 and more than 500 million pounds (about 227,000 metric tons) by 2030.65 The company also plans to innovate new ways to optimize its supply chain through waste takeback strategies, including pre- and postconsumer waste or forming a closed-loop system through brand partnerships. Eastman has noted two helpful market trends as it expands its recycling capabilities. First, companies are beginning to design products with recyclability in mind. This has led to simplifying the plastics used in a product so that sorting and recycling are easier. Second, companies are beginning to use preconsumer and postconsumer waste, expanding access to noncontaminated plastics feedstock.66","filter_flag":1}
{"title":"Pernod Ricard unveils packaging sustainability updates across portfolio - Packaging Europe","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vcGFja2FnaW5nZXVyb3BlLmNvbS9uZXdzL3Blcm5vZC1yaWNhcmQtdW52ZWlscy1wYWNrYWdpbmctc3VzdGFpbmFiaWxpdHktdXBkYXRlcy1hY3Jvc3MtcG9ydGZvbGlvLzk5MzMuYXJ0aWNsZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vcGFja2FnaW5nZXVyb3BlLmNvbS9uZXdzL3Blcm5vZC1yaWNhcmQtdW52ZWlscy1wYWNrYWdpbmctc3VzdGFpbmFiaWxpdHktdXBkYXRlcy1hY3Jvc3MtcG9ydGZvbGlvLzk5MzMuYXJ0aWNsZdIBAA?oc=5","id":"CBMidWh0dHBzOi8vcGFja2FnaW5nZXVyb3BlLmNvbS9uZXdzL3Blcm5vZC1yaWNhcmQtdW52ZWlscy1wYWNrYWdpbmctc3VzdGFpbmFiaWxpdHktdXBkYXRlcy1hY3Jvc3MtcG9ydGZvbGlvLzk5MzMuYXJ0aWNsZdIBAA","guidislink":false,"published":"Thu, 15 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=15, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=166, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vcGFja2FnaW5nZXVyb3BlLmNvbS9uZXdzL3Blcm5vZC1yaWNhcmQtdW52ZWlscy1wYWNrYWdpbmctc3VzdGFpbmFiaWxpdHktdXBkYXRlcy1hY3Jvc3MtcG9ydGZvbGlvLzk5MzMuYXJ0aWNsZdIBAA?oc=5\" target=\"_blank\">Pernod Ricard unveils packaging sustainability updates across portfolio<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Europe<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Pernod Ricard unveils packaging sustainability updates across portfolio - Packaging Europe","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vcGFja2FnaW5nZXVyb3BlLmNvbS9uZXdzL3Blcm5vZC1yaWNhcmQtdW52ZWlscy1wYWNrYWdpbmctc3VzdGFpbmFiaWxpdHktdXBkYXRlcy1hY3Jvc3MtcG9ydGZvbGlvLzk5MzMuYXJ0aWNsZdIBAA?oc=5\" target=\"_blank\">Pernod Ricard unveils packaging sustainability updates across portfolio<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Europe<\/font>","source.href":"https:\/\/packagingeurope.com","source.title":"Packaging Europe","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Pernod Ricard is pursuing circularity in its high-end drinks packaging by removing unnecessary box packaging from its portfolios, designing a glass flagon for its Royal Salute Scotch, and creating lighter, recyclable bottles for its Perrier-Jouët champagne. All gift boxes are set to be removed from its Jameson Irish Whiskey range in an effort to save around 4 million single use cartons in the next two years. The secondary packaging will gradually be removed from whiskey packaging sold in store between now and the end of 2025. Similar changes will apply across the Irish Distillers portfolio, including the removal of gift boxes from its Powers, Spot Whiskeys, and Knappogue Castle brands. Gift packs containing secondary items like hipflasks or drinking glasses are also set to be 100% recyclable and FSC-certified, with new products said to be examined by an eco-design tool to ensure their compliance with Pernod Ricard’s ‘circular making’ strategy. Meanwhile, Aberlour whisky will also phase out all non-recyclable box packaging, and Royal Salute Scotch will be packaged in a coated glass flagon. As well as claiming to be recyclable, the flagon is expected to offer a lower carbon footprint due to its less energy-intensive production process. Perrier-Jouët has already been packaged in a new gift box: Perrier-Jouët Belle Epoque Cocoon, which is made from paper pulp and vine shoots and is said to weigh only 49 grams. Reportedly, this cuts down the weight of the previous gift box design by 93%. Any decoration is embossed directly onto the new packaging in a bid to minimise the use of varnish, glue, and print. Over 90% of packaging waste generated at Perrier-Jouët’s champagne House is sorted and recycled, Pernod Ricard claims. However, a ‘significant portion’ of a champagne bottle’s environmental footprint is said to come from glass. Therefore, Maison Perrier-Jouët is collaborating with its glass suppliers to lightweight its bottles. The House expects to cellar its three Perrier-Jouët Belle Epoque vintage cuvées in bottles made of green glass from 2024. These bottles claim to contain 85% recycled glass and protect the wine from light throughout its value chain. Additionally, Pernod Ricard has partnered with the Ellen MacArthur Foundation in pursuit of its sustainability goals. All its secondary packaging is hoped to become recyclable, reusable, compostable, or completely removed by late 2025. Its 2030 Sustainability & Responsibility roadmap, ‘Good Times from a Good Place’, also involves the development of Global Sustainable Packaging and POS Guidelines for its 70 affiliates. These provide specific guidance regarding materials the company no longer uses and which alternatives can be used to replace them. Earlier this summer, Pernod Ricard’s venture capital fund, Convivialité Ventures, took a minority share in ecoSPIRITS in an effort to close the loop on premium wine and spirits distribution. Waitrose has removed plastic and foil sleeves from the necks of its own-brand wine bottles; DS Smith and Laylo have sought to enhance the sustainability metrics of the latter’s premium boxed wine packaging; and Fourth Wave Wine has unveiled what claims to be the first label-less wine bottle with the intention of reducing packaging waste. If you liked this article, you might also enjoy: McDonald’s Director of Sustainability in Europe on the company’s approach to packaging sustainability McKinsey on whether or not on-pack sustainability claims affect consumer spending Perspectives from industry-leading experts on the EU’s Packaging and Packaging Waste Directive revisions A deep dive into the most important packaging sustainability trends and solutions","filter_flag":1}
{"title":"Gen Z business owner gains notoriety after showing his sustainable aluminum packaging - Yahoo Life","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LnlhaG9vLmNvbS9saWZlc3R5bGUvZ2VuLXotYnVzaW5lc3Mtb3duZXItZ2FpbnMtMTk1NDQ0MzMyLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LnlhaG9vLmNvbS9saWZlc3R5bGUvZ2VuLXotYnVzaW5lc3Mtb3duZXItZ2FpbnMtMTk1NDQ0MzMyLmh0bWzSAQA?oc=5","id":"CBMiSWh0dHBzOi8vd3d3LnlhaG9vLmNvbS9saWZlc3R5bGUvZ2VuLXotYnVzaW5lc3Mtb3duZXItZ2FpbnMtMTk1NDQ0MzMyLmh0bWzSAQA","guidislink":false,"published":"Wed, 14 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=165, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LnlhaG9vLmNvbS9saWZlc3R5bGUvZ2VuLXotYnVzaW5lc3Mtb3duZXItZ2FpbnMtMTk1NDQ0MzMyLmh0bWzSAQA?oc=5\" target=\"_blank\">Gen Z business owner gains notoriety after showing his sustainable aluminum packaging<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Life<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Gen Z business owner gains notoriety after showing his sustainable aluminum packaging - Yahoo Life","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LnlhaG9vLmNvbS9saWZlc3R5bGUvZ2VuLXotYnVzaW5lc3Mtb3duZXItZ2FpbnMtMTk1NDQ0MzMyLmh0bWzSAQA?oc=5\" target=\"_blank\">Gen Z business owner gains notoriety after showing his sustainable aluminum packaging<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Life<\/font>","source.href":"https:\/\/www.yahoo.com","source.title":"Yahoo Life","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"A streetwear clothing company called Canned Goods (@cannedgoodsclothing) has gained praise and admiration from millions of people on TikTok after showing off its unique, earth-friendly packaging. Instead of using plastic and cardboard boxes like many other apparel companies, Canned Goods — who has “Reduce plastic waste” in its TikTok bio — opts for a recyclable,aluminum can. This method helps the company sort through sizes faster, protects the product from potential shipping damages and reduces the amount of waste created. The official Canned Goods TikTok page posted a video explaining why it uses aluminum cans instead of plastic, and received a massive amount of adoration from the over 6 million viewers. “Just ordered 2 shirts cause of this video, great designs and video,” replied @_tautuka. “First time a brand actually caught my attention in tik tok,” replied @fijilovesme. Whether by traditional recycling or upcycling the can for other purposes, Canned Goods wants the package to be used as much as the product. “I started Canned Goods in high school when I was tired of receiving everything in plastic,” founder Easton Dana (@Easton.dana) said in the video above. “I even go as far as to include flower seeds with every order to promote planting in your cans.” Dana, who is just 19 years old, recently finished his freshman year at Arizona State University. The brand was initially named Easy Skate Co. and sold skateboarding focused apparel, but then expanded to general streetwear as more eyes came to the company. Earlier this year, Dana told The Sun Press, the school newspaper for Arizona State, that a 2022 Forbes article indicating that consumers weren’t as interested in sustainably shopping inspired him to lean into this type of packaging for his brand. According to a 2022 study done by The Organization for Economic Cooperation and Development, plastic production is double what it was two decades ago. However, only 9% of plastic is being recycled. Not only is the company set on using sustainable packaging, but a portion of every sale is donated to remove a pound of plastic from the ocean. With the recent boost in visibility, getting a piece of merchandise may be slightly harder than anticipated. Currently, 10 of the 16 available items on the website are sold out. The company announced the release of new products nearly three weeks ago, but with the amount of new potential customers, there may be more aluminum cans being shipped. In The Know by Yahoo is now available on Apple News — follow us here! The post Gen Z business owner gains notoriety after showing his sustainable aluminum packaging appeared first on In The Know. More from In The Know: Woman is rushed to urgent care after drinking boba tea pearls: 'Y’all this was a mistake' TikTok can’t stop raving about Abercrombie jean shorts — these 6 pairs are worth a purchase The 7 best men's chinos you'll be so glad you got on sale — Bonobos, J.Crew, Nordstrom and more Woman outlines how to manage adult friendships, revealing that not everyone can be your ‘everything friend’: ‘It feels like it should be all or nothing’","filter_flag":1}
{"title":"Fewer than 24% of consumers use refillable skin care, study finds - Cosmetics Business","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vY29zbWV0aWNzYnVzaW5lc3MuY29tL2Zld2VyLXRoYW4tMjQtb2YtY29uc3VtZXJzLXVzZS1yZWZpbGxhYmxlLXNraW4tY2FyZS1zdHVkeS1maW5kcy0yMDkzNzDSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vY29zbWV0aWNzYnVzaW5lc3MuY29tL2Zld2VyLXRoYW4tMjQtb2YtY29uc3VtZXJzLXVzZS1yZWZpbGxhYmxlLXNraW4tY2FyZS1zdHVkeS1maW5kcy0yMDkzNzDSAQA?oc=5","id":"CBMiZGh0dHBzOi8vY29zbWV0aWNzYnVzaW5lc3MuY29tL2Zld2VyLXRoYW4tMjQtb2YtY29uc3VtZXJzLXVzZS1yZWZpbGxhYmxlLXNraW4tY2FyZS1zdHVkeS1maW5kcy0yMDkzNzDSAQA","guidislink":false,"published":"Thu, 08 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=159, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vY29zbWV0aWNzYnVzaW5lc3MuY29tL2Zld2VyLXRoYW4tMjQtb2YtY29uc3VtZXJzLXVzZS1yZWZpbGxhYmxlLXNraW4tY2FyZS1zdHVkeS1maW5kcy0yMDkzNzDSAQA?oc=5\" target=\"_blank\">Fewer than 24% of consumers use refillable skin care, study finds<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cosmetics Business<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Fewer than 24% of consumers use refillable skin care, study finds - Cosmetics Business","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vY29zbWV0aWNzYnVzaW5lc3MuY29tL2Zld2VyLXRoYW4tMjQtb2YtY29uc3VtZXJzLXVzZS1yZWZpbGxhYmxlLXNraW4tY2FyZS1zdHVkeS1maW5kcy0yMDkzNzDSAQA?oc=5\" target=\"_blank\">Fewer than 24% of consumers use refillable skin care, study finds<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cosmetics Business<\/font>","source.href":"https:\/\/cosmeticsbusiness.com","source.title":"Cosmetics Business","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Refillable beauty packaging is being embraced by names including Charlotte Tilbury, Stella McCartney and Prada. In 2022, sales of make-up refills soared 364%, according to data from market research firm The NPD group – and refills remain a popular way of balancing a greener approach with luxury packaging cues. But a new market survey has revealed that, although 79.3% of consumers view sustainability as important when making purchasing decisions, only 23.4% currently use refillable skin care products. For serums, lotions and other personal care products, just 5% opted for refillable options, with fewer than 1% using perfume refills. The study was carried out by sustainable skin care company BareLUXE, with survey respondents primarily US-based, female and between the ages of 30-34. Responses flagged several potential factors behind the gap between the percentage of consumers interested in sustainable packaging and those actively seeking refills. More than half of those surveyed (50.6%) had been put off by difficulty finding available options, while 36.8% mentioned non-availability from preferred brands as a reason. Concern about product contamination and spillage was an issue for 31%, and 17% cited scepticism about the actual sustainability of refills. Refills from skin care brand BareLUXE, which carried out the survey BareLUXE’s study also shed light on incentives likely to increase consumer adoption. These included substantial proof of impact (34%); competitive pricing (34%); or the introduction of refillable options by their favoured brands (43%). Only 4% of those surveyed stated that they were unlikely to be convinced. The study also surveyed skin care brands, with many citing concerns about logistics, contamination and high costs as barriers to implementation. Both brands and consumers agreed that in-store refilling of large containers represents the most sustainable choice, but also that the practicalities of this method make it the most complicated option to implement. “There’s a clear need for more transparency, collaboration and shared understanding between brands, retailers and consumers,” said Dr Heather Smith, founder and CEO of BareLUXE. “Releasing this data is just one step towards answering some questions.” Read more:","filter_flag":1}
{"title":"Coveris and Pollen + Grace unveil sustainable packaging with shelf stand-out - Food and Drink Technology","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmZvb2RhbmRkcmlua3RlY2hub2xvZ3kuY29tL25ld3MvNDgxMTcvY292ZXJpcy1hbmQtcG9sbGVuLWdyYWNlLXVudmVpbC1zdXN0YWluYWJsZS1wYWNrYWdpbmctd2l0aC1zaGVsZi1zdGFuZC1vdXQv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmZvb2RhbmRkcmlua3RlY2hub2xvZ3kuY29tL25ld3MvNDgxMTcvY292ZXJpcy1hbmQtcG9sbGVuLWdyYWNlLXVudmVpbC1zdXN0YWluYWJsZS1wYWNrYWdpbmctd2l0aC1zaGVsZi1zdGFuZC1vdXQv0gEA?oc=5","id":"CBMifWh0dHBzOi8vd3d3LmZvb2RhbmRkcmlua3RlY2hub2xvZ3kuY29tL25ld3MvNDgxMTcvY292ZXJpcy1hbmQtcG9sbGVuLWdyYWNlLXVudmVpbC1zdXN0YWluYWJsZS1wYWNrYWdpbmctd2l0aC1zaGVsZi1zdGFuZC1vdXQv0gEA","guidislink":false,"published":"Thu, 22 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=173, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmZvb2RhbmRkcmlua3RlY2hub2xvZ3kuY29tL25ld3MvNDgxMTcvY292ZXJpcy1hbmQtcG9sbGVuLWdyYWNlLXVudmVpbC1zdXN0YWluYWJsZS1wYWNrYWdpbmctd2l0aC1zaGVsZi1zdGFuZC1vdXQv0gEA?oc=5\" target=\"_blank\">Coveris and Pollen + Grace unveil sustainable packaging with shelf stand-out<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food and Drink Technology<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Coveris and Pollen + Grace unveil sustainable packaging with shelf stand-out - Food and Drink Technology","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmZvb2RhbmRkcmlua3RlY2hub2xvZ3kuY29tL25ld3MvNDgxMTcvY292ZXJpcy1hbmQtcG9sbGVuLWdyYWNlLXVudmVpbC1zdXN0YWluYWJsZS1wYWNrYWdpbmctd2l0aC1zaGVsZi1zdGFuZC1vdXQv0gEA?oc=5\" target=\"_blank\">Coveris and Pollen + Grace unveil sustainable packaging with shelf stand-out<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food and Drink Technology<\/font>","source.href":"https:\/\/www.foodanddrinktechnology.com","source.title":"Food and Drink Technology","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Teamwork between Coveris and a plant-based food-to-go business has delivered new vibrant packaging for Pollen + Grace’s range of nutritious fresh salads. As part of its commitment to making eating better food easy, Coveris wanted the new packaging to enhance the salads’ shelf presence and communicate the brand’s values to consumers. The sustainably sourced board sleeves and square kraft bowls, with PE coating, prevent moisture ingress and are complemented by clear mono rPET lids which contain a minimum of 30% recycled content. Pollen + Grace believes the development helps differentiate the salads from others on shelf as brand presence is enhanced. The bowls are also stackable, helping support product visibility and shelf utilisation, meaning consumers are able to easily identify and engage with Pollen + Grace’s visually appealing range of salads. Utilising Coveris’ print expertise, colour management improvements have been made to the salads’ board sleeves to ensure that a premium colour standard is maintained. Paul Robertson, Coveris’ food-on-the-move sales director said the business is delighted to partner with Pollen + Grace to develop a vibrant and eye-catching packaging solution that is visually impactful on the shelf. “Complementing the salads’ quality and freshness, Pollen + Grace’s new packaging conveys the vibrancy of their ingredients and brand values excellently,” he noted. Rosanna McCallum, Pollen + Grace’s head of operations said that after spending years perfecting the salads, the food-to-go business is delighted to deliver against a long running promise: to use new recyclable packaging together with recycled content, building a circular economy for our packaging. “It’s been a pleasure collaborating with the Coveris team, who helped us get this important packaging project over the line against tight time constraints. Our products have never looked better on shelf, and we are so proud of the recyclability credentials the packaging solution offers as part of our wider brand mission to help people eat better,” she added. Coveris will be at lunch! 2023 on stand L1147, 27-28 September, with its latest food-on-the-move innovations and will highlight its sustainability vision of No Waste. Related content","filter_flag":1}
{"title":"Uber needs you to make greener choices so it can go carbon neutral by 2030 - The Verge","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LnRoZXZlcmdlLmNvbS8yMDIzLzYvOC8yMzc1MjcyMS91YmVyLWV2LXViZXItZWF0cy10YWtlb3V0LWNvbnRhaW5lcnMtY2FyLXNoYXJpbmfSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LnRoZXZlcmdlLmNvbS8yMDIzLzYvOC8yMzc1MjcyMS91YmVyLWV2LXViZXItZWF0cy10YWtlb3V0LWNvbnRhaW5lcnMtY2FyLXNoYXJpbmfSAQA?oc=5","id":"CBMiW2h0dHBzOi8vd3d3LnRoZXZlcmdlLmNvbS8yMDIzLzYvOC8yMzc1MjcyMS91YmVyLWV2LXViZXItZWF0cy10YWtlb3V0LWNvbnRhaW5lcnMtY2FyLXNoYXJpbmfSAQA","guidislink":false,"published":"Thu, 08 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=159, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LnRoZXZlcmdlLmNvbS8yMDIzLzYvOC8yMzc1MjcyMS91YmVyLWV2LXViZXItZWF0cy10YWtlb3V0LWNvbnRhaW5lcnMtY2FyLXNoYXJpbmfSAQA?oc=5\" target=\"_blank\">Uber needs you to make greener choices so it can go carbon neutral by 2030<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Verge<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Uber needs you to make greener choices so it can go carbon neutral by 2030 - The Verge","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LnRoZXZlcmdlLmNvbS8yMDIzLzYvOC8yMzc1MjcyMS91YmVyLWV2LXViZXItZWF0cy10YWtlb3V0LWNvbnRhaW5lcnMtY2FyLXNoYXJpbmfSAQA?oc=5\" target=\"_blank\">Uber needs you to make greener choices so it can go carbon neutral by 2030<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Verge<\/font>","source.href":"https:\/\/www.theverge.com","source.title":"The Verge","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Uber is introducing a host of new product features aimed at steering its customers toward greener choices. The product features, which were unveiled at an event in London today, are also intended to boost the company’s chances of reaching its sustainability goals, which have it going completely carbon neutral in North America and Europe by 2030 and in all global markets by 2040. Some of the new products are not ready for a global rollout, but the overall aim is to use its platform to encourage riders and drivers to make more environmentally friendly decisions — even if the vast majority of Uber’s business relies on gas-guzzling vehicles. Some of that involves subtle nudges, like new emissions notifications or improved routing, while others will entail more pressure, such as squeezing cooperation out of partners (drivers, restaurants, etc.) that don’t technically work for Uber. Uber Eats is going green One of the major announcements to come out of the event is the news that Uber Eats is going green. Along with its ridehailing business, the company claims its popular food delivery service will be completely carbon neutral globally by 2040. It’s an ambitious plan, seeing as how it will require all 800,000 restaurants on the company’s delivery platform — everything from global fast-food franchises to small mom-and-pops — to go carbon neutral as well. Here’s a list of some of the new features that Uber is announcing today: EVs Last year, Uber launched Comfort Electric in a handful of cities, the list of which has been steadily growing since then. Only premium EVs, like Tesla, Polestar, and Ford Mustang Mach-E, would be considered eligible for Comfort Electric trips. (Sorry, Nissan Leaf and Chevy Bolt.) It will sit alongside the company’s other EV product, Uber Green, which gives drivers an extra fee (usually $1) to use electric or hybrid vehicles. Uber announced today that Uber Green is launching in Australia as well, bringing it up to 140 cities globally. Another new feature: when they open the app, customers who use Uber’s EV-hailing products will see a notification informing them how much emissions they avoided expelling into the atmosphere. The company sees it as a little bit of positive reinforcement to encourage them to keep using these services. Uber engineers also designed a new feature who EV drivers that will better integrate charging information into Uber’s driver app. When it rolls out later this year, the new feature uses machine learning to recommend when and where drivers should charge, both while on the road and when planning ahead. This is based on uploading information about the driver’s EV into the Uber app. The app will also filter trip requests based on a driver’s battery level to hopefully make the at-charger experience more seamless. The company is also developing a new product called Battery-Aware Matching, which filters trip requests based on an EV’s battery level. This way, drivers can take trips that end near a charger and avoid trips that are too long for their battery. And in the near future, drivers will be able to use their app to begin their charge, monitor its progress, and pay. It’s not clear which vehicles will be eligible for this feature, given it will rely on some level of connectivity that will allow it to integrate, for example, the state of charge on the battery into Uber’s app. The company is also developing a new product called Battery-Aware Matching Considering most of Uber’s business revolves around trips to the airport, the company announced new “green curbs” for its EV drivers at participating airports, where customers can find their vehicle in a dedicated pickup zone. And for drivers, Uber is offering discounted or occasionally free charging at airport charging stations. Uber now says it has 60,000 drivers using electric vehicles in North America and Europe, with the bulk of those drivers — 10,000 — operating just in London. The company has previously announced it plans to electrify its fleet in London by 2025. Of course, getting the hundreds of thousands of people who drive for Uber to switch to electric vehicles will be no easy task. Ridehail drivers are classified as independent contractors, and many use their personal cars to drive for not just one but several gig economy companies. Uber can’t just force all its drivers to make the switch without jeopardizing their status as freelancers. Also, EVs tend to be more expensive than gas vehicles, despite costing less to fuel and maintain. That steep upfront cost may make it a challenge for many drivers, who typically operate with incredibly tight margins. Uber Eats Uber is adding a new feature to Eats that will allow customers to search for restaurants that offer sustainable packaging. That will only be available in London, Paris, Amsterdam, New York City, San Francisco, and Taipei to start out. But it will take a lot more than sustainable packaging for Uber to credibly claim it has de-carbonized its delivery business. Dara Khosrowshahi, the company’s CEO, acknowledged that in a blog post while announcing that Uber is teaming up with the World Wildlife Fund to develop a toolkit of discounts, incentives, and advocacy. “We know we can’t do this alone and we have a lot to learn,” Khosrowshahi said, “especially when it comes to more sustainable packaging.” Bikes, car-sharing, and carpooling Uber is rolling out several new updates aimed at reducing the need to own a car. More bikes will be introduced on Uber’s app thanks to a partnership with Tembici in Latin America. (Uber has had a rocky relationship with bike-sharing services.) In addition, the company is launching a car-sharing service — again. (The company has experimented with car-sharing through partnerships with startups like Getaround but has never really stuck with it.) This time, Uber is building off its acquisition of Australian car-sharing service Car Next Door to relaunch car-sharing in that country, as well as Boston and Toronto. The company’s rebranded carpooling service, UberX Share, is coming to more cities — even as rival Lyft turns its back on carpooling. It will be available in 18 cities in the US and over 50 globally, making it one of the biggest carpooling services in the world. The company claims it has totally redesigned the underlying technology to improve the product so drivers don’t hate it so much. The takeaway Of course, it’s good that Uber is doing more to make its environmentally friendly products more attractive to its customers. But there’s really only so much the company can do absent of strong legislation requiring drivers to switch to non-polluting vehicles. Fortunately, a bunch of governments have already done that. London has such high rates of EV owners driving for Uber because of the city’s rigorous clear-air laws. In 2020, the city implemented ultra-low emission zones, in which vehicles are charged a fee based on the amount of emissions they produce. No cities in the US have anything similar. The closest is New York City’s congestion pricing scheme, which is still struggling to go into effect. Other states have their own approach to forcing Uber to go electric. California adopted new rules in 2021 requiring ridesharing companies to electrify their fleets by 2030 — a few years before the state expects to prohibit the sale of new gas cars completely. And New York City said it would do the same, requiring all for-hire vehicles to be electric by 2030.","filter_flag":1}
{"title":"The Chinet® brand enhances product line with new sustainable products - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvdGhlLWNoaW5ldC1icmFuZC1lbmhhbmNlcy1wcm9kdWN0LWxpbmUtd2l0aC1uZXctc3VzdGFpbmFibGUtcHJvZHVjdHMtMzAxODQxMzIzLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvdGhlLWNoaW5ldC1icmFuZC1lbmhhbmNlcy1wcm9kdWN0LWxpbmUtd2l0aC1uZXctc3VzdGFpbmFibGUtcHJvZHVjdHMtMzAxODQxMzIzLmh0bWzSAQA?oc=5","id":"CBMifGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvdGhlLWNoaW5ldC1icmFuZC1lbmhhbmNlcy1wcm9kdWN0LWxpbmUtd2l0aC1uZXctc3VzdGFpbmFibGUtcHJvZHVjdHMtMzAxODQxMzIzLmh0bWzSAQA","guidislink":false,"published":"Tue, 06 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=157, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvdGhlLWNoaW5ldC1icmFuZC1lbmhhbmNlcy1wcm9kdWN0LWxpbmUtd2l0aC1uZXctc3VzdGFpbmFibGUtcHJvZHVjdHMtMzAxODQxMzIzLmh0bWzSAQA?oc=5\" target=\"_blank\">The Chinet® brand enhances product line with new sustainable products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Chinet® brand enhances product line with new sustainable products - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvdGhlLWNoaW5ldC1icmFuZC1lbmhhbmNlcy1wcm9kdWN0LWxpbmUtd2l0aC1uZXctc3VzdGFpbmFibGUtcHJvZHVjdHMtMzAxODQxMzIzLmh0bWzSAQA?oc=5\" target=\"_blank\">The Chinet® brand enhances product line with new sustainable products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"DE SOTO, Kan., June 6, 2023 \/PRNewswire\/ -- The Chinet® brand has introduced two new products, both of which aim to help reduce waste — The Chinet Classic® recycled clear cups and Chinet Classic® compostable straws. Both products are now available at select Target stores and Target.com. Chinet Classic® Compostable Straw Chinet Classic® Recycled Clear Cup The Chinet Classic® recycled clear cups are made from 100% recycled material and are available in a pack of 32, 17oz. cups, which recycles the equivalent of 51 plastic water bottles. The Chinet Classic® compostable straws are commercially compostable while maintaining the feel and durability of traditional plastic straws. They are sold in packs of 50 straws, which are sold separately from the recycled cups. \"For nearly 100 years, the Chinet® brand has believed that when people get together, powerful things can take place. Together, we can make a difference in protecting our planet for future generations,\" said Jordan Everett, Product Manager for the Chinet® brand. \"The Chinet® brand is on a mission to bring more sustainable products to your gatherings by offering products made from recycled materials and that are commercially compostable.\" Huhtamaki, the makers of the Chinet® brand, is committed to designing all its products to be recyclable, compostable or reusable and achieve carbon-neutral production by 2030. Along with the launches of these new products, they have taken several steps over the past year, such as the launching of ICON®, a recyclable ice cream packaging alternative. Read more about the company's sustainability efforts and other news here. About the Chinet® brand The Chinet® brand, a premium disposable tableware brand, was proudly created in the USA in the 1930s. With a long heritage of innovation, the Chinet® brand offers a full range of products designed for the experience. This includes everyday tableware in the Chinet Classic® line, premium partyware in the Chinet Crystal® line and insulated hot cups in the Chinet Comfort® line. For more information, visit MyChinet.com or stay connected with the brand on Facebook, Instagram, Pinterest and Twitter. About Huhtamaki Huhtamaki is a leading global provider of sustainable packaging solutions for consumers around the world. Our innovative products protect on-the-go and on-the-shelf food and beverages, and personal care products, ensuring hygiene and safety, driving accessibility and affordability, and helping prevent food waste. We embed sustainability in everything we do. We are committed to achieving carbon neutral production and designing all our products to be recyclable, compostable or reusable by 2030. Our blueloop™ sustainable packaging solutions are world-leading and designed for circularity. We are a participant in the UN Global Compact, Huhtamaki is rated 'A' on the MSCI ESG Ratings assessment and EcoVadis has awarded Huhtamaki with the Gold medal for performance in sustainability. To play our part in managing climate change, we have set science-based targets that have been approved and validated by the Science-Based Targets initiative. With 100 years of history and a strong Nordic heritage we operate in 37 countries and 116 operating locations around the world. Our values Care Dare Deliver guide our decisions and help our team of around 19 000 employees make a difference where it matters. Our 2022 net sales totalled EUR 4.5 billion. Huhtamaki Group is headquartered in Espoo, Finland and our parent company, Huhtamäki Oyj, is listed on Nasdaq Helsinki Ltd. Find out more about how we are protecting food, people and the planet at www.huhtamaki.com. SOURCE The Chinet® brand","filter_flag":1}
{"title":"ITC scales up its sustainable packaging offerings - printweek","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LnByaW50d2Vlay5pbi9uZXdzL2l0Yy1zY2FsZXMtdXAtaXRzLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1vZmZlcmluZ3MtNTc2MjDSAVtodHRwczovL3d3dy5wcmludHdlZWsuaW4vbmV3cy9pdGMtc2NhbGVzLXVwLWl0cy1zdXN0YWluYWJsZS1wYWNrYWdpbmctb2ZmZXJpbmdzLTU3NjIwP2FtcD0x?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LnByaW50d2Vlay5pbi9uZXdzL2l0Yy1zY2FsZXMtdXAtaXRzLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1vZmZlcmluZ3MtNTc2MjDSAVtodHRwczovL3d3dy5wcmludHdlZWsuaW4vbmV3cy9pdGMtc2NhbGVzLXVwLWl0cy1zdXN0YWluYWJsZS1wYWNrYWdpbmctb2ZmZXJpbmdzLTU3NjIwP2FtcD0x?oc=5","id":"CBMiVWh0dHBzOi8vd3d3LnByaW50d2Vlay5pbi9uZXdzL2l0Yy1zY2FsZXMtdXAtaXRzLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1vZmZlcmluZ3MtNTc2MjDSAVtodHRwczovL3d3dy5wcmludHdlZWsuaW4vbmV3cy9pdGMtc2NhbGVzLXVwLWl0cy1zdXN0YWluYWJsZS1wYWNrYWdpbmctb2ZmZXJpbmdzLTU3NjIwP2FtcD0x","guidislink":false,"published":"Tue, 06 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=157, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LnByaW50d2Vlay5pbi9uZXdzL2l0Yy1zY2FsZXMtdXAtaXRzLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1vZmZlcmluZ3MtNTc2MjDSAVtodHRwczovL3d3dy5wcmludHdlZWsuaW4vbmV3cy9pdGMtc2NhbGVzLXVwLWl0cy1zdXN0YWluYWJsZS1wYWNrYWdpbmctb2ZmZXJpbmdzLTU3NjIwP2FtcD0x?oc=5\" target=\"_blank\">ITC scales up its sustainable packaging offerings<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">printweek<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ITC scales up its sustainable packaging offerings - printweek","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LnByaW50d2Vlay5pbi9uZXdzL2l0Yy1zY2FsZXMtdXAtaXRzLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1vZmZlcmluZ3MtNTc2MjDSAVtodHRwczovL3d3dy5wcmludHdlZWsuaW4vbmV3cy9pdGMtc2NhbGVzLXVwLWl0cy1zdXN0YWluYWJsZS1wYWNrYWdpbmctb2ZmZXJpbmdzLTU3NjIwP2FtcD0x?oc=5\" target=\"_blank\">ITC scales up its sustainable packaging offerings<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">printweek<\/font>","source.href":"https:\/\/www.printweek.in","source.title":"printweek","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"On World Environment Day on 5 June, ITC reaffirmed its commitment to address the issue of plastic waste management through its multi-dimensional initiatives. Powered by its Sustainability 2.0 vision articulated by chairman and MD, Sanjiv Puri, the company has been scaling up its investment in developing innovative and eco-friendly packaging solutions that can substitute single-use plastics. ITC is working towards ensuring that 100% of packaging is reusable, recyclable or compostable\/biodegradable ITC sustained its plastic neutrality status for the second consecutive year by sustainably managing 60,000-mt of plastic waste in FY23, which is more than the amount of packaging utilised. B Sumant, executive director, ITC, said, “At ITC, we have put in place comprehensive interventions for waste management with a focus on plastics. Our paperboards, paper and packaging businesses continue to pioneer sustainable packaging solutions that can substitute single-use plastics. Many of our brands and businesses have also innovated to reduce the usage of plastics in line with our commitment to creating a positive environmental footprint.” ITC's paperboards, paper and packaging businesses are at the forefront of innovation in packaging solutions which substitute the use of single-use plastics. The company has pioneered sustainable packaging options through extensive research conducted at its Life Sciences and Technology Centre on laminated and moulded fibre platforms, among others. It has developed a range of eco-friendly products, including recyclable paperboards named FiloPack and FiloServe, as well as two biodegradable paperboards, OmegaBev and OmegaBarr. These paperboards provide effective alternatives to plastic-coated containers and cups used in deep freeze applications. Addressing the issue of plastic food containers for delivery, the paperboards business has introduced the IndoBowl, a paperboard-based product that replaces traditional plastic containers. Additionally, it has developed high-strength, multi-layered paper products as a substitute for single-use plastic cutlery and the WrapWell food wrapping paper that is designed to be food-grade, eco-friendly, oil and grease resistant, and microwave-safe. ITC’s Packaging business spans both fibre-based and plastic laminate offerings. The business is accelerating the development of recyclable laminates with reduced plastic usage, which are more circular by design. The business is working on next-generation coatings and new laminate structures and has launched innovative products like bio-seal, germ-free for tea envelopes, and QSR segments, which offer sustainability-driven alternatives in the cartons and flexible packaging market. The business has won three prestigious World Packaging Organisation awards (WPO) selected by an international jury, for developing sustainable packaging for beverages and Ice-cream segments. The company has extended its sustainable packaging initiatives to its own personal care products as well significantly. Several of ITC’s personal care brands are progressively adopting recyclable options. For instance, Fiama Shower Gel bottles now incorporate 50% post-consumer recycled material, while Savlon Glycerine Soap Wrapper utilises 70% post-consumer recycled plastic in its PET layer. In the case of Engage Perfume and Cologne bottles, the brand has shifted to 100% paper-based recyclable cartons. ITC's Foods business has implemented various measures to reduce the usage of plastics. Aashirvaad Organic Whole Wheat Atta has introduced a 1-kg pack in a paper-based bag, reducing plastic usage by 25% through the use of special paper developed by ITC. Sunfeast Yippee! Power Up Noodles transitioned to 100% mono-material PP laminate for both the outer pack and inner sachet, replacing multi-layered PET\/PE laminate, reducing plastic usage. Notably, Sunfeast Yippee! Noodles also actively engage with the community, educating over 30 lakh school children about plastic waste recycling. The brand also encourages children to collect and return plastic wrappers, this has enabled a collection of over 10 lakh Yippee! Noodles wrappers. ITC MasterChef Frozen Snacks has transitioned to 100% mono-material PE laminate for select variants, replacing multi-layered PET\/PE laminate packaging. B Natural Juices uses 25% recycled content shrink wrap in secondary packaging, promoting the use of recycled material. ITC’s Hotels Business has replaced plastic water bottles with eco-friendly glass bottles. Furthermore, plastic drinking straws, stirrers, and other plastic items have been substituted with paper and wood-based alternatives, contributing to the reduction of plastic pollution. ITC is working towards ensuring that 100% of packaging is reusable, recyclable or compostable\/biodegradable. ","filter_flag":1}
{"title":"CKF Inc. unveils new production line of sustainable packaging at Langley B.C. factory - Canada NewsWire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2NrZi1pbmMtdW52ZWlscy1uZXctcHJvZHVjdGlvbi1saW5lLW9mLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1hdC1sYW5nbGV5LWItYy1mYWN0b3J5LTg3MjA3NDI1Mi5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2NrZi1pbmMtdW52ZWlscy1uZXctcHJvZHVjdGlvbi1saW5lLW9mLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1hdC1sYW5nbGV5LWItYy1mYWN0b3J5LTg3MjA3NDI1Mi5odG1s0gEA?oc=5","id":"CBMiiAFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2NrZi1pbmMtdW52ZWlscy1uZXctcHJvZHVjdGlvbi1saW5lLW9mLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1hdC1sYW5nbGV5LWItYy1mYWN0b3J5LTg3MjA3NDI1Mi5odG1s0gEA","guidislink":false,"published":"Thu, 22 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=173, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2NrZi1pbmMtdW52ZWlscy1uZXctcHJvZHVjdGlvbi1saW5lLW9mLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1hdC1sYW5nbGV5LWItYy1mYWN0b3J5LTg3MjA3NDI1Mi5odG1s0gEA?oc=5\" target=\"_blank\">CKF Inc. unveils new production line of sustainable packaging at Langley B.C. factory<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CKF Inc. unveils new production line of sustainable packaging at Langley B.C. factory - Canada NewsWire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2NrZi1pbmMtdW52ZWlscy1uZXctcHJvZHVjdGlvbi1saW5lLW9mLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1hdC1sYW5nbGV5LWItYy1mYWN0b3J5LTg3MjA3NDI1Mi5odG1s0gEA?oc=5\" target=\"_blank\">CKF Inc. unveils new production line of sustainable packaging at Langley B.C. factory<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","source.href":"https:\/\/www.newswire.ca","source.title":"Canada NewsWire","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Earthcycle™ satisfies consumer demand for compostable and recyclable packaging LANGLEY, BC, June 22, 2023 \/CNW\/ - CKF Inc. unveiled a new production line today for their certified home compostable and recyclable food packaging, Earthcycle™ at the Langley B.C. factory. Hon. Andrew Mercier, British Columbia cabinet minister and Langley Mayor Nathan Pachal spoke at the event. Earthcycle services growers, packers, and retail customers with FSC certified, home-compostable and recyclable packaging for the fresh fruit and vegetable markets. \"Earthcycle's expansion in Langley is driven by rising demands for packaging that reduces carbon footprints, aligns with recycling streams, and satisfies consumers' desire for sustainable options,\" says Ian Anderson, President CKF, Inc. Minister Mercier supports this, \"British Columbians are focused on a more sustainable future, and supporting local companies that are passionate about sustainable, responsible growth. I'm grateful for the innovative work that CKF is doing in food packaging to contribute to a wholesome and healthy foods supply, and am glad that CKF is part of the Langley Community.\" Langley Mayor, Nathan Pachal is also enthusiastic about Earthcycle's production, \"Langley City Council extends sincere congratulations to the CKF Inc. team as you celebrate the launch of this exciting state of the art technology,\" said Mayor Nathan Pachal. \"We appreciate that this innovative addition to your facility supports sustainable practices.\" The new production line will also reduce Earthcycle's transportation footprint and open distribution to new markets. \"Langley's strategic location near major markets in California, the Pacific Northwest, and western Canada, coupled with access to global trade routes, strengthens our production capabilities. It also serves as a hub for further Earthcycle innovation, expanding the product line into new market applications,\" said Anderson. The west coast Canadian production, which uses the latest servo-actuation technology, combined with the original Earthcycle production facilities located in Hantsport, NS, makes CKF the largest thermoformed moulded pulp manufacturer for the fruit and vegetable packaging market across the globe. About CKF Inc. CKF Inc. is a diversified Canadian-owned manufacturer that proudly offers a wide range of moulded pulp, foam, and PET products to meet the specific demands of retail consumers, food service operators and the packaging industry. CKF is a member of the Scotia Investments Family of Companies, whose core values include long-term stewardship, environmental integrity, and community well-being. SOURCE CKF Inc. Shannon Boase, [email protected], (604) 377-8965, www.ckfinc.com","filter_flag":1}
{"title":"Samuel Ross Beats Principal Design Consultant - HYPEBEAST","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vaHlwZWJlYXN0LmNvbS8yMDIzLzYvc2FtdWVsLXJvc3MtYmVhdHMtcHJpbmNpcGFsLWRlc2lnbi1jb25zdWx0YW50LWluZm_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vaHlwZWJlYXN0LmNvbS8yMDIzLzYvc2FtdWVsLXJvc3MtYmVhdHMtcHJpbmNpcGFsLWRlc2lnbi1jb25zdWx0YW50LWluZm_SAQA?oc=5","id":"CBMiT2h0dHBzOi8vaHlwZWJlYXN0LmNvbS8yMDIzLzYvc2FtdWVsLXJvc3MtYmVhdHMtcHJpbmNpcGFsLWRlc2lnbi1jb25zdWx0YW50LWluZm_SAQA","guidislink":false,"published":"Thu, 22 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=173, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vaHlwZWJlYXN0LmNvbS8yMDIzLzYvc2FtdWVsLXJvc3MtYmVhdHMtcHJpbmNpcGFsLWRlc2lnbi1jb25zdWx0YW50LWluZm_SAQA?oc=5\" target=\"_blank\">Samuel Ross Beats Principal Design Consultant<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">HYPEBEAST<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Samuel Ross Beats Principal Design Consultant - HYPEBEAST","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vaHlwZWJlYXN0LmNvbS8yMDIzLzYvc2FtdWVsLXJvc3MtYmVhdHMtcHJpbmNpcGFsLWRlc2lnbi1jb25zdWx0YW50LWluZm_SAQA?oc=5\" target=\"_blank\">Samuel Ross Beats Principal Design Consultant<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">HYPEBEAST<\/font>","source.href":"https:\/\/hypebeast.com","source.title":"HYPEBEAST","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"British designer Samuel Ross is on an upward trajectory, establishing himself at the top of the UK landscape. From unveiling his first partnership with Nike to opening his COARSE exhibition at Friedman Benda in New York City, Samuel Ross is unstoppable and enters the tech world with the right foot forward. Samuel Ross has just been appointed Beats‘ Principal Design Consultant. As the first-ever Principal Design Consultant, the A-COLD-WALL* designer will work alongside Beats and Apple to develop industrial design strategies for new tech gear. Ross will focus on creating sustainable packaging, eco-friendly materials, and premium finishes alongside industrial design studio SR_A. Speaking on his new role, Samuel Ross says: “It’s an honour to join Beats as the first Principal Design Consultant. Beats is a technology brand—its legacy is living in the now, through culture, and the future,” said Samuel Ross. “Together we intend to further the design language, material experimentation and brand character. Our vision will combine wearability and style at the intersection of expression and functionality.” In other news, Ten C SS24 heads to the Berici Hills of Vicenza.","filter_flag":1}
{"title":"HCT haircare innovation - Premium beauty","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9oY3QtaGFpcmNhcmUtaW5ub3ZhdGlvbiwyMjIwN9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9oY3QtaGFpcmNhcmUtaW5ub3ZhdGlvbiwyMjIwN9IBAA?oc=5","id":"CBMiQmh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9oY3QtaGFpcmNhcmUtaW5ub3ZhdGlvbiwyMjIwN9IBAA","guidislink":false,"published":"Tue, 20 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=171, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9oY3QtaGFpcmNhcmUtaW5ub3ZhdGlvbiwyMjIwN9IBAA?oc=5\" target=\"_blank\">HCT haircare innovation<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"HCT haircare innovation - Premium beauty","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9oY3QtaGFpcmNhcmUtaW5ub3ZhdGlvbiwyMjIwN9IBAA?oc=5\" target=\"_blank\">HCT haircare innovation<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","source.href":"https:\/\/www.premiumbeautynews.com","source.title":"Premium beauty","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"With HCT’s extended footprint and Haircare’s demand for larger formats, HCT can manufacture these types of collections in the United States, in addition to Europe and Asia, presenting more regionalized solutions for global brands. As an example, HCT is launching a new line called the Nora Collection, which offers a modern option for new haircare and skincare lines. HCT’s well known Flow Through Brush component is a fan favorite for multifunctional powder formulas – like the Jane Iredale Refillable Amazing Base® Loose Mineral Powder Refillable Brush SPF 20\/15. HCT has adapted this technology to enhance the application of trending haircare products. As an example, for waterless haircare formulas that are gaining popularity, HCT has designed a new suite of multifunctional flow through components with new sizes and applicators that are perfectly suited for haircare products like scalp treatments and dry shampoos. In addition to innovative formulation and packaging, HCT produces some of the most iconic accessories for beauty brands, like gua shua tools, skincare devices, brushes, bags, and more. For haircare specifically, they have a wide collection of combs, towel turbans, scalp scrubbers, and styling accessories. Brands can partner with the HCT Accessories team to choose from carefully curated stock pieces or create fully custom items. HCT has offices all over the globe and encourages clients to meet in person to discuss their specific brand needs.","filter_flag":1}
{"title":"Sustainable packaging producer PakTech heads into Australia - Convenience & Impulse Retailing","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmMtc3RvcmUuY29tLmF1L3N1c3RhaW5hYmxlLXBhY2thZ2luZy1wcm9kdWNlci1wYWt0ZWNoLWhlYWRzLWludG8tYXVzdHJhbGlhL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmMtc3RvcmUuY29tLmF1L3N1c3RhaW5hYmxlLXBhY2thZ2luZy1wcm9kdWNlci1wYWt0ZWNoLWhlYWRzLWludG8tYXVzdHJhbGlhL9IBAA?oc=5","id":"CBMiV2h0dHBzOi8vd3d3LmMtc3RvcmUuY29tLmF1L3N1c3RhaW5hYmxlLXBhY2thZ2luZy1wcm9kdWNlci1wYWt0ZWNoLWhlYWRzLWludG8tYXVzdHJhbGlhL9IBAA","guidislink":false,"published":"Tue, 13 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=164, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmMtc3RvcmUuY29tLmF1L3N1c3RhaW5hYmxlLXBhY2thZ2luZy1wcm9kdWNlci1wYWt0ZWNoLWhlYWRzLWludG8tYXVzdHJhbGlhL9IBAA?oc=5\" target=\"_blank\">Sustainable packaging producer PakTech heads into Australia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Convenience & Impulse Retailing<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sustainable packaging producer PakTech heads into Australia - Convenience & Impulse Retailing","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmMtc3RvcmUuY29tLmF1L3N1c3RhaW5hYmxlLXBhY2thZ2luZy1wcm9kdWNlci1wYWt0ZWNoLWhlYWRzLWludG8tYXVzdHJhbGlhL9IBAA?oc=5\" target=\"_blank\">Sustainable packaging producer PakTech heads into Australia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Convenience & Impulse Retailing<\/font>","source.href":"https:\/\/www.c-store.com.au","source.title":"Convenience & Impulse Retailing","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Facebook LinkedIn PakTech, an international producer of sustainable packaging, has established a contract manufacturing facility in Victoria, working with Visy on a ‘proprietary partnership’. The organisation stated that through this partnership, PakTech will fulfill its vision of producing packaging ‘made in Australia, recycled in Australia, and repurposed again into new PakTech products in Australia’ as part of a closed loop system. PakTech’s Australian operation is predicted to have the capacity to manufacture 100 million recycled injection moulded packaging handles for cans, bottles and other containers each year. In the Australian drinks industry, PakTech is already working with Hawkers Brewery, Billson’s of Beechworth and the Apple Press. PakTech handles, often seen clipped on to six-packs of craft beer, are made from totally recycled HDPE, or High Density Polyethylene. According to the company, ‘almost one billion milk jugs have been recycled, 120 million pounds of plastics saved from landfills and oceans,’ since using 100 per cent recycled materials. PakTech says this works out to ‘almost 50 acres of land saved from landfill waste by repurposing recycled containers.’ Brandon Rogers, CEO, PakTech PakTech CEO, Brandon Rogers, said an increase in local demand drove the company’s decision to enter Australia. “Australia’s buying habits are very similar to ours in the US. We’ve seen significant organic growth in recent years; and we forecast that will continue in the coming years. Establishing an on-the-ground local footprint in the region is incredibly exciting; not only for PakTech, but for our customers and everyone in Australia who cares about sustainability and our impact on the environment.” Laws and guidelines are also increasing the importance of recycled packaging for producers. “Through our launch in Australia, we’re helping our customers meet not only their customer needs, but also regulatory requirements too,” Rogers said. “As ESG pressures and the need for transparency increases, many companies are setting internal sustainability goals to meet regulatory mandates or customer or shareholder demands. But rather than setting goals of 25 per cent recycled content by 2025, PakTech enables businesses to use 100 per cent recycled content today.” There’s still a long way to go for recycling in Australia, as a recent report from environmental consultancy firm Eunomia Research and Consulting and the European Environmental Bureau testifies, with Australia’s recycling rate of 41.6 per cent ranked at 21 out of 25 developed countries – ahead of only Finland, France, Hong Kong and the United States. “We’re incredibly excited by this potential and joining an Australian market. There’s work still to be done, but we’re humbled to be able to play our part,” Rogers said. “Conscious consumerism is flourishing, and pressure from consumers around the world is forcing brands and retailers to rethink their approach to sustainable packaging. Sustainability and the circular economy is no longer a competitive differentiator, it’s an expectation,” the CEO concluded. This article was written by Seamus May and originally appeared on The Shout. To stay up to date on the latest industry headlines, sign up to the C&I e-newsletter.","filter_flag":1}
{"title":"What are the beverage trends in 2023? - FoodManufacture.co.uk","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMDYvMDEvd2hhdC1hcmUtdGhlLWJldmVyYWdlLXRyZW5kcy1pbi0yMDIz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMDYvMDEvd2hhdC1hcmUtdGhlLWJldmVyYWdlLXRyZW5kcy1pbi0yMDIz0gEA?oc=5","id":"CBMiWWh0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMDYvMDEvd2hhdC1hcmUtdGhlLWJldmVyYWdlLXRyZW5kcy1pbi0yMDIz0gEA","guidislink":false,"published":"Thu, 01 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=152, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMDYvMDEvd2hhdC1hcmUtdGhlLWJldmVyYWdlLXRyZW5kcy1pbi0yMDIz0gEA?oc=5\" target=\"_blank\">What are the beverage trends in 2023?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodManufacture.co.uk<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"What are the beverage trends in 2023? - FoodManufacture.co.uk","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMDYvMDEvd2hhdC1hcmUtdGhlLWJldmVyYWdlLXRyZW5kcy1pbi0yMDIz0gEA?oc=5\" target=\"_blank\">What are the beverage trends in 2023?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodManufacture.co.uk<\/font>","source.href":"https:\/\/www.foodmanufacture.co.uk","source.title":"FoodManufacture.co.uk","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"From carbonated drinks, to bottled water, functional beverages​​ and automated machinery, the beverage industry has been a hotbed for innovation, transforming the way drinks are sourced, produced, packaged, thought about and consumed. As consumer tastes and preferences continue to evolve, the beverage industry must adapt and innovate to meet their changing needs. Today, the industry is seeing a number of exciting innovations, from health and wellness-focused beverages, through to plant-based​​ options and substantial claims around sustainability​​. Functional and plant-based beverages are booming From the ingredient’s perspective, James Street, marketing director, EMEA & APAC at Prinova, confirmed that there’s an increasing focus on natural, functional and plant-based commodities and offerings. Citing FMCG Guru’s report on The Future of Naturalness,1​ Street reference the huge numbers of consumers (70%) across the globe who consider it to be “important that food and drink products are 100% natural”​. “The global market for functional beverages, which offer health benefits beyond basic nutrition, is forecast to be worth $208.7 billion by 2027 (CAGR 7.2%),”​ he told Food Manufacture. “Furthermore, consumers are not only paying more attention to specific ingredients and health claims, but they are also willing to pay more for these products.”​2,3​ \"Consumers are not only paying more attention to specific ingredients and health claims, but they are also willing to pay more for these products.\"​ Meanwhile, vegans and vegetarians are now estimated to make up 14% of the world’s population, while 24% of consumers claim to follow a ‘flexitarian diet’.4,5​ “These factors are influencing strong growth in the plant-based protein market, projected to be worth $14.5bn by 2025 (CAGR 7.1%), and the dairy alternatives market, which is predicted to grow at a CAGR of 11.4% to reach $36.7bn by 2025,”​ Street continued.6,7​ Reacting to the demand of nutrition and plant-based products, Prinova believes one strong response is the use of nutrient-rich premixes in dairy replacement products such as milk. “In Europe, soy is the most common source of plant protein, but in the dairy alternative subcategory, pea protein accounts for a far higher percentage of new product launches than soy.8​ This is in part due to pea protein being highly digestible, with an amino acid profile close to that recommended by the World Health Organization. It is also ideally suited to ‘green’ food production and an excellent choice for products with a natural, clean-label positioning.”​ Caffeine central to beverage innovation Mindful drinks and renewed health priorities were also quoted as two key trends by Finlays’ Sian Edwards who works as Group Insights Manager. “Consumers are increasingly aware of the physical and mental impacts of alcohol and sugar consumption. This is driving demand in two areas; firstly, in the rise of low\/no alcoholic beverages and secondly in that of ‘healthier’ alternatives such as hard seltzers which contain less sugar, calories and ‘unnatural’ ingredients than traditional alcoholic beverages,”​ she said. Cold brew coffee is a market segment with promise. Credit: Getty\/wmaster890 “Tea and coffee ingredients have been central to this trend, with brands looking to create healthy or functional alcohol alternatives. The ‘health halo’ around coffee and the rising interest in its health properties are paving the way for beverage brands to innovate. For example, utilising cold brew coffee​​, a natural source of caffeine, and premium quality tea extracts, which are rich in naturally derived antioxidants, to provide additional benefits.”​ Finlay’s sees cold brew as a category with thriving market potential. “Previously experiencing extreme popularity in the US and Japan, it seems Europe is about to have its very own cold brew moment,” ​predicted Edwards. “Over the last five years the consumption of cold brew in Europe has increased by 40% and by 2025 the category is expected to reach a value of €90mn. What’s more, cold brew is the fastest growing segment in RTD\/iced coffee, a market valued at €1.4bn in Europe.”​ In response to this rapidly growing demand, Finlays will be opening a multi-million-pound facility specialising in producing pure cold brew coffee​​ for branded and own-label suppliers to the UK and European grocery and hospitality sectors. However, while there’s a major benefit to being an early entrant to the category of cold brew, Edwards admits that due to its infancy in Europe, it’s not without its challenges. This includes consumer education and understanding which products and formats will prove to be successful. \"The ‘health halo’ around coffee and the rising interest in its health properties are paving the way for beverage brands to innovate.\"​ “Fortunately, Finlays is at the forefront of the cold brew coffee category in the USA, so has strong experience in how this niche, premium product became a category worth more than half a billion dollars,”​ she countered. Prinova has also been experimenting with caffeine within a concept its coined ‘Body Boost’. This vegan ‘recovery’ range contains 22 active ingredients, including Aquamin® calcium and magnesium to support normal energy-yielding metabolism, and features natural caffeine and AlphaTea™ – a branded L-theanine sourced from green tea extract. “When paired with caffeine, it is associated with positive effects on cognition and stress,” ​stated Street. “AlphaTea™ is also a key ingredient in our indulgent, plant-based, hot chocolate drink concept, Chill Out Chocolate.”​ Healthy ageing and enhanced water Prinova has also been looking into healthy ageing. Using clinically researched ingredients, it has fortified its Boomer Boost beverage concept with Aquamin®, BioPerine® and Curcumin C3 Reduct. These are said to provide support with common age-related changes, including inflammation, loss of bone density and cognition. In line with growing health concerns, Edwards also noted an upward trend for water, with brands potentially benefitting from enhanced water offerings through flavour and added functionality. To meet this demand, Finlay’s has launched its Just Add Water range of single-serve sachets which feature four recipe blends designed for morning, noon, evening and bedtime use. These dissolve in cold water and comprise immunity, antioxidant, energy and digestion, for each occasion respectively. Sustainable and innovative packaging at the forefront of drinks The sachets have also been designed with sustainability in mind, as consumers look to move away from single-use plastics​​. In fact, according to the 2019 Kantar survey of 65,000 worldwide consumers, two thirds are carrying refillable water bottles to reduce plastic consumption.9​ “The sachets save up to 99% of packaging volume vs. plastic bottles allowing consumers to avoid single use plastic without compromising on beverage taste and added benefits,”​ commented Edwards. Again, Edwards explains that there may be challenges in a relatively new innovation such as its water soluble solutions due to its unfamiliarity. “As consumers tend to seek familiarity in their beverages, this innovation has the potential to be seen as a risk by brand owners, however this should not deter beverage producers from the possibilities which innovation offers,”​ she commented. “One way to potentially navigate this is through introducing consumers to new and exciting formats which include familiar ingredients which they know and love, such as the inclusion of black tea in our Digestion and Energy Blends.”​ Coca-Cola has been making similar strides, with the announcement last year that it’s attached caps​​ roll-out would be extended to 500ml bottles in Great Britain. This innovation enables the cap to stay connected to the bottle after opening, meaning its easier and more likely that the cap will also be recycled alongside the bottle. Jon Woods, general manager at Coca‑Cola Great Britain, said: “This small but significant change helps to ensure that when consumers recycle our bottles, the caps stay attached and don’t get left behind as litter.​ “We know consumers in Great Britain want to dispose of packaging in the right way, and we want to help them do that.”​ Clipper Tea, which is part of Ecotone UK, is also focusing on packaging, as well as responsible sourcing. “Tea that is better for the planet remains in high demand, from natural ingredients to sustainable packaging. Clipper recently removed the unrecyclable inner foil bag across larger pack formats, making them fully recyclable, without losing the same delicious taste,” ​explained Adele Ward, Clipper Teas marketing director at Ecotone UK. “As part of our Food for Biodiversity mission, we’re committed to making tea in harmony with people and the environment. For us, that means organic and Fairtrade sourcing, alongside unbleached, biodegradable, and non-GM tea bags.”​ Ward also notes that traditional infusions within tea are showing a steady decline, so a key area of growth for the brand has been in its functional fruit and herbal options. “With traditional infusions showing steady decline, a key area of growth is in functional fruit and herbal infusions.\"​ “Clipper will continue to invest in its Mood Infusions range to target key shopper needs: ‘Restoring Roots’ to revive and restore, ‘Cleanse with Benefits’ and ‘After Dinner Mint’ for digestion and gut health, and ‘Snore & Peace’ for relaxation and sleep. Clipper is outperforming the segment at 23.8% in value sales year-on-year9​ in a category declining at -3%,”​ she said. “We already know that organic and Fairtrade is resilient under current economic pressures, especially now that there is more understanding around the health, ethical and sustainable benefits of the sector’s products. Total tea has declined -3.7% year-on-year, but sustainable tea (organic and\/or Fairtrade) is up +0.3%. Driving this buoyancy is health of the planet, which is the number one global issue of concern for consumers.”​10,11​ Traceability evolves beverage equipment In keeping with this trend, Garry Lewis, market development manager, food, beverage & commodities for OMRON UK, says implementing a more robust traceability system is now a key requirement. “One of the main things mandated by beverage regulation is ‘traceability’ – the practice of maintaining thorough records on the origins and whereabouts of products and raw materials by scanning printed barcodes, direct part marks (DPMs) or radio frequency identification (RFID) tags throughout the production process and the supply chain. From raw materials supplier, to production line, to supermarket, to customer, the creation and distribution of a particular beverage should be as transparent as possible,” ​he stated. The scope of traceability has expanded significantly, along with advances in technology. According to Lewis, traceability is now in its latest phase, so called “traceability 4.0”. ​It’s no longer a case of tracking products throughout the supply chain, it is now also about optimised productivity, quality and brand reputation within manufacturing operations. Within its bottling and capping equipment, OMRON is delivering this to manufacturing operations by \"tying products to process parameters\"​. You can read more about packaging trends here. ​​ Up and coming beverage innovations In terms of the future, Street believes that sustainability will continue to play a big part, pushing beverage producers towards sustainable packaging, environmentally-friendly production processes and locally-sourced natural ingredients. Lab-grown coffee and other environmentally led innovations Edwards agrees, describing sustainability as a “mega trend”​. In terms of where it’s heading for the coffee segment, she believes lab-grown will be an area to watch. However, there will be regulatory and consumer acceptance hurdles to overcome. Finnish scientists at the technical research institute VTT have been among those experimenting with lab-grown coffee, growing coffee from a cluster of coffee plant cells in a bioreactor. Using the same techniques as lab-grown meat, the team believe this innovation holds promise as a more sustainable method in terms of using less water, reducing transportation miles and as a way to alleviate struggling yields on plantations​ ​as a result of climate strain. Bubble tea looks set to remain popular. Credit: Getty\/Satoshi-K “I’m also expecting to see much more format innovation, e.g. waterless beverages, edible sachets and concentrates to reduce the industry’s carbon footprint,”​ she told Food Manufacture. Premiumisation and experimentation in drinks Edwards also considers premiumisation, and experience and experimentation to be key influences in the beverage space. “Consumers will continue to look for premium, indulgent and luxury experiences from their tea and coffee beverages, whether that’s trading up for a cold brew coffee or indulging in a bubble tea. But I’m also seeing increasingly greater value, or premium, placed on the intangible characteristic of ‘authenticity’. This could manifest in several different ways: products from producers that have a personal connection to the product, products that show a commitment to traditional flavours\/recipes or brands communicating consistent ethical values. Consumers are increasingly focused on their own personal ‘brand’ and looking for products that align with their values and image.​ “We’ve seen the impact of a young globalised and connected consumer base on the beverage industry, with the sudden and phenomenal global growth in traditional or local products, like matcha and bubble tea. As people learn about new products online, they look for ways to experiment and share these new product experiences with their followers. I’d expect to see this accelerate in the future, extending to products and regions previously unexplored, for example traditional tea and coffee beverages from Africa or Latin America, which are yet to hit the mainstream.”​ References","filter_flag":1}
