{"title":"8 tips for an eco-friendly kitchen remodel, according to pros | - Homes & Gardens","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmhvbWVzYW5kZ2FyZGVucy5jb20vc29sdmVkL3RpcHMtZm9yLWFuLWVjby1mcmllbmRseS1raXRjaGVuLXJlbW9kZWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmhvbWVzYW5kZ2FyZGVucy5jb20vc29sdmVkL3RpcHMtZm9yLWFuLWVjby1mcmllbmRseS1raXRjaGVuLXJlbW9kZWzSAQA?oc=5","id":"CBMiT2h0dHBzOi8vd3d3LmhvbWVzYW5kZ2FyZGVucy5jb20vc29sdmVkL3RpcHMtZm9yLWFuLWVjby1mcmllbmRseS1raXRjaGVuLXJlbW9kZWzSAQA","guidislink":false,"published":"Thu, 26 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=299, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmhvbWVzYW5kZ2FyZGVucy5jb20vc29sdmVkL3RpcHMtZm9yLWFuLWVjby1mcmllbmRseS1raXRjaGVuLXJlbW9kZWzSAQA?oc=5\" target=\"_blank\">8 tips for an eco-friendly kitchen remodel, according to pros |<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Homes & Gardens<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"8 tips for an eco-friendly kitchen remodel, according to pros | - Homes & Gardens","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmhvbWVzYW5kZ2FyZGVucy5jb20vc29sdmVkL3RpcHMtZm9yLWFuLWVjby1mcmllbmRseS1raXRjaGVuLXJlbW9kZWzSAQA?oc=5\" target=\"_blank\">8 tips for an eco-friendly kitchen remodel, according to pros |<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Homes & Gardens<\/font>","source.href":"https:\/\/www.homesandgardens.com","source.title":"Homes & Gardens","query":"https:\/\/news.google.com\/rss\/search?q=\"Salvaged Materials\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"In a world where the climate crisis is ever-evolving, reducing our own carbon footprint has become a priority for many of us, especially at home. Recycling well and installing solar panels will all play a part, but if you did not think that sustainability could be factored into your kitchen remodel, you would be mistaken. There are, in fact, many big and minor edits you can make to your design plans in order to follow more eco-friendly practices and create a sustainable kitchen that you are proud of. Eco swaps you might not have thought of when remodeling your kitchen We asked some home interior experts for their best recommendations when remodeling a kitchen sustainably. Put these into practice alongside your regular eco-home improvements for beautiful, planet-friendly results. 1. Keep longevity in mind (Image credit: Steven Kent Johnson) 'The most eco-friendly advice I can give is to design a kitchen that is timeless,' says Francis Nicdao, principal and chief creative officer of Pembrooke & Ives. Keeping longevity in mind is key with any kitchen remodel, but even more important if you are making home improvements that are eco-friendly: 'Reducing the chances of having to redesign or make amendments at a later date means creating less waste,' adds Nicdao. Francis Nicdao Social Links Navigation Principal & Chief Creative Officer of Pembrooke & Ives As principal and chief creative officer at Pembrooke & Ives, Francis is responsible for the creative oversight of projects across the company as well as for running his own design and decorating team, working on residential and commercial projects across the country. Having worked at the company for over fourteen years, Francis has helped shape and grow the company into what it is today. Born in the Philippines, Francis grew up in a town where handcrafted furniture is made. Family and family friends had factories where they trained artisans in woodwork, caning, and embroidery. Surrounded by artists and craftsmen, he was interested in art and design at a young age. After moving to New York, he focused on drawing and painting, receiving scholarships to various art schools and apprenticeships. Francis studied at Pratt Institute earning a Bachelor of Fine Arts degree in Interior Design. He also attended a design and architecture program at the Royal Academy of Fine Arts in Copenhagen. Prior to Pembrooke & Ives, Francis worked at D’Aquino Monaco where he designed private residences, spas, and retail concepts for various clients. At Pembrooke & Ives, he continues to work on high-end residential projects as well as full building renovations, lobbies renovations, and product design. 2. See past the trends (Image credit: Janis Nicolay) We are all a little guilty of ogling over the latest kitchen design trends, but consider how you invest in them and avoid basing your entire remodel on one specific, or very niche, trend that might pass. This does not mean that you cannot incorporate any of the latest looks, simply be mindful of how you go about it: 'Find materials and make design decisions that don’t follow trends but that have longevity and durability,' shares Nicdao. For example, if a particular countertop material is trending and you know you will still love it in 10+ years' time, consider investing in a reclaimed version or buying with a company that focuses on its sustainability efforts. 3. Salvaged materials and modernity can go hand in hand It is true that we don't always put eco-friendly and contemporary looks together. However, modern kitchen designs can be made sustainable with the addition of reclaimed materials like tile and countertops. A sleek finish is never out of the question if you look in the right places as Jess Onorato, Director of Product and Design at Habitat Home & Garden, tells us. 'While it's true a sustainable kitchen design should incorporate the use of reclaimed and salvaged materials and furniture, this doesn't mean the style must be \"rustic.\" There are many companies that offer high-quality cabinetry and countertops from owners replacing their kitchens, and re-selling them at discounted prices,' says Onorato. 'For an even more sustainable approach, one can source unique or antiqued pieces that can be repurposed into cabinetry, shelving, and worktops. Consider using one of our Reeves Four Door Cabinets by separating the two-part piece, mounting the top portion to a wall, and accessorizing with dishware, while the bottom cabinetry serves as kitchen storage. One can even add a sustainably sourced worktop, incorporating complementary tones to the flooring or backsplash design. Our Elm Kitchen Island is another beautiful example of selecting a sustainable piece for a kitchen remodel.' Jess Onorato Social Links Navigation Director of Product & Design at Habitat Home & Garden. Jess Onorato is a seasoned designer with over 15 years of experience in home staging, interior design, and sourcing home products with profound histories and unique characteristics. Over the last 3 years to date, Jess has worked at Central California furniture and design store Habitat Home & Garden where she is currently the Director of Product and Design. Aligning with Habitat’s ethos of cherishing the inherent stories encapsulated within carefully chosen design pieces, she operates on the belief that a well-designed space has the power to enhance lives, evoke emotions, and inspire creativity. Through immersing herself in various cultures and travel, Jess holds a profound understanding of the interplay between aesthetics and cultural context, believing travel and life experience play a very important role in one's ability to incorporate pieces into a space in a way that is unique and authentic. 4. Make low VOC paints your new norm A painted kitchen can be a showstopper and if you do want to go down this road, be sure you are using a low VOC paint over regular paint. VOC stands for 'Volatile Organic Compounds' which the EPA states can 'include a variety of chemicals' that may have adverse health effects. The National Library of Medicine notes that VOCs can also have a detrimental effect on the environment. It is simply best to limit exposure to them and they are often present in paints and household cleaners. 'A staple for selecting kitchen paint is certainly the durability, look for extra washable and scrubbable finishes like our Resistance Matt Emulsion, perfect for those messier areas in the home, resistance paint also lasts longer making it more environmentally friendly,' says James Greenwood, interior expert at Graham & Brown. 'Always look for low VOC and water-based paints for the most environmentally friendly options,' continues Greenwood who notes the importance of checking the company you are buying from to ensure they have strong sustainability values – such as Graham & Brown. Onorato agrees that simply editing your choice of paint can make a big difference: 'Even opting for non-toxic paints made without harmful chemicals is an easy way to support an eco-friendly home design.' James Greenwood Social Links Navigation Colour and interior expert at Graham & Brown Since completing his fashion marketing degree and spending a year working in luxury PR in London, James has spent over 8 years living and breathing wallpaper and interior design. Joining Graham & Brown in 2015 working through the marketing and product teams before spending time in the field developing our Graham & Brown partner network. 2021 saw James return to his passion for delivering exceptional products and design into the market heading up Graham & Brown’s lifestyle interior brand. Working across all product categories James’ ambition is to deliver beautifully curated homes to customers and to inspire them every day. 5. Incorporate 'old-world' pieces (Image credit: Shelby Bourne Photography) In the spirit of creating a kitchen that looks and feels timeless, Ami McKay, creator of PURE Design recommends including objects that have a little more history and charm to them. 'Incorporating old-world, found pieces as decor and millwork (ie. vintage table as island, antique hutch as cupboards, oversized ceramic pots for florals).' Not only will you enjoy a unique finish in your space, but you'll be saving on the resources that go into manufacturing new products. Make this an easy task by visiting local thrift stores, and keeping an eye on eBay, Craigslist, or Facebook Marketplace. You never know what may turn up one day. 'Furthermore, while there are many alternative solutions to a 'classic' kitchen remodel, it's important to keep in mind that the goal is to keep as much out of the landfill as possible,' continues Onorato. 'One of the easiest ways to do this is by incorporating pieces that are repurposed, re-used, or antiques.' 6. Branch out with kitchen materials This cozy kitchen space is dressed in Graham & Brown's Reecho Neutral wallpaper (Image credit: Graham & Brown) You need hardwearing materials in a kitchen, so choosing quality, natural materials that are local where possible and sourced sustainably is key to not using up so much of the earth's resources. 'There are a variety of different materials that can be incorporated into a sustainable kitchen design. One of the materials with growing popularity is bamboo, due to its fast-growing abilities. Bamboo can be beautifully designed as flooring, wall treatments, and even something as small as cutting boards. Additionally, cork is a sustainable material option, given that it can be harvested without harming the tree itself,' says Onorato. McKay further notes that 'soapstone countertops, and wood millwork with low VOC finishing,' make sound inclusions. 'Induction ranges to help with air quality,' continues McKay. There is a lot to discover in the world of sustainable kitchen design and some of the most sought-after looks may in fact be 'reclaimed' so do not overlook them. 'Recycled stone chips can be made into beautiful kitchen countertops, and can create a look similar to granite while leaving a smaller eco footprint,' continues Onorato. 7. Rethink textiles (Image credit: Shelby Bourne Photography) If you want to make small but sustainable changes to your cooking space, picking up a new rug or teacloth might seem like a wise idea for a quick refresh, when actually you must be sure to recycle those that you can no longer use and if you do purchase more, do so in a thoughtful manner as they typically produce a lot of waste. 'Additionally, while textiles majorly contribute to toxic waste pollution, it's important to be aware of the materials and make of certain pieces, considering seat cushions, tea towels, window drapery, and kitchen rugs,' highlights Onorato. 'Sourcing organic cotton or wool, especially untreated, is a simple approach to a more sustainable kitchen design.' Furthermore, one can source beautiful, vintage copper as cookware to incorporate into the kitchen design.' 8. Start slow With every type of remodel, thorough planning is essential so that you don't overlook any finer details. There are various things to consider when remodeling a kitchen, but when it comes to creating a more eco-friendly kitchen space, Onorato encourages us to start slow and go at our own pace. 'Despite the perception, creating a sustainable kitchen design doesn't need to be an intimidating undertaking. Rather than commit to a full remodel, consider starting the process by using eco-friendly appliances, such as cookers with high energy efficiency and LED lighting.' Sustainable kitchen appliances can often be some of the cheapest and most energy-efficient appliances to run and LED lighting is readily available from Amazon and hardware stores. FAQ Where do I start with an eco-friendly kitchen remodel? Whether you are doing a full remodel or not, careful planning is the key to success when doing any home improvement job, but most especially in a more eco-friendly way: \"The importance of a sustainable kitchen design is often overlooked and underestimated,' notes Onorato. 'Minor decisions regarding materials and layout can yield significant benefits to the environment. In the beginning stages of a kitchen remodel, it's most helpful to brief your architect and discuss your sustainability goals, ensuring every decision throughout the process holds this goal in mind. If you are remodeling on your own, spend some time researching companies that are zero waste, or entirely offset their carbon emissions.' Is paint or wallpaper more eco-friendly? Since both a painted kitchen and one with wallpaper will look smart, we were curious to know how they compare in terms of eco-friendliness. 'As a rough guide, 1m2 of paint roughly has a carbon footprint of 0.33kg vs a Graham & Brown roll of wallpaper made from sustainable accredited paper, water-based inks, and renewable energy without any carbon outcome offset,' says Greenwood. In the spirit of slow living and leading a more conscious lifestyle, take your time when planning a kitchen remodel to make more thoughtful choices that will better support the earth, and stand the test of time.","filter_flag":1}
{"title":"Upcycle4Better reuses resources to divert unwanted textiles from landfills - Options The Edge","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3Lm9wdGlvbnN0aGVlZGdlLmNvbS90b3BpYy9zdHlsZS91cGN5Y2xlNGJldHRlci1yZXVzZXMtcmVzb3VyY2VzLWRpdmVydC11bndhbnRlZC10ZXh0aWxlcy1sYW5kZmlsbHPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3Lm9wdGlvbnN0aGVlZGdlLmNvbS90b3BpYy9zdHlsZS91cGN5Y2xlNGJldHRlci1yZXVzZXMtcmVzb3VyY2VzLWRpdmVydC11bndhbnRlZC10ZXh0aWxlcy1sYW5kZmlsbHPSAQA?oc=5","id":"CBMibWh0dHBzOi8vd3d3Lm9wdGlvbnN0aGVlZGdlLmNvbS90b3BpYy9zdHlsZS91cGN5Y2xlNGJldHRlci1yZXVzZXMtcmVzb3VyY2VzLWRpdmVydC11bndhbnRlZC10ZXh0aWxlcy1sYW5kZmlsbHPSAQA","guidislink":false,"published":"Mon, 09 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=282, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3Lm9wdGlvbnN0aGVlZGdlLmNvbS90b3BpYy9zdHlsZS91cGN5Y2xlNGJldHRlci1yZXVzZXMtcmVzb3VyY2VzLWRpdmVydC11bndhbnRlZC10ZXh0aWxlcy1sYW5kZmlsbHPSAQA?oc=5\" target=\"_blank\">Upcycle4Better reuses resources to divert unwanted textiles from landfills<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Options The Edge<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Upcycle4Better reuses resources to divert unwanted textiles from landfills - Options The Edge","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3Lm9wdGlvbnN0aGVlZGdlLmNvbS90b3BpYy9zdHlsZS91cGN5Y2xlNGJldHRlci1yZXVzZXMtcmVzb3VyY2VzLWRpdmVydC11bndhbnRlZC10ZXh0aWxlcy1sYW5kZmlsbHPSAQA?oc=5\" target=\"_blank\">Upcycle4Better reuses resources to divert unwanted textiles from landfills<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Options The Edge<\/font>","source.href":"https:\/\/www.optionstheedge.com","source.title":"Options The Edge","query":"https:\/\/news.google.com\/rss\/search?q=\"Salvaged Materials\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"The statistics on fabric waste in landfills are as staggering as the mounds spread out along conveyor belts at Life Line Clothing Malaysia. After oil and gas, the textile industry is the second-most polluting. Discarded items make up about 5%, or 2,000 tonnes of the 38,700 tonnes of solid waste dumped in landfills daily. That works out to two million kilograms, or 1.17kg per person. Life Line, incorporated 10 years ago with its head office in Port Klang, Selangor, aims to stem this problem by putting used clothing and household goods to use so that nothing goes to the landfill. Daily, its factory processes 25 tonnes of textile waste collected from 600 drop-off locations in the state as well as Johor, Melaka, Kuala Lumpur and Putrajaya. “We don’t just handle what we collect from the bins. We also work with the local councils, corporations and universities to do education programmes on why we should recycle textiles, what happens if we don’t, and possibilities in the sector,” explains Yuki Liew, sustainability manager of Upcycle4Better (U4B), which works with Life Line to make sustainable fashion accessible to all. “We emphasise recycling plastic, paper, metal and glass. What about textiles? U4B, a lifestyle-driven brand set up in 2021, aims to spread awareness of upcycling and engage with the community,” she tells Malaysian Nature Society members visiting the factory recently. 20230902_pla_mns_greenliving_educational_field_trip_pg-109.jpg Liew: \"Upcycle4Better works with corporations, local councils, and universities on why we need to recycle textiles.\" Upcycling reuses resources and diverts them from landfills and recovers materials from waste and turns them into new products, connecting the dots between sustainability and practicality. Staff do the tailoring at the factory, turning salvaged materials into totes, comforters, pet beds, backpacks and patchwork blankets, among other things. The company also engages a group of about 40 home tailors, all single mothers, to whom it sends pre-cut materials for making products such as cosmetic pouches, wristlets, scrunchies and pot holders. Part of the profits from the sale of these products go to the women, says Liew. She cites a simple example of laypeople becoming more aware of what they can do to help. Staff emptying collection bins placed near markets used to find bits of fish and chicken in them. But not any more! At any one time, there are about 300 workers on the factory floor. When bales of what has accumulated in the bins are brought in, their contents are poured onto a conveyor belt. Each time the belt passes the sorters, they will pick out only the type of clothing assigned to them, such as jackets, jeans, baby wear, floral dresses, jogging pants, T-shirts or shorts. These are then thrown into their respective trolleys. 20230902_pla_mns_greenliving_educational_field_trip_pg-13.jpg Each bale weighs 450kg, ready to be used as repurposed materials Next, the garments in the trolleys are sorted into two categories: Grade A for those in good condition and can still be worn and B for those that may have holes, tears or stains. For the latter, any button, zip or metallic attachment will be removed, after which the pieces are cut up and turned into industrial wipes for use in the printing, machinery, petrochemical, automobile and other industries, or spun into yarn for rugs and mats. The Grade A clothes go through a final round of checks before they are separated and sold at Life Line’s Best Bundle shop on its premises. Soft toys, handbags, belts, accessories and shoes end up in the collection bins too and they are patched or repaired to make them good again. Under its Old Soles, New Life programme, unusable shoes are ground into granules for use as rubber surfaces at playgrounds and on running tracks. There is also plastic and paper waste, which it works with different partners to recycle, says Liew. 20230902_pla_mns_greenliving_educational_field_trip_pg-35.jpg Clothes and shoes as good as new: Visitors can find good bargains at Life Line Clothing in Port Klang New products repurposed from used materials can eventually go back into the collection bins, completing the loop of a circular economy that aims to reduce the environmental footprint, minimise waste, reduce resource dependency and generate increased income. Malaysians reportedly dumped a record 195,300 tonnes of textile waste in 2018, making up 6.3% of the waste that entered our landfills then and more than double that in 2012 (2.8%). According to the Solid Waste Corporation, the country’s recycling rate was 30.67% in 2020, lower than that of Taiwan (60%), Singapore (59%) and South Korea (49%). Environmental experts forecast that if nothing is done to reduce waste, there will be no space available for landfills by 2050. This article first appeared on Sept 18, 2023 in The Edge Malaysia.","filter_flag":1}
