{"title":"The next frontier: Indian chemical industry readies for giant leapfrog - Indian Chemical News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi90aGUtbmV4dC1mcm9udGllci1pbmRpYW4tY2hlbWljYWwtaW5kdXN0cnktcmVhZGllcy1mb3ItZ2lhbnQtbGVhcGZyb2ctMTc4MjbSAXtodHRwczovL3d3dy5pbmRpYW5jaGVtaWNhbG5ld3MuY29tL29waW5pb24vbGl0ZS90aGUtbmV4dC1mcm9udGllci1pbmRpYW4tY2hlbWljYWwtaW5kdXN0cnktcmVhZGllcy1mb3ItZ2lhbnQtbGVhcGZyb2ctMTc4MjY?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi90aGUtbmV4dC1mcm9udGllci1pbmRpYW4tY2hlbWljYWwtaW5kdXN0cnktcmVhZGllcy1mb3ItZ2lhbnQtbGVhcGZyb2ctMTc4MjbSAXtodHRwczovL3d3dy5pbmRpYW5jaGVtaWNhbG5ld3MuY29tL29waW5pb24vbGl0ZS90aGUtbmV4dC1mcm9udGllci1pbmRpYW4tY2hlbWljYWwtaW5kdXN0cnktcmVhZGllcy1mb3ItZ2lhbnQtbGVhcGZyb2ctMTc4MjY?oc=5","id":"CBMidmh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi90aGUtbmV4dC1mcm9udGllci1pbmRpYW4tY2hlbWljYWwtaW5kdXN0cnktcmVhZGllcy1mb3ItZ2lhbnQtbGVhcGZyb2ctMTc4MjbSAXtodHRwczovL3d3dy5pbmRpYW5jaGVtaWNhbG5ld3MuY29tL29waW5pb24vbGl0ZS90aGUtbmV4dC1mcm9udGllci1pbmRpYW4tY2hlbWljYWwtaW5kdXN0cnktcmVhZGllcy1mb3ItZ2lhbnQtbGVhcGZyb2ctMTc4MjY","guidislink":false,"published":"Mon, 12 Jun 2023 04:50:24 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=12, tm_hour=4, tm_min=50, tm_sec=24, tm_wday=0, tm_yday=163, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi90aGUtbmV4dC1mcm9udGllci1pbmRpYW4tY2hlbWljYWwtaW5kdXN0cnktcmVhZGllcy1mb3ItZ2lhbnQtbGVhcGZyb2ctMTc4MjbSAXtodHRwczovL3d3dy5pbmRpYW5jaGVtaWNhbG5ld3MuY29tL29waW5pb24vbGl0ZS90aGUtbmV4dC1mcm9udGllci1pbmRpYW4tY2hlbWljYWwtaW5kdXN0cnktcmVhZGllcy1mb3ItZ2lhbnQtbGVhcGZyb2ctMTc4MjY?oc=5\" target=\"_blank\">The next frontier: Indian chemical industry readies for giant leapfrog<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Chemical News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The next frontier: Indian chemical industry readies for giant leapfrog - Indian Chemical News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi90aGUtbmV4dC1mcm9udGllci1pbmRpYW4tY2hlbWljYWwtaW5kdXN0cnktcmVhZGllcy1mb3ItZ2lhbnQtbGVhcGZyb2ctMTc4MjbSAXtodHRwczovL3d3dy5pbmRpYW5jaGVtaWNhbG5ld3MuY29tL29waW5pb24vbGl0ZS90aGUtbmV4dC1mcm9udGllci1pbmRpYW4tY2hlbWljYWwtaW5kdXN0cnktcmVhZGllcy1mb3ItZ2lhbnQtbGVhcGZyb2ctMTc4MjY?oc=5\" target=\"_blank\">The next frontier: Indian chemical industry readies for giant leapfrog<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Chemical News<\/font>","source.href":"https:\/\/www.indianchemicalnews.com","source.title":"Indian Chemical News","query":"https:\/\/news.google.com\/rss\/search?q=\"Anti-pollution Measures\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"India's chemical industry currently valued at around US $220 billion, is expected to touch US $300 billion by 2025 and reach the $1 trillion mark by 2040, fuelled by growth in per capita income and consumption levels. India holds a strong position in chemicals globally, ranking 14th in exports and 8th in imports. Covering more than 80,000 commercial products, the industry is expected to grow at 9.3% to reach US $304 billion by 2025. The growth is predicted on the back of rising demands in the end-user segments for specialty chemicals and petrochemicals. The global pandemic and its subsequent disruptive impacts have encouraged many companies to de-risk their supply chains. Increased dependence on a single manufacturing source, rising costs in China, growing US-China tensions, stringent environments, and high compliance costs, etc. have created vulnerabilities that have driven firms to diversify supply chains outside of China. India is uniquely positioned to benefit as MNCs increasingly adopt the ‘China+1’ strategy owing to its competitive cost advantage, focus on quality and sustainability, conducive business environment led by reforms, and incentivized government policies. In the post pandemic scenario, the Indian chemical industry has got numerous opportunities considering the supply chain disruption in China and trade conflict among the US, Europe, and China. Anti-pollution measures in China will also create opportunities for the Indian chemical industry in specific segments. Additional support, in terms of fiscal incentives, such as tax breaks and special incentives through Petroleum, Chemicals and Petrochemicals Investment Regions (PCPIRs) or Special Economic Zones (SEZs) to encourage downstream units will enhance production and development of the industry. To bring about structural changes in the working of the domestic chemical industry, future investments should not only focus on transportation of fuels such as petrol and diesel, but also on crude-to-chemicals complexes or refineries set up to cater to the production of chemicals. In the face of various global challenges, the Indian chemical industry continued to be resilient in 2022 and has shifted gears in the right direction of becoming a noteworthy global player. However, numerous challenges still persist including limited domestic feedstock availability, delayed regulatory approvals, and scarcity of skilled R&D talent. These enablers and obstacles have influenced the spectrum of chemical sub-segments falling in the consideration pool, in terms of both market attractiveness and cost competitiveness. Government initiatives The Indian government has recognized the chemical industry as a key growth element and forecast to increase the share of the chemical sector to ~25% of the GDP in the manufacturing sector by 2025. Under the Union Budget 2022-23 the government allocated Rs. 209 crores (US $27.43 million) to the Department of Chemicals and Petrochemicals. A production linked incentive (PLI) scheme has been introduced to promote Bulk Drug Parks, with a budget of Rs. 1,629 crores (US $213.81 million). It is considering launching a PLI scheme in the chemical sector to boost domestic manufacturing and exports. The government has started various initiatives such as mandating BIS-like certification for imported chemicals to prevent dumping of cheap and substandard chemicals into the country. Under the new PCPIR Policy 2020-35, a combined investment of Rs. 10 lakh crore (US $142 billion) is targeted by 2025, Rs. 15 lakh crore (US $213 billion) by 2030 and Rs. 20 lakh crore (US $284 billion) by 2035 in all PCPIRs across the country. The four PCPIRs are expected to generate employment for around 33.83 lakh people. A 2034 vision for the chemicals and petrochemicals sector has been set up by the government to explore opportunities to improve domestic production, reduce imports and attract investments in the sector. The government plans to implement a production-link incentive system with 10-20% output incentives for the agrochemical sector; to create an end-to-end manufacturing ecosystem through the growth of clusters. Road ahead India has significant presence in production of basic organic chemicals, fertilizers, pesticides, paints, dyestuffs and intermediates and fine and specialty chemicals. The chemical sector in India faces key challenges such as inadequate infrastructure facilities, high costs of basic raw materials like natural gas and crude oil, high cost of capital and need for technological modernization of its facilities. The key success factors for the chemicals industry in India are the use of advanced technology, strong research capabilities, backward and forward linkages and development of domestic capacity to reduce dependence on imported raw materials. It has also become imperative for the Indian chemical industry to address safety, health and environmental protection issues in an organized manner. A consistent value creator, India’s chemical sector remains an attractive hub of opportunities. The sector has created enormous wealth for investors in the past with stocks of many specialty companies rising manifold. Robust demand across end-user industries led by rising domestic consumption, strong export growth, and rising import substitutions are expected to be primary growth drivers for the chemical sector. Growing strong domestic demand and increased exports will continue to fuel the growth of the Indian specialty chemicals industry. The robust performance of the sector is prompting specialty chemical manufacturers to ramp up their production capacity to meet the growing demand for its products. Furthermore, anti-pollution measures in China will also create opportunities for the Indian chemical industry in specific segments. Additional support, in terms of fiscal incentives, such as tax breaks and special incentives through PCPIRs or SEZs is set to encourage downstream units that will enhance the production and development of the industry. The dedicated integrated manufacturing hubs under the PCPIR policy would also attract an estimated investment of Rs. 20 lakh crore (US $276.46 billion) by 2035. \"India's chemical industry currently valued at around US $220 billion, is expected to touch US $300 billion by 2025 and reach the $1 trillion mark by 2040, fuelled by growth in per capita income and consumption levels,\" predicts Arun Baroka, Secretary, Chemicals & Petrochemicals, Ministry of Chemicals & Fertilizers at the Indian Chemical Council's event. To sum it all up, the fast paced growth of the Indian chemical industry is inevitable and its growth trajectory will witness a transition to specialty materials as user industries constantly evolve. Look at the stats Chemical production reached 907,639 MT in August 2022, while petrochemical production reached 1,727,019 MT. In August 2022, production levels of various chemicals were as follows: Soda Ash: 267,416 MT, Caustic Soda: 283,279 MT, Liquid Chlorine: 203,195 MT, Formaldehyde: 26,842 MT and Pesticides and Insecticides: 18,881 MT. A revival in domestic demand and robust exports will spur a 50% YoY increase in the capex of specialty chemicals manufacturers in FY22 to Rs. 6,000-6,200 crore (US $815-842 million). Revenue growth is likely to be 19-20% YoY in FY22, up from 9-10% in FY21, driven by recovery in domestic demand and higher realisations owing to rising crude oil prices and better exports. In FY22, India's dye exports totaled US $3.24 billion. Growing demand Rise in demand from end-user industries such as food processing, personal care and home care is driving development of different segments in India’s specialty chemicals market. The domestic chemicals sector is expected to showcase 18-23% revenue growth in FY22, owing to an improvement in domestic demand and higher realization. Opportunities India’s specialty chemicals companies are expanding their capacities to cater to rising demand from domestic and overseas. With global companies seeking to de-risk their supply chains, which are dependent on China, the chemical sector in India has the opportunity for a significant growth. Policy Support The government plans to introduce a production-linked incentive (PLI) scheme to promote domestic manufacturing of agrochemicals. Under the Union Budget 2022-23 the government allocated Rs. 209 crores (US $27.43 million) to the Department of Chemicals and Petrochemicals.","filter_flag":1}
