{"title":"Revolutionizing Logistics: TheCSRUniverse Interview with Ms. Priya Prakash, Co-Founder and Managing Director, Eco ... - The CSR Universe","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vdGhlY3NydW5pdmVyc2UuY29tL2FydGljbGVzL3Jldm9sdXRpb25pemluZy1sb2dpc3RpY3MtZWNvLXBhbGxldHMtcGF2ZS10aGUtd2F5LXRvLXN1c3RhaW5hYmxlLXN1cHBseS1jaGFpbtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vdGhlY3NydW5pdmVyc2UuY29tL2FydGljbGVzL3Jldm9sdXRpb25pemluZy1sb2dpc3RpY3MtZWNvLXBhbGxldHMtcGF2ZS10aGUtd2F5LXRvLXN1c3RhaW5hYmxlLXN1cHBseS1jaGFpbtIBAA?oc=5","id":"CBMicmh0dHBzOi8vdGhlY3NydW5pdmVyc2UuY29tL2FydGljbGVzL3Jldm9sdXRpb25pemluZy1sb2dpc3RpY3MtZWNvLXBhbGxldHMtcGF2ZS10aGUtd2F5LXRvLXN1c3RhaW5hYmxlLXN1cHBseS1jaGFpbtIBAA","guidislink":false,"published":"Wed, 27 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=361, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vdGhlY3NydW5pdmVyc2UuY29tL2FydGljbGVzL3Jldm9sdXRpb25pemluZy1sb2dpc3RpY3MtZWNvLXBhbGxldHMtcGF2ZS10aGUtd2F5LXRvLXN1c3RhaW5hYmxlLXN1cHBseS1jaGFpbtIBAA?oc=5\" target=\"_blank\">Revolutionizing Logistics: TheCSRUniverse Interview with Ms. Priya Prakash, Co-Founder and Managing Director, Eco ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The CSR Universe<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Revolutionizing Logistics: TheCSRUniverse Interview with Ms. Priya Prakash, Co-Founder and Managing Director, Eco ... - The CSR Universe","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vdGhlY3NydW5pdmVyc2UuY29tL2FydGljbGVzL3Jldm9sdXRpb25pemluZy1sb2dpc3RpY3MtZWNvLXBhbGxldHMtcGF2ZS10aGUtd2F5LXRvLXN1c3RhaW5hYmxlLXN1cHBseS1jaGFpbtIBAA?oc=5\" target=\"_blank\">Revolutionizing Logistics: TheCSRUniverse Interview with Ms. Priya Prakash, Co-Founder and Managing Director, Eco ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The CSR Universe<\/font>","source.href":"https:\/\/thecsruniverse.com","source.title":"The CSR Universe","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Footprint Reduction\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Traditional wooden pallets, a mainstay in logistics, have posed environmental challenges due to substantial carbon dioxide emissions in production and frequent repairs. As the demand for pallets escalates across vital Indian industries such as FMCG, consumer durables, logistics, retail, and automotive, the reliance on conventional materials like wood raises alarming concerns. In 2022, the India pallet market stood at 194 million units, with expectations to escalate to 293 million units by 2028. This heightened demand prompts a critical examination of the environmental impact and underscores the pressing need for sustainable alternatives. Enter Eco Life Pallets, a game-changing solution tackling these concerns head-on. Championed by Priya Prakash, Co-Founder and Managing Director, Eco Pallet and the sole woman entrepreneur in this sector, these innovative pallets are crafted from post-consumer recycled wood and a specialized coating, significantly reducing carbon footprint while boasting superior resilience and durability. A greener alternative to traditional pallets, they usher in a new era of eco-conscious logistics solutions. In this comprehensive interview, we delve into the inspiration behind Eco Life Pallets and their significant impact on the logistics sector. Priya shares insights into the challenges faced by traditional pallets, the meticulous development journey of Eco Life Pallets, and their versatile applications across industries. She also discusses her experiences as the only woman in this sector, challenging stereotypes and proving that capabilities transcend gender boundaries. The conversation further sheds light on the financial viability of Eco Pallets compared to traditional ones, the company's impressive growth, and plans for international expansion while staying committed to sustainable practices within India. Eco Pallet's innovative approach offers a potential glimpse into a greener future for the often-ignored world of logistics and supply chains. Join us for a deep dive into the sustainable future of logistics and continue reading the interview below. Q&A Q. How did the idea for Eco Pallet come to you? What made you realise the need and market viability of this product? A. The genesis of Eco Life Pallet emerged from recognizing the deficiencies within the existing pallet industry, particularly its environmental impact. At Eco, we committed ourselves to leveraging the opportunity to collaborate with various departments, gaining direct insights into the requirements and challenges faced by pallet users. This exploration solidified our belief that an uncomplicated, eco-friendly pallet solution held substantial promise for widespread market adoption. That a hassle-free, sustainable pallet solution held immense potential for market acceptance. Q. Can you describe the product development journey? What kind of R&D and testing did you do, and what did the initial versions of the product look like? A. The development journey of Eco Life Pallet was a meticulous process focused on innovation and sustainability. It began with the idea of transforming Expanded Polystyrene (EPS) by applying a specialized spray coating. Initially, the market perception predominantly favoured traditional wooden pallets, making the futuristic concept of EPS pallets a notable departure. The first iteration of the product involved using pine wood coated with a specialized spray. This initial version aimed to bridge the gap between the market's familiar wooden pallets and the innovative EPS-coated concept. Rigorous testing followed to ensure durability, strength, and eco-friendliness met industry standards. The motto was still sustainability, and the team pivoted. We replaced the pine wood with post-consumer recycled wood, aligning more closely with the eco-conscious and economical demands of the user to fit into the price point, This shift not only enhanced the product's environmental credentials but also adapted the manufacturing process to accommodate the new material seamlessly. Throughout this developmental phase, extensive research and development were conducted to refine the coating process for recycled wood, ensuring it maintained durability while meeting market expectations. Iterations and adjustments were made to perfect the product, resulting in the Eco Life Sustainable pallet—a resilient, eco-friendly solution bridging the gap between futuristic innovation and the prevailing market mindset favouring wood. Q. What are the current realities of the pallet industry in India? How is the market growing and which sectors are key? A. The current landscape of the pallet industry in India showcases dynamic growth and evolving preferences. As per forecasts, the India Pallets Market is projected to soar to nearly US$ 3 billion by 2031, expanding at a robust CAGR of 9.2%. Within this trajectory, the wood segment remains the dominant force, maintaining its stronghold throughout the forecast period. However, there's a notable surge anticipated in the plastics segment, signifying a shifting trend towards alternative materials. In 2022, the India pallet market stood at 194 million units, with expectations to escalate to 293 million units by 2028. This growth surge is primarily propelled by the burgeoning manufacturing sector in India, driving heightened demand for pallets. Moreover, the escalating need for secure product transportation further fuels the expansion of the India Pallets Market. Despite this promising growth, the industry's reliance on traditional wooden pallets warrants attention. Supporting the manufacture of 194 million units would potentially require the felling of approximately 24.25 million trees. This staggering figure underscores the environmental impact and emphasizes the significance of sustainable alternatives in the pallet industry to mitigate deforestation and promote eco-friendly practices. The evolving market dynamics present both opportunities and challenges. While the demand for pallets is soaring due to industrial growth, there's an increasing need to explore sustainable solutions, reduce reliance on wood, and promote eco-conscious materials to alleviate the environmental burden associated with traditional pallet production. Q. Can you elaborate on the difference between traditional pallets and your pallets? What is the impact on decarbonisation and overall sustainability? A. Eco Life Pallets boast several unique advantages over traditional wooden pallets: • Flame Resistance • Enhanced Hygiene • Water Resistance • Protection Against Bugs and Mildew • Increased Weight-Bearing Capacity • Repairability • Thermal and temperature resilience • Hermetic Sealing, Meeting ISPM Compliance • Anti-Fungal Properties • Anti-Static Nature • Reduce nails and splinters exposure • Recyclability • Impact Resistance • Abrasion Resistance • Resistance to Oil and Chemicals • Shock Absorption • Customization Options Eco-Life Sustainable Pallets revolutionize the pallet industry by championing eco-conscious practices. Traditional wood pallets rely on fresh timber, contributing to deforestation, while Eco-Life Pallets use post-consumer recycled wood and a specialized coating, reducing reliance on new resources and promoting waste reduction. Manufacturing traditional pallets demands frequent repairs and replacements, elevating carbon emissions and energy consumption, whereas Eco-Life's use of recycled materials drastically slashes the carbon footprint. Their durability surpasses traditional counterparts, mitigating wear and tear, and extending lifespan, minimizing waste generation. Decarbonisation efforts are amplified, as Eco-Life emits only 0.5kgs of CO2 compared to traditional wood pallets' 9-13 kgs or 100 kgs emitted by plastic ones. Overall, Eco-Life Pallets foster sustainability, curbing waste, lowering emissions, and driving a circular economy by repurposing materials that would otherwise languish in landfills. Q. How much funds have you raised, and from where? A. Our Investors are from the US and they hold equity in Eco Pallet. Q. What has the company's growth been so far, and what are your plans for the future? A. We have grown in number, revenue and strength by 75% to date when compared to last financial year. Our plans include inducting Eco Life Pallet into the leasing of pallets. We constantly innovate and patent our new products. Q. Who are your key customers? What challenges have you faced when speaking to decision-makers to make the switch to sustainable pallets? A. Our key customers have been in Pharma, food, Ecom and Logistics. There are multiple challenges in this space. Firstly, there's a prevalent 'Resistance to Change', stemming from entrenched methods and a reluctance to alter established procedures. This familiarity with existing practices can breed hesitancy in embracing newer, sustainable solutions. Cost Concerns pose another significant obstacle. Despite the proven long-term benefits, the upfront investment in sustainable pallets can be perceived as higher, leading decision-makers to pause due to initial cost impressions. Lack of Awareness among decision-makers about the advantages of sustainable pallets serves as a barrier. Incentivizing a switch becomes challenging when decision-makers lack a comprehensive understanding of the benefits these alternatives offer. Supply Chain Integration presents complexities. Introducing new pallet types into existing supply chains might involve compatibility issues or require adjustments in handling procedures, complicating the integration process. Moreover, Industry Norms and Standards tend to favour traditional materials, making it difficult to shift mindsets towards sustainability, especially when conventional materials have become the industry norm. Performance Concerns arise as decision-makers question the reliability and durability of sustainable pallets, particularly in demanding industry environments, leading to uncertainties about their efficacy under strenuous conditions. Additionally, ensuring Regulatory Compliance poses challenges. Establishing adherence to industry-specific regulations or standards for sustainable pallets can be unclear or not well-established, creating compliance uncertainties. To address these challenges effectively, Eco Pallet raises awareness about the benefits, demonstrating cost-effectiveness and performance, adhering to standards, showcasing successful transitions by other companies, and providing trials or pilot project are essential strategies. These initiatives substantiate the advantages of sustainable pallets in practice, assuaging concerns and encouraging adoption. Q. Overall, how mature is the Indian corporate world when it comes to sustainability? Is there a mindset shift you have noticed? A. Sustainability has gradually become a phenomenon in the Indian corporate sphere, which reflects a changing attitude and approach. Of late, sustainability has gained increased attention and commitment as one of the corporate social responsibility obligations. Policy changes and initiatives include CSR mandate by the Indian government, incentives for renewable energy, and mitigation strategies to reduce carbon emissions. This has motivated companies to focus on sustainability. There is a new focus on CSR initiatives, such as involvement in social welfare projects, environment conservation, and community activities done by most companies today. The other development is regarding ESG criteria which play a major role in guiding investment decision. Such guidelines are increasingly pushing firms into more sustainable practices. Several businesses have been embracing green technologies as they decrease carbon trails, improve power conservation aspects, and concentrate on decreasing trash and recycling. More and more, customers, investors, and employees are demanding their companies engage in ethically oriented and environmentally friendly operations. The shifting of stakeholders’ expectations has forced companies to be competent, competitive, and desirable to potential employees through sustainability. India is showing a move toward sustainability in its corporate world; however, this is a long process. The mindset is changing and companies are beginning to understand that they cannot view sustainability as a mere moral requirement but also as a strategy for ensuring survival and competitiveness in the long term. Q. Can you describe the use cases of your pallets in certain industries like pharma and agriculture? A. In the pharmaceutical sector, pallets ensure safe storage and transportation of sensitive medicines, vaccines, and medical supplies. Specialized pallets comply with stringent regulations by offering features like temperature resistance and contamination prevention, while tracking-enabled pallets enhance inventory management and product traceability. For agriculture, pallets streamline handling, safeguarding delicate produce and enabling efficient loading during transportation. These pallets feature enhanced ventilation and hygiene, preserving the freshness and quality of perishable goods. In e-commerce and logistics, pallets optimize warehousing by facilitating easy stacking and handling of diverse goods, aiding swift order fulfilment. They also play a crucial role in last-mile delivery, ensuring secure transportation of goods to customers or distribution centres. Within manufacturing, pallets organize material handling, aiding in the movement and storage of raw materials and finished products. Customized pallets with tracking systems assist in inventory control and monitoring across production cycles. Specialized pallets across these industries ensure safe, efficient, and organized handling, storage, and transportation of diverse products, contributing significantly to streamlined operations and effective supply chain management. Q. How does the price of your pallets compare to the traditional ones? Is it financially viable for companies to buy these? A. The initial cost of Eco Life pallets, ranging between INR 2800-3000, might appear higher compared to traditional wooden pallets priced at INR 1500-1800. However, when considering the long-term perspective, Eco Life pallets present a more financially viable option for companies. Traditional wooden pallets require repairs every six months, incurring an additional cost of approximately 200 rupees per component. Over 5-7 years, the expenses for repairs and replacements significantly accumulate. In contrast, Eco Life pallets come with a 5-7 year warranty, eliminating the recurring repair costs and ensuring prolonged durability without frequent replacements. Though the upfront cost of Eco Life pallets may seem higher, their extended lifespan and warranty coverage offset the need for frequent repairs and replacements associated with traditional wooden pallets. In the long run, investing in Eco Life pallets proves to be financially advantageous for companies due to reduced maintenance expenses and extended durability. Q. As the only woman entrepreneur in this space, have you faced any challenges? A. Being a woman entrepreneur in the logistics sector comes with its distinct hurdles. I've chosen to view these challenges as opportunities for creativity and innovation. Collaborating with individuals of diverse perspectives has been refreshing and invigorating, especially as a woman bringing fresh and thought-provoking ideas to the forefront. It's allowed me to challenge stereotypes and prove that one's capabilities aren't limited by gender. Thankfully, I've found invaluable support within my network and have gained valuable insights from experiences, enhancing my determination to strive for success. Q. How are sustainable pallets integrated into the broader supply chain? A. Sustainable pallets play a significant role in enhancing the overall sustainability of the supply chain. They contribute to environmental conservation by reducing waste, energy consumption, and carbon emissions. Integration of sustainable pallets into the broader supply chain involves several key aspects: Post-consumer recycled wood is a major source for manufacturing sustainable pallets. This minimizes the damage and the impact on the environment of the manufactured pallet. The sustainable pallet design is meant for durability with a view of using them for a long time hence avoiding frequent replacements. It enhances efficiency by preventing worn-out pallets from being used that cause damage during handling in the distribution process. These pallets can be used repeatedly, and they will also be recycled after a certain period when they lose value. Closed-loop management of the pallets makes it possible to have them collectively as they can repair them and reuse hence minimizing wastage. On this basis, sustainable pallets might be considered as part of efforts aimed at maximizing efficiency in the extended network of the supply chain. A holistic strategy of incorporating green pallets in a larger supply chain should consider the ecological aspect, economic implications, operations efficiency, the stakeholders’ viewpoint, and other related issues. Consequently, these pallets represent an important aspect that firms aim at in seeking to build greener supply chains. Q. Any plans for international expansion? A. Yes, absolutely. While sustainable pallets are a vital consideration for supply chains globally, our current primary focus and priority are centred on implementing sustainable practices within the context of operations in India. Q. How does Eco Pallet navigate sustainability regulations in logistics? A. Eco Pallet navigates sustainability regulations in logistics by adhering to and often exceeding industry sustainability standards. Here's how they typically manage this: Compliance and Certifications: Eco Pallet ensures its products meet or surpass sustainability regulations set by local and international bodies. They might obtain certifications such as Forest Stewardship Council (FSC), Sustainable Forestry Initiative (SFI), or Cradle to Cradle to validate their eco-friendly practices. Material Sourcing: The company emphasizes sourcing recycled or sustainable materials for pallet production. This commitment involves using post-consumer recycled wood and eco-friendly coatings, reducing the reliance on virgin materials. Life Cycle Assessment: Eco Pallet conducts life cycle assessments to measure the environmental impact of their pallets throughout their entire life cycle. This assessment helps in identifying areas for improvement and ensuring the product aligns with sustainability goals. Reduced Carbon Footprint: By using recycled materials and efficient manufacturing processes, Eco Pallet reduces its carbon footprint. They might track and report their carbon emissions, demonstrating their commitment to sustainability. Collaboration with Partners: Collaborating with logistics partners, Eco Pallet encourages sustainable practices in the supply chain. This collaboration involves educating partners about the benefits of sustainable pallets and promoting their use in logistics operations. Innovation and Continuous Improvement: The company invests in research and development to enhance pallet design and manufacturing processes, aiming for even greater sustainability. Innovation might include advancements in materials, technologies, or circular economy practices. By emphasizing compliance, responsible material sourcing, life cycle assessments, carbon footprint reduction, partnerships, and continuous improvement, Eco Pallet ensures it not only meets but exceeds sustainability regulations in the logistics industry. This commitment allows them to navigate regulatory landscapes effectively while contributing positively to environmental conservation efforts. Q. Is Eco Pallet involved in promoting sustainability awareness? A. Yes, at Eco Pallet, promoting sustainability awareness is a core part of our mission. We actively engage in initiatives and campaigns aimed at educating our stakeholders, partners, and the community about the importance of sustainability in logistics and the benefits of using eco-friendly pallet solutions. Whether through educational programs, industry events, or partnerships, we strive to raise awareness and encourage the adoption of sustainable practices across the supply chain. Q. Any upcoming tech innovations for enhanced sustainability? A. At Eco Pallet, we believe in a dynamic approach to sustainability, constantly seeking and embracing new technologies that align with our commitment to reducing our ecological footprint while enhancing efficiency and performance within the supply chain. Innovation isn't just a one-time occurrence; it's a continuous process integral to our pursuit of sustainable practices.","filter_flag":1}
