{"title":"NOCO-NOCO ANNOUNCES STRATEGIC ALLIANCE WITH TESNOLOGY TO ADVANCE SMART CITY INITIATIVES - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25vY28tbm9jby1hbm5vdW5jZXMtc3RyYXRlZ2ljLWFsbGlhbmNlLXdpdGgtdGVzbm9sb2d5LXRvLWFkdmFuY2Utc21hcnQtY2l0eS1pbml0aWF0aXZlcy0zMDE5ODQzMzAuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25vY28tbm9jby1hbm5vdW5jZXMtc3RyYXRlZ2ljLWFsbGlhbmNlLXdpdGgtdGVzbm9sb2d5LXRvLWFkdmFuY2Utc21hcnQtY2l0eS1pbml0aWF0aXZlcy0zMDE5ODQzMzAuaHRtbNIBAA?oc=5","id":"CBMijwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25vY28tbm9jby1hbm5vdW5jZXMtc3RyYXRlZ2ljLWFsbGlhbmNlLXdpdGgtdGVzbm9sb2d5LXRvLWFkdmFuY2Utc21hcnQtY2l0eS1pbml0aWF0aXZlcy0zMDE5ODQzMzAuaHRtbNIBAA","guidislink":false,"published":"Fri, 10 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=314, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25vY28tbm9jby1hbm5vdW5jZXMtc3RyYXRlZ2ljLWFsbGlhbmNlLXdpdGgtdGVzbm9sb2d5LXRvLWFkdmFuY2Utc21hcnQtY2l0eS1pbml0aWF0aXZlcy0zMDE5ODQzMzAuaHRtbNIBAA?oc=5\" target=\"_blank\">NOCO-NOCO ANNOUNCES STRATEGIC ALLIANCE WITH TESNOLOGY TO ADVANCE SMART CITY INITIATIVES<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"NOCO-NOCO ANNOUNCES STRATEGIC ALLIANCE WITH TESNOLOGY TO ADVANCE SMART CITY INITIATIVES - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25vY28tbm9jby1hbm5vdW5jZXMtc3RyYXRlZ2ljLWFsbGlhbmNlLXdpdGgtdGVzbm9sb2d5LXRvLWFkdmFuY2Utc21hcnQtY2l0eS1pbml0aWF0aXZlcy0zMDE5ODQzMzAuaHRtbNIBAA?oc=5\" target=\"_blank\">NOCO-NOCO ANNOUNCES STRATEGIC ALLIANCE WITH TESNOLOGY TO ADVANCE SMART CITY INITIATIVES<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy optimization\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"SINGAPORE, Nov. 10, 2023 \/PRNewswire\/ -- noco-noco Pte Ltd. (\"noco-noco\"), a leading decarbonization solutions provider and wholly owned subsidiary of noco-noco Inc. (Nasdaq \"NCNC\"), has entered into a strategic business alliance with Tesnology Co., Ltd. (\"TESNOLOGY\"), a pioneering R&D group focused on developing technologies for smart cities. This collaboration aims to accelerate the development and implementation of a groundbreaking group of RCTnm devices that seamlessly integrate noco-noco's high-value-added batteries equipped with X-SEPA™ (separator) technology and TESNOLOGY's distributed edge control technology. Visualization of an RCTnm-enabled smart city The RCTnm devices, first showcased at CES2023 and VivaTech 2023, represent a significant leap forward in the realm of energy management, decentralization, and the realization of smart cities. In response to the global climate crisis, the world is transitioning away from high-emission data solutions and more sustainable energy management. This alliance puts noco-noco and TESNOLOGY at the forefront of this transition, envisioning a future where cities are sustainable, self-sufficient, and built on the foundation of democratized information and energy. The collaboration focuses on creating an ideal smart city environment, where personal data is protected, energy consumption is optimized, and citizens enjoy a comfortable life with minimal power usage. The key innovation driving this vision is the RCTnm device, a suite of products that combine TESNOLOGY's distributed data management technology with noco-noco's game-changing long-life and high temperature-resistant batteries, transforming data and energy management at the smallest household level to eventually establish smart cities with mesh communication local networks. At the heart of these devices lies TESNOLOGY's 'DI-Engine', a language-centric digital system that ensures data security and democratization of information without relying on the Internet or cloud infrastructure that are globally responsible for 1% of energy-related GHG emissions. In fact, a single data center can consume up to the equivalent electricity of 50,000 homes, and by 2030, data centers are projected to consume 13% of global electricity. In addition, data and privacy challenges that come with cloud-based data storage are increasing coming under scrutiny and regulations around the world. Amid growing concerns about data and privacy from cloud-based solutions, the RCTnm devices will optimize non-cloud data storage and management technologies, delivering a holistic decarbonized battery and energy management alternatives. The RCTnm devices redefine the purpose of batteries, transforming them from mere energy storage units into information and energy management hubs. These devices enable efficient electricity consumption, facilitate energy supply and demand forecasting, and empower citizens to actively engage in decarbonization activities. The technology breakthrough unlocked by this collaboration not only simplifies sustainability efforts but also transforms decarbonization initiatives into value generators, creating opportunities for businesses to thrive while minimizing their environmental impact. Speaking about the importance of the initiative, noco-noco CEO Masataka Matsumura said, \"The value proposition of this partnership from noco-noco's perspective is clear: the extended lifespan of our X-SEPA™ embedded high performing batteries, coupled with TESNOLOGY's innovative data management capabilities, creates a synergy that transcends traditional profit markers. These intelligent batteries could form an ecosystem that could not only potentially reduce operational costs for businesses in the long term but also enhance the overall efficiency of energy systems, making them pivotal assets in the transition toward sustainable and eco-friendly practices.\" Said Dr Katsuhiko Kondo, President of TESNOLOGY, \"Embarking on this strategic business agreement signifies noco-noco and TESNOLOGY shared determination to revolutionize energy storage systems, enabling seamless integration and optimization of energy usage across various applications, from households to entire communities.\" About noco-noco noco-noco (Nasdaq symbol \"NCNC\") is a decarbonization solutions provider with business portfolios across battery technology leasing, EV sales, and carbon credits generation. Its technologies and solutions are designed to accelerate global sustainability transitions, meeting the needs for high-performance, high temperature-resistant, and hassle-free electrification. Our vision includes equipping EV batteries with IoT devices for intelligent energy optimization, bringing clean, affordable, and sustainable energy solutions to the forefront of tomorrow's world. For more information on noco-noco, visit www.noco-noco.com About TESNOLOGY: TESNOLOGY is an R&D group headed by Katsuhiko Kondo, the inventor of RCTnm, and whose members are well-versed in technological development in various fields. By combining innovative data management technologies with fundamental technologies such as power control, motor control, battery control, and fintech, we will enable the creation of new value and realize the development of new products and services through collaborations with research institutes and companies. For enquiries: [email protected] Forward-Looking Statements This press release contains forward-looking statements within the meaning of section 27A of the U.S. Securities Act of 1933, as amended (the \"Securities Act\"), and section 21E of the U.S. Securities Exchange Act of 1934 (\"Exchange Act\") that are based on beliefs and assumptions and on information currently available to noco-noco. In some cases, you can identify forward-looking statements by the following words: \"may,\" \"will,\" \"could,\" \"would,\" \"should,\" \"expect,\" \"intend,\" \"plan,\" \"anticipate,\" \"believe,\" \"estimate,\" \"predict,\" \"project,\" \"potential,\" \"continue,\" \"ongoing,\" \"target,\" \"seek\" or the negative or plural of these words, or other similar expressions that are predictions or indicate future events or prospects, although not all forward-looking statements contain these words. Any statements that refer to expectations, projections or other characterizations of future events or circumstances, the markets in which noco-noco operates as well as any information concerning possible or assumed future results of operations of noco-noco, are also forward-looking statements. These statements involve risks, uncertainties and other factors that may cause actual results, levels of activity, performance or achievements to be materially different from those expressed or implied by these forward-looking statements. Although noco-noco believes that it has a reasonable basis for each forward-looking statement contained in this communication, noco-noco caution you that these statements are based on a combination of facts and factors currently known and projections of the future, which are inherently uncertain. noco-noco cannot assure you that the forward-looking statements in this communication will prove to be accurate. These forward-looking statements are subject to a number of risks and uncertainties, including, among others, the impact of the global COVID-19 pandemic, the outcome of any potential litigation, government or regulatory proceedings and other risks and uncertainties. There may be additional risks that noco-noco presently does not know or that noco-noco currently believes are immaterial that could also cause actual results to differ from those contained in the forward-looking statements. In light of the significant uncertainties in these forward-looking statements, you should not regard these statements as a representation or warranty by noco-noco and its respective directors, officers or employees or any other person that noco-noco will achieve their objectives and plans in any specified time frame, or at all. The forward-looking statements in this press release represent the views of noco-noco as of the date of this communication. Subsequent events and developments may cause those views to change. However, while noco-noco may update these forward-looking statements in the future, there is no current intention to do so, except to the extent required by applicable law. You should, therefore, not rely on these forward-looking statements as representing the views of noco-noco as of any date subsequent to the date of this communication. SOURCE noco-noco","filter_flag":1}
{"title":"SpinetiX launches iBX line with iBX410 player - Digital Signage Today","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmRpZ2l0YWxzaWduYWdldG9kYXkuY29tL25ld3Mvc3BpbmV0aXgtbGF1bmNoZXMtaWJ4LWxpbmUtd2l0aC1pYng0MTAtcGxheWVyL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmRpZ2l0YWxzaWduYWdldG9kYXkuY29tL25ld3Mvc3BpbmV0aXgtbGF1bmNoZXMtaWJ4LWxpbmUtd2l0aC1pYng0MTAtcGxheWVyL9IBAA?oc=5","id":"CBMiV2h0dHBzOi8vd3d3LmRpZ2l0YWxzaWduYWdldG9kYXkuY29tL25ld3Mvc3BpbmV0aXgtbGF1bmNoZXMtaWJ4LWxpbmUtd2l0aC1pYng0MTAtcGxheWVyL9IBAA","guidislink":false,"published":"Wed, 01 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=305, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmRpZ2l0YWxzaWduYWdldG9kYXkuY29tL25ld3Mvc3BpbmV0aXgtbGF1bmNoZXMtaWJ4LWxpbmUtd2l0aC1pYng0MTAtcGxheWVyL9IBAA?oc=5\" target=\"_blank\">SpinetiX launches iBX line with iBX410 player<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Digital Signage Today<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"SpinetiX launches iBX line with iBX410 player - Digital Signage Today","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmRpZ2l0YWxzaWduYWdldG9kYXkuY29tL25ld3Mvc3BpbmV0aXgtbGF1bmNoZXMtaWJ4LWxpbmUtd2l0aC1pYng0MTAtcGxheWVyL9IBAA?oc=5\" target=\"_blank\">SpinetiX launches iBX line with iBX410 player<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Digital Signage Today<\/font>","source.href":"https:\/\/www.digitalsignagetoday.com","source.title":"Digital Signage Today","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy optimization\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Digital signage firm SpinetiX has launched its iBX line of players with the debut of its iBX410 model, according to a press release. Digital signage firm SpinetiX has launched its iBX line of players with the debut of its iBX410 model, according to a press release. Product design The product line is designed to streamline hardware production in tandem with global adoption of the SpinetiX Arya CMS. \"Thanks to our strong partnership with Intel, we have gained access to new manufacturing partners,\" Francesco Ziliani, CEO at SpinetiX, said in the release. \"After a careful evaluation, we have selected a partner located in Taiwan having met our stringent quality and reliability standards. They are offering us, as well, increased production capacity while ensuring TAA compliance.\" With specifications geared for mainstream needs in specialized and broad-market applications, the iBX410 is purpose-built for 24\/7 digital signage use and includes the latest Intel Atom processor and supports 4K at 60 FPS. Software The iBX410 runs DSOS, the SpinetiX digital signage operating system, with security and energy optimization. SpinetiX Arya CMS is available out of the box, along with the Discovery Plan solution for content delivery. Scalability is available via ARYA Enterprise plans and Elementi software. \"With the unveiling of iBX410 and the new iBX family, we are not just introducing another line of products; we are reinforcing our commitment to innovation but also our dedication to our channel ecosystem,\" Ziliani said in the release. Image: SpinetiX Related: Exclusive interview with Francesco Ziliani, CEO, SpinetiX SpinetiX seeks Caribbean expansion with distro deal SpinetiX, Exertis Pro AV Italy partner for Italy distribution","filter_flag":1}
