{"title":"New Alaska water quality rules are coming. Here’s what that could mean for wastewater systems.","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d07350042d49e13956a9f97bb9f&url=https%3a%2f%2falaskapublic.org%2f2024%2f06%2f19%2fnew-alaska-water-quality-rules-are-coming-heres-what-that-could-mean-for-wastewater-systems%2f&c=10286070396474874863&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d07350042d49e13956a9f97bb9f&url=https%3a%2f%2falaskapublic.org%2f2024%2f06%2f19%2fnew-alaska-water-quality-rules-are-coming-heres-what-that-could-mean-for-wastewater-systems%2f&c=10286070396474874863&mkt=en-us","summary":"Some difficult-to-treat compounds could present costly challenges, said the head of Alaska's largest water system.","published":"Wed, 19 Jun 2024 11:08:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=19, tm_hour=11, tm_min=8, tm_sec=0, tm_wday=2, tm_yday=171, tm_isdst=0)","news_source":"Alaska Public Media","news_image":"http:\/\/www.bing.com\/th?id=OVFT.ZVU4CwHm4dkPwybI2Z24ri&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700.0,"news_imagemaxheight":466.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New Alaska water quality rules are coming. Here’s what that could mean for wastewater systems.","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Some difficult-to-treat compounds could present costly challenges, said the head of Alaska's largest water system.","query":"https:\/\/www.bing.com\/news\/search?q=\"Environmental Conservation\" \"new products\"&format=rss","text":"The Anchorage Water and Wastewater Utility building (AWWU) New rules for wastewater are on the horizon for Alaska. The EPA has given the state’s Department of Environmental Conservation six to 12 months to update the state’s water quality standards, and the state’s largest wastewater system says new rules could present challenges. The updated standards will provide a more accurate estimate of how much fish Alaskans eat, said Gene McCabe, the water division director at the Alaska Department of Environmental Conservation. “So the basic premise here is, is that you know, the fish live in the water, and if there are certain pollutants in that water, they will, over their lifetime, absorb those pollutants into their bodies,” McCabe said in a phone interview. “And then when humans eat them, of course, then we absorb those pollutants that are in the fish into our bodies.” Some pollutants might sound familiar, like mercury and arsenic. Others are a bit more exotic, like tetrachloroethylene and dimethyl phthalate. Some come from industrial processes. Tetrachloroethylene, for instance, is used in dry cleaning and in some automotive brake cleaners. But some others — like dimethyl phthalate and other phthalate chemicals — show up all over the place, including many people’s homes, said Mark Corsentino, the general manager for the Anchorage Water and Wastewater Utility. “It can be in cosmetics. It’s in laundry detergent. It’s in plastics,” Corsentino said in a phone interview. Not to mention food and even some bottled water, plus some flexible PVC pipes. Corsentino is in charge of the largest wastewater system in Alaska. He’s responsible for making sure the wastewater discharged from the city’s water system into Cook Inlet complies with the rules. And he’s concerned that the new rules could require screening wastewater for phthalates, which require expensive advanced treatment to remove from the water. States all over the country are working on updating their water quality standards. Washington State recently went through a similar process also driven by an upward revision to the fish consumption rate. And certain pollutants are causing headaches as the state implements stricter standards laid out by the EPA in 2022. “PCBs was probably the most vexing chemical for us,” said Melissa Gildersleeve, who oversees water quality standards for the Washington Department of Ecology. PCBs are polychlorinated biphenyls. They’re now severely restricted in new products, but they show up in a ton of older products like pigments and coolant for electrical transformers. They’ve posed a particular problem in the Spokane area, Gildersleeve said, and while water treatment plants can remove a lot of PCBs, they’re not really designed to do so. “So, you know, a lot of our work has been about trying to find the ultimate source of the PCBs,” she said. And once they find it, they go after the source. For example: earlier this year, Washington state officials petitioned the EPA to tighten limits on PCBs in consumer products. Gildersleeve said it’s a similar story with phthalates, the chemicals that the folks in Anchorage are worried about. Even plastic cups and tubing used to take samples can contribute phthlates to the water, she said. “That’s where a lot of our implementation is oriented, is it just really tracking down where those sources are,” she said. And Corsentino, with Anchorage Water and Wastewater, said source control should be the focus in any effort to reduce how much the chemicals show up in wastewater. For his part, McCabe, the water division director at the Alaska DEC, said he’s less concerned that stricter limits will pose a problem for wastewater operators. He said he’s been in touch with wastewater authorities around the state, and when they brought up chemicals that can leach from pipes, the department took a closer look at how they’re regulated across the country. Just a handful of wastewater facilities face specific limits for those pollutants as a condition of their wastewater permits, he said. “And the only facilities we found were from very, very large cities, multimillion-population cities, so we weren’t really seeing them from the same type of population that we see here in Alaska,” McCabe said. But for now, McCabe and fellow officials at the Alaska DEC are still working on what the state’s new water quality standards should look like. He says he’s hopeful the department will be able to release draft standards for public comment later this summer.","filter_flag":1}
{"title":"6 Dynamic Imaging Science Jobs","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d07350042d49e13956a9f97bb9f&url=https%3a%2f%2fwww.rit.edu%2farticles%2f6-dynamic-imaging-science-jobs&c=7250778072886533441&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d07350042d49e13956a9f97bb9f&url=https%3a%2f%2fwww.rit.edu%2farticles%2f6-dynamic-imaging-science-jobs&c=7250778072886533441&mkt=en-us","summary":"Environmental conservation. National defense ... and qualification of camera hardware for new products. To succeed in this role, you need to understand image evaluation methodology and image quality ...","published":"Sun, 14 Jan 2024 14:44:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=1, tm_mday=14, tm_hour=14, tm_min=44, tm_sec=0, tm_wday=6, tm_yday=14, tm_isdst=0)","news_source":"Rochester Institute of Technology","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"6 Dynamic Imaging Science Jobs","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Environmental conservation. National defense ... and qualification of camera hardware for new products. To succeed in this role, you need to understand image evaluation methodology and image quality ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Environmental Conservation\" \"new products\"&format=rss","text":"When you hear the term imaging system you may think of an X-ray machine or other medical imaging such as MRI, mammography, or ultrasound. But as digital imaging has rapidly evolved, so have the many ways it can be used. Today, imaging systems monitor agriculture, study art, visualize architecture, protect and secure the nation, explore the universe, and drive cars. Augmented reality. Environmental conservation. National defense. Self-driving cars. Learn about six jobs you’ll be competitive for with a bachelor’s degree in imaging science. RIT’s imaging science degree has a 100% outcome rate. Graduates are employed at world-renowned companies such as Adobe, Amazon, Apple, Aptiva Imaging, Boeing, Google, L3 Harris, Lockheed Martin, NASA, National Geospatial Intelligence Agency, Naval Undersea Warfare Center, and more. Unmanned Aerial Vehicle (Drone) Engineer When you think of drones you may think of military exercises or your local photographer’s website. But these devices are used extensively for business purposes. Drones are used by agricultural companies to monitor crops and track disease, by insurance agencies to document and assess damage after natural disasters, and by conservation organizations to monitor the environment. These imaging systems also can be combined with predictive analytics to improve our use of resources across all of these areas. An imaging science degree prepares students to develop and design the cameras, imaging types, and engineering techniques needed to ensure drones can not only carry advanced imaging cameras but can convert the large quantities of data they collect into useful information for the end-user. Computer Vision Scientist Nearly every automaker is developing or looking to enhance, their driver assistance systems by using computer vision technologies. These are the systems that deploy the brakes in an emergency or help you parallel park your car. Imaging science students learn math and programming skills needed to work on engineering teams that are utilizing RADAR, LIDAR, and other imaging systems in the pursuit of fully-autonomous vehicles and other new technologies. Computer vision systems are also used in cell phone cameras and the apps that run on them, AR\/VR systems, medical image analysis, as well as in manufacturing systems. Augmented Reality and Virtual Reality Researcher You could be on the team developing the next augmented reality experience for gamers, working with city planners to show 3D prototypes of a new skyline, or helping stroke victims regain their vision. AR\/VR technologies are growing at a rapid pace and the demand for skilled imaging experts is high. An imaging science degree prepares students to work at many AR\/VR companies developing the hardware and software systems that drive this technology forward. These careers require experience with programming languages, an understanding of human and computer vision, and the ability to design, conduct, and troubleshoot experiments. Satellite Imaging Scientist Right now, more than 2,500 satellites are orbiting Earth. In 2017, Planet, an American satellite company, began snapping a daily picture of every part of Earth’s landmass. How are all these satellite images being used? NASA is constantly learning about the universe through satellite imagery while countries around the world use satellite imagery to ensure national security. Imaging scientists work at leading aerospace companies and national labs developing new imaging systems for satellites, as well as applying artificial intelligence algorithms to extract information from those images. These applications can range from environmental monitoring to national security and beyond. Camera Hardware Engineer Smartphone engineers are tasked with developing the tools of the future, like simultaneously developing smaller cameras with the highest image resolutions possible. Camera hardware engineers are involved in the research, design, development, testing, and qualification of camera hardware for new products. To succeed in this role, you need to understand image evaluation methodology and image quality metrics, have strong programming skills, and be familiar with imaging algorithms and objective camera bench testing. Very few college programs provide this level of diverse training in the way RIT’s imaging science degree does. Artificial Intelligence\/Machine Learning Engineer Artificial intelligence (AI) is when a machine responds to a stimulus the way a human might respond. One example you’re probably familiar with is tagging your photos on Facebook or Instagram. The only way a machine learns to respond in a certain way is through proper programming. An AI engineer builds models using machine learning algorithms and deep learning neural networks. To do this, these engineers often have a background in areas like computer science, mathematics, and cognitive science–all of which are areas covered in RIT’s imaging science degree. AI engineers are in demand in a range of industries including aerospace, agriculture, medicine, and the cell phone industry.","filter_flag":1}
{"title":"Lowering taxes: A path to community empowerment","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d07350042d49e13956a9f97bb9f&url=https%3a%2f%2fblogs.timesofisrael.com%2flowering-taxes-a-path-to-community-empowerment%2f&c=3647562207056298343&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d07350042d49e13956a9f97bb9f&url=https%3a%2f%2fblogs.timesofisrael.com%2flowering-taxes-a-path-to-community-empowerment%2f&c=3647562207056298343&mkt=en-us","summary":"Every shekel I earn is crucial for reinvesting in my business, from developing new products to enhancing ... healthcare, and environmental conservation more effectively. Consider this: if the ...","published":"Wed, 29 May 2024 07:44:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=5, tm_mday=29, tm_hour=7, tm_min=44, tm_sec=0, tm_wday=2, tm_yday=150, tm_isdst=0)","news_source":"The Times of Israel","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Lowering taxes: A path to community empowerment","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Every shekel I earn is crucial for reinvesting in my business, from developing new products to enhancing ... healthcare, and environmental conservation more effectively. Consider this: if the ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Environmental Conservation\" \"new products\"&format=rss","text":"As a 25-year-old owner of a dancewear business, I understand first hand the financial and emotional toll that high taxes impose on small business owners in Israel. The passion and dedication I pour into my business are often overshadowed by the overwhelming tax obligations. Israel’s tax burden on businesses is among the highest globally, and this needs to change. Our nation’s tax system is a complex maze of direct and indirect taxes. With a corporate tax rate of 23%, significantly higher than the OECD average of 21.5%, many of us feel the squeeze. Every shekel I earn is crucial for reinvesting in my business, from developing new products to enhancing customer service. Instead, a substantial portion of my earnings goes straight to the tax authorities. This stifling financial strain curtails my ability to innovate and expand. But it’s not just about business growth. Lowering taxes would enable us to contribute more directly to our communities. Imagine if, instead of funneling our money into taxes, we could invest it in local NGOs. These organizations often operate more efficiently and with greater flexibility than governmental bodies, addressing social issues such as education, healthcare, and environmental conservation more effectively. Consider this: if the government lowered our taxes, businesses like mine could support NGOs in meaningful ways. Donations would empower these organizations to experiment with innovative solutions, driven by the accountability and efficiency that come from being directly answerable to donors. This would foster a more effective use of resources and create a direct link between business success and community well-being. I urge the government to rethink its approach. Tax reforms that reduce the financial burden on businesses and establish incentives for contributions to NGOs could transform our economic landscape. Offering tax deductions or credits for charitable donations would not only alleviate the strain on business owners but also promote a culture of corporate responsibility and community involvement. The excessive tax burden on Israeli businesses is more than an economic issue; it is a social one. By advocating for lower taxes and a realignment of funding toward NGOs, we can create a more vibrant economic landscape and a healthier society. It’s time for our policymakers to consider these changes seriously, for the benefit of our businesses and the communities they have the potential to support. As a young entrepreneur, I am passionate about my business and my community. Lowering taxes would not only help businesses like mine thrive but also enable us to contribute to the social fabric of our nation. Let’s work together to create a system that supports both economic growth and societal well-being.","filter_flag":1}
{"title":"Green careers: everything you need to know","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d07350042d49e13956a9f97bb9f&url=https%3a%2f%2fwww.bbc.co.uk%2fbitesize%2farticles%2fzfkd7v4&c=9500499900263719699&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d07350042d49e13956a9f97bb9f&url=https%3a%2f%2fwww.bbc.co.uk%2fbitesize%2farticles%2fzfkd7v4&c=9500499900263719699&mkt=en-us","summary":"In her role, she helps to transition products from using conventional fossil fuels to sustainable ones, researching and testing new products in a laboratory. Chelsea: In my job, the focus is to ...","published":"Fri, 11 Nov 2022 13:34:00 GMT","published_parsed":"time.struct_time(tm_year=2022, tm_mon=11, tm_mday=11, tm_hour=13, tm_min=34, tm_sec=0, tm_wday=4, tm_yday=315, tm_isdst=0)","news_source":"BBC","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Green careers: everything you need to know","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"In her role, she helps to transition products from using conventional fossil fuels to sustainable ones, researching and testing new products in a laboratory. Chelsea: In my job, the focus is to ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Environmental Conservation\" \"new products\"&format=rss","text":"Chelsea: I’m Chelsea and I work in the aviation industry. What does a fuel scientist do? Chelsea: In my job, the focus is to help transition our products from conventional fossil fuels that are more damaging and polluting to sustainable aviation fuel that has a lower emission output. Why would you want to be a fuel scientist? Chelsea: By doing this work, I'm slowly enabling us to move away from fossil-based fuels to fuels that are sustainable. What would a typical day look like for you? Chelsea: So a typical day here can be quite varied actually, so you never actually know what you'll be doing. At the moment I'm doing a lot of work on my computer. So I'm reading up about a lot of different sustainable aviation fuels but then this can lead to going down to the test rigs doing some testing and then this can also lead to actual laboratory testing of the fuels as well. What would be the average salary? Chelsea: Money isn't always what's most important. I think if you are comfortable in life and you are happy with what you do, then you've won you've succeeded. So yeah pay is comfortable here. And we also get a lot of other benefits as well so we can work from home if we need to so, I like to work from home two days a week and we also get a half day on Friday, which is brilliant. Are there many different pathways into this job? Chelsea: I think that this industry is very accepting of all educational backgrounds. So don't feel pressured to have to study something that you don't want to. If you are very interested in becoming a scientist or an engineer it would help if you study things like maths, physics, chemistry, anything analytical. What are the perks of your job? Chelsea: I'd say one of the biggest perks is sometimes maybe a couple of times a year. We do get the opportunity to actuallygo in see our customer aircraft last year. I got the opportunity to actually go inside of an aircraft's fuel tanks and seeing the aircraft up close and personal it blows your mind every time. What's your favourite part of your job? Chelsea: Honestly, my favourite part of the job is the people here so they really make it and we have a really great work environment.And I think that's really important. I work with a lot of people from all over Europe and they all have a lot of different experiences and different knowledge and it’s just really interesting. I think everyone's core values really resonate with mine as well. So everyone does really care about making a difference. Why do you think it's important for me to get a green career? Chelsea: Industries need to change but in order to change they need a lot of help and this help comes from new scientistsand new Engineers with fresh ideas. So it's a good idea to get a job in a green career in order to help progress these industries into the right direction. Having a green career is also fulfilling so you go home and you know that even though things might still seem slow and a long way off. You know that the work you have done that day is a small step towards progressing and Industry that does needto improve. Want to find out more about green jobs and sustainable careers advice? Better go to Bitesize.","filter_flag":1}
{"title":"NEOM reveals Magna, its new coastal region","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d07350042d49e13956a9f97bb9f&url=https%3a%2f%2fwww.prnewswire.co.uk%2fnews-releases%2fneom-reveals-magna-its-new-coastal-region-302164747.html%3fgclid%3dEAIaIQobChMIh&c=162926189467562270&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d07350042d49e13956a9f97bb9f&url=https%3a%2f%2fwww.prnewswire.co.uk%2fnews-releases%2fneom-reveals-magna-its-new-coastal-region-302164747.html%3fgclid%3dEAIaIQobChMIh&c=162926189467562270&mkt=en-us","summary":"creating thriving businesses and reinventing environmental conservation. NEOM will include hyperconnected, cognitive cities, ports and enterprise zones, research centers, sports and entertainment ...","published":"Wed, 05 Jun 2024 06:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=5, tm_hour=6, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=157, tm_isdst=0)","news_source":"PR Newswire","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"NEOM reveals Magna, its new coastal region","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"creating thriving businesses and reinventing environmental conservation. NEOM will include hyperconnected, cognitive cities, ports and enterprise zones, research centers, sports and entertainment ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Environmental Conservation\" \"new products\"&format=rss","text":"NEOM, Saudi Arabia, June 5, 2024 \/PRNewswire\/ -- The Board of Directors of NEOM has today revealed the development of Magna, its luxury lifestyle coastal destination. Part of NEOM's regional sustainable tourism portfolio, Magna is situated on the stunning Gulf of Aqaba coastline and comprises the recently announced premier destinations of Leyja, Epicon, Siranna, Utamo, Norlana, Aquellum, Zardun, Xaynor, Elanan, Gidori, Treyam and Jaumur. NEOM reveals Magna, its new coastal region. The twelve destinations will span 120 kilometers and are poised to set a new global standard in luxury sustainable tourism. As the physical embodiment of the ambitious and future-focused Saudi Vision 2030, Magna will be developed with a core focus on cutting-edge technology, world-class architecture, and ultra-modern amenities that effortlessly merge with nature. Each destination is individually unique, with its own distinct offering for residents and guests, yet seamlessly blends to form a unified destination. They will be woven together by the conservation, preservation, and rejuvenation of native flora, fauna, and the breathtaking natural landscape. The development will comprise 15 luxury hotels, 1,600 hotel rooms, suites and apartments, and over 2,500 premium residences across its destinations. Nadhmi Al-Nasr, Chief Executive Officer, NEOM, said: \"NEOM's premier coastal region of Magna is a treasure of tomorrow, steeped in natural beauty and advanced technology. Aligned with our three pillars of redefining business, conservation, and livability, Magna will play a key role in building a strong tourism ecosystem within NEOM. Importantly, Magna will contribute positively to the national economic diversification efforts and to the broader Saudi Vision 2030 goals, helping to position the Kingdom as a global leader in luxury tourism.\" In line with the transformative Saudi Vision 2030, Magna and its destinations will stimulate the Kingdom's economy by creating 15,000 jobs across the tourism, leisure, and hospitality sectors. The development is projected to contribute SAR2.6 billion to the Kingdom's GDP by 2030, accommodate 14,500 residents, and welcome more than 300,000 overnight visitors annually. Magna presents an unprecedented opportunity for investors and developers to be part of one of the world's most pioneering projects, with sustainability embedded in every stage from design to construction, and long-term maintenance. Magna is NEOM's newest region within the evolving giga-project development in the northwest of Saudi Arabia, following Sindalah, THE LINE, Trojena, and Oxagon. Press Kit: https:\/\/fileshare.neom.com\/s\/4kn7Qiys5BzaL2n Password: NEOMMagna123 About NEOM NEOM is an accelerator of human progress and a vision of what a New Future might look like. It is a region in northwest Saudi Arabia on the Red Sea being built from the ground up as a living laboratory – a place where entrepreneurship will chart the course for this New Future. It will be a destination and a home for people who dream big and want to be part of building a new model for exceptional livability, creating thriving businesses and reinventing environmental conservation. NEOM will include hyperconnected, cognitive cities, ports and enterprise zones, research centers, sports and entertainment venues and tourist destinations. As a hub for innovation, entrepreneurs, business leaders and companies will come to research, incubate and commercialize new technologies and enterprises in groundbreaking ways. Residents of NEOM will embody an international ethos and embrace a culture of exploration, risk-taking and diversity. For further information email media@neom.com or visit www.neom.com and www.neom.com\/en-us\/newsroom. Photo - https:\/\/mma.prnewswire.com\/media\/2431006\/NEOM_reveals_Magna.jpg Logo - https:\/\/mma.prnewswire.com\/media\/2288277\/NEOM_Logo.jpg","filter_flag":1}
