{"title":"Bangladesh: Unlocking climate finance for enterprises - PreventionWeb","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnByZXZlbnRpb253ZWIubmV0L25ld3MvdW5sb2NraW5nLWNsaW1hdGUtZmluYW5jZS1taWNyby1zbWFsbC1hbmQtbWVkaXVtLXNpemVkLWVudGVycHJpc2VzLWNvYXN0YWwtYmFuZ2xhZGVzaNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnByZXZlbnRpb253ZWIubmV0L25ld3MvdW5sb2NraW5nLWNsaW1hdGUtZmluYW5jZS1taWNyby1zbWFsbC1hbmQtbWVkaXVtLXNpemVkLWVudGVycHJpc2VzLWNvYXN0YWwtYmFuZ2xhZGVzaNIBAA?oc=5","id":"CBMieGh0dHBzOi8vd3d3LnByZXZlbnRpb253ZWIubmV0L25ld3MvdW5sb2NraW5nLWNsaW1hdGUtZmluYW5jZS1taWNyby1zbWFsbC1hbmQtbWVkaXVtLXNpemVkLWVudGVycHJpc2VzLWNvYXN0YWwtYmFuZ2xhZGVzaNIBAA","guidislink":false,"published":"Thu, 12 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=285, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnByZXZlbnRpb253ZWIubmV0L25ld3MvdW5sb2NraW5nLWNsaW1hdGUtZmluYW5jZS1taWNyby1zbWFsbC1hbmQtbWVkaXVtLXNpemVkLWVudGVycHJpc2VzLWNvYXN0YWwtYmFuZ2xhZGVzaNIBAA?oc=5\" target=\"_blank\">Bangladesh: Unlocking climate finance for enterprises<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PreventionWeb<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bangladesh: Unlocking climate finance for enterprises - PreventionWeb","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnByZXZlbnRpb253ZWIubmV0L25ld3MvdW5sb2NraW5nLWNsaW1hdGUtZmluYW5jZS1taWNyby1zbWFsbC1hbmQtbWVkaXVtLXNpemVkLWVudGVycHJpc2VzLWNvYXN0YWwtYmFuZ2xhZGVzaNIBAA?oc=5\" target=\"_blank\">Bangladesh: Unlocking climate finance for enterprises<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PreventionWeb<\/font>","source.href":"https:\/\/www.preventionweb.net","source.title":"PreventionWeb","query":"https:\/\/news.google.com\/rss\/search?q=\"Resilient materials\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Makame Mahmud and Jubaer Rashid of CDKN Asia share their insights on a project that assessed climate financing opportunities for Micro, Small and Medium-Sized Enterprises (MSMEs) in Bangladesh's southwestern coastal areas. The region is known for agriculture, aquaculture and handicrafts, with women entrepreneurs playing a significant role. Sector-specific impacts are identified and key recommendations are outlined for improving the climate resilience of MSMEs in the region. Bangladesh is one of the most vulnerable countries to climate change in the world. This is due, in large part, to its geographical location and socioeconomic conditions. Rising temperatures, changing precipitation patterns and more frequent extreme weather events such as cyclones and flooding have significantly impacted the country's economy and people’s livelihoods. Increasing salinity in the coastal areas is a particularly difficult challenge for Bangladesh. The southwestern coastal regions comprise 19 districts that cover 32% of the country’s land area and have a combined population of 35 million people. Seawater is intruding into sources of freshwater, making the water unsuitable for drinking and irrigation. Salinity impacts 26% of the country, making it a significant problem for the agriculture and fisheries sectors, in addition to causing forced migration and displacement of coastal communities that rely on farming and fishing for their livelihoods. MSMEs are important components of the economy in coastal regions. Often the primary source of income and employment for local communities, MSMEs are also highly vulnerable to the adverse effects of climate change, which impact infrastructure, disrupt supply chains and reduce demand for products and services, making it difficult for them to operate effectively. To address the potential climate financing opportunities for MSMEs, from 2019 to 2021, CDKN Asia implemented a knowledge-basis project, Assessing Investment Opportunities for Micro, Small and Medium Enterprises in Southwest Bangladesh. The project’s primary objective was to investigate climate change vulnerabilities, existing gender-sensitive adaptation practices and potential adaptation investment options for MSMEs located in the coastal districts of Satkhira, Bagerhat and Khulna. Challenges for MSMEs in coastal districts Satkhira, Bagerhat and Khulna are located in the southwestern region of Bangladesh and have a combined population of more than 12 million people. The region is known for agricultural and aquaculture activities such as rice cultivation, shrimp farming and fishing. The three districts contributed 75% of the total shrimp yield between 2002 and 2017. Most of the economic activities in these districts are driven by MSMEs, which are vital in providing jobs and incomes to the local communities. The project identified the most important sectors among MSMEs, district-wise. In Satkhira, these are shrimp and crab farms, vegetable and fish farms, livestock and poultry, seeds, fertilisers and insecticides, boutiques, tailors, handicrafts and nurseries. In Bagerhat, the sectors include coconut and natural products, shrimp and crab farms, vegetable and fish farms, livestock and poultry, boutiques, tailors and handicrafts. In Khulna, the sectors include agro-processing and frozen foods, jute, handicrafts and women entrepreneurship. Notably, in Khulna, a significant number of women entrepreneurs are active in the handicrafts, tailoring and beauty sectors, generating employment opportunities for women workers. MSMEs in several districts of Bangladesh, including the project areas, face challenges such as limited access to finance, shortages of skilled labour and inadequate infrastructure. Additionally, they grapple with climate change impacts such as flooding, waterlogging, saline intrusion and cyclones. These climate impacts damage infrastructure, disrupt supply chains and reduce the demand for products and services, thus increasing financial and operational challenges for MSMEs and making them more vulnerable. Sectoral impacts The project identified specific sectoral impacts. For instance, shrimp farming is becoming unsustainable due to increasing salinity, drought, declining water quality and various diseases affecting shrimp species. In the livestock and poultry sectors, high temperatures, erratic rainfall and humidity are impacting animal health and production work, necessitating increased training and investments. The handicrafts sector is facing issues of insufficient financing, health problems among workers and climate change impacts on raw materials. These challenges encompass disrupted growth cycles and reduced access to essential materials such as bamboo, jute and wood — posing challenges for artisans. Changes in rainfall patterns and rising temperatures are affecting jute yield. Furthermore, the scarcity of water supply and poor road infrastructure have contributed to a decline in the production of jute related products. Despite jute's potential as a sustainable and climate-friendly material, it struggles to compete with plastic due to inadequate enforcement of the mandatory Jute Packaging Act. In addition to infrastructure upgrades, there is an urgent need to introduce climate-resilient jute varieties capable of year-round cultivation. Increased cyclones and saline water intrusion result in embankment erosion, reducing their effectiveness in protecting against coastal flooding. Additional investments are required for embankment repairs and improvements. Reinforcing these structures with resilient materials and technologies is crucial to improving their durability and protecting against flooding. For repairing embankments. In the nursery sector, there is a need to invest in training, consultation with experts and modern equipment and to facilitate loans with easier terms as well as better terms for leased land to adapt to changing weather patterns. Investment is also needed for introducing hybrid and resilient varieties of coconuts and betel nuts, the production of which is decreasing due to salinity. Project outcomes and recommendations The project studied the MSMEs' vulnerability to climate change impacts as well as the adaptation measures currently in place. Climate risks such as sea-level rise, flooding and cyclones were identified after in-depth research and consultations with various stakeholders. The assessment of the adaptation practices focused on gender-sensitive approaches that could help ensure that the most vulnerable groups were not left behind. Secondly, the project fostered partnerships between key stakeholders such as governmental organisations, the private sector and non-governmental organisations\/civil society to raise awareness of and promote a coordinated effort towards investment in building climate-resilient MSMEs and to identify such investment options. The project’s findings led to several key recommendations: Key investment areas or additional areas for expenditure by businesses due to climate vulnerability: Relocating plants: Invest in retrofitting or relocating plants, managing hazardous waste, addressing health hazards for workers and dealing with logistical challenges caused by public infrastructure failure. Additionally, they can develop new products such as jute-based items, coconut shell products, handlooms and more. Jute is a natural fibre extracted from the bark of the white jute plant (Corchorus capsularis) and tossa jute (C. olitorius). It is often called the \"Golden Fibre\" due to its shiny appearance. Jute fibre is 100% bio-degradable and recyclable, making it environmentally friendly. Cultivating jute in crop rotations also enriches the soil fertility for the next crop. A hectare of jute plants consumes about 15 tonnes of carbon dioxide and releases 11 tonnes of oxygen. The crop takes around 120 days (from April\/May to July\/August) to fully mature. Hazardous waste: Proper storage and disposal of hazardous waste is crucial to prevent environmental contamination from waterlogging and other climate-related hazards. Significant investment from the government and private sector can help relevant manpower develop their knowledge capacity to manage sustainable hazardous waste management more efficiently in compliance with National and International Guidelines. Health hazards: Investment should cover health hazard costs for workers, as it can significantly affect productivity when employees have health problems. Workers health should be considered for investment because businesses may shift worker costs, but expenses for health, absenteeism and turnover can lead to missed opportunities. Climate resilient species: Immediate action is imperative to prioritise agriculture and livestock species that can withstand the effects of climate change. Significant investment can help grow the aquaculture sector by doing research and introducing climate resilient species for aquaculture (e.g. saline-adaptive shrimp varieties), poultry, livestock or crops (e.g. round-the-year, climate-resistant jute) Facilitating adaptation: Investing in new products to reduce adaptation, such as water desalination plants and jute-based products. New innovative business models: Adoption of new or innovative business models, e.g. mangrove-based pisciculture. Training and capacity building: Investment in training and capacity building of business owners and workers about climate change, vulnerability and adaptation. Adaptation initiatives: Investment in peer learning and up scaling of successful adaptation initiatives. Corporate social responsibility: Investment in corporate social responsibility efforts aligned with adaptation, e.g. reforestation. Minimising the financial gap: It is evident from the project's findings that a multi-faceted approach is required to tackle the challenges encountered by MSMEs in these districts. Crucial measures that are needed for overcoming the issue of creditworthiness include facilitating contacts with financial institutions, identifying risk factors and providing advisory support. Collaboration with research organisations and multi-stakeholder platforms to identify financing gaps as well as recommendations on policy support and financial incentives are also crucial. The development of standards and tools to assess climate vulnerability, adaptation requirements and investment needs can aid in integrating climate considerations into project assessments for financing adaptation investment. Moreover, promoting jute packaging (an environmentally friendly substitute for plastic packaging like jute bags, floor coverings etc.), providing healthcare facilities and organising awareness campaigns to reduce illnesses among workers are measures that are recommended for mitigating climate vulnerabilities and enhancing the overall performance of MSMEs. Conclusion The MSME sector in Bangladesh is a critical component of the economy, with nearly 10 million SMEs contributing 23% to the GDP, 80% of the jobs in the industrial sector and 25% of the total labour force. The World Bank has found that the country has a financing gap of USD 2.8 billion in the MSME sector, with 60% of the women’s SMEs needing more collateral. Improving the MSMEs’ resilience and adaption to climate change is crucial and providing them more access to climate finance can play a vital role in achieving these goals. By promoting the development of climate-resilient businesses and value chains, local economies can become more diversified and less reliant on vulnerable sectors. The project’s valuable outputs and recommendations can help both public and private financial institutions identify the most important investment areas for enhancing the resilience of MSMEs in the southwestern coastal region of Bangladesh. They can also provide insights to policymakers and investors into the current state of MSMEs and their exposure to climate risks. Providing climate finance can help to significantly enhance MSMEs' resilience and help them adapt to changing environmental conditions. This can involve improving their access to finance, technical assistance and capacity building to help them implement climate-friendly practices and technologies. Furthermore, climate finance can support the creation of new climate-resilient businesses and value chains that diversify local economies and reduce their dependence on vulnerable sectors. Providing climate finance to MSMEs in coastal areas can result in a more resilient and sustainable economy. Most importantly, by analysing the economic, social and environmental factors that affect MSMEs' performance and sustainability, the project has identified potential areas for investment that could help build their climate resilience.","filter_flag":1}
{"title":"Best portable music players - SoundGuys","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiO2h0dHBzOi8vd3d3LnNvdW5kZ3V5cy5jb20vYmVzdC1wb3J0YWJsZS1tdXNpYy1wbGF5ZXItODg1ODEv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiO2h0dHBzOi8vd3d3LnNvdW5kZ3V5cy5jb20vYmVzdC1wb3J0YWJsZS1tdXNpYy1wbGF5ZXItODg1ODEv0gEA?oc=5","id":"CBMiO2h0dHBzOi8vd3d3LnNvdW5kZ3V5cy5jb20vYmVzdC1wb3J0YWJsZS1tdXNpYy1wbGF5ZXItODg1ODEv0gEA","guidislink":false,"published":"Sun, 22 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=295, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiO2h0dHBzOi8vd3d3LnNvdW5kZ3V5cy5jb20vYmVzdC1wb3J0YWJsZS1tdXNpYy1wbGF5ZXItODg1ODEv0gEA?oc=5\" target=\"_blank\">Best portable music players<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SoundGuys<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Best portable music players - SoundGuys","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiO2h0dHBzOi8vd3d3LnNvdW5kZ3V5cy5jb20vYmVzdC1wb3J0YWJsZS1tdXNpYy1wbGF5ZXItODg1ODEv0gEA?oc=5\" target=\"_blank\">Best portable music players<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SoundGuys<\/font>","source.href":"https:\/\/www.soundguys.com","source.title":"SoundGuys","query":"https:\/\/news.google.com\/rss\/search?q=\"Resilient materials\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Though it’s a rare thing to need, a portable music player is something you might find yourself in the market for. Whether you’re looking to replace your smartphone or Bluetooth speakers as your music source or just looking for an integrated amp and digital-to-analog converter (DAC) stack that you can take with you, portable music players are the best they’ve ever been—even if their widespread appeal is all but gone. What's new? This article was updated on October 22, 2023, to include Sony's latest Walkman as a new top pick, add an FAQ section, and adjust formatting to our current style. The Sony Walkman WM1AM2 is the best portable music player Austin Kwok \/ SoundGuys On the top are a gold-plated 4.4mm balanced port and a 3.5mm single-ended port. If you’re searching for the pinnacle of portable audio, the Sony NW-WM1AM2 should be at the top of your list. With its DSD Remastering Engine, it transforms standard PCM audio into a high-frequency DSD 1-bit audio stream that mimics analog sound in its purest form. And if you want to go wireless, the LDAC codec ensures you lose none of that high-resolution quality when you cut the cord. But the exceptional sound is only the start. The Walkman boasts a build quality that matches its audio prowess, featuring a gold-plated, oxygen-free copper chassis. It’s not just aesthetics; these premium materials significantly enhance sound quality, making every bass note feel like a heartbeat and each treble a crystal-clear chime. Of course, what’s high-end audio without the stamina to back it up? With robust battery life, the NW-WM1AM2 ensures you’re not just tethered to your charger but free to roam with your tunes. And if you’re worried about your extensive, varied music collection, fret not. This device plays everything from your classic MP3s to high-end DSD files, serving as a veritable Swiss army knife of audio formats. Overall, the Sony NW-WM1AM2 stands alone as a masterpiece of both form and function. Its considerable price tag is fully justified, offering an experience that’s second to none. If you’re serious about your sound, this is the investment that pays off in audio bliss. Sony NW-WM1AM2 Walkman Sony NW-WM1AM2 Walkman High-resolution audio • Native DSD support • S-Master HX amplifier MSRP: $1,398.00 See price at Amazon How does the Sony NW-WM1AM2 compare to the Sony NW-WM1ZM2? Both the Sony NW-WM1AM2 and NW-WM1ZM2 offer similar core functionalities, such as DSD and LDAC support, but they differ in build and internal components. For an extra $3,000, the NW-WM1ZM2 features a purer copper chassis, a stronger power supply, and specialized internal components like high-polymer capacitors and better-quality wiring. These improvements aim to provide clearer bass, reduced distortion, and an overall enhanced audio experience. In essence, the higher price is largely paying for materials and technologies designed to deliver a superior sound quality. Take a look at the specs comparison below: Model WM1AM2 WM1ZM2 Model Storage WM1AM2 128 GB (Actual 103 GB) WM1ZM2 Model DAC WM1AM2 DSD Remastering Engine (Up to 11.2MHz DSD) WM1ZM2 DSD Remastering Engine (Up to 11.2MHz DSD) Model Wireless Codec WM1AM2 LDAC (3x bitrate of standard Bluetooth) WM1ZM2 LDAC (3x bitrate of standard Bluetooth) Model Output Ports WM1AM2 Stereo mini jack, Balanced standard jack WM1ZM2 Stereo mini jack, Balanced standard jack Model Files supported WM1AM2 MP3, WMA, FLAC, WAV, AAC, HE-AAC, Apple Lossless, AIFF, APE, MQA WM1ZM2 MP3, WMA, FLAC, WAV, AAC, HE-AAC, Apple Lossless, AIFF, APE, MQA Model DSD types supported WM1AM2 DSD (2.8224 MHz \/ 1 bit), DSD (5.6448 MHz \/ 1 bit) WM1ZM2 DSD (2.8224 MHz \/ 1 bit), DSD (5.6448 MHz \/ 1 bit), DSD (11.2 MHz \/ 1 bit) Model Battery WM1AM2 40 hrs (W.Music App), 18 hrs (Other Apps) WM1ZM2 40 hrs (W.Music App), 18 hrs (Other Apps) Model Android version WM1AM2 Android 11 WM1ZM2 Android 11 Model Equalizer WM1AM2 10-Band equalizer, DSEE Ultimate, DC Phase Linearizer, Dynamic Normalizer, Vinyl Processor WM1ZM2 10-Band equalizer, DSEE Ultimate, DC Phase Linearizer, Dynamic Normalizer, Vinyl Processor Model Input Ports WM1AM2 USB, Micro SD WM1ZM2 USB, Micro SD Model Output Power WM1AM2 60 mW + 60 mW (Stereo mini), 250 mW + 250 mW (Balanced) WM1ZM2 60 mW + 60 mW (Stereo mini), 250 mW + 250 mW (Balanced) Sony NW-WM1ZM2 256GB Signature Series Premium Digital Music Player Sony NW-WM1ZM2 256GB Signature Series Premium Digital Music Player Sound great • Faithful sound reproduction • High-quality materials MSRP: $3,699.99 See price at Amazon The FiiO M11S is the best portable music player for most people Considering that most portable music players are largely specification-driven and aren’t very complicated once you’ve identified what you want, the FiiO M11S has the most bang for your buck on the market today. The M11S offers a monster battery, top-of-the-line wired and wireless options, and the ability to use your favorite streaming services. Paired with a respectable output level, it’s none too shabby. FiiO’s options here are generally the options with the largest batteries that you can find under $1000, so it’s no surprise that the latest addition to the company’s line would stack up against the competition this way. The main reason you’d want something else is if you really desperately needed higher power output than the M11S can offer, and that would mean making tradeoffs in the price or features department. FiiO M11S FiiO M11S Battery life • Wired and Wireless • Streaming service compatibility MSRP: $499.99 High-power, high-res MP3 player The FiiO M11S is a high-performance, high-res MP3 player. This Android powered device has a large battery, 5-inch display, multiple connection ports, and can play many music file formats. See price at Amazon Save $0.99 Why is the FiiO M11S the best portable music player? Paying many thousands of dollars for a portable music player is often only going to get you very small improvements at significant cost—so we’re going to advise you to not do that. While the FiiO M11S might not be everyone’s cup of tea, it does tick all the boxes for a good portable audio player that can also handle pretty much anything you throw at it (including most streaming services). To be clear, this is a unit that isn’t going to be a perfect match for all headphones; it’s just the right tool for most of them. FiiO M11S Storage 32GB (expandable to 2TB) DAC ES9038Q2m× 2 Output ports USB-C, 3.5mm TRS, 2.5mm balanced, 4.4mm Pentaconn Files supported DSD64\/128\/256, DXD, APE, ALAC, FLAC, WAV, AIFF, WMA, MP3, OGG, AAC, MQA BT codecs SBC\/AAC\/APTX\/APTX-HD\/LDAC\/LHDC Battery 5300mAh Android version 10 Equalizer Parametric, user-defined bands Input ports USB-C Output power 300mW 3.5mm port, 550mW 2.5 and 4.4mm ports FiiO does a pretty good job of making the most of the components crammed into this unit, as it provides a parametric equalizer to customize your sound to your liking or even use presets from others online. Additionally, you can use this unit as a stand-in for a DAC and amp for your computer. Really, there aren’t very many features for portable music players not on the M11S, so this is an easy recommendation. This unit will satisfy the vast majority of use cases that even a highly demanding user would throw at it, save for waterproofing or ultra-high output. If you’re using headphones that require more than a watt of juice to reach an appropriate level, you’re going to want to look for something else. Just like any other portable audio player, you need to match what your needs are to the right product first. However, unless you’re running super insensitive planar magnetic headphones or some ultra-boutique options, chances are extremely good that you don’t need a super high output source. For most people, that makes the FiiO M11S—the cheapest portable music player that has all the best features music players can offer—the best portable music player. We decided against the FiiO M11 Plus because the upgrades it offers really aren’t worth the extra $175 unless you’re deep in the rabbit hole of portable audio already. Stacking an extra 10mW of output power and 700mAh to the battery is notable. Still, considering the M11S already has a decent output level and battery, you’re not likely to notice much change unless you have super power-hungry headphones. If you’re on a budget, get the Hidizs AP80 The Hidizs AP80 Pro is quite small. Even if you don’t have a ton of cash to burn on this endeavor, you can, in fact, get pretty much everything you’re looking for in a portable music player at a fairly “low” cost. The Hidizs AP80 is a rather unassuming square-shaped device with limited bells and whistles. However, it does tick all the boxes you could want in a portable music player outside of raw power. But even then, we were able to drive the Sennheiser HD 800 S and Meze Audio Liric without any issues. If you need a unit capable of higher output, you’re likely going to be looking at devices in a higher price bracket. This portable audio player might be tiny, but it offers FLAC playback, LDAC, expandable storage up to 2TB via microSD, and, you guessed it: a headphone jack. There are two upgrade options for the AP80 if you decide you’d like something better, but the increase in cost is not likely to be worth the money if you’re looking for major upgrades. Model AP80 AP80 Pro AP80 Pro-X Model Storage AP80 1TB AP80 Pro 512GB AP80 Pro-X 512GB Model DAC AP80 Saber ES9218P AP80 Pro AP80 Pro-X Saber ES9218P (x2) Model Output AP80 70mW (32Ω) AP80 Pro AP80 Pro-X 70mW (32Ω), 190mW balanced Model Files supported AP80 AP80 Pro AP80 Pro-X Up to 32-bit\/384kHz FLAC, WAV, AIFF, MP3, ALAC, AAC, WMA, OGG, DSF, DSD, DIFF, APE Model BT codecs AP80 AP80 Pro AP80 Pro-X SBC, AAC, aptX, LDAC Model Battery AP80 AP80 Pro AP80 Pro-X 800mAh While this may be the “best” in the budget category on paper, what you’re saving in money, you’re spending in effort. The player doesn’t automatically update its library every time you add to the microSD card, and you’ll also have to figure out how to set the auto-shut-off feature. Otherwise, the AP80 will just stay on in perpetuity. But once you’ve smoothed out these rough spots, you can use the AP80 as a headphone amp\/DAC for your computer, an FM radio, or just the thing you bought it for — a portable audio player. Hidizs AP80 Hidizs AP80 Price • Hi-Res audio support • MicroSD storage MSRP: $199.99 An ultra-portable and affordable high-res MP3 player The Hidizs AP80 is a compact music player that has expandable storage, can operate as a DAC\/amp for your PC, and support high-res audio formats. See price at Amazon Need power? The iBasso DX170 has you covered Black rectangles seldom look amazing, but the iBasso DX170 looks fine enough. While it doesn’t have the same “everything but the kitchen sink” approach as the FiiO, the iBasso DX170 has a lot of power under the hood. The iBasso DX170 has the highest output level on this list and comes in at a full $50 cheaper than the FiiO M11S. That makes it a good match for someone who—for whatever reason—really, really needs more power. Of course, this could describe audiophiles who love to EQ their tunes with extreme adjustments either way, so if you’re a tinkerer, you may want to go this route instead. Some users have reported that they’re unsatisfied with how cheap the DX170 feels in person, and to that, we’d like to note that with a price lower than its closest competition, the cost savings had to come from somewhere. For the utilitarian out there, it may not be such a big deal. However, anyone looking for a luxury product may want to look at higher-end iBasso options if you’re a fan of their schtick. Just note that you don’t need to use that “burn-in cable” included in the packaging. iBass DX170 iBass DX170 Price • Connectivity options MSRP: $449.00 Competitively priced high-end MP3 player The iBasso DX170 has a lot of power under the hood. High output levels matched with a very competitive price make this an ideal MP3 player for some users. See price at Amazon The SanDisk Clip Sport Plus is a good gym buddy Christian Thomas \/ SoundGuys Of course, if you don’t need a lot of power, maybe you just need a bog-standard MP3 player like the old days. That’s where the SanDisk Clip Sport Plus comes in. This little fella can clip onto your shirt or armband and store 32GB (there are smaller models, too) of tunes for your workout. Additionally, it’s sweat-resistant with an IPX5 rating. While it’s quite a bit cheaper than the other entries here, the SanDisk Clip Sport Plus isn’t exactly aimed at someone looking to replace a computer or a smartphone for their tunes. This is a product to remove all thought necessary for someone who just wants to use the earbuds or headphones they always work out with and now need a solution with a headphone jack. There’s no card slot, there’s no high-power amplifier, and there’s definitely no streaming support from any of the main music streaming services. However, as this product is a great deal less expensive than a phone (not to mention less of a tragedy if it breaks), it’s a good companion for a workout. SanDisk Clip Sport Plus SanDisk Clip Sport Plus Small and portable • IPx5 rating • Battery life MSRP: $59.99 Want music on the go? That's what you'll get The SanDisk Clip Sport is representative of the MP3 players of old. A simple display and limited options help you focus on the objective of this device, to take your music on the go in a reliable and convenient package. See price at Amazon Save $20.99 What makes a good portable music player? It’s rough to admit, but the MP3 player is a bit of a relic of the past. If you want a portable music player, chances are the actual things you need it to do are fairly limited in scope and easy to accomplish. Consequently, this is one of those products that you can absolutely just check for the things you want on a specifications page and simply grab whatever suits your needs. There’s no right or wrong DAC chip to get—just whatever works for your needs and budget. Lily Katz \/ SoundGuys Smartphones used to be the answer, and then the headphone jack went away. A portable music player won’t need to stand in as your primary entertainment device, so you really just need something with a headphone jack, decent battery life, and the ability to store your library of music. What questions you need to answer Here’s the info you need to track down before buying a digital audio player: How much power do you need? What formats are your tunes in your library? Do you need access to a streaming service? If so, you’re going to need a player with Wi-Fi (or perhaps even a fork of Android). What headphone connection do you need? Do you want a balanced output? Nice upgrades are going to take the form of things like an expandable memory slot (microSD) or Bluetooth connectivity over advanced codecs like aptX or LDAC. Additionally, you may see different DAC chips from companies Texas Instruments, Sabre, or Burr Brown. Truth be told, you’re unlikely to notice a difference there, so don’t let that be the deciding factor for you. There are other specs you may want to pay attention to, such as battery size, bit depth and sample rate supported, power output, file types supported, and internal file capacity. Model Price Highest bit depth Highest sample rate (kHz) Streaming? Input Output Max Output Internal storage Bluetooth Battery Model Astell & Kern KANN Alpha Price $1099USD Highest bit depth 32 Highest sample rate (kHz) 384 Streaming? Yes Input USB-C Output 3.5mm TRS, optical out, 2.5mm balanced Max Output 6Vrms unbalanced 12Vrms balanced Internal storage 64GB (expandable to 1TB) Bluetooth 5.0 (aptX HD, LDAC) Battery 5600mAh Model Astell & Kern SE180 Price $1499USD Highest bit depth 32 Highest sample rate (kHz) 384 Streaming? Yes Input USB-C Output 3.5mm TRS, 2.5mm balanced, 4.4mm balanced Max Output 3Vrms unbalanced 6Vrms balanced Internal storage 256GB (expandable to 1TB) Bluetooth 5.0 (aptX HD, LDAC) Battery 3800mAh Model Astell & Kern SR15 Price $699USD Highest bit depth 24 Highest sample rate (kHz) 192 Streaming? Yes Input microUSB Output 3.5mm TRS, Pentaconn Max Output 2Vrms unbalanced 4Vrms balanced Internal storage 64GB (expandable to 1TB) Bluetooth No Battery 3150mAh Model Astell & Kern SR25 MK II Price $750USD Highest bit depth 32 Highest sample rate (kHz) 384 Streaming? Yes Input USB-C Output 3.5mm TRS, 2.5mm balanced, 4.4mm balanced Max Output 2Vrms unbalanced 4Vrms balanced Internal storage 64GB (expandable to 1TB) Bluetooth 4.2 (aptX HD, LDAC) Battery 3150mAh Model FiiO M11 Plus Price $699USD Highest bit depth 32 Highest sample rate (kHz) 384 Streaming? Yes Input USB-C Output 3.5mm TRS, 2.5mm balanced, 4.4mm balanced Max Output 210mW unbalanced, 660mW balanced Internal storage 64GB (expandable up to 2TB) Bluetooth 5.0 (aptX HD, AAC, LDAC) Battery 6000mAh Model FiiO M11S Price $515USD Highest bit depth 32 Highest sample rate (kHz) 384 Streaming? Yes Input USB-C Output 3.5mm TRS, 2.5mm balanced, 4.4mm balanced Max Output 200mW unbalanced 670mW balanced Internal storage 32GB (expandable to 2TB) Bluetooth 5.0 (aptX HD, AAC, LDAC) Battery 5300mAh Model Hidisz AP80 Pro Price $168.99USD Highest bit depth 32 Highest sample rate (kHz) 384 Streaming? No Input USB-C Output 3.5mm TRS, 2.5mm balanced Max Output 140mW Internal storage (expandable to 2TB) Bluetooth 4.2 (aptX HD, LDAC) Battery 800mAh Model iBasso DX170 Price $449USD Highest bit depth 32 Highest sample rate (kHz) 384 Streaming? Yes Input USB-C Output 3.5mm TRS, 4.4mm balanced Max Output 3.2Vrms unbalanced 6.4Vrms balanced Internal storage 32GB (expandable to 1TB) Bluetooth 5.0 (aptX HD, LDAC) Battery 3200mAh Model iBasso DX240 Price $949USD Highest bit depth 32 Highest sample rate (kHz) 384 Streaming? Yes Input USB-C Output 3.5mm TRS, 4.4mm Balanced Max Output 3.1Vrms unbalanced 6.2Vrms balanced Internal storage 64GB (expandable to 2TB) Bluetooth 5.0 (aptX HD, LDAC) Battery 4400mAh Model Shanling M0 Pro Price $129.99USD Highest bit depth 32 Highest sample rate (kHz) 384 Streaming? No Input USB-C Output 3.5mm TRS, balanced Max Output 90mW Internal storage (expandable to 2TB) Bluetooth 5.0 (aptX HD, AAC, LDAC) Battery 650mAh Model Sony NW-A306-B Price $349.99USD Highest bit depth 32 Highest sample rate (kHz) 384 Streaming? Yes Input USB-C Output 3.5mm TRS Max Output 1.1mW Internal storage 32GB (usable is 18, expandable to 1TB) Bluetooth 5.0 (aptX HD, AAC, LDAC) Battery Not listed Model Sony NW-ZX507 Price $829.99USD Highest bit depth 32 Highest sample rate (kHz) 384 Streaming? Yes Input USB-C Output 3.5mm TRS, balanced Max Output 100mW unbalanced, 200mW balanced Internal storage 64GB (expandable to 1TB) Bluetooth 5.0 (aptX HD, AAC, LDAC) Battery Not listed Model Sony NW-ZX707 Price $899.99USD Highest bit depth 32 Highest sample rate (kHz) 384 Streaming? Yes Input USB-C Output 3.5mm TRS, balanced Max Output 1.1mW Internal storage 64GB (expandable to 1TB) Bluetooth 5.0 (aptX HD, AAC, LDAC) Battery Not listed Many of the units listed on this page are also capable of standing in for your DAC and headphone amp, which is a nice way to consolidate your electronics if you’re just starting your equipment stack. The vast majority of headphones out there aren’t going to need a ton of power. What is the difference between balanced and unbalanced? Is unbalanced bad? Hobbyists love their bespoke equipment, and headphones are no exception. Some boutique headphones require a balanced connection using either a 2.5mm 4-pole TRRS or a 5-pole 4.4mm Pentaconn. These aren’t going to work if you shove them into a normal headphone jack. You’ll need the correct port on your device, or you’ll need a dongle to get headphones with these cable terminations to operate. However, there’s a growing number of portable audio players that can accommodate these connections. The Sennheiser HD 660S comes with 2 cables and an adaptor, providing 3 different connector options. The difference between a balanced and unbalanced connection is in how the signal is treated on the way to your ears. Balanced connections will make use of a concept called differential signaling to supposedly tamp down noise introduced by interference from outside. In contrast, unbalanced connections will simply take the single-ended audio signal from your source without doing that. While it sounds like it might offer a huge improvement, decent shielding on your cables (which should be assumed at this point) should mean that there isn’t any significant difference between the two strategies as far as noise is concerned. For headphones, at least. If you don’t have a balanced connection, you really don’t have anything to worry about. Are you sure you even want a portable music player? Many people looking for portable music players are looking to use their favorite headphones with something they can carry and would drop the idea in a hot second if their smartphones could keep up. Now that the headphone jack is extremely rare in smartphones, it’s entirely possible that what some people are looking for isn’t a portable music player but a USB dongle. If you just want the headphone jack back, there are cheaper options than a portable music player. These devices are generally a lot cheaper than portable music players, and they allow your smartphone to be the music player you want it to be. As always, products like this are mainly spec-driven, so any will work so long as they can meet the power requirements of your headphones—and the only hookup necessary is to use the USB-C port of your Android phone. Apple users will need to specifically look for units that have lightning connectors—though 9 times out of 10, you’ll be happy with the Apple 3.5mm dongle. There’s also no need to overspend here, as even the cheapest units on the market are often powerful enough to drive higher-end options like the Sennheiser HD 800 S and even some planar magnetic headphones like the HiFiMan Sundara without any trouble. It’s one of those situations where the tech behind this sort of thing has gotten so good that it’s a non-issue at this point, and features are going to be what differentiates the models—not performance. Why would you get a portable music player instead of using your phone? Now that the headphone jack has disappeared from smartphones, there’s a small but vocal segment of music lovers that need a way to use their wired cans that isn’t tied to a computer. In fact, I’m one of these people. I often find myself traveling around with dubious access to the internet, and streaming access is poor at best. Ever drive across the great plains? Not so great cell reception there, is it? It's one of those things that you'll likely never need—until you do. While you could absolutely load up your phone with downloaded songs, you’re then fighting space issues if you don’t have a microSD card slot—something that is also going the way of the dinosaur. Even though this is mainly a problem for people who listen to higher bitrate files to the exclusion of all else, it’s still a concern for those who fill their phone’s storage with other things, like movies, photos, or apps. Having a portable audio player on hand will allow you to not only offload the responsibility for your music playback onto a device that isn’t hamstrung by your data connection (or storage) but there are a number of other capabilities you can unlock. For example, smartphones aren’t amazing with high-end headphones. Still, a portable audio player with a high-current output can handle just about any headphones you want in your hotel room, cabin, or other destination. What are some alternatives? Of course, our impulse to prioritize function and cost above all other concerns may not be what you’re looking for, or maybe you just want something that fits your niche a little better. That’s fine! Here are a few other models that you can check out: Shanling M0 Pro: This unit was well received upon its release last year but doesn’t do much to set itself apart from the Hidizs AP80 Pro. It’s still a decent unit, though. Astell & Kern KANN Alpha: a pricy unit, this product prioritizes raw output power. If you have headphones that just can’t get loud enough with other products, this is pretty much the portable that’s most likely to satisfy you. iBasso DX240: Think the DX170 but with a bigger battery and more storage capacity. Sony NW-A306-B: A straightforward music player that undercuts the high-end in price but falls short when it comes to power output. Sony NW-ZX507: Sony’s recent attempt to make a powerful portable. 100+mW output means overkill for most headphones at normal listening volumes. FiiO M11 Plus: This product is much like the M11S but with a bigger battery and higher output. This list is not exhaustive and will expand as we get to experiment with new products as they are released. However, this is a decent cross-section of what’s available and worth your money. The best portable music players: Frequently asked questions Are portable music players still a thing? Yes, portable music players are still available, catering to audiophiles and those who don’t want to rely solely on smartphones, especially since many have ditched the headphone jack. Is there a portable music player that is not a phone? Absolutely. Brands like Astell & Kern, FiiO, and Sony offer dedicated portable music players with various features to suit different needs and budgets What can you listen to music on besides your phone? Apart from your phone, you can listen to music on portable music players, laptops, tablets, and dedicated home audio systems. How can I listen to music without the internet or phone? A portable music player with storage options allows you to load your library and listen without needing an internet connection or phone. What replaced the iPod? Smartphones largely replaced iPods for most consumers, but portable music players have evolved to cater to audio enthusiasts who require higher-quality sound and features. Can you still buy an MP3 player? Yes, MP3 players are still available, but they often come with additional capabilities, such as high-resolution audio support and streaming options. What's the difference between an iPod and an MP3 player? An iPod is a specific brand of MP3 player made by Apple that often includes extra features like a touchscreen, apps, and ecosystem integration. MP3 players, generally speaking, can be from various manufacturers and may lack these additional features.","filter_flag":1}
