{"title":"Google Maps Platform: 3 new APIs to monitor environmental conditions - The Keyword | Google Product and Technology News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vYmxvZy5nb29nbGUvcHJvZHVjdHMvbWFwcy9nb29nbGUtbWFwcy1hcGlzLWVudmlyb25tZW50LXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vYmxvZy5nb29nbGUvcHJvZHVjdHMvbWFwcy9nb29nbGUtbWFwcy1hcGlzLWVudmlyb25tZW50LXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5","id":"CBMiTmh0dHBzOi8vYmxvZy5nb29nbGUvcHJvZHVjdHMvbWFwcy9nb29nbGUtbWFwcy1hcGlzLWVudmlyb25tZW50LXN1c3RhaW5hYmlsaXR5L9IBAA","guidislink":false,"published":"Mon, 28 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=240, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vYmxvZy5nb29nbGUvcHJvZHVjdHMvbWFwcy9nb29nbGUtbWFwcy1hcGlzLWVudmlyb25tZW50LXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5\" target=\"_blank\">Google Maps Platform: 3 new APIs to monitor environmental conditions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Keyword | Google Product and Technology News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Google Maps Platform: 3 new APIs to monitor environmental conditions - The Keyword | Google Product and Technology News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vYmxvZy5nb29nbGUvcHJvZHVjdHMvbWFwcy9nb29nbGUtbWFwcy1hcGlzLWVudmlyb25tZW50LXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5\" target=\"_blank\">Google Maps Platform: 3 new APIs to monitor environmental conditions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Keyword | Google Product and Technology News<\/font>","source.href":"https:\/\/blog.google","source.title":"The Keyword | Google Product and Technology News","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Climate change is a defining challenge of our generation, and addressing it requires collective effort. To help everyone take action, we’re working to share insights about the planet through tools and technologies — like Google Earth, Earth Engine and Environmental Insights Explorer — that combine a rich map of the world with advanced AI. With insights into how the planet is changing, we can build sustainability tools and support other organizations to do the same. And we can work toward our ambition to help individuals, cities, and partners collectively reduce 1 gigaton of their carbon equivalent emissions annually by 2030. Now we’re expanding our sustainability offerings with new products in Google Maps Platform. These products apply AI and machine learning, along with aerial imagery and environmental data, to provide up-to-date information about solar potential, air quality and pollen levels. With this technology, developers, businesses and organizations can build tools that map and mitigate environmental impact. Mapping the potential of solar energy To encourage the use of solar technology, we launched Project Sunroof in 2015 to help people explore the estimated solar potential and savings in their area. Companies soon became interested in accessing this information too, and now, we’re offering this information to businesses. Our new Solar API uses mapping and computing resources to make detailed rooftop solar potential data available for more than 320 million buildings across 40 countries, like the U.S., France and Japan. To get these insights, we trained an AI model to extract 3D information about the roof geometry directly from aerial imagery, along with details about trees and shade. Plus, the Solar API accounts for factors like historical weather patterns in the area, energy costs and more. This means that businesses like solar installers can see how much sunlight buildings receive and potential energy savings, before even visiting the area. In turn, this technology allows homeowners to more quickly and easily install solar panels and contribute sustainable energy to the grid.","filter_flag":1}
{"title":"Shanghai Electric Delivers the First Batch of VRFB Products to Europe - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvc2hhbmdoYWktZWxlY3RyaWMtZGVsaXZlcnMtdGhlLWZpcnN0LWJhdGNoLW9mLXZyZmItcHJvZHVjdHMtdG8tZXVyb3BlLTMwMTg5NjgzNi5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvc2hhbmdoYWktZWxlY3RyaWMtZGVsaXZlcnMtdGhlLWZpcnN0LWJhdGNoLW9mLXZyZmItcHJvZHVjdHMtdG8tZXVyb3BlLTMwMTg5NjgzNi5odG1s0gEA?oc=5","id":"CBMifWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvc2hhbmdoYWktZWxlY3RyaWMtZGVsaXZlcnMtdGhlLWZpcnN0LWJhdGNoLW9mLXZyZmItcHJvZHVjdHMtdG8tZXVyb3BlLTMwMTg5NjgzNi5odG1s0gEA","guidislink":false,"published":"Wed, 09 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=221, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvc2hhbmdoYWktZWxlY3RyaWMtZGVsaXZlcnMtdGhlLWZpcnN0LWJhdGNoLW9mLXZyZmItcHJvZHVjdHMtdG8tZXVyb3BlLTMwMTg5NjgzNi5odG1s0gEA?oc=5\" target=\"_blank\">Shanghai Electric Delivers the First Batch of VRFB Products to Europe<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Shanghai Electric Delivers the First Batch of VRFB Products to Europe - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvc2hhbmdoYWktZWxlY3RyaWMtZGVsaXZlcnMtdGhlLWZpcnN0LWJhdGNoLW9mLXZyZmItcHJvZHVjdHMtdG8tZXVyb3BlLTMwMTg5NjgzNi5odG1s0gEA?oc=5\" target=\"_blank\">Shanghai Electric Delivers the First Batch of VRFB Products to Europe<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"ZARAGOZA, Spain, Aug. 9, 2023 \/PRNewswire\/ -- Shanghai Electric Energy Storage Technology Co., Ltd. (\"Shanghai Electric Energy Storage\" or \"the Company\") announced the completion of the factory acceptance test for its vanadium redox flow battery (VRFB) equipment, which is now en route to Zaragoza, Spain, for a commercial energy storage project, marking the first time that Shanghai Electric delivers its flow battery products to a European partner in bulk. Shanghai Electric Delivers the First Batch of VRFB Products to Europe. Under the agreement with local partner in Spain, which is the sixth sub-contract that Shanghai Electric signed with the Spain-based energy storage solution provider, Shanghai Electric Energy Storage will supply bespoke VRFB products for the local renewable projects. The cooperation of the pair showcases the market adaptability of Shanghai Electric's flow battery solutions as well as its ability to deliver products tail-made to help European countries accelerate toward energy transition. Meanwhile, Shanghai Electric and local partners are also in discussion on the design of multiple system projects, which encompass the supply of standard containerized systems and products. The two companies are also planning to cooperate on the construction of MW-scale projects. Energy storage technology is one of the foundations for the renewable energy revolution, playing a key role in facilitating the world's achievement of low-carbon targets. Shanghai Electric, with its long-term track record in new energy technology development, is a pioneer that pushes the boundary of battery solutions, spearheading innovation for VRFB products to boost the reliability, sustainability, and affordability of renewable power sources. In 2023, Shanghai Electric made a significant breakthrough in the field of battery storage technology with the launch of the 500kW\/3000kWh energy storage system, a new solution that represents a major milestone in the development of vanadium redox flow battery (VRFB) technology. By upgrading the form factor, functionality, and performance of VRFBs, Shanghai Electric has opened up new possibilities for renewable energy storage, empowering China and beyond to reduce dependence on fossil fuels and contributing to a cleaner, more sustainable future. The system employs a 65 kW high-power, high-performance stack, which is the largest single stack developed by China's homegrown energy company. The 500 kW battery features 4s2p configurations, making it the largest single module among long-duration flow batteries in China. The system's DC-side efficiency exceeds 85%, with the overall energy efficiency reaching 90%, trimming the cost of electricity per kWh down to RMB 0.2 (USD 0.028). With its electrolyte consisting of water and inorganic salts, the system is capable of operating at normal temperature and pressure without the risk of flammable or explosive hazards, offering 20,000 charge and discharge cycles with no capacity attenuation in its lifespan. It is designed as a high-power, long-duration energy storage system for wind energy and solar PV projects, with its expandable structure helping save 50% of land usage. The module is easily transportable, quick to install and deploy, and suitable for locations with a temperature range of -30 to 60 degrees Celsius and harsh environmental conditions. Equipped with state-of-the-art battery management technology powered by digital twin visualization and operation technology, the system's operational status is accurately monitored and optimized by intelligent algorithms that maximize battery protection, achieving smart O&M and ensuring the long-term reliability of the product. Shanghai Electric's ground-breaking innovation in VRFB has allowed the group to clinch the China Energy Storage Industry Technology Innovation Brand Award and the China Energy Storage Battery Brand Award in 2023. The dual recognition highlights the group's technological leadership in energy storage and its ability to develop cutting-edge VRFB products that address the future needs of the new energy sector. 2023 has also seen Shanghai Electric and China Vanadium Energy Storage Technology jointly commence the construction of a 100 MW\/600 MWh VRFB energy storage station in Baicheng, Jilin Province. Shanghai Electric Energy Storage is set to provide green, economical, and efficient VRFB products and integrated solutions, helping to decarbonize the local economy while bolstering the development of Jinlin's new energy industry. As Shanghai Electric Energy Storage continues to innovate on battery technology and expand its global market presence, the Company remains focused on providing its customers with reliable and sustainable energy solutions. In line with this commitment, the Company will ramp up investment in R&D to further advance the development of energy storage technologies, improve the safety and environmental sustainability of its products and services, and seek innovation to empower the world to reduce its carbon footprint and promote a greener future for all. SOURCE Shanghai Electric","filter_flag":1}
{"title":"Hitachi Energy supports a green hydrogen economy to accelerate the energy transition - Hitachi Energy","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5oaXRhY2hpZW5lcmd5LmNvbS9uZXdzL2ZlYXR1cmVzLzIwMjMvMDgvaGl0YWNoaS1lbmVyZ3ktc3VwcG9ydHMtYS1ncmVlbi1oeWRyb2dlbi1lY29ub215LXRvLWFjY2VsZXJhdGUtdGhlLWVuZXJneS10cmFuc2l0aW9u0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5oaXRhY2hpZW5lcmd5LmNvbS9uZXdzL2ZlYXR1cmVzLzIwMjMvMDgvaGl0YWNoaS1lbmVyZ3ktc3VwcG9ydHMtYS1ncmVlbi1oeWRyb2dlbi1lY29ub215LXRvLWFjY2VsZXJhdGUtdGhlLWVuZXJneS10cmFuc2l0aW9u0gEA?oc=5","id":"CBMiiAFodHRwczovL3d3dy5oaXRhY2hpZW5lcmd5LmNvbS9uZXdzL2ZlYXR1cmVzLzIwMjMvMDgvaGl0YWNoaS1lbmVyZ3ktc3VwcG9ydHMtYS1ncmVlbi1oeWRyb2dlbi1lY29ub215LXRvLWFjY2VsZXJhdGUtdGhlLWVuZXJneS10cmFuc2l0aW9u0gEA","guidislink":false,"published":"Fri, 04 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=4, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=216, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5oaXRhY2hpZW5lcmd5LmNvbS9uZXdzL2ZlYXR1cmVzLzIwMjMvMDgvaGl0YWNoaS1lbmVyZ3ktc3VwcG9ydHMtYS1ncmVlbi1oeWRyb2dlbi1lY29ub215LXRvLWFjY2VsZXJhdGUtdGhlLWVuZXJneS10cmFuc2l0aW9u0gEA?oc=5\" target=\"_blank\">Hitachi Energy supports a green hydrogen economy to accelerate the energy transition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Hitachi Energy<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Hitachi Energy supports a green hydrogen economy to accelerate the energy transition - Hitachi Energy","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5oaXRhY2hpZW5lcmd5LmNvbS9uZXdzL2ZlYXR1cmVzLzIwMjMvMDgvaGl0YWNoaS1lbmVyZ3ktc3VwcG9ydHMtYS1ncmVlbi1oeWRyb2dlbi1lY29ub215LXRvLWFjY2VsZXJhdGUtdGhlLWVuZXJneS10cmFuc2l0aW9u0gEA?oc=5\" target=\"_blank\">Hitachi Energy supports a green hydrogen economy to accelerate the energy transition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Hitachi Energy<\/font>","source.href":"https:\/\/www.hitachienergy.com","source.title":"Hitachi Energy","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Hitachi Energy, a global technology leader that is advancing a sustainable energy future for all, is focused on developing innovative products, solutions, and services that support a clean energy transition for customers and partners, which includes ways of harnessing green hydrogen for a decarbonized future. Rapidly increasing global demand for hydrogen is also driving up demand for clean, green hydrogen production, which in turn requires vast amounts of green energy, electrolysers and peripheral electrical equipment. \"We are delighted to play a significant and enabling role in the growing hydrogen sector offering leading-edge advisory services and technologies to accelerate the energy transition,\" said Marco Berardi, Head of Grid & Power Quality Solutions and Service business at Hitachi Energy. \"Our solutions for the hydrogen sector support the generation of efficient and reliable clean energy. On the one hand, we offer world-class expertise in connecting electrolyser systems to the grid, and on the other, we are driving innovation in clean power generation leveraging hydrogen fuel cell technology.\" Power-to-Hydrogen There are several ways of producing hydrogen with varying carbon intensity. Water electrolysis uses an electrolyser and an electric current to split fresh water into its constituent elements, hydrogen and oxygen. If the electricity used in this process comes exclusively from renewable sources like wind or solar, the hydrogen produced is called green hydrogen. Most hydrogen today is produced by reforming fossil fuels like gas or coal. These processes emit large amounts of CO 2 , while water electrolysis utilizing renewable energy produces a nearly CO 2 -free form of hydrogen. Green hydrogen is a new and complementing component in the electrification space, where Hitachi Energy can add substantial value and innovation. With vast domain expertise in grid connection and power quality solutions, it develops groundbreaking technologies that enable renewables integration, high power quality and reliable and resilient power grids. \"We expand in new directions to support customers with crucial innovations to meet the needs of the evolving global clean energy transition and offer advanced and proven solutions to connect high-power (>20 MW) electrolysers to the high-voltage grid,\" said Berardi. “We focus on optimizing the complete power supply system, from early-stage techno-economic studies and advise to grid connection and Battery Energy Storage Systems (BESS) down to stack terminals and O&M software which increases your system performance.” Hydrogen and renewable electricity are vital in the energy transition. For instance, a green value chain can supply clean fuel for heavy transport and supports hard-to-abate industries, such as steel, fertilizers, chemicals and oil and gas to lower their carbon footprint. It can also electrify remote construction sites, and provide clean backup power where it is needed. At all project phases, Hitachi Energy optimizes the costs, footprint, and efficiency of green hydrogen projects and helps remove the risk of not being grid-code compliant. Hydrogen-to-Power The restrictions on the use of fossil fuels are forcing us to rethink the status quo. To address this need, new products under development include a hydrogen power generator, based on zero-emission fuel cell technology. In 2021, Hitachi Energy and PowerCell agreed to collaborate on fuel cell-based power solutions contributing to the green energy transition. Hydrogen power generators are a disruptive replacement technology for carbon-intensive fossil fuel-based generators such as diesel gensets. A key feature of hydrogen is its capacity to store energy over long periods and convert it back to power when needed. Built to decarbonize sectors and applications such as remote construction sites and provide clean backup power, Hitachi Energy's hydrogen power generator will be available as a medium-power movable product (400-600 kVA) and a high-power stationary product (1 MVA+). This integrated and configurable clean energy generator can scale up to meet our customers' specific power needs.","filter_flag":1}
{"title":"SDGs & me: Responsible consumption and production - European Commission","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vZWMuZXVyb3BhLmV1L2V1cm9zdGF0L3dlYi9wcm9kdWN0cy1ldXJvc3RhdC1uZXdzL3cvZGRuLTIwMjMwODMwLTHSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vZWMuZXVyb3BhLmV1L2V1cm9zdGF0L3dlYi9wcm9kdWN0cy1ldXJvc3RhdC1uZXdzL3cvZGRuLTIwMjMwODMwLTHSAQA?oc=5","id":"CBMiSWh0dHBzOi8vZWMuZXVyb3BhLmV1L2V1cm9zdGF0L3dlYi9wcm9kdWN0cy1ldXJvc3RhdC1uZXdzL3cvZGRuLTIwMjMwODMwLTHSAQA","guidislink":false,"published":"Wed, 30 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=30, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=242, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vZWMuZXVyb3BhLmV1L2V1cm9zdGF0L3dlYi9wcm9kdWN0cy1ldXJvc3RhdC1uZXdzL3cvZGRuLTIwMjMwODMwLTHSAQA?oc=5\" target=\"_blank\">SDGs & me: Responsible consumption and production<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">European Commission<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"SDGs & me: Responsible consumption and production - European Commission","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vZWMuZXVyb3BhLmV1L2V1cm9zdGF0L3dlYi9wcm9kdWN0cy1ldXJvc3RhdC1uZXdzL3cvZGRuLTIwMjMwODMwLTHSAQA?oc=5\" target=\"_blank\">SDGs & me: Responsible consumption and production<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">European Commission<\/font>","source.href":"https:\/\/ec.europa.eu","source.title":"European Commission","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Consumption and production patterns have wide environmental and social impacts. The Sustainable Development Goal 'Responsible consumption and production' (SDG 12) calls for action on many fronts. These include the adoption of sustainable practices by businesses, promotion of sustainable procurement practices by policymakers, environmentally aware lifestyles of consumers as well as the development of new technologies and production and consumption methods, by researchers, scientists and others. Monitoring SDG 12 in an EU context focuses on progress made in decoupling environmental impacts from economic growth, fostering the green economy, while tackling waste generation and management. Source dataset: SDG_12_21, SDG_12_41, SDG_12_51 In 2020, raw material consumption decreased by 3% (13.7 tonnes per capita) compared with 2016 (14.0 tonnes per capita). The share of secondary raw materials out of all input materials in the economy (‘circularity rate’) stood at 11.7% in 2021, an increase of 0.2 percentage points since 2017 (11.5%). In addition, in 2020, the generation of waste went down by 5% to 4.8 tonnes per capita in comparison with 2016 (5.1 tonnes per capita). How is your country doing? Do you know how much waste is generated in your country? What about the extent to which recycled materials are used to create new products? The visualisation tools in our data visualization ‘SDGs & me’ will help you to easily explore and evaluate the situation in your country as well as enable you to compare it to others. Select a country in the header below and choose between different SDG 12 indicators: The European Commission has recently adopted an important package of measures for the sustainable use of key natural resources. The aim is to strengthen the resilience of natural ecosystems across the EU, better help Europe to adapt to climate change, and ensure lasting food and material security. Resource on these measures can be accessed here: Would you like to learn more? You can find out more about the EU’s progress towards the SDGs with the following products:","filter_flag":1}
{"title":"Tanzania's Solar Journey Accelerates; d.light Secures $30 Million Investment - SolarQuarter","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzA4LzIyL3Rhbnphbmlhcy1zb2xhci1qb3VybmV5LWFjY2VsZXJhdGVzLWQtbGlnaHQtc2VjdXJlcy0zMC1taWxsaW9uLWludmVzdG1lbnQv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzA4LzIyL3Rhbnphbmlhcy1zb2xhci1qb3VybmV5LWFjY2VsZXJhdGVzLWQtbGlnaHQtc2VjdXJlcy0zMC1taWxsaW9uLWludmVzdG1lbnQv0gEA?oc=5","id":"CBMibmh0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzA4LzIyL3Rhbnphbmlhcy1zb2xhci1qb3VybmV5LWFjY2VsZXJhdGVzLWQtbGlnaHQtc2VjdXJlcy0zMC1taWxsaW9uLWludmVzdG1lbnQv0gEA","guidislink":false,"published":"Tue, 22 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=234, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzA4LzIyL3Rhbnphbmlhcy1zb2xhci1qb3VybmV5LWFjY2VsZXJhdGVzLWQtbGlnaHQtc2VjdXJlcy0zMC1taWxsaW9uLWludmVzdG1lbnQv0gEA?oc=5\" target=\"_blank\">Tanzania's Solar Journey Accelerates; d.light Secures $30 Million Investment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SolarQuarter<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Tanzania's Solar Journey Accelerates; d.light Secures $30 Million Investment - SolarQuarter","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzA4LzIyL3Rhbnphbmlhcy1zb2xhci1qb3VybmV5LWFjY2VsZXJhdGVzLWQtbGlnaHQtc2VjdXJlcy0zMC1taWxsaW9uLWludmVzdG1lbnQv0gEA?oc=5\" target=\"_blank\">Tanzania's Solar Journey Accelerates; d.light Secures $30 Million Investment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SolarQuarter<\/font>","source.href":"https:\/\/solarquarter.com","source.title":"SolarQuarter","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"d.light, a leading provider of affordable solar-powered household products, has successfully secured a $30 million securitization facility from the Eastern and Southern African Trade and Development Bank Group (TDB Group). This funding, which has the potential to support up to $125 million of receivable assets, will be instrumental in d.light’s efforts to expand solar access in Tanzania. The capital from this facility will be utilized to amplify d.light’s existing securitized financing facility in Tanzania. The company aims to scale up its Pay-Go personal finance service, enabling more low-income households to afford their solar-powered products and contribute to sustainable energy solutions. This achievement propels d.light’s total securitized financing to $490 million since 2020, with the Tanzanian facility being anchored by TDB. The company has long been a pioneer in developing securitized finance models to raise equity for off-grid solar projects. Tanzania’s Solar Revolution with d.light’s Pay-Go Model CEO of d.light, Nick Imudia, expressed how this funding would be pivotal in reaching more low-income families in Tanzania through their Pay-Go business model. By facilitating affordable access to solar energy, the initiative will significantly contribute to both customers’ well-being and the environment. Imudia emphasized the significance of green energy investments in building a sustainable future. He highlighted how the securitization model has successfully advanced their goals in Kenya and is now expanding to Tanzania, a country where only 40% of the population has electricity access. TDB CEO Michael Awori emphasized the critical role of energy access in sustainable development. He applauded d.light’s efforts to extend its reach and positive impact to off-grid communities through renewable energy solutions. Tanzania, with its vast geographic spread and limited grid connectivity, is a prime candidate for d.light’s solar-powered solutions. The company’s finance facility leverages customer payments to further its solar initiatives, allowing for growth and market expansion in the country. With this successful funding, d.light plans to create a new financing vehicle, Brighter Life Tanzania 1 Limited (BLT1), in collaboration with lending partner African Frontier Capital (AFC). This vehicle will contribute to the expansion of local currency receivables financing, empowering d.light’s commitment to financial inclusion and clean energy access. As d.light continues to empower underserved communities, its initiatives serve as a beacon of change, driving sustainable development and equitable energy transition in Tanzania and beyond. Like this: Like Loading...","filter_flag":1}
{"title":"Charting Economic Success: A Comparative Exploration of New Zealand and Puerto Rico - The Weekly Journal","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMisQFodHRwczovL3d3dy50aGV3ZWVrbHlqb3VybmFsLmNvbS90b3Atc3Rvcmllcy9jaGFydGluZy1lY29ub21pYy1zdWNjZXNzLWEtY29tcGFyYXRpdmUtZXhwbG9yYXRpb24tb2YtbmV3LXplYWxhbmQtYW5kLXB1ZXJ0by1yaWNvL2FydGljbGVfZjE2YmM5ZjAtM2FiMy0xMWVlLTk2MGYtOGYxMGI4ODUyNzU4Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMisQFodHRwczovL3d3dy50aGV3ZWVrbHlqb3VybmFsLmNvbS90b3Atc3Rvcmllcy9jaGFydGluZy1lY29ub21pYy1zdWNjZXNzLWEtY29tcGFyYXRpdmUtZXhwbG9yYXRpb24tb2YtbmV3LXplYWxhbmQtYW5kLXB1ZXJ0by1yaWNvL2FydGljbGVfZjE2YmM5ZjAtM2FiMy0xMWVlLTk2MGYtOGYxMGI4ODUyNzU4Lmh0bWzSAQA?oc=5","id":"CBMisQFodHRwczovL3d3dy50aGV3ZWVrbHlqb3VybmFsLmNvbS90b3Atc3Rvcmllcy9jaGFydGluZy1lY29ub21pYy1zdWNjZXNzLWEtY29tcGFyYXRpdmUtZXhwbG9yYXRpb24tb2YtbmV3LXplYWxhbmQtYW5kLXB1ZXJ0by1yaWNvL2FydGljbGVfZjE2YmM5ZjAtM2FiMy0xMWVlLTk2MGYtOGYxMGI4ODUyNzU4Lmh0bWzSAQA","guidislink":false,"published":"Wed, 16 Aug 2023 13:47:39 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=16, tm_hour=13, tm_min=47, tm_sec=39, tm_wday=2, tm_yday=228, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMisQFodHRwczovL3d3dy50aGV3ZWVrbHlqb3VybmFsLmNvbS90b3Atc3Rvcmllcy9jaGFydGluZy1lY29ub21pYy1zdWNjZXNzLWEtY29tcGFyYXRpdmUtZXhwbG9yYXRpb24tb2YtbmV3LXplYWxhbmQtYW5kLXB1ZXJ0by1yaWNvL2FydGljbGVfZjE2YmM5ZjAtM2FiMy0xMWVlLTk2MGYtOGYxMGI4ODUyNzU4Lmh0bWzSAQA?oc=5\" target=\"_blank\">Charting Economic Success: A Comparative Exploration of New Zealand and Puerto Rico<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Weekly Journal<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Charting Economic Success: A Comparative Exploration of New Zealand and Puerto Rico - The Weekly Journal","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMisQFodHRwczovL3d3dy50aGV3ZWVrbHlqb3VybmFsLmNvbS90b3Atc3Rvcmllcy9jaGFydGluZy1lY29ub21pYy1zdWNjZXNzLWEtY29tcGFyYXRpdmUtZXhwbG9yYXRpb24tb2YtbmV3LXplYWxhbmQtYW5kLXB1ZXJ0by1yaWNvL2FydGljbGVfZjE2YmM5ZjAtM2FiMy0xMWVlLTk2MGYtOGYxMGI4ODUyNzU4Lmh0bWzSAQA?oc=5\" target=\"_blank\">Charting Economic Success: A Comparative Exploration of New Zealand and Puerto Rico<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Weekly Journal<\/font>","source.href":"https:\/\/www.theweeklyjournal.com","source.title":"The Weekly Journal","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Overview of New Zealand Puerto Rico must aspire to become one of the most competitive territories in the world and to do so, we must compare ourselves with one of the most competitive nations in the world that, like us, had incredible challenges before embarking on a new path to greatness. The trajectories of New Zealand and Puerto Rico toward becoming competitive nations may be quite similar; we shall highlight the strategies that propelled New Zealand's economic growth and draw comparisons to Puerto Rico's challenges. By examining New Zealand's success and identifying relevant lessons, we plan to present a comprehensive action plan for Puerto Rico to enhance its economic growth and competitiveness. New Zealand's has a GDP of $250 billion with a Per Capita income of $46,420, a total population of 5,122,600 million and a total area of 103,798.93 Square miles or 31 times larger than Puerto Rico. New Zealand's journey to becoming one of the world's most competitive nations was characterized by a combination of strategic policies, progressive reforms and a commitment to innovation. The following sections detail the key aspects that contributed to New Zealand's high rankings in competitiveness and provide a deeper understanding of how these strategies were implemented: 1. Diversification of the Economy: New Zealand recognized the limitations of relying solely on its traditional agricultural exports. To achieve economic diversification, they implemented: • Investment in Research and Development (R&D): The government-funded R&D initiatives across various sectors, including technology, healthcare, and agriculture. This initiative leads to the development of new products and services with global market potential. • Innovation Hubs: The creation of innovation hubs and research centers encouraged collaboration between academia, industry, and startups, fostering a culture of innovation. 12 Lessons Puerto Rico Must Learn Before it Emerges from Bankruptcy The secret to embracing change is to focus on building a new future. 2. Trade Liberalization: Engaging in global trade agreements and reducing trade barriers opened up new avenues for economic growth: • Closer Economic Relations (CER) Agreement: The CER agreement with Australia established a free trade area, facilitating the movement of goods, services and people between the two countries. • Diverse Trade Partnerships: New Zealand actively pursued trade agreements with various regions, including Asia-Pacific and Europe, expanding its export markets. 3. Skilled Workforce: Investments in education and training played a crucial role in nurturing a skilled workforce: • Education Reforms: Continuous improvements in the education system aligned curriculum with industry needs, emphasizing STEM subjects, technical education and vocational training. • International Education: Attracting international students enhanced cultural exchange and contributed to the Economy by generating revenue from tuition fees. 4. Regulatory Reforms: New Zealand's efforts to create a favorable business environment were instrumental in attracting investments: • Ease of Doing Business: Streamlined regulatory processes, reduced bureaucratic hurdles, and simplified procedures for starting and operating businesses. • Investment Incentives: The government offered incentives to attract foreign direct investment, such as tax breaks, grants, and support for establishing new ventures. 5. Sustainable Practices: Embracing sustainability and environmental practices contributed to New Zealand's competitiveness: • Clean Energy Transition: Investments in renewable energy sources like hydroelectric, wind, and geothermal power ensured a reliable and sustainable energy supply. • Agricultural Innovation: The agriculture sector adopted sustainable farming practices, organic farming, and value-added products, catering to global demand for ethically produced goods. 6. Quality of Life and Work-Life Balance: New Zealand's emphasis on quality of life and work-life balance was an attractive feature for both skilled professionals and investors: • Natural Beauty and Lifestyle: The country's stunning landscapes, outdoor recreational opportunities, and safe environment contributed to a high quality of life. • Flexible Work Policies: Promoting flexible work arrangements and remote work options further enhanced the appeal for locals and expatriates. 7. Strong Governance and Political Stability: Effective governance and political stability fostered an environment conducive to economic growth: • Transparency and Accountability: Clear regulatory frameworks, corruption-free governance, and efficient public administration contributed to a stable business environment. • Socio-Political Stability: Political consensus, social cohesion, and a strong rule of law provided a foundation for long-term planning and development. In summary, New Zealand's journey to becoming one of the world's most competitive nations was guided by a comprehensive approach that combined economic diversification, innovation, education, favorable regulations, sustainability, and quality of life considerations. These strategies, backed by effective governance and political stability, created an environment where businesses could thrive, investments could flow, and human capital could be developed to its full potential. It is this holistic approach that Puerto Rico could learn from and adapt to its unique context to enhance its economic growth and global competitiveness. Overview of Puerto Rico and Action Plan Puerto Rico, has a GDP of $106.5 billion 42.6% less than New Zealand with a Per Capita income of $22,419 a 48.29% less, a total population of 3,111,874 million a 60.7% less, and a total area of 3,360.5 Square miles or 31 smaller than Puerto Rico. Below we outlined in the plan of action for Puerto Rico, building upon the lessons from New Zealand's success: 1. Economic Diversification: Encouraging economic diversification involves moving away from over-reliance on a limited number of industries such as manufacturing and promoting the growth of new sectors. Puerto Rico can achieve this by: Commercial real estate with a global outlook In order to learn about the needs of commercial real estate investors and the opportunities … • Identifying Emerging Industries: Conduct thorough market research to identify industries with growth potential, such as renewable energy, technology startups, biotechnology, and sustainable agriculture. • Incentivizing Investment: Offer tax incentives, grants, and subsidies to attract local and foreign investors to these emerging sectors, fostering innovation and job creation. • Supporting Startups: Establish incubators and accelerators that provide resources, mentorship, and funding for startups in emerging industries. • Creating areas in all 78 cities with automatic permits for a wide range of businesses will convert Puerto Rico into an island with ease of doing business and will triplicate the number of new enterprises island wide. 2. Education and Workforce Development: Developing a skilled and competitive workforce is crucial for sustainable economic growth. To address the brain drain issue and retain local talent: • Revamping Education: Invest in modernizing and enhancing the education system to align with the needs of emerging industries. STEM Education must become our mantra, promoting science, technology, engineering and mathematics. • Vocational Training: Enhance and Create vocational training programs that equip individuals with practical skills in demand by industries such as manufacturing, technology and renewable energy. • Higher Education Collaboration: Forge partnerships between local universities and industries to ensure that education is aligned with current and future workforce requirements. 3. Trade Agreements: Active engagement in trade agreements can expand Puerto Rico's market access and enhance economic growth: • Regional Partnerships: Seek participation in regional trade agreements, such as the Caribbean Community (CARICOM), Central American Integration System (SICA) Dominican Republic-Central America FTA (CAFTA-DR) and Mercosur among others to access larger markets for goods and services. • Global Trade Agreements: Explore opportunities to join global trade agreements, such as the United States-Mexico-Canada Agreement (USMCA), the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP) or bilateral trade agreements with key trading partners. • Export Promotion: Empower the trade promotion agencies with incentives, grants, automatic designation to assist local businesses in entering international markets and navigating trade regulations. 4. Fiscal Management and Governance: While the Financial Oversight and Management Board reviews all financial decisions, we must create rigorous financial implementation once Puerto Rico emerges from Bankruptcy. Addressing fiscal challenges and improving governance are essential for creating a conducive environment for economic growth: • Debt Limitation Legislation: Enact legislation that sets clear limits on the amount of debt the Government can incur, both in absolute terms and as a percentage of the GDP. These limits can be based on Puerto Rico's ability to service the debt without compromising essential services. • Transparency and Accountability: Enhance transparency in government operations, budget allocation, and public procurement to build trust and attract investments. • Multiyear budgeting with Long Term Planning: Develop comprehensive multiyear budgeting that includes long-term projections of revenues and expenses. This approach promotes better planning, reduces short-term decision-making, and aids in identifying potential budget gaps. • Structural Reforms: We must transform the Government by doing away with unneeded agencies, services, and bureaucracy, creating a more spartan nimbler government. It will also significantly reduce the revenue-to-expense ratio. • Efficiency Measures: Implement cost-saving measures across government agencies to allocate resources effectively and direct funds toward strategic initiatives. 5. Infrastructure Investment: Improving infrastructure is a critical enabler of economic competitiveness: • Transportation Modernization: Upgrade transportation networks, including roads, ports, and airports and convert the “Tren Urbano” into a real solution for mass transit to enhance connectivity and facilitate the movement of goods and people. • Renewable Energy Development: Invest in renewable energy infrastructure to reduce energy costs, enhance sustainability, and attract energy-intensive industries. • Digital Connectivity: Expand access to high-speed internet across the island to support digital industries and remote work opportunities. In summary, Puerto Rico has the potential to enhance its economic growth and competitiveness by drawing lessons from New Zealand's success and implementing a comprehensive plan of action. By diversifying the economy, investing in education and workforce development, engaging in trade agreements, addressing fiscal challenges, and improving infrastructure, Puerto Rico can transform its economic landscape and create a more resilient and prosperous future for its citizens. Maurice Mctigue and The New Zealand Miracle Maurice McTigue played a pivotal role in the economic reforms that contributed to what is often referred to as the \"New Zealand Miracle\". He was vital in implementing policies transforming New Zealand's economy and government operations during the 1980s and 1990s. Some of his notable contributions include economic deregulation, state-owned enterprise reforms and privatization, fiscal responsibility, public sector reforms, local government empowerment, government streamlining and export-oriented growth. Maurice McTigue's contributions were rooted in the belief that empowering individuals, businesses, and local communities while minimizing government intervention could lead to sustainable economic growth. The lessons from McTigue's work highlight the potential for other economies, including Puerto Rico, to achieve similar transformations by adopting policies encouraging market-driven growth, fiscal responsibility, efficient governance and an open business environment. Are our political leaders ready to accomplish such a transformation? The importance in policy development is knowing first if the current policies work or whether different activities would produce better results. The critical requirement is identifying the public benefit sought and then seeking proof that the recent actions beneficially impact that outcome. Absent this proof, every decision taken may be described as \"Anchored in philosophical beliefs.\" \"The canvas of Puerto Rico's future is painted stroke by stroke with the brush of today's pivotal choices; each decision serves as a color that could define whether our work is a masterpiece or a failure; the future is in our hands.\"","filter_flag":1}
{"title":"Morrow Batteries aim to realise the first prismatic LNMO battery cell in the world early 2024 | Morrow Batteries - Mynewsdesk","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMinwFodHRwczovL3d3dy5teW5ld3NkZXNrLmNvbS9tb3Jyb3ctYmF0dGVyaWVzL3ByZXNzcmVsZWFzZXMvbW9ycm93LWJhdHRlcmllcy1haW0tdG8tcmVhbGlzZS10aGUtZmlyc3QtcHJpc21hdGljLWxubW8tYmF0dGVyeS1jZWxsLWluLXRoZS13b3JsZC1lYXJseS0yMDI0LTMyNjc0OTPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMinwFodHRwczovL3d3dy5teW5ld3NkZXNrLmNvbS9tb3Jyb3ctYmF0dGVyaWVzL3ByZXNzcmVsZWFzZXMvbW9ycm93LWJhdHRlcmllcy1haW0tdG8tcmVhbGlzZS10aGUtZmlyc3QtcHJpc21hdGljLWxubW8tYmF0dGVyeS1jZWxsLWluLXRoZS13b3JsZC1lYXJseS0yMDI0LTMyNjc0OTPSAQA?oc=5","id":"CBMinwFodHRwczovL3d3dy5teW5ld3NkZXNrLmNvbS9tb3Jyb3ctYmF0dGVyaWVzL3ByZXNzcmVsZWFzZXMvbW9ycm93LWJhdHRlcmllcy1haW0tdG8tcmVhbGlzZS10aGUtZmlyc3QtcHJpc21hdGljLWxubW8tYmF0dGVyeS1jZWxsLWluLXRoZS13b3JsZC1lYXJseS0yMDI0LTMyNjc0OTPSAQA","guidislink":false,"published":"Wed, 16 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=228, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinwFodHRwczovL3d3dy5teW5ld3NkZXNrLmNvbS9tb3Jyb3ctYmF0dGVyaWVzL3ByZXNzcmVsZWFzZXMvbW9ycm93LWJhdHRlcmllcy1haW0tdG8tcmVhbGlzZS10aGUtZmlyc3QtcHJpc21hdGljLWxubW8tYmF0dGVyeS1jZWxsLWluLXRoZS13b3JsZC1lYXJseS0yMDI0LTMyNjc0OTPSAQA?oc=5\" target=\"_blank\">Morrow Batteries aim to realise the first prismatic LNMO battery cell in the world early 2024 | Morrow Batteries<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mynewsdesk<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Morrow Batteries aim to realise the first prismatic LNMO battery cell in the world early 2024 | Morrow Batteries - Mynewsdesk","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinwFodHRwczovL3d3dy5teW5ld3NkZXNrLmNvbS9tb3Jyb3ctYmF0dGVyaWVzL3ByZXNzcmVsZWFzZXMvbW9ycm93LWJhdHRlcmllcy1haW0tdG8tcmVhbGlzZS10aGUtZmlyc3QtcHJpc21hdGljLWxubW8tYmF0dGVyeS1jZWxsLWluLXRoZS13b3JsZC1lYXJseS0yMDI0LTMyNjc0OTPSAQA?oc=5\" target=\"_blank\">Morrow Batteries aim to realise the first prismatic LNMO battery cell in the world early 2024 | Morrow Batteries<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mynewsdesk<\/font>","source.href":"https:\/\/www.mynewsdesk.com","source.title":"Mynewsdesk","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Morrow Batteries (“Morrow”) is proud to announce that it expects to produce the first next-generation LNMO-X batteries at its Customer Qualification Line during Q1 2024. The cell is a world-first with the configuration of this material. Lithium Nickel Manganese Oxide (LNMO) technology replaces cobalt with cheap and abundant manganese as a scaffold to better use the lithium and nickel inside the battery cell. This means that the batteries are significantly more sustainable than existing technology, and the company can now create batteries that are not only more environmentally friendly but also more cost-effective. “To succeed in the energy transition and build a sustainable energy system, we must develop better cell technology and chemistry. This is the most significant step towards realising that ambition yet. I am proud of this tremendous achievement for our research team and all of Morrow. This truly carries our “DNA”,” says CEO Lars Christian Bacher of Morrow. Morrow’s work on LNMO battery cell technology started two years ago, with the team having made significant progress the last year. The company can now not only produce LNMO electrodes in lab-scale, but in kilometres under industrial conditions. The prototype cells have also passed all safety tests. LNMO cells made by Morrow will be branched into two product offerings. The first cells, LNMO-X, can supercharge heavy mobility (trains, trucks, and ferries) and the long-life Battery Energy Storage Systems (BESS) markets. “We are continuously improving this technology and have achieved faster and safer supercharging than we thought possible, which greatly improves performance under more challenging conditions such as cold weather. Partners and customers are very excited and have shown great interest in learning more about this R&D milestone,” says Co-Founder and CTO Rahul Fotedar of Morrow. Morrow Batteries is planning the pilot production of prismatic cells with this technology at the Customer Qualification Line currently located in Korea, adjusting the last design details and getting ready for production.","filter_flag":1}
{"title":"LOHUM and Vecmocon partner to accelerate EV battery adoption and enable easy financing - Autocar Professional","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9sb2h1bS1hbmQtdmVjbW9jb24tcGFydG5lci10by1hY2NlbGVyYXRlLWV2LWJhdHRlcnktYWRvcHRpb24tYW5kLWVuYWJsZS1lYXN5LWZpbmFuY2luZy0xMTYzMDDSAYIBaHR0cHM6Ly93d3cuYXV0b2NhcnByby5pbi9uZXdzL2xvaHVtLWFuZC12ZWNtb2Nvbi1wYXJ0bmVyLXRvLWFjY2VsZXJhdGUtZXYtYmF0dGVyeS1hZG9wdGlvbi1hbmQtZW5hYmxlLWVhc3ktZmluYW5jaW5nLTExNjMwMD9hbXA9MQ?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9sb2h1bS1hbmQtdmVjbW9jb24tcGFydG5lci10by1hY2NlbGVyYXRlLWV2LWJhdHRlcnktYWRvcHRpb24tYW5kLWVuYWJsZS1lYXN5LWZpbmFuY2luZy0xMTYzMDDSAYIBaHR0cHM6Ly93d3cuYXV0b2NhcnByby5pbi9uZXdzL2xvaHVtLWFuZC12ZWNtb2Nvbi1wYXJ0bmVyLXRvLWFjY2VsZXJhdGUtZXYtYmF0dGVyeS1hZG9wdGlvbi1hbmQtZW5hYmxlLWVhc3ktZmluYW5jaW5nLTExNjMwMD9hbXA9MQ?oc=5","id":"CBMifGh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9sb2h1bS1hbmQtdmVjbW9jb24tcGFydG5lci10by1hY2NlbGVyYXRlLWV2LWJhdHRlcnktYWRvcHRpb24tYW5kLWVuYWJsZS1lYXN5LWZpbmFuY2luZy0xMTYzMDDSAYIBaHR0cHM6Ly93d3cuYXV0b2NhcnByby5pbi9uZXdzL2xvaHVtLWFuZC12ZWNtb2Nvbi1wYXJ0bmVyLXRvLWFjY2VsZXJhdGUtZXYtYmF0dGVyeS1hZG9wdGlvbi1hbmQtZW5hYmxlLWVhc3ktZmluYW5jaW5nLTExNjMwMD9hbXA9MQ","guidislink":false,"published":"Wed, 09 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=221, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9sb2h1bS1hbmQtdmVjbW9jb24tcGFydG5lci10by1hY2NlbGVyYXRlLWV2LWJhdHRlcnktYWRvcHRpb24tYW5kLWVuYWJsZS1lYXN5LWZpbmFuY2luZy0xMTYzMDDSAYIBaHR0cHM6Ly93d3cuYXV0b2NhcnByby5pbi9uZXdzL2xvaHVtLWFuZC12ZWNtb2Nvbi1wYXJ0bmVyLXRvLWFjY2VsZXJhdGUtZXYtYmF0dGVyeS1hZG9wdGlvbi1hbmQtZW5hYmxlLWVhc3ktZmluYW5jaW5nLTExNjMwMD9hbXA9MQ?oc=5\" target=\"_blank\">LOHUM and Vecmocon partner to accelerate EV battery adoption and enable easy financing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Autocar Professional<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"LOHUM and Vecmocon partner to accelerate EV battery adoption and enable easy financing - Autocar Professional","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9sb2h1bS1hbmQtdmVjbW9jb24tcGFydG5lci10by1hY2NlbGVyYXRlLWV2LWJhdHRlcnktYWRvcHRpb24tYW5kLWVuYWJsZS1lYXN5LWZpbmFuY2luZy0xMTYzMDDSAYIBaHR0cHM6Ly93d3cuYXV0b2NhcnByby5pbi9uZXdzL2xvaHVtLWFuZC12ZWNtb2Nvbi1wYXJ0bmVyLXRvLWFjY2VsZXJhdGUtZXYtYmF0dGVyeS1hZG9wdGlvbi1hbmQtZW5hYmxlLWVhc3ktZmluYW5jaW5nLTExNjMwMD9hbXA9MQ?oc=5\" target=\"_blank\">LOHUM and Vecmocon partner to accelerate EV battery adoption and enable easy financing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Autocar Professional<\/font>","source.href":"https:\/\/www.autocarpro.in","source.title":"Autocar Professional","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Through a combined offering of an AI-powered battery management system (BMS), and vehicle intelligence module, Vecmocon and LOHUM plan to power over 100,000 batteries in the next two years. LOHUM, a producer of sustainable energy transition materials and Vecmocon, an Indian EV intelligence company backed by Tiger Global & Blume Ventures, have joined forces to revolutionise the lifecycle management of electric vehicle batteries. This strategic partnership aims to accelerate the widespread adoption of EVs by combining the pioneering battery testing technology of LOHUM and battery intelligence and real-time data monitoring capabilities of Vecmocon. The partnership's technological collaboration will make batteries safer, more reliable, and long-lasting, powered by cutting-edge battery analytics, as per a company press release. Vecmocon will integrate its crucial data attributes collected in real-time, powered by Machine Learning algorithms, with LOHUM’s data systems, sharing important battery parameters collected through Vecmocon's i-VEC drive offering. LOHUM's pioneering expertise in battery secod life is powered by advanced algorithms and testing technologies that estimate the remaining useful life (RUL) of batteries. Through a combined offering of an AI-powered battery management system (BMS), and vehicle intelligence module, Vecmocon and LOHUM plan to power over 100,000 batteries in the next two years, said Peeyush Asati, Founder and CEO, Vecmocon. \"Vecmocon’s mission of making EVs intelligent & safe via its cutting-edge technology by harnessing the power of advanced battery analytics significantly aligns with our core capabilities of enabling 2nd life use of batteries. Together, we will contribute to a closed loop circular economy and create a more sustainable ecosystem for electric vehicles in India,\" said Rajat Verma, Founder and CEO, LOHUM. ","filter_flag":1}
{"title":"Varinder Bhatia, Joint Vice President- Sales (Solar) at Havells India Ltd. - Energetica India","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmVuZXJnZXRpY2EtaW5kaWEubmV0L3Bvd2VyZnVsLXRob3VnaHRzL29ubGluZS92YXJpbmRlci1iaGF0aWHSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmVuZXJnZXRpY2EtaW5kaWEubmV0L3Bvd2VyZnVsLXRob3VnaHRzL29ubGluZS92YXJpbmRlci1iaGF0aWHSAQA?oc=5","id":"CBMiSWh0dHBzOi8vd3d3LmVuZXJnZXRpY2EtaW5kaWEubmV0L3Bvd2VyZnVsLXRob3VnaHRzL29ubGluZS92YXJpbmRlci1iaGF0aWHSAQA","guidislink":false,"published":"Thu, 03 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=215, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmVuZXJnZXRpY2EtaW5kaWEubmV0L3Bvd2VyZnVsLXRob3VnaHRzL29ubGluZS92YXJpbmRlci1iaGF0aWHSAQA?oc=5\" target=\"_blank\">Varinder Bhatia, Joint Vice President- Sales (Solar) at Havells India Ltd.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Energetica India <\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Varinder Bhatia, Joint Vice President- Sales (Solar) at Havells India Ltd. - Energetica India","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmVuZXJnZXRpY2EtaW5kaWEubmV0L3Bvd2VyZnVsLXRob3VnaHRzL29ubGluZS92YXJpbmRlci1iaGF0aWHSAQA?oc=5\" target=\"_blank\">Varinder Bhatia, Joint Vice President- Sales (Solar) at Havells India Ltd.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Energetica India <\/font>","source.href":"https:\/\/www.energetica-india.net","source.title":"Energetica India","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"August 03, 2023. By News Bureau Solar energy is the future. With the government's push towards renewable energy and the increasing awareness among consumers, the demand for solar products will continue to grow. Havells is closely working with the stakeholders and has started investing aggressively to offer the right solar solution to its customers. The company’s flagship solar grid tie inverter can be seen in more than 30000 homes and industries, shared Varinder Bhatia, Joint Vice President- Sales (Solar), Havells India Ltd. in an interview with Anurima Mondal, Associate Editor, Energetica India. Que: Please give us an overview of the Indian solar industry. Ans: India's solar industry has flourished over the years, thanks to the government's unwavering commitment to sustainable energy. The initiative to boost domestic production of solar equipment is a move to reduce dependence on imports and spur the adoption of solar technology. The Jawaharlal Nehru National Solar Mission (JNNSM) has played a crucial role in attracting foreign investment and facilitating the development of large-scale solar projects across the country. Renewable energy adoption boosted the economy and also created job opportunities. The 'Make in India' campaign has attracted additional investment and enhanced India's image as a global player in renewable energy. It's reassuring to see the positive impact of these efforts, as more and more companies are setting up production units, creating jobs and contributing to the country's growth story. The solar industry's progress is a testament to the power of innovation and collaboration, and we are excited to see what the future holds as we continue to push toward a greener, cleaner future. Que: Could you shed some light on Havells and its product range in the solar segment? Ans: At Havells, we keep striving to contribute to the growth of the Indian solar sector. We have been closely working with the stakeholders and have started investing aggressively to offer the right solar solution to our customers. Our flagship solar grid tie inverter can be seen in more than 30000 homes and industries. We offer both off-grid and on-grid solutions to our consumers. We have also partnered with SBI as funding support for our MSME customers to adopt solar. Our research & innovation team is committed to designing and offering world-class solar solutions. Soon, we are planning to launch an inverter that will be an edge in terms of technology. Que: What steps do you take to ensure quality products for the domestic and international markets? Ans: We have established state-of-the-art manufacturing facilities that are equipped with the latest technologies and equipment. Our manufacturing processes are strictly monitored to ensure that our products are of the highest quality and meet all relevant safety standards. We are seventh in Dow Jones Sustainability Index and have been rated as ‘Strong’ by Crisil. We also invest heavily in research and development to stay ahead of the curve and incorporate the latest technologies into our products. Our R&D teams work tirelessly to develop new products that are energy-efficient, eco-friendly, and meet the evolving needs of our customers. We offer some of the highly engineered off-grid solutions addressing customers’ pain points. Our state-of-the-art grid-tie inverters have the highest warranty in the industry, which is a testament to the robust product we offer to our customers. In addition, we have implemented rigorous quality control measures at every stage of the manufacturing process. Our products undergo multiple tests and inspections to ensure that they meet the highest standards of quality and safety. Que: What is your future roadmap? Ans: We believe that solar energy is the future, and we are committed to playing an active role in promoting its adoption. With the Government of India's push towards renewable energy and the increasing awareness among consumers, we are confident that the demand for solar products will continue to grow. In the near future, we plan to expand our solar product portfolio and offer innovative solutions that are both reliable and cost-effective. We are committed to offering the best services in the industry. With our strong channel network, we want to reach every category of customers across the country. Our aim is to provide value-based offerings solving customer needs. Que: How do you think have the government initiatives helped the Indian solar sector? Ans: The Indian government implemented several initiatives to promote the use of solar energy, including the 'Make in India' campaign, the National Solar Mission, and other policies. These efforts have attracted strong investment from large Indian houses & FDI. This has led to an increase in domestic solar panel production. India aims to achieve 110 GW in module manufacturing capacity by 2026 which is currently at 18 GW. India has already achieved 175 GW of renewable energy and it aims to achieve 450 GW by 2030. The govt. has taken a big initiative by introducing the PLI scheme to promote domestic manufacturing of solar components. Over INR 45000 crore has been allocated for solar PV manufacturing under the PLI scheme. Apart from this, solar direct subsidy transfer has been initiated by the government through the launch of the solar rooftop national portal. For residential consumers, the government is providing a 40 percent subsidy on less than 3 KW system and a 20 percent subsidy on more than 3 KW to 10 KW system. Today, India is one of the top five countries globally in terms of installed solar capacity. The steep climb in the installed solar capacity is a testament to the success of the government's efforts. Que: How can the PLI scheme establish Indian solar manufacturing companies to meet the global solar demand? Ans: The Production Linked Incentive (PLI) scheme is a game-changing initiative by the Indian government to boost the manufacturing industry and establish India as a major player in the global solar market. The scheme's primary aim is to promote domestic production by offering financial incentives to Indian enterprises that manufacture solar equipment. This would not only assist in minimizing import dependence but will also create job possibilities and national manufacturing champions. As a result, Indian companies will be better equipped to vie with their foreign counterparts in areas such as pricing and product excellence, all the while satisfying the rapidly escalating global requirement for solar energy. Additionally, the program will foster a robust ecosystem for procuring vital materials needed in the solar industry, ones that are of Indian origin. Que: As a joint report from the Institute for Energy Economics and Financial Analysis (IEEFA) and JMK Research and Analytics, India has the potential to become the world’s second-largest solar manufacturer by 2026. What are your views on it? Ans: We are proud to be a part of India's solar industry and are optimistic about its growth potential. It’s exhilarating to witness the potential for India to become the world's second-largest solar manufacturer by 2026, as outlined in the joint report from the Institute for Energy Economics and Financial Analysis and JMK Research and Analytics. This is a testimony to the tremendous growth potential of the Indian solar industry and the immense talent and potential of our workforce. We are dedicated to actively aiding this expansion and making significant contributions to India's path towards a more sustainable and eco-friendly future. Our engineers are relentlessly working on designs to offer the next generation off-grid & on-grid solar products. We aim to be the topmost solar company in the industry delivering some of the world-class solution to both contractors & end users in the days to come. Que: How do you see the Indian solar market expanding in the future? Ans: India has been taking big strides towards achieving a sustainable future with renewable energy. Our nation has made significant progress in the global RE scenario, but we believe that there is still more work to be done. What gives us an edge is our commitment to innovation and technology which has allowed us to harness the power of the sun and wind. However, we need to continue investing in R&D and infrastructure to keep up with the growing demand for clean energy. As a leading player in the Indian solar industry, we are proud to be contributing to this transition towards a greener future. Que: How do you see the Indian solar market expanding in the future? Ans: India has been taking big strides towards achieving a sustainable future with renewable energy. Our nation has made significant progress in the global RE scenario, but we believe that there is still more work to be done. What gives us an edge is our commitment to innovation and technology which has allowed us to harness the power of the sun and wind. However, we need to continue investing in R&D and infrastructure to keep up with the growing demand for clean energy. As a leading player in the Indian solar industry, we are proud to be contributing to this transition towards a greener future.","filter_flag":1}
