{"title":"Q&A: Getting to Carbon Neutral With Koozie Group - Advertising Specialty Institute","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vbWVtYmVycy5hc2ljZW50cmFsLmNvbS9uZXdzL3dlYi1leGNsdXNpdmUvb2N0b2Jlci0yMDIzL3FhLWdldHRpbmctdG8tY2FyYm9uLW5ldXRyYWwv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vbWVtYmVycy5hc2ljZW50cmFsLmNvbS9uZXdzL3dlYi1leGNsdXNpdmUvb2N0b2Jlci0yMDIzL3FhLWdldHRpbmctdG8tY2FyYm9uLW5ldXRyYWwv0gEA?oc=5","id":"CBMiXGh0dHBzOi8vbWVtYmVycy5hc2ljZW50cmFsLmNvbS9uZXdzL3dlYi1leGNsdXNpdmUvb2N0b2Jlci0yMDIzL3FhLWdldHRpbmctdG8tY2FyYm9uLW5ldXRyYWwv0gEA","guidislink":false,"published":"Thu, 05 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=278, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vbWVtYmVycy5hc2ljZW50cmFsLmNvbS9uZXdzL3dlYi1leGNsdXNpdmUvb2N0b2Jlci0yMDIzL3FhLWdldHRpbmctdG8tY2FyYm9uLW5ldXRyYWwv0gEA?oc=5\" target=\"_blank\">Q&amp;A: Getting to Carbon Neutral With Koozie Group<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Advertising Specialty Institute<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Q&A: Getting to Carbon Neutral With Koozie Group - Advertising Specialty Institute","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vbWVtYmVycy5hc2ljZW50cmFsLmNvbS9uZXdzL3dlYi1leGNsdXNpdmUvb2N0b2Jlci0yMDIzL3FhLWdldHRpbmctdG8tY2FyYm9uLW5ldXRyYWwv0gEA?oc=5\" target=\"_blank\">Q&amp;A: Getting to Carbon Neutral With Koozie Group<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Advertising Specialty Institute<\/font>","source.href":"https:\/\/members.asicentral.com","source.title":"Advertising Specialty Institute","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Victoria Sierra of Koozie Group explains some of the steps the Top 40 supplier took to get carbon neutrality certification and shares insights to help other industry companies on the same journey. Last month, Top 40 supplier Koozie Group (asi\/40480) and its sister company IMAGEN Brands (asi\/93990) announced that it had received CarbonNeutral certification. In this Q&A, Victoria Sierra, compliance manager for Koozie Group, explains why this milestone is so important, how the supplier is reducing emissions and what other promo companies can do to follow in their (shrinking) carbon footprint. Victoria Sierra, compliance manager at Koozie Group Q: Why was pursuing carbon neutrality an important part of Koozie Group’s strategy? A: This is a critical time in the promotional products industry as we address the issues facing our planet. Sustainability is important not only to our distributors and their end-users, but also to our employees and their families. We want to lead the promotional products industry in these efforts by going beyond just selling sustainable products to taking this next step in our corporate responsibility journey. One of our core values – we call them People Powers – is “One Team,” because each member of the company contributes to our overall success. We think the same can be said about the planet: We’re all on the same team inhabiting Earth, and we want to contribute to this team’s success. Simply put, we think the best way for us to keep the good going is to do good. Q: Can you share some details about steps you’ve taken to reduce carbon emissions in daily operations? A: We’ve tried to reduce our carbon footprint as a whole in a few different ways. Here are a few examples: • To reduce single-use plastics within our facilities, we eliminated Styrofoam cups and plastic stir sticks, and we provide new employees with reusable drinkware during onboarding. • We also reuse broken or scrapped parts of pens that we manufacture in-house by melting the parts down and re-manufacturing them into a new pen. • We stopped using plastic packaging for acrylic drinkware, eliminating the need for up to 1.9 million plastic bags annually. • We’re in the middle of a rolling change to #4 LDPE plastic when the use of plastic is unavailable. Q: Carbon offsetting can be a little controversial (there was that Guardian report at the beginning of the year about “phantom credits,” for example). How do you choose reputable projects and ensure your company isn’t engaging in greenwashing? A: We went the certification route because we wanted a third party to validate our findings, but we specifically went with Climate Impact Partners because they were able to verify the authenticity of carbon credits and assist with selecting projects that align with our values. Because we are new to carbon offsetting, we wanted a partner that has experience in both the carbon market and with businesses operating in a variety of different areas. Our partner ensures we are buying legitimate credits while helping us avoid greenwashing when discussing our efforts. Q: Among the carbon offsets Koozie Group is supporting is an Amazon rainforest conservation project in Brazil. Can you elaborate on how the project works and why you selected it? A: Because of our large calendar and Souvenir Sticky Note business, we really wanted to support a project related to paper. The Amazon REDD+ project in Brazil focuses on Reducing Emissions from Deforestation and (forest) Degradation. Without other options, communities will raze rainforests to convert the area to farmland to try to earn a living. Not only does this result in losing some of the most biodiverse ecosystems in the world, but the resulting agriculture may not even be enough to sustain the community. This project helps preserve rainforests by working with local communities to provide better income, education and sustainable forestry training. “It’s well established that consumers are looking beyond a company’s product or service offerings and are beginning to look at a company’s environmental and social efforts. As more companies want to do better for our environment, they’ll start looking toward offsets and carbon neutrality.” Victoria Sierra Q: You’ve said the next step in your journey is measuring Scope 3 emissions. Can you talk a little more about how those are different than Scope 1 and 2, and how you can measure and reduce those indirect emissions? A: Scope 1 and Scope 2 emissions are relatively easy to track because they are under our direct control, or we have a simple way to document them. Internally, we refer to Scope 1 as the “burn” emissions because they most commonly result from burning fuel in our fleet vehicles. With gas station receipts or looking at mileage of a car, it’s relatively easy to track our emissions from this source. We refer to Scope 2 as the “buy” emissions because they are the emissions that result from our energy purchases. Similar to the burn emissions, we can document these thanks to the monthly usage on our electric bills. Scope 3 is the ethereal “beyond” emissions category because we don’t produce them, and they’re not directly controlled by us, even though we are responsible for them. This includes things like employee commuting, business travel and shipping. This scope is harder to track because there are many different factors that go into it (the distance or method of travel, package size, etc.) and the category is so broad – it’s essentially a catch-all of things that don’t fit into the other two categories but still cause emissions. In total, we are working on nine Scope 3 categories and are already carbon neutral on seven of those. To reach our goal, we plan to measure and reduce these emissions even further through a variety of activities. For example, we were able to approximate our business travel emissions by determining the amount spent on total company travel, approximating how many trips were done between all our sites, then applying the average carbon footprint to each trip. In our efforts to minimize emissions where we can, we have continued work-from-home and hybrid policies and offer local pickup for orders. Q: Do you anticipate carbon neutral certification to become more widespread in the promo industry? A: We certainly hope so, because we think it’s just the starting point for all industries, not just promo. It’s well established that consumers are looking beyond a company’s product or service offerings and are beginning to look at its environmental and social efforts. As more companies want to do better for our environment, they’ll start looking toward offsets and carbon neutrality. We think the next step is reducing emissions with science-based targets and eventually becoming net-zero. Carbon neutrality and net-zero are often used interchangeably, but net-zero means that you have gotten rid of all emissions, rather than just offsetting any emissions you’ve made. Q. What are some tips for other promo companies looking to shrink their carbon footprint? A: It’s hard to shrink your carbon footprint without knowing the size of it, so the best place to start is by tracking your greenhouse gas emissions. Scope 2 is probably the easiest jumping-off point since everyone gets a bill from their local electric company, so all the information is in one place. Scope 1 might take a bit more legwork to get started, but once it’s rolling, it’ll be relatively easy to collect the information. With this information, companies can make informed decisions on measures they can take to internally reduce their footprint – and work with reputable consultants to offset any unavoidable emissions.","filter_flag":1}
{"title":"Adapting Old Pipelines for New Products: How the Energy Industry is Addressing the Drive for Decarbonization - TRC Companies","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy50cmNjb21wYW5pZXMuY29tL2luc2lnaHRzL2FkYXB0aW5nLW9sZC1waXBlbGluZXMtZm9yLW5ldy1wcm9kdWN0cy1ob3ctdGhlLWVuZXJneS1pbmR1c3RyeS1pcy1hZGRyZXNzaW5nLXRoZS1kcml2ZS1mb3ItZGVjYXJib25pemF0aW9uL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy50cmNjb21wYW5pZXMuY29tL2luc2lnaHRzL2FkYXB0aW5nLW9sZC1waXBlbGluZXMtZm9yLW5ldy1wcm9kdWN0cy1ob3ctdGhlLWVuZXJneS1pbmR1c3RyeS1pcy1hZGRyZXNzaW5nLXRoZS1kcml2ZS1mb3ItZGVjYXJib25pemF0aW9uL9IBAA?oc=5","id":"CBMikgFodHRwczovL3d3dy50cmNjb21wYW5pZXMuY29tL2luc2lnaHRzL2FkYXB0aW5nLW9sZC1waXBlbGluZXMtZm9yLW5ldy1wcm9kdWN0cy1ob3ctdGhlLWVuZXJneS1pbmR1c3RyeS1pcy1hZGRyZXNzaW5nLXRoZS1kcml2ZS1mb3ItZGVjYXJib25pemF0aW9uL9IBAA","guidislink":false,"published":"Tue, 03 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=276, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy50cmNjb21wYW5pZXMuY29tL2luc2lnaHRzL2FkYXB0aW5nLW9sZC1waXBlbGluZXMtZm9yLW5ldy1wcm9kdWN0cy1ob3ctdGhlLWVuZXJneS1pbmR1c3RyeS1pcy1hZGRyZXNzaW5nLXRoZS1kcml2ZS1mb3ItZGVjYXJib25pemF0aW9uL9IBAA?oc=5\" target=\"_blank\">Adapting Old Pipelines for New Products: How the Energy Industry is Addressing the Drive for Decarbonization<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TRC Companies<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Adapting Old Pipelines for New Products: How the Energy Industry is Addressing the Drive for Decarbonization - TRC Companies","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy50cmNjb21wYW5pZXMuY29tL2luc2lnaHRzL2FkYXB0aW5nLW9sZC1waXBlbGluZXMtZm9yLW5ldy1wcm9kdWN0cy1ob3ctdGhlLWVuZXJneS1pbmR1c3RyeS1pcy1hZGRyZXNzaW5nLXRoZS1kcml2ZS1mb3ItZGVjYXJib25pemF0aW9uL9IBAA?oc=5\" target=\"_blank\">Adapting Old Pipelines for New Products: How the Energy Industry is Addressing the Drive for Decarbonization<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TRC Companies<\/font>","source.href":"https:\/\/www.trccompanies.com","source.title":"TRC Companies","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"There is currently an emphasis across the United States to reduce greenhouse gas emissions and become carbon neutral in the near future. Transitioning from carbon-based fuels to hydrogen and the capture of carbon dioxide both have the potential for a significant impact on the existing pipeline infrastructure across the country. The pipeline industry is working to address these challenges and TRC is heavily involved in tracking these efforts. While the transportation of carbon dioxide and hydrogen by pipeline is not new, it does require the use of different materials, methods of construction, quality control testing and operational procedures than traditional hydrocarbon pipelines. Of the more than 3 million miles of pipelines in operation in the U.S., less than 1% of those pipelines were designed and constructed to transport carbon dioxide or hydrogen. In order to meet carbon reduction goals, existing pipelines may need to be repurposed to transport carbon dioxide, hydrogen or hydrogen\/natural gas blends. Hydrogen: The Zero Emission Fuel While the combustion of natural gas and other hydrocarbon-based fuels produces carbon dioxide as a residual byproduct, the combustion of hydrogen produces water as the only byproduct. Blending of hydrogen into natural gas is the first step in the transition to a hydrogen fuel economy. A total duplication of the natural gas infrastructure for purity hydrogen would cost trillions of dollars and take decades to construct. Blending of hydrogen into existing natural gas is the most cost-effective approach and will result in the immediate reduction of greenhouse gas emissions. The American Society of Mechanical Engineers (ASME) is currently modifying the natural gas pipeline standard to accommodate the blending of hydrogen into natural gas. The pipeline industry is spending millions of dollars on research to determine the safe amount of hydrogen that can be blended into existing natural gas pipelines with no modifications, and to determine what changes will need to be made to safely transport higher blends, potentially up to 100% hydrogen. The results of this research will be reviewed by the appropriate ASME committee and adopted into the natural gas pipeline standard for use by the industry and regulators. Carbon Dioxide – Reducing Greenhouse Gas Emissions Carbon Dioxide has been transported by pipelines as a liquid for decades for use primarily in enhanced oil recovery in underground formations and is already covered by existing ASME standards. Most of this carbon dioxide has come from naturally occurring underground reservoirs or separated from raw natural gas streams as part of the treating process. Today’s greenhouse gas emission reductions are focused on the removal of carbon dioxide from industrial processes such as the production of ethanol, or from the combustion of hydrocarbon fuels for electrical power generation or industrial uses. This carbon dioxide recovery will be at low pressure and may require its transportation as a vapor instead of as a liquid, which currently is not covered by an ASME standard. After the carbon dioxide is recovered it will need to be transported to a suitable location for injection into an underground formation for sequestration. ASME is in the process of reviewing the current carbon dioxide liquid transportation standard to determine what inspection, testing and modifications will be required to convert existing gas or liquid pipelines for the transmission of carbon dioxide. At the same time, the current natural gas transportation standard is also under review to determine similar requirements for transporting carbon dioxide as a gas. All of these modifications are necessary to ensure that all forms of carbon dioxide can be transported safely to their final destination. TRC Can Help TRC is your one-stop-shop for answers to today’s decarbonization challenges and is uniquely qualified to provide solutions for any or all phases of your project. We have in-house experts who can start small with the conceptual investigation and grow as needed for the design, construction and commissioning of your project.","filter_flag":1}
{"title":"HONEYWELL AND GRANBIO TO PRODUCE CARBON NEUTRAL SUSTAINABLE AVIATION FUEL - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2hvbmV5d2VsbC1hbmQtZ3JhbmJpby10by1wcm9kdWNlLWNhcmJvbi1uZXV0cmFsLXN1c3RhaW5hYmxlLWF2aWF0aW9uLWZ1ZWwtMzAxOTUyNjgwLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2hvbmV5d2VsbC1hbmQtZ3JhbmJpby10by1wcm9kdWNlLWNhcmJvbi1uZXV0cmFsLXN1c3RhaW5hYmxlLWF2aWF0aW9uLWZ1ZWwtMzAxOTUyNjgwLmh0bWzSAQA?oc=5","id":"CBMigQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2hvbmV5d2VsbC1hbmQtZ3JhbmJpby10by1wcm9kdWNlLWNhcmJvbi1uZXV0cmFsLXN1c3RhaW5hYmxlLWF2aWF0aW9uLWZ1ZWwtMzAxOTUyNjgwLmh0bWzSAQA","guidislink":false,"published":"Tue, 10 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=283, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2hvbmV5d2VsbC1hbmQtZ3JhbmJpby10by1wcm9kdWNlLWNhcmJvbi1uZXV0cmFsLXN1c3RhaW5hYmxlLWF2aWF0aW9uLWZ1ZWwtMzAxOTUyNjgwLmh0bWzSAQA?oc=5\" target=\"_blank\">HONEYWELL AND GRANBIO TO PRODUCE CARBON NEUTRAL SUSTAINABLE AVIATION FUEL<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"HONEYWELL AND GRANBIO TO PRODUCE CARBON NEUTRAL SUSTAINABLE AVIATION FUEL - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2hvbmV5d2VsbC1hbmQtZ3JhbmJpby10by1wcm9kdWNlLWNhcmJvbi1uZXV0cmFsLXN1c3RhaW5hYmxlLWF2aWF0aW9uLWZ1ZWwtMzAxOTUyNjgwLmh0bWzSAQA?oc=5\" target=\"_blank\">HONEYWELL AND GRANBIO TO PRODUCE CARBON NEUTRAL SUSTAINABLE AVIATION FUEL<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"DES PLAINES, Ill. and THOMASTON, Ga., Oct. 10, 2023 \/PRNewswire\/ -- Honeywell (Nasdaq: HON) and GranBio Technologies today announced that they will combine Honeywell's ethanol to jet (ETJ) technology with GranBio's cellulosic ethanol AVAP® technology to produce carbon neutral sustainable aviation fuel (SAF) from biomass residues at GranBio's forthcoming U.S. demonstration plant. HONEYWELL AND GRANBIO TO PRODUCE CARBON NEUTRAL SUSTAINABLE AVIATION FUEL. GranBio's patented AVAP process converts biomass, including forest and agricultural residues, to pure low-cost, low-carbon-intensity sugars, lignin, and nanocellulose. The cellulosic sugars are converted to both SAF, through Honeywell's ETJ technology, and biochemicals, through a separate process. Using forest biomass-derived ethanol from the AVAP process, jet fuel produced from Honeywell's ethanol to jet fuel process can reduce greenhouse gas (GHG) emissions to net zero on a total lifecycle basis, compared to petroleum-based jet fuel1. \"Combining our biorefinery expertise with Honeywell experience in developing and scaling fuel technologies will help ensure SAF supply goals, while supporting GranBio's mission to provide integrated value chain solutions throughout the world for net zero SAF from biomass,\" said Bernardo Gradin, GranBio CEO. \"The AVAP technology has great potential, depending on feedstock and plant configuration to allow carbon negative SAF with current life cycle analysis.1\" \"Plus, in addition to vast forest and agricultural residue available for feedstocks, there is an enormous potential to retrofit idle pulp and paper facilities in the U.S., revitalizing forestry value chains and rural manufacturing with great social, environmental, and economic impact,\" Gradin added. \"GranBio's low carbon feedstock coupled with Honeywell's SAF expertise will help decarbonize air travel,\" said Barry Glickman, vice president, general manager, Honeywell Sustainable Technology Solutions. \"Our advanced ETJ process is ready-now and builds upon Honeywell's near twenty years' experience in renewable fuels. Honeywell's renewable fuels solutions, including ETJ, incorporate integrated, modular designs, that enable producers like GranBio to build new SAF capacity more than a year faster than is possible with traditional construction approaches.\" GranBio's AVAP aims to enable worldwide net zero SAF production by utilizing abundant, low-cost biomass feedstocks and diversification of income streams through value-added products beyond SAF, providing significant cost advantage as compared to other SAF producers. GranBio's subsidiary AVAPCO was selected by the U.S. Department of Energy to receive an $80M grant to support the demonstration plant that will produce ~2 million gallons per year of SAF upon start-up in 2026. Honeywell now offers solutions across a range of feedstocks to meet the rapidly growing demand for renewable fuels, including SAF. In addition to Honeywell UOP Ecofining™, Honeywell's renewable fuels portfolio includes ethanol to jet technology and the recently announced Honeywell UOP eFining™, which converts green hydrogen and carbon dioxide into eFuels. Honeywell recently committed to achieve carbon neutrality in its operations and facilities by 2035. This commitment builds on the company's track record of sharply reducing the greenhouse gas intensity of its operations and facilities as well as its decades-long history of innovation to help its customers meet their environmental and social goals. About 60% of Honeywell's 2022 new product introduction research and development investment was directed toward ESG-oriented outcomes for customers.2 About Honeywell Honeywell (www.honeywell.com) delivers industry-specific solutions that include aerospace products and services; control technologies for buildings and industry; and performance materials globally. Our technologies help aircraft, buildings, manufacturing plants, supply chains, and workers become more connected to make our world smarter, safer, and more sustainable. For more news and information on Honeywell, please visit www.honeywell.com\/newsroom. About GranBio GranBio Technologies is a U.S.-based subsidiary of GranBio, a Brazilian industrial biotechnology company, that creates solutions to transform biomass into renewable products that address the world's hardest-to-abate sectors. 1 Based on a Life Cycle Analysis conducted by Michigan Technological University. 2 Methodology for identifying ESG-oriented solutions is available at investor.honeywell.com (see \"ESG\/ESG Information\/Identification of ESG-Oriented Offerings\"). Contacts: Media contacts: Nicole Frett [email protected] 847-302-8298 Kim Nelson [email protected] 404-931-9109 SOURCE Honeywell","filter_flag":1}
{"title":"Do consumers buy into carbon claims? - Footprint","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vZm9vZHNlcnZpY2Vmb290cHJpbnQuY29tL2RvLWNvbnN1bWVycy1idXktaW50by1jYXJib24tY2xhaW1zL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vZm9vZHNlcnZpY2Vmb290cHJpbnQuY29tL2RvLWNvbnN1bWVycy1idXktaW50by1jYXJib24tY2xhaW1zL9IBAA?oc=5","id":"CBMiRWh0dHBzOi8vZm9vZHNlcnZpY2Vmb290cHJpbnQuY29tL2RvLWNvbnN1bWVycy1idXktaW50by1jYXJib24tY2xhaW1zL9IBAA","guidislink":false,"published":"Tue, 17 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=290, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vZm9vZHNlcnZpY2Vmb290cHJpbnQuY29tL2RvLWNvbnN1bWVycy1idXktaW50by1jYXJib24tY2xhaW1zL9IBAA?oc=5\" target=\"_blank\">Do consumers buy into carbon claims?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Footprint<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Do consumers buy into carbon claims? - Footprint","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vZm9vZHNlcnZpY2Vmb290cHJpbnQuY29tL2RvLWNvbnN1bWVycy1idXktaW50by1jYXJib24tY2xhaW1zL9IBAA?oc=5\" target=\"_blank\">Do consumers buy into carbon claims?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Footprint<\/font>","source.href":"https:\/\/foodservicefootprint.com","source.title":"Footprint","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Brands were quick to adopt carbon neutral claims but interest has slowed of late as consumers and companies are left confused, says Maria Coronado Robles. Carbon offsets have a bunch of advantages that companies really like. They’re a quick and cost-effective way to offset their carbon footprint with the subsequent positive PR of claiming carbon neutrality. What’s more, they fit right into short-term business plans without needing to shake up production or operations to tackle more difficult to abate greenhouse gas emissions (think scope 3 emissions). It’s no surprise, then, that our global data show an 87.8% increase in staple grocery foods using ‘carbon neutral’ and ‘reduced carbon’ claims in the past two years; in dairy products there has been a 79.4% jump. But carbon neutral claims and the voluntary carbon market are under fire. Critics see them as a shortcut to ‘out-green’ the competition, and attract a premium price. Food companies have certainly found the temptation hard to ignore and our research suggests this has led to a dangerous disconnect. In a recent survey we conducted, about one-third of food and retail professionals said their companies are using carbon offsets. That’s double the number that said their company has a net-zero strategy in place – which means that twice as many companies are using offsets as a patchwork solution rather than actually mapping out a strategy to become net-zero. It raises some eyebrows and begs the question: what positive changes have carbon neutrality and offsets driven? Those in the voluntary carbon market, certifiers of carbon neutral and the companies making claims, are desperately looking for answers. Meanwhile, it’s important not to demonise all such claims and offsets as greenwashing. The idea of carbon neutrality and offsets has sparked important conversations that we weren’t having before. Businesses are now much more aware of their carbon footprints than they used to be, and even if some are using offsets as a quick fix, at least they’re having to measure, track, and acknowledge their emissions in the first place. Many more certainly need to do so. Consumers are also becoming more informed and thoughtful about their choices. Initiatives like carbon labelling and carbon-based prices have certainly provided some of the information that all the surveys tell us consumers want about the sustainability of the food and drink they buy. Mindful of the gap When it comes to actual purchases, carbon neutral products lag behind other sustainable options. Only 17% of the 40,000 shoppers in our global survey said they had purchased a carbon neutral product recently; this compared to 33% who had chosen items marketed with ‘sustainable packaging’. We also found a disconnect: 64% of people said they’re concerned about climate change, and 44% even think they’re part of the problem; however just 17% are actually buying carbon neutral products. That’s a big gap. Part of the problem here is that people might not fully understand what carbon neutral means (research by the Advertising Standards Authority in the UK highlighted this confusion). Or perhaps they’re sceptical about the difference that buying these products really makes. Then there’s the ever-present issue of accessibility and affordability: 44% of global consumers consider the ‘high price relative to non-sustainable alternatives’ as the top barrier to buying these products, with ‘unclear labelling’ closely behind. So there’s a mix of educational and practical barriers that might be holding people back from aligning their purchases with their concerns. So what happens next? Has scrutiny of the claims, by campaigners, consumers, regulators and companies themselves, derailed interest in carbon neutral claims forever? Brands are genuinely worried about being labelled as ‘greenwashers’, so with offsets under scrutiny companies are compelled to put the brakes on. Evian and Nestlé are among those to be re-thinking their strategies, while Footprint has reported how foodservice companies like Leon, Sodexo and others are moving away from carbon neutral claims and targets. The Carbon Trust has also dropped its carbon neutral label used on almost 900 food and drink products, with the focus now on schemes and labels showing carbon reductions or comparisons between products. Carbon offsets are not a magic solution; we have seen in recent weeks how putting too much weight on them can actually backfire. In our research, we’re spotting a slight slow down in the use of carbon neutral claims in food and even a decline in areas like staple foods and cooking ingredients and meals. However, it hasn’t yet permeated industries such as beauty and personal care where the number of these claims continues to grow. It was also interesting to see carbon neutral claims made by Apple for some of its new products last month – and the criticism it is already receiving for this. Rise to reductions So, are companies better off focusing on emissions reductions? In a word: yes. The most climate neutral emissions are the ones you never produce in the first place. Companies are throwing money at different projects with all sorts of certifications to claim to be neutral – which sounds great (or used to sound great) – but it is hard to know which ones actually make a real impact or even know where these projects are happening or if they are affecting communities, food security or land prices. If companies are struggling to understand all this, how on earth are consumers supposed to? Regulators like the Competition and Markets Authority and ASA are of course hoping to tighten up the rules so shoppers can better understand what they are buying and then clarify any green claims being made. The intention is good – demands on companies to make it clear what and how many offsets are used can help to improve transparency, for instance. The new rules are also shaking up how companies talk about sustainability, including carbon, net-zero and carbon neutral. But the guidelines are frustratingly vague and leave room for interpretation. There is still too much uncertainty and above all companies want consumers to trust the brands they buy into. Whether they can do so when it comes to carbon neutral claims going forward, time will tell. Maria Coronado Robles is global head of sustainability insights at Euromonitor.","filter_flag":1}
{"title":"Puratos marks sustainability milestone with new carbon-neutral Belgian Belcolade chocolate factory - Confectionery Production","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMilgFodHRwczovL3d3dy5jb25mZWN0aW9uZXJ5cHJvZHVjdGlvbi5jb20vbmV3cy80NTY0Mi9wdXJhdG9zLW1hcmtzLXN1c3RhaW5hYmlsaXR5LW1pbGVzdG9uZS13aXRoLW5ldy1jYXJib24tbmV1dHJhbC1iZWxnaWFuLWJlbGNvbGFkZS1jaG9jb2xhdGUtZmFjdG9yeS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMilgFodHRwczovL3d3dy5jb25mZWN0aW9uZXJ5cHJvZHVjdGlvbi5jb20vbmV3cy80NTY0Mi9wdXJhdG9zLW1hcmtzLXN1c3RhaW5hYmlsaXR5LW1pbGVzdG9uZS13aXRoLW5ldy1jYXJib24tbmV1dHJhbC1iZWxnaWFuLWJlbGNvbGFkZS1jaG9jb2xhdGUtZmFjdG9yeS_SAQA?oc=5","id":"CBMilgFodHRwczovL3d3dy5jb25mZWN0aW9uZXJ5cHJvZHVjdGlvbi5jb20vbmV3cy80NTY0Mi9wdXJhdG9zLW1hcmtzLXN1c3RhaW5hYmlsaXR5LW1pbGVzdG9uZS13aXRoLW5ldy1jYXJib24tbmV1dHJhbC1iZWxnaWFuLWJlbGNvbGFkZS1jaG9jb2xhdGUtZmFjdG9yeS_SAQA","guidislink":false,"published":"Mon, 16 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=289, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilgFodHRwczovL3d3dy5jb25mZWN0aW9uZXJ5cHJvZHVjdGlvbi5jb20vbmV3cy80NTY0Mi9wdXJhdG9zLW1hcmtzLXN1c3RhaW5hYmlsaXR5LW1pbGVzdG9uZS13aXRoLW5ldy1jYXJib24tbmV1dHJhbC1iZWxnaWFuLWJlbGNvbGFkZS1jaG9jb2xhdGUtZmFjdG9yeS_SAQA?oc=5\" target=\"_blank\">Puratos marks sustainability milestone with new carbon-neutral Belgian Belcolade chocolate factory<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Confectionery Production<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Puratos marks sustainability milestone with new carbon-neutral Belgian Belcolade chocolate factory - Confectionery Production","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilgFodHRwczovL3d3dy5jb25mZWN0aW9uZXJ5cHJvZHVjdGlvbi5jb20vbmV3cy80NTY0Mi9wdXJhdG9zLW1hcmtzLXN1c3RhaW5hYmlsaXR5LW1pbGVzdG9uZS13aXRoLW5ldy1jYXJib24tbmV1dHJhbC1iZWxnaWFuLWJlbGNvbGFkZS1jaG9jb2xhdGUtZmFjdG9yeS_SAQA?oc=5\" target=\"_blank\">Puratos marks sustainability milestone with new carbon-neutral Belgian Belcolade chocolate factory<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Confectionery Production<\/font>","source.href":"https:\/\/www.confectioneryproduction.com","source.title":"Confectionery Production","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"A key sustainability breakthrough has been made by Puratos’s Belgian chocolate brand, Belcolade, after opening its advanced carbon neutral chocolate factory offering premium product ranges for professional industry customers, writes Neill Barston. According to the company, the new facility synergises taste expertise with strong ethical principles providing high-quality product ranges that also help empower its customers to make steps towards delivering more environmentally-friendly business operations. As the firm explained, its focus on taste and sustainability is revealed by findings from a recent Taste Tomorrow study, which highlights that while taste remains the primary purchasing criterion for consumers, the sustainability of the chocolate is a key differentiating factor for their purchase with 69% of UK respondents interested in food products coming from sustainable farming methods. “Becolade’s expansion is driven by its steadfast commitment to sustainability”, according to Pierre Tossut, CEO of Puratos. “Our brand drives innovation, ensuring that chocolatiers, pâtissiers, and bakers have access to exceptional chocolate choices that mirror their values,” he says. “Our new carbon-neutral factory embodies this commitment. This pioneering factory will operate on 100% renewable electricity – eliminating the need for fossil fuels. Thanks to extensive underground rainwater storage, it will source 90% of its water from collected rainwater. Belcolade has made substantial investments to enhance their energy efficiency, reliability, and resilience against droughts by revamping all technical energy installations, storage, and distribution. Thanks to heat recovery and the utilisation of cutting-edge heat pump technology, the brand’s heat production process now consumes five times less energy than before.” Moreover, as the business noted, the Cacao-Trace Sustainable Cocoa programme is another example of Belcolade’s commitment to a more sustainable future throughout the entire cocoa chain. “The Cacao-Trace programme not only produce the best quality cocoa, but also supports farmers worldwide by providing better prices and an extra Chocolate Bonus. Additionally, we improve the environment and living conditions of our farmers’ communities by building schools, health centres, and offering drinkable water equipment.” explains Pierre Tossut. Alongside these impactful sustainable initiatives, Belcolade’s new 100% recycle-ready packaging reflects the company’s determination to reduce its environmental footprint and make a positive impact on the planet. “Our planet is worth protecting, and we wish to play our part by applying these sustainable practices of which we are very proud,” concludes Pierre Tossut. Furthermore, as the business noted, the product creations are born from collaborative efforts, crafted alongside chocolatiers, pastry chefs and bakers who remain attuned to the latest consumer trends. the brand has gained recognition for its innovation, using creative solutions and the latest technologies to provide unique tastes and high-standard Belgian chocolate to every single professional in the chocolate industry, reinforcing its commitment to providing the best experience to their customers. “Belcolade combines sensory expertise and sustainability to craft quality products that drive our customers’ success while securing a sustainable future for generations to come,” remarks Youri Dumont, Director of the Chocolate Business Unit at Puratos. “The Cacao-Trace Sustainable Programme is a testament to our commitment to taste and sustainability. Our Cacao-Trace chocolate, which will be produced in part at the new site, takes taste to a whole new level of excellence thanks to a unique fermentation process that guarantees the best cocoa quality and enhances the flavours of every chocolate drop.” Related content","filter_flag":1}
{"title":"Supply chain sustainability: Teaming up with suppliers to protect people and the planet - Philips","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2ZlYXR1cmVzLzIwMjMvMjAyMzEwMjYtc3VwcGx5LWNoYWluLXN1c3RhaW5hYmlsaXR5LXRlYW1pbmctdXAtd2l0aC1zdXBwbGllcnMtdG8tcHJvdGVjdC1wZW9wbGUtYW5kLXRoZS1wbGFuZXQuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2ZlYXR1cmVzLzIwMjMvMjAyMzEwMjYtc3VwcGx5LWNoYWluLXN1c3RhaW5hYmlsaXR5LXRlYW1pbmctdXAtd2l0aC1zdXBwbGllcnMtdG8tcHJvdGVjdC1wZW9wbGUtYW5kLXRoZS1wbGFuZXQuaHRtbNIBAA?oc=5","id":"CBMioQFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2ZlYXR1cmVzLzIwMjMvMjAyMzEwMjYtc3VwcGx5LWNoYWluLXN1c3RhaW5hYmlsaXR5LXRlYW1pbmctdXAtd2l0aC1zdXBwbGllcnMtdG8tcHJvdGVjdC1wZW9wbGUtYW5kLXRoZS1wbGFuZXQuaHRtbNIBAA","guidislink":false,"published":"Thu, 26 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=299, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2ZlYXR1cmVzLzIwMjMvMjAyMzEwMjYtc3VwcGx5LWNoYWluLXN1c3RhaW5hYmlsaXR5LXRlYW1pbmctdXAtd2l0aC1zdXBwbGllcnMtdG8tcHJvdGVjdC1wZW9wbGUtYW5kLXRoZS1wbGFuZXQuaHRtbNIBAA?oc=5\" target=\"_blank\">Supply chain sustainability: Teaming up with suppliers to protect people and the planet<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philips<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Supply chain sustainability: Teaming up with suppliers to protect people and the planet - Philips","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2ZlYXR1cmVzLzIwMjMvMjAyMzEwMjYtc3VwcGx5LWNoYWluLXN1c3RhaW5hYmlsaXR5LXRlYW1pbmctdXAtd2l0aC1zdXBwbGllcnMtdG8tcHJvdGVjdC1wZW9wbGUtYW5kLXRoZS1wbGFuZXQuaHRtbNIBAA?oc=5\" target=\"_blank\">Supply chain sustainability: Teaming up with suppliers to protect people and the planet<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philips<\/font>","source.href":"https:\/\/www.philips.com","source.title":"Philips","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Beyond auditing – driving continuous improvement in supplier sustainability At Philips, our purpose to improve people’s lives extends beyond our innovative products, systems and services to our supply chain. Philips’ Supplier Sustainability Performance (SSP) program replaces the traditional approach of supplier auditing, which had been shown to be insufficient in driving sustainable improvements and often leads to audit fatigue. “One of the most important behaviors we’re trying to drive is the focus on continuous improvement,” explains Bob Ruers, Philips Supplier Sustainability Director. He says this means identifying and tackling the root cause of process issues. With the SSP program, the focus is on ensuring structural, proactive improvement in social and environmental performance, rather than simply reacting to issues that arise. “If something's not right, you need to take time and analyze the problem,” he says. “There's no point in keeping the train running on a broken track. We need to normalize fixing the root cause.” By lending expertise to suppliers, Philips helps them grow their skills in many areas, including assessment of supplier sustainability performance, management of regulated substances, greening the supply chain, improvement of working conditions, and responsible sourcing. “Our SSP approach is long-term and relationship-driven,” says Bob. “We explain the reasoning behind the plan. At the beginning it may be, ‘I have a policy,’ but the larger aim is to build mature and sustainable supplier management.” Bob says implementing sustainable, people-centered practices in a company’s supply chain takes an all-hands-on-deck approach. “We invest in suppliers who provide a safe working environment, treat workers with respect, and work in an environmentally sound way. When problematic practices surface, that’s okay. Because identifying an issue is the first step towards making an improvement – and we do that together.” ","filter_flag":1}
{"title":"Waste to Energy: Waste-to-Energy in a Circular Economy: Friend or Foe? | WMW - Waste Management World","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd2FzdGUtbWFuYWdlbWVudC13b3JsZC5jb20vd2FzdGUtdG8tZW5lcmd5L3dhc3RlLXRvLWVuZXJneS1pbi1hLWNpcmN1bGFyLWVjb25vbXktZnJpZW5kLW9yLWZvZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd2FzdGUtbWFuYWdlbWVudC13b3JsZC5jb20vd2FzdGUtdG8tZW5lcmd5L3dhc3RlLXRvLWVuZXJneS1pbi1hLWNpcmN1bGFyLWVjb25vbXktZnJpZW5kLW9yLWZvZS_SAQA?oc=5","id":"CBMiZ2h0dHBzOi8vd2FzdGUtbWFuYWdlbWVudC13b3JsZC5jb20vd2FzdGUtdG8tZW5lcmd5L3dhc3RlLXRvLWVuZXJneS1pbi1hLWNpcmN1bGFyLWVjb25vbXktZnJpZW5kLW9yLWZvZS_SAQA","guidislink":false,"published":"Thu, 12 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=285, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd2FzdGUtbWFuYWdlbWVudC13b3JsZC5jb20vd2FzdGUtdG8tZW5lcmd5L3dhc3RlLXRvLWVuZXJneS1pbi1hLWNpcmN1bGFyLWVjb25vbXktZnJpZW5kLW9yLWZvZS_SAQA?oc=5\" target=\"_blank\">Waste to Energy: Waste-to-Energy in a Circular Economy: Friend or Foe? | WMW<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Waste Management World<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Waste to Energy: Waste-to-Energy in a Circular Economy: Friend or Foe? | WMW - Waste Management World","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd2FzdGUtbWFuYWdlbWVudC13b3JsZC5jb20vd2FzdGUtdG8tZW5lcmd5L3dhc3RlLXRvLWVuZXJneS1pbi1hLWNpcmN1bGFyLWVjb25vbXktZnJpZW5kLW9yLWZvZS_SAQA?oc=5\" target=\"_blank\">Waste to Energy: Waste-to-Energy in a Circular Economy: Friend or Foe? | WMW<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Waste Management World<\/font>","source.href":"https:\/\/waste-management-world.com","source.title":"Waste Management World","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"One of the major goals of the European Union in order to get to a more sustainable future is to reduce landfills to a minimum. The target for all EU members is to achieve a 10% landfill rate by 2035. “Waste-to-energy is an alternative to landfill and a final sink for waste that is not recyclable or reusable, thus fulfilling a hygienic task,” explains Johnny Stuen. “Landfills are dangerous places, whereas waste-to-energy in the EU is strictly regulated.” Hazardous waste that needs immediate safe treatment as well as waste that cannot be recycled because of contamination or composition may find its way into a waste-to-energy plant. “Some countries depend heavily on landfills and it should not be the first thing. But our goal is to get better at sorting, drive up the recycling rates and put everything that cannot be recycled in sanitary landfill. Of course, we aim to minimise landfill but it is preferable to incineration,” argues Janek Vähk. One point on which both sides agree is that no recyclable waste should end up in an incinerator. The problem: too many recyclables end up in the residual waste and too much recyclable waste is not recycled as yet. “I strongly advocate efficient source separation. This is essential for quality recycling. When we have to deal with mixed waste it’s already too late,” says Ella Stengler. Stuen agrees: “Waste-to-energy is not the solution by itself. Good sorting systems are essential. And we need a lot more sorting technology so no recyclable waste ends up in an incinerator.” A harmonised collection system might be helpful, according to Janek Vähk, “because it is very confusing what to put in what bin.” “Waste-to-energy plants don’t have an influence on what they get to burn. Therefore, legislation is needed. They cannot reduce the waste by themselves,” says CEWEP’s Ella Stengler. But of course, just because selective collection is compulsory in the EU, this doesn’t mean that it is homogeneous throughout its territory. A concern expressed by the EU and NGOs alike is related to the design of the plants. Driving up recycling rates – and in the best case scenario, recycling innovation especially for plastics – will result in a smaller amount of residual waste and therefore less material that may end up in an incinerator. “Should we significantly reduce waste generation, the waste-to-energy plants are flexible and can reduce their volume. But I wouldn’t shut them down just yet,” says Ella Stengler, also pointing to the change in waste that will be delivered to waste-to-energy plants in the future. “We will have less fossils in waste-to-energy thanks to better source separation. So more biogenic input and less fossil fuels will really make an impact.” Another aspect Stengler stresses is independent heat production: “Europe is highly dependent on fossil fuels. Waste-to-energy can supply energy and so on a local level replace other energy sources and thus make us a little less dependent on other countries.”","filter_flag":1}
{"title":"More iPhones to go by sea as Apple looks to slash carbon footprint - TradeWinds","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LnRyYWRld2luZHNuZXdzLmNvbS9lc2cvbW9yZS1pcGhvbmVzLXRvLWdvLWJ5LXNlYS1hcy1hcHBsZS1sb29rcy10by1zbGFzaC1jYXJib24tZm9vdHByaW50LzItMS0xNTI3OTcx0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LnRyYWRld2luZHNuZXdzLmNvbS9lc2cvbW9yZS1pcGhvbmVzLXRvLWdvLWJ5LXNlYS1hcy1hcHBsZS1sb29rcy10by1zbGFzaC1jYXJib24tZm9vdHByaW50LzItMS0xNTI3OTcx0gEA?oc=5","id":"CBMicWh0dHBzOi8vd3d3LnRyYWRld2luZHNuZXdzLmNvbS9lc2cvbW9yZS1pcGhvbmVzLXRvLWdvLWJ5LXNlYS1hcy1hcHBsZS1sb29rcy10by1zbGFzaC1jYXJib24tZm9vdHByaW50LzItMS0xNTI3OTcx0gEA","guidislink":false,"published":"Mon, 02 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=275, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LnRyYWRld2luZHNuZXdzLmNvbS9lc2cvbW9yZS1pcGhvbmVzLXRvLWdvLWJ5LXNlYS1hcy1hcHBsZS1sb29rcy10by1zbGFzaC1jYXJib24tZm9vdHByaW50LzItMS0xNTI3OTcx0gEA?oc=5\" target=\"_blank\">More iPhones to go by sea as Apple looks to slash carbon footprint<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TradeWinds<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"More iPhones to go by sea as Apple looks to slash carbon footprint - TradeWinds","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LnRyYWRld2luZHNuZXdzLmNvbS9lc2cvbW9yZS1pcGhvbmVzLXRvLWdvLWJ5LXNlYS1hcy1hcHBsZS1sb29rcy10by1zbGFzaC1jYXJib24tZm9vdHByaW50LzItMS0xNTI3OTcx0gEA?oc=5\" target=\"_blank\">More iPhones to go by sea as Apple looks to slash carbon footprint<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TradeWinds<\/font>","source.href":"https:\/\/www.tradewindsnews.com","source.title":"TradeWinds","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Apple, the world’s largest technology company by revenue, wants to ship more of its iconic products by sea to reduce its carbon emissions. The Cupertino, California-based company says transporting products around the world makes up about 9% of its comprehensive carbon footprint. The iPhone maker says it is shifting more product volume to shipping modes that are less carbon-intensive than air transport, such as ocean or rail. Apple’s vast supply chain comprises more than 400 facilities across 180 regions in nearly 30 countries, stretching from the Austrian Alps to Vietnam’s Mekong Delta, according to a recent report by Bloomberg. “Apple’s carbon footprint methodology shows that shipping the same product by ocean emits 95% fewer emissions than by air,” the company said. For its carbon neutral Apple Watch models, including watches and bands, Apple says it will ship at least 50% of the combined weight using non-air modes, which it claims will cut total transportation emissions nearly in half. Article continues below the advert Additionally, the packaging of all Apple Watch Series 9 and SE models has been redesigned for compactness, with a new, smaller shape that reportedly allows for 25% more devices per shipment. Thus far, only 2.8% of total US smartphone imports traveled by sea in the second quarter 2023, though that was up from 1.1% a year earlier, according to S&P Global Market Intelligence. “While the latest phones may still need to be shipped by air to meet launch dates, earlier-generation equipment could be shipped by sea,” it added. S&P Global Market Intelligence says the proportion of US laptop computer imports by all suppliers by sea has already returned to pre-pandemic levels after supply chain disruptions of the past two years. In the second quarter of 2023, 37.6% of US laptop computer imports arrived by sea, according to its data — the highest in over 10 years. “That may reflect efforts to cut costs in a low-demand environment. It does, however, reflect the off-peak season. In the third and fourth quarters of 2022, ahead of peak sales season, ocean shipments represented 16.6%,” S&P Global Market Intelligence said. Apple’s ambition is to make every product carbon neutral by the end of the decade, including the entire global supply chain and the lifetime use of every device Apple makes. The company says it is “committed to supporting broader efforts to decarbonise shipping industries”, such as by being a member of the First Movers Coalition. The coalition, unveiled during the COP26 climate conference in the UK city of Glasgow, aims to be a platform for companies to make purchasing commitments that demand low and zero-carbon fuels and technology.","filter_flag":1}
{"title":"Belcolade opens first carbon-neutral chocolate factory in Belgium - ConfectioneryNews.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LmNvbmZlY3Rpb25lcnluZXdzLmNvbS9BcnRpY2xlLzIwMjMvMTAvMTIvYmVsY29sYWRlLW9wZW5zLWZpcnN0LWNhcmJvbi1uZXV0cmFsLWNob2NvbGF0ZS1mYWN0b3J5LWluLWJlbGdpdW3SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LmNvbmZlY3Rpb25lcnluZXdzLmNvbS9BcnRpY2xlLzIwMjMvMTAvMTIvYmVsY29sYWRlLW9wZW5zLWZpcnN0LWNhcmJvbi1uZXV0cmFsLWNob2NvbGF0ZS1mYWN0b3J5LWluLWJlbGdpdW3SAQA?oc=5","id":"CBMidmh0dHBzOi8vd3d3LmNvbmZlY3Rpb25lcnluZXdzLmNvbS9BcnRpY2xlLzIwMjMvMTAvMTIvYmVsY29sYWRlLW9wZW5zLWZpcnN0LWNhcmJvbi1uZXV0cmFsLWNob2NvbGF0ZS1mYWN0b3J5LWluLWJlbGdpdW3SAQA","guidislink":false,"published":"Thu, 12 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=285, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LmNvbmZlY3Rpb25lcnluZXdzLmNvbS9BcnRpY2xlLzIwMjMvMTAvMTIvYmVsY29sYWRlLW9wZW5zLWZpcnN0LWNhcmJvbi1uZXV0cmFsLWNob2NvbGF0ZS1mYWN0b3J5LWluLWJlbGdpdW3SAQA?oc=5\" target=\"_blank\">Belcolade opens first carbon-neutral chocolate factory in Belgium<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ConfectioneryNews.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Belcolade opens first carbon-neutral chocolate factory in Belgium - ConfectioneryNews.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LmNvbmZlY3Rpb25lcnluZXdzLmNvbS9BcnRpY2xlLzIwMjMvMTAvMTIvYmVsY29sYWRlLW9wZW5zLWZpcnN0LWNhcmJvbi1uZXV0cmFsLWNob2NvbGF0ZS1mYWN0b3J5LWluLWJlbGdpdW3SAQA?oc=5\" target=\"_blank\">Belcolade opens first carbon-neutral chocolate factory in Belgium<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ConfectioneryNews.com<\/font>","source.href":"https:\/\/www.confectionerynews.com","source.title":"ConfectioneryNews.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"The carbon-neutral factory in Erembodegem, Belgium, is the first to be opened in the country and forms part of Belcolade’s Cacao-Trace sustainable cocoa programme, which includes empowering cocoa farmers, promoting biodiversity as part of creating a sustainable cocoa chain across the globe. Belcolade has also committed to making all packaging materials across its operations fully recyclable by 2025. This move will further reduce the brand’s environmental footprint and help customers take meaningful steps toward their sustainability goals. Inside Belcolade’s carbon-neutral chocolate factory. Pic: Belcolade Youri Dumont, who leads the Belcolade business, outlined more details of the brand’s sustainability journey to ConfectioneryNews and said, “Its commitment to value creation is contributing to a better, brighter future for communities and the planet​.” Building trust through transparency ​ Belcolade’s Cacao-Trace sustainable cocoa programme has been designed to produce the best quality cocoa – thanks to a highly specialised fermentation process – and to protect the environment and add social value to communities worldwide. Dumont said one of the core aims of Cacao-Trace is to answer directly to the need for a more sustainable and transparent cocoa supply chain. Technical support and coaching, delivered on the farms and in Cacao-Trace post-harvest centres, helps cocoa farmers diversify their income, increase their yields, and improve the quality of their beans. By working alongside them to further professionalise their farm management skills, Cacao-Trace empowers cocoa farmers to obtain a substantial quality premium in addition to the farmgate price and to manage their farms with greater autonomy. Furthermore, he commented that farmers are trained in environmental protection techniques, such as agroforestry, to bring more biodiversity, better climate resistance, and new sources of income to communities. The programme also strives to fight against the imbalance in profit-sharing throughout the value chain. It does this by guaranteeing a premium price and an extra Chocolate Bonus of 10-euro cent per kg of chocolate sold, which accounts for two to five additional months of revenue. The Chocolate Bonus proceeds go to the farmers to increase their living income or implement meaningful community projects, such as building schools health centers, and offering drinkable water equipment. A brighter future on the horizon ​ Since 2016, over €4.5 million ($4.78m) has been collected for Cacao-Trace cocoa farming communities in Cote d’Ivoire, Papua New Guinea, Vietnam, the Philippines, Mexico, Uganda, and Cameroon. The brand has also set its sights on a more ambitious future, with objectives including offering 100% sustainable cocoa by 2025, growing the Cacao-Trace community to 25,000 farmers by 2025, planting 3,440,000 trees by 2030, and reaching Living Income for all cocoa farmers by 2030. Achieving change – one carefully selected bean at a time​ As the Belgian Chocolate brand for professionals, Belcolade believes it has a responsibility to provide supply chain visibility, from harvesting to processing. Cacao-Trace cocoa is subject to a controlled separation process throughout the entire supply chain, which guarantees the physical traceability and governance of Cacao-Trace chocolate. “This high level of transparency benefits everyone. It helps to improve the lives of farmers, it means manufacturers can be confident in their claims, and it caters to consumers seeking sustainably sourced, superior-tasting chocolate​,” said Dumont. With the brand growing its global reach and branching out to make more factories carbon-neutral, Belcolade’s Cacao-Trace sustainable cocoa programme is on track to becoming the trusted and sustainable supply partner of choice for chocolate and patisserie professionals, Dumont confirmed.","filter_flag":1}
{"title":"Behind the Scenes: Experts Reveal All About Next-Gen Hydrogen Tech - Denso","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LmRlbnNvLmNvbS9nbG9iYWwvZW4vZHJpdmVuLWJhc2UvcHJvamVjdC9uZXdzcGlja3NfaHlkcm9nZW4zL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LmRlbnNvLmNvbS9nbG9iYWwvZW4vZHJpdmVuLWJhc2UvcHJvamVjdC9uZXdzcGlja3NfaHlkcm9nZW4zL9IBAA?oc=5","id":"CBMiSGh0dHBzOi8vd3d3LmRlbnNvLmNvbS9nbG9iYWwvZW4vZHJpdmVuLWJhc2UvcHJvamVjdC9uZXdzcGlja3NfaHlkcm9nZW4zL9IBAA","guidislink":false,"published":"Wed, 18 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=291, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LmRlbnNvLmNvbS9nbG9iYWwvZW4vZHJpdmVuLWJhc2UvcHJvamVjdC9uZXdzcGlja3NfaHlkcm9nZW4zL9IBAA?oc=5\" target=\"_blank\">Behind the Scenes: Experts Reveal All About Next-Gen Hydrogen Tech<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Denso<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Behind the Scenes: Experts Reveal All About Next-Gen Hydrogen Tech - Denso","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LmRlbnNvLmNvbS9nbG9iYWwvZW4vZHJpdmVuLWJhc2UvcHJvamVjdC9uZXdzcGlja3NfaHlkcm9nZW4zL9IBAA?oc=5\" target=\"_blank\">Behind the Scenes: Experts Reveal All About Next-Gen Hydrogen Tech<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Denso<\/font>","source.href":"https:\/\/www.denso.com","source.title":"Denso","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Recap: Why Hydrogen, Anyway? Before going any further, we recommend that those who missed the earlier parts of this series take a look at our “Let’s Talk Hydrogen” article for an overview of hydrogen energy and its characteristics. Hydrogen Energy 101: Experts Explain! Let's Talk Hydrogen In a nutshell, hydrogen (H₂) is unique in many ways. It does not emit any CO₂ when burnt, reacting chemically with oxygen (O₂) to produce only water (H₂O). The chemical reaction also releases energy so immense that it makes hydrogen a viable propellant for space rockets. Classed as secondary energy, hydrogen can be processed and converted from primary energy made from natural resources such as solar and wind, as well as fossil fuels like oil, natural gas, and coal. In addition to the characteristics detailed in the image above, hydrogen boasts advantages over electricity and heat, its counterparts in secondary energy. While the former can be stored in batteries, they are limited in terms of capacity. Heat, meanwhile, is hard to maintain over time. In contrast, hydrogen can be stored for long-term use: It can be pre-produced, stored (e.g. after conversion from electricity), and used exactly as, when, and where required. Hydrogen offers many benefits, but in reality, there are many challenges that still need to be addressed, including infrastructure development, cost, and the production process itself. In the case of the latter, the usage of fossil fuels, such as natural gas and coal, inevitably leads to the generation of CO₂. Hence, solutions must factor in raw materials, their potential emissions, and the overall process involved, with the three primary methods producing: “Grey” hydrogen – Made by deriving hydrogen from fossil fuels. “Blue” hydrogen – Made via methods that capture the CO₂ emitted in the production process, reducing atmospheric emissions. “Green” hydrogen – Made by electrolyzing water using power generated from renewable energy sources, such as solar and wind. Of the hydrogen produced worldwide today, 99% is grey hydrogen. As the world combats the climate crisis, the efficiency of producing green hydrogen becomes a vital component in building the foundation for a carbon-neutral society. Before achieving that, however, there first needs to be demand—in other words, more established applications for hydrogen. SOEC: Redefining Hydrogen Production with Electricity DENSO has delved deep into R&D for alternative methods of hydrogen production as well as potential use cases. Amid this process, the company has planted its flag in the field of SOEC technology, a process which produces green hydrogen. So, what exactly drives R&D efforts for hydrogen at DENSO? Shuzo Oda, who is leading the development of SOECs at the Hirose Plant, says: “Right now, the renewable energy required to produce green hydrogen is in limited supply. Costs are high, and in order to maximize the limited supply, we had to find ways to make the production process as efficient as possible.” Before going any further, we should provide a brief overview of how water electrolysis works. The basic definition can be described as the process of producing hydrogen and oxygen by passing electricity through water, with methods that include the use of alkaline solutions, polymer membranes, and ceramic membranes. DENSO’s Hirose Plant is currently testing SOEC with ceramic membranes. Oda:“Alkaline solutions and polymer membranes react at low temperatures of about 60°C. This leads to a shorter start-up time, making them ideal for operations that are either intermittent or fluctuating by nature. Polymer membranes, in particular, are suitable for factories that rely on fast and flexible responses to leverage surplus renewable energy. We use these membranes for our water electrolysis system at DENSO Fukushima, as hydrogen demand often fluctuates in its operations. Unlocking the Potential of Local Hydrogen: Fukushima's Quest In contrast, the SOEC is an electrolysis system featuring a ceramic cell stack placed inside a hot module. The electrolysis process is facilitated by supplying water vapor and electricity. SOEC technology uses ceramic membranes to sustain the required temperatures, which range from 600–800°C. While producing hydrogen this way entails a longer start-up time, its efficiency makes it suited for operations that are more stable by nature. The higher the temperature, the lower the voltage needed for the electrolysis process. As long as good ceramic materials with the right heat-resistant properties are used, we reduce energy consumption in hydrogen production, ensuring a stable output while expending less energy in the process.” In short, if more hydrogen can be produced with less electricity through SOECs, the reduction in manufacturing costs will boost its appeal for a variety of applications. Testing for potential applications of this technology is now underway at the Hirose Plant. From this current fiscal year, DENSO has initiated the use of hydrogen in the manufacturing process of power cards, a component used in power control units (PCU) to regulate the flow of current between the battery and electric motor of a hybrid vehicle. Masayuki Satake, currently leading DENSO’s in-house testing efforts, spoke with us about the benefits already seen in incorporating hydrogen into the production line. Satake:“We’re using green hydrogen in the reflow soldering process when manufacturing power cards. The process involves melting solder paste to attach electrical components heated in ovens to their respective contact pads. Here, hydrogen plays an important role, as it removes any impurities on the surface of the solder. Another advantage of using hydrogen is that the thermal conductivity it provides is seven times that of nitrogen, an atmosphere gas* we use in reflow soldering. The magnitude of its thermal conductivity lets us reach the temperature we need in shorter periods of time.” *Used to ensure proper soldering quality and prevent oxidation during the soldering process. DENSO has begun system tests using a prototype reflow oven, using it to manufacture power cards which are then evaluated in terms of quality and environmental safety. The company intends to scale up these tests to the factory level in FY2024, with eventual plans of boosting production line capabilities via full implementation. SOFC: A New Generation of Fuel Cells, Powered by Hydrogen Technology DENSO’s Nishio Plant has also been busy with its own pet project since May 2023, testing the potential applications of hydrogen energy. The project aims to assess and evaluate the operations of an energy management system, which features the use of in-house developed SOFCs and combines other energy sources, including solar panels and storage batteries. Masahiro Ishimaru, currently in charge of the project, explains: “We developed a system that controls the amount of energy generated and stored in SOFCs based on forecast data for the weather and factory energy requirements. This will help us build a more efficient and stable energy supply while ensuring we cut CO₂ emissions.” To provide more context, fuel cells generate electricity through a chemical reaction between fuels (including hydrogen) and oxygen. This process is not 100% efficient, however, as some energy is lost as heat in the process. The SOFCs used in DENSO’s energy management system step in to utilize this waste heat, enabling significant reductions in CO₂ emissions. To learn more about these special features of SOFCs, we spoke with Yuki Mukohara, who is currently involved in their development. Mukohara:“There are several types of fuel cells, depending on the material used. For example, PEFCs use electrolytes made from resin membranes. These membranes react at about 100°C, allowing for a short start-up time. On the other hand, SOFCs use ceramic-based electrolytes. Ceramic membranes react at about 700°C. While they require a longer start-up time, they are also able to convert fuel into energy more efficiently using high-temperature waste heat. Given these properties, we’re running tests to explore the feasibility of using the technology in applications where uninterrupted operations are key.” SOFC’s ability to operate at high temperatures also reveals a more overarching long-term benefit: its ability to contribute significantly to carbon neutrality. At present, city gas is the most widely used gaseous fuel. Heat is required to harvest hydrogen from the hydrocarbon fuels contained in city gas, and SOFCs can help achieve that by leveraging high internal temperatures to convert city gas to hydrogen efficiently. Mukohara:“While hydrogen is growing in prominence as a viable energy source, we’re still in a transition period. There are still cases in which it can’t fully replace fossil fuels, mostly because of cost factors and convenience. Having said that, if we can leverage SOFCs to generate hydrogen through fuels like city gas, we can expect to see a significant cut in CO₂ emissions in terms of power generation and a big contribution to decarbonization efforts over the long term.” Extending Hydrogen Technology’s Reach Across the Globe DENSO is on a mission to become the world’s first carbon neutral company, dedicated to fostering a more sustainable society. Its track record in mobility technology is underpinning its steady progress toward the establishment of a hydrogen-powered society, with its R&D initiatives in SOEC and SOFC providing a stepping stone to turn its mission into reality. Satake:“We want to formally introduce SOEC and SOFC to the rest of the world. But the first step toward that is to conduct in-house tests and integrate the technologies into our factory operations, establishing the technologies for both hydrogen production and application. When DENSO’s hydrogen technologies are used in a variety of fields and applications, we’ll be enabling Local Production for Local Consumption, where locally-produced hydrogen is consumed locally. If this model is adopted across Japan, we’ll have the infrastructure to build a hydrogen-powered society, bringing us closer to the goal of carbon neutrality.” DENSO’s vision extends far beyond Japan’s borders. Ishimaru, whose overseas tenure has spanned countries such as the UK and the US over a period of roughly 25 years, notes, “As a global company, DENSO has a part to play in using hydrogen technology to solve environmental issues, which are not limited to Japan. They concern the entire world. If we go back in time, the UK kickstarted the Industrial Revolution, a huge turning point for mankind that caused a complete shift in how we live and work. It also caused a new set of problems, mainly in the form of damaging the environment through an increase in CO₂ emissions. We, as a global society, are now facing the consequences of what began all that time ago. I believe it’s our responsibility as a company to do what we can to leverage our technology and bring us on track to a more sustainable future.” Forging the future with Japanese hydrogen technology. Armed with this passion and vision, DENSO continue their journey, one which may very well bring us closer to a truly carbon-neutral world. Writer: Yuka Tsukada Photographer: Toshiharu Takei Designer: Kirika Kosuzu Editor: Fumiya Kimiwada *This article is based on a Japanese article produced by NewsPicks Brand Design and published by DENSO with permission.","filter_flag":1}
{"title":"PhiusCon 2023 Heads to Houston, Texas | ProBuilder - Pro Builder","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL3V0b3BpYS9waGl1c2Nvbi0yMDIzLWhlYWRzLWhvdXN0b24tdGV4YXPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL3V0b3BpYS9waGl1c2Nvbi0yMDIzLWhlYWRzLWhvdXN0b24tdGV4YXPSAQA?oc=5","id":"CBMiQ2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL3V0b3BpYS9waGl1c2Nvbi0yMDIzLWhlYWRzLWhvdXN0b24tdGV4YXPSAQA","guidislink":false,"published":"Wed, 11 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=284, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL3V0b3BpYS9waGl1c2Nvbi0yMDIzLWhlYWRzLWhvdXN0b24tdGV4YXPSAQA?oc=5\" target=\"_blank\">PhiusCon 2023 Heads to Houston, Texas | ProBuilder<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"PhiusCon 2023 Heads to Houston, Texas | ProBuilder - Pro Builder","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL3V0b3BpYS9waGl1c2Nvbi0yMDIzLWhlYWRzLWhvdXN0b24tdGV4YXPSAQA?oc=5\" target=\"_blank\">PhiusCon 2023 Heads to Houston, Texas | ProBuilder<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","source.href":"https:\/\/www.probuilder.com","source.title":"Pro Builder","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"PhiusCon, the leading passive building conference for climate-specific zero energy design, construction, and building science, heads to Houston this November 7-10, 2023. Hosted by Phius, a non-profit organization committed to decarbonizing the built environment, the conference brings together building science experts, manufacturers, and attendees who all seek to learn about and reduce the impact of buildings as a contributing factor to climate change. Phius Certified buildings are uniquely designed for their environment with the grid in mind—providing energy independence and significantly less strain than traditional buildings. PhiusCon provides an introduction to the Phius community for building practitioners, policymakers, and students, equipping them with a blueprint to create more grid-friendly, resilient, healthy communities. Tickets to PhiusCon Houston are selling now. The conference recently announced its lineup of keynote speakers, intro courses, and sessions. PhiusCon 2023 Events Include: Tour Notable Phius-Certified Passive House Projects throughout the city and surrounding suburbs (tour tickets sold separately). These intentionally designed homes maintain internal temperatures for longer periods of time, even without electricity, have superb indoor air quality due to balanced ventilation and use 40-60% less energy than traditional buildings. throughout the city and surrounding suburbs (tour tickets sold separately). These intentionally designed homes maintain internal temperatures for longer periods of time, even without electricity, have superb indoor air quality due to balanced ventilation and use 40-60% less energy than traditional buildings. Texas Case Studies Session: Five experienced passive building practitioners will share their experiences working on projects around Texas, the growth of passive building and affordable passive building strategies in the state. Five experienced passive building practitioners will share their experiences working on projects around Texas, the growth of passive building and affordable passive building strategies in the state. Closing Keynote from Joseph Lstiburek, B.A.Sc., M.Eng., Ph.D., P.Eng. , the founding principal of Building Science Corporation and an ASHRAE Fellow called “the Sherlock Holmes of construction” by Fast Company. Internationally recognized, his work has influenced building codes and standards in every climate zone. , the founding principal of Building Science Corporation and an ASHRAE Fellow called “the Sherlock Holmes of construction” by Fast Company. Internationally recognized, his work has influenced building codes and standards in every climate zone. Ninth Annual Phius Design Competition displaying the most innovative, high-performance Phius-certified projects for attendees to explore. displaying the most innovative, high-performance Phius-certified projects for attendees to explore. “The Phuture” Led by Pioneer of Passive Building and Visionary, Katrin Klingenberg, Co-Founder & Executive Director of Phius about the future of architecture and manufacturing, professional practice and re-thinking project phase structure in high-performance design and construction about the future of architecture and manufacturing, professional practice and re-thinking project phase structure in high-performance design and construction Introductory Courses for Those New to Passive Building & Phius (admission sold separately): Phius 101 for Builders, Architects & Engineers, Potential Homeowners & the Curious Phius Project Certification Prep Course Carbon Accounting & Optimization 101 And more (admission sold separately): PhiusCon will allow attendees to learn how to reduce the impact of buildings as a contributing factor to climate change. Photo courtesy Phius Attendees will also have the opportunity to explore a large exhibit hall brimming with state-of-the-art technologies and systems from leading manufacturers in the high-performance building industry. Companies and organizations relevant to passive and zero-energy building will be on-site for exploration and learning. The Exhibit Hall will be open to the public for a preview the night before the conference (November 7 from 5:00 p.m. to 7:00 p.m.) at no cost, providing a unique opportunity to discover and learn for those interested in exploring Phius and passive building. PhiusCon attendees can also earn continuing education credit through AIA and Phius Professional CEUs. The event welcomes everyone interested in learning how buildings and homes are a path to mitigating and adapting to the effects of climate change. Registration is available HERE. About Phius Phius is a non-profit 501(c)(3) organization committed to decarbonizing the built environment by making high-performance passive building the mainstream market standard. We train and certify professionals, maintain and update the Phius climate-specific passive building standard, certify and quality assure passive buildings, certify high-performance building products and conduct research to advance high-performance building.","filter_flag":1}
{"title":"Safety, sustainability and security for Europe's mineral processing industry - Cordis News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vY29yZGlzLmV1cm9wYS5ldS9hcnRpY2xlL2lkLzQzNjM0Ny1zYWZldHktc3VzdGFpbmFiaWxpdHktYW5kLXNlY3VyaXR5LWZvci1ldXJvcGUtcy1taW5lcmFsLXByb2Nlc3NpbmctaW5kdXN0cnnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vY29yZGlzLmV1cm9wYS5ldS9hcnRpY2xlL2lkLzQzNjM0Ny1zYWZldHktc3VzdGFpbmFiaWxpdHktYW5kLXNlY3VyaXR5LWZvci1ldXJvcGUtcy1taW5lcmFsLXByb2Nlc3NpbmctaW5kdXN0cnnSAQA?oc=5","id":"CBMidmh0dHBzOi8vY29yZGlzLmV1cm9wYS5ldS9hcnRpY2xlL2lkLzQzNjM0Ny1zYWZldHktc3VzdGFpbmFiaWxpdHktYW5kLXNlY3VyaXR5LWZvci1ldXJvcGUtcy1taW5lcmFsLXByb2Nlc3NpbmctaW5kdXN0cnnSAQA","guidislink":false,"published":"Fri, 13 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=286, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vY29yZGlzLmV1cm9wYS5ldS9hcnRpY2xlL2lkLzQzNjM0Ny1zYWZldHktc3VzdGFpbmFiaWxpdHktYW5kLXNlY3VyaXR5LWZvci1ldXJvcGUtcy1taW5lcmFsLXByb2Nlc3NpbmctaW5kdXN0cnnSAQA?oc=5\" target=\"_blank\">Safety, sustainability and security for Europe's mineral processing industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cordis News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Safety, sustainability and security for Europe's mineral processing industry - Cordis News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vY29yZGlzLmV1cm9wYS5ldS9hcnRpY2xlL2lkLzQzNjM0Ny1zYWZldHktc3VzdGFpbmFiaWxpdHktYW5kLXNlY3VyaXR5LWZvci1ldXJvcGUtcy1taW5lcmFsLXByb2Nlc3NpbmctaW5kdXN0cnnSAQA?oc=5\" target=\"_blank\">Safety, sustainability and security for Europe's mineral processing industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cordis News<\/font>","source.href":"https:\/\/cordis.europa.eu","source.title":"Cordis News","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Safety, sustainability and security for Europe’s mineral processing industry Secure access to raw materials is central to Europe’s continued economic success. Growing demand and the vulnerability of supply chains to disruption have resulted in the European Commission creating a list of critical raw materials (CRMs) for the EU, which is subject to a regular review and update. Climate Change and Environment Industrial Technologies © senarce, Shutterstock CRMs cover all raw materials where they hold high importance to the EU economy and there is high risk associated with their supply. This Results Pack therefore showcases EU-funded projects spearheading research that will improve the processing of these raw materials and enhance its sustainability. The goal of the Critical Raw Materials Act proposed by the European Commission is to secure the EU’s future supply of CRMs required for technologies such as renewable energy and battery power, by supporting the EU’s self-reliance in mining, processing and recycling the 34 listed critical metals and minerals. These technologies play a pivotal role in Europe’s green transition, which is aimed at making Europe the first carbon-neutral continent by 2050, and will help to deliver the European Green Deal. Focus on EU research The 12 projects in this pack offer concrete technological solutions for mineral processing resulting from Horizon 2020 funded research and innovation projects, covering a wide range of CRMs. These include rare earth elements, which are necessary for high-tech consumer products like cellular telephones, computer hard drives, electric and hybrid vehicles, and flat screen monitors and televisions. The research also demonstrates how - by implementing technological innovation - these raw materials and side streams may be recovered and reused, instead of being discarded as waste. Achieving CRM security Contributing to the circular economy in the construction arena, NEMO has demonstrated the potential for using mine tailings in concrete products, as well as recovering additional metals from sulfidic residues. Aluminium production yields a vast amount of bauxite residue and the RemovAL project converted this into new products, including substrate for road construction and building aggregates. Many rare earth elements are reluctant to be separated from their rock deposits, so optimisation of the extraction model is key. The SecREEts project extracted rare earth elements from phosphate rocks used in fertiliser production. Making use of steel waste streams, CHROMIC removed chromium for use in the high-tech sector. New methods devised by the FineFuture project separate mineral particles as small as 20 µm so that they are not discarded. PLATIRUS has strived to enable the recovery of enough valuable platinum from mining and electronic waste to fill the supply gap up to 30 %, making Europe more competitive. One of the costliest elements on the market is scandium and its supply has been limited to imports from Asia and Russia. The SCALE project aimed to establish a closed supply chain for this valuable metal used in high-intensity lighting and 3D printing applications. CROCODILE produced a first-of-its kind commercial metallurgical system based on advanced hydrometallurgical and electrochemical technologies able to produce cobalt metal from different waste streams such as spent batteries and catalysts. SUSMAGPRO developed and tested industrial-scale technologies for extracting rare earth neodymium from discarded items containing permanent magnets. ION4RAW pioneered a more efficient and eco-friendly way of extracting CRMs like cobalt, germanium and platinum group metals as primary resources. SisAl Pilot replaced carbon-rich materials with secondary aluminium sources such as end-of-life scrap and production side streams in silicon production. TARANTULA aimed to recover refractory metals, tungsten, niobium and tantalum, a group of metallic elements that are highly resistant to heat and wear, from low-grade waste by developing a suite of cost-effective, scalable and eco-friendly metallurgical processes.","filter_flag":1}
{"title":"Matriark Foods Launches World's First Carbon Neutral, Shelf-Stable Meal for Food Banks, Addressing Hunger and ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMixAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hdHJpYXJrLWZvb2RzLWxhdW5jaGVzLXdvcmxkcy1maXJzdC1jYXJib24tbmV1dHJhbC1zaGVsZi1zdGFibGUtbWVhbC1mb3ItZm9vZC1iYW5rcy1hZGRyZXNzaW5nLWh1bmdlci1hbmQtaW5jcmVhc2luZy1hY2Nlc3MtdG8taGVhbHRoeS1mb29kLTMwMTk1OTkzNi5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMixAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hdHJpYXJrLWZvb2RzLWxhdW5jaGVzLXdvcmxkcy1maXJzdC1jYXJib24tbmV1dHJhbC1zaGVsZi1zdGFibGUtbWVhbC1mb3ItZm9vZC1iYW5rcy1hZGRyZXNzaW5nLWh1bmdlci1hbmQtaW5jcmVhc2luZy1hY2Nlc3MtdG8taGVhbHRoeS1mb29kLTMwMTk1OTkzNi5odG1s0gEA?oc=5","id":"CBMixAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hdHJpYXJrLWZvb2RzLWxhdW5jaGVzLXdvcmxkcy1maXJzdC1jYXJib24tbmV1dHJhbC1zaGVsZi1zdGFibGUtbWVhbC1mb3ItZm9vZC1iYW5rcy1hZGRyZXNzaW5nLWh1bmdlci1hbmQtaW5jcmVhc2luZy1hY2Nlc3MtdG8taGVhbHRoeS1mb29kLTMwMTk1OTkzNi5odG1s0gEA","guidislink":false,"published":"Wed, 18 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=291, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMixAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hdHJpYXJrLWZvb2RzLWxhdW5jaGVzLXdvcmxkcy1maXJzdC1jYXJib24tbmV1dHJhbC1zaGVsZi1zdGFibGUtbWVhbC1mb3ItZm9vZC1iYW5rcy1hZGRyZXNzaW5nLWh1bmdlci1hbmQtaW5jcmVhc2luZy1hY2Nlc3MtdG8taGVhbHRoeS1mb29kLTMwMTk1OTkzNi5odG1s0gEA?oc=5\" target=\"_blank\">Matriark Foods Launches World's First Carbon Neutral, Shelf-Stable Meal for Food Banks, Addressing Hunger and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Matriark Foods Launches World's First Carbon Neutral, Shelf-Stable Meal for Food Banks, Addressing Hunger and ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMixAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hdHJpYXJrLWZvb2RzLWxhdW5jaGVzLXdvcmxkcy1maXJzdC1jYXJib24tbmV1dHJhbC1zaGVsZi1zdGFibGUtbWVhbC1mb3ItZm9vZC1iYW5rcy1hZGRyZXNzaW5nLWh1bmdlci1hbmQtaW5jcmVhc2luZy1hY2Nlc3MtdG8taGVhbHRoeS1mb29kLTMwMTk1OTkzNi5odG1s0gEA?oc=5\" target=\"_blank\">Matriark Foods Launches World's First Carbon Neutral, Shelf-Stable Meal for Food Banks, Addressing Hunger and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"With support from Kroger Zero Hunger Zero Waste Foundation and Danone Communities, this new Vegetable Harvest Stew offers a solution to address environmental and social issues with the healthy calories of a full meal sourced from New York State Farms NEW YORK, Oct. 18, 2023 \/PRNewswire\/ -- Matriark Foods, an upcycled food company creating access to healthy food from excess produce, is introducing Matriark Vegetable Harvest Stew the world's first carbon neutral shelf-stable made with navy beans and vegetables sourced from farms in New York State, with Matriark's upcycled broth base. This national launch is the company's first foray into shelf-stable meal offerings. Matriark Foods Since the pandemic, there has been a 60% increase in meal purchases by food banks and food pantries. With the introduction of Vegetable Harvest Stew, Matriark Foods continues to scale access to healthy food for the benefit of people and the environment. Creating new revenue streams for farmers, Matriark transforms farm surplus into healthy vegetable products while reducing the environmental impacts of wasted food. Matriark offers an alternative solution to otherwise unhealthy food options commonly found in food banks, homeless shelters and emergency food settings while allowing emergency food providers to leverage their purchasing power toward climate-friendly food. The planet-friendly meal is being distributed by FeedMore WNY, one of the largest food banks in New York State delivering over 1.3 million meals per year. God's Love We Deliver, and Rethink Food, will also offer the product to their communities. Sourced directly from Headwater Food Hub's roster of over 200 small and mid-scale farms in New York State, the product creates additional revenue for US farmers, while keeping the majority of the product's supply chain within a 150-mile radius. Matriark worked with Headwater to source over 50% of ingredients grown on farms in New York, making the product also eligible for the Nourish New York program, a lifeline for food banks in New York State. With this regional farm-sourcing approach, Matriark continues its commitment to supply chain and ingredient transparency as well as its support for regional American farmers. About Matriark Foods A certified women-owned company, Matriark Foods is boldly changing food systems for the benefit of future generations. The company, founded by Anna Hammond in 2018, stands out for its commitments to upcycling farm surplus and fresh-cut remnants into healthy, delicious, vegetable-based products for foodservice and retail. Related Links Anna Hammond CEO Matriark Foods [email protected] This release was issued through WebWire®. For more information, visit http:\/\/www.webwire.com. SOURCE Matriark Foods","filter_flag":1}
{"title":"Fidelis New Energy Lauds Selection of ARCH2 as one of the National Hydrogen Hubs - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2ZpZGVsaXMtbmV3LWVuZXJneS1sYXVkcy1zZWxlY3Rpb24tb2YtYXJjaDItYXMtb25lLW9mLXRoZS1uYXRpb25hbC1oeWRyb2dlbi1odWJzLTMwMTk1NjYxNC5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2ZpZGVsaXMtbmV3LWVuZXJneS1sYXVkcy1zZWxlY3Rpb24tb2YtYXJjaDItYXMtb25lLW9mLXRoZS1uYXRpb25hbC1oeWRyb2dlbi1odWJzLTMwMTk1NjYxNC5odG1s0gEA?oc=5","id":"CBMiiAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2ZpZGVsaXMtbmV3LWVuZXJneS1sYXVkcy1zZWxlY3Rpb24tb2YtYXJjaDItYXMtb25lLW9mLXRoZS1uYXRpb25hbC1oeWRyb2dlbi1odWJzLTMwMTk1NjYxNC5odG1s0gEA","guidislink":false,"published":"Fri, 13 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=286, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2ZpZGVsaXMtbmV3LWVuZXJneS1sYXVkcy1zZWxlY3Rpb24tb2YtYXJjaDItYXMtb25lLW9mLXRoZS1uYXRpb25hbC1oeWRyb2dlbi1odWJzLTMwMTk1NjYxNC5odG1s0gEA?oc=5\" target=\"_blank\">Fidelis New Energy Lauds Selection of ARCH2 as one of the National Hydrogen Hubs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Fidelis New Energy Lauds Selection of ARCH2 as one of the National Hydrogen Hubs - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2ZpZGVsaXMtbmV3LWVuZXJneS1sYXVkcy1zZWxlY3Rpb24tb2YtYXJjaDItYXMtb25lLW9mLXRoZS1uYXRpb25hbC1oeWRyb2dlbi1odWJzLTMwMTk1NjYxNC5odG1s0gEA?oc=5\" target=\"_blank\">Fidelis New Energy Lauds Selection of ARCH2 as one of the National Hydrogen Hubs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"HOUSTON, Oct. 13, 2023 \/PRNewswire\/ -- Fidelis New Energy, a global leader in independent carbon management infrastructure focused on hard to abate industries and biogenic CO2, commends the selection of the Appalachian Regional Clean Hydrogen Hub (ARCH2) as one of the seven awarded clean hydrogen hubs by the United States Government through the Bipartisan Infrastructure Investment and Jobs Act. The hub is expected to receive up to $925M in federal funding, with up to $6B in matching private investment, creating up to 20,000 jobs. Rendering of the Mountaineer GigaSystem™ including Hyperscale Carbon Neutral Data Centers providing both production and consumption of lifecycle carbon neutral hydrogen (PRNewsfoto\/Fidelis New Energy, LLC) Rendering of the Monarch Cloud Campus which will use hydrogen produced using the FidelisH2® technologies with the H2PowerCool technology to provide power and cooling for data centers (PRNewsfoto\/Fidelis New Energy, LLC) A major participant in the ARCH2 hub, Fidelis is creating multiple projects in West Virginia centered around the production and consumption of clean hydrogen. First, the Mountaineer GigaSystem™ a net-zero carbon hydrogen project consisting of four phases where each phase will over 500 metric tons per day (\"MTPD\") at an approximate capital cost of $2 billion per phase. Fidelis is also using its proprietary H2PowerCool technologies to create the Monarch Cloud Campus, a data center complex powered by clean hydrogen from Mountaineer. Finally, the firm will use its CO2PowerGrow technologies to support high impact industrial greenhouses using CO2 emissions and waste heat from Monarch and Mountaineer. Bengt Jarlsjo, Co-Founder, President, and COO of Fidelis said, \"The collaboration, commitment and investment of the members and stakeholders of the ARCH2 consortium under Batelle's leadership proposed a compelling proposition for a regional hydrogen hub with direct benefits to West Virginia, Appalachia and the United States. I am very pleased the Department of Energy, recognized the merits of ARCH2 and its ability to deliver practical, prompt and efficient commercial lift off of a hydrogen hub and the associated energy transition jobs in the region.\" \"We are glad to have closed on the carbon sequestration operating agreement with the state of West Virginia which provides unique access to pore space making West Virginia a first mover in CCS. As one of the largest producers of hydrogen in the ARCH2 Hub, we hope to continue our partnership with the state and help make the Appalachia region a leader in the hydrogen economy,\" said Pete Hollis, Senior Vice President and Global Head of CCUS of Fidelis. Dan Shapiro, CEO and Co-Founder of Fidelis added, \"Fidelis is extremely appreciative of all the parties that helped make this possible including Senators Joe Manchin and Shelley Moore Capito for their support for bipartisan Infrastructure Investment and Jobs Act that enabled the hydrogen hub. Additionally, Senator Manchin's authorship and support for the Inflation Reduction Act (IRA) was crucial for the regulatory certainty that ensures the economic viability of clean hydrogen projects. Further we would like to thank our Advisory Board Member Major General James \"Jim\" Hoyer, Governor Jim Justice and his administration, the West Virginia Economic Development Authority and the Mason County Economic Development for helping make Mason County, West Virginia the home of the Mountaineer GigaSystem and Monarch Cloud Campus.\" About Fidelis New Energy Fidelis New Energy, LLC is an energy transition company driving decarbonization through investments in renewable fuels, low or negative carbon intensity products, and carbon capture and storage in Europe and the United States of America. Fidelis utilizes an \"all of the above\" energy philosophy with a focus on reducing carbon intensity by innovating new technologies through the integration of proven technologies. Fidelis New Energy is headquartered in Houston, Texas with offices in Baton Rouge, Louisiana and Copenhagen, Denmark. Fidelis also has a portfolio of patent pending technologies providing climate benefits through the innovative integration of proven technologies. To learn more about Fidelis and its technologies, including FidelisH2®, H2PowerCool™, and CO2PowerGrow™ please visit http:\/\/www.fidelisnewenergy.com\/ Or contact [email protected] SOURCE Fidelis New Energy, LLC","filter_flag":1}
{"title":"SANUK x Protect Our Winters Debut New Capsule Collection - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvc2FudWsteC1wcm90ZWN0LW91ci13aW50ZXJzLWRlYnV0LW5ldy1jYXBzdWxlLWNvbGxlY3Rpb24tMzAxOTU4NDAwLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvc2FudWsteC1wcm90ZWN0LW91ci13aW50ZXJzLWRlYnV0LW5ldy1jYXBzdWxlLWNvbGxlY3Rpb24tMzAxOTU4NDAwLmh0bWzSAQA?oc=5","id":"CBMicGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvc2FudWsteC1wcm90ZWN0LW91ci13aW50ZXJzLWRlYnV0LW5ldy1jYXBzdWxlLWNvbGxlY3Rpb24tMzAxOTU4NDAwLmh0bWzSAQA","guidislink":false,"published":"Tue, 17 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=290, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvc2FudWsteC1wcm90ZWN0LW91ci13aW50ZXJzLWRlYnV0LW5ldy1jYXBzdWxlLWNvbGxlY3Rpb24tMzAxOTU4NDAwLmh0bWzSAQA?oc=5\" target=\"_blank\">SANUK x Protect Our Winters Debut New Capsule Collection<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"SANUK x Protect Our Winters Debut New Capsule Collection - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvc2FudWsteC1wcm90ZWN0LW91ci13aW50ZXJzLWRlYnV0LW5ldy1jYXBzdWxlLWNvbGxlY3Rpb24tMzAxOTU4NDAwLmh0bWzSAQA?oc=5\" target=\"_blank\">SANUK x Protect Our Winters Debut New Capsule Collection<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"A Partnership to Help Protect Our Happy Places GOLETA, Calif., Oct. 17, 2023 \/PRNewswire\/ -- Sanuk®, a division of Deckers Brands (NYSE: DECK), has teamed up with Protect Our Winters (POW), a nonprofit environmental organization dedicated to the protection and enjoyment of the great outdoors. Sanuk and Protect Our Winters have launched a rad limited-edition footwear collection made with low-impact materials combined with offsets purchased for the small remaining emissions they create to make them carbon neutral. In addition to debuting the collaborative footwear collection, Sanuk has donated $25,000 in 2023 to help Protect Our Winters fight for climate policy changes that strive to create a positive, lasting impact on the health and preservation of our outdoor playgrounds. Sanuk x Protect Our Winters The collaboration was designed to be cozy and is made with a number of recycled materials, including recycled polyester and nylon. Sanuk has then offset the small remaining amount of greenhouse gas emissions these materials create, making the materials carbon neutral. The Sanuk x POW capsule collection features two puffy jacket-inspired all-gender styles that will elevate your cold-weather game to unseen heights. U Puffy Chiller Low SL x POW Northern Sunset: This slip-on is ultra comfy, featuring a high rebound Contoura ® insole, podiatrist-designed arch support with 100% recycled polyester lining and a lightweight midsole made from sugarcane EVA. The shoe's upper is treated with a PFC free water repellency finish, making these the perfect kicks for winter adventures. Additional materials include a recycled polyester upper, durable mudguard and heel counter that kicks down for easy on and off and finished with a rubber sawtooth outsole for increased traction and style. This slip-on is ultra comfy, featuring a high rebound Contoura insole, podiatrist-designed arch support with 100% recycled polyester lining and a lightweight midsole made from sugarcane EVA. The shoe's upper is treated with a PFC free water repellency finish, making these the perfect kicks for winter adventures. Additional materials include a recycled polyester upper, durable mudguard and heel counter that kicks down for easy on and off and finished with a rubber sawtooth outsole for increased traction and style. U Puffy Chiller Mid SL x POW Dark Frost: Look good and feel great in this cozy winter boot, featuring a durable, weather-protected upper treated with a PFC free water repellency finish and lined with puffy insulation. Comfy details include a podiatrist-designed arch support and a high rebound Contoura® insole and dynamic heel cup, along with a midsole made from sugarcane EVA. Crafted with the elements in mind, this boot includes a 100% recycled polyester mudguard and heel counter, recycled polyester collar gusset, a rubber sawtooth outsole and elastic laces with toggle closure for maximum adjustability. \"Sanuk is proud to partner with Protect Our Winters to bring awareness and education to our consumer base,\" said Katie Pruitt, Brand Director at Sanuk. \"Protect Our Winters is leading the charge in climate change advocacy on behalf of those that enjoy the outdoors the most, working tirelessly to bring about policy change to benefit our happy places. Our core sustainability initiatives and their mission go hand in hand and we are honored to bring this collaboration collection to life.\" The synergy of Sanuk and POW goes beyond commitment to the environment. Both organizations partner with professional athletes Danny Davis and Michelle Parker, who passionately advocate for climate change policy and amplify these sentiments in their social channels. Davis is a legendary professional snowboarder, known for his style, creativity and versatility in competitions ranging from The X Games to The Winter Olympics. Parker is a leading global outdoor athlete, activist and acclaimed big mountain free skier. \"We are excited to welcome Danny Davis and Michelle Parker as the most recent additions to our ambassador team. Both Danny and Michelle share our principles and embody the Sanuk lifestyle. We couldn't be more proud to be partnering with them and Protect Our Winters,\" said Pruitt. This collaboration with Protect Our Winters reiterates Sanuk's commitment to sustainability. Sanuk continues to collaborate with organizations such as Protect Our Winters to inspire environmental protection and provide educational content to encourage others to join the movement. \"Sanuk was one of the first brands I noticed that made products while keeping the health of the planet in mind and POW was my introduction to advocating to protect the planet,\" said Danny Davis, athlete ambassador for Sanuk and Protect Our Winters. \"The partnership between these two really puts meaning behind the phrase 'products with purpose.'\" The collaboration collection launches today on Sanuk.com and with select retail partners for $85-100. For more information about the Sanuk x POW collection, visit Sanuk.com\/POW or follow along on Instagram @sanuk #smileon and @protectourwinters. About Protect Our Winters (POW) Protect Our Winters is a 501(c)(3) nonprofit that helps passionate outdoor people protect the places and lifestyles they love from climate change. Founded in 2007 by professional snowboarder Jeremy Jones, POW is a community of athletes, scientists, creatives and business leaders advancing non-partisan policies that protect our world today and for future generations. For more information, visit www.protectourwinters.org. About SANUK® Welcome to the never-ending party for your feet. Founded in 1997, Sanuk is an unconventional footwear brand on a mission to keep you comfy, protect our happy places and cultivate community. Sanuk is the Thai word for \"fun,\" so we infuse fun into everything we do. For more information about Sanuk, a division of Deckers Brands, visit sanuk.com or follow @sanuk on Instagram and Facebook. #SmileOn About Deckers Brands Deckers Brands is a global leader in designing, marketing and distributing innovative footwear, apparel and accessories developed for both everyday casual lifestyle use and high-performance activities. The Company's portfolio of brands includes UGG®, Koolaburra®, HOKA®, Teva® and Sanuk®. Deckers Brands products are sold in more than 50 countries and territories through select department and specialty stores, Company-owned and operated retail stores, and select online stores, including Company-owned websites. Deckers Brands has 50 years of history building niche footwear brands into lifestyle market leaders attracting millions of loyal consumers globally. For more information, please visit www.deckers.com. Media Contact: Madison Kaplan, Crowe PR [email protected] (619) 794-0114, ext. 723 SOURCE Sanuk","filter_flag":1}
{"title":"Novelis partners with Southern Company in pursuit of decarbonization goals - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25vdmVsaXMtcGFydG5lcnMtd2l0aC1zb3V0aGVybi1jb21wYW55LWluLXB1cnN1aXQtb2YtZGVjYXJib25pemF0aW9uLWdvYWxzLTMwMTk1MTA4Mi5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25vdmVsaXMtcGFydG5lcnMtd2l0aC1zb3V0aGVybi1jb21wYW55LWluLXB1cnN1aXQtb2YtZGVjYXJib25pemF0aW9uLWdvYWxzLTMwMTk1MTA4Mi5odG1s0gEA?oc=5","id":"CBMiggFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25vdmVsaXMtcGFydG5lcnMtd2l0aC1zb3V0aGVybi1jb21wYW55LWluLXB1cnN1aXQtb2YtZGVjYXJib25pemF0aW9uLWdvYWxzLTMwMTk1MTA4Mi5odG1s0gEA","guidislink":false,"published":"Mon, 09 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=282, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25vdmVsaXMtcGFydG5lcnMtd2l0aC1zb3V0aGVybi1jb21wYW55LWluLXB1cnN1aXQtb2YtZGVjYXJib25pemF0aW9uLWdvYWxzLTMwMTk1MTA4Mi5odG1s0gEA?oc=5\" target=\"_blank\">Novelis partners with Southern Company in pursuit of decarbonization goals<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Novelis partners with Southern Company in pursuit of decarbonization goals - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25vdmVsaXMtcGFydG5lcnMtd2l0aC1zb3V0aGVybi1jb21wYW55LWluLXB1cnN1aXQtb2YtZGVjYXJib25pemF0aW9uLWdvYWxzLTMwMTk1MTA4Mi5odG1s0gEA?oc=5\" target=\"_blank\">Novelis partners with Southern Company in pursuit of decarbonization goals<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"ATLANTA, Oct. 9, 2023 \/PRNewswire\/ -- Novelis Inc., a leading sustainable aluminum solutions provider and world leader in aluminum rolling and recycling, and Southern Company, have announced plans to partner on decarbonization efforts. Their initial focus is on Novelis' new Bay Minette, Alabama, plant, which aims to be carbon neutral for scope 1 and 2 greenhouse gas emissions. The recycling and rolling plant is currently under construction to help meet the growing demand for more sustainable beverage packaging and will support the automotive industry in North America, including the increase in electric vehicle production. Novelis Inc., a leading sustainable aluminum solutions provider and world leader in aluminum rolling and recycling, and Southern Company, have announced plans to partner on decarbonization efforts. Novelis will work with Southern Company subsidiary Alabama Power to provide the Bay Minette project with renewable energy to reduce its scope 2 greenhouse gas emissions. By participating in Alabama Power's Renewable Subscription Program, Novelis will directly support the creation of two, new 80-megawatt solar power generation plants in Alabama that will cover over half of the Bay Minette facility's renewable energy needs while avoiding 192 kilotons of CO2 emissions per year. Novelis and Southern Company will also collaborate to advance new technologies to reduce Novelis' Scope 1 carbon emissions, including hydrogen fuels, carbon capture, energy storage and electrification of thermal processes. Through their corporate venture and R&D teams, Novelis and Southern Company are exploring projects for the Bay Minette facility, as well as other Novelis sites in North America. \"At Novelis, we believe that strong partnerships like this are critical to advancing our commitment to the environment, the economy and the communities in which we operate,\" said Suzanne Lindsay-Walker, Novelis' Vice President of Sustainability. \"Partnering with Southern Company and Alabama Power on renewable energy solutions, such as solar power, and exploring new technologies for carbon reduction will help us as we seek to meet our goals to reduce carbon emissions by 30% by 2026 and be carbon neutral by 2050 or sooner.\" \"The future of clean energy depends on unlocking these types of partnerships,\" said Chris Cummiskey, Executive Vice President and Chief Commercial and Customer Solutions Officer for Southern Company Services. \"Whether it's with new or existing companies, finding ways for Novelis and Southern Company to mutually identify and test innovative technologies will be key to advancing the availability of renewable power and reaching our respective decarbonization goals.\" About Novelis Novelis Inc. is driven by its purpose of shaping a sustainable world together. We are a global leader in the production of innovative aluminum products and solutions and the world's largest recycler of aluminum. Our ambition is to be the leading provider of low-carbon, sustainable aluminum solutions and to achieve a fully circular economy by partnering with our suppliers, as well as our customers in the aerospace, automotive, beverage can and specialties industries throughout North America, Europe, Asia and South America. Novelis had net sales of $18.5 billion in fiscal year 2023. Novelis is a subsidiary of Hindalco Industries Limited, an industry leader in aluminum and copper, and the metals flagship company of the Aditya Birla Group, a multinational conglomerate based in Mumbai. For more information, visit novelis.com. About Southern Company Southern Company (NYSE: SO) is a leading energy provider serving 9 million residential and commercial customers across the Southeast and beyond through its family of companies. Providing clean, safe, reliable and affordable energy with excellent service is our mission. The company has electric operating companies in three states, natural gas distribution companies in four states, a competitive generation company, a leading distributed energy distribution company with national capabilities, a fiber optics network and telecommunications services. Through an industry-leading commitment to innovation, resilience and sustainability, we are taking action to meet customers' and communities' needs while advancing our goal of net zero greenhouse gas emissions by 2050. Our uncompromising values ensure we put the needs of those we serve at the center of everything we do and are the key to our sustained success. We are transforming energy into economic, environmental and social progress for tomorrow. Our corporate culture and hiring practices have earned the company national awards and recognition from numerous organizations, including Forbes, The Military Times, DiversityInc, Black Enterprise, J.D. Power, Fortune, Human Rights Campaign and more. To learn more, visit www.southerncompany.com . Forward-Looking Statements Statements made in this news release that describe Novelis' intentions, expectations or predictions may be forward-looking statements within the meaning of securities laws. Examples of forward-looking statements in this news release include goals to reduce carbon emissions by 30% by 2026 and be carbon neutral by 2050 or sooner. Novelis cautions that, by their nature, forward-looking statements involve risk and uncertainty. We do not intend, and we disclaim any obligation, to update any forward-looking statements, whether as a result of new information, future events or otherwise. Important risk factors which could impact outcomes are included under the caption \"Risk Factors\" in the company's Form 10-K filed with the Securities and Exchange Commission for the fiscal year ended March 31, 2023. SOURCE Novelis Inc.","filter_flag":1}
{"title":"Garden of Life® Leads the Way in Clean, Science-Based Formulas With New Line of Vitamin Code Gummies - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dhcmRlbi1vZi1saWZlLWxlYWRzLXRoZS13YXktaW4tY2xlYW4tc2NpZW5jZS1iYXNlZC1mb3JtdWxhcy13aXRoLW5ldy1saW5lLW9mLXZpdGFtaW4tY29kZS1ndW1taWVzLTMwMTk1ODMyNy5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dhcmRlbi1vZi1saWZlLWxlYWRzLXRoZS13YXktaW4tY2xlYW4tc2NpZW5jZS1iYXNlZC1mb3JtdWxhcy13aXRoLW5ldy1saW5lLW9mLXZpdGFtaW4tY29kZS1ndW1taWVzLTMwMTk1ODMyNy5odG1s0gEA?oc=5","id":"CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dhcmRlbi1vZi1saWZlLWxlYWRzLXRoZS13YXktaW4tY2xlYW4tc2NpZW5jZS1iYXNlZC1mb3JtdWxhcy13aXRoLW5ldy1saW5lLW9mLXZpdGFtaW4tY29kZS1ndW1taWVzLTMwMTk1ODMyNy5odG1s0gEA","guidislink":false,"published":"Tue, 17 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=290, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dhcmRlbi1vZi1saWZlLWxlYWRzLXRoZS13YXktaW4tY2xlYW4tc2NpZW5jZS1iYXNlZC1mb3JtdWxhcy13aXRoLW5ldy1saW5lLW9mLXZpdGFtaW4tY29kZS1ndW1taWVzLTMwMTk1ODMyNy5odG1s0gEA?oc=5\" target=\"_blank\">Garden of Life® Leads the Way in Clean, Science-Based Formulas With New Line of Vitamin Code Gummies<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Garden of Life® Leads the Way in Clean, Science-Based Formulas With New Line of Vitamin Code Gummies - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dhcmRlbi1vZi1saWZlLWxlYWRzLXRoZS13YXktaW4tY2xlYW4tc2NpZW5jZS1iYXNlZC1mb3JtdWxhcy13aXRoLW5ldy1saW5lLW9mLXZpdGFtaW4tY29kZS1ndW1taWVzLTMwMTk1ODMyNy5odG1s0gEA?oc=5\" target=\"_blank\">Garden of Life® Leads the Way in Clean, Science-Based Formulas With New Line of Vitamin Code Gummies<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"The brand introduces more formulations made with traceable whole foods PALM BEACH GARDENS, Fla., Oct. 17, 2023 \/PRNewswire\/ -- Garden of Life®, the carbon-neutral leader in science-based formulas made from clean, traceable, non-GMO ingredients, introduced a new gummy extension to its popular Vitamin Code line, with seven products formulated to fit any need. Similar to the rest of the Vitamin Code line, the gummies deliver vitamins and minerals in a whole food base of raw fruits and vegetables, and contain probiotics and enzymes, all of which are staple ingredients to the Vitamin Code collection. Credit Garden of Life \"With its raw formulas, our Vitamin Code line is a fan favorite for a reason,\" said Mandy McCarthy, general manager of Garden of Life. \"Our new gummies make it even easier – and more delicious – to add clean, whole-food-based nutrition to your day.\" Committed to high quality and integrity, the new line of vitamins is NSF Certified Gluten Free, Non-GMO Project Verified, certified kosher and made without dairy, soy, gluten, nuts or stevia ingredients. The gummies are also lower in sugar, with no sugar added in select formulas. The full line includes: Men's Multi : Whole food nutrition formulated for men's unique needs, including support for heart and prostate health. † : Whole food nutrition formulated for men's unique needs, including support for heart and prostate health. Women's Multi + Iron : Designed for holistic women's health, the formula helps support reproductive, breast and heart health, with an extra boost of gentle iron. † (coming soon!) : Designed for holistic women's health, the formula helps support reproductive, breast and heart health, with an extra boost of gentle iron. (coming soon!) Prenatal Multi with Iron & Folate : The perfect support for those expecting, with an easy-to-digest formula designed to support healthy neural tube development. † : The perfect support for those expecting, with an easy-to-digest formula designed to support healthy neural tube development. Kids Multi with Iron : Designed for growing bodies, this kid's multivitamin helps support the immune system and developing bones, all with an extra boost of gentle iron. † : Designed for growing bodies, this kid's multivitamin helps support the immune system and developing bones, all with an extra boost of gentle iron. Calcium & Magnesium : With 100mg of calcium per gummy, this vitamin is specifically formulated to support the health and strength of bones. † : With 100mg of calcium per gummy, this vitamin is specifically formulated to support the health and strength of bones. Vitamins D3 & K2 : This no-sugar formula combines the strength of both vitamins D3 and K2 to help support immune, bone and digestive health. † : This no-sugar formula combines the strength of both vitamins D3 and K2 to help support immune, bone and digestive health. CoQ10: For those looking for a tasty twist on heart health, this CoQ10 vitamin aims to support energy production, healthy aging and digestive health.† The Vitamin Code Gummies are now available to purchase online and at major retailers nationwide. To learn more, visit gardenoflife.com . ABOUT GARDEN OF LIFE Garden of Life, a Nestlé Health Science brand, is today's recognized leader and innovator in carbon-neutral-certified, whole food, Certified USDA Organic and Non-GMO Project Verified nutrition. Headquartered in Palm Beach Gardens, Florida, we offer more than 400 time-tested supplements by leading scientists – all to Empower Extraordinary Health®. Whether we're making a vitamin or a probiotic or a protein powder, we always start with fresh, real, whole foods that are traceable back to the seed. From there, these foods provide our formulas that give people of all ages the power to be their best. Visit gardenoflife.com to learn more. †These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease. ABOUT NESTLÉ HEALTH SCIENCE Nestlé Health Science, a leader in the science of nutrition, is a globally managed business unit of Nestlé. We are committed to redefining the management of health, offering an extensive portfolio of science-based consumer health, medical nutrition, pharmaceutical therapies, and vitamin and supplement brands. Our extensive research network provides the foundation for products that empower healthier lives through nutrition. Headquartered in Switzerland, we have more than 12,000 employees around the world, with products available in more than 140 countries. To learn more, visit: www.nestlehealthscience.com. CONTACT: Daniela Hermoza [email protected] SOURCE Garden of Life","filter_flag":1}
{"title":"Plastic Recycling Industry at Crossroads: Uncertainty and Shrinking Demand Shifts - RecyclingPortal","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiKGh0dHBzOi8vcmVjeWNsaW5ncG9ydGFsLmV1L0FyY2hpdmUvODE1NTfSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiKGh0dHBzOi8vcmVjeWNsaW5ncG9ydGFsLmV1L0FyY2hpdmUvODE1NTfSAQA?oc=5","id":"CBMiKGh0dHBzOi8vcmVjeWNsaW5ncG9ydGFsLmV1L0FyY2hpdmUvODE1NTfSAQA","guidislink":false,"published":"Fri, 13 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=286, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiKGh0dHBzOi8vcmVjeWNsaW5ncG9ydGFsLmV1L0FyY2hpdmUvODE1NTfSAQA?oc=5\" target=\"_blank\">Plastic Recycling Industry at Crossroads: Uncertainty and Shrinking Demand Shifts<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RecyclingPortal<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Plastic Recycling Industry at Crossroads: Uncertainty and Shrinking Demand Shifts - RecyclingPortal","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiKGh0dHBzOi8vcmVjeWNsaW5ncG9ydGFsLmV1L0FyY2hpdmUvODE1NTfSAQA?oc=5\" target=\"_blank\">Plastic Recycling Industry at Crossroads: Uncertainty and Shrinking Demand Shifts<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RecyclingPortal<\/font>","source.href":"https:\/\/recyclingportal.eu","source.title":"RecyclingPortal","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"The European plastic recycling industry is facing pressing challenges as the demand for recycled polymers dwindles to its lowest point in recent years. The lack of manufactures’ commitment to introduce recycled material in new products and the growing imports from third countries are the main obstacles to the circularity of European plastic waste and to the development of the European recycling industry. On top of that, like numerous other industries, the recycling sector is not immune to the surrounding economic uncertainties and the ongoing inflation crisis. Hence, decisive, and bold policy measures are required to support one of Europe’s key industries for transitioning to a circular and carbon-neutral economy. Setting mandatory recycled content targets has proven to be an effective and valuable tool to boost the uptake of recycled materials and increase the recycling capacities in Europe. Indeed, the recycling capacity witnessed a 17% growth in 2021 only in EU27+3 [1] and almost doubled over a 5-year period, with substantial investments and innovation accelerating in the sector. However, for the potential benefits of the recycled content mandate to materialize fully, it must be accompanied by robust mechanisms ensuring traceability, accurate accounting, and rigorous verification of recycled polymers. “Recycling companies across Europe are investing in new equipment to both upgrade the recyclates and increase the recycling capacities. Our industry is taking its full share of the effort to the transition towards more circular and carbon-neutral plastic value chains. However, European plastic recyclers are currently operating well below their full capacity due to insufficient demand. This situation questions investments made by European recyclers to meet carbon-neutrality and circularity targets, as well as it questions recycler’s future ability to invest more” commented Sophie Sicard, President of EPRB, EuRIC’s Plastics Recycling Branch. EuRIC calls for urgent measures to support plastics recycling in Europe: Implementation of pragmatic mandatory EU recycled content targets for plastics to stimulate demand for recycled materials and secure investments to scale up recycling capacity in Europe. Strong mechanisms for verification and traceability of recycled polymers, to protect the European recycling industry from unfair competition and fraudulent import. When quantifying recycled plastic content, mandatory third-party certifications are needed to preserve the transparency and credibility of the industry. Introduction of incentives, whether market or tax-based, to bridge the price gap between virgin and recycled plastics. For instance, fiscal incentives in the form of lower VAT rates for products made of recycled plastics can have a significant impact on stimulating recycling. Mandatory collection targets and design-for-recycling criteria to enhance the quantity and quality of inputs to recycling processes. The European plastic recycling industry faces a defining moment; either we recycle the challenges into opportunities or let our future go to waste. It’s time to repackage commitment, shape bold policies, and recycle our way to a circular, carbon-neutral era. Source: EuRIC [1] EU27+3: European Union Member States, Norway, Switzerland, and United Kingdom","filter_flag":1}
{"title":"Scientific study finds remanufactured laptops produce only 6.34% of CO2 emissions in comparison to new ... - TECHNOLOGY RESELLER","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3RlY2hub2xvZ3lyZXNlbGxlci51ay9zY2llbnRpZmljLXN0dWR5LWZpbmRzLXJlbWFudWZhY3R1cmVkLWxhcHRvcHMtcHJvZHVjZS1vbmx5LTYtMzQtb2YtY28yLWVtaXNzaW9ucy1pbi1jb21wYXJpc29uLXRvLW5ldy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3RlY2hub2xvZ3lyZXNlbGxlci51ay9zY2llbnRpZmljLXN0dWR5LWZpbmRzLXJlbWFudWZhY3R1cmVkLWxhcHRvcHMtcHJvZHVjZS1vbmx5LTYtMzQtb2YtY28yLWVtaXNzaW9ucy1pbi1jb21wYXJpc29uLXRvLW5ldy_SAQA?oc=5","id":"CBMihAFodHRwczovL3RlY2hub2xvZ3lyZXNlbGxlci51ay9zY2llbnRpZmljLXN0dWR5LWZpbmRzLXJlbWFudWZhY3R1cmVkLWxhcHRvcHMtcHJvZHVjZS1vbmx5LTYtMzQtb2YtY28yLWVtaXNzaW9ucy1pbi1jb21wYXJpc29uLXRvLW5ldy_SAQA","guidislink":false,"published":"Tue, 24 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=24, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=297, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3RlY2hub2xvZ3lyZXNlbGxlci51ay9zY2llbnRpZmljLXN0dWR5LWZpbmRzLXJlbWFudWZhY3R1cmVkLWxhcHRvcHMtcHJvZHVjZS1vbmx5LTYtMzQtb2YtY28yLWVtaXNzaW9ucy1pbi1jb21wYXJpc29uLXRvLW5ldy_SAQA?oc=5\" target=\"_blank\">Scientific study finds remanufactured laptops produce only 6.34% of CO2 emissions in comparison to new ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TECHNOLOGY RESELLER<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Scientific study finds remanufactured laptops produce only 6.34% of CO2 emissions in comparison to new ... - TECHNOLOGY RESELLER","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3RlY2hub2xvZ3lyZXNlbGxlci51ay9zY2llbnRpZmljLXN0dWR5LWZpbmRzLXJlbWFudWZhY3R1cmVkLWxhcHRvcHMtcHJvZHVjZS1vbmx5LTYtMzQtb2YtY28yLWVtaXNzaW9ucy1pbi1jb21wYXJpc29uLXRvLW5ldy_SAQA?oc=5\" target=\"_blank\">Scientific study finds remanufactured laptops produce only 6.34% of CO2 emissions in comparison to new ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TECHNOLOGY RESELLER<\/font>","source.href":"https:\/\/technologyreseller.uk","source.title":"TECHNOLOGY RESELLER","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Scientific study finds remanufactured laptops produce only 6.34% of CO2 emissions in comparison to new The peer-reviewed study analysed Circular Computing’s process of remanufacturing and its associated emissions, proving the environmental superiority of the Circular Remanufacturing Process The study comes as the growing mountain of e-waste and global climate concerns raise sustainability questions of the IT industry A peer-reviewed scientific study by Cranfield University has found that remanufactured laptops produce over 15 times less CO2 compared with an average new laptop. The study by Cranfield University assessed the sustainability of remanufacturing by comparing the carbon emissions created through Circular Computing’s remanufactured laptops, in comparison to brand new. It found that remanufactured laptops produce only 6.34% of the CO2 emissions against new products, highlighting the sustainable benefits of buying into the tech circular economy, in addition to the huge impact it can have on reducing the electronic waste (e-waste) crisis. This means that for every Circular Computing remanufactured laptop, approximately 316kg (700lb) of CO2 emissions are prevented by not buying new. For just 1,000 laptops, that is the same as taking 80 cars off the road for a year. Over recent years, e-waste accumulation has been on a steep rise, parallel with the technological evolution of electrical and electronic equipment. Companies such as Circular Computing have adopted a remanufacturing approach built in the circular economy to help overcome the emerging waste issue in the last couple of decades, where goods can return to manufacturers or remanufacturers and be re-used. According to the Global E-Waste Monitor report, the global level of e-waste increased from 41.8 MT in 2014 to 53.6 MT in 2022, which is then predicted to reach 74.7 MT by 2030. The authors of the study, Cranfield University, identified that the fast evolution speed and short lifetime of current electronics are rapidly contributing causes to the growing mountains of e-waste. Circular Computing’s Circular Remanufacturing Process is the only one in the world to have been awarded a BSI Kitemark, which attests that the products are “equal to or better than new”. Remanufacturing has therefore emerged as the viable alternative to new when it comes to changing the outdated habits of ‘take, make and replace’ in the tech industry. The study defines Remanufacturing as ‘a form of product recovery that allows an item like a laptop to be reused without being totally broken down and changed into something else’. When going through the remanufacturing process, 99% of existing technology is re-used in the process, with the remaining 1% being recycled to be used as pallets for transportation. “Professor Mark Jolly, Director of Manufacturing and Materials, Cranfield University, comments: “For those in the manufacturing sector, finding ways to create products, and thereby extending the useful life of the materials used, while not harming the planet, has been an ever-growing challenge. With e-waste being one of the many accumulating waste streams from the past few decades, finding solutions to address this is necessary in a climate emergency. The findings from our study show that Circular Computing’s revolutionary remanufacturing process is an important step in the right direction in tackling this issue once and for all.” Steve Haskew, Head of Sustainability and Social Leadership at Circular Computing, adds: “This peer-reviewed scientific study by Cranfield University illustrates the profound impact that remanufacturing can have when it comes to reducing CO2 emissions in the technology industry. In an age of increased environmental consciousness and the growing issue of e-waste, finding a way to re-use the vast amounts of electronic products in existence should be a key task for the industry. “We believe that remanufacturing is the only solution to this problem to tackle the environmental issues while still ensuring a high performance, good as new end product. Studies like this one by Cranfield University will hopefully start to make a clear impression on the minds of IT leaders to reconsider their approach to purchasing technology”. Circular Computing is on a mission to create a more ethical, sustainable, and socially responsible way to buy enterprise grade IT. While already offering a carbon neutral plus product, the Cranfield University study also identified further ways that the process could be made even more sustainable. Following the study, Circular Computing will be analysing its processes for transportation, use of renewable energy and packing\/recycling of packaging to ensure every stage of the remanufacturing journey is as sustainable as possible, remaining rooted in the circular economy. About Circular Computing™ Circular Computing™ is the global leader in the remanufacturing of laptops, on a mission to create a more ethical, sustainable, and socially responsible way to buy enterprise grade IT. Operating from its state-of-the-art remanufacturing facility, Circular Computing has the world’s first and only BSI Kitemark™ for remanufactured laptops, certifying that it produces products’ equal to or better than new’ as required by the BS standard 8887. Through its 360-point stage Circular Remanufacturing Process, Circular Computing delivers HP, Dell and Lenovo laptops that look and perform like new, all whilst ensuring carbon-neutral processes and end-product. Circular Computing’s remanufacturing process delivers the innovative alternative to ‘new’, going above and beyond a cosmetically improved finish to ensure an intense focus on performance and reliability. Through its support of worldwide sustainability projects, every Circular Computing™ laptop is also a certified carbon neutral product. Please visit: www.circularcomputing.com About Cranfield University As a specialist postgraduate university, Cranfield’s world-class expertise, large-scale facilities and unrivalled industry partnerships are creating leaders in technology and management globally. Cranfield work in partnership with business, academia, governments and other organisations to develop and deliver applied research and innovative education in science, technology, engineering, and management. Please follow and like us: Author Neil Trim Publishing Director of Kingswood Media Ltd","filter_flag":1}
{"title":"Comexi launches F2 Origin flexo press - Labels and Labeling","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL2V1cm9wZS9uZXdzL2NvbnZlbnRpb25hbC1wcmludGluZy9jb21leGktbGF1bmNoZXMtZjItb3JpZ2luLWZsZXhvLXByZXNz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL2V1cm9wZS9uZXdzL2NvbnZlbnRpb25hbC1wcmludGluZy9jb21leGktbGF1bmNoZXMtZjItb3JpZ2luLWZsZXhvLXByZXNz0gEA?oc=5","id":"CBMiaGh0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL2V1cm9wZS9uZXdzL2NvbnZlbnRpb25hbC1wcmludGluZy9jb21leGktbGF1bmNoZXMtZjItb3JpZ2luLWZsZXhvLXByZXNz0gEA","guidislink":false,"published":"Thu, 05 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=278, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL2V1cm9wZS9uZXdzL2NvbnZlbnRpb25hbC1wcmludGluZy9jb21leGktbGF1bmNoZXMtZjItb3JpZ2luLWZsZXhvLXByZXNz0gEA?oc=5\" target=\"_blank\">Comexi launches F2 Origin flexo press<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Labels and Labeling<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Comexi launches F2 Origin flexo press - Labels and Labeling","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL2V1cm9wZS9uZXdzL2NvbnZlbnRpb25hbC1wcmludGluZy9jb21leGktbGF1bmNoZXMtZjItb3JpZ2luLWZsZXhvLXByZXNz0gEA?oc=5\" target=\"_blank\">Comexi launches F2 Origin flexo press<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Labels and Labeling<\/font>","source.href":"http:\/\/www.labelsandlabeling.com","source.title":"Labels and Labeling","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Comexi, in collaboration with Asahi will host the event ‘Effortless plate making and timeless production’ on November 8, 2023, at the Comexi Technological Center, CTec, in Girona, Spain to launch Comexi F2 Origin advanced flexo press. The ‘Effortless plate making and timeless production’ event invites industry professionals to discover the entire production process, from in-house plate production to printing, lamination, and slitting, all made possible by the turnkey project by Comexi and Asahi. With a focus on streamlining and enhancing the printing process, participants will experience the worldwide launch of the Comexi F2 Origin advanced flexo press. The new press boasts high productivity, ergonomics and user-friendliness for operators. It also features drying capacity and enables the use of solventless inks. Attendees will also learn how to achieve ECG 7C printing. The press does not rely on spot colors to create high quality print results. For the first time at Comexi, the entire process will come full circle. Following the prepress and printing phases, attendees will witness the converting stage in action. This includes laminating, slitting, and handling techniques. Sustainable products will be explained, including the 7-color ink series, Bellissima high-definition screening technology, Asahi's water-wash Carbon Neutral plates, XPS UV LED systems, Comexi's press and Tesa's Twinlock sleeve system—innovations that reduce environmental impact. While alternatives to solvent inks are on the rise, solvent-based inks remain a significant part of the flexible packaging sector, used extensively in rotogravure and flexo printing worldwide. The event will showcase how ECG printing can enhance color gamut and reduce press downtimes, demonstrating the potential of the Comexi F2 Origin in terms of quality and sustainability.","filter_flag":1}
{"title":"Apple Watch Ultra 2 Review: New Sports Performance Upgrades - Women's Health","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LndvbWVuc2hlYWx0aG1hZy5jb20vZml0bmVzcy9hNDUxOTU1NDIvYXBwbGUtd2F0Y2gtdWx0cmEtMi1mZWF0dXJlcy1yZXZpZXcv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LndvbWVuc2hlYWx0aG1hZy5jb20vZml0bmVzcy9hNDUxOTU1NDIvYXBwbGUtd2F0Y2gtdWx0cmEtMi1mZWF0dXJlcy1yZXZpZXcv0gEA?oc=5","id":"CBMiVmh0dHBzOi8vd3d3LndvbWVuc2hlYWx0aG1hZy5jb20vZml0bmVzcy9hNDUxOTU1NDIvYXBwbGUtd2F0Y2gtdWx0cmEtMi1mZWF0dXJlcy1yZXZpZXcv0gEA","guidislink":false,"published":"Thu, 26 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=299, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LndvbWVuc2hlYWx0aG1hZy5jb20vZml0bmVzcy9hNDUxOTU1NDIvYXBwbGUtd2F0Y2gtdWx0cmEtMi1mZWF0dXJlcy1yZXZpZXcv0gEA?oc=5\" target=\"_blank\">Apple Watch Ultra 2 Review: New Sports Performance Upgrades<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Women's Health<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Apple Watch Ultra 2 Review: New Sports Performance Upgrades - Women's Health","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LndvbWVuc2hlYWx0aG1hZy5jb20vZml0bmVzcy9hNDUxOTU1NDIvYXBwbGUtd2F0Y2gtdWx0cmEtMi1mZWF0dXJlcy1yZXZpZXcv0gEA?oc=5\" target=\"_blank\">Apple Watch Ultra 2 Review: New Sports Performance Upgrades<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Women's Health<\/font>","source.href":"https:\/\/www.womenshealthmag.com","source.title":"Women's Health","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Women's Health may earn commission from the links on this page, but we only feature products we believe in. Why Trust Us? I’m going to be honest with you: When the first Apple Watch Ultra came out last year, I quickly decided it wasn’t for me. I’ve had an Apple Watch strapped to my wrist for the better part of the last decade, but the more rugged Ultra—designed with endurance athletes, off-the-grid hikers, and scuba divers in mind—didn’t feel like a device that would fit my city-mouse, gym-rat lifestyle. But, when I got the chance to test out the new ($799), I’ll be the first to admit that my first reaction to the wearable tech was wrong. The watch is bigger, faster, and built to withstand the elements—features I’ve found super useful in my day-to-day. Do I think an everyday athlete like me (and maybe you!) needs to splurge on the Ultra 2? Well, that depends. Read on to see which features I loved to help you decide. The Ultra 2 has Apple’s brightest display yet. Apple The device’s advanced display architecture can brighten up to 3,000 nits—which makes it the brightest screen Apple has ever designed. To put that into perspective, 3,000 nits is 50 percent brighter than the first generation Apple Watch Ultra and 50 percent brighter than the recently-launched Series 9. This makes your watch readable in very harsh sunlight, so you’ll never be squinting to see your stats on a hike or outdoor run. Case in point: I put it to the test at a Women’s Health photo shoot in the California desert, and it allowed me to keep up with emails and texts while staying in the zone on our sunny set. Then, when the sun went down, the Ultra 2’s new automatic Night Mode kicked in! If you spend a lot of time outside, this is a game-changer. And if you don’t, you’ll be inspired to get outdoors: With the latest watchOS 10 update, your Apple Watch can track how much time you’re spending in sunlight every day. I dare you to check those stats and not head out for a hot girl walk. Extreme sports enthusiasts will geek out over the newest metrics. Apple I didn’t get a chance to climb any mountains or go scuba diving during my watch-testing week, but Apple certainly made sure it was ready for anything. The company says the Ultra 2 was tested across the widest range of altitudes of any of their products—all the way down to 500 meters below sea level and up to 9,000 meters up in the sky—so you can use it while exploring all over. (The OG Ultra was only tested between sea level and 3,000 meters high.) Divers will especially dig the new features on this water resistant wonder, which includes up to 40 meters for recreational scuba diving. The Depth app can also now save a log from each session, including a GPS entry point, so you can look back on your dives either on Apple Watch Ultra 2 or iPhone. A new Modular Ultra watch face provides so much data. Apple One of the most noticeable differences between the Apple Watch Ultra and a standard Apple Watch is the case size: The Ultra 2 is the largest at 49mm, while the Series 9 comes in 45mm and 41mm options, and the new SE is available in an even smaller 44mm or 40mm. In doing so, the Ultra 2's modular watch face can creates room for even more complications—the little icons and widgets. It also uses the outer edge of the display to show real-time data like seconds, altitude, or depth. Related Story The Best Apple Watch Cyber Monday Deals While the Ultra 2 may seem monster-sized compared to other models, it doesn’t feel heavier on the wrist—and the trade-off is having more info at a glance than ever before. As someone who wears a watch like this because I’m a total data nerd (and use that data to keep tabs on my wellness habits), this both made my life easier almost immediately and genuinely brought me joy. These features will be available across Apple’s entire slate of new watches: They are Apple’s most powerful wearables yet. Apple The all-new S9 SiP watch chip enables the double tap gesture, which allows you to control the primary button on your Apple Watch by tapping your pointer finger and thumb together twice. (It will be available in a software update later this month.) Double tap has a ton of applications for daily life—think answering a call or snoozing an alarm without having to touch your watch face. I got to test this more extensively on the Series 9, and I am totally convinced it will change your day-to-day life. You can read my thoughts on that here. Paired with a 4-core Neural Engine, Siri requests are now processed even faster—all the magic is happening on your watch instead of being sent to the cloud and back. You can also use Siri to log and review health data, like your period or medications, privately and securely. These are Apple’s first carbon-neutral products. Apple drastically reduced the carbon footprint of the Ultra 2, Series 9, and SE this time around as part of Apple 2030, the company’s commitment to making every product carbon neutral by the end of the decade. When paired with an or , you’ll be wearing 95 percent recycled titanium. The new , my personal fave, also has sustainability in mind, with a one-of-a-kind speckled pattern made from flakes of recycled bands. (All of the new Nike bands are available September 22.) The watchOS 10 update is the real star of the show. Apple All Apple Watch users with a Series 4 or later will be able to benefit from this latest update. The new (and, if I must say, epic) features allow you to: Add more self-care into your day. With the State of Mind feature in the Mindfulness app, you can log your daily mood and feelings and what may be contributing to it by reacting to a series of dynamic shapes. With the State of Mind feature in the Mindfulness app, you can log your daily mood and feelings and what may be contributing to it by reacting to a series of dynamic shapes. Level up your cycling sessions. A cycling workout on your watch will now show up as a Live Event on your iPhone. Mount your phone to your bike to view your heart rate, elevation, and speed on-the-go. You can also connect your Apple Watch to Bluetooth cycling accessories, like power meters, speed sensors, or cadence sensors. A cycling workout on your watch will now show up as a Live Event on your iPhone. Mount your phone to your bike to view your heart rate, elevation, and speed on-the-go. You can also connect your Apple Watch to Bluetooth cycling accessories, like power meters, speed sensors, or cadence sensors. Explore safer. The Compass app will auto-generate new cellular connectivity waypoints, so you can find the fastest route to check a text or make an emergency SOS call—ASAP. The Compass app will auto-generate new cellular connectivity waypoints, so you can find the fastest route to check a text or make an emergency SOS call—ASAP. Make reading maps easier. Elevation view lets you view waypoints in 3D, and Apple Maps’ topographic map shows contour lines, elevation, and points of interest. Use it to search for nearby trails and choose one that fits your fitness level. So, do you need the Apple Watch Ultra 2? If you’re an adventurer who hikes, climbs, or dives, the extra depth and altitude data—paired with 36-hour battery life and super-bright screen—make the Ultra 2 a game-changer for the activities you love. However, if you’ve already got the original Ultra, you can probably skip this version. But for a regular city kid like me…it depends. Most exciting new elements (double tap, anyone?) are available on all three new products, so the less expensive Series 9 ($399) or SE ($299) get the job done. That said, if you’re rocking a wearable because you’re a total data nerd, the Ultra 2 is undoubtedly the best of the best. And now that the double tap gesture is available, the device's efficiency will skyrocket. Amanda Lucci So...it depends on your lifestyle and your “why.\" But for those planning on upgrading your Apple Watch this year anyway, I say, take the plunge! Its rugged durability makes it a worthwhile investment, especially now that it bears the new carbon-neutral seal. You just may feel inspired to put all this data to the test yourself.","filter_flag":1}
{"title":"Planted Launches at 350 Tesco Stores, Debuts Plant-Based Hoisin Duck - vegconomist - the vegan business magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vdmVnY29ub21pc3QuY29tL3Byb2R1Y3RzLWxhdW5jaGVzL3BsYW50ZWQtdGVzY28tcGxhbnQtYmFzZWQtaG9pc2luLWR1Y2sv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vdmVnY29ub21pc3QuY29tL3Byb2R1Y3RzLWxhdW5jaGVzL3BsYW50ZWQtdGVzY28tcGxhbnQtYmFzZWQtaG9pc2luLWR1Y2sv0gEA?oc=5","id":"CBMiUGh0dHBzOi8vdmVnY29ub21pc3QuY29tL3Byb2R1Y3RzLWxhdW5jaGVzL3BsYW50ZWQtdGVzY28tcGxhbnQtYmFzZWQtaG9pc2luLWR1Y2sv0gEA","guidislink":false,"published":"Tue, 03 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=276, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vdmVnY29ub21pc3QuY29tL3Byb2R1Y3RzLWxhdW5jaGVzL3BsYW50ZWQtdGVzY28tcGxhbnQtYmFzZWQtaG9pc2luLWR1Y2sv0gEA?oc=5\" target=\"_blank\">Planted Launches at 350 Tesco Stores, Debuts Plant-Based Hoisin Duck<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">vegconomist - the vegan business magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Planted Launches at 350 Tesco Stores, Debuts Plant-Based Hoisin Duck - vegconomist - the vegan business magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vdmVnY29ub21pc3QuY29tL3Byb2R1Y3RzLWxhdW5jaGVzL3BsYW50ZWQtdGVzY28tcGxhbnQtYmFzZWQtaG9pc2luLWR1Y2sv0gEA?oc=5\" target=\"_blank\">Planted Launches at 350 Tesco Stores, Debuts Plant-Based Hoisin Duck<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">vegconomist - the vegan business magazine<\/font>","source.href":"https:\/\/vegconomist.com","source.title":"vegconomist - the vegan business magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Planted, a Swiss startup producing meat alternatives using fermentation technologies, has secured a major retail listing at the UK’s largest supermarket chain, Tesco. Three Planted products have now launched at 350 Tesco stores nationwide, including a brand new plant-based hoisin duck alternative that is currently not available anywhere else. The meat alternative is made with sunflowers, oats, and peas, and is said to have “the perfect balance of caramelised crispiness and tender juiciness”. The other products launching at Tesco are plant-based kebab meat and lemon & herb flavour plant-based chicken, both featuring updated packaging. All three meat alternatives are described as clean-label, representing a “new standard in the plant-based meat industry”. Planted has also recently achieved B Corp certification, receiving an “outstanding” rating due to its positive contribution to society and the environment. “High consumer demand” Planted first arrived in the UK at the beginning of last year, quickly forming a partnership with David Lloyd Fitness Clubs and securing its first retail listing at Planet Organic. Launches at Holland & Barrett and Morrisons soon followed, with the meat alternatives stocked in the butchery section of the latter chain. Recently, Planted announced a collaboration with vegan and carbon-neutral football club Forest Green Rovers; the brand’s products are now on the menu in the club’s bar and hospitality areas. The company has also just won the Award for Pioneering Achievements at the Swiss Vegan Awards. “At Planted, we’re bucking the trend of plant-based doomsters with a launch into a major retailer with a brand new packaging to boot. It’s a real moment for the business, particularly as we’ll also be launching our delicious hoisin duck, which has been created due to high consumer demand,” said Planted VP of Commercial for Europe, Rob Reames.","filter_flag":1}
{"title":"Sponsored: Tosca and Puratos: a partnership powering sustainability in the food industry - Food and Drink Technology","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiQFodHRwczovL3d3dy5mb29kYW5kZHJpbmt0ZWNobm9sb2d5LmNvbS9uZXdzLzQ5NDA4L3Nwb25zb3JlZC10b3NjYS1hbmQtcHVyYXRvcy1hLXBhcnRuZXJzaGlwLXBvd2VyaW5nLXN1c3RhaW5hYmlsaXR5LWluLXRoZS1mb29kLWluZHVzdHJ5L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiQFodHRwczovL3d3dy5mb29kYW5kZHJpbmt0ZWNobm9sb2d5LmNvbS9uZXdzLzQ5NDA4L3Nwb25zb3JlZC10b3NjYS1hbmQtcHVyYXRvcy1hLXBhcnRuZXJzaGlwLXBvd2VyaW5nLXN1c3RhaW5hYmlsaXR5LWluLXRoZS1mb29kLWluZHVzdHJ5L9IBAA?oc=5","id":"CBMiiQFodHRwczovL3d3dy5mb29kYW5kZHJpbmt0ZWNobm9sb2d5LmNvbS9uZXdzLzQ5NDA4L3Nwb25zb3JlZC10b3NjYS1hbmQtcHVyYXRvcy1hLXBhcnRuZXJzaGlwLXBvd2VyaW5nLXN1c3RhaW5hYmlsaXR5LWluLXRoZS1mb29kLWluZHVzdHJ5L9IBAA","guidislink":false,"published":"Tue, 03 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=276, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiQFodHRwczovL3d3dy5mb29kYW5kZHJpbmt0ZWNobm9sb2d5LmNvbS9uZXdzLzQ5NDA4L3Nwb25zb3JlZC10b3NjYS1hbmQtcHVyYXRvcy1hLXBhcnRuZXJzaGlwLXBvd2VyaW5nLXN1c3RhaW5hYmlsaXR5LWluLXRoZS1mb29kLWluZHVzdHJ5L9IBAA?oc=5\" target=\"_blank\">Sponsored: Tosca and Puratos: a partnership powering sustainability in the food industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food and Drink Technology<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sponsored: Tosca and Puratos: a partnership powering sustainability in the food industry - Food and Drink Technology","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiQFodHRwczovL3d3dy5mb29kYW5kZHJpbmt0ZWNobm9sb2d5LmNvbS9uZXdzLzQ5NDA4L3Nwb25zb3JlZC10b3NjYS1hbmQtcHVyYXRvcy1hLXBhcnRuZXJzaGlwLXBvd2VyaW5nLXN1c3RhaW5hYmlsaXR5LWluLXRoZS1mb29kLWluZHVzdHJ5L9IBAA?oc=5\" target=\"_blank\">Sponsored: Tosca and Puratos: a partnership powering sustainability in the food industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food and Drink Technology<\/font>","source.href":"https:\/\/www.foodanddrinktechnology.com","source.title":"Food and Drink Technology","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Who is Puratos? Puratos is an international group, which offers a full range of innovative food ingredients and services for the bakery, patisserie and chocolate sectors. They serve artisans, retailers, industrial and food service companies in over 100 countries around the world. Puratos believes that food has extraordinary power in people’s lives. This is why they aim to help their customers be successful with their business, by turning technologies and experiences gathered from food cultures around the world into new opportunities. Together, they move the planet forward by creating innovative food solutions for the health and well-being of people everywhere. A strong partnership that advances sustainability Sustainability has become a critical concern for businesses globally, and Puratos, has recognised the importance of sustainable practices in their operations, committing to a set of sustainability goals – to become carbon neutral by 2025, water-balanced, and zero-waste-to-landfill by 2030. In addition to these, Puratos has pledged to reduce their environmental impact by eliminating single-use packaging, including limited-use plastic pallets and rigid IBCs. In 2020, Puratos began collaborating with Tosca, a global leader in reusable plastic packaging and performance pooling solutions, to design, test, and implement a solution that would eliminate single-use packaging and improve operational efficiency. To date, the partnership has driven the following operational and sustainability benefits: By switching to Tosca’s CR1-pallets, Puratos now uses high-quality, clean, and sustainable plastic pallets, which has helped improve safety and reduce product damage. In addition, Puratos has benefited from using Tosca’s pool of Superior Hybrid IBCs for liquids and Magnum Optimum containers for dry bulk products. These solutions have not only supported aseptic filling, but have also helped reduce Puratos’ emissions, resource consumption, and exposure to volatile pricing of plastic one-way packaging. Moreover, Tosca and Puratos have worked together to reduce food waste by innovating ways to maximise product extracted from a container’s liner. By trialling a combination of the Superior Hybrid Containers, a 1000-litre liner, and the right squeeze machine, Puratos has been able to significantly reduce the residue of highly viscous and thick products, resulting in less than 0.3% waste. Positive Sustainability Impact Given their joint commitment to sustainability, Tosca conducted a Life Cycle Analysis (LCA) to compare the environmental impact of Puratos’ previous solution with the new pooling solution put in place by Tosca. It involved collecting and analysing data on the inputs, outputs, and environmental impacts of each solution. Puratos were then presented with the full analysis certificate that highlighted the savings for a number of key environmental metrics. Based on 2022 volumes, switching to Tosca’s pooled plastic CR1 and foldable Magnum Optimum and Superior Hybrid IBCs saves 87 MT CO2 equivalent (the same as 213,028 passenger vehicle miles), 1,661 Gj of fossil fuels and 31,461 M3 of water. “Partnering with Tosca is the perfect way to achieve our sustainability goals. We worked with Tosca and our customers to convert our existing packaging solution to Tosca’s returnable containers. This has been a great success as we have a more sustainable solution and reduced our costs.”- Hélène Flamand, sustainability manager Sourdough and Grains. The Future “The future of Tosca for me is that we will be collaborating even more. Today some products are not produced on Tosca pallets which should be changed in the future. I also hope that we will be able to send the Tosca pallets to even more countries around the world because that would facilitate our operations by having one pallet type we can use everywhere.”- Vincent Holbrechts, logistics manager. With a shared commitment to innovation and sustainability, Puratos and Tosca are both looking to develop and grow the relationship further. As close partners, they will continue to collaborate and develop new, sustainable solutions that not only deliver cost savings and operational efficiencies but also safeguard the future for forthcoming generations. “For me, Tosca is Customer-centric, Solution-oriented, and Committed.” – Alexis Raspé, group purchasing manager for Packaging. Find out how pooling with Tosca can unlock efficiencies in your supply chain, visit www.toscaltd.com. Related content","filter_flag":1}
{"title":"Sweetgreen to Only Use Extra Virgin Olive Oil for Salads & Bowls - Green Queen Media","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmdyZWVucXVlZW4uY29tLmhrL3N3ZWV0Z3JlZW4tZXh0cmEtdmlyZ2luLW9saXZlLW9pbC1ldm9vLWNvb2stdmVnZ2llcy1ncmFpbnMtcHJvdGVpbnMtc2FsYWRzLWJvd2xzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmdyZWVucXVlZW4uY29tLmhrL3N3ZWV0Z3JlZW4tZXh0cmEtdmlyZ2luLW9saXZlLW9pbC1ldm9vLWNvb2stdmVnZ2llcy1ncmFpbnMtcHJvdGVpbnMtc2FsYWRzLWJvd2xzL9IBAA?oc=5","id":"CBMib2h0dHBzOi8vd3d3LmdyZWVucXVlZW4uY29tLmhrL3N3ZWV0Z3JlZW4tZXh0cmEtdmlyZ2luLW9saXZlLW9pbC1ldm9vLWNvb2stdmVnZ2llcy1ncmFpbnMtcHJvdGVpbnMtc2FsYWRzLWJvd2xzL9IBAA","guidislink":false,"published":"Mon, 23 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=296, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmdyZWVucXVlZW4uY29tLmhrL3N3ZWV0Z3JlZW4tZXh0cmEtdmlyZ2luLW9saXZlLW9pbC1ldm9vLWNvb2stdmVnZ2llcy1ncmFpbnMtcHJvdGVpbnMtc2FsYWRzLWJvd2xzL9IBAA?oc=5\" target=\"_blank\">Sweetgreen to Only Use Extra Virgin Olive Oil for Salads & Bowls<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Green Queen Media<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sweetgreen to Only Use Extra Virgin Olive Oil for Salads & Bowls - Green Queen Media","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmdyZWVucXVlZW4uY29tLmhrL3N3ZWV0Z3JlZW4tZXh0cmEtdmlyZ2luLW9saXZlLW9pbC1ldm9vLWNvb2stdmVnZ2llcy1ncmFpbnMtcHJvdGVpbnMtc2FsYWRzLWJvd2xzL9IBAA?oc=5\" target=\"_blank\">Sweetgreen to Only Use Extra Virgin Olive Oil for Salads & Bowls<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Green Queen Media<\/font>","source.href":"https:\/\/www.greenqueen.com.hk","source.title":"Green Queen Media","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"4 Mins Read Sweetgreen will become the first fast-casual restaurant chain in the US to exclusively use heart-healthy extra virgin olive oil to cook its vegetables, grains and proteins. Known for its salads and grain bowls, the brand is leaning into growing consumer demand for minimally processed and sustainably sourced food. Starting tomorrow, all 221 of Sweetgreen’s locations will feature ingredients cooked only in extra virgin olive oil (EVOO). The ingredients in its warm grain bowls like the tofu- and mushroom-based Shroomami and salads such as the Super Green Goddess containing black lentils and chickpeas will all switch sunflower oil for the unrefined olive oil. The company is leaning into calls for more ‘natural’, less processed food – 23% of Americans associate healthy food with minimal processing, according to a 1,023-person survey by the International Food Information Council (IFIC), while over three-quarters consider whether a food product is processed before buying it. Meanwhile, environmental sustainability is a purchase driver for a third of consumers (although that’s down from 40% last year), something Sweetgreen is also doubling down on. In 2021, the salad chain pledged to become carbon-neutral by 2027, saying it would cut half of its footprint through a plant-forward menu and more sustainable sourcing decisions. This latest move falls in the latter category, continuing the company’s commitment towards using high-quality, locally produced and minimally processed ingredients. Focusing on sustainable sourcing over health credentials Courtesy: Sweetgreen Sweetgreen is partnering with brands that have shared commitments to sustainable farming, choosing the Bari Olive Oil Company as its EVOO supplier. Running since 1936, it’s one of the US’s oldest olive oil companies. All of its EVOO is domestically grown and produced in California, using what it claims are organic and sustainable practices. Bari mills its olives – a drought-friendly crop – within 24 hours of harvest and uses every part of the fruit, including the pomace (ground pit and meat usually discarded) for cattle feed and the water used during milling for irrigating its trees. Meanwhile, at its 17 Texas locations, Sweetgreen is collaborating with Texas Olive Ranch, a fourth-generation family producing cold-pressed olive oil. “Reimagining fast food goes beyond the kitchen and starts with a strong, transparent supply chain. In addition to partnering with suppliers and growers we trust, we take into account how every ingredient is prepared, down to the oil it’s cooked in,” said Sweetgreen co-founder and chief concept officer Nicolas Jammet. Many seed oils have been found to be highly toxic and inflammatory, and labelled as “the most unhealthy staple of the American diet”. Given EVOO’s health credentials – it’s an oil rich in anti-inflammatory substances, known to lower blood pressure and enhance blood vessel health, and has been linked with lower risk of heart disease, stroke, Alzheimer’s and some forms of cancer – it’s perhaps surprising that Sweetgreen isn’t centring its messaging on the nutritional benefits of the fat. Many companies – like Beyond Meat – are going all-in on the health aspects of new products to appeal to consumers – the IFIC report revealed that health is a key purchase driver for 62% of Americans. It’s a much-discussed subject in the US, due to the alarming and rising rates of obesity and type 2 diabetes: over two-thirds (69%) of its citizens are overweight and 36% are obese. Innovations in fat and oil alternatives Courtesy: Sweetgreen In addition to the use of EVOO, Sweetgreen is exploring avocado oil as another cooking oil for its menu. In August, the company released a red wine vinaigrette dressing made with an avocado oil base, which it says became “an instant fan favourite”. The dressing is now a permanent menu item in custom bowls and signature salads. “While we know there’s more work to do, we hope this change raises the bar and continues to inspire our industry to make quality products more accessible,” said Jammet. The move follows a pilot by fellow fast-casual chain Shake Shack, which is trialling Californian startup Zero Acre Farms’ sustainable Cultured Oil on select menu items at two NYC locations. Shake Shack too pointed to the oil’s health and eco credentials: it’s rich in heart-healthy monounsaturated fat and boasts a 90% smaller environmental footprint than conventional vegetable oil. More and more companies are innovating in this space to develop oils and fats better for both people and the planet. Austrian startup Kern Tec upcycles fruit pits into oil for alt-dairy products, Germany’s Zayt Bioscience turns fruit waste into precision-fermented butter, San Francisco-based Lypid has created a proprietary PhytoFat for plant-based meat, and Sweden’s Mycorena makes fermented fungi-based fat to replace animal fats. Many brands are coming up with palm oil substitutes for use in both food and other applications. This includes Estonian startup Äio, UK-based Clean Food Group, New York’s C16 Biosciences and Dutch company NoPalm Ingredients.","filter_flag":1}
{"title":"Ecosoul develops everyday products using sustainable materials - Entrackr","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vZW50cmFja3IuY29tLzIwMjMvMTAvZWNvc291bC1kZXZlbG9wcy1ldmVyeWRheS1wcm9kdWN0cy11c2luZy1zdXN0YWluYWJsZS1tYXRlcmlhbHMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vZW50cmFja3IuY29tLzIwMjMvMTAvZWNvc291bC1kZXZlbG9wcy1ldmVyeWRheS1wcm9kdWN0cy11c2luZy1zdXN0YWluYWJsZS1tYXRlcmlhbHMv0gEA?oc=5","id":"CBMiXGh0dHBzOi8vZW50cmFja3IuY29tLzIwMjMvMTAvZWNvc291bC1kZXZlbG9wcy1ldmVyeWRheS1wcm9kdWN0cy11c2luZy1zdXN0YWluYWJsZS1tYXRlcmlhbHMv0gEA","guidislink":false,"published":"Tue, 03 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=276, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vZW50cmFja3IuY29tLzIwMjMvMTAvZWNvc291bC1kZXZlbG9wcy1ldmVyeWRheS1wcm9kdWN0cy11c2luZy1zdXN0YWluYWJsZS1tYXRlcmlhbHMv0gEA?oc=5\" target=\"_blank\">Ecosoul develops everyday products using sustainable materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Entrackr<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Ecosoul develops everyday products using sustainable materials - Entrackr","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vZW50cmFja3IuY29tLzIwMjMvMTAvZWNvc291bC1kZXZlbG9wcy1ldmVyeWRheS1wcm9kdWN0cy11c2luZy1zdXN0YWluYWJsZS1tYXRlcmlhbHMv0gEA?oc=5\" target=\"_blank\">Ecosoul develops everyday products using sustainable materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Entrackr<\/font>","source.href":"https:\/\/entrackr.com","source.title":"Entrackr","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Rahul Singh and Arvind Ganesan started their entrepreneurial journey with EcoSoul in 2020. Both Singh and Ganeshan previously worked together at Wayfair. Their entrepreneurial foray is based on their learnings from their experience at the American ecommerce company where they worked on creating sustainable product categories. “It was during this time that we realized the significant gap for eco-friendly everyday essentials. Consumers were looking for products that weretrustworthy, affordable and available everywhere and no company was solving for this at scale,” Singh told Entrackr. To make this happen, Singh took the plunge by quitting his job, selling his house in New York, and relocating to India. EcoSoul sells sustainable products through its website, ecommerce platforms like Flipkart and Amazon, and also offline through partner stores. The catalog includes tableware, kitchenware, and compost bags. These products are made from using sustainable materials like palm leaves, bamboo, sugarcane bagasse, and PLA. Singh said the company currently offers 43 product varieties and 1,800 SKUs. The Delhi-based startup has already raised nearly $15 million in two rounds of funding and has backing of investors like Accel. It’s worth noting that sustainability has become a lucrative market with industry-wide aspirations of becoming carbon neutral and support ecofriendly products and services. The global green technology and sustainability market size was valued at $15.85 billion in 2022 and is expected to expand at a CAGR of 22.7% from 2023 to 2030, according to a research. Here are edited excerpts from the conversation with Singh: Who is your target audience? In terms of target users, at the heart of EcoSoul’s audience are women between the ages of 25 and 45. Zooming out, our focus also extends to families, Millennials and Gen Z, who are inherently attuned to global issues and recognize that even small actions can yield substantial impacts. This demographic is particularly receptive to our mission. What is your business model? How do you make profits? Our business model at EcoSoul revolves around offering a range of everyday essentials crafted from sustainable materials like palm leaves, bamboo, sugarcane bagasse, and PLA. We’re committed to providing eco-conscious consumers with accessible and environmentally friendly alternatives. In terms of profitability, we generate revenue through the sale of these products. Our pricing structure is designed to balance affordability with the costs associated with sustainable production methods. By maintaining a focus on quality and sustainability, we’ve been able to establish a solid customer base that appreciates the value and positive impact of our offerings. This, in turn, allows us to reinvest in the business, expand our product line, and further our mission of promoting sustainable living. Can you share any growth figures? EcoSoul started out with an initial investment of Rs 4 crores back in August 2020. And, within just three years of our launch, we have a global turnover of more than Rs 300 crore. Moreover, EcoSoul has also secured Rs 125 crore in two funding rounds heldbetween 2021 and 2022. Every product that EcoSoul has in the market for more than a year is profitable. At the company level, we aim to hit profitability in 2024 given 2023 was near to launching more than 20 new products and 4 new countries. How do you plan to expand your business? What new services do you plan to add? We’re gearing up to unveil PLA or a cornstarch-based product category. Think of it as the next level in eco-friendly materials. From PLA cups to PLA straws, we’re talking about 100% plastic-free, tree-free options that are completely compatible with our planet-friendly ethos. EcoSoul is also committed to bringing more innovative products to the market like fully compostable diapers and sanitary pads early next year. But that’s not all. We’re also in the works for another exciting category: paper bamboo products. Picture wet wipes, facial tissues, and more, all designed to be both sustainable and accessible. And, of course, affordability is a key factor in all these endeavors.","filter_flag":1}
{"title":"Asahi Group Holdings Is Engaging Society to Tackle SDGs | NIKKEI ESG Management Forum - 日経BP","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi82MS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi82MS_SAQA?oc=5","id":"CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi82MS_SAQA","guidislink":false,"published":"Fri, 27 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=300, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi82MS_SAQA?oc=5\" target=\"_blank\">Asahi Group Holdings Is Engaging Society to Tackle SDGs | NIKKEI ESG Management Forum<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">日経BP<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Asahi Group Holdings Is Engaging Society to Tackle SDGs | NIKKEI ESG Management Forum - 日経BP","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi82MS_SAQA?oc=5\" target=\"_blank\">Asahi Group Holdings Is Engaging Society to Tackle SDGs | NIKKEI ESG Management Forum<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">日経BP<\/font>","source.href":"https:\/\/project.nikkeibp.co.jp","source.title":"日経BP","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Asahi Super Dry, the official beer of the Rugby World Cup beginning in France this September \"Always forward\" encapsulates the spirit of the well-known motto used by Chuji Kitajima, the coach who led Meiji University's rugby club to become a famous team. These two words summed up his philosophy of continually pushing forward, no matter what difficulties or challenges cross your path. Humanity cannot afford to lose any of the ground it has gained in terms of resolving the Earth's problems, and past approaches are simply no longer good enough. It is critical to accelerate our activities targeting the SDGs, making sure our movements are always forward, aiming for those goals with increasing momentum. Private enterprise must directly engage society to work closely together in creating new value for our world. Placing CO2 Absorbers Inside Vending Machines Since opening in 2012, Tokyo Skytree has attracted over 40 million visitors from both across Japan and around the world. Recently, the tourist attraction became the site for vending machines with a green edge. In July 2023, Asahi Soft Drinks Co. Ltd., a subsidiary of Asahi Group Holdings, began installing vending machines that absorb atmospheric CO2. The project is a trial experiment for carbon recycling technology. The empty space behind the beverage outlet provides room for the installation of a mix of special materials capable of absorbing this greenhouse gas. As the beverage dispenser draws in the surrounding air for heating or cooling the drinks inside, it simultaneously captures carbon dioxide. The annual amount of this emissions gas that a single machine can sink is roughly the same as 20 adult cedar trees (around 56 – 60 years old). Asahi's \"CO2-gobbling\" vending machine in Tokyo Skytree The company is also considering how to use the collected carbon dioxide to produce industrial products. One idea for a possible recycling application is mixing the materials rich in carbon dioxide with fertilizer for spreading on soil. Manufacturing artificial reefs as homes for kelp to revitalize the \"blue carbon\" marine ecological system is another potential use. The experiment will mainly focus on Tokyo and Osaka, installing about 30 of the trial machines in these major cities. The special material is easy to introduce as it fits into free space inside the current designs being used. The ease of retrofitting means it should be possible to install the systems inside all 2.2 million vending machines across Japan. Such \"carbon-gobbling\" drinks machines are a steady step toward creating a better world. Asahi Group will continue offering society new products, working together to consider and implement the best ways to realize the United Nations Sustainable Development Goals (SDGs). As a global enterprise, Asahi Group is positioned to effectively leverage top-tier know-how from around the world. The Netherlands' Koninklijke Grolsch N.V. , a beer brewery acquired by the Asahi Group in 2016, uses the thermal energy from biomass power generation to slash annual carbon dioxide emissions by 72 percent at its factories using natural-gas fired heating. The thermal energy is used for low-temperature pasteurization, washing of bottles and plastic cases, as well as heating for buildings. Employees around the world working for the Asahi Group share a common belief in the SDGs. A united standpoint defined in the Asahi Group Philosophy (AGP) developed to bolster the sustainable growth of corporate value. Koninklijke Grolsch won the Grand Prix at the AGP Awards for its innovative program. As Asahi Holdings President and CEO Atsushi Katsuki said, \"We have much to learn from Europe about its advanced initiatives that effectively combine business and the environment.\" One more step forward. The Asahi Group Philosophy (AGP) Awards ceremony held in May","filter_flag":1}
{"title":"Yorkshire Tea and On the Beach: Don't think about traditional and digital media as an either\/or - Marketing Week","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3Lm1hcmtldGluZ3dlZWsuY29tL3lvcmtzaGlyZS10ZWEtb24tdGhlLWJlYWNoLXRyYWRpdGlvbmFsLWRpZ2l0YWwtZWl0aGVyLW9yL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3Lm1hcmtldGluZ3dlZWsuY29tL3lvcmtzaGlyZS10ZWEtb24tdGhlLWJlYWNoLXRyYWRpdGlvbmFsLWRpZ2l0YWwtZWl0aGVyLW9yL9IBAA?oc=5","id":"CBMiV2h0dHBzOi8vd3d3Lm1hcmtldGluZ3dlZWsuY29tL3lvcmtzaGlyZS10ZWEtb24tdGhlLWJlYWNoLXRyYWRpdGlvbmFsLWRpZ2l0YWwtZWl0aGVyLW9yL9IBAA","guidislink":false,"published":"Fri, 06 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=279, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3Lm1hcmtldGluZ3dlZWsuY29tL3lvcmtzaGlyZS10ZWEtb24tdGhlLWJlYWNoLXRyYWRpdGlvbmFsLWRpZ2l0YWwtZWl0aGVyLW9yL9IBAA?oc=5\" target=\"_blank\">Yorkshire Tea and On the Beach: Don't think about traditional and digital media as an either\/or<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Marketing Week<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Yorkshire Tea and On the Beach: Don't think about traditional and digital media as an either\/or - Marketing Week","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3Lm1hcmtldGluZ3dlZWsuY29tL3lvcmtzaGlyZS10ZWEtb24tdGhlLWJlYWNoLXRyYWRpdGlvbmFsLWRpZ2l0YWwtZWl0aGVyLW9yL9IBAA?oc=5\" target=\"_blank\">Yorkshire Tea and On the Beach: Don't think about traditional and digital media as an either\/or<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Marketing Week<\/font>","source.href":"https:\/\/www.marketingweek.com","source.title":"Marketing Week","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Yorkshire Tea’s marketing director says it’s wrong to frame conversations around traditional and digital channels as “or” rather than “and”. Brands need to view digital and more traditional media channels as complementary to each other, rather than falling into the trap of viewing them as either\/or, according to Yorkshire Tea’s marketing director Dom Dwight. “It’s a mad suggestion that it should be an ‘or’ conversation, rather than an ‘and’ conversation,” he said, speaking at Marketing Week’s Festival of Marketing 2023 yesterday (5 October). During the panel, which was conducted in partnership with Kantar, Dwight acknowledged that over the past few years Yorkshire Tea has built its success through brand campaigns primarily on TV, through its ‘Where Everything’s Done Proper’ campaign. However, part of the brand’s success has been activating across a number of channels, including those online. “I feel like there’s a sort of brand universe with Yorkshire Tea, which you usually feel when you watch on TV, but you also feel that when you watch a piece of content online,” he said. The brand’s use of its distinctive assets and its sense of humour across its media helps it maintain consistency while being able to tweak its tone of voice for different channels. Yorkshire Tea deploys its channels in slightly different ways, Dwight said. When the brand achieved carbon-neutral status, for example, it used YouTube to reach consumers who might be more engaged by this green messaging, he said. The combination of this smaller scale messaging and Yorkshire Tea’s big brand campaigns on TV creates a “wonderful synergy” for consumers on the receiving end of both messages, he said. It’s a mad suggestion that it should be an ‘or’ conversation, rather than an ‘and’ conversation. Dom Dwight, Yorkshire Tea On the Beach CMO Zoe Harris agreed on the importance of using both digital and more traditional media such as TV. She added that it was easy to fall into the trap of thinking in an “either\/or” way. When asked whether digital media reached maturity as a brand building channel, she said: “I think the real skill is to work out how you use both to do different jobs that complement each other.” The biggest change in the digital advertising space has been that the channels themselves have changed, Harris said. The rise of short-form video, for example, has allowed On the Beach to be “more reactive” to things online. The brand ensures it grounds this in points about it products. Harris gave the example of educational “myth-busting” the brand posted on TikTok in the wake of the Turkey earthquakes to reassure travellers about the safety of the destination. “As digital changes it gives us new opportunities,” she said, adding it gives marketers “another string to [their] bow”. There’s certainly no set ratio for how brands should split their media spend between digital and more traditional channels, said Virgin Media O2 head of marketing performance Chris Love. The brands under the Virgin Media O2 banner, although in the same broad sector, have different ratios of where media spend falls, he noted. The company uses econometrics to analyse the effectiveness of its spend and work out how it will spread its media budget. This is a process that “should never stop” to ensure this budget is most effectively deployed across digital and traditional channels, he said.","filter_flag":1}
{"title":"The world's greenest countries revealed - Driving Instructors Association","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmRyaXZpbmcub3JnL3RoZS13b3JsZHMtZ3JlZW5lc3QtY291bnRyaWVzLXJldmVhbGVkL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmRyaXZpbmcub3JnL3RoZS13b3JsZHMtZ3JlZW5lc3QtY291bnRyaWVzLXJldmVhbGVkL9IBAA?oc=5","id":"CBMiP2h0dHBzOi8vd3d3LmRyaXZpbmcub3JnL3RoZS13b3JsZHMtZ3JlZW5lc3QtY291bnRyaWVzLXJldmVhbGVkL9IBAA","guidislink":false,"published":"Wed, 18 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=291, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmRyaXZpbmcub3JnL3RoZS13b3JsZHMtZ3JlZW5lc3QtY291bnRyaWVzLXJldmVhbGVkL9IBAA?oc=5\" target=\"_blank\">The world's greenest countries revealed<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Driving Instructors Association<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The world's greenest countries revealed - Driving Instructors Association","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmRyaXZpbmcub3JnL3RoZS13b3JsZHMtZ3JlZW5lc3QtY291bnRyaWVzLXJldmVhbGVkL9IBAA?oc=5\" target=\"_blank\">The world's greenest countries revealed<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Driving Instructors Association<\/font>","source.href":"https:\/\/www.driving.org","source.title":"Driving Instructors Association","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"As people across the globe become more conscious about their impact on the environment, many countries are already setting the bar high when adopting sustainable practices, from the widespread adoption of electric vehicles and EV charging to ambitious net-zero goals. To determine which countries are pioneering a new era of sustainability by taking on environmental responsibility, the DriveElectric team decided to take a deep dive into the most eco-conscious nations. DriveElectric reveals the nations making the most impressive strides in fostering green habits by looking at various factors, such as the countries that use the most renewable energy, EV sales, and solar panels. In addition, they shed light on the nations putting environmentally friendly innovative strategies at the forefront of global consciousness. DriveElectric also explores countries addressing environmental issues the fastest and those that have embraced the green movement, moving towards a brighter, more sustainable future. The greenest countries in the world 1. Sweden Green score – 7.66\/10 Known as one of the most sustainable countries in the world, Sweden takes first place as the greenest country. The country has several low carbon dioxide emissions and strong renewable energy programs, which are contributing towards the country’s goal of becoming fossil fuel-free and running solely on 100% renewable energy by 2045. 2. Finland Green score – 7.03\/10 Regarded as having a strong reputation as a leader in environmental policy and sustainable development, Finland comes second, scoring 7.03 out of 10. Committed to becoming carbon neutral by 2035, the country’s renewable energy sources account for around 40% of end consumption and continue to focus on curbing industrial emissions and protecting its biodiversity. The Nordic country has one of the most stringent environmental policies, with an Environmental Policy Stringency Index (EPS) index of 4.11 out of 6. 3. Germany Green score – 6.55\/10 Germany is the third greenest country with a score of 6.55 out of 10. According to the country’s Climate Protection Act, it aims to achieve greenhouse gas neutrality by 2045. Germany also has high hopes, with an ambitious goal of running on 100% green power by 2035. Regarding recycling, the nation is said to be a world leader in recycling over 60% of its waste into new products such as paper and glass or fuel. Countries with the best environmental policies 1. France EPS Index: 4.89\/6 When it comes to the country with the best environmental policies, France takes the crown with an EPS index of 4.89 out of 6. The EPS index considers the degree of stringency of 13 environmental policy instruments related to climate and air pollution. Considered a world leader in sustainable initiatives, the French parliament passed a climate change bill in 2021 to reduce packaging waste, prohibit open-air terrace heaters and prevent future airport expansions. 2. Switzerland EPS Index: 4.50\/6 Ranking in second place is Switzerland, with an EPS index of 4.50 out of 6. Said to be one of the world’s most eco-friendly countries, Switzerland was the first country to vote for implementing a green economy. In recent years, there have been measures taken by the Swiss Confederation to achieve a more sustainable environment. Nearly 60% of the country’s electricity comes from hydropower and reduced emissions from furnaces, industrial and commercial operations, as well as combustion engine-driven machinery. This has had a positive impact on the country’s air quality. 3. Luxembourg EPS Index: 4.22\/6 Regarded as a pioneer in sustainable activities, Luxembourg is committed to reducing its greenhouse gas emissions by 55% by 2030. On a national scale, the country’s objective is to achieve climate neutrality by 2050. Luxembourg has several sustainable initiatives, including promoting electric cars and bikes, package-free fruit and vegetables, and its own eco-village. With so many green initiatives in place, it is no surprise that Luxembourg ranks third with an EPS index of 4.22 out of 6. Countries that use the most renewable energy 1. Denmark Percentage of renewable energy consumption: 40.3% A leading country in renewable energy production and usage, it is no surprise that Denmark takes the lead with a renewable energy consumption of 40.3%. In 2022 alone, an estimated three-quarters of the country’s electricity generation was collectively produced from renewable energy sources. By 2030, it is estimated that these renewable sources will provide 100% of the nation’s electric power production. 2. Finland Percentage of renewable energy consumption: 21.6% Ranking in second place is Finland, with 21.6% renewable energy consumption in 2021. A global leader in producing second-generation biofuels, some of the country’s most important forms of renewable energy include bioenergy, hydroelectric power and wind power. By 2030, Finland aims to increase its use of renewable energy to more than 50% of its end-consumption. 3. Sweden Percentage of renewable energy consumption: 21.5% Sweden takes third place with an estimated 21.5% renewable energy consumption. Seeking a greener future, the Swedish government has set ambitious targets for sustainability. This includes using 100% renewable energy and going fossil-free by 2045. With the increase in the nation’s green activities over the years, Sweden is getting closer to its net zero target. In fact, in 2021, Sweden saw an increase of nearly 70% in EV sales, significantly reducing the country’s carbon footprint. Countries with the highest solar power consumption 1. Australia Percentage of solar power consumption: 11.66% Australia grabs first place as the country with the highest solar panel consumption, with 11.66% of its energy coming from solar panels. The adoption of solar power is fast-growing in the country. It is also the fastest-growing generation type, with more than 30% of Australian households having a rooftop solar PV, which equates to a combined capacity exceeding 11 GW. 2. Hungary Percentage of solar power consumption: 10.61% Hungary takes second place with a solar power consumption of 10.61%. Thanks to government support and declining system prices, solar power in Hungary has experienced rapid advancement. In recent years, the country launched its largest solar power plant to date, which is expected to account for 8% of the total domestic solar-generated electricity. 3. Spain Percentage of solar power consumption: 9.85% Completing the top three countries with the highest solar power consumption is Spain with 9.85%. The country is considered a world leader in solar power production. Spain’s solar power capacity is expected to see strong growth as its energy strategy could accommodate an additional 65 GW of photovoltaic (PV) capacity installation by 2030. Countries with the highest hydroelectricity consumption 1. Norway Percentage of hydroelectricity consumption: 65.9% Well known for abundant natural lakes and steep valleys, Norway’s topography lends itself nicely to hydropower development. In 2021, hydroelectricity accounted for 65.9% of the total Norwegian power production, while the remainder came from thermal and wind energy. The Scandinavian country is committed to reducing emissions by at least 40 % by 2030. 2. Switzerland Percentage of hydroelectricity consumption: 31.8% Switzerland currently has a whopping 682 hydroelectric power stations with a capacity of over 300 kilowatts. Hydropower is a cornerstone of Switzerland’s energy policy. In 2021, 31.8% of its electricity came from hydroelectricity, making it one of the country’s most important domestic sources of renewable energy. 3. Sweden Percentage of hydroelectricity consumption: 29.4% As Sweden’s most significant renewable energy, in 2021, hydroelectricity accounted for just under 30% of Swedish electricity generation. Together with nuclear power, hydropower is said to be the foundation of the country’s electricity system. Hydropower in Sweden operates on zero carbon emissions, and the water used is returned to the river after leaving the turbine. Countries with the highest nuclear energy consumption 1. France Percentage of nuclear energy consumption: 36.5% With one of the world’s most extensive nuclear power programs, it is no surprise that France tops the list, with over a third (36.5%) of its energy consumption coming from nuclear power. In 2021, nuclear power plants in France generated an estimated 361 billion kilowatt-hours of electricity. This accounted for more than two-thirds of the country’s annual electricity generation, the highest nuclear generation share in the world. 2. Sweden Percentage of nuclear energy consumption: 21.1% In 2021, nuclear energy provided an estimated 21.1% of the country’s electricity. Sweden currently operates on six reactors located at three different sites that supply almost a third of its electricity, with hydroelectricity providing most of the rest in its fossil-free energy mix. 3. Slovakia Percentage of nuclear energy consumption: 19.7% Slovakia has a combined net power capacity of 2,308 MWe with five operational nuclear reactors. The country also has the potential to build a new nuclear reactor as electricity consumption continues to increase. In 2021, Slovakia’s nuclear energy consumption was almost a fifth (19.7%) of its primary energy. Countries with the highest increase in EV sales 1. India YoY percentage difference: 300% Unlike China, Europe and the US, India is not a hub for purchasing electric cars. However, the country’s demand for electric vehicles skyrocketed by 300% in just one year. EV sales in the South Asian country were four times higher than in 2021 after almost hitting 50,000 battery electric vehicle sales in 2022. 2. Brazil YoY percentage difference: 193% Brazil follows behind with a year-on-year increase of 193% in EV sales. The country’s adoption of electric vehicles has seen steady growth over the last few years. Compared to 2021, which saw an estimated 2,900 EV sales, Brazil’s demand for electric cars rose to 8,500 by 2022. 3. New Zealand YoY percentage difference: 179% Due to the increasing environmental awareness of the global climate crisis, the New Zealand government introduced the “clean car” rebate scheme in 2021, which allows buyers of new or used, low or zero-emissions vehicles to claim back up to $8,000 (NZ) of the price. The scheme’s popularity has led to an increase of 179% in EV sales, a record high. Electric car sales went from 6,800 in 2021 to 19,000 new purely electric vehicles registered in the country. Countries with the highest railway usage 1. China YoY percentage difference: 946,499 China takes first place with the highest railway usage of 946,499 million passenger kilometres in 2021. Railways play a significant role in passenger travel in the country. China’s railroad network also saw an increase of 2.5% in the same year. The country’s railroad network has increased by 65% in over a decade. 2. Japan YoY percentage difference: 263,211 In second place is Japan, with 263,211 million passenger kilometres in 2020. Research suggests that around 40% of the total passenger travel in Japan is by railway transport. This is significantly more when compared to other countries, such as the United States, which is said to have 90% of people opting for road transport. 3. India YoY percentage difference: 321,126 India ranks third with 231,126 million passenger kilometres. This is unsurprising as the South Asian country has the fourth-largest rail network in the world. According to the research, India saw an average of 22.15 million passengers use the Indian Railways network daily between 2019 and 2020. Methodology To find out which countries have fostered the greenest habits, Driveelectric looked at various factors, including the percentage of renewable energy consumption, rail transport of passengers, EV sales, percentage of solar power consumption, target percentage of emissions reduction and Environmental Policy Stringency (EPS) Index. To calculate the overall green score of each country, DriveElectric looked at over 30 countries. For the countries missing at least one or two factors, they put a 0 for their missing factors. They then used a weighted ranking system to calculate an overall average, which was then ranked to determine the country with the highest green score. Using a Net Zero Tracker, Driveelectric collected data on each country’s Net Zero goals. By looking at the 2023 scorecard, they ranked each country based on their target percentage of emissions reduction. Please note that they only looked at countries with available data for most of the other factors, so this list is not ranked on every country’s sustainability goals. The EPS Index was taken from OECD. This measures the stringency of environmental policy across different countries. To source data for more countries, DriveElectric used CEIC data. The index is based on the degree of stringency of 13 environmental policy instruments, from climate to air pollution. The index also ranges from 0 (not stringent) to 6 (highest degree of stringency) and covers 40 countries. We used the most recent data, which was from 2020. DriveElectric sourced data from BP’s Statistical Review of World Energy to determine which countries have the highest renewable energy consumption. Using figures of each country’s renewable consumption in exajoules (input-equivalent, p.43), they calculated this as a percentage of each country’s primary energy consumption (p.8) in 2021 to determine how much of the consumed energy is renewable. This was also done for hydroelectricity (p.42) and nuclear energy (p.41). They sourced data on the countries with the most solar energy by calculating the solar capacity (p.45) compared to its total electricity generation (p.50) to get the percentage of the total energy consumption from solar energy. To find out which nations saw the most increase in EV Sales year-on-year (2021-2022), DriveElectric used historical data from a Global EV Data Explorer. The figures used were filtered by Battery Electric Vehicles (BEVs). We only took into account countries; e.g. data for ‘Other Europe’ and ‘Rest of the world’ were not considered due to being too broad. Using Eurostat, they gathered data on the rail transport of passengers in each country. DriveElectric used figures from the World Bank to source data for non-European countries. This was measured based on the passenger kilometres in millions. These figures were then ranked in order using the most recent data available for each country. Data collection for all the above sections was completed on 04\/09\/2023.","filter_flag":1}
{"title":"Retail 2024: How eBay, THG and The Fragrance Shop are investing in green initiatives - Retail Week","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3d3dy5yZXRhaWwtd2Vlay5jb20vc3VzdGFpbmFiaWxpdHkvcmV0YWlsLTIwMjQtaG93LWViYXktdGhnLWFuZC10aGUtZnJhZ3JhbmNlLXNob3AtYXJlLWludmVzdGluZy1pbi1ncmVlbi1pbml0aWF0aXZlcy83MDQ0ODQ5LmFydGljbGXSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3d3dy5yZXRhaWwtd2Vlay5jb20vc3VzdGFpbmFiaWxpdHkvcmV0YWlsLTIwMjQtaG93LWViYXktdGhnLWFuZC10aGUtZnJhZ3JhbmNlLXNob3AtYXJlLWludmVzdGluZy1pbi1ncmVlbi1pbml0aWF0aXZlcy83MDQ0ODQ5LmFydGljbGXSAQA?oc=5","id":"CBMijQFodHRwczovL3d3dy5yZXRhaWwtd2Vlay5jb20vc3VzdGFpbmFiaWxpdHkvcmV0YWlsLTIwMjQtaG93LWViYXktdGhnLWFuZC10aGUtZnJhZ3JhbmNlLXNob3AtYXJlLWludmVzdGluZy1pbi1ncmVlbi1pbml0aWF0aXZlcy83MDQ0ODQ5LmFydGljbGXSAQA","guidislink":false,"published":"Wed, 25 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=298, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3d3dy5yZXRhaWwtd2Vlay5jb20vc3VzdGFpbmFiaWxpdHkvcmV0YWlsLTIwMjQtaG93LWViYXktdGhnLWFuZC10aGUtZnJhZ3JhbmNlLXNob3AtYXJlLWludmVzdGluZy1pbi1ncmVlbi1pbml0aWF0aXZlcy83MDQ0ODQ5LmFydGljbGXSAQA?oc=5\" target=\"_blank\">Retail 2024: How eBay, THG and The Fragrance Shop are investing in green initiatives<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Retail Week<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Retail 2024: How eBay, THG and The Fragrance Shop are investing in green initiatives - Retail Week","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3d3dy5yZXRhaWwtd2Vlay5jb20vc3VzdGFpbmFiaWxpdHkvcmV0YWlsLTIwMjQtaG93LWViYXktdGhnLWFuZC10aGUtZnJhZ3JhbmNlLXNob3AtYXJlLWludmVzdGluZy1pbi1ncmVlbi1pbml0aWF0aXZlcy83MDQ0ODQ5LmFydGljbGXSAQA?oc=5\" target=\"_blank\">Retail 2024: How eBay, THG and The Fragrance Shop are investing in green initiatives<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Retail Week<\/font>","source.href":"https:\/\/www.retail-week.com","source.title":"Retail Week","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Top retail bosses have given exclusive interviews to Retail Week, revealing their sustainability strategies featured in Retail 2024 , our annual flagship report. The report, now in its 12th year and produced in partnership with Zebra Technologies, is based on interviews with 44 retail leaders and provides an inside perspective on the strategic conversations happening right now in the UK’s retail boardrooms. The retail bosses interviewed were keen to detail their plans to become greener and the targets they have set to reduce the impact their operations have on the planet. In particular, eBay, Osprey London and The Fragrance Shop placed sustainability in their top three priorities list for 2024, while reaching Net-Zero by 2040 is central to THG’s strategy. Many of the leaders interviewed are already supporting the BRC Climate Action Roadmap, which has now signed up around 90 businesses to work together and learn from each other to reduce carbon emissions and improve the long-term health of the planet. Sustainability appointments are becoming a regular feature of the news cycle. The White Company hired Cat Lee as head of ethics and sustainability in July 2023; Decathlon’s former head of outdoor Chris Allen moved into the director of sustainability role in June 22; while Asos appointed sustainability and CSR expert Anna Maria Rugarli as non-executive member and chair of its ESG board in June 2023 to oversee its green strategy. eBay: championing the circular economy At eBay, the retailer’s focus is on driving the pre-loved market. In recent years, the marketplace has retrospectively rebranded itself as a “pre-loved pioneer” as consumer interest has grown and the reputation of the secondhand market has improved. Since 2022, eBay has been the main fashion sponsor for the hit ITV reality show Love Island, which has helped it promote the benefits of buying secondhand clothing and attach the eBay name to the circular economy. Vice president and general manager for eBay UK Eve Williams describes pre-loved as the company’s “heartland”, adding: “It’s more important than ever because it gives consumers access to great products, quality products, at a price they want, in a way that they can trust.” A partnership with pre-loved platform Reskinned, which was launched in September 2022 and sees individual brands launching dedicated secondhand goods pages on eBay to further promote the circular economy, is just one initiative showcasing eBay’s green credentials. But it has ambitious group-wide plans, too. “Our Science Based Targets Initiative is to reduce Scope 1 and 2 carbon emissions by 90% by 2030. 2019 is our baseline year and our goal is 100% renewable energy by 2025, and we’ve already reached about 91% of that,” says Williams. The online marketplace is also helping its sellers act more sustainably by ramping up advice in this area, as well as making sustainability training for staff a priority for 2024. Retail HQs go green Both Osprey London and The Fragrance Shop have prioritised making their headquarters more sustainable for 2024, putting green issues front and centre of their plans. Osprey founder and chief executive Graeme Ellisdon says: “We’ve just moved into the home for the brand, which is called The Who and is based in the Chiltern Hills, and I think this whole location is going to become a metaphor for the company. “We’re rewilding a third of the site, putting in a lot of solar panels, we’re bringing a lot of our own water on board. We’re trying to be as independent and sustainable as we possibly can and I think that’s very true to our heart.” The Fragrance Shop, meanwhile, has moved its headquarters to a new state-of-the-art facility in Trafford Park, Manchester. Owner and chief executive Sanjay Vadera says: “As a business, we have invested heavily into our ESG initiatives. Our new head office contains a large area of solar panels in Trafford Park, a sophisticated rainwater system that stores water for toilet use and a heat recovery system to recycle warm and cold air to reduce energy.” The business has also appointed a board director with responsibility for ESG to acknowledge the important part the company and the wider retail industry play in this area. Carbon neutral and beyond Cycling brand Rapha has a target to become carbon neutral by 2025, which joint managing director Daniel Blumire acknowledges is “ambitious”, but this comes after seven or eight years of work to reduce its footprint. Part of that involves using new manufacturing products with “environmentally preferred materials” and investing in its materials team. “It has been a challenge financially. These materials are generally more expensive and it’s definitely hit the margin by a few points,” Blumire admits. “Our assumption is that, as it becomes more the norm, the cost should at least stabilise and not keep going up.” Meanwhile, THG has committed to meeting its targets for net-zero carbon by 2040 through its THG x Planet Earth strategy. It has since set about dealing with sustainability-related costs by acquiring different suppliers in its supply chain. For example, THG has become a big plastics recycler after buying up plastic manufacturing sites. “We even buy used PPE from hospitals and spoiled notes materials from the Bank of England, and turn them into plastic pellets for reuse in society. “Aside from the environmental impacts, this is also becoming an increasing revenue stream for us,” says chief executive Matthew Moulding, explaining that sustainability initiatives can pay for themselves and even be profitable. Further, THG More:Trees, which works with governments internationally to plant more trees, is an initiative that encourages customers of its Ingenuity (third-party ecommerce service) to partake in. THG’s net zero targets have also now been validated by SBTi (Science Based Targets Initiative). The SBTi is a global body dedicated to empowering businesses to establish ambitious emissions reduction targets in accordance with the latest climate science. The body has confirmed THG’s sustainability targets align with the latest climate science, aimed at limiting global warming to 1.5°C above pre-industrial levels.","filter_flag":1}
{"title":"Autex Acoustics’ new colour range takes cues from the great outdoors - Architecture and Design","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvc3VwcGxpZXJzL2F1dGV4LWFjb3VzdGljcy9hdXRleC1hY291c3RpY3MtbmV3LWNvbG91ci1yYW5nZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvc3VwcGxpZXJzL2F1dGV4LWFjb3VzdGljcy9hdXRleC1hY291c3RpY3MtbmV3LWNvbG91ci1yYW5nZdIBAA?oc=5","id":"CBMiY2h0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvc3VwcGxpZXJzL2F1dGV4LWFjb3VzdGljcy9hdXRleC1hY291c3RpY3MtbmV3LWNvbG91ci1yYW5nZdIBAA","guidislink":false,"published":"Thu, 19 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=292, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvc3VwcGxpZXJzL2F1dGV4LWFjb3VzdGljcy9hdXRleC1hY291c3RpY3MtbmV3LWNvbG91ci1yYW5nZdIBAA?oc=5\" target=\"_blank\">Autex Acoustics’ new colour range takes cues from the great outdoors<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Architecture and Design<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Autex Acoustics’ new colour range takes cues from the great outdoors - Architecture and Design","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvc3VwcGxpZXJzL2F1dGV4LWFjb3VzdGljcy9hdXRleC1hY291c3RpY3MtbmV3LWNvbG91ci1yYW5nZdIBAA?oc=5\" target=\"_blank\">Autex Acoustics’ new colour range takes cues from the great outdoors<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Architecture and Design<\/font>","source.href":"https:\/\/www.architectureanddesign.com.au","source.title":"Architecture and Design","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Autex Acoustics expands its existing colour palette with a new range of rich yet muted tones inspired by the natural landscape. From deep and mysterious oceans to verdant highlands, sun-baked canyons and ancient geothermal terraces, the forward-thinking brand continues to transform the design industry with innovative acoustic solutions that marry technical performance with sophisticated aesthetics. Expertly developed to harmonise with Autex Acoustics’ current colour selection, the range is comprised of four new exciting colours: Canyon: This warm orange shade that evokes summer will give the room a feeling of openness and light. This warm orange shade that evokes summer will give the room a feeling of openness and light. Caspian: This complex colour is a chameleon capable of transforming a space, offering a seductive alternative to charcoal with deep green base notes. This complex colour is a chameleon capable of transforming a space, offering a seductive alternative to charcoal with deep green base notes. Highland: Mimicking a warm neutral tone, this subdued earthy shade will breathe new life into a room without being too overpowering. Mimicking a warm neutral tone, this subdued earthy shade will breathe new life into a room without being too overpowering. Terrace: Soft grey undertones ensure this shade is a sophisticated version of a traditional mauve. This crossover range is available across all products, including Cube™, Composition®, Frontier™, Lanes™, Quietspace® Panel, and Vertiface®. Designers now have greater options in integrating acoustic solutions into their creative vision, whether the panels are used as a discrete and unobtrusive addition to a space or as a striking visual statement. The acoustic solutions in this new colour range not only expertly fuse form and functionality, but they also reflect Autex Acoustics’ commitment to helping create a sustainable future. All products are carbon neutral and use a minimum of 45% recycled PET.","filter_flag":1}
{"title":"Coles and Liquorland promote extensive and value Christmas range - Retail World","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vcmV0YWlsd29ybGRtYWdhemluZS5jb20uYXUvY29sZXMtYW5kLWxpcXVvcmxhbmQtcHJvbW90ZS1leHRlbnNpdmUtYW5kLXZhbHVlLWNocmlzdG1hcy1yYW5nZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vcmV0YWlsd29ybGRtYWdhemluZS5jb20uYXUvY29sZXMtYW5kLWxpcXVvcmxhbmQtcHJvbW90ZS1leHRlbnNpdmUtYW5kLXZhbHVlLWNocmlzdG1hcy1yYW5nZS_SAQA?oc=5","id":"CBMiZGh0dHBzOi8vcmV0YWlsd29ybGRtYWdhemluZS5jb20uYXUvY29sZXMtYW5kLWxpcXVvcmxhbmQtcHJvbW90ZS1leHRlbnNpdmUtYW5kLXZhbHVlLWNocmlzdG1hcy1yYW5nZS_SAQA","guidislink":false,"published":"Fri, 13 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=286, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vcmV0YWlsd29ybGRtYWdhemluZS5jb20uYXUvY29sZXMtYW5kLWxpcXVvcmxhbmQtcHJvbW90ZS1leHRlbnNpdmUtYW5kLXZhbHVlLWNocmlzdG1hcy1yYW5nZS_SAQA?oc=5\" target=\"_blank\">Coles and Liquorland promote extensive and value Christmas range<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Retail World<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Coles and Liquorland promote extensive and value Christmas range - Retail World","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vcmV0YWlsd29ybGRtYWdhemluZS5jb20uYXUvY29sZXMtYW5kLWxpcXVvcmxhbmQtcHJvbW90ZS1leHRlbnNpdmUtYW5kLXZhbHVlLWNocmlzdG1hcy1yYW5nZS_SAQA?oc=5\" target=\"_blank\">Coles and Liquorland promote extensive and value Christmas range<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Retail World<\/font>","source.href":"https:\/\/retailworldmagazine.com.au","source.title":"Retail World","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Coles and Liquorland have unveiled their extensive and great value Christmas range, including more than 142 new festive supermarket products, 150 delicious new drinks and the first-ever collectable range designed by Michelin award-winning chef and ambassador Curtis Stone available exclusively at Coles, demonstrating how all Australians can enjoy celebrations within their budget this spring and summer. “A passionate team of development chefs, Aussie farmers, product developers, and food and drink specialists have gone to great lengths to curate a range of easy to prepare festive favourites, making Coles the destination for delicious food and drinks this Christmas,” according to Coles and Liquorland. From entertaining platters, canapés, the main meal, seafood, desserts, something sweet, decorations, gifts, florals and refreshments, Coles has everything Aussies need to enjoy the festive season and start planning their celebrations. In a recent survey of Coles customers, over 60% said their favourite part of Christmas was spending time with family and friends and this year 20% said they will be making more food at home this festive season (Coles Circle, Christmas Early Survey, n=7,416). To help customers enjoy their time with their loved ones, Coles has curated a Christmas range featuring 349 products in total — including 142 new supermarket products to stretch budgets further, from great value, quality, and affordable products, through to the indulgent Coles Finest range including: Coles Single Smoked Beechwood Ham is an Australian sow-stall free pork made in Western Australia, which has been smoked for additional flavour. It won bronze at the Sydney Fine Food Show in 2022. is an Australian sow-stall free pork made in Western Australia, which has been smoked for additional flavour. It won bronze at the Sydney Fine Food Show in 2022. Coles Finest Triple-Smoked Beechwood Ham is a certified carbon-neutral Australian sow-stall free pork made in Western Australia, which has been smoked for a drier meat finish with a punchy sweet flavour. is a certified carbon-neutral Australian sow-stall free pork made in Western Australia, which has been smoked for a drier meat finish with a punchy sweet flavour. Coles Finest Prosciutto-Wrapped Chicken Breast is RSPCA Approved and Australian made, offering an indulgent main course option with oozing camembert filling, salty prosciutto wrapping and fig butter puck. is RSPCA Approved and Australian made, offering an indulgent main course option with oozing camembert filling, salty prosciutto wrapping and fig butter puck. Coles Finest Hunter Valley Free Range Turkey Crown with fruity stuffing is free-range turkey breast, marinated with a blend of sea salt and seasoning, with a spiced fruit stuffing topped with a bacon lattice. is free-range turkey breast, marinated with a blend of sea salt and seasoning, with a spiced fruit stuffing topped with a bacon lattice. Coles Finest French Tartlets are perfect for Christmas entertaining. The trio of tartlet flavours include goat’s cheese and onion confit, red capsicum, goat’s cheese and mint, and cream cheese zucchini and basil. are perfect for Christmas entertaining. The trio of tartlet flavours include goat’s cheese and onion confit, red capsicum, goat’s cheese and mint, and cream cheese zucchini and basil. Coles Finest Minted Peas, Parmentier Potatoes and Parisian Carrots are bursting with sweetness and include a herb butter puck for the ultimate indulgent finish. are bursting with sweetness and include a herb butter puck for the ultimate indulgent finish. Coles Finest Blackforest Christmas Tree Cake is the show-stopping dessert option for Christmas. The decadent cake is vanilla mousse with Amarena cherries and layers of chocolate sponge, set on a hazelnut praline feuilletine, and hand-finished with icing sugar and a chocolate crumb. is the show-stopping dessert option for Christmas. The decadent cake is vanilla mousse with Amarena cherries and layers of chocolate sponge, set on a hazelnut praline feuilletine, and hand-finished with icing sugar and a chocolate crumb. Coles Christmas Negroni-Flavoured Sorbet is an orange-based sorbet that is perfectly flavoured with notes of Vermouth, Gin and Campari. is an orange-based sorbet that is perfectly flavoured with notes of Vermouth, Gin and Campari. Coles Finest Luxury Belgian Chocolate and Orange Pudding will not disappoint with Belgian chocolate, speckled sponge and notes of zesty Sicilian orange. will not disappoint with Belgian chocolate, speckled sponge and notes of zesty Sicilian orange. Coles Finest Luxury Madagascan Vanilla Meringue Wreath is a sophisticated twist on an Aussie classic. The light meringue feathers are speckled with Madagascan vanilla seeds, ready to be topped with cream and your favourite summer fruit. is a sophisticated twist on an Aussie classic. The light meringue feathers are speckled with Madagascan vanilla seeds, ready to be topped with cream and your favourite summer fruit. Canard-Duchêne NV Brut Champagne has a golden hue and delicate bubbles, and with notes of stone fruit and hints of buttery brioche, pairs perfectly with sweet or savoury appetisers. has a golden hue and delicate bubbles, and with notes of stone fruit and hints of buttery brioche, pairs perfectly with sweet or savoury appetisers. Hidden Gem Semillon Sauvignon Blanc is a refreshing, full-flavoured blend with tropical notes of zesty lemon and gooseberry, and a clean, crisp finish that pairs perfectly with canapés and recently won a Gold medal at the Riverina wine show. is a refreshing, full-flavoured blend with tropical notes of zesty lemon and gooseberry, and a clean, crisp finish that pairs perfectly with canapés and recently won a Gold medal at the Riverina wine show. Coles Festive Decorated Advent Calendar is a Christmas classic filled with scrumptious gingerbread biscuits perfect for family entertaining in the lead up to Santa’s arrival. Coles Ambassador and Michelin Star award-winning chef Curtis Stone says this year’s Coles Christmas range offers great variety, quality and value for Christmas celebrations big and small. “Christmas is such a special time of year for Aussies, and we’ve thought of everything to make sure Coles’ high-quality and delicious products cater to all Christmas styles — from a casual backyard lunch to a formal dinner with all the trimmings — and offer value to customers when they shop with my new BBQ collectable range,” Mr Stone said. “From single, double and triple-smoked hams, to a decadent luxury Belgian chocolate and orange pudding, Coles’ Christmas range has you covered no matter how you Christmas. “My favourite thing at Christmas is fresh tiger prawns which can be prepared so many different ways, grilled on the barbie, on a seafood platter with a little dipping sauce or even tossed through a salad perfect for a hot summer day.” Coles Chief Executive Officer Leah Weckert says the focus this year was to produce a wide range of delicious Christmas products that would cater to any festive celebration budget. “We know it’s been a difficult year for Aussies who are continuing to feel the pinch of cost-of-living pressures, which is why this year’s range caters to a number of different price points to help our customers celebrate Christmas, no matter their budget or festive plans,” Ms Weckert said. “We are committed to being the destination of choice this Christmas for all of our customers’ needs by ensuring our range offers value for money, quality, innovation and convenience. From decorations for the home to decadent desserts, you can truly find it all at Coles this Christmas.” Coles Liquor General Manager Customer Mia Lloyd says Australians have more choice of award-winning drops than ever before this festive season. “With 150 new products in our range, we truly have a treasure trove of high-quality drops that are great value for customers, including some of my favourites — our award-winning Hidden Gem Semillon Sauvignon Blanc which is an unbelievable $4 a bottle, James Busby Vineyard Series McLaren Vale Grenache which recently won a Double Gold at the Melbourne International Wine, Beer and Spirits competition at $40 and Canard-Duchêne NV Brut Champagne from $70,” Ms Lloyd said. “Our customers are sure to find something perfect for any festive celebration — from Christmas parties through to Boxing Day and New Years — helping to make this holiday season a time to remember.” This year’s Christmas products demonstrate the great lengths Coles continues to strive towards to ensure great value, quality and freshness for its customers, while helping family budgets go further and it could not be achieved without the dedication of incredible suppliers like Country Chef, Primo, Manbulloo Mangoes and Australian International Foods who were in Sydney to help launch their festive range. Photography: Coles Christmas 2023 Launch at Sun Studios on October 12, 2023 in Sydney, Australia. (Photos by Hanna Lassen\/Getty Images for Coles).","filter_flag":1}
