{"title":"1 company’s solution turns e-commerce returns into revenue","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce970874257aab00b8d241cd1b0&url=https%3a%2f%2fwww.homeaccentstoday.com%2findustry-news%2f1-companys-solution-turns-e-commerce-returns-into-revenue%2f&c=14300776437743639979&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce970874257aab00b8d241cd1b0&url=https%3a%2f%2fwww.homeaccentstoday.com%2findustry-news%2f1-companys-solution-turns-e-commerce-returns-into-revenue%2f&c=14300776437743639979&mkt=en-us","summary":"“With rising costs in the furniture supply chain, Retailers are rethinking their reverse logistics strategy. Our platform enables retailers to generate revenue instead of adding costs associated with ...","published":"Fri, 07 Jun 2024 17:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=7, tm_hour=17, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=159, tm_isdst=0)","news_source":"Home Accents Today","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"1 company’s solution turns e-commerce returns into revenue","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"“With rising costs in the furniture supply chain, Retailers are rethinking their reverse logistics strategy. Our platform enables retailers to generate revenue instead of adding costs associated with ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Reverse logistics\" \"new products\"&format=rss","text":"ATLANTA — LoadUp, an on-demand junk removal company offering eco-friendly solutions for residential and commercial clients, announced the creation of a dedicated division called Refurn. Refurn is a revenue generation partner for e-commerce furniture retailers and offers furniture companies opportunities to generate additional revenue in traditional areas of loss in return logistics. Refurn provides online retailers with a sustainable option for their products by creating a circular economy aimed at ending unnecessary waste. “With rising costs in the furniture supply chain, Retailers are rethinking their reverse logistics strategy. Our platform enables retailers to generate revenue instead of adding costs associated with returned products,” said Greg Workmon, CEO of LoadUp. “We’ve truly become a secret weapon for the online furniture space.” Features and benefits of Refurn include: Revenue generating services to allow businesses to offer removal, assembly or installation services to the customer directly in the checkout process via a direct and seamless integration. Re-commerce service enables businesses to change a cost center (returns) into revenue by leveraging LoadUp’s certified national reseller network which purchases and removes the item. Centralized return management offers a singular provider of different product return services nationwide that includes in-home extraction capabilities. See also:","filter_flag":1}
{"title":"Encompass Selects Blitzz’s App-Free Video Support to Identify Replacement Parts Remotely","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce970874257aab00b8d241cd1b0&url=https%3a%2f%2fwww.dcvelocity.com%2farticles%2f61041-encompass-selects-blitzz-s-app-free-video-support-to-identify-replacement-parts-remotely&c=13025809678612174817&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce970874257aab00b8d241cd1b0&url=https%3a%2f%2fwww.dcvelocity.com%2farticles%2f61041-encompass-selects-blitzz-s-app-free-video-support-to-identify-replacement-parts-remotely&c=13025809678612174817&mkt=en-us","summary":"Encompass Supply Chain Solutions uses live video and augmented reality (AR) to identify replacement parts remotely ...","published":"Fri, 14 Jun 2024 06:45:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=14, tm_hour=6, tm_min=45, tm_sec=0, tm_wday=4, tm_yday=166, tm_isdst=0)","news_source":"DC Velocity","news_image":"http:\/\/www.bing.com\/th?id=OVFT.9EfN3jDDEU20LIHBD4uhji&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":600.0,"news_imagemaxheight":309.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Encompass Selects Blitzz’s App-Free Video Support to Identify Replacement Parts Remotely","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Encompass Supply Chain Solutions uses live video and augmented reality (AR) to identify replacement parts remotely ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Reverse logistics\" \"new products\"&format=rss","text":"SAN JOSE, California, June 13, 2024 – Blitzz, the app-free mobile video platform for remote customer support, today announced that Encompass Supply Chain Solutions, a leading national provider of replacement parts and supply chain services for a diverse range of product brands, will use its live video support technology for quick and easy replacement part identification. Formed in 1953, Encompass is one of the country’s largest suppliers of repair parts for products throughout the home and complete parts supply chain management for consumer and B2B customers. In the past, when retail customers needed to identify their model numbers or parts, Encompass would try to get the information they needed over a phone call. Those conversations relied on verbal descriptions that sometimes left customers and support agents feeling confused or frustrated. With Blitzz’s app-free video support software, an Encompass support agent simply sends a link via SMS text message to a customer. Once clicked, the support agent can instantly see through the customer’s smartphone camera. They can identify model numbers and collaborate via an interactive video call without downloading third-party apps like Zoom, Webex, or Teams. Both parties can use AR to draw on the screen in real-time and identify points of interest. “We aim to provide a top-notch experience for our customers and supply them with the specific parts they need exactly when they need them. Blitzz is an invaluable tool to help us accomplish that mission,” said Jim Scarff, VP of Customer Support at Encompass. “Blitzz is very user friendly for customers and agents alike and offers seamless support that keeps our business running smoothly.” Blitzz provides the following benefits for Encompass and its customers: ● Less guesswork: With live video, customers no longer have to guess whether they’re properly identifying parts. ● Fewer callbacks: Encompass is now able to identify parts the first time a customer reaches out for assistance. ● Faster delivery: Video takes guesswork out of identifying replacement parts, so Encompass is able to process orders and send them out with less back and forth. “We’re proud to help Encompass build on their excellent reputation for customer care with the addition of remote video support,” said Rama Sreenivasan, Founder and CEO of Blitzz. “Blitzz makes it faster and easier for customers to get the help they need, and receive their replacement parts, right when they need them.” For more information about Blitzz, visit www.blitzz.co. For more information about Encompass, visit www.encompass.com. About Blitzz Blitzz is an ingenious app-free way to let remote technicians and support agents troubleshoot problems by seeing through an onsite smartphone camera: The technician or support agent texts a link, the customer clicks it, and then both are looking through the camera together. Blitzz helps companies save time and money by empowering customer support, field service and sales teams to get technical troubleshooting, inspection, audits, insurance claims, maintenance, and more done faster and safer. It facilitates millions of minutes of video monthly across a range of industries, including telecommunications, automotive, construction, power and utilities, insurance, and more. For more information about Blitzz, visit www.blitzz.co. About Encompass Formed in 1953, Encompass is one of the country’s largest suppliers of repair parts and accessories for products throughout the home. Encompass also offers complete parts supply chain management, 3PL, depot repair and reverse logistics service. In addition to consumers, we support an array of B2B customers, including manufacturers, multi-family property management, warranty providers, service networks, independent dealers and retailers. For more information, please visit solutions.encompass.com and follow us on LinkedIn and Facebook.","filter_flag":1}
{"title":"Happy Returns has selected Loop as its preferred returns portal partner for Shopify brands","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce970874257aab00b8d241cd1b0&url=https%3a%2f%2fwww.dcvelocity.com%2farticles%2f61030-happy-returns-has-selected-loop-as-its-preferred-returns-portal-partner-for-shopify-brands&c=5677891814881996126&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce970874257aab00b8d241cd1b0&url=https%3a%2f%2fwww.dcvelocity.com%2farticles%2f61030-happy-returns-has-selected-loop-as-its-preferred-returns-portal-partner-for-shopify-brands&c=5677891814881996126&mkt=en-us","summary":"“We’re excited to deepen our existing relationship with Happy Returns and bring improved software and reverse logistics capabilities to all their Shopify merchants,” said Jonathan Poma, CEO of Loop.","published":"Tue, 11 Jun 2024 17:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=11, tm_hour=17, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=163, tm_isdst=0)","news_source":"DC Velocity","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Happy Returns has selected Loop as its preferred returns portal partner for Shopify brands","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"“We’re excited to deepen our existing relationship with Happy Returns and bring improved software and reverse logistics capabilities to all their Shopify merchants,” said Jonathan Poma, CEO of Loop.","query":"https:\/\/www.bing.com\/news\/search?q=\"Reverse logistics\" \"new products\"&format=rss","text":"Loop and Happy Returns, a UPS company, have announced an expanded partnership to provide retail merchants with the most comprehensive combination of returns software and consolidation solutions available. With this expanded partnership, Loop is now Happy Returns’ preferred returns portal partner for Shopify brands. At the same time, Loop is excited to recommend Happy Returns as their preferred partner for in-person, box-free, label-free returns. While Loop and Happy Returns have been working together for more than two years, both companies are making additional investments to provide an even more seamless experience for shared customers and to ensure as many brands as possible can take advantage of Happy Returns’ industry-leading logistics and returns network alongside Loop’s best-in-class returns software, automation and analytics offerings. “We’re excited to deepen our existing relationship with Happy Returns and bring improved software and reverse logistics capabilities to all their Shopify merchants,” said Jonathan Poma, CEO of Loop. “Happy Returns already provides our merchants with access to nearly 10,000 in-person dropoff locations so that we can better meet shopper expectations and offer box-free and label-free returns, which is now the preferred return method for nearly 80% of shoppers. We look forward to seeing the impact this expanded partnership will have on our merchants and their bottom lines long-term.” “As part of UPS, we’re focused on serving the largest enterprise merchants. We’ve always been multi-platform and want to offer retailers the greatest choice in how they manage their returns. While we’ve collaborated with a network of partners to serve the Shopify ecosystem, Loop has proven to be an exceptional partner throughout our long-standing relationship. Therefore, we are pleased to recommend Loop as our preferred portal partner for Shopify,” said David Sobie, CEO of Happy Returns. “Our partnership with Loop exemplifies how we adapt and enhance the retail experience across different scales of business, thanks to a seamless integration between our two solutions.” “The optionality of Loop and the convenience of Return Bars is incredible. Together, they offer a more streamlined customer experience in today’s day and age, where nobody has a printer,” says Audra Shipstad, Customer Experience Manager at Vitality. “It makes the user experience so much better in the long run.” For more than seven years, Loop has been focused on software innovation to optimize post-purchase experiences for modern brands. Built for scale, security and reliability, representing 15% of Shopify’s GMV, Loop has been the clear choice for over 3,500 of the world’s most popular brands. Key features now available to more merchants through the partnership include: - Unparalleled customization and control with Loop Workflows which allow merchants to personalize their return policies to maximize margins - Sophisticated exchange options, including different priced exchanges and instant exchanges, driving specific outcomes and improving customer satisfaction - Third-party logistics integrations that enable faster returns processing in the warehouse - Item grading and disposition data that help merchants better understand their returns and stop fraud - Order, Returns & Exchange Tracking to deliver maximum transparency and customer satisfaction ### About Loop Loop is the leading post-purchase platform optimizing returns, exchanges, and reverse logistics for more than 3,500 of the world’s most-loved brands. Through innovative features like Workflows, Instant Exchanges, Shop Now, and Bonus Credit, Loop helps brands unlock cost savings, increase customer lifetime value, and retain more revenue. Loop has processed over 40 million returns and counting. Learn more at www.loopreturns.com Media Contact: loop@walkersands.com","filter_flag":1}
{"title":"India Vs China: Factors Driving ReCommerce And The Road Ahead","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce970874257aab00b8d241cd1b0&url=https%3a%2f%2finc42.com%2fresources%2findia-china-recommerce-road-ahead%2f&c=2116572766508499744&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce970874257aab00b8d241cd1b0&url=https%3a%2f%2finc42.com%2fresources%2findia-china-recommerce-road-ahead%2f&c=2116572766508499744&mkt=en-us","summary":"The fragmented supply chain and reverse logistics have been another hindrance ... Brands which are focused on new products would find it difficult to create the same impact since their primary ...","published":"Thu, 22 Feb 2018 16:00:00 GMT","published_parsed":"time.struct_time(tm_year=2018, tm_mon=2, tm_mday=22, tm_hour=16, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=53, tm_isdst=0)","news_source":"inc42","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"India Vs China: Factors Driving ReCommerce And The Road Ahead","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"The fragmented supply chain and reverse logistics have been another hindrance ... Brands which are focused on new products would find it difficult to create the same impact since their primary ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Reverse logistics\" \"new products\"&format=rss","text":"In China, The ReCommerce Sector Of Used Goods, Especially Electronic Gadgets Is Much More Advanced Than In India Growing up, I was a fan of the Back to the Future movie series and found the concept of time travel quite fascinating. Recently I had the opportunity to visit China with a startup delegation and see first hand the evolution of the Chinese Internet sector. It was as if I had travelled into the future and seen how widespread use of technology has become part of the day to day lives of one billion people. From self-service staffless supermarkets using facial recognition and artificial intelligence to self-driving mobile vending machines using facial recognition for payments, I could see what the future looked like first hand. I saw companies such as Alibaba & JD.com each do more business in one day (11\/11 Single’s Day) than the entire Indian consumer ecommerce market in one year. At ~$500 Bn market size, China accounts for almost half of global consumer ecommerce sales. The Indian consumer ecommerce sector is merely at $20 Bn market size. ReCommerce In China In China, the ReCommerce (Reverse Commerce) sector of used goods, especially electronic gadgets is much more advanced than in India. As per a 2017 Fung Global Retail & Tech study, the Chinese ReCommerce market is currently $60 Bn. ReCommerce is bigger than ride sharing in China, with some organised players worth over $0.5Bn. Developed markets like the US and Europe are primarily sourcing markets and there is not much demand for used gadgets. Many of the second-hand gadgets from western markets get resold in developing countries. However, there is a regulatory restriction in importing used electronics in India. Both China and India have a huge supply and demand and thus are self-contained markets. The (Unorganized) Indian Market The second-hand goods market in India especially used electronics is primarily unorganized with no company having even 1% market share in this multi-billion dollar sector. The churn, especially in smartphones is extraordinarily high as these are being replaced every 15 months. Every smartphone is expected to go through three change of hands before reaching the end of its product lifecycle. As per a Deloitte report, the growth rate of the used smartphone market is forecast to be 4-5 times higher than the overall smartphone market On one hand, there is a huge untapped supply of used smartphones which are getting replaced. On the other, since India is an extremely value-conscious market, there is a huge unmet demand for devices in good condition at lower price points, from a trusted source, with quality assurance. Currently, there is no established brand in India which has been able to create a mindspace amongst consumers in this segment. The secondary transactions primarily happen through unorganized offline dealers spread across the country. There is a huge market in the hinterland, especially in tier 2 and 3 cities. Every metro has a second-hand gray market which deals with second-hand electronics. Most of these are notorious for stolen goods. Apart from these, there are online classified ad sites which are primarily C2C (consumer to consumer). Few websites are directly dealing with buying and selling of used\/refurbished devices. Ecommerce marketplaces like Amazon and Flipkart are offering exchange options. Some marketplaces are also offering refurbished devices for sale. These are still relatively nascent though. What Is Driving ReCommerce? The aspirational nature of the Indian consumer is what recommerce appeals to. ‘Statusphere’ – the feeling of status elevation by using a better quality\/brand product or better features at a similar price point is what is helping this segment grow. This is already happening in the used cars sector where consumers have access to bigger used car at the same budget as a brand new smaller car. Evolution of technology with new features and higher specifications ensure that consumers keep wanting to change their gadgets often. The vast number of first-time buyers who are upgrading from a feature phone to a smartphone find great value in refurbished smartphones. Students and technophiles who like to keep changing their gadgets also find more bang for the buck by choosing refurbished over new gadgets. Current Challenges The primary challenge for the recommerce sector is that it is mostly unorganized. The concept of refurbished gadgets is still quite new and a layman is not even aware of the term ‘refurbished’. Most people in India have been used to dealing with the unorganized players where there is a lack of transparency, limited selection, and availability, no quality assurance or warranty and absence of clarity about the genuinity of the gadget. It is common for fake or stolen devices being sold to unwary customers. The fragmented supply chain and reverse logistics have been another hindrance for the growth of this sector so far. However, this is changing now with the growth of organized retail and ecommerce. Investor’s Dilemma Investments in this sector have been limited so far considering the market size and prevalent opportunity. The primary reason for this is the signaling mechanism which investors in India look at. The venture capital sector in India is also in the startup stage. Most of them look at comparable models in the west and replicate it in the Indian market. With time they are realising that the Indian market is unique and the opportunities and problems cannot be addressed by copy-paste models from the west. If anything, they should be looking east at China, which has more parallels with the Indian market than developed markets like the US. Growth Opportunities The growth of the entire ecosystem in India makes it inevitable for this unorganized sector to be disrupted. The most important attribute required to avail this opportunity is focused execution. Operational efficiency, partnerships across the ecosystem and optimal use of technology to converge trust, convenience and value for money to consumers is what is required to succeed in this sector. Considering the enormous growth of the recommerce sector in India going forward, it seems inevitable that pure recommerce brand(s) would emerge which would be identified with second hand and refurbished gadgets. We are already seeing this happening in the used cars segment. Brands which are focused on new products would find it difficult to create the same impact since their primary attention would be on the new products. The Road Ahead India is today the world’s fastest-growing smartphone market. Out of almost a billion mobile phone users, only 300 Mn users are currently using smartphones. The estimated size of smartphone recommerce market in India is over 100 Mn devices. ReCommerce will undoubtedly be a catalyst in bridging this digital divide of 700 Mn. We are living in extraordinary times. Anyone with a smartphone and Internet connection has access to more information than the President of the US had 20 years ago. Information is power. What change will we experience when one billion people in India have this power? Technology is radically transforming education, healthcare, financial services & utilities. The primary medium through which this technology is going to be accessed by millions will be the Smartphone – the catalyst for creating change. ReCommerce has the potential to bridge this digital divide in India between people who have access to technology and those who don’t. At the same time, reduce e-waste and help save the environment. This article has been co-written by recommerce startup Budli’s co-founders Rohit Bagaria, and Kavita Joshi, Director (Operations).","filter_flag":1}
{"title":"2 ASX shares to buy for strong diversification","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce970874257aab00b8d241cd1b0&url=https%3a%2f%2fwww.fool.com.au%2f2024%2f04%2f30%2f2-asx-shares-to-buy-for-strong-diversification%2f&c=14767167805192247113&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce970874257aab00b8d241cd1b0&url=https%3a%2f%2fwww.fool.com.au%2f2024%2f04%2f30%2f2-asx-shares-to-buy-for-strong-diversification%2f&c=14767167805192247113&mkt=en-us","summary":"Close the Loop has a global reverse logistics collection network ... These are the sorts of businesses creating new products and services that are changing how we do things in their own way.","published":"Mon, 29 Apr 2024 11:11:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=4, tm_mday=29, tm_hour=11, tm_min=11, tm_sec=0, tm_wday=0, tm_yday=120, tm_isdst=0)","news_source":"Motley Fool Australia","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"2 ASX shares to buy for strong diversification","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Close the Loop has a global reverse logistics collection network ... These are the sorts of businesses creating new products and services that are changing how we do things in their own way.","query":"https:\/\/www.bing.com\/news\/search?q=\"Reverse logistics\" \"new products\"&format=rss","text":"These two stocks have very useful tailwinds. You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources , and more. Learn More The S&P\/ASX 200 Index (ASX: XJO) is significantly weighted to ASX financial shares and ASX iron ore shares. I'm going to talk about two investments that can offer something different, with solid tailwinds and can generate strong returns. Most of us would know the big players. There are the big four banks: Commonwealth Bank of Australia (ASX: CBA), National Australia Bank Ltd (ASX: NAB), Westpac Banking Corp (ASX: WBC), and ANZ Group Holdings Ltd (ASX: ANZ). And the mining giants such as BHP Group Ltd (ASX: BHP), Fortescue Ltd (ASX: FMG) and Rio Tinto Ltd (ASX: RIO). But there's more to the stock market than iron ore miners and ASX bank shares. I believe the below two stocks can outperform the ASX 200 over the long term. Close The Loop Ltd (ASX: CLG) This business promises to send zero waste to landfills, using the items it collects for reuse and recycling. Close the Loop has a global reverse logistics collection network. It collects print cartridges, commercial printers, desktop printers, laptops, PCs, gaming devices, teleconferencing equipment, monitors, soft plastics and cosmetics. This ASX share re-manufactures over 500,000 consumer electronics per year and processes more than 25 million print consumables each year. What it can't reuse, it recycles. Major original equipment manufacturers (OEM) have ambitious ESG targets to increase circularity in the economy. Close The Loop says all OEMs need to partner with providers to achieve these goals, and the ASX share is \"at the forefront of this global market trend\". Close The Loop has a three-year revenue-sharing contract with HP in the US. HP wants to reach 75% circularity for products and packaging by 2030 – it recently reached 40%. In the FY24 first-half result, Close The Loop's revenue increased by 76% to $103 million, and the gross profit margin increased from 32.8% to 36.2%. The underlying net profit after tax (NPAT) jumped 164% to $13.2 million. I think the increasing focus on sustainability globally in the coming years bodes well for the ASX share. Betashares Cloud Computing ETF (ASX: CLDD) The ASX isn't particularly known for its technology stocks. So, why not consider an exchange-traded fund (ETF) that purely invests in cloud software companies? As the name suggests, this offering from BetaShares invests in businesses heavily involved in cloud computing. A lot of the world's digital data and software applications are maintained outside of the internet, so strong growth is forecast, according to Betashares. The portfolio prioritises businesses with a high level of revenue from cloud-based services. It includes several different subsectors, the major allocations being application software (44.8%), internet services and infrastructure (25.1%), and systems software (9.6%). Others include movies and entertainment (4.7%), human resource and employment services (4%), data centre real estate investment trusts (REITs) (3.9%), and more. Looking at the geographic allocation, three countries have a sizeable weighting: the US (89.1%), Israel (5.5%), and Canada (4.2%). Many of the underlying earnings are generated from international sources, not just in the domestic markets, so it's more diversified than it seems. Some of the businesses in the portfolio include Wix.com, Netflix, Salesforce, Workday, Shopify, Zoom and Dropbox. These are the sorts of businesses creating new products and services that are changing how we do things in their own way. Past performance is not a reliable indicator when it comes to a sector like this, but over the past five years, the index the CLDD ETF tracks has returned an average annual return of 10.8%. Over the past 10 years, the index returned an average annual return of around 21.9%.","filter_flag":1}
{"title":"Myntra is luring its customers with additional discounts — but there’s a catch","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce970874257aab00b8d241cd1b0&url=https%3a%2f%2fwww.businessinsider.in%2fmyntra-is-luring-its-customers-with-additional-discounts-but-theres-a-catch%2farticleshow%2f69035670.cms&c=6218388068639443990&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce970874257aab00b8d241cd1b0&url=https%3a%2f%2fwww.businessinsider.in%2fmyntra-is-luring-its-customers-with-additional-discounts-but-theres-a-catch%2farticleshow%2f69035670.cms&c=6218388068639443990&mkt=en-us","summary":"Earlier in 2018, the company floated an initiative in collaboration with Goonj, that allowed customers to upgrade — buy new products in return of the old clothes. Separately, as an upgrade to ...","published":"Wed, 24 Apr 2019 23:41:00 GMT","published_parsed":"time.struct_time(tm_year=2019, tm_mon=4, tm_mday=24, tm_hour=23, tm_min=41, tm_sec=0, tm_wday=2, tm_yday=114, tm_isdst=0)","news_source":"Business Insider India","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Myntra is luring its customers with additional discounts — but there’s a catch","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Earlier in 2018, the company floated an initiative in collaboration with Goonj, that allowed customers to upgrade — buy new products in return of the old clothes. Separately, as an upgrade to ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Reverse logistics\" \"new products\"&format=rss","text":"Myntra is offering extra discounts on its products, if the customer opts for ‘no return.’ The move is to cut down on the large number of returns on the ordered items. The offer is applicable to products from lifestyle, apparel, electronics and home decor categories. The e-commerce stores get nearly 15%-20% of returns on purchased items, according to a consulting firm in India. Flipkart’s subsidiary Myntra is wooing its customers by offering additional discounts on its products. But, that comes with a ‘no return’ policy.This means if the customers want to opt for additional discounts, they will have to give up on the benefits of free returns and exchanges for the products they ordered. In order to avail the extra discount, the buyer has to go for ‘non-returnable’ option while making the purchase.The additional discount on the products is up to 4%, if the buyer chooses to not return the product.The online fashion store is reportedly exercising the scheme to cut down on the large number of returns on the ordered items. According to a consulting firm tailing the retail industry in India, the e-commerce stores get nearly 15%-20% of returns on purchased items. This may be due to the fact that the returns are easy and non chargeable, it added.This scheme is valid on collection under lifestyle, home decor and electronics among others. However, the additional discount varies from product to product.Myntra is boosting its customer experience with lucrative offers, Amar Nagaram, heading Myntra, Jabong reportedly said. We keep on experimenting new features, keeping in mind the performance, he addedAccording to an ET report, the move will benefit both the company and its customers since some measure of the amount saved on reverse logistics will go to its customers. However, the scheme has not been floated by Flipkart or its other subsidiary Jabong.The e-commerce fashion giant has been rolling out attractive offers for quite sometime now. Earlier in 2018, the company floated an initiative in collaboration with Goonj, that allowed customers to upgrade — buy new products in return of the old clothes.Separately, as an upgrade to its fashion store, Myntra, in October, also launched its ‘plus size’ brand Sztori, targeting a larger range of sizes for customers.","filter_flag":1}
