{"title":"Apple’s New CO2 Neutral Products Are Cool, But Don’t Let Them Distract You From the Big Picture","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d00113f4714ae7e147a1eddf569&url=https%3a%2f%2fgizmodo.com%2fgateway%2fapple-carbon-neutral-products-apple-watch-1850834303&c=14452986948866235256&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d00113f4714ae7e147a1eddf569&url=https%3a%2f%2fgizmodo.com%2fgateway%2fapple-carbon-neutral-products-apple-watch-1850834303&c=14452986948866235256&mkt=en-us","summary":"Apple announced what it’s calling its first-ever carbon-neutral products during its Wanderlust event this Tuesday.","published":"Thu, 21 Sep 2023 17:53:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=21, tm_hour=17, tm_min=53, tm_sec=0, tm_wday=3, tm_yday=264, tm_isdst=0)","news_source":"Gizmodo","news_image":"http:\/\/www.bing.com\/th?id=OVFT.YixtM8q2AjdHA7Gpne906y&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":200.0,"news_imagemaxheight":200.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Apple’s New CO2 Neutral Products Are Cool, But Don’t Let Them Distract You From the Big Picture","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Apple announced what it’s calling its first-ever carbon-neutral products during its Wanderlust event this Tuesday.","query":"https:\/\/www.bing.com\/news\/search?q=\"Carbon Neutral\" \"new products\"&format=rss","text":"Apple announced what it’s calling its first-ever carbon-neutral products during its Wanderlust event this Tuesday. Apple explained that it was able to reduce emissions from materials and transportation in production by having suppliers switch to renewable energy. The company also announced that it would no longer use leather in its new bands for Apple Watches, or for phone cases due to the high carbon footprint from the cattle industry. Instead, the company is using a material made from almost 70% recycled content that it’s calling FineWoven. Their sustainability message came with a skit in which Apple employees and CEO Tim Cook explained to Octavia Spencer, who plays Mother Nature, that the company is on track for all of its products to be carbon neutral by 2030. 2030 Status | Mother Nature | Apple But it turns out that having an entirely carbon-neutral product depends on the combination of items purchased. “Select case and band combinations of Apple Watch Series 9, Apple Watch Ultra™ 2, and Apple Watch SE® are Apple’s first-ever carbon neutral products,” a press release about the products explained. It’s great that a multinational business is working on lowering its emissions, but major corporations need to be held to higher standards that go beyond buying the right combination of things. Apple’s large target is carbon neutrality by 2030—that should be the most important metric that we judge the company by. On one end, Apple is definitely moving in the right direction to reach that goal. According to data from the company’s 2023 sustainability report, Apple produced about 20.6 million metric tons of carbon dioxide in 2022. Just half a decade earlier in 2018, the company produced 25.2 metric tons of carbon dioxide. The company has also paired lowering overall emissions with carbon credit programs that remove CO2 from the atmosphere by restoring grassland and wetland environments worldwide. “Only after Apple steeply cuts product emissions, will the company apply high-quality carbon credits from nature-based projects for emissions that cannot yet be avoided or reduced with existing solutions,” Apple said in a statement. According to the United States Geological Survey, wetlands are actually an amazing tool for carbon sequestration. Restoring and protecting these wetlands from erosion and vegetation loss could boost natural sequestration methods. However, these projects that Apple is investing in need to be permanent in order to claim that the project did remove carbon emissions from the atmosphere, according to the Natural Resources Defense Council. Apple is also working on developing AI tools that could rival options like OpenAI or ChatGPT, Bloomberg reported in July. If developed and widely used, chatbot tools could increase Apple’s water usage. Recent data found that other major tech companies have used alarming amounts of water to cool data centers. Data from Microsoft’s latest sustainability report outlined that the software giant’s water usage spiked by more than a third between 2021 and 2022 as the company heavily invested in its AI capabilities and planned for new AI-related data centers. It also takes up a lot of energy to train machine-learning models. A report released this April by the Stanford Institute for Human-Centered Artificial Intelligence outlined how the energy needed to train models like OpenAI’s GPT-3 is enough to power an average home in the U.S. for hundreds of years. Apple has put a lot of action behind making its products and operations increasingly sustainable. But companies often switch up their tactics or decide to delay sustainability deadlines. Everyone from consumers to watchdogs has to keep an eye out on corporations, well after a company releases a well-worded press release about lowering the emissions created by products. Want more climate and environment stories? Check out Earther’s guides to decarbonizing your home, divesting from fossil fuels, packing a disaster go bag, and overcoming climate dread. And don’t miss our coverage of the latest IPCC climate report, the future of carbon dioxide removal, and the invasive plants you should rip to shreds.","filter_flag":1}
{"title":"U.S. Steel releases sustainability report, touts progress toward net zero carbon emissions","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d00113f4714ae7e147a1eddf569&url=https%3a%2f%2fwww.nwitimes.com%2fnews%2flocal%2fu-s-steel-releases-sustainability-report-touts-progress-toward-net-zero-carbon-emissions%2farticle_6e09d226-332f-11ef-a065-af55b5fc6703.html&c=9781502655648614889&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d00113f4714ae7e147a1eddf569&url=https%3a%2f%2fwww.nwitimes.com%2fnews%2flocal%2fu-s-steel-releases-sustainability-report-touts-progress-toward-net-zero-carbon-emissions%2farticle_6e09d226-332f-11ef-a065-af55b5fc6703.html&c=9781502655648614889&mkt=en-us","summary":"It for instance is working with Molten Industries and the U.S. Department of Energy to work toward carbon-neutral steelmaking and looking ... It's invested in new products like a new roofing solution ...","published":"Mon, 24 Jun 2024 17:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=24, tm_hour=17, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=176, tm_isdst=0)","news_source":"The Times of Northwest Indiana","news_image":"http:\/\/www.bing.com\/th?id=OVF.AAqQ6knnY4O3NXtOax1vGQ&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":520.0,"news_imagemaxheight":273.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"U.S. Steel releases sustainability report, touts progress toward net zero carbon emissions","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"It for instance is working with Molten Industries and the U.S. Department of Energy to work toward carbon-neutral steelmaking and looking ... It's invested in new products like a new roofing solution ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Carbon Neutral\" \"new products\"&format=rss","text":"U.S. Steel released its annual sustainability report, touting progress it has made toward net zero carbon emissions by 2025. The Pittsburgh-based steelmaker, one of the Region's largest industrial companies, put out The Future of Steel report that outlines its plans, goals, investments and ongoing efforts to reduce its greenhouse gas emissions. The report highlights U.S. Steel partnerships to reduce carbon emissions, such as through carbon capture in Gary. “U. S. Steel’s sustainability strategy is focused on our customers, our communities, our people and the planet. To meet the needs of the market today and pave the way for the industry tomorrow, our team is constantly developing and improving innovative steel products. ‘The Future of Steel’ report not only highlights our efforts but underscores how well positioned we are to continue this important work,” U. S. Steel Sr. Vice President of Sustainability and Chief Technology Officer Christian Gianni said. U.S. Steel has been working with tech firms, utilities, governments, nonprofits and universities on projects aimed to shrink its carbon footprint. It for instance is working with Molten Industries and the U.S. Department of Energy to work toward carbon-neutral steelmaking and looking to capture and mineralize the carbon emissions from its flagship Gary Works steel mill. The company invested $150 million in direct reduced grade pellets at its Minnesota Ore Operations taconite plant in Minnesota's Iron Range, which supplies ore to Gary Works. It's invested in new products like a new roofing solution with DuPont and a new non-grain oriented electrical steel line for electric vehicles at Big River Steel in Osceola, Arkansas. U.S. Steel hopes to open Big River Steel 2 later this year and bring more solar power online for the Arkansas mini-mill. The report also touts the steelmaker's achievements like being named one of the World’s Most Ethical Companies by Ethisphere, earning a top score on the Disability Equality Index, attaining a perfect score on the Human Rights Campaign Foundation’s Corporate Equality Index and achieving a record low OSHA Days Away from Work rate of 0.04, well below the benchmark for the steel industry. “U. S. Steel has a culture of caring that carries through how we treat our people all the way to the products we build. From our greenhouse gas emissions reductions and recycling progress, to the strength of our workplace for everyone including the LGBTQ+ community, veterans and more, U.S. Steel is committed to its values. Excitingly, this report also lays out a path to do even more in the years ahead,” U. S. Steel Head of Sustainability Erika Chan said.","filter_flag":1}
{"title":"Ceramics leader drives a carbon-neutral and digitalised future","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d00113f4714ae7e147a1eddf569&url=https%3a%2f%2fwww.ft.com%2fpartnercontent%2fngk%2fceramics-leader-drives-a-carbon-neutral-and-digitalised-future.html&c=8943177820115135102&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d00113f4714ae7e147a1eddf569&url=https%3a%2f%2fwww.ft.com%2fpartnercontent%2fngk%2fceramics-leader-drives-a-carbon-neutral-and-digitalised-future.html&c=8943177820115135102&mkt=en-us","summary":"“The world is currently moving towards a carbon-neutral, digital society ... with a mission to generate over ¥100bn in new products (which represent a fifth of current total sales) by 2030.","published":"Wed, 30 Nov 2022 11:47:00 GMT","published_parsed":"time.struct_time(tm_year=2022, tm_mon=11, tm_mday=30, tm_hour=11, tm_min=47, tm_sec=0, tm_wday=2, tm_yday=334, tm_isdst=0)","news_source":"The Financial Times","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Ceramics leader drives a carbon-neutral and digitalised future","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"“The world is currently moving towards a carbon-neutral, digital society ... with a mission to generate over ¥100bn in new products (which represent a fifth of current total sales) by 2030.","query":"https:\/\/www.bing.com\/news\/search?q=\"Carbon Neutral\" \"new products\"&format=rss","text":"But for some they represent opportunities to further evolve core competencies, capture markets, and contribute new social value. NGK Insulators (NGK), the world’s leading ceramics technology company, is one such challenger. Adapting to and adopting megatrends On the face of it, an energy-intensive manufacturer which generates a substantial chunk of its sales from products to filter out exhaust from internal combustion engines would seem an unlikely champion for transitioning to a decarbonised and digitalised future. But it surprisingly is. To start with, NGK is slashing its own emissions at a dramatic pace. This year, the company switched to using renewable energy in all its European factories, and is aiming to achieve the same for all factories outside Japan by 2025. It aims to achieve carbon neutrality across all operations by 2050. Simultaneously, the company is pivoting towards producing smart, fossil-fuel-free solutions for other applications. “The world is currently moving towards a carbon-neutral, digital society. We already possess many products and technologies for these areas,” says Shigeru Kobayashi, NGK’s president. “We will continue to apply our advanced technologies in responding to issues such as energy and the environment to meet the expectations of our global society.” Such solutions include the grid-scale NAS* battery to contribute to renewable energy storage; subnano-ceramic membranes to capture carbon dioxide at molecular level; and ultra-thin EnerCera* batteries to enable maintenance-free IoT devices. Moreover, the company supplies vital ceramics products used in semiconductor manufacturing, data centres, and mobile phones, among other electronic devices. Promoting new value The plan is for half of all NGK’s sales by 2030—and 80 per cent by 2050— to come from products related to carbon neutrality and digital society.","filter_flag":1}
{"title":"Conti's Etzel: 'North America is strategic growth market'","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d00113f4714ae7e147a1eddf569&url=https%3a%2f%2fwww.tirebusiness.com%2fmid-year-report%2fcontinentals-etzel-north-america-strategic-growth-market&c=161775711894294298&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d00113f4714ae7e147a1eddf569&url=https%3a%2f%2fwww.tirebusiness.com%2fmid-year-report%2fcontinentals-etzel-north-america-strategic-growth-market&c=161775711894294298&mkt=en-us","summary":"Our specialty tire portfolio is continually evolving with numerous new products introduced in the last six to ... Our ambition is to achieve carbon neutral production for all tires by 2040 and to use ...","published":"Fri, 21 Jun 2024 07:41:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=21, tm_hour=7, tm_min=41, tm_sec=0, tm_wday=4, tm_yday=173, tm_isdst=0)","news_source":"Tire Business","news_image":"http:\/\/www.bing.com\/th?id=OVFT.CILAdTIB8Gsq8Y24RQqOXC&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700.0,"news_imagemaxheight":367.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Conti's Etzel: 'North America is strategic growth market'","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Our specialty tire portfolio is continually evolving with numerous new products introduced in the last six to ... Our ambition is to achieve carbon neutral production for all tires by 2040 and to use ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Carbon Neutral\" \"new products\"&format=rss","text":"The new headquarters is quite a commitment as well. What are the benefits of the campus? With the Americas, and particularly the U.S., identified as a strategic growth market for the Continental tire business, it was imperative to expand our existing campus in a strategic way for both our existing employees and to attract future employees. We invited our team members to participate in the planning and development process from the project inception, providing input from workspace layout and meeting room functionality to color schemes, furniture selection and unique amenities within our work areas. I am not sure how often it happens, but the process inspired everyone to think about our projects, our working environment and collaboration. We did not want to develop a typical office of the past that employees had to come to with desks and meeting rooms, but rather, we created an environment that our team wants to come to. It is our workplace of the future and a destination for our staff in the post-pandemic work era. Our new Americas headquarters expansion was built to attain and qualifies for LEED Gold certification (Leadership in Environmental and Energy Design by the U.S. Green Building Council). The building incorporates energy-saving and efficient materials and was carefully planned to showcase Continental's sustainability ambitions. The project incorporated key LEED building standards including sustainable site development, water savings, energy efficiency, materials selection, and indoor environmental quality. Collaborative spaces of various sizes are located on all three levels of the building, as well as quiet areas for focused work. Being an integral part of this community for the last 15 years, it was important to remain in the vicinity of our current location. Team members are raising their families here, have lives outside of the office and while at work, engage with our community partners. That is an important part of our culture and one of the reasons Continental is repeatedly recognized as an employer of choice. This expansion reinforces our focus and commitment towards our employees, the community, our customers, and our markets. Our new headquarters expansion has been an outstanding place not only for our team to collaborate, but also to host our customers and community partners. The building's amenities and modern meeting spaces have made quite an impression. We look forward hosting future events with our partners and forging long-lasting relationships. What was the thinking behind the investment in the Retread Solutions Development Center? As a Tier 1 tire manufacturing company, offering retread services is a vital part for our truck tire product portfolio. This center allows us to make improvements to our ContiLifeCycle process and offer our Continental Retread Solutions Partners hands on training and technical support. With this new Solutions Center we are making great progress towards improving processes, developing and testing new technologies. In addition to the loyal Continental Retread Solutions Partners that we have had for years, we will expand our network coverage with new partners across the United States and continue to make headway to become a major player in the upcoming years. Your EV tire strategy has been consistent: all tires can be used for EVs. How has that been accepted by customers? Our EV compatible message has been received very positively by our customers overall. They understand the performance differences and tradeoffs between original equipment and replacement only products and that those tradeoffs are no different for tires supplied for ICEs and EVs. This understanding has helped them more successfully qualify consumers based on tire performance preferences and not vehicle propulsion type exclusively. Another part of this strategy is complexity management for the dealers, who continue to applaud us for not adding yet another new line to our portfolio knowing that we already offer products that will meet the needs of EV customers. Based on this customer feedback and our in-depth OE expertise working with EV manufacturers, we will maintain our EV compatible product line. What are some of the pleasant surprises you are seeing in the industry? The PLT business continues to be resilient, even in challenging times. We are always encouraged to see new and innovative solutions from our retail and distributor partners to bring value to our common customers. Continental has had success both partnering with fleets and expanding our fleet business. We have also seen an increase in the acceptance of our integrated solutions including retreading and digital solutions. Dealers are seeing the importance of digital tire monitoring solutions and how we can assist them in reducing costs and providing a better experience for their customers. Amid a challenging economic climate, we have observed sustained market interest in Tier 1 specialty tire products that deliver the lowest overall cost of ownership. Furthermore, we have successfully captured attention with the introduction of several new product sizes, particularly with strategic fleets looking to diversify their selection of approved products. What kind of trends are you seeing in the marketplace? Consumers using online research as part of their PLT tire buying process has continued to increase in the U.S. As a result, Continental has continually invested in our digital marketing approach to help consumers become more informed about the right tire choice and where it is available. In truck, we have seen the growth of non-USTMA imports within the replacement market. We continue to work with our dealers and fleets to position ourselves as more than just a tire manufacturer — we offer total solutions for fleets and partner with our dealers to ensure successful sell out of our products. You recently rolled out several products. Which one excites you most? Why? Last year we launched the new General G-MAX AS07, an all-season ultra-high-performance tire for passenger cars, crossovers, light trucks and SUVs. We have raised the bar in performance in the Tier 2 Ultra High-Performance All-Season segment. Specifically, the tire has best-in-class wet braking, dry braking, and snow traction while maintaining long lasting treadwear. The new ire line replaces two predecessor tire lines, the G-MAX AS05 and Grabber UHP into one UHP powerline, which reduces complexity for our dealers. Last year we have started supplying tires to Lexus in U.S., a first for Continental. With that we now can say we supply all premium OEMs in North America. In truck, our first Continental Generation 5 products, the Conti HSR 5 and Conti HDR 5, were developed over the past few years at our R&D centers in Hanover, Germany and Uvalde, Texas. Recently launched, they are designed to accommodate a sizable portion of the truck tire market. Our specialty tire portfolio is continually evolving with numerous new products introduced in the last six to twelve months. Noteworthy among these is the inclusion of metric Earthmover sizes, such as the 875\/65 R29 EM-Master, which demonstrates our ongoing growth within this segment. This addition shows our commitment to the continuous expansion of our offerings, aligning with the rapidly evolving demands of the marketplace. What other products do you expect to introduce in 2024? In Q3, we will introduce the Continental TrueContact Tour 54 as a premium all-season touring tire for passenger cars and CUV's. Not only will this new tire improve performance for the consumer, but it will also reduce complexity for our dealer partners by combining the current TrueContact Tour and PureContact LS into a single power line. We will expand the Continental Generation 5 line up which will include Continental truck's first EV compatible tire. This means that the tire meets the diverse needs required of internal combustion engine vehicles, hybrid vehicles and electric vehicles. Throughout the remainder of 2024, we are positioned to introduce new specialty tire products across all of our segments — including material handling, earthmoving, port, and agriculture. Among these innovations, the market can anticipate new fitments for forklifts, featuring integrated treadwear indicators within the solid tire segment. Additionally, we will continue to expand our Earthmover sizes to serve various vocations, introduce new solutions for ports with a focus on pre-equipped digital tire monitoring, and broaden our range of VF farm products and our industry leading MPT portfolio. Has Artificial Intelligence (AI) begun to impact business? AI, and technology in general, are changing the way brands communicate to consumers. We leverage these opportunities across the digital and social spaces to ensure we are communicating the right message at the right time to the right consumer to help them make the smart tire choice. Data is becoming a bigger tool to identify efficiencies in our processes to improve our planning processes to provide the best service levels to our customers. We expect the AI 'toolbox' to help us become even better in this area. We are investigating ways that AI can support various processes to streamline the collection and interpretation of information which ultimately will allow us to be a more agile partner to our customers. In OE, virtual tire development is already part of the product development process at Continental, new AI tools are giving us even better tools to expand the capabilities of our tools and processes. How do you get your customers to embrace sustainability? Under our Vision 2030 strategy, we will continue our ambition to become the most progressive tire manufacturer in terms of environmental and social responsibility. We focus on our products, people and the environment. Our ambition is to achieve carbon neutral production for all tires by 2040 and to use 100% sustainably sourced materials in our tire products by 2050. We pursue a holistic approach to make the material sourcing, production and use of our tires, as well as the retreading and recycling of end-of-life tires, as environmentally friendly, energy-efficient and carbon neutral as possible. The ambition of Continental Tires is to reduce its energy consumption by 20% by 2030. Since the end of 2020, the electricity that the company purchases for all locations worldwide. As an example of this ongoing effort, Continental recently announced that an important step has been taken towards the goal of complete CO2-neutral production. Continental can now produce CO2-neutral tires at the tire plant in Lousado, Portugal by switching from a boiler using steam to an innovative boiler that operates entirely on electricity. Sustainability is a paramount topic across all aspects of the value chain, and more than ever is at the top of our customers' list of requirements as a prerequisite for doing business. Continental is continuously working to advance innovative technologies and sustainable products and services along the entire tire value chain, from the procurement of sustainable materials to the recycling of end-of-life tires. On the PLT side, we see more and more attention being paid to the subject of sustainability by our customers. Whether it involves improving the CO2 footprint of their logistics operations or the continued pursuit of more environmentally friendly 'end-of-life' solutions. In truck, we encourage our customers to embrace sustainability by partnering with them in retreading their tires and utilizing Continental's digital tire monitoring system, ContiConnect. Compared to a new tire, a retreaded tire can save up to 70% of material and 24 percent of CO2 emissions. It uses 19% less water consumption and contributes up to 21 percent less air pollution. Partnered with Continental's digital tire monitoring system, ContiConnect, a fleet can maximize the life of their tire to ensure optimal pull-point prediction. Through monitoring the temperature and pressure, a fleet can protect and preserve the tire casing, ensuring a better retread. What are some of the challenges of the industry? There will continue to be pressure to improve the overall performance of our tires (improved wear, better fuel efficiency\/range, increased sustainability) while also keeping costs under control. The companies that can best accomplish this will be the winners. A key challenge facing the industry is the ongoing need to adapt to a shifting marketplace, which has experienced considerable fluctuations during and in the aftermath of the pandemic. Continual innovation and listening to our two-wheel customers guarantee that we remain relevant, leading edge, and trusted with the products we provide. Uncertainties around EV adoption rates will make the planning for short term and midterm a challenge for the OE industry. What do you want tire dealers to know about the company that they may not know? Hopefully, it is known to our PLT dealers that we remain strongly committed to understanding the challenges in their business and utilizing their direct feedback to bring solutions that can support their success. The voice of our customers is embedded in our internal decision-making processes. Continental is continuing to partner with truck tire dealers to provide an integrated solutions approach to our products and services. As a top tier brand, Continental offers the full gamut of products such as replacement tires, Original Equipment (OE) tires, retreads, digital tire monitoring and other services. Continental remains dedicated to delivering the highest value to our specialty tire dealers and end users, standing out as a leader in the industry. We are committed to ongoing investment in resources that foster both internal and external value creation. In the coming years, we aim to significantly broaden our product offerings within the specialty segment, positioning ourselves as a full solutions provider across all areas of our participation. We continually strive to facilitate the best customer experience at every stage — before, during, and after the sale — and take pride in being a preferred partner to some of the most prominent names in the industry.","filter_flag":1}
{"title":"Official Marketing Partners","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d00113f4714ae7e147a1eddf569&url=https%3a%2f%2fwww.pgatour.com%2fmarketing-partners&c=3265244381351680128&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d00113f4714ae7e147a1eddf569&url=https%3a%2f%2fwww.pgatour.com%2fmarketing-partners&c=3265244381351680128&mkt=en-us","summary":"We’re constantly transforming our portfolio, from reducing sugar in our drinks to bringing innovative new products to market ... with a goal to achieve carbon-neutral operations by 2040.","published":"Sun, 14 Apr 2024 15:24:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=4, tm_mday=14, tm_hour=15, tm_min=24, tm_sec=0, tm_wday=6, tm_yday=105, tm_isdst=0)","news_source":"PGA Tour","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Official Marketing Partners","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"We’re constantly transforming our portfolio, from reducing sugar in our drinks to bringing innovative new products to market ... with a goal to achieve carbon-neutral operations by 2040.","query":"https:\/\/www.bing.com\/news\/search?q=\"Carbon Neutral\" \"new products\"&format=rss","text":"GolfForever, the Official Golf Fitness System of the PGA TOUR, is a comprehensive, smart at-home training system that takes a science-based approach to maximizing golfers’ performance by improving flexibility, core strength, balance and rotational power. The first golf-specific home training program to embrace the approach of home exercise equipment paired with streaming instruction, GolfForever takes it one step further by customizing each golfer’s exercise routines just for them, based on a proprietary strength and flexibility test users take when starting. The result is a product and program that is safe, highly effective for any golfer and proven to work, as evidenced by a pilot study that saw users who used GolfForever three days per week for 30 days gain an average of 26 yards with their driver. With golf-specific routines designed by some of the top PGA TOUR trainers and orthopedic experts in the U.S. for any golfer, regardless of their age or physical capabilities, GolfForever users can expect to swing and perform their best – with a pain-free body – for as long as they play the game. It is used daily by more than 400 PGA TOUR and LPGA Tour players, including Scottie Scheffler, Tom Kim, Zach Johnson, Justin Leonard and Ryan Palmer, and thousands of everyday golfers alike. Founded in Aspen, Colorado in 2019 by Dr. Jeremy James, a leading specialist in chronic back pain and co-author of the Younger Next Year Back Book, GolfForever is the ideal companion to expert golf instruction. For more information go to GolfForever.com or download the mobile application on the Apple Store for IOS or Google Play for Android.","filter_flag":1}
{"title":"Tim Cook","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d00113f4714ae7e147a1eddf569&url=https%3a%2f%2fappleinsider.com%2finside%2ftim-cook&c=14846407270094752621&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d00113f4714ae7e147a1eddf569&url=https%3a%2f%2fappleinsider.com%2finside%2ftim-cook&c=14846407270094752621&mkt=en-us","summary":"When asked about how Apple deals with the stresses of coming up with new products every year ... that they ask for your permission first.\" \"Carbon-neutral economy\" During the United Nations ...","published":"Fri, 25 Dec 2020 18:57:00 GMT","published_parsed":"time.struct_time(tm_year=2020, tm_mon=12, tm_mday=25, tm_hour=18, tm_min=57, tm_sec=0, tm_wday=4, tm_yday=360, tm_isdst=0)","news_source":"AppleInsider","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Tim Cook","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"When asked about how Apple deals with the stresses of coming up with new products every year ... that they ask for your permission first.\" \"Carbon-neutral economy\" During the United Nations ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Carbon Neutral\" \"new products\"&format=rss","text":"Tim Cook is a private man whose accomplishments and philanthropy are centered around the company's desire to \"leave the planet better than we found it.\" Cook's stance on privacy, security, and user safety echos Apple's ethos and has often lead to government agitation over these issues. Time 100 list Tim Cook was included in the Time 100 list for the most influential people of 2022. This is his first appearance in the list since 2015. Laurene Powell Jobs wrote Cook's profile for the piece, and Cook was on one of the cover variants of the publication. The full Time 100 cover featuring Tim Cook, one of five covers being published. \"The intense pressure of setting and executing Apple's progression with deep precision, and of taking responsibility for the company's effects on society, is almost unimaginable,\" Laurene Powell Jobs wrote. \"Yet Tim does it with compassion and discipline, turning to nature to replenish his spirit.\" Tim Cook in public As Apple's CEO, Tim Cook spends a lot of time speaking publicly. Whether it's national news or a simple tweet, Cook's words have power as the CEO of the world's richest tech company. The following are snippets of public comments made by Cook or events he attended to provide an overview of how he presents himself and his goals to the public. 2023 As far as public appearances go, 2023 was a standard year for Tim Cook. He made several trips overseas to meet with world leaders in China, India, and other important locations for Apple's business. Apple Vision Pro was introduced during WWDC and Cook was often heard sharing that spatial computing was the future. As the year came to a close and everyone was discussing artificial intelligence, the conversation shifted. Going into 2024, Tim Cook is talking about Apple's next big step in computing, and it could be more impactful than Apple Vision Pro — Apple AI. 2022 Cook spent a lot more time in public venues in 2022 than in the previous few years since coronavirus concerns were reduced. While he didn't say much outside of his usual prepared remarks about Apple, he did attend some particularly unique venues. Aside from Cook's usual appearances during WWDC and other Apple events, he was seen in several other high-profile locations like concerts and government offices. The usual \"world tour\" type of travel also resumed in 2022. Tim Cook waving the checkered flag at the U.S. Grand Prix. Cook attended the Grand Prix in October, an Adele concert in November, and toured Japan in December. While COVID-19 is still a threat, concerns were reduced in 2022 thanks to widespread vaccines and testing — allowing such public appearances by the tech CEO. He was also the guest of honor at the sixth-annual FIRST Inspire Gala in November to celebrate and comment on STEM education, plus raise funding to support the nonprofit's mission. In a speech at that event, Cook called education the great equalizer. 2021 \"2020 was Apple's top year of innovation ever\" Tim Cook spoke with a senior college student in Beijing, He Shijie. When asked about how Apple deals with the stresses of coming up with new products every year, Cook said that diversity leads to innovation. \"There's no one formula for innovation,\" Cook said. \"What we do is we have a culture of creativity and a culture of collaboration. These two things together, when they intersect, create enormous innovation.\" \"We must unite against racism in all its forms\" After increasing violence against Asian Americans due to racist rhetoric blaming them for the coronavirus, Cook shared a Tweet on the matter. \"The rising violence against the Asian community is a painful & urgent reminder that we must unite against racism in all its forms. There is no place for hate in our society. The team at Apple stands together & we will be donating to groups providing support to those affected.\" \"Privacy is one of the top issues of the century\" During an interview, Cook shared his feelings on user privacy and how it compares to other crises that humans face. \"We've got climate change — that is huge. We've got privacy — that is huge ... and they should be weighted like that and we should put our deep thinking into that and decide how we can make these things better and how do we leave something for the next generation that is a lot better than the current situation.\" 2020 \"Users should have the choice over the data that is being collected\" Facebook says App Tracking Transparency will cause irrevocable damage to the internet, and specifically its ad-based business model. Tim Cook says Facebook need only explain why it needs to track users Cook shared the above image in a tweet that read: \"We believe users should have the choice over the data that is being collected about them and how it’s used. Facebook can continue to track users across apps and websites as before, App Tracking Transparency in iOS 14 will just require that they ask for your permission first.\" \"Carbon-neutral economy\" During the United Nations Climate Ambition Summit, Cook said that everyone has a particular burden to act on the environment. \"The choice between the bottom line and the future of our planet is a false one, and each new green innovation offers the proof,\" Cook said. He then declared \"this is no time for changes of the margins,\" and that together the group can \"transition to a carbon-neutral economy and usher in a new era of inclusive opportunity. \"Big companies deserve scrutiny\" During an interview, Tim Cook was asked about climate change and how catastrophic events like the California wildfires can change opinions on the matter. \"I think the sum total of all of these — the wildfires in the west that's essentially burning millions of acres in the west, the hurricanes in the south in my hometown, the flooding that's taken place in the northeast and the mid-Atlantic region — all of these together, I do believe, will convince the people that are not currently convinced about climate change,\" Cook said. Tim Cook's history at Apple As Chief Executive Officer, Tim Cook is the face of Apple and the executive team. However, his gigantic impact on the company goes back long before he replaced Steve Jobs in 2011. Jobs recruited him in 1998 from Compaq, where he had been vice president for corporate materials for less than a year. Before that, Cook had been at IBM for over a decade, and at that time, it would've seemed peculiar to leave the PC world to join Apple. The rivalry between IBM, plus its clone makers like Compaq, and Apple may have quietened down, but it was chiefly because Apple was failing. Apple was in such a poor state that even Cook says that \"any purely rational consideration\" meant he should stay with Compaq. Yet for all its success, Compaq made clone PCs so superficially it was no different from any other commodity computer manufacturer. Joining Apple \"I was never going to find my purpose working someplace without a clear sense of purpose of its own,\" said Cook in a 2017 commencement speech. \"I tried meditation. I sought guidance and religion. I read great philosophers and authors. In a moment of youthful indiscretion, I might even have experimented with a Windows PC. And obviously, that didn't work.\" Tim Cook with Steve Jobs Cook says that within minutes of being interviewed by Steve Jobs, he knew he wanted to join the company – and specifically that he wanted to help resurrect Apple. Steve Jobs had begun the turnaround of Apple when he rejoined in 1996. Famously, it was the iMac that began the climb back from the brink of bankruptcy. That visibility of the Jony Ive design team's work was crucial, yet the comparatively invisible role Cook took was at least as important. This was despite his not being seen as a \"product person\" consumed with design issues. It would also have been unpopular, as it was by Cook's choice that Apple closed factories and shuttered warehouses. Instead, Apple outsourced manufacturing and began the same well-controlled production that it has to this day. Where previously Apple had made computers that would sit in warehouses for months before being sold, Cook got those months down to days. He wasn't the only person to see the benefit of this. Before Cook joined Apple, PC maker Dell had pursued the same model with the logic that having few computers in warehouses meant the ability to adapt. \"If I've got 11 days of inventory and my competitor has 80,\" said Michael Dell, \"and Intel comes out with a new 450 megahertz chip, that means I'm going to get to market 69 days sooner.\" Dell already had a comparatively streamlined production process because it built to order. Apple had to change a massive operation into one that should never again be caught out with too much unsold stock. Investing smartly Equally as important as managing a stockpile-preventing process was Apple's need to predict sales. We're now familiar with Apple selling out of devices on launch day, and that is as much about the benefit of advertising its success as it is saying the predictions failed. Nonetheless, that prediction of demand is treated so seriously that there is an entire department at Apple that works on it. The current head of retail, Deirdre O'Brien, was instrumental in demand prediction for much of her three decades at Apple. It isn't just about guessing how many 5G iPhones will be sold, it's about knowing what technology Apple will need – and when. Tim Cook and Angela Ahrendts Under Tim Cook, and with the benefit of greater financial stability, Apple would take the unusual step of making very long-term investments in technology such as flash memory. Getting that right meant not only that Apple would have the supplies that it was going to need in its iPods and iPhone, but that other companies would not. Consequently, Cook's work in streamlining and growing Apple became very well known in the industry, but it wasn't until 2009 that he really became anything of a public figure. Tim Cook becomes CEO In that year, he acted as overall CEO in the first of what would be three health-related absences by Steve Jobs. While Jobs continued to make decisions for the company, Cook actually ran it. Shortly before Jobs's death in 2011 – and at the Apple co-founder's suggestion – Cook was formally made CEO of the company. This made him the seventh Apple CEO, and he's been in the position for nearly 10 years. John Scully lasted for 10 years as CEO and Steve Jobs had the title for 14. It's still the case that Sculley ultimately had the most detrimental effect on Apple, and that Jobs had the most visibly successful. But Cook's tenure has seen the CEO role change more than ever. He's taken time to recruit some key people, such as Angela Ahrendts, who ran Apple retail for five years. He's also reportedly been swift to cut people when needed. Scott Forstall was reportedly forced out of Apple over refusing to sign an apology about Apple Maps' failings Both as an individual and as CEO, Cook has been far more outspoken on social issues than any of his predecessors. Where Jobs may perhaps have cultivated the public perception of him as the face of Apple, Cook has directly presented himself as such over issues ranging from privacy and security to sexuality. Personal life In 2014, Cook came out as gay specifically to use his position to help others. \"[If] hearing that the CEO of Apple is gay can help someone struggling to come to terms with who he or she is, or bring comfort to anyone who feels alone, or inspire people to insist on their equality,\" he said, \"then it’s worth the trade-off with my own privacy.\" Tim Cook is now regularly interviewed on social issues More recently, Cook has seen criticism over Apple's resistance to providing backdoor access to iPhones for the FBI, and for how he failed to factually correct President Trump during a joint press conference. However, whether one disagrees with Cook or not, the former resistance is in line with his and Apple's stated position about protecting our privacy. And the latter is a shrewd politician who knows very well what battles like DACA are ones he cares about. More than Steve Jobs ever did, Tim Cook now also speaks publicly about issues where technology intersects with issues of politics and especially privacy. Philanthropy While Cook is more visibly engaged with social and security debates, he does continue to remain a particularly private individual. For all that he is instantly recognizable, he's still very much the face of Apple instead of a celebrity in his own right. So, for instance, it's chiefly only through required financial disclosures that we learn of how Cook regularly donates significant sums of money to charities. That's part of a plan where Cook reportedly intends to fund his nephew's education and donate the rest of his money to charity. Investments outside Apple Unsurprisingly, Cook concentrates his efforts and attention nearly exclusively on Apple, or on issues where the company plays a part. He does, however, regularly work out at a gym.","filter_flag":1}
{"title":"Optimizing Analytical Tools To Accelerate Translational Research","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d00113f4714ae7e147a1eddf569&url=https%3a%2f%2fwww.technologynetworks.com%2fproteomics%2fblog%2foptimizing-analytical-tools-to-accelerate-translational-research-387798&c=8699223640011634790&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d00113f4714ae7e147a1eddf569&url=https%3a%2f%2fwww.technologynetworks.com%2fproteomics%2fblog%2foptimizing-analytical-tools-to-accelerate-translational-research-387798&c=8699223640011634790&mkt=en-us","summary":"John Lesica, president of chromatography and mass spectrometry at Thermo Fisher Scientific, joined Technology Networks for an interview at this year's American Society for Mass Spectrometry event.","published":"Fri, 14 Jun 2024 06:33:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=14, tm_hour=6, tm_min=33, tm_sec=0, tm_wday=4, tm_yday=166, tm_isdst=0)","news_source":"technologynetworks","news_image":"http:\/\/www.bing.com\/th?id=OVFT.28ES_DAy0pXt8vAhfbjtLi&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":640.0,"news_imagemaxheight":360.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Optimizing Analytical Tools To Accelerate Translational Research","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"John Lesica, president of chromatography and mass spectrometry at Thermo Fisher Scientific, joined Technology Networks for an interview at this year's American Society for Mass Spectrometry event.","query":"https:\/\/www.bing.com\/news\/search?q=\"Carbon Neutral\" \"new products\"&format=rss","text":"Read time: 5 minutes At this year’s American Society for Mass Spectrometry (ASMS) conference, Thermo Fisher Scientific announced a variety of new mass spectrometry (MS) and chromatography instruments, in addition to software solutions, which support customers in unlocking deeper analytical insights while improving productivity and accelerating translational research. John Lesica, president of the chromatography and MS division at Thermo Fisher, joined the Technology Networks team for an interview to discuss the new instrument launches and the wider landscape of translational omics. Optimizing MS instruments for specific applications Lesica began the conversation by emphasizing the core aims behind Thermo Fisher’s recent launches. “From a product perspective, one of the things we're really trying to ask is: how do we develop products specific for the application and the customer? Our products are very robust, and they’re versatile, but obviously you want to optimize them for what a customer is doing,” Lesica said. “The three new Thermo Scientific™ OrbitrapTM AscendTM Editions that we launched are really geared at that. So, if you're a biopharma customer and you're looking to categorize complex therapeutics, you have a Tribrid that is optimized for that application from a hardware and software standpoint. Same for structural biology, where there's a lot of interest from a multiomics standpoint. These are key examples of how we think about accelerating research – it's really around optimizing the analytical tools that our customers are using.” Increasing the exposure of MS and proteomics Translational omics enables researchers to draw meaningful insights from their data and apply it in a clinical setting, enhancing our understanding of human health and disease and creating new possibilities in drug discovery. Lesica said that, at this year’s ASMS, Thermo Fisher Scientific is thinking about how the company can increase the exposure of proteomics and MS in connecting proteomics and genomics data, the end goal being to accelerate precision medicine. “When we think about precision medicine, there's been a lot of focus on genomics over the last 10–20 years, and we’ve gotten great intelligence from this field. What we've recognized, though, is that the proteins in your body help determine if you have a disease, and, if so, how fast it will progress in you. Genomics information is incredibly important, as is proteomics information – but you really need both.” “Last year we launched the Thermo Scientific™ OrbitrapTM AstralTM mass spectrometer (MS), which really is a game changer on the discovery side, and helped researchers – whether in academia or pharma – to understand: what are the biomarkers of interest that they want to go after?” said Lesica. “With that product, we accelerated the discovery side, so the next step is to advance translational science. Our focus now is to provide a complete solution for our customers from research labs to the clinic, and looking at different ways in which we can speed up that process,” Lesica added. Historically, the gold standard technology in this realm has been a triple quadrupole mass spectrometer. “It’s rock-solid technology,” Lesica said. “But there are limitations in terms of sensitivity. The feedback that we received from customers is that they had FOMO – a fear of missing out – on biomarkers of importance because they had to make a trade-off. We heard that, and using technology that we already have, we created a hybrid quadrupole–linear ion trap instrument, the Thermo Scientific™ StellarTM MS.” Stellar MS achieves 10X the quantitative sensitivity while analyzing five times more compounds for proteomics, metabolomics and lipidomics as traditional technologies. “Now, there’s no longer that fear of missing out,” Lesica said. Throughput is also of critical importance for translational research. “Typically, with a triple quadrupole, the average lab is running anywhere from 40–50 samples per day. With Stellar MS, you're able to run 100 samples per day,” Lesica says. “What we’ve also learned from our early users is that they can reduce the time of their verification methods using the technology. One customer, for instance, presented a method that once took three months to create, and now takes three days.” The Stellar MS and the Orbitrap Astral MS are very complementary technologies, Lesica emphasized: “You could use the Orbitrap Astral MS to run all of your untargeted work, and you’d say, ‘okay so these are the 700 biomarkers that I’m interested in’ before then developing your method on the Stellar MS and running all of your samples through that technology. And, of course, you can use the Vanquish UHPLC in front of both instruments as an initial separation technology.” The new Thermo Scientific Vanquish™ Neo ultra-high performance liquid chromatography (UHPLC) system Tandem Direct Injection workflow produces high-quality, consistent and biologically relevant data for proteomics labs. “Our Tandem Direct Injection workflow can be applied at scale to support liquid chromatography-mass spectrometry (LC-MS)-based omics,” Lesica said. “The system’s workflow is a perfect companion to high-throughput mass spectrometers such as the Orbitrap Astral or Stellar MS because it increases sample throughput with a ~70% increase in samples per day and decreases carryover and yields by more than 90%,” he added. Increasing and simplifying user engagement Moving from hardware to software, Lesica discussed Thermo Fisher’s latest capabilities within the Thermo Scientific™ Ardia™ platform, including Ardia Data Sync. “Today, customers will typically use a particular application to do their data analysis and to store their data. It’s usually a discrete essential analysis tool for the instrument they are using. And they’re often using an HPLC and a mass spectrometer, meaning they would use two different types of applications to both control the instrument and capture the data,” Lesica explained. Ardia provides researchers with one ecosystem. “You’re logging in with one username and password and you have a common interface that you’re working with. A key word I would use here is connections – Ardia essentially connects a liquid chromatograph, a mass spectrometer and a gas chromatograph together; it’s like they’re no longer discrete instruments,” Lesica said. He noted that additional benefits include connectivity from an operations standpoint – customers and their colleagues can connect to their instruments from home, at the office or in the laboratory using Ardia whether to run an experiment or analyze data: “It exponentially increases the engagement and simplifies user engagement when doing data analysis,” Lesica added. Consider the entire infrastructure when working to increase sustainability Sustainability in MS technology and applications was a huge focus at this year’s ASMS conference. Lesica explained how, for Thermo Fisher, efforts to reduce its carbon footprint span the entire length of its product development process: “What I’m finding is that a lot of the community focuses on the instrument and its environmental impact, which is important. For example, we’re now using one dry pump in our newest mass spectrometers—replacing two oil pumps, lowering energy consumption and maintenance needs, while reducing noise and heat production. This results in a 30% energy savings compared to existing technology. But you've got to look at the infrastructure when designing the product and how you’re manufacturing it, which has a bigger carbon impact than the individual box.” “Whenever we're thinking about a new product, sustainability is there throughout every step of the process from design, manufacturing, packaging and the entire supply chain. Both of our manufacturing sites in Germany are carbon neutral sites and we are focused on finding alternative materials in our manufacturing process in order to remove PFAS from our instruments,” Lesica said. John Lesica, president of chromatography and MS at Thermo Fisher Scientific, was speaking to Alexander Beadle, Science Writer for Technology Networks. About the interviewee John Lesica is the President of Thermo Fisher Scientific’s chromatography and mass spectrometry business. The multi-billion-dollar chromatography and mass spectrometry business and the 7,000 colleagues under John’s leadership provide innovative and productivity enhancing products and services to customers across the globe – supporting those customers with breakthrough innovations from basic research including proteomics and metabolomics to pharma and biotech to applied markets including clinical, semiconductor, food and beverage, and oil and gas.","filter_flag":1}
