{"title":"World tour for model boat inspiring citizen science against environmental pollution - Northumbria University","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijAFodHRwczovL25ld3Nyb29tLm5vcnRodW1icmlhLmFjLnVrL3ByZXNzcmVsZWFzZXMvd29ybGQtdG91ci1mb3ItbW9kZWwtYm9hdC1pbnNwaXJpbmctY2l0aXplbi1zY2llbmNlLWFnYWluc3QtZW52aXJvbm1lbnRhbC1wb2xsdXRpb24tMzI0OTkxN9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijAFodHRwczovL25ld3Nyb29tLm5vcnRodW1icmlhLmFjLnVrL3ByZXNzcmVsZWFzZXMvd29ybGQtdG91ci1mb3ItbW9kZWwtYm9hdC1pbnNwaXJpbmctY2l0aXplbi1zY2llbmNlLWFnYWluc3QtZW52aXJvbm1lbnRhbC1wb2xsdXRpb24tMzI0OTkxN9IBAA?oc=5","id":"CBMijAFodHRwczovL25ld3Nyb29tLm5vcnRodW1icmlhLmFjLnVrL3ByZXNzcmVsZWFzZXMvd29ybGQtdG91ci1mb3ItbW9kZWwtYm9hdC1pbnNwaXJpbmctY2l0aXplbi1zY2llbmNlLWFnYWluc3QtZW52aXJvbm1lbnRhbC1wb2xsdXRpb24tMzI0OTkxN9IBAA","guidislink":false,"published":"Tue, 02 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=122, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijAFodHRwczovL25ld3Nyb29tLm5vcnRodW1icmlhLmFjLnVrL3ByZXNzcmVsZWFzZXMvd29ybGQtdG91ci1mb3ItbW9kZWwtYm9hdC1pbnNwaXJpbmctY2l0aXplbi1zY2llbmNlLWFnYWluc3QtZW52aXJvbm1lbnRhbC1wb2xsdXRpb24tMzI0OTkxN9IBAA?oc=5\" target=\"_blank\">World tour for model boat inspiring citizen science against environmental pollution<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Northumbria University<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"World tour for model boat inspiring citizen science against environmental pollution - Northumbria University","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijAFodHRwczovL25ld3Nyb29tLm5vcnRodW1icmlhLmFjLnVrL3ByZXNzcmVsZWFzZXMvd29ybGQtdG91ci1mb3ItbW9kZWwtYm9hdC1pbnNwaXJpbmctY2l0aXplbi1zY2llbmNlLWFnYWluc3QtZW52aXJvbm1lbnRhbC1wb2xsdXRpb24tMzI0OTkxN9IBAA?oc=5\" target=\"_blank\">World tour for model boat inspiring citizen science against environmental pollution<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Northumbria University<\/font>","source.href":"https:\/\/newsroom.northumbria.ac.uk","source.title":"Northumbria University","query":"https:\/\/news.google.com\/rss\/search?q=\"Reclaimed Materials\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"A model sailing boat which represents a key part of a project working to banish single use plastics has embarked on a global tour that will help its message reach thousands more people and communities across the planet. Supported by Northumbria University researchers and lecturers, the Flipflopi project, which in the last ten months alone recovered 135 tonnes of post-consumer plastics from the Lamu Archipelago on the Kenyan coast with a population of just 50,000. They built the world’s first 100 per cent recycled plastic sailing boat around four years ago from reclaimed materials found on Kenya’s beaches. The materials included 30,000 discarded flip flops, which are ubiquitous in the world’s oceans. But plastic isn’t the only issue, and cross collaboration across the University is aiming to highlight the fact that natural microfibres from textiles and clothing can also harm our environment. After capturing the world’s attention on expeditions around East Africa, the Flipflopi project continues to find ways to inspire communities, governments and businesses to take action against environmental pollution. Now, a model of the traditional ‘dhow’ style vessel has arrived in Lisbon in Portugal from Dundee in Scotland as part of a travelling exhibition. The Flipflopi traditional 'dhow' model is part of the Plastic: Remaking Our World exhibition. Photo by Joana Linda © EDP Foundation. Plastic: Remaking Our World, which will be at the Museum of Art, Architecture and Technology (MAAT) until the end of August, looks at what it calls “the revolutionary and yet deeply controversial” range of synthetic products collectively referred to as ‘plastics’, opening with a film installation exploring the geological relationship between plastic and nature, and ending with the Flipflopi model as an inspirational example of contemporary efforts to rethink plastic and implement alternatives that reduce production and consumption, as well as encouraging re-use. Simon Scott-Harden, an Assistant Professor at Northumbria University’s School of Design, is part of the team behind Flipflopi and was involved in the engineering and design of the model. He explained: “We adopt what we call a full systems approach to influence behaviour change, made up of education, innovation and captivating campaigns to keep the issue front of mind. “This exhibition is a great example as it helps highlight to a global audience the novel things that can be done with plastic – its versatility really is astounding.” Now, new recycled plastic sailing vessels are being made in Kenya by local students of the project, who are learning traditional boat-building skills, as well as how beach rubbish can be recycled and embedded into a circular economy. Simon continued: “Research shows that 70 per cent of marine macro litter collected is plastic, but our mantra is that plastic is wealth!” On his most recent trip to Flipflopi HQ in Kenya in December, Simon spent time looking at new manufacturing techniques and was part of a workshop for academics to evaluate and promote different materials, including microplastics and textiles, many of which shed microfibres – microscopic natural and synthetic fibres that can be harmful if ingested by small aquatic creatures, along with chemicals sometimes used in their manufacture. Northumbria’s Dr Kelly Sheridan is part of the Northumbria team looking specifically at the abundance of microfibres and their impact. An Assistant Professor of Forensic Science in the University’s Department of Applied Sciences, Kelly led research culminating in a paper authored by Northumbria PhD student Chimdia Kechi Okafor on the Prevalence and characterisation of microfibres along the Kenyan and Tanzanian coast. Kelly explained: “Textile fibres, known as microfibres, and their prevalence in the environment have been studied by forensic scientists for decades. However, the majority of recent environmental studies have overlooked that knowledge and focused only on the characterisation of microplastic fibres. This has led to inaccurate microfibre data and much misunderstanding in the literature, culminating in a general underestimation of the threat posed by natural fibres. “The Flipflopi research outcomes have demonstrated the strength of cross-collaboration, bringing together designers, environmental scientists and forensic scientists to tackle a global environmental challenge. We need to foster a no-regrets approach, leveraging from others’ expertise if we are fully to understand environmental challenges and develop appropriate solutions to overcome them.” The Flipflopi team are continuing their holistic approach to beating plastic pollution through continuous scientific and academic collaborations, and innovation in plastic recycling techniques. They are also passing on indigenous knowledge and plastic boatbuilding skills, through a new heritage boat building training centre, so that more ocean plastics can be recovered and transformed into new products and sailing vessels for the local communities. Kelly’s colleague Dr Matteo Gallidabino, Lecturer in Forensic Chemistry at King’s College London, who also worked on the paper, feels the Flipflopi team’s full systems approach is effective. Matteo added: “We need to increase awareness of the environmental impact of the textile industry. Even if the clothes we wear are composed by natural materials, such as cotton or wool, some of the textile fibres they are made of can find their way into the environment and, potentially, accumulate into living organisms. These may be very harmful and have significant effects on biodiversity.” The multi-disciplinary approach includes a Flipflopi petition aiming to collect one million signatures, asking for a regional legislation to ban unnecessary single-use plastics East Africa, where the problem is said to have reached ‘epidemic’ proportions. The next stop for Plastic: Remaking Our World will be the Hyundai Motorstudio in Busan, South Korea. You can find out more about the Flipflopi project and add your name to its petition at theflipflopi.com. The research paper is available to read in the academic journal, Frontiers in Ecology and Evolution. Northumbria’s School of Design offers programmes across a number of disciplines, covering industrial and innovation design, while the Department of Applied Sciences offers a range of educational, research and consultancy opportunities. Find out more at northumbria.ac.uk.","filter_flag":1}
