{"title":"Revising the effectiveness of municipal waste management in Hong Kong - Frontiers","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9qb3VybmFscy9lbnZpcm9ubWVudGFsLXNjaWVuY2UvYXJ0aWNsZXMvMTAuMzM4OS9mZW52cy4yMDIzLjExNzgzNjMvZnVsbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9qb3VybmFscy9lbnZpcm9ubWVudGFsLXNjaWVuY2UvYXJ0aWNsZXMvMTAuMzM4OS9mZW52cy4yMDIzLjExNzgzNjMvZnVsbNIBAA?oc=5","id":"CBMiY2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9qb3VybmFscy9lbnZpcm9ubWVudGFsLXNjaWVuY2UvYXJ0aWNsZXMvMTAuMzM4OS9mZW52cy4yMDIzLjExNzgzNjMvZnVsbNIBAA","guidislink":false,"published":"Mon, 10 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=100, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9qb3VybmFscy9lbnZpcm9ubWVudGFsLXNjaWVuY2UvYXJ0aWNsZXMvMTAuMzM4OS9mZW52cy4yMDIzLjExNzgzNjMvZnVsbNIBAA?oc=5\" target=\"_blank\">Revising the effectiveness of municipal waste management in Hong Kong<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Revising the effectiveness of municipal waste management in Hong Kong - Frontiers","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9qb3VybmFscy9lbnZpcm9ubWVudGFsLXNjaWVuY2UvYXJ0aWNsZXMvMTAuMzM4OS9mZW52cy4yMDIzLjExNzgzNjMvZnVsbNIBAA?oc=5\" target=\"_blank\">Revising the effectiveness of municipal waste management in Hong Kong<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","source.href":"https:\/\/www.frontiersin.org","source.title":"Frontiers","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable waste management\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Although there have been many studies related to the municipal solid waste (MSW) problem in Hong Kong, only limited research has recently discussed the spatial variation of citizens’ environmental awareness in different geographical constituencies. Also, the relationship between environmental awareness of citizens and the effectiveness of waste management has been poorly understood. This research aims to evaluate the effectiveness of three proposed approaches; investigate whether the environmental awareness of citizens will affect the effectiveness of current waste management strategies; and examine the differences in the level of environmental awareness of residents in different geographical constituencies, so we can provide suggestions to help mitigate the solid waste problem. In addition, the hypothesis is that there is a relationship between environmental awareness of citizens and its effectiveness. This research adopted quantitative observations and questionnaires as well as qualitative interviews to understand the public perception about the proposed MSW charging, plastic shopping bag charging and recycling in Hong Kong. This research confirmed that the environmental awareness of Hong Kong citizens varies among various geographical constituencies. Residents in Kowloon West have comparatively lower environmental awareness may due largely to the socio-economic background of residents and comparatively unhygienic environment, and they often do not support plastic shopping bag charging and recycling. In addition, males have a lower environmental awareness than females as their attitude towards charging policy may not have much impact on their lifestyle. It is not surprising that low environmental awareness of citizens will reduce the effectiveness of current environmental policies. MSW charging tends to be effective and should be implemented in Hong Kong. Furthermore, plastic shopping bag charging can be effective in the short term but ineffective in the long term, and recycling tends to be invalid as Hong Kong has not developed a circular economy. The limitations of each policy should be considered, and more studies are needed to improve the existing policies as well as exploring novel ways to solve the MSW problem. 1 Introduction Municipal waste management is a pressing issue that challenges every country as massive amount of waste in landfills and incinerators contributes to global warming (Calabro, 2009; Hoornweg and Bhada-Tata, 2012). Waste hierarchy provides guidance for handling Municipal Solid Waste (MSW). In the waste hierarchy, there is a ranking among prevention (minimization), reuse, recycling, recovery, and disposal (Bartl, 2014). Prevention is the utmost important while disposal is the least important. Prevention includes changing citizens’ behavior to reduce waste generation and be more environmentally friendly, such as the proposed MSW charging scheme and plastic bag levy (Gregson et al., 2013). This can be achieved by enhancing product durability and extending product life cycle (Cole et al., 2019). Reuse is the mending of materials and using them more than once (Gharfalkar et al., 2015). Recycling means turning waste into new substances or products (Pires & Martinho, 2019). Recovery suggests incineration to turn waste into energy (Teigiserova et al., 2020). Disposal is the final way to handle solid waste, which comprises transporting waste to landfills (Van Ewijk and Stegemann, 2016). The MSW charging scheme was proposed in 2012 in Hong Kong and the public was consulted based on Polluter-Pays Principle (PPP). Polluters should compensate for the damage caused and pay for the cost of handling MSW (Chamizo-González et al., 2018). MSW charging encourages waste reduction instead of cost recovery (Wut et al., 2020). It is noteworthy that charging based on bags and stickers as well as weight can motivate citizens to reduce waste and provide revenue to the government, while the weight-based charging mechanism can be more precise in understanding differences in waste generation (Alzamora and Barros, 2020). Nevertheless, effective MSW charging requires monitoring and enforcement to prevent counterfeiting and violation of laws. For instance, Yang and Innes (2007) revealed more illegal waste dumping shall be induced by a charging scheme. Japan is an example showing the cases of illegal dumping increased after introducing law restrictions on domestic waste (Lee and Na, 2010). Developing countries with lower per capita Gross Domestic Product (GDP) and Human Development Index (HDI) usually use flat rate for MSW charging, have lower recycling rate and lower per capita solid waste generation; while developed countries with higher per capita GDP and HDI tend to use flat rate or Pay as you throw (PAYT) for MSW charging, and have higher recycling rate as well as higher per capita solid waste generation (Alzamora and Barros, 2020). This may be owing to higher education levels leading to higher environmental awareness as well as luxurious lifestyles of citizens in developed countries, and vice versa. By implementing PPP, the Producer Responsibility Scheme (PRS) requires corresponding stakeholders, including importers, manufacturers, wholesalers, retailers and consumers, to share the responsibility of collecting, recycling, treating and discarding waste products (Gottberg et al., 2006). Most countries implementing plastic bag charging policies have reduced their consumption of plastic bags by at least about half (Nielsen et al., 2019). For example, Ireland reduced plastic bag consumption by 90% (Convery et al., 2007); England reduced plastic bag consumption by 85% after implementing plastic bag charging levy (Poortinga et al., 2016). However, the effectiveness is usually short-term, since most policies have been implemented in recent years, the plastic bag sales may rebound in the long term (Chandra, 2020). For instance, in Sweden, plastic bag levy first caused plastic bag sales to fall by 42%, but then it increased by 23% between 2004 and 2016 (Nielsen et al., 2019). However, the cumulative impact of the plastic bag charging policies on a global scale is still uncertain, and the exact impact of such policies on reducing global plastic pollution is also doubtful. Plastic shopping bag charging is a price-based instrument implemented in 2009 in Hong Kong based on PRS to reduce public consumption of plastic bags. Unless there is an exemption, retailers should charge at least HK$0.5 for each plastic bag provided to consumers (Wan et al., 2018). A circular economy is constructed in which raw materials are designed, manufactured into products, distributed, consumed and recycled (Stahel, 2016). Recycling plays a vital role in a circular economy. Many developing countries and developed countries have utilized recycling to reduce MSW. On the one hand, developed countries usually use roadside recycling programmes to collect and sort waste for recycling (Troschinetz and Mihelcic, 2009). On the other hand, developing countries use social sectors called scavengers for such activities (Troschinetz and Mihelcic, 2009). Scavengers are low-income or no-income citizens who collect materials scattered throughout the city or concentrated at dumpsites (Wilson et al., 2006). They sell the recyclables to recycling shops, middlemen or exporters (Troschinetz and Mihelcic, 2009). Scavengers are usually forced to work in harsh conditions, putting their health and safety at risk (Nas and Jaffe, 2004). They play a vital role in saving resources and conserving the environment (Sembiring and Nitivattananon, 2010). MSW management personnel education, waste collection and segregation, and government finances are the three biggest obstacles to recycling in developing countries (Troschinetz and Mihelcic, 2009). The challenge of plastic recycling is reflected in the low recycling rate −14% of plastics are collected for global recycling, while 58% of paper and 70%–90% of iron and steel are recycled (Neufeld et al., 2016). Hong Kong is one of the most densely populated cities with a population of more than seven million people. With high population density, however, Hong Kong has limited land for development, particularly for waste management. Thus, handling solid waste, especially municipal solid waste (MSW), is a pressing issue in Hong Kong as MSW has induced a lot of environmental problems, such as land and groundwater pollution. As such, proper handling of MSW in Hong Kong is of the utmost importance to achieve sustainable development. This study mainly focuses on MSW charging, plastic shopping bag levy and recycling, which cover prevention, recycling, and disposal in the waste hierarchy. Nevertheless, MSW charging, plastic bag levy and recycling in Hong Kong, especially the variation between different territories, have been poorly investigated\/understood. In addition, public environmental awareness may affect the effectiveness of waste management in Hong Kong, but not many studies have been conducted in this aspect. This study can be used to supplement the existing literature to understand the differences of environmental attitude of people in different parts of Hong Kong. In addition, many researchers have employed quantitative research approaches to study the effectiveness of waste management, such as MSW charging (Alzamora and Barros, 2020; Yeung and Chung, 2018), plastic bag levy (He, 2012; Muralidharan and Sheehan, 2016), and recycling (Ko et al., 2020; Lawrence et al., 2020). These previous studies were mostly based on quantitative questionnaires and secondary datasets. Furthermore, the opinion from government officials and NGO members are omitted. The objectives of this research are to 1) evaluate the effectiveness of the proposed MSW charging scheme, plastic shopping bag charging, and recycling; 2) investigate whether the environmental awareness of citizens will affect the effectiveness of current waste management strategies; and 3) examine whether there were any spatial differences in the level of environmental awareness of residents in different geographical constituencies to provide suggestions to help mitigate the solid waste problem. The findings of this work provide insight to improve the existing municipal waste management policies as well as exploring new ways to solve the MSW problem. 2 Materials and methods 2.1 Study area Hong Kong, is a coastal city, located in southeast tern of China (Figure 1A). The population of Hong Kong was 7.34 million in 2016, more than double that of 1961; the proportion of the elderly in the population had also increased to 16%, while the proportion of children had dropped to 11% (Census and Statistics Department, 2015). This had shown a densely populated and ageing society. The sex ratio (referring to the number of males per thousand females) had been declining since the 1980s (Census and Statistics Department, 2012). Also, the education level of the population continued to improve. In 2016, nearly one-third of the population had attended post-secondary education programs (Census and Statistics Department, 2015). There was an increasing number of females entering the labor market (Census and Statistics Department, 2015). The median monthly income from major occupations of the working population (excluding foreign domestic helpers) was HK$15,500 in 2016, a significant increase of 29.2% compared with HK$12,000 in 2011 (Census and Statistics Department, 2017). Due to population growth and a rising living standard, a considerable amount of solid waste was discarded by citizens every day. 18 districts in Hong Kong were grouped into five geographical constituencies (Figure 1B). The focus of this study was the time period from 2000 to 2020, particularly in 2020 when COVID-19 pandemic was prevailing in Hong Kong, the social distancing policies were crucial for the MSW generation. FIGURE 1 FIGURE 1. The samples of questionnaire collected from (A) five geographical constituencies in Hong Kong and (B) 18 districts in Hong Kong. There were 9 recycling stations, 22 recycling stores, and some recycling spots in Hong Kong to facilitate recycling (EPD, 2021a; EPD, 2021b). The Environmental Protection Department (EPD) also set up some outreach teams called “Green Outreach” to offer on-site briefings for property management companies and the residents to comprehend waste classification and clean recycling (EPD, 2018). Besides, the government encouraged the recycling of Waste Electrical and Electronic Equipment (WEEE) by setting up e-waste collection stations in 18 districts during Saturdays and Sundays (Ko, 2020). 2.2 Research design This study depended on primary and secondary data obtained from diverse sources. Primary data included quantitative observations and questionnaires, as well as qualitative interviews. In terms of field observation, two recycling facilities, including recycling bins situated on streets, and reverse vending machines placed in shopping malls and supermarkets, would be selected to understand the operating mechanism of recycling as well as plastic shopping bag charging. Moreover, questionnaires would be distributed to gather the behavior of citizens and their comments towards the effectiveness of MSW charging, plastic shopping bag charging and recycling. Besides, three online interviews were conducted with various stakeholders, such as an official from the EPD, an employee of a local glass bottle recycling company, and the senior project officer of an environmental organization, Community Leap, to collect their opinion towards 1) environmental awareness of citizens, 2) effectiveness of MSW charging pilot scheme, plastic shopping bag charging and recycling in Hong Kong, 3) limitations of their own parties, and 4) suggestions to improve current waste management system. To protect the privacy of interviewees and encourage responses, only the names of the interviewees who agreed to disclose their names would be shown; the name, title or organization of other interviewees were not shown when expressing opinions in this research. Some data might also come from previous field visits related to recycling companies and landfills, as well as part-time work experience related to the proposed MSW charging pilot scheme. Regarding field observation, site visits were conducted from September 2020 to February 2021 during daytime and nighttime to collect primary data after designing the routes and locations. It aimed to figure out the operation mechanisms of the recycling facilities as well as the popularity of people using recycling facilities and purchasing plastic shopping bags. The observations associated with the said recycling facilities and supermarket were conducted in the morning (8:30 a.m. to 12:30 p.m.), afternoon (1:00 p.m. to 5:00 p.m.), and evening (5:30 p.m. to 9:30 p.m.) during a weekday and a public holiday. During the observation period, the number of people using recycling facilities as well as the number of customers buying plastic bags were recorded. A survey in terms of a questionnaire was conducted between December 2020 and February 2021 (Supporting Material). The questionnaire would investigate 1) public habits of solid waste disposal and 2) the knowledge and opinions of citizens on solid waste treatment by using stratified random sampling. The sample size was 100. The entire population was separated into groups (strata) based on the numbers of seats in five geographical constituencies of the Hong Kong Legislative Council Election in 2016, including New Territories West (26 samples), New Territories East (26 samples), Hong Kong Island (17 samples), Kowloon West (17 samples) and Kowloon East (14 samples) (Table 1; Figure 1). Samples were collected from each stratum and every district by utilizing simple random sampling. Mainly semi-closed multiple-choice questions and 5-point Likert Scale questions to measure assent of respondents with 1–5 rating scale (1 = strongly disagree, 2 = disagree, 3 = neutral, 4 = agree and 5 = strongly agree) would be asked to gather public behavior and perceptions. Microsoft Excel and ArcGIS (Version 10.8.1) were used for data analysis. TABLE 1 TABLE 1. The Sample size of the survey according to geographical constituencies. After realizing the pattern of the public using recycling facilities, the number of people purchasing plastic shopping bags in a given period of time, and their views on waste management in Hong Kong, interviews with the EPD official, an employee from a local glass bottle recycling company, and senior project officer of Community Leap were carried out in February 2021. The interviews hoped to further explore the environmental awareness of citizens, the effectiveness of the three waste management approaches, limitations of different stakeholders in waste management, and suggestions to improve the waste management strategies in Hong Kong. Both open-ended and closed-ended questions were asked, but open-ended questions accounted for the majority. 2.3 Statistical analysis With the intention of a more comprehensive analysis, this study emphasized the use of both quantitative and qualitative methodological approaches. On the one hand, quantitative methods were used to quantify the number of people using recycling facilities and buying plastic shopping bags; and through observation and questionnaire surveys, the behavior and opinions of citizens related to waste disposal as well as waste management were acquired. Then trends could be shown by using quantitative approaches. The data were analyzed by using chi-square test, independent-samples t-test, and one-way analysis of variance (ANOVA) in the SPSS. Chi-square test and the independent samples t-test were used to compare the mean score between citizens with different demographic characteristics. One-way ANOVA was used to compare the mean score among districts. Also, the mean score of some questions in the questionnaires would be presented in the form of geographic information system (GIS) maps. On the other hand, qualitative methods were used to get a thorough understanding about waste management, explain how the environmental awareness of citizens affect the current waste management and help various actors (government and NGOs) to boost the recycling rate through conducting interviews. 3 Results 3.1 Environmental awareness of citizens in Hong Kong In the interview, the interviewees from the EPD, a local glass bottle recycling company, and Community Leap revealed that the environmental awareness of citizens had been divided into two distinct groups. On the one hand, females, adolescents and high-income groups tended to have higher environmental awareness and attitude. They would attempt to reduce waste at source and carry out more recycling. On the other hand, males, middled-aged and elderly people and low-income group tended to have lower environmental awareness in a sense that the MSW problem in Hong Kong had nothing to do with them, and it was inconvenient for them to conduct environmentally friendly measures. According to the MSW charging pilot scheme conducted by Community Leap, approximately 70%–80% of participants supported MSW charging after joining the pilot scheme. The survey revealed citizens’ understanding about environmental knowledge. Respondents had to recognize the materials that were recyclables. Among 100 respondents, most of the respondents could recognize that waste paper was recyclable (97%), followed by old clothes (95%), plastics (93%), and metals (92%) (Figure 2A). However, the fewest respondents recognized that fluorescent lamps (73%) and beverage cartons (60%) were recyclables. In fact, all of the listed materials were recyclables but not all respondents were acquainted with all of the recyclables in Hong Kong (Supporting Material). FIGURE 2 FIGURE 2. (A) The materials that respondents think can be recycled and (B) the level of understanding of respondents regarding waste management. Also, respondents had a relatively high understanding about the concepts related to waste management (Figure 2B). Among 100 respondents, most of the respondents comprehended source separation of domestic waste (95%), followed by reducing waste at source (84%) and clean recycling (75%) (Figure 2B). Those three concepts were related to reducing waste and recycling. However, only about half of the respondents (49%) understood the concept of the circular economy, which implied that Hong Kong citizens paid less attention to the development of the circular economy. 3.2 MSW charging Judging from the interview, Community Leap conducted a MSW charging pilot scheme in five housing estates that covered more than 100 households, in which three to four blocks were invited to take part in the pilot scheme. After the first month of implementation of the pilot project, the waste generation rate of the housing estates was reduced by 18%, and recycling rate was increased by 29% till the last month of implementation. This indicates that MSW charging could effectively reduce MSW in Hong Kong. Regarding the implementation of MSW charging in Hong Kong, amid 100 respondents, 65 respondents (65%) agreed that MSW charging should be established, while 21 respondents (21%) opposed this proposed policy and 14 respondents (14%) had no comment (Figure 3). There was a significant difference between age and the willingness of respondents to implement MSW charging, Χ2 (4, N = 100) = 11.08, p < 0.05. People at the age of 35 or below (young adults) tended to support the implementation of MSW charging while people at the age of 36 or above (adults) tended not to support MSW charging. FIGURE 3 FIGURE 3. The public opinion about whether MSW charging should be implemented. 3.3 Plastic shopping bag charging Concerning the effectiveness of plastic bag levy, amid 100 respondents, 62% of the respondents considered that this policy could encourage them to reduce the generation of plastic waste while 30% of respondents thought that this policy could not encourage them to reduce plastic waste production (Figure 4A). There was a significant difference between residing districts and whether plastic bag levy could encourage them to reduce the production of plastic waste, Χ2 (8, N = 100) = 20.780, p < 0.05. Most residents in Hong Kong Island tended to perceive that this policy was effective, followed by that of Kowloon East and New Territories East. More residents in Kowloon West believed that this policy was ineffective, followed by that of New Territories West. FIGURE 4 FIGURE 4. Respondents’ opinion about (A) whether plastic bag levy can encourage them to reduce the production of plastic waste and (B) whether the amount of plastic bag levy should be raised. The charge of the plastic bag levy sparked off great controversy. Among 100 respondents, more than half of the respondents (54%) thought that the amount of plastic bag levy (HK$0.5 per plastic bag) should be increased. 27% of the respondents did not support the rise in plastic bag charges and 19% of respondents had no comment (Figure 4B). Among those 54 respondents who agreed with the increase in plastic bag levy, 37% of respondents considered that the amount of plastic bag levy should be raised to HK$1.1—$2 (n = 20), 25.9% of respondents suggested that the levy should be raised to HK$2.1—$3 (n = 14) and 18.5% of respondents conceived that the levy should be raised to HK$5.1 or higher (n = 10) (Figure 5). FIGURE 5 FIGURE 5. The charge of plastic bag levy that respondents want to raise. Regarding the rating and spatial distribution of tendency of respondents taking and using fewer plastic bags, amid 100 respondents, about half of respondents (49%) strongly agreed with the statement that they would take and utilize fewer plastic bags, whereas 27% of respondents agreed with this statement (Figures 6A,7). In particular, respondents in Hong Kong Island gave the highest mean rating in this statement (mean score = 4.47), followed by that of Kowloon East (mean score = 4.43) and New Territories East (mean score = 4.08). Respondents in the New Territories West gave the lowest mean rating in this statement (mean score = 3.85), followed by respondents in Kowloon West (mean score = 4.06). This indicated that Hong Kong citizens used fewer plastic bags, particularly those who lived in Hong Kong Island and Kowloon East. FIGURE 6 FIGURE 6. Rating of respondents about (A) taking and using fewer plastic bags, (B) the adequacy of recycling bins, and (C) tendency of respondents to support waste reduction. FIGURE 7 FIGURE 7. The tendency of citizens taking and using fewer plastic bags. As for the field observation conducted in a ParknShop (a large scale supermarket in Hong Kong) in the Sai Kung district, the proportion of customers who bought plastic bags in a supermarket was similar to the proportion of customers who did not buy plastic bags in a supermarket. This reflected that plastic bag levy might not be effective in the long term after a few years of the implementation of plastic bag levy. Moreover, some interviewees put forward that there was a lack of law enforcement since some small-scale shop owners would provide free plastic shopping bags to customers to carry the pre-packaged food, such as canned food, and did not charge the customer for the plastic shopping bag. 3.4 Recycling Concerns regarding the environmental awareness of citizens in recycling were more widespread, in general, 27% of the respondents strongly disagreed that the number of recycling bins was sufficient, and 23% disagreed with this statement (Figures 6B, 8A). It was noted that 26% of respondents agreed with this statement. In particular, there was also a significant difference between different residing districts, F (4, 95) = 6.699, p < 0.05. The rating was statistically significantly between people living in Hong Kong Island (3.06 ± 1.519, p < 0.05), Kowloon East (3.29 ± 1.49, p = 0.000), New Territories East (3.12 ± 1.177, p < 0.05), and New Territories West (2.65 ± 1.355, p < 0.05) compared to Kowloon West (1.35 ± 0.493). Respondents in Kowloon East gave the highest mean rating in this statement (mean score = 3.29), followed by that of New Territories East (mean score = 3.12). Respondents in the Kowloon West gave the lowest mean rating in this statement (mean score = 1.35). Therefore, the inadequate number of recycling bins is more obvious and of concern to residents in Kowloon West. This study found that there was also a statistically significant difference between different occupations as determined by one-way ANOVA, F (2, 97) = 4.074, p < 0.05. A Tukey post hoc test revealed that the rating was statistically significantly between people who worked (2.26 ± 1.268, p < 0.05) and people who were unemployed or retired (3.4 ± 1.298). There was no statistically significant difference between people who worked (p < 0.05) and people who were unemployed or retired (p < 0.05) compared to students (2.82 ± 1.424). FIGURE 8 FIGURE 8. The public rating of about (A) the adequacy of the recycling bins and (B) their initiatives to support waste reduction. Concerning the tendency and spatial distribution of the rating of respondents to support waste reduction, more than half of the respondents (52%) strongly agreed that they proactively reduced waste, followed by 35% of respondents agreeing with the statement (Figures 6C, 8B). In particular, respondents in Hong Kong Island gave the highest mean rating in this statement (mean score = 4.65), followed by that of Kowloon East (mean score = 4.5). Respondents in the Kowloon West gave the lowest mean rating in this statement (mean score = 4). An independent sample test showed that males had a significantly lower consent (4.16 ± 0.999) towards supporting waste reduction than females (4.49 ± 0.663), t (98) = −2.008, p < 0.05. More users utilized the reverse vending machine than recycling bins, and people tended to recycle more on public holidays than on weekdays. Also, there were more users in the afternoon as compared to the morning and evening. However, the number of people who recycled within 4 hours was merely about ten, which might imply a relatively low recycling rate compared with the entire population of Hong Kong. Also, it was worrying that there was some garbage mixed with the recyclables inside the recycling bins. For instance, some tissue papers were put into the waste paper recycling bin. Some beverage containers were not clean and could not be recycled, they might even contaminate other recyclables inside the recycling bin. 4 Discussion 4.1 Factors that affect the environmental awareness of Hong Kong citizens 4.1.1 Pressure-State-Response framework for waste management The Pressure-State-Response framework is proposed by the Organisation for Economic Co-operation and Development (OECD) to highlight the interconnection between human activities and the environment (Levrel et al., 2009). Human activities put pressure on the environment (pressure) and influence the environmental quality (state); society responds to these changes through changing the environment, overall economic and sectoral policies, and altering consciousness as well as behavior (social response) (Levrel et al., 2009). This research adopts the Pressure-State-Response model to explain the linkage between human activities and the MSW problem (Figure 9). FIGURE 9 FIGURE 9. Pressure-State-Response framework for waste management in Hong Kong. 4.1.2 Pressures on MSW charging In general, though the environmental awareness of residents has already improved as compared with that of citizens 20 years ago, the environmental awareness of local citizens was insufficient for them to reduce waste generation. Recently, the government proposed the MSW charging and this policy could increase citizens’ environmental awareness. The difference in the level of support for the implementation of MSW charging may indicate that young people (who are aged at 35 or below) are more environmentally aware than adults (who are aged at 36 or above). In recent decades, young people may receive more environmental education than middle-aged and elderly people. Since middle-aged and elderly people have graduated for a long time, they may not be familiar with this policy. They may not be educated about MSW charging, because this is a novel concept. They may receive information about MSW charges from fewer channels. Due to technological advancements, young people are more likely to receive information from schools, the Internet and mass media (Szeberényi, 2017). Also, parenting plays an important role in affecting the autonomous motivation to take environmentally friendly actions (Autio and Wilska, 2005). If parents can encourage pro-environmental autonomy through communicating with their children, then teenagers will tend to engage in more pro-environmental behaviors (Autio and Wilska, 2005). Therefore, it is important to publicize garbage charging to gain the support of middle-aged and elderly people, as well as conducting more environmental education in schools to successfully implement MSW charging. Despite the fact that MSW charging can be beneficial for waste reduction in Hong Kong, some citizens may still have some concerns about this policy, leading to lower supporting rate in middle-aged and elderly people as they are the major users of garbage bags. Firstly, middle-aged and elderly people prefer to reuse unclean plastic shopping bags as garbage bags instead of designated garbage bags, because using designated garbage bags may generate more plastic waste, unclean plastic bags are forced to be discarded. Secondly, some residents are dissatisfied with the design of designated garbage bags (such as too thin, insufficient garbage bag size). Thirdly, these groups of people may be less confident about the MSW charging as they believe that there is a lack of monitoring and law enforcement for this policy. Although citizens must use designated plastic bags to discard waste, street garbage bins are difficult to regulate. It is impossible that every trash bin will be equipped with closed-circuit television or manual monitoring. Illegal disposal of waste may be resulted, and huge costs are involved. Lastly, some low-income citizens may have financial problems, especially during the COVID-19 when the unemployment rate in Hong Kong has increased to 7.0% from November 2020 to January 2021, which is the peak in nearly 17 years (Census and Statistics Department, 2021). Thus, the above concerns should be addressed by solving the plastic waste problem, improving the design of designated garbage bags, monitoring as well as law enforcement to gain public support. 4.1.3 Pressures on plastic shopping bag charging The plastic bag levy prescribes the level of levy of at least $0.5\/plastic bag. This can establish opposite stimuli and enhance avoidance behavior (Kwong, 2014). However, HK$0.5 is a relatively small amount of charge compared with the living standards of citizens, and it is acceptable for citizens, which is reflected by the behavior of citizens (purchasing plastic bags) (Kwong, 2014). Also, more citizens tend to support raising the charge of plastic shopping bags. They want to increase the plastic bag levy from HK$0.5 per bag to at least HK$1.1—$2, followed by HK$2.1—$3. Some respondents even want to increase the plastic bag levy to HK$5.1 or more to enhance the deterrent effect of this policy. Once the plastic bag levy has been implemented, it may be effective for a short period of time, but not in the long term. On the one hand, citizens might be stimulated and motivated to buy fewer plastic bags in a short term. On the other hand, citizens may have adapted to the policy, and they might be willing to pay for the charge (Kwong, 2014). 4.1.4 Pressures on recycling Many citizens think it may not be necessary to recycle because it is troublesome for them to recycle, or they do not know where the recycling facility is located (Wan et al., 2014). Also, some of them may have a low environmental awareness. During observation, some people would not practice waste separation and clean recycling during recycling. Nowadays, some of the three-color recycling bins are located in some hidden places (Wan et al., 2014). In Hong Kong, three-colour waste separation bins (three-colour recycling bins) are not common, and some property management company may not properly handle the recyclables. Additionally, most recycling bins are perceived as general garbage bins in which recyclables are mixed with trash, this may be caused by lack of environmental education, so some clean recyclables cannot be properly recycled. Citizens who have a higher environmental awareness will recycle more. They would act as a role model to educate their relatives and friends about recycling. The major motivation for citizens to recycle is convenience. If the recycling bins can be located near the garbage bin or at a prominent location, people may be more likely to recycle. However, if there is no recycling bin nearby, residents will tend not to recycle. Many citizens in Hong Kong believe that the number of recycling bins is inadequate to collect their recyclables, especially those who live in the Kowloon West. Because of the relatively large number of tenement buildings in Kowloon West and the lack of management services in these tenement buildings, there are limitations in the setting up of recycling bins (Drakakis-Smith, 1976). Also, there is always a high flow of people, the ratio of recycling bins to the local population and visitors may be low (Yim et al., 2014). Besides, people who work tend to think that the number of recycling bins may be insufficient since their workplace may not have sufficient recycling bins. The inadequacy of recycling bins can hinder the willingness of citizens to recycle as well. Instructions can be placed near the recycling bins so that citizens will understand the correct procedures of clean recycling. Waste reduction is another way to lead an environmentally friendly lifestyle. An increasing number of citizens will attempt to reduce their own waste. Residents in Hong Kong Island may have a higher environmental awareness and be more proactive to reduce their waste whereas people in Kowloon West may have a lower environmental awareness and be least proactive to generate less waste. People living in Hong Kong Island tend to be wealthier and they may receive more environmental education, so they will be more likely to be aware of their behavior and surrounding environment. It is perceived that the environmental hygiene is relatively poor in Kowloon West than in other places, and there are more elderly and homeless residing in Kowloon West, especially Sham Shui Po. They may have a lower education level as well as lower environmental awareness and they may be less likely to reduce their waste. Males may have a lower environmental awareness than females and less likely to reduce their waste at source as well. Women’s environmental behaviors are affected by social norms and lifestyle towards charging policies (Wut et al., 2020). However, men’s attitude towards charging policy does not have much association with their lifestyle (Wut et al., 2020). Thus, females may be more likely to engage in environmental behaviors than males. According to the field observation, more people recycle during weekends and public holidays and in the afternoon as they may have more time to recycle. They often recycle during their spare time (Williams and Taylor, 2004). Compared with recycling bins, people tend to use more reverse vending machines for recycling, because reverse vending machines provide people with economic incentives to recycle (Tomari et al., 2017). Therefore, this is a reward program that can increase public awareness and interest in plastic recycling (Tomari et al., 2017). However, there are only reverse vending machines for recycling plastic bottles, and no other recyclable materials. In addition, many recycling bins only collect waste paper, plastic and metal, but not other types of recyclables that present in the questionaries. If the variety of recyclable items that can be received by reverse vending machines and recycle bins increase, more people are likely to recycle. However, there are some challenges of different stakeholders in waste reduction and recycling. 4.1.5 State of the MSW problem–COVID-19 pandemic During the COVID-19 pandemic, the Hong Kong government gazetted that the public should wear mask when one is boarding or on board a public transport carrier, entering or presenting in an MTR paid area, or entering or present in public place (indoor and outdoor) under the Prevention and Control of Disease (Wearing of Mask) Regulation (Cap. 599I) (The Government of the HKSAR, 2020b). Thus, every citizen produces at least one disposable mask every day when they go out. This will generate a huge amount of MSW and add burden on the existing landfills. Moreover, the local government has implemented two rounds of regulations that during 6 p.m. to 4:59 a.m. of the next day, restaurants can merely provide takeaway service and delivery instead of dine-in services (The Government of the HKSAR, 2020a). Since dining in restaurants is banned during dinner time, many people order food by using take-out or delivery services, which utilizes massive amounts of plastic packaging and contributes to a significant amount of plastic waste. Furthermore, since employees need to work from home for a certain period of time, they may have more time to stay at home and online shopping is facilitated. Online shopping may utilize more packaging to prevent goods being damaged during delivery, more solid waste may be generated. 4.2 Responses from stakeholders and recommendations 4.2.1 MSW charging Hong Kong relies on large-scale infrastructure to solve the waste problem, but it believes that the use of incineration and landfilling to treat waste is an expensive and a temporary solution, as landfills may be saturated in the foreseeable future. MSW charging can an effective and successful environmental policy which has been demonstrated by many countries and cities. This policy should be implemented as soon as possible to combat the growing problem of MSW. Regarding the design of the policy, nowadays, the government has proposed to charge oversized waste for HK$11 by using designated labels (GovHK, 2021). The government may also consider providing citizens with an option to purchase designated labels instead of designated bags. If citizens have their own plastic garbage bags, they can simply purchase the designated label and stick it on their plastic bags to replace designated bags. In this way, plastic waste can be further reduced since an additional plastic bag for holding rubbish could be avoided. As for the concerns of the designated plastic garbage bags, the thickness of the designated bags should be increased so that it will not be easily tattered. 4.2.2 Plastic shopping bag charging As reported by the citizens, the current plastic shopping bag charge (HK$0.5) may be too low, and the charge should be raised to at least HK$1.1 so as to increase the economic incentives for the public to reduce the use of plastic shopping bags. When buying goods and services, customers like a round, whole-dollar amount, followed by half-dollar amounts (Knotek II, 2008). It will be convenient for customers to pay for the plastic shopping bag if the amount is set at HK$0.5. In addition, more surveillance, inspections, and enforcement actions should be implemented to prevent store owners from providing plastic bags without charging consumers. Moreover, the government may cooperate with NGOs to organize workshops as well as distributing leaflets and posters to the residents so that they can better understand the details of the plastic shopping bag levy, such as the purpose and details of its implementation, and its importance to the Hong Kong community. The target population may be men, students, people who work, and residents of West Kowloon and New Territories West who have low environmental awareness of the policy. 4.2.3 Recycling Recycling is an essential waste management method and needs to be encouraged. A circular economy can be established if more recycling companies can recycle the materials locally and make them into new products. For example, Mil Mill is a Hong Kong wastepaper recycling company that recycles and recovers beverage cartons provided by citizens. It also cooperates with some corporations to recycle their waste papers, make them into recycled paper tissue and sell it in the market. If the government can carry out green procurement, buying recycled goods and services that have minimal negative environmental impact, other merchants may follow suit (Varnäs et al., 2009). Procurement rules for recycled products could be provided by the government. More businesses may be driven to buy recycled products and services as a result. When more people buy green items, the price may drop when the production costs start to decrease, and more people can afford to buy them. 4.3 Implications for MSW policy This study provides insights in raising public environmental awareness, gaining public support towards MSW charging, and boosting the supporting rate of plastic shopping bag levy and recycling. The most effective way to reduce MSW production and disposal is reducing waste at source. On-site observations have proved that many citizens lack awareness of garbage sorting and clean recycling. This directly causes the reduction of the recycling rate. In light of this, MSW charging scheme is indispensable for emphasizing the importance of PPP, encouraging citizens to bear self-responsibility of environmental protection. Environmental education is also a possible way to raise public awareness to enhance the continuity of MSW charging scheme. The “10Rs” principle (reduce, recover, refill, refuse, repair, repurpose, rethink, regift, reuse, and restore) should be introduced to the public and then raise citizens’ environmental awareness. MSW charging scheme should be more emphasis as it is one of the top of the waste management hierarchy to reduce waste source. But, the current policy of plastic shopping bag levy has rooms for improvement. Since the current charge of plastic shopping bags is negligible to people with different social stratum. To be more specific, the government can review and adjust the levy level of plastic shopping bags periodically according to the economic environment of the society and the usage of plastic bags. As a result, plastic shopping bag levy can remain at a reasonable level so that the policy can take into account both the affordability of the public and effectiveness. For the sake of raising public confidence in recycling, it is of paramount importance for the government to increase the transparency of recycling process. As a role of monitor, the government can cooperate with recycling companies to disclose the information about the process and desired outcomes of recycling, such as converting to more useful products. With the concerted effort of different parties and the successful implementation of the above schemes, sustainable waste management may be achieved. By reducing MSW and increasing recycling rate, the negative impacts caused by waste problems can be minimized. 5 Conclusion The results support and prove the hypothesis that there is a relationship between environmental awareness of citizens and the effectiveness of current waste management strategies in Hong Kong. As some groups of citizens may have lower environmental awareness, this may hinder the effectiveness of the three waste management approaches. There is a temporal variation that this MSW problem is expected to exacerbate as COVID-19 pandemic that has not come to an end. There is also spatial variation between different geographical constituencies, in which residents in New Territories West and Kowloon West tend to have lower environmental awareness. There are several implications provided by the research findings. Firstly, MSW charging is likely to be effective and should be implemented in Hong Kong though the contextual factors of Hong Kong are different from that of other places. However, there are some loopholes that need to be plugged. Secondly, plastic shopping bag charging can be effective in the short run but ineffective in the long run. The charge should be raised to create more economic incentives. Thirdly, circular economy is not promoted in Hong Kong. Actions have to be taken to address the problems caused by those three environmental policies. Although recycling is a crucial step in achieving sustainable waste management, our observations and field visits also found that recycling facilities are finite and scattered, which may reduce the effectiveness of recycling. Future studies can focus more on investigating the effectiveness of other waste management approaches, such as reuse, upcycling, incineration and landfilling. Also, more research is needed to supplement the spatial and temporal variation of MSW problem in Hong Kong Naughton, 2020, Tsien, 2014, Zhu, 2006. Data availability statement The raw data supporting the conclusion of this article will be made available by the authors, without undue reservation. Ethics statement The studies involving human participants were reviewed and approved by Human Research Ethics Committee (HREC), The University of Hong Kong. The patients\/participants provided their written informed consent to participate in this study. Author contributions Conceptualization: FM and LR Data curation: FM and TW Formal analysis: FM and CC Investigation: FM Methodology: FM and LR Writing—original draft: FM Writing—review and editing: TW and LR Supervision: LR. Funding This research was financially supported by the Undergraduate Research Fellowship Programme (URFP) and the Hui Oi-Chow Trust Fund (Grant: 263690564). Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https:\/\/www.frontiersin.org\/articles\/10.3389\/fenvs.2023.1178363\/full#supplementary-material References Autio, M., and Wilska, T.-A. (2005). Young people in knowledge society: Possibilities to fulfil ecological goals. Prog. Industrial Ecol. 2 (3-4), 403–426. doi:10.1504\/pie.2005.007817 CrossRef Full Text | Google Scholar Census and Statistics Department, (2015). 2016 Population By-census results reveal latest demographic trends. https:\/\/www.bycensus2016.gov.hk\/en\/Snapshot-01.html. Google Scholar Census and Statistics Department, (2017). Population by-census main results, https:\/\/www.statistics.gov.hk\/pub\/B11200982016XXXXB0100.pdf. Google Scholar Census and Statistics Department, (2021). Unemployment and underemployment statistics for november 2020 - january 2021. https:\/\/www.info.gov.hk\/gia\/general\/202102\/18\/P2021021800319.htm. Google Scholar Census and Statistics Department, (2012). Women and men in Hong Kong key statistics. https:\/\/www.censtatd.gov.hk\/en\/EIndexbySubject.html?scode=180&pcode=B1130303. Google Scholar Chamizo-González, J., Cano-Montero, E.-I., and Muñoz-Colomina, C.-I. (2018). Does funding of waste services follow the polluter pays principle? The case of Spain. J. Clean. Prod. 183, 1054–1063. doi:10.1016\/j.jclepro.2018.02.225 CrossRef Full Text | Google Scholar Chandra, G. (2020). Non-monetary intervention to discourage consumption of single-use plastic bags. Behav. Public Policy 7 (1), 143–156. doi:10.1017\/bpp.2020.9 CrossRef Full Text | Google Scholar Cole, C., Gnanapragasam, A., Cooper, T., and Singh, J. (2019). An assessment of achievements of the WEEE directive in promoting movement up the waste hierarchy: Experiences in the UK. Waste Manag. 87, 417–427. doi:10.1016\/j.wasman.2019.01.046 PubMed Abstract | CrossRef Full Text | Google Scholar Convery, F., McDonnell, S., and Ferreira, S. (2007). The most popular tax in europe? Lessons from the Irish plastic bags levy. Environ. Resour. Econ. 38, 1–11. doi:10.1080\/00420987620080571 CrossRef Full Text | Google Scholar Drakakis-Smith, D. (1976). Urban renewal in an asian context: A case study in Hong Kong. Urban Stud. 13 (3), 295–305. CrossRef Full Text | Google Scholar Environmental Protection Department [Epd], (2020). Waste recycling statistics. https:\/\/www.wastereduction.gov.hk\/en\/quickaccess\/stat_recycle.htm. Google Scholar Ewijk, S., and Stegemann, J. (2016). Limitations of the waste hierarchy for achieving absolute reductions in material throughput. J. Clean. Prod. 132, 122–128. doi:10.1016\/j.jclepro.2014.11.051 CrossRef Full Text | Google Scholar Gottberg, A., Morris, J., Pollard, S., Mark-Herbert, C., and Cook, M. (2006). Producer responsibility, waste minimisation and the WEEE Directive: Case studies in eco-design from the European lighting sector. Sci. Total Environ. 359 (1-3), 38–56. doi:10.1016\/j.scitotenv.2005.07.001 PubMed Abstract | CrossRef Full Text | Google Scholar Gregson, N., Crang, M., Laws, J., Fleetwood, T., and Holmes, H. (2013). Moving up the waste hierarchy: Car boot sales, reuse exchange and the challenges of consumer culture to waste prevention. Resour. Conservation Recycl. 77, 97–107. doi:10.1016\/j.resconrec.2013.06.005 CrossRef Full Text | Google Scholar He, H. (2012). Effects of environmental policy on consumption: Lessons from the Chinese plastic bag regulation. Environ. Dev. Econ. 17 (4), 407–431. doi:10.1017\/s1355770x1200006x CrossRef Full Text | Google Scholar Hoornweg, D., and Bhada-Tata, P. (2012). What a waste: A global review of solid waste management. World Bank, Washington, DC, USA. Google Scholar Knotek, E. S. (2008). Convenient prices, currency, and nominal rigidity: Theory with evidence from newspaper prices. J. Monetary Econ. 55 (7), 1303–1316. doi:10.1016\/j.jmoneco.2008.07.009 CrossRef Full Text | Google Scholar Ko, C. (2020). Waste management–A case study of producer responsibility scheme (PRS) on waste electrical and electronic equipment (WEEE) in Hong Kong. https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=3715404. Google Scholar Kwong, K. L. (2014). Investigation of policies, environmental impacts, consumption and fate of plastic bags. Plymouth Student Sci. 7, 100–139. Google Scholar Lawrence, K., Cooper, V., and Kissoon, P. (2020). Sustaining voluntary recycling programmes in a country transitioning to an integrated solid waste management system. J. Environ. Manag. 257, 109966. doi:10.1016\/j.jenvman.2019.109966 CrossRef Full Text | Google Scholar Lee, S. C., and Na, S. I. (2010). E-Waste recycling systems and sound circulative economies in East asia: A comparative analysis of systems in Japan, South Korea, China and taiwan. Sustainability 2 (6), 1632–1644. doi:10.1007\/s10531-008-9507-0 CrossRef Full Text | Google Scholar Levrel, H., Kerbiriou, C., Couvet, D., and Weber, J. (2009). OECD pressure–state–response indicators for managing biodiversity: A realistic perspective for a French biosphere reserve. Biodivers. Conservation 18 (7), 1719–1732. CrossRef Full Text | Google Scholar Muralidharan, S., and Sheehan, K. (2016). Tax” and “fee” message frames as inhibitors of plastic bag usage among shoppers: A social marketing application of the theory of planned behavior. Soc. Mark. Q., 22 (3), 200–217. doi:10.1177\/1524500416631522 CrossRef Full Text | Google Scholar Naughton, C. (2020). Will the COVID-19 pandemic change waste generation and composition? The need for more real-time waste management data and systems thinking. Resour. Conservation, Recycl. 162, 105050. doi:10.1016\/j.resconrec.2020.105050 CrossRef Full Text | Google Scholar Neufeld, L., Stassen, F., Sheppard, R., and Gilman, T. (2016). The new plastics economy: Rethinking the future of plastics. World Economic Forum, Cologny, Switzerland. Google Scholar Nielsen, T. D., Holmberg, K., and Stripple, J. (2019). Need a bag? A review of public policies on plastic carrier bags – where, how and to what effect? Waste Manag. 87, 428–440. doi:10.1016\/j.wasman.2019.02.025 PubMed Abstract | CrossRef Full Text | Google Scholar Poortinga, W., Sautkina, E., Thomas, G. O., and Wolstenholme, E. (2016). The English plastic bag charge: Changes in attitudes and behaviour, Cardiff University, Cardiff, United Kingdom. Google Scholar Sembiring, E., and Nitivattananon, V. (2010). Sustainable solid waste management toward an inclusive society: Integration of the informal sector. Resour. Conservation Recycl. 54 (11), 802–809. doi:10.1016\/j.resconrec.2009.12.010 CrossRef Full Text | Google Scholar Szeberényi, A. (2017). Environmentally conscious lifestyle analysis among high school and University students in a Hungarian rural town of the Heves County. Visegrad J. Bioeconomy Sustain. Dev. 6 (2), 74–78. doi:10.1515\/vjbsd-2017-0013 CrossRef Full Text | Google Scholar Teigiserova, D. A., Hamelin, L., and Thomsen, M. (2020). Towards transparent valorization of food surplus, waste and loss: Clarifying definitions, food waste hierarchy, and role in the circular economy. Sci. Total Environ. 706, 136033. doi:10.1016\/j.scitotenv.2019.136033 PubMed Abstract | CrossRef Full Text | Google Scholar The Government of the HKSAR (2020a). The Government of the Hong Kong special administrative region [The Government of the HKSAR]. Dine-in service rule exemption set. News.gov.hk. Retrieved from https:\/\/www.news.gov.hk\/eng\/2020\/07\/20200716\/20200716_181658_782.html. Google Scholar The Government of the HKSAR (2020b). The Government of the Hong Kong special administrative region [The Government of the HKSAR]. Government amends the prevention and control of disease (wearingof mask) regulation and extends social distancing measures. Press Releases. Retrieved from https:\/\/www.info.gov.hk\/gia\/general\/202008\/25\/P2020082500904.htm?fontSize=1. Google Scholar Tomari, R., Kadir, A. A., Zakaria, W. N. W., Zakaria, M. F., Abd Wahab, M. H., and Jabbar, M. H. (2017). Development of reverse vending machine (RVM) framework for implementation to a standard recycle bin. Procedia Comput. Sci. 105, 75–80. doi:10.1016\/j.procs.2017.01.202 CrossRef Full Text | Google Scholar Tsien, T. (2014). Ageing in place in Hong Kong, Annual scientific conference on ageing, Hong Kong Polytechnic University, Singapore. Google Scholar Varnäs, A., Balfors, B., and Faith-Ell, C. (2009). Environmental consideration in procurement of construction contracts: Current practice, problems and opportunities in green procurement in the Swedish construction industry. J. Clean. Prod. 17 (13), 1214–1222. doi:10.1016\/j.jclepro.2009.04.001 CrossRef Full Text | Google Scholar Wan, C., Shen, G. Q., and Choi, S. (2018). Differential public support for waste management policy: The case of Hong Kong. J. Clean. Prod. 175, 477–488. doi:10.1016\/j.jclepro.2017.12.060 CrossRef Full Text | Google Scholar Wan, C., Shen, G. Q., and Yu, A. (2014). The role of perceived effectiveness of policy measures in predicting recycling behaviour in Hong Kong. Resour. Conservation Recycl. 83, 141–151. doi:10.1016\/j.resconrec.2013.12.009 CrossRef Full Text | Google Scholar Wilson, D. C., Velis, C., and Cheeseman, C. (2006). Role of informal sector recycling in waste management in developing countries. Habitat Int. 30 (4), 797–808. doi:10.1016\/j.habitatint.2005.09.005 CrossRef Full Text | Google Scholar Wut, T. M., Ng, P., Kan, H. K. M., and Fong, C. S. (2021). Does gender matter? Attitude towards waste charging policy and pro-environmental behaviours. Soc. Responsib. J. 17 (8), 1100–1115. doi:10.1108\/srj-03-2020-0102 CrossRef Full Text | Google Scholar Yang, H. T., and Innes, R. (2007). Economic incentives and residential waste management in taiwan: An empirical investigation. Environ. Resour. Econ. 37 (3), 489–519. doi:10.1007\/s10640-006-9040-0 CrossRef Full Text | Google Scholar Yeung, I. M., and Chung, W. (2018). Factors that affect the willingness of residents to pay for solid waste management in Hong Kong. Environmental Science and Pollution Research 25, 7504–7517. PubMed Abstract | CrossRef Full Text | Google Scholar Yim, S. H., Fung, J. C. H., and Ng, E. Y. (2014). An assessment indicator for air ventilation and pollutant dispersion potential in an urban canopy with complex natural terrain and significant wind variations. Atmos. Environ. 94, 297–306. doi:10.1016\/j.atmosenv.2014.05.044 CrossRef Full Text | Google Scholar","filter_flag":1}
{"title":"CS Tuiya invites Danish waste recyclers to invest in Kenya - The Star Kenya","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LnRoZS1zdGFyLmNvLmtlL25ld3MvMjAyMy0wNC0yNy1jcy10dWl5YS1pbnZpdGVzLWRhbmlzaC13YXN0ZS1yZWN5Y2xlcnMtdG8taW52ZXN0LWluLWtlbnlhL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LnRoZS1zdGFyLmNvLmtlL25ld3MvMjAyMy0wNC0yNy1jcy10dWl5YS1pbnZpdGVzLWRhbmlzaC13YXN0ZS1yZWN5Y2xlcnMtdG8taW52ZXN0LWluLWtlbnlhL9IBAA?oc=5","id":"CBMiZmh0dHBzOi8vd3d3LnRoZS1zdGFyLmNvLmtlL25ld3MvMjAyMy0wNC0yNy1jcy10dWl5YS1pbnZpdGVzLWRhbmlzaC13YXN0ZS1yZWN5Y2xlcnMtdG8taW52ZXN0LWluLWtlbnlhL9IBAA","guidislink":false,"published":"Thu, 27 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=117, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LnRoZS1zdGFyLmNvLmtlL25ld3MvMjAyMy0wNC0yNy1jcy10dWl5YS1pbnZpdGVzLWRhbmlzaC13YXN0ZS1yZWN5Y2xlcnMtdG8taW52ZXN0LWluLWtlbnlhL9IBAA?oc=5\" target=\"_blank\">CS Tuiya invites Danish waste recyclers to invest in Kenya<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Star Kenya <\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CS Tuiya invites Danish waste recyclers to invest in Kenya - The Star Kenya","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LnRoZS1zdGFyLmNvLmtlL25ld3MvMjAyMy0wNC0yNy1jcy10dWl5YS1pbnZpdGVzLWRhbmlzaC13YXN0ZS1yZWN5Y2xlcnMtdG8taW52ZXN0LWluLWtlbnlhL9IBAA?oc=5\" target=\"_blank\">CS Tuiya invites Danish waste recyclers to invest in Kenya<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Star Kenya <\/font>","source.href":"https:\/\/www.the-star.co.ke","source.title":"The Star Kenya","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable waste management\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Environment CS Soipan Tuiya has invited Danish waste recycling companies to invest in Kenya's emerging circular economy. She said the country has established a robust regulatory framework to anchor the sector, assuring them of government's support. She spoke on Thursday during the official opening of the 2023 Loop Forum in Copenhagen, Denmark, where she delivered the key note address at the invitation of the Danish Government. \"I therefore invite Danish, and by extension, Scandinavian investors interested in tapping into Kenya's waste economy to bring their circular economy solutions to Nairobi,\" she said. \"I assure you of my Ministry's and the government's full support as you bring your investments to Kenya.\" The Forum is Scandinavia's largest exhibition of circular economy technologies, products and innovations. It was attended by circular economy entrepreneurs, innovators and industrialists from Europe and the rest of the world. \"We look forward to joint learning and joint information exchange. We look forward to a robust partnership that will help us realise zero waste as we make circular economy a reality for Kenya,\" CS Tuiya added. In February 2023, Kenya hosted her inaugural Loop Forum with the support of the Danish and Dutch governments. The exhibition brought together over one thousand participants from across the world.","filter_flag":1}
{"title":"Top 10 Best Waste Management Companies In USA 2023 - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvd2FzdGUtbWFuYWdlbWVudC1jb21wYW5pZXMtdXNhLTIwMjMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvd2FzdGUtbWFuYWdlbWVudC1jb21wYW5pZXMtdXNhLTIwMjMv0gEA?oc=5","id":"CBMiR2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvd2FzdGUtbWFuYWdlbWVudC1jb21wYW5pZXMtdXNhLTIwMjMv0gEA","guidislink":false,"published":"Thu, 13 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=103, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvd2FzdGUtbWFuYWdlbWVudC1jb21wYW5pZXMtdXNhLTIwMjMv0gEA?oc=5\" target=\"_blank\">Top 10 Best Waste Management Companies In USA 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 10 Best Waste Management Companies In USA 2023 - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvd2FzdGUtbWFuYWdlbWVudC1jb21wYW5pZXMtdXNhLTIwMjMv0gEA?oc=5\" target=\"_blank\">Top 10 Best Waste Management Companies In USA 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable waste management\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"INTRODUCTION Waste management is an essential aspect of maintaining a clean and sustainable environment. In the USA, numerous companies have taken up the challenge of managing waste efficiently, ensuring proper disposal and recycling. The top 10 waste management companies have been leading the industry in 2023, setting a benchmark for others to follow. These companies exhibit their commitment to sustainability by utilizing innovative technologies and advanced methods to handle various waste materials, such as household waste, commercial waste, and hazardous waste. They ensure the waste is treated, recycled, or disposed of in an environmentally friendly manner. These top companies also focus on reducing greenhouse gas emissions and minimizing landfill usage. One key factor that sets these companies apart is their dedication to providing reliable customer service, working closely with local communities and businesses to create tailored waste management solutions. These top firms recognize the importance of building long-lasting relationships with clients and strive to exceed their expectations in service delivery. Another distinguishing feature of these companies is their commitment to environmental stewardship. They actively invest in research and development to explore new waste management techniques, ensuring a greener future for all. This commitment to innovation enables them to deliver cost-effective, eco-friendly services that promote resource conservation. In conclusion, the top 10 waste management companies in the USA in 2023 have set a high standard for the industry. Their dedication to sustainability, exceptional customer service, and innovative approach to waste management make them leaders in creating a cleaner, greener future. IMPORTANCE Waste management is an essential service that contributes to the health and sustainability of communities across the United States. As the country faces increased waste generation and environmental concerns, the top 10 waste management companies have stepped up to provide efficient solutions for waste disposal and recycling. These companies have demonstrated a commitment to innovation, sustainability, and customer service, helping to make a positive impact on the environment. These leading companies excel in their respective areas of expertise, which may include residential, commercial, and industrial waste management, recycling services, waste-to-energy conversion, and landfill management. They work closely with local governments and businesses to develop customized waste management plans that cater to the specific needs of their clients, promoting resource conservation and reducing the environmental footprint of waste. One of the key features that set these companies apart is their dedication to adopting the latest technologies and best practices in waste management. This includes investing in cutting-edge waste processing equipment, developing smart waste management systems, and utilizing data-driven approaches to optimize waste collection routes and schedules. Furthermore, these top companies prioritize employee training and education to ensure a skilled workforce that can deliver exceptional waste management services. They also engage in community outreach programs to promote environmental awareness and encourage waste reduction, recycling, and proper disposal. By offering comprehensive waste management solutions, these leading companies play a crucial role in addressing the environmental challenges faced by the United States. Their continued growth and success in 2023 are a testament to their commitment to a cleaner, greener future. Here are the top 10 waste management companies in USA in 2023 Waste Management, Inc. – Waste Management, Inc., headquartered in Houston, Texas, is the largest waste management company in North America and a leading provider of comprehensive waste disposal and recycling services. Founded in 1968, the company has built a reputation for its extensive range of services catering to residential, commercial, and industrial clients. Waste Management operates throughout the United States and Canada, providing waste collection, transfer, recycling, and disposal services. The company has been recognized for its commitment to sustainability and environmental stewardship. Waste Management, Inc. invests in cutting-edge technologies to reduce landfill waste, minimize greenhouse gas emissions, and promote recycling efforts. It operates more than 300 landfills, over 100 recycling facilities, and around 350 transfer stations across North America. Additionally, the company is involved in renewable energy initiatives, such as waste-to-energy and landfill gas-to-energy projects. Waste Management, Inc. is focused on offering innovative and environmentally responsible waste management solutions. It has introduced initiatives like the “At Your Door Special Collection” for household hazardous waste and the “Recycle by Mail” program for hard-to-recycle items. The company also emphasizes customer service, ensuring that its clients receive efficient, reliable, and cost-effective waste management solutions. In 2023, Waste Management, Inc. will continue to be an industry leader, setting standards for waste management and environmental protection. Republic Services, Inc. – Republic Services, Inc. is the second-largest waste management provider in the United States, serving millions of customers across the country. Established in 1998 and headquartered in Phoenix, Arizona, the company has since expanded its operations through a series of strategic acquisitions and organic growth. With a strong commitment to sustainability, Republic Services offers a comprehensive range of waste management services, including waste collection, recycling, and landfill operations. The company serves residential, commercial, and industrial clients, as well as municipalities and government agencies. As a responsible waste management provider, Republic Services focuses on reducing the environmental impact of waste disposal by implementing innovative recycling programs and landfill gas-to-energy projects. In addition to providing exceptional waste management services, Republic Services is dedicated to maintaining a strong safety culture within the organization. The company invests in advanced technologies and training programs to ensure the safety of its employees and customers. Republic Services has been recognized for its environmental stewardship, safety record, and commitment to corporate responsibility, earning numerous industry awards and accolades. As of 2023, Republic Services operates in over 40 states and Puerto Rico, with more than 340 collection operations, over 200 transfer stations, over 190 active landfills, and 70 recycling centres, making it a significant player in the US waste management industry. Waste Connections, Inc. – Waste Connections, Inc. is a leading waste management company in the United States, providing comprehensive waste collection, recycling, and disposal services to residential, commercial, and industrial customers. Founded in 1997 and headquartered in Vaughan, Ontario, Canada, the company has a strong presence in the United States, with operations in 43 states. Waste Connections prioritizes excellent customer service, ensuring that its clients receive tailored solutions for their waste management needs. The company is known for its efficient and reliable services, which are offered through a network of strategically positioned locations, making it one of the largest waste management organizations in the country. Waste Connections is committed to environmental sustainability, investing in advanced recycling technologies and landfill gas-to-energy projects that help minimize the environmental impact of waste disposal. The company focuses on reducing landfill waste and promoting recycling by educating communities and businesses about the importance of waste reduction and proper disposal. In addition to its waste management services, Waste Connections is actively engaged in local community support through philanthropic initiatives, such as partnerships with non-profit organizations and volunteering programs. The company’s dedication to corporate social responsibility, combined with its extensive waste management expertise, has earned Waste Connections a strong reputation as a leading provider of environmentally responsible waste solutions in the United States. Advanced Disposal Services, Inc. – Advanced Disposal Services, Inc. is a prominent waste management company in the United States, offering a comprehensive range of waste management services to residential, commercial, and industrial clients. Headquartered in Ponte Vedra, Florida, the company has established itself as an industry leader with a strong commitment to sustainability, innovation, and environmentally responsible practices. Advanced Disposal’s service offerings include solid waste collection, transfer, recycling, and disposal. The company focuses on integrated waste management solutions that prioritize waste reduction, recycling, and responsible disposal. By providing tailor-made solutions to meet the unique needs of its diverse clientele, Advanced Disposal strives to enhance operational efficiency and environmental stewardship. One of the key aspects of Advanced Disposal’s operations is its commitment to customer service. The company’s professional and dedicated team works diligently to ensure timely and effective waste management solutions while maintaining a high level of safety and compliance with regulatory standards. Furthermore, Advanced Disposal is dedicated to investing in advanced technologies and infrastructure to improve waste processing and recycling capabilities. The company continuously seeks innovative ways to minimize the environmental impact of waste disposal, striving to promote a circular economy and reduce greenhouse gas emissions. In summary, Advanced Disposal Services, Inc. is a distinguished waste management company in the USA that offers a wide array of waste management solutions, prioritizing sustainability, customer satisfaction, and environmental responsibility. Casella Waste Systems, Inc. – Casella Waste Systems, Inc., founded in 1975, is a leading provider of integrated waste management services in the United States, particularly in the northeastern region. The company’s headquarters is in Rutland, Vermont. Casella Waste Systems is known for its commitment to sustainability, innovation, and efficient waste management practices, offering comprehensive solutions to its residential, commercial, and industrial clients. The company’s waste management services encompass waste collection, recycling, transfer, and disposal. Casella is dedicated to resource conservation, aiming to recycle or reuse waste materials whenever possible. Their recycling services include single-stream recycling, which makes recycling more accessible and convenient for their customers, as well as specialized recycling programs for items like electronic waste and batteries. In addition to its waste management services, Casella also focuses on renewable energy initiatives, operating landfill gas-to-energy facilities that capture and convert landfill gas into clean, renewable energy. This not only reduces greenhouse gas emissions but also contributes to a more sustainable and circular economy. Casella Waste Systems prioritizes safety, regulatory compliance, and customer satisfaction. The company continually invests in research and development, seeking new technologies and practices to improve waste management services, reduce environmental impact, and promote a sustainable future. Overall, Casella Waste Systems is a leader in the industry, making a difference in the communities it serves by implementing environmentally responsible waste management solutions. Stericycle, Inc. – Stericycle, Inc. is a leading waste management company in the United States, specializing in regulated waste management and compliance services. Established in 1989 and headquartered in Bannockburn, Illinois, the company has built a reputation for its expertise in handling complex waste streams, particularly medical, pharmaceutical, and hazardous waste. Stericycle operates an extensive network of waste processing facilities across the country, ensuring proper disposal and treatment of regulated waste materials. Their services include medical waste disposal, sharps management, pharmaceutical waste solutions, and hazardous waste management. Stericycle also offers secure information destruction services, protecting businesses from data breaches and identity theft by securely disposing of confidential documents and electronic media. Committed to environmental sustainability, Stericycle follows stringent regulatory guidelines to minimize environmental impact and promotes waste reduction through recycling and waste-to-energy solutions. The company assists healthcare organizations in adhering to state and federal regulations, reducing their liability and ensuring compliance with the ever-changing landscape of environmental laws. Stericycle’s customers range from small businesses to large organizations, including hospitals, dental practices, laboratories, and manufacturing facilities. With a strong focus on customer service, the company provides tailored waste management solutions that address the specific needs of each client, contributing to a cleaner, safer, and more sustainable environment. WCA Waste Corporation – WCA Waste Corporation is a vertically integrated, non-hazardous solid waste management company in the United States. Established in 2000, WCA has grown to become a leading waste services provider, offering waste collection, transfer, recycling, and disposal services to residential, commercial, and industrial customers across the country. The company’s commitment to safety, environmental stewardship, and customer satisfaction has driven its success and made it a top choice for waste management solutions. WCA’s extensive network of collection operations and transfer stations ensures efficient, reliable service for its customers. The company places a strong emphasis on environmental responsibility, employing state-of-the-art recycling facilities and landfill operations that minimize the environmental impact of waste disposal. WCA is also dedicated to maintaining a high level of safety for its employees, customers, and the communities it serves, adhering to strict safety standards and investing in ongoing employee training and development. In addition to waste management services, WCA is involved in community outreach and educational programs that promote recycling, waste reduction, and sustainability. By partnering with local organizations and participating in community events, WCA strives to make a positive impact on the environment and the communities it serves. In summary, WCA Waste Corporation is a reputable waste management company in the USA, known for its commitment to safety, environmental responsibility, and customer satisfaction. Its comprehensive range of services and dedication to community engagement have positioned it as a top waste services provider in the country. Rumpke Consolidated Companies, Inc – Rumpke Consolidated Companies, Inc., founded in 1932, is a family-owned waste and recycling management enterprise based in Colerain Township, Ohio. The company provides comprehensive waste and recycling solutions to residential, commercial, and industrial customers across Ohio, Kentucky, Indiana, and West Virginia. William F. Rumpke Sr. started the business with a single coal delivery truck, which evolved into one of the largest privately-owned waste management companies in the United States. Rumpke offers a variety of services, including curbside trash and recycling collection, dumpster rental, landfill management, and recycling processing. The company operates several regional landfills, transfer stations, and recycling facilities, including the Rumpke Sanitary Landfill, one of the nation’s largest. Rumpke is committed to environmental stewardship, investing in advanced recycling technologies and sustainable waste management practices. Rumpke’s dedication to customer service, community involvement, and employee welfare has helped build its reputation as an industry leader. The company has received numerous accolades for its environmental initiatives, corporate citizenship, and commitment to safety. Rumpke aims to minimize the environmental impact of waste and promote a sustainable, circular economy by constantly seeking innovative waste management and recycling solutions. Covanta Holding Corporation – Covanta Holding Corporation is a world-leading provider of waste-to-energy (WTE) and environmental services, headquartered in Morristown, New Jersey, USA. Founded in 1986, the company has over three decades of experience in converting municipal solid waste (MSW) into clean, renewable energy, thereby reducing landfill waste and minimizing greenhouse gas emissions. Covanta operates more than 40 WTE facilities across North America, Europe, and Asia, processing over 20 million tons of waste annually. The company’s Energy-from-Waste (EfW) facilities convert MSW into electricity, which powers hundreds of thousands of homes and businesses, as well as steam for district heating systems. This process also helps recover valuable metals from waste, diverting them from landfills and recycling them into new products. The company is committed to sustainability and environmental stewardship, continuously investing in innovative technologies and processes to improve efficiency, reduce emissions, and minimize environmental impact. Covanta’s facilities comply with stringent environmental regulations and employ advanced air pollution control equipment to limit emissions. Covanta’s business model includes long-term contracts with municipalities and commercial clients, providing a stable revenue stream and fostering strong relationships with communities. In addition to WTE services, Covanta offers a range of sustainable waste management solutions, including recycling, waste reduction, and safe disposal of hazardous materials. Clean Harbors, Inc – Clean Harbors, Inc., founded in 1980 by Alan S. McKim, is a leading environmental, energy, and industrial services provider based in Norwell, Massachusetts. The company specializes in delivering comprehensive solutions for the safe management and disposal of hazardous and non-hazardous waste materials. Its broad range of services include environmental, waste management, recycling, industrial cleaning, and energy solutions. Clean Harbors operates over 200 service locations and waste disposal facilities throughout the United States, Canada, and Mexico, making it the largest hazardous waste disposal company in North America. The company serves a diverse range of industries, such as automotive, chemical, government, healthcare, manufacturing, and oil and gas, among others. The company’s commitment to environmental stewardship and compliance has made it a go-to choice for businesses looking to manage waste in a responsible manner. Clean Harbors’ services include emergency response, remediation, hazardous and non-hazardous waste disposal, lab packing, and on-site waste management. In recent years, Clean Harbors has expanded its focus on sustainability and reducing environmental impact. The company has invested in innovative technologies, like waste-to-energy conversion and water treatment, to help businesses minimize their environmental footprint. As a trusted partner, Clean Harbors remains dedicated to supporting its clients in achieving their sustainability goals while ensuring regulatory compliance and protecting the environment. CONCLUSION In conclusion, waste management companies in the USA play a crucial role in addressing the country’s waste disposal and recycling needs. These companies have effectively implemented advanced waste management strategies, such as landfill disposal, recycling, and waste-to-energy conversion, to reduce the environmental impact of waste. The sector is characterized by significant players like Waste Management Inc., Republic Services, and Waste Connections, which dominate the market through their extensive service networks and technological innovations. The industry faces ongoing challenges, including the need to adapt to changing waste streams, rising public awareness about environmental issues, and evolving waste management regulations. To remain successful, these companies must continue investing in technological advancements, such as smart waste collection systems and zero-waste solutions, to improve efficiency and reduce the environmental footprint of waste management. Moreover, waste management companies in the USA have a social responsibility to promote sustainability and environmental stewardship. Collaboration with local communities, businesses, and governmental bodies is vital in achieving waste reduction goals and fostering a circular economy. Additionally, public-private partnerships can enhance resource allocation and drive sustainable waste management initiatives. In summary, waste management companies in the USA are essential in addressing waste-related challenges and promoting sustainable development. Embracing technological advancements, fostering collaboration, and adapting to regulatory changes are vital for the continued success and growth of the industry.","filter_flag":1}
{"title":"Top 10 Best Waste Management Companies In Europe 2023 - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi9zdG9yaWVzL3dhc3RlLW1hbmFnZW1lbnQtY29tcGFuaWVzLTIwMjMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi9zdG9yaWVzL3dhc3RlLW1hbmFnZW1lbnQtY29tcGFuaWVzLTIwMjMv0gEA?oc=5","id":"CBMiRGh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi9zdG9yaWVzL3dhc3RlLW1hbmFnZW1lbnQtY29tcGFuaWVzLTIwMjMv0gEA","guidislink":false,"published":"Wed, 19 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=109, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi9zdG9yaWVzL3dhc3RlLW1hbmFnZW1lbnQtY29tcGFuaWVzLTIwMjMv0gEA?oc=5\" target=\"_blank\">Top 10 Best Waste Management Companies In Europe 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 10 Best Waste Management Companies In Europe 2023 - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi9zdG9yaWVzL3dhc3RlLW1hbmFnZW1lbnQtY29tcGFuaWVzLTIwMjMv0gEA?oc=5\" target=\"_blank\">Top 10 Best Waste Management Companies In Europe 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable waste management\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Waste management is a crucial aspect of modern society, and its significance cannot be overstated. Here are some of the reasons why waste management is so important: Public Health: Poor waste management practices can lead to the spread of diseases and illnesses. Proper waste management, including the safe disposal of hazardous waste, can help to prevent the spread of disease and protect public health. Environmental Protection: Improper waste management can lead to pollution of land, water, and air. This can have a detrimental impact on the environment, leading to ecosystem damage, soil and water contamination, and air pollution. Proper waste management can help to minimize these negative impacts and promote a cleaner, healthier environment. Resource Conservation: Many materials that are considered waste can be reused, recycled, or repurposed. Proper waste management can help to conserve natural resources by diverting materials from landfills and using them to create new products or generate energy. Energy Generation: Waste can be used to generate energy through a variety of technologies, including incineration and anaerobic digestion. By using waste to generate energy, we can reduce our reliance on non-renewable resources and reduce greenhouse gas emissions. Economic Benefits: Proper waste management can also have economic benefits. By recycling and reusing materials, we can reduce the need for new resource extraction and create new jobs in the recycling and waste management industries. In conclusion, waste management is an essential aspect of modern society. It plays a crucial role in protecting public health, preserving the environment, conserving natural resources, generating energy, and providing economic benefits. As the world’s population continues to grow, it is essential that we develop sustainable waste management practices to ensure a healthy and prosperous future for generations to come. Here are some of the top waste management companies in Europe: Veolia Veolia is a French multinational company that specializes in water, waste, and energy management. With operations in over 40 countries, the company offers a wide range of services, including waste collection, treatment, and disposal, as well as recycling and energy recovery. Veolia’s focus on sustainability and environmental protection has earned it a reputation as one of the most innovative and forward-thinking waste management companies in Europe. Veolia is a French multinational company that provides a range of environmental services, including waste management, water treatment, and energy services. The company was founded in 1853 and has since grown to become a world leader in sustainable development and environmental solutions. Veolia’s waste management services include the collection, treatment, and disposal of all types of waste. The company operates a wide range of waste treatment facilities, including incineration plants, landfill sites, and recycling centers. The company’s focus on sustainability and innovation has allowed it to develop new technologies for waste management, such as energy recovery and waste-to-energy technologies. Veolia also operates a range of water treatment facilities, providing safe drinking water and wastewater treatment solutions to communities around the world. The company’s energy services division provides a range of energy management and optimization solutions, including energy efficiency, renewable energy, and district heating and cooling systems. In addition to its core business areas, Veolia is committed to sustainability and has implemented several initiatives to reduce its environmental impact. The company has set ambitious targets to reduce its greenhouse gas emissions and has invested heavily in renewable energy and waste-to-energy technologies. Overall, Veolia is a leading environmental services company that is committed to sustainability and innovation. Its wide range of services and investment in new technologies make it a key player in the global waste management and environmental solutions industry. SUEZ SUEZ is a French-based company that provides water and waste management solutions. With operations in Europe, Asia, and North America, the company offers a range of services, including waste collection and treatment, as well as recycling and energy recovery. SUEZ has a strong commitment to sustainable development and is actively working to reduce its environmental impact while providing efficient and effective waste management solutions. SUEZ is a French-based company that provides a range of environmental services, including water and waste management solutions. The company was founded in 1858 and has since grown to become a world leader in sustainable development and environmental solutions. SUEZ’s waste management services include the collection, treatment, and disposal of all types of waste. The company operates a range of waste treatment facilities, including landfill sites, recycling centers, and waste-to-energy plants. SUEZ’s focus on sustainability has led to the development of new technologies for waste management, such as mechanical-biological treatment (MBT) and anaerobic digestion. SUEZ’s water management services include water treatment, distribution, and management, as well as wastewater treatment and reuse. The company operates a range of water treatment facilities, including desalination plants, to provide safe drinking water and wastewater treatment solutions to communities around the world. SUEZ is also involved in resource recovery, using waste as a resource to create new products and generate energy. The company operates several waste-to-energy plants, which use non-recyclable waste to generate electricity and heat. This helps to reduce the amount of waste sent to landfills and provides a sustainable source of energy. Overall, SUEZ is a leading environmental services company that is committed to sustainability and innovation. Its wide range of services and investment in new technologies make it a key player in the global waste management and environmental solutions industry. Renewi Renewi is a waste-to-product company based in the Netherlands that specializes in waste recycling and recovery. The company operates in a number of European countries, including Belgium, Germany, and the United Kingdom, and offers a range of services, including waste collection, treatment, and disposal, as well as recycling and energy recovery. Renewi’s focus on sustainability and circular economy principles has helped it to become one of the leading waste management companies in Europe. Renewi is a waste-to-product company based in the Netherlands that provides waste management, recycling, and recovery solutions. The company was founded in 2017 through the merger of the Shanks Group and Van Gansewinkel Group, two leading waste management companies in Europe. Renewi’s waste management services include waste collection, treatment, and disposal for both commercial and municipal customers. The company’s focus on sustainability has led to the development of new technologies for waste management, such as mechanical-biological treatment (MBT) and anaerobic digestion. Renewi is also involved in resource recovery, using waste as a resource to create new products and generate energy. The company operates several waste-to-energy plants, which use non-recyclable waste to generate electricity and heat. This helps to reduce the amount of waste sent to landfills and provides a sustainable source of energy. Renewi’s recycling facilities are capable of handling a wide range of materials, including paper, cardboard, plastics, glass, and metals. The company uses state-of-the-art technology to sort and process these materials, ensuring that they are recycled efficiently and effectively. Overall, Renewi is a leading waste-to-product company that is committed to sustainability and innovation. Its wide range of services and investment in new technologies make it a key player in the European waste management and recycling industry. Biffa Biffa is a UK-based company that provides waste management services, including collection, treatment, and disposal. With operations throughout the UK, the company offers a range of services, including household waste collection, commercial waste management, and recycling. Biffa has a strong commitment to sustainability and has invested heavily in renewable energy and waste-to-energy technologies. Biffa is a UK-based company that provides waste management, recycling, and energy recovery solutions. The company was founded in 1912 and has since grown to become one of the largest waste management companies in the UK. Biffa’s waste management services include the collection, treatment, and disposal of all types of waste. The company operates a range of waste treatment facilities, including landfill sites, recycling centers, and waste-to-energy plants. Biffa’s focus on sustainability has led to the development of new technologies for waste management, such as mechanical-biological treatment (MBT) and anaerobic digestion. Biffa is also involved in resource recovery, using waste as a resource to create new products and generate energy. The company operates several waste-to-energy plants, which use non-recyclable waste to generate electricity and heat. This helps to reduce the amount of waste sent to landfills and provides a sustainable source of energy. Biffa’s recycling facilities are capable of handling a wide range of materials, including paper, plastics, glass, and metals. The company uses state-of-the-art technology to sort and process these materials, ensuring that they are recycled efficiently and effectively. Overall, Biffa is a leading waste management and environmental services company that is committed to sustainability and innovation. Its wide range of services and investment in new technologies make it a key player in the UK waste management and recycling industry. FCC Environment FCC Environment is a Spanish-based company that provides waste management services, including recycling, treatment, and energy recovery. With operations in Spain, the UK, and Central Europe, the company offers a range of services, including waste collection, treatment, and disposal, as well as recycling and energy recovery. FCC Environment is committed to sustainable development and has been recognized for its efforts in reducing its environmental impact. FCC Environment is a Spanish-based company that provides waste management, recycling, and energy recovery solutions. The company is a subsidiary of FCC Group, a leading European infrastructure, and environmental services company. FCC Environment’s waste management services include the collection, treatment, and disposal of all types of waste. The company operates a range of waste treatment facilities, including landfill sites, recycling centers, and waste-to-energy plants. FCC Environment’s focus on sustainability has led to the development of new technologies for waste management, such as mechanical-biological treatment (MBT) and anaerobic digestion. FCC Environment is also involved in resource recovery, using waste as a resource to create new products and generate energy. The company operates several waste-to-energy plants, which use non-recyclable waste to generate electricity and heat. This helps to reduce the amount of waste sent to landfills and provides a sustainable source of energy. FCC Environment’s recycling facilities are capable of handling a wide range of materials, including paper, plastics, glass, and metals. The company uses state-of-the-art technology to sort and process these materials, ensuring that they are recycled efficiently and effectively. Overall, FCC Environment is a leading waste management and environmental services company that is committed to sustainability and innovation. Its wide range of services and investment in new technologies make it a key player in the global waste management and environmental solutions industry. ECOLOGIC ECOLOGIC is a Swiss-based company that provides waste management solutions, including waste disposal, recycling, and energy recovery. The company offers a range of services, including hazardous waste management, industrial cleaning, and soil remediation. ECOLOGIC has a strong commitment to sustainability and has implemented a number of measures to reduce its environmental impact. Ecologic is a German-based company that provides a range of environmental services, including waste management, recycling, and energy recovery. The company was founded in 1995 and has since grown to become a leading provider of sustainable waste management solutions in Germany and beyond. Ecologic’s waste management services include the collection, treatment, and disposal of all types of waste. The company operates a range of waste treatment facilities, including landfill sites, recycling centers, and waste-to-energy plants. Ecologic’s focus on sustainability has led to the development of new technologies for waste management, such as mechanical-biological treatment (MBT) and anaerobic digestion. Ecologic is also involved in resource recovery, using waste as a resource to create new products and generate energy. The company operates several waste-to-energy plants, which use non-recyclable waste to generate electricity and heat. This helps to reduce the amount of waste sent to landfills and provides a sustainable source of energy. Ecologic’s recycling facilities are capable of handling a wide range of materials, including paper, plastics, glass, and metals. The company uses state-of-the-art technology to sort and process these materials, ensuring that they are recycled efficiently and effectively. In addition to waste management and recycling, Ecologic provides a range of environmental services, including environmental consulting, hazardous waste management, and remediation services. Overall, Ecologic is a leading environmental services company that is committed to sustainability and innovation. Its wide range of services and investment in new technologies make it a key player in the European waste management and environmental solutions industry. Ragn-Sells Ragn-Sells is a Swedish-based company that provides waste management services, including collection, treatment, and disposal. With operations throughout the Nordic region, the company offers a range of services, including recycling and energy recovery. Ragn-Sells is committed to sustainable development and has implemented a number of initiatives to reduce its environmental impact. Ragn-Sells is a Swedish-based company that provides waste management, recycling, and environmental services. The company was founded in 1944 and has since grown to become a leading provider of environmental services in Sweden, Norway, Denmark, Estonia, and Latvia. Ragn-Sells’ waste management services include collection, treatment, and disposal of all types of waste. The company operates a range of waste treatment facilities, including landfill sites, recycling centers, and waste-to-energy plants. Ragn-Sells’ focus on sustainability has led to the development of new technologies for waste management, such as mechanical-biological treatment (MBT) and anaerobic digestion. Ragn-Sells is also involved in resource recovery, using waste as a resource to create new products and generate energy. The company operates several waste-to-energy plants, which use non-recyclable waste to generate electricity and heat. This helps to reduce the amount of waste sent to landfills and provides a sustainable source of energy. Ragn-Sells’ recycling facilities are capable of handling a wide range of materials, including paper, plastics, glass, and metals. The company uses state-of-the-art technology to sort and process these materials, ensuring that they are recycled efficiently and effectively. In addition to waste management and recycling, Ragn-Sells provides a range of environmental services, including environmental consulting, hazardous waste management, and remediation services. Overall, Ragn-Sells is a leading waste management and environmental services company that is committed to sustainability and innovation. Its wide range of services and investment in new technologies make it a key player in the European waste management and recycling industry. Remondis Remondis is a German-based company that provides waste management services, including collection, transport, and recycling. With operations throughout Europe, the company offers a range of services, including commercial waste management, recycling, and energy recovery. Remondis is committed to sustainable development and has invested heavily in renewable energy and waste-to-energy technologies. Remondis is a German-based company that provides waste management services, including collection, transport, and recycling. The company was founded in 1934 and has since grown to become one of the largest waste management companies in Europe, with operations in over 30 countries worldwide. Remondis provides a range of waste management services, including commercial and industrial waste collection, recycling, and energy recovery. The company is committed to sustainability and has invested heavily in renewable energy and waste-to-energy technologies. Remondis’ recycling facilities are capable of handling a wide range of materials, including paper, cardboard, plastics, glass, and metals. The company uses state-of-the-art technology to sort and process these materials, ensuring that they are recycled efficiently and effectively. In addition to recycling, Remondis is also involved in energy recovery. The company operates several waste-to-energy plants, which use non-recyclable waste to generate electricity and heat. This helps to reduce the amount of waste sent to landfills and provides a sustainable source of energy. Overall, Remondis is a leading waste management company that is committed to sustainability and innovation. Its wide range of services and investment in new technologies make it a key player in the European waste management industry. Ros Roca Ros Roca is a Spanish-based company that provides waste management solutions, including waste collection and treatment, as well as recycling, and energy recovery. Ros Roca is a Spanish-based waste management company that provides a range of waste management solutions, including waste collection and treatment, recycling, and energy recovery. The company was founded in 1956 and has since grown to become a leading waste management company in Europe and Latin America. Ros Roca offers a range of waste collection services, including municipal, industrial, and commercial waste collection. The company also operates several waste treatment facilities, including landfills, composting facilities, and waste-to-energy plants. These facilities are designed to handle a wide range of waste streams and provide efficient and effective waste management solutions. In addition to waste collection and treatment, Ros Roca is also involved in recycling. The company operates several recycling facilities, which are capable of processing a range of materials, including paper, plastics, glass, and metals. These facilities are equipped with state-of-the-art technology, which allows for the efficient and effective recycling of these materials. Ros Roca is also committed to sustainable development and has implemented several initiatives to reduce its environmental impact. The company has invested heavily in renewable energy and waste-to-energy technologies, which help to reduce the amount of waste sent to landfills and provides a sustainable source of energy. Overall, Ros Roca is a leading waste management company that is committed to sustainability and innovation. Its wide range of services and investment in new technologies make it a key player in the European waste management industry. Amey is a UK-based company that provides a range of services, including waste management, recycling, and resource recovery. The company was founded in 1921 and has since grown to become a leading provider of infrastructure and support services in the UK and internationally. Amey’s waste management services include household and commercial waste collection, treatment, and disposal. The company also operates several recycling facilities, which are capable of processing a wide range of materials, including paper, plastics, glass, and metals. These facilities use state-of-the-art technology to sort and process materials efficiently and effectively. In addition to waste management and recycling, Amey is also involved in resource recovery. The company operates several energy-from-waste plants, which use non-recyclable waste to generate electricity and heat. This helps to reduce the amount of waste sent to landfills and provides a sustainable source of energy. Amey is committed to sustainability and has implemented several initiatives to reduce its environmental impact. The company has a strong focus on reducing its carbon footprint and has set ambitious targets to reduce greenhouse gas emissions across its operations. Overall, Amey is a leading waste management company that is committed to sustainability and innovation. Its wide range of services and investment in new technologies make it a key player in the UK and international waste management industry.","filter_flag":1}
