{"title":"Spinneys becomes first UAE retailer to transition to recycled plastic packaging, in partnership with Al Bayader International - ZAWYA","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiuwFodHRwczovL3d3dy56YXd5YS5jb20vZW4vcHJlc3MtcmVsZWFzZS9jb21wYW5pZXMtbmV3cy9zcGlubmV5cy1iZWNvbWVzLWZpcnN0LXVhZS1yZXRhaWxlci10by10cmFuc2l0aW9uLXRvLXJlY3ljbGVkLXBsYXN0aWMtcGFja2FnaW5nLWluLXBhcnRuZXJzaGlwLXdpdGgtYWwtYmF5YWRlci1pbnRlcm5hdGlvbmFsLWQ4dmR6bno50gHBAWh0dHBzOi8vd3d3Lnphd3lhLmNvbS9lbi9wcmVzcy1yZWxlYXNlL2NvbXBhbmllcy1uZXdzL3NwaW5uZXlzLWJlY29tZXMtZmlyc3QtdWFlLXJldGFpbGVyLXRvLXRyYW5zaXRpb24tdG8tcmVjeWNsZWQtcGxhc3RpYy1wYWNrYWdpbmctaW4tcGFydG5lcnNoaXAtd2l0aC1hbC1iYXlhZGVyLWludGVybmF0aW9uYWwtZDh2ZHpuejk_YW1wPTE?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiuwFodHRwczovL3d3dy56YXd5YS5jb20vZW4vcHJlc3MtcmVsZWFzZS9jb21wYW5pZXMtbmV3cy9zcGlubmV5cy1iZWNvbWVzLWZpcnN0LXVhZS1yZXRhaWxlci10by10cmFuc2l0aW9uLXRvLXJlY3ljbGVkLXBsYXN0aWMtcGFja2FnaW5nLWluLXBhcnRuZXJzaGlwLXdpdGgtYWwtYmF5YWRlci1pbnRlcm5hdGlvbmFsLWQ4dmR6bno50gHBAWh0dHBzOi8vd3d3Lnphd3lhLmNvbS9lbi9wcmVzcy1yZWxlYXNlL2NvbXBhbmllcy1uZXdzL3NwaW5uZXlzLWJlY29tZXMtZmlyc3QtdWFlLXJldGFpbGVyLXRvLXRyYW5zaXRpb24tdG8tcmVjeWNsZWQtcGxhc3RpYy1wYWNrYWdpbmctaW4tcGFydG5lcnNoaXAtd2l0aC1hbC1iYXlhZGVyLWludGVybmF0aW9uYWwtZDh2ZHpuejk_YW1wPTE?oc=5","id":"CBMiuwFodHRwczovL3d3dy56YXd5YS5jb20vZW4vcHJlc3MtcmVsZWFzZS9jb21wYW5pZXMtbmV3cy9zcGlubmV5cy1iZWNvbWVzLWZpcnN0LXVhZS1yZXRhaWxlci10by10cmFuc2l0aW9uLXRvLXJlY3ljbGVkLXBsYXN0aWMtcGFja2FnaW5nLWluLXBhcnRuZXJzaGlwLXdpdGgtYWwtYmF5YWRlci1pbnRlcm5hdGlvbmFsLWQ4dmR6bno50gHBAWh0dHBzOi8vd3d3Lnphd3lhLmNvbS9lbi9wcmVzcy1yZWxlYXNlL2NvbXBhbmllcy1uZXdzL3NwaW5uZXlzLWJlY29tZXMtZmlyc3QtdWFlLXJldGFpbGVyLXRvLXRyYW5zaXRpb24tdG8tcmVjeWNsZWQtcGxhc3RpYy1wYWNrYWdpbmctaW4tcGFydG5lcnNoaXAtd2l0aC1hbC1iYXlhZGVyLWludGVybmF0aW9uYWwtZDh2ZHpuejk_YW1wPTE","guidislink":false,"published":"Tue, 28 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=332, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiuwFodHRwczovL3d3dy56YXd5YS5jb20vZW4vcHJlc3MtcmVsZWFzZS9jb21wYW5pZXMtbmV3cy9zcGlubmV5cy1iZWNvbWVzLWZpcnN0LXVhZS1yZXRhaWxlci10by10cmFuc2l0aW9uLXRvLXJlY3ljbGVkLXBsYXN0aWMtcGFja2FnaW5nLWluLXBhcnRuZXJzaGlwLXdpdGgtYWwtYmF5YWRlci1pbnRlcm5hdGlvbmFsLWQ4dmR6bno50gHBAWh0dHBzOi8vd3d3Lnphd3lhLmNvbS9lbi9wcmVzcy1yZWxlYXNlL2NvbXBhbmllcy1uZXdzL3NwaW5uZXlzLWJlY29tZXMtZmlyc3QtdWFlLXJldGFpbGVyLXRvLXRyYW5zaXRpb24tdG8tcmVjeWNsZWQtcGxhc3RpYy1wYWNrYWdpbmctaW4tcGFydG5lcnNoaXAtd2l0aC1hbC1iYXlhZGVyLWludGVybmF0aW9uYWwtZDh2ZHpuejk_YW1wPTE?oc=5\" target=\"_blank\">Spinneys becomes first UAE retailer to transition to recycled plastic packaging, in partnership with Al Bayader International<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ZAWYA<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Spinneys becomes first UAE retailer to transition to recycled plastic packaging, in partnership with Al Bayader International - ZAWYA","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiuwFodHRwczovL3d3dy56YXd5YS5jb20vZW4vcHJlc3MtcmVsZWFzZS9jb21wYW5pZXMtbmV3cy9zcGlubmV5cy1iZWNvbWVzLWZpcnN0LXVhZS1yZXRhaWxlci10by10cmFuc2l0aW9uLXRvLXJlY3ljbGVkLXBsYXN0aWMtcGFja2FnaW5nLWluLXBhcnRuZXJzaGlwLXdpdGgtYWwtYmF5YWRlci1pbnRlcm5hdGlvbmFsLWQ4dmR6bno50gHBAWh0dHBzOi8vd3d3Lnphd3lhLmNvbS9lbi9wcmVzcy1yZWxlYXNlL2NvbXBhbmllcy1uZXdzL3NwaW5uZXlzLWJlY29tZXMtZmlyc3QtdWFlLXJldGFpbGVyLXRvLXRyYW5zaXRpb24tdG8tcmVjeWNsZWQtcGxhc3RpYy1wYWNrYWdpbmctaW4tcGFydG5lcnNoaXAtd2l0aC1hbC1iYXlhZGVyLWludGVybmF0aW9uYWwtZDh2ZHpuejk_YW1wPTE?oc=5\" target=\"_blank\">Spinneys becomes first UAE retailer to transition to recycled plastic packaging, in partnership with Al Bayader International<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ZAWYA<\/font>","source.href":"https:\/\/www.zawya.com","source.title":"ZAWYA","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"rPET packing represents meaningful progress by Spinneys towards the UN Sustainable Development Goals and its own sustainability commitments Dubai, UAE: In the historic Year of Sustainability, Spinneys, one of the UAE’s leading fresh food retailers has announced its partnership with packaging manufacturer Al Bayader International, to introduce recycled plastic packaging (rPET) across its stores. With the help of regional partners, Al Bayader collects and converts plastic waste into post-consumer recycled plastic (rPET), diverting significant waste away from landfills. The rPET is then developed into innovative sustainable packaging solutions for Spinneys’ private label ‘SpinneysFOOD’. The partnership represents a significant and environmentally positive step forward for Spinneys, with rPET packaging using significantly less water, energy, and fossil fuels than standard ‘virgin’ PET packaging, meaning the new packaging is expected to result in 20% fewer CO2 emissions. In the first phase of the transition, the new recycled packs, containing 30% rPET will be found in Spinneys’ bakery across the popular SpinneysFOOD packaged croissants and muffin ranges. As a result, Spinneys expects to reduce its annual CO2 emissions consumption by a measurable six metric tonnes. Additionally, this initiative puts Spinneys in the spotlight for diverting two tons of virgin PET away from landfills each year, highlighting a strong environmental commitment. Each pack using the new recycled packaging has its own “Al Bayader Recycl’d” QR code on the label, allowing customers to scan and trace the date that the recycled plastic product was manufactured, and the precise percentage of rPET content it contains. This is intended to bolster customer confidence in this initiative, with the recycled plastic content independently tracked by R-Cycle’s platform, a European open traceability standard and software that provides a digital passport for recycled packaging material. Warwick Gird, General Manager, Marketing at Spinneys commented: “We are incredibly proud to bring recycled plastic packaging to our SpinneysFOOD private label range, as we focus on making meaningful progress towards the UN Sustainable Development Goals and our own sustainability commitments. We could not have achieved this important milestone in our sustainable journey without the innovation and dedication of our packaging partner Al Bayader and we look forward to expanding this project, creating further positive impacts for the environment.” Under its wider sustainability strategy, Spinneys follows a ‘life cycle assessment’ for all new packaging and product design, considering the environmental impact of a product throughout its lifecycle – including greenhouse gas emissions, water consumption and pollution impacts. Falling under this process, the new rPET packaging is part of Spinneys circular packaging strategy to reduce the use of ‘virgin’ materials. “We are proud and thrilled to announce Spinneys as our pioneering retail partner and first UAE retailer to switch to our Recycl’d rPET packaging. This not only carries significant benefits for the environment, but also helps us tackle climate change and move a step further towards net zero carbon emissions. As a leading regional packaging manufacturer with over 30 years of experience, we remain dedicated to offering the most sustainable products in the market This partnership is a key step in leading the transition to recycled packaging and achieving the UAE’s 2031 Circular Economy Vision,” said Jamil Haddad, Group Vice President – Strategic Marketing at Al Bayader International. In the build-up to the highly anticipated 28th session of the Conference of Parties (COP 28) to the UNFCCC hosted by the UAE from 30 November to 12 December, both Spinneys and Al Bayader are proud to be closely aligned with the UAE government’s Circular Economy Policy and 2031 vision to achieving sustainable governance in the priority areas of food production, manufacturing, consumption and infrastructure. About Spinneys Spinneys’ story started in 1961 when the first supermarket opened in Al Nasr Square. It has since grown to be one of the most favourited premium supermarket retailers in the region, with 61 stores across the UAE. Much loved by expats and locals in the region, Spinneys enjoys a well-deserved reputation for forward thinking, keeping pace with changes in cooking trends and the emergence of new products worldwide. Today, Spinneys Dubai, owned by UAE national Mr Ali Albwardy, has built a strong name for supplying top quality produce and offering an elevated level of customer service. Food quality, safety and freshness have always been at the forefront of the company’s ethos – just one reason the Spinneys brand is defined as ‘The fresher experience’. Sustainability is strongly embedded into the Spinneys organisation and company goals through the 2025 Let’s Do Better Together plan, into all areas of the business, from reducing food waste, making the packaging more sustainable, to reducing carbon footprint and continuing the Local Business Incubator programme. For more information about the brand and upcoming news visit: www.spinneys.com @spinneysdubai About Al Bayader International Al Bayader International is a global manufacturer, distributor, and retailer of innovative solutions in bespoke and sustainable food packaging, as well as personal & home care products. With over 1,000 employees from 30 different nationalities, the company serves 9,000 business customers and millions of consumers globally. They have a portfolio of over 3,000 products and own and operate three manufacturing complexes with a production capacity of +31,000 tons per annum. With 16 industrial and logistics locations, Al Bayader International has a substantial market share in several GCC markets and is expanding into Europe and Africa. Additionally, the company has 9 retail shops and owns its own e-commerce platforms. Al Bayader International is at the forefront of sustainability, actively reducing energy consumption and promoting environmental responsibility. In 2021, they inaugurated the UAE's first solar rooftop in the food packaging industry, showcasing its commitment to sustainable energy practices. Since 1991, the company has aimed to be the region's most sustainable food packaging company, holding certifications from the Forest Steward Council (FSC) and Programme for the Endorsement of Forest Certification (PEFC). These certifications reflect over two decades of innovative efforts to create environmentally friendly products. @AlBayaderInternational","filter_flag":1}
