{"title":"Inaugural ST Taiwan Tech Day Highlights Mobility, Power, Connectivity, and Sensing Trends - Eetasia.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LmVldGFzaWEuY29tL2luYXVndXJhbC1zdC10YWl3YW4tdGVjaC1kYXktaGlnaGxpZ2h0cy1tb2JpbGl0eS1wb3dlci1jb25uZWN0aXZpdHktYW5kLXNlbnNpbmcv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LmVldGFzaWEuY29tL2luYXVndXJhbC1zdC10YWl3YW4tdGVjaC1kYXktaGlnaGxpZ2h0cy1tb2JpbGl0eS1wb3dlci1jb25uZWN0aXZpdHktYW5kLXNlbnNpbmcv0gEA?oc=5","id":"CBMiaGh0dHBzOi8vd3d3LmVldGFzaWEuY29tL2luYXVndXJhbC1zdC10YWl3YW4tdGVjaC1kYXktaGlnaGxpZ2h0cy1tb2JpbGl0eS1wb3dlci1jb25uZWN0aXZpdHktYW5kLXNlbnNpbmcv0gEA","guidislink":false,"published":"Wed, 01 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=305, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LmVldGFzaWEuY29tL2luYXVndXJhbC1zdC10YWl3YW4tdGVjaC1kYXktaGlnaGxpZ2h0cy1tb2JpbGl0eS1wb3dlci1jb25uZWN0aXZpdHktYW5kLXNlbnNpbmcv0gEA?oc=5\" target=\"_blank\">Inaugural ST Taiwan Tech Day Highlights Mobility, Power, Connectivity, and Sensing Trends<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Eetasia.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Inaugural ST Taiwan Tech Day Highlights Mobility, Power, Connectivity, and Sensing Trends - Eetasia.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LmVldGFzaWEuY29tL2luYXVndXJhbC1zdC10YWl3YW4tdGVjaC1kYXktaGlnaGxpZ2h0cy1tb2JpbGl0eS1wb3dlci1jb25uZWN0aXZpdHktYW5kLXNlbnNpbmcv0gEA?oc=5\" target=\"_blank\">Inaugural ST Taiwan Tech Day Highlights Mobility, Power, Connectivity, and Sensing Trends<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Eetasia.com<\/font>","source.href":"https:\/\/www.eetasia.com","source.title":"Eetasia.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Inaugural ST Taiwan Tech Day Highlights Mobility, Power, Connectivity, and Sensing Trends Article By : STMicroelectronics STMicroelectronics is holding its first-ever ST Taiwan Tech Day at the Taipei New Horizon on November 2. STMicroelectronics is holding its first-ever ST Taiwan Tech Day at the Taipei New Horizon on November 2. The event is designed to provide valued customers and partners with the most up-to-date information on ST products and solutions to facilitate innovation and achieve success. With the theme “Our Technology Starts with You,” this extensive technology event will offer insightful speeches and showcase over 40 demonstrations centered around four mega trends: Smart Mobility, Power & Energy, IoT & Connectivity, and Sensing the World. Attendees can experience first-hand the latest innovations and learn how ST’s technologies are contributing to a safer, greener, and more connected world. It will also be a great opportunity to help developers and innovators stay ahead of the curve in today’s rapidly evolving market. Innovation Highlights Smart Mobility Zonal Gateway: Zonal Gateway acts as a bridge between the automotive central computer and traditional signal-based ECUs. This technology is supported by ST’s wide range of automotive-grade products and enables Service-Oriented Architecture (SOA) with Data Distribution Service (DDS) protocol and Firmware Over-The-Air (FOTA). The Zonal Gateway offers a solution for modernizing automotive systems, allowing for seamless communication between different components and enabling efficient and secure updates. 3rd-Generation SiC Modules: The industry leader in Silicon Carbide (SiC), ST offers a wide range of solutions to help developers improve the power efficiency and reduce the size and weight of automotive inverters with its 3rd-generation SiC modules. The traction inverter is a critical component in electric vehicles as it converts energy from the battery to drive the motors in the drivetrain. These converters must handle high power and currents, provide fail-safe operation, and handle EMC challenges. Alongside the SiC modules, ST’s range of solutions includes AEC-Q101 qualified IGBTs, silicon and silicon-carbide MOSFETs and diodes, AEC-Q100 qualified galvanically isolated IGBT and MOSFET gate drivers, and SPC5 32-bit automotive microcontrollers. These offerings enable scalable, cost-effective, and energy-efficient EV traction inverter solutions. Power & Energy Digital Power: ST’s digital power solution is a comprehensive set of reference designs that empower designers to create efficient, feature-rich power supplies for a wide range of applications. The demo highlights two powerful solutions: the 25kW DAB DC\/DC converter with ST’s ACEPACK module, a highly efficient and reliable power converter ideal for industrial and automotive applications, and the 30kW Gen3 SiC MOSFET three-phase interleaved LLC solution with an STM32G4 MCU for ultra-high voltage EV charger—a cutting-edge power supply designed to provide ultra-fast charging for electric vehicles. With these solutions, designers can create custom power systems that are efficient, reliable, and tailored to their specific needs. Precision Position Control: ST is a leading technology provider for motor control and servo drives, offering power device technologies, computational processing, isolated devices, industrial safety, ecosystem for industrial automation, connectivity, and predictive maintenance. With ST’s state-of-the-art motor-control technologies, the motor can precisely control movement to a specific position. The demo consists of two small BLDC motors that can hold two shapes that do not fit together when they are in phase. The precision motor-control algorithm enables the rotation and movement of the shapes towards each other at any time, offsetting the relative position of the two shapes by 90 degrees while rotating. This unique position allows coupling between the shapes, with a rotation speed that ensures the phase shift is not noticeable, demonstrating precision position control in a harmonic movement coordinated simultaneously with other shapes. IoT & Connectivity Edge AI Washing Machine Solution: This solution utilizes artificial intelligence (AI) to achieve unparalleled levels of energy and water efficiency by accurately measuring the weight of clothes inside the machine. The AI model generated by ST’s NanoEdge AI Studio significantly improves measurement accuracy compared to traditional algorithms by analyzing and learning the features of current signals. This technology can advance the washing-machine industry to a next level by optimizing energy and water consumption while providing more accurate measurements. Compact Production Line with IO-Link System: The IO-Link automated product line demonstrates ST’s total solution application in a smart factory, utilizing IO-Link technology to manage digital input\/output, sensors, and solenoid air valve drivers. The demos include digital IO boards, sensor boards, and actuator boards from ST’s Automation Competence Center’s reference demo boards. The IO-Link products simplify the installation, setup, maintenance, and repair of factory automation systems, enhancing system flexibility to produce different product models. The IO-Link diagnostic function enables smarter and more reliable factory operations. Sensing the World 3D Sensing Solutions: ST showcases the advanced imaging capabilities of the 3D stereo-vision camera solutions for machine-vision applications. The eYs3D stereo camera reference design features ST’s high-performance, near-infrared VD56G3 global-shutter image sensors, ensuring the highest quality depth sensing and point-cloud creation. Additionally, the VD55H1 low-noise, low-power, indirect Time-of-Flight (iToF) sensor die, manufactured using advanced backside-illuminated, stacked-wafer technology, enables the creation of a small form-factor 3D camera capable of producing high-definition depth maps with a typical ranging distance of up to 5 meters in full resolution and beyond 5 meters with patterned illumination. This demo highlights ST’s commitment to providing cutting-edge technology for machine-vision applications. ISPU for personal electronics: ISPU (Intelligent Sensor Processing Unit) is a new processing category embedded in ST’s LSM6DSO16IS MEMS module. It is an ultra-low-power, high-performance programmable core that can execute signal processing and AI algorithms in real-time. The ISPU offers C programming and an enhanced ecosystem with libraries and 3rd-party tools\/IDE, making it a state-of-the-art feature for any personal electronics. In addition to the insightful speeches and exciting technology showcase, more than 20 in-depth technical presentations covering Smart Mobility, Power and Energy, and IoT and Connectivity will provide a close look at the cutting-edge technologies that are shaping our world.","filter_flag":1}
{"title":"How to be Eco-Friendly - The Independent","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL2Fkdmlzb3Ivc29sYXItcGFuZWxzL2hvdy10by1iZS1lY28tZnJpZW5kbHnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL2Fkdmlzb3Ivc29sYXItcGFuZWxzL2hvdy10by1iZS1lY28tZnJpZW5kbHnSAQA?oc=5","id":"CBMiSWh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL2Fkdmlzb3Ivc29sYXItcGFuZWxzL2hvdy10by1iZS1lY28tZnJpZW5kbHnSAQA","guidislink":false,"published":"Mon, 06 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=310, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL2Fkdmlzb3Ivc29sYXItcGFuZWxzL2hvdy10by1iZS1lY28tZnJpZW5kbHnSAQA?oc=5\" target=\"_blank\">How to be Eco-Friendly<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Independent<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How to be Eco-Friendly - The Independent","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL2Fkdmlzb3Ivc29sYXItcGFuZWxzL2hvdy10by1iZS1lY28tZnJpZW5kbHnSAQA?oc=5\" target=\"_blank\">How to be Eco-Friendly<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Independent<\/font>","source.href":"https:\/\/www.independent.co.uk","source.title":"The Independent","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Environmental friendliness doesn’t require any grand, sweeping gestures. It’s simply a series of small strategies you can start today – and from the comfort of your own home. Eco-friendly home improvements According to the Committee on Climate Change (CCC), 40 per cent of the UK’s greenhouse gas emissions come from its households. So, when it comes to improving the eco-friendliness of your life, your own home is the best place to start. Small changes made during routine home maintenance could include: Switching to energy-efficient lighting: Are your light bulbs of the traditional, incandescent variety? If so, replace them with energy-efficient LED (light emitting diode) or CFL (compact fluorescent lamp) kinds. CFL bulbs are around 25 per cent more energy-efficient than traditional bulbs, while LEDs are 75 per cent more efficient. Are your light bulbs of the traditional, incandescent variety? If so, replace them with energy-efficient LED (light emitting diode) or CFL (compact fluorescent lamp) kinds. CFL bulbs are around 25 per cent more energy-efficient than traditional bulbs, while LEDs are 75 per cent more efficient. Installing a smart thermostat: With a programmable thermostat, you’ll be able to control your home’s temperature remotely, with an app – setting heating and cooling schedules, and optimising how you heat and cool your property. With a programmable thermostat, you’ll be able to control your home’s temperature remotely, with an app – setting heating and cooling schedules, and optimising how you heat and cool your property. Using natural, toxin-free materials: Integrate long-lasting wooden flooring and timber double-glazed windows – and steer clear of plastic carpets and uPVC (unplasticised polyvinyl chloride) windows. When painting your home, choose a low-VOC (volatile organic compounds) paint. Reducing the amount of VOC solvents in your home’s interior will also reduce levels of indoor pollution – and improve its air quality. Low-carbon heating systems Investing in an energy-efficient heating system is a must – and here, heat pumps excel. Heat pumps draw heat from the external environment to keep a home’s internal environment toasty in winter. They can also be used to heat water and, specifically, only when it’s needed – minimising heat loss from storage tanks. Despite the name, though, heat pumps don’t just heat – they can also be reappropriated, at the height of summer, to cool your home’s interior spaces, too. The best part? Heat pumps are around three times more efficient than gas boilers. They’re more futureproof, too – especially considering the UK’s incoming gas boiler ban. The ban, effective from 2025, will apply to new-build homes only. However, the government is encouraging – and incentivising – properties in the UK and Wales to switch to heat pumps via the Boiler Upgrade Scheme (BUS). The grants it’s offering can take around £5,000 off the total cost of an air-source heat pump, or up to £6,000 off one of the ground-source variety. Another strategy worth considering? Underfloor heating. These systems tend to use less energy to heat a home. They’re more environmentally friendly than radiators, and can reduce the embedded carbon in a home by up to 93 per cent. The same data suggests that, while radiators have a lifespan of around 25 years, underfloor heating lasts up to 75 years – three times that. If you’re stuck with radiators, however, ensure to use a zoning system to distribute heat. Zoned heating systems allow you to heat different areas of your home independently, based on which rooms you and your family are spending the most time in. This prevents wastage, and the overheating of unoccupied rooms. Insulation and weatherproofing Making a home airtight and insulated involves sealing gaps and cracks in your home’s walls, windows, and doors to prevent heat loss in the winter – and keep your place cool in summer. It’ll also make your home more energy-efficient, and help you save on your energy bills. Wall insulation Insulating your external walls is vital – be it using internal external or cavity insulation. A report by the UK government’s Department for Energy Security & Net Zero revealed that 29 per cent of homes with a cavity wall – and 9 per cent of properties with solid walls – were lacking insulation. Without insulation in your external walls, you’re heating your home inefficiently – which, given the energy price cap increases of the last two years, isn’t something many families can afford to do. Floor insulation Similarly, if you don’t have underfloor insulation, you could be losing 20 per cent of your heating and cooling capacity. So, insulate these areas with polyester insulation batts – chemical-free and non-flammable, they’re the most sustainable, eco-friendly choice for your home. Loft insulation The aforementioned Home Office report also suggested that only 17 million homes had loft insulation at the end of 2022 – just two thirds (67 per cent) of the total properties with a loft. So, when insulating your home’s floors and walls, don’t forget its upper reaches – and explore the Energy Saving Trust’s roof and loft insulation guide for actionable and affordable tips for how to set your loft up for energy efficiency. Weatherproofing and draughtproofing Weatherproofing and draughtproofing is one of the cheapest and most effective ways to save both money and energy, says Dr Sarah Price, Head of Building Physics at low-energy design company, Enhabit. So, once you’ve insulated your home, target all the places cold air could enter it – windows, loft hatches, and letterboxes – and fill around them them with sealant. You can also get this done, professionally, for around £250. As for your windows, consider replacing single-glazed ones with their double- or triple-glazed counterparts. These types of windows have inert gas fills between the panes, as well as low-emissivity (low-E) coatings. Together, these combine to improve insulation and reduce heat transfer – keeping your home warmer in the colder seasons. Renewable energy sources Renewable sources of energy generate clean, green power that’ll heat your home – without growing your carbon footprint. They’ll also save you money: helping you not only fulfil your obligations to your wallet, but to the environment, too. Sources of renewable energy include: Solar energy: This is a longer-term investment, but after paying the initial price of solar panels, over time they will save you money. Not only will you reduce your reliance on traditional power sources, but actually make money from them: selling your surplus power back to the grid. This is a longer-term investment, but after paying the initial price of solar panels, over time they will save you money. Not only will you reduce your reliance on traditional power sources, but actually make money from them: selling your surplus power back to the grid. Wind energy: Depending on where you live – and your access to consistent wind patterns – you may be able to install small wind turbines on your property to generate power. For obvious reasons, this is better suited to homes in more rural locations. Depending on where you live – and your access to consistent wind patterns – you may be able to install small wind turbines on your property to generate power. For obvious reasons, this is better suited to homes in more rural locations. Geothermal energy: Ground source heat pumps use the constant temperature of the Earth’s subsurface to heat and cool homes efficiently and reliably. Ground source heat pumps use the constant temperature of the Earth’s subsurface to heat and cool homes efficiently and reliably. Biomass energy: This involves using organic materials (wood; agricultural residues; waste) to generate heat or electricity through the burning or fermentation processes. Energy-efficient appliances Being more eco-friendly can be as simple as adapting those daily, seemingly trivial behaviours that – though they appear small – can actually compound to make a big difference on our planet and prospects. From how you wash the dishes to how you heat up Tuesday’s leftovers, here’s how energy-efficient appliances can make a difference: Refrigerators: Energy-efficient fridges come with better insulation, advanced compressor technology, and more accurate temperature control – meaning they require far less energy to keep your food fresh. Energy-efficient fridges come with better insulation, advanced compressor technology, and more accurate temperature control – meaning they require far less energy to keep your food fresh. Washing machines: Energy-efficient washing machines rely on water-saving technology and improved drum designs to use less water and power per cycle. As for drying, limit the use of your tumble dryer in favour of air drying – inside or out. Energy-efficient washing machines rely on water-saving technology and improved drum designs to use less water and power per cycle. As for drying, limit the use of your tumble dryer in favour of air drying – inside or out. Air conditioners: While energy-efficient air conditioners – that adjust their cooling output to match the cooling load required – do exist, they’re generally not the most eco-friendly solution. A better, albeit more expensive, alternative? A mechanical ventilation with heat recovery (MVHR) unit, or an air source heat pump that can also be used as an air conditioner. While energy-efficient air conditioners – that adjust their cooling output to match the cooling load required – do exist, they’re generally not the most eco-friendly solution. A better, albeit more expensive, alternative? A mechanical ventilation with heat recovery (MVHR) unit, or an air source heat pump that can also be used as an air conditioner. Ovens and stoves: Energy-efficient ovens and stoves offer better insulation, precise temperature control, and cooking convection options. These not only cook food faster – but do so in a way that uses less energy, and is more affordable to boot. The range of energy-efficient appliances doesn’t end here, either. From pool pumps and ventilation systems to a wealth of smart devices (light bulbs, garage door openers, plugs, doorbells), there’s no limit to how environmentally friendly you can set your place up to be. You can also make greener choices not only around how you use your electricity – but where you buy it, too. Researching the best renewable energy suppliers and opting to buy electricity from them, is an excellent place to start. Water conservation Water won’t run out. But cleaning and filtering dirty water for reuse for drinking and showers requires resources. Every litre of water your home wastes is one that takes energy to process and prepare before it can flow back through our taps again. So what some of the things you can do around the house to conserve our H2O – and lower your water bills? Fitting water-saving fixtures: A dripping tap leaking 10 drops of water per minute could see 90 litres of water per month – or 20,000 litres per year – wasted. So, replace old faucets, showerheads, and toilets with water-saving fixtures. These use less water without compromising functionality. A dripping tap leaking 10 drops of water per minute could see 90 litres of water per month – or 20,000 litres per year – wasted. So, replace old faucets, showerheads, and toilets with water-saving fixtures. These use less water without compromising functionality. Take shorter showers: Get into the habit of entering the shower as soon as you can, rather than letting it reach a certain temperature before you climb in. You can also try using a shower timer – set at five minutes, perhaps – to hold you to account to shorter shifts in the shower. Get into the habit of entering the shower as soon as you can, rather than letting it reach a certain temperature before you climb in. You can also try using a shower timer – set at five minutes, perhaps – to hold you to account to shorter shifts in the shower. Collect and reuse water: For a basic, DIY solution, place a bucket in your shower (or outside, if it’s raining) to catch excess water. You can then use this, later, to water plants or clean your home’s outdoor spaces. For a more advanced approach, try a rainwater harvesting system for your home. These collect rainwater and reuse it as grey water (for watering your garden, flushing your toilet and in your washing machine). For a basic, DIY solution, place a bucket in your shower (or outside, if it’s raining) to catch excess water. You can then use this, later, to water plants or clean your home’s outdoor spaces. For a more advanced approach, try a rainwater harvesting system for your home. These collect rainwater and reuse it as grey water (for watering your garden, flushing your toilet and in your washing machine). Wash full loads only: Limit use of your dishwasher or washing machine to when you have a full load to maximise water efficiency. Using technology – such as energy-efficient washing machines and the water-saving fixtures we mentioned above – is an excellent way to conserve water. But in many cases, being responsible with water is as simple as using a broom (instead of a hose) to clean your driveway, or turning off the tap while you’re brushing your teeth. Waste reduction and recycling Recycling is vital to an environmentally friendly household. But it’s not simply how you deal with your home’s refuse that’s important – but reducing the amount you produce in the first place. To boost your home’s waste reduction efforts, try: Avoiding single-use items: Plastic straws, utensils, cups, and water bottles are all a no-no for the environment. Instead, choose reusable alternatives, such as stainless steel, bamboo or glass. Plastic straws, utensils, cups, and water bottles are all a no-no for the environment. Instead, choose reusable alternatives, such as stainless steel, bamboo or glass. Reusing bags and containers: Don’t toss out that plastic takeaway box! It can be reused for leftovers or lunches – or to store household food staples like nuts, cereal, or coffee. Don’t toss out that plastic takeaway box! It can be reused for leftovers or lunches – or to store household food staples like nuts, cereal, or coffee. Composting organic waste: Set up a composting system for food scraps and other yard waste. It’ll save it from the landfill, while creating nutrient-rich soil for your garden’s plants to thrive in. Set up a composting system for food scraps and other yard waste. It’ll save it from the landfill, while creating nutrient-rich soil for your garden’s plants to thrive in. Making (not buying) cleaning products: Simple ingredients, such as vinegar and baking soda, can be combined to emulate shop-bought cleaning supplies. Making these yourself reduces reliance on chemical-filled products: cutting down on packaging. Simple ingredients, such as vinegar and baking soda, can be combined to emulate shop-bought cleaning supplies. Making these yourself reduces reliance on chemical-filled products: cutting down on packaging. Going paperless: Receive bills and statements electronically to reduce paper waste. As for recycling, some useful strategies include:","filter_flag":1}
