{"title":"Oregon State to co-lead $30 million USDA regional food business center - Oregon State University","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vdG9kYXkub3JlZ29uc3RhdGUuZWR1L25ld3Mvb3JlZ29uLXN0YXRlLWNvLWxlYWQtMzAtbWlsbGlvbi11c2RhLXJlZ2lvbmFsLWZvb2QtYnVzaW5lc3MtY2VudGVy0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vdG9kYXkub3JlZ29uc3RhdGUuZWR1L25ld3Mvb3JlZ29uLXN0YXRlLWNvLWxlYWQtMzAtbWlsbGlvbi11c2RhLXJlZ2lvbmFsLWZvb2QtYnVzaW5lc3MtY2VudGVy0gEA?oc=5","id":"CBMiZWh0dHBzOi8vdG9kYXkub3JlZ29uc3RhdGUuZWR1L25ld3Mvb3JlZ29uLXN0YXRlLWNvLWxlYWQtMzAtbWlsbGlvbi11c2RhLXJlZ2lvbmFsLWZvb2QtYnVzaW5lc3MtY2VudGVy0gEA","guidislink":false,"published":"Sun, 07 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=127, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vdG9kYXkub3JlZ29uc3RhdGUuZWR1L25ld3Mvb3JlZ29uLXN0YXRlLWNvLWxlYWQtMzAtbWlsbGlvbi11c2RhLXJlZ2lvbmFsLWZvb2QtYnVzaW5lc3MtY2VudGVy0gEA?oc=5\" target=\"_blank\">Oregon State to co-lead $30 million USDA regional food business center<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Oregon State University<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Oregon State to co-lead $30 million USDA regional food business center - Oregon State University","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vdG9kYXkub3JlZ29uc3RhdGUuZWR1L25ld3Mvb3JlZ29uLXN0YXRlLWNvLWxlYWQtMzAtbWlsbGlvbi11c2RhLXJlZ2lvbmFsLWZvb2QtYnVzaW5lc3MtY2VudGVy0gEA?oc=5\" target=\"_blank\">Oregon State to co-lead $30 million USDA regional food business center<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Oregon State University<\/font>","source.href":"https:\/\/today.oregonstate.edu","source.title":"Oregon State University","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"CORVALLIS, Ore. – Oregon State University has been selected to co-lead a $30 million U.S. Department of Agriculture regional food business center that will support farmers, ranchers and other food-related businesses to access new markets and navigate federal, state and local resources. The Northwest and Rocky Mountain Regional Food Business Center, which Oregon State will lead with Colorado State University, will serve Colorado, Idaho, Montana, Oregon, Washington and Wyoming. It is one of 12 new USDA centers nationally that are part of a $400 million initiative that focuses on small and mid-sized farm and food businesses within local and regional food systems. The centers will focus on historically underinvested and underserved communities in their region. “This is important recognition of the work we have been doing to build a strong local food economy in Oregon, in collaboration with farmers, food businesses, grassroots organizations, and many other partners around our state,” said Lauren Gwin, interim director of OSU’s Center for Small Farms & Community Food Systems in the College of Agricultural Sciences and OSU Extension community food systems specialist. “We are excited to take this work to another level, here at home and across the West.” The Northwest and Rocky Mountain Regional Food Business Center will focus on four areas that are priorities for the six-state region: Strengthening local supply chains for animal proteins. This work will support small- and mid-scale meat and poultry businesses by expanding the Western Meat School, led by the Niche Meat Processor Assistance Network, a national program within OSU’s Center for Small Farms & Community Food Systems. Participants learn about producing, financing, processing, marketing and pricing niche meat products. Rebecca Thistlethwaite, NMPAN Director, will co-lead this area. Connecting and scaling food entrepreneurs. Guidance and resources from government agencies and institutions are key for business development, but often don’t align with the needs of small- and mid-sized enterprises. The work will facilitate connections among entrepreneurs and disseminate information about resources and programs that could aid those looking to scale their businesses. Sarah Masoni of Oregon State’s Food Innovation Center will co-lead this area. Supporting climate-resilient agriculture. Scientific research is focused on developing climate resilient grants and other crops, but information about how to process and market those products is lacking. This work will expand processing infrastructure, develop new products, help create supply chain contracts and implement marketing strategies using those climate-resilient crops. “Right-sizing” investment and infrastructure. This work includes improving two-way understanding and communication between food producers, processors, and distributors and investors, banks, and other sources of capital that potentially can provide funding. The investment and infrastructure work is particularly crucial to supply chain infrastructure and systems, which must be the appropriate scale for producers, products and markets to thrive The Northwest and Rocky Mountain Regional Food Business Center will be supported by a regional steering committee with staff from OSU and Colorado State, teams from each of the six states and four priority areas, and community leaders from underserved and underinvested communities engaged at all levels in the center.","filter_flag":1}
{"title":"Bill would shield recyclers from PFAS cleanup costs - Resource Recycling","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9yZWN5Y2xpbmcvMjAyMy8wNS8xNS9iaWxsLXdvdWxkLXNoaWVsZC1yZWN5Y2xlcnMtZnJvbS1wZmFzLWNsZWFudXAtY29zdHMv0gFoaHR0cHM6Ly9yZXNvdXJjZS1yZWN5Y2xpbmcuY29tL3JlY3ljbGluZy8yMDIzLzA1LzE1L2JpbGwtd291bGQtc2hpZWxkLXJlY3ljbGVycy1mcm9tLXBmYXMtY2xlYW51cC1jb3N0cy8?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9yZWN5Y2xpbmcvMjAyMy8wNS8xNS9iaWxsLXdvdWxkLXNoaWVsZC1yZWN5Y2xlcnMtZnJvbS1wZmFzLWNsZWFudXAtY29zdHMv0gFoaHR0cHM6Ly9yZXNvdXJjZS1yZWN5Y2xpbmcuY29tL3JlY3ljbGluZy8yMDIzLzA1LzE1L2JpbGwtd291bGQtc2hpZWxkLXJlY3ljbGVycy1mcm9tLXBmYXMtY2xlYW51cC1jb3N0cy8?oc=5","id":"CBMiaGh0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9yZWN5Y2xpbmcvMjAyMy8wNS8xNS9iaWxsLXdvdWxkLXNoaWVsZC1yZWN5Y2xlcnMtZnJvbS1wZmFzLWNsZWFudXAtY29zdHMv0gFoaHR0cHM6Ly9yZXNvdXJjZS1yZWN5Y2xpbmcuY29tL3JlY3ljbGluZy8yMDIzLzA1LzE1L2JpbGwtd291bGQtc2hpZWxkLXJlY3ljbGVycy1mcm9tLXBmYXMtY2xlYW51cC1jb3N0cy8","guidislink":false,"published":"Mon, 15 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=15, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=135, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9yZWN5Y2xpbmcvMjAyMy8wNS8xNS9iaWxsLXdvdWxkLXNoaWVsZC1yZWN5Y2xlcnMtZnJvbS1wZmFzLWNsZWFudXAtY29zdHMv0gFoaHR0cHM6Ly9yZXNvdXJjZS1yZWN5Y2xpbmcuY29tL3JlY3ljbGluZy8yMDIzLzA1LzE1L2JpbGwtd291bGQtc2hpZWxkLXJlY3ljbGVycy1mcm9tLXBmYXMtY2xlYW51cC1jb3N0cy8?oc=5\" target=\"_blank\">Bill would shield recyclers from PFAS cleanup costs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Resource Recycling<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bill would shield recyclers from PFAS cleanup costs - Resource Recycling","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9yZWN5Y2xpbmcvMjAyMy8wNS8xNS9iaWxsLXdvdWxkLXNoaWVsZC1yZWN5Y2xlcnMtZnJvbS1wZmFzLWNsZWFudXAtY29zdHMv0gFoaHR0cHM6Ly9yZXNvdXJjZS1yZWN5Y2xpbmcuY29tL3JlY3ljbGluZy8yMDIzLzA1LzE1L2JpbGwtd291bGQtc2hpZWxkLXJlY3ljbGVycy1mcm9tLXBmYXMtY2xlYW51cC1jb3N0cy8?oc=5\" target=\"_blank\">Bill would shield recyclers from PFAS cleanup costs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Resource Recycling<\/font>","source.href":"https:\/\/resource-recycling.com","source.title":"Resource Recycling","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"A bill introduced in the U.S. Senate protects composting, recycling and garbage facilities from cleanup cost liability if a class of chemicals called PFAS contaminates the environment at their facilities. The legislation, introduced by Sen. Cynthia Lummis of Wyoming and sponsored by several other Senate Republicans, exempts owners\/operators of composting operations and solid waste management facilities from liability under the federal Comprehensive Environmental Response, Compensation, and Liability Act (CERCLA) of 1980, commonly known as the “Superfund” law. Specifically, they’d be protected from liability with respect to environmental contamination from perfluoroalkyl and polyfluoroalkyl substances, or PFAS, which are a class of long-lasting chemicals found in consumer, commercial and industrial products that present human toxicity and environmental contamination concerns. The chemicals can be added in the manufacturing of products, or PFAS can result as an unintended byproduct of manufacturing. Under CERCLA, owners of contaminated sites, as well as individuals and organizations that shipped the contaminated material to those sites in the first place, can be sued and forced to help contribute to cleanups under certain circumstances. The law has recently been applied to force electronics recycling companies to contribute to the cleanup of stockpiles of old, bulky TVs containing leaded glass, for example. What would change Lummis’ bill says that resource management facilities – essentially defined by federal law to include composters, recycling and garbage facilities – can’t be forced to help pay for environmental cleanup if they received and managed solid waste or biosolids that contained PFAS. An exemption is if the resource management facilities acted “with gross negligence or willful misconduct in the discharge, disposal, management, processing, conveyance, or storage” or PFAS substances. The legislation, which hasn’t been assigned a bill number yet, is just one of five bills Lummis has introduced that exempt different industries from CERCLA liability for PFAS. The introduction comes as the U.S. EPA is considering designating some PFAS compounds as hazardous substances under CERCLA. “There is no doubt we need to consider the environmental impacts of PFAS chemicals but suing entities who did not contribute to the contamination is overkill, especially considering some of these entities, such as ranches and water facilities, are just downstream receivers,” Lummis stated in a press release. The National Waste & Recycling Association (NWRA), Solid Waste Association of North America (SWANA), US Composting Council, Waste Management (WM) others voiced support for the bill. States such as California, New York, Oregon and others are beginning to target the use of PFAS in new products. Private recycling industry stakeholders, including the How2Recycle labeling program and the U.S. Plastics Pact, have also taken steps against the use of intentionally added PFAS. More stories about regulation\/oversight","filter_flag":1}
{"title":"Formulation of the new Mid-term Management Plan ”Nitto for Everyone 2025” | Nitto - Nitto Denko Corporation","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5pdHRvLmNvbS91cy9lbi9wcmVzcy8yMDIzLzA1MzFfMDIuanNw0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5pdHRvLmNvbS91cy9lbi9wcmVzcy8yMDIzLzA1MzFfMDIuanNw0gEA?oc=5","id":"CBMiMmh0dHBzOi8vd3d3Lm5pdHRvLmNvbS91cy9lbi9wcmVzcy8yMDIzLzA1MzFfMDIuanNw0gEA","guidislink":false,"published":"Wed, 31 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=151, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5pdHRvLmNvbS91cy9lbi9wcmVzcy8yMDIzLzA1MzFfMDIuanNw0gEA?oc=5\" target=\"_blank\">Formulation of the new Mid-term Management Plan ”Nitto for Everyone 2025” | Nitto<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nitto Denko Corporation<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Formulation of the new Mid-term Management Plan ”Nitto for Everyone 2025” | Nitto - Nitto Denko Corporation","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5pdHRvLmNvbS91cy9lbi9wcmVzcy8yMDIzLzA1MzFfMDIuanNw0gEA?oc=5\" target=\"_blank\">Formulation of the new Mid-term Management Plan ”Nitto for Everyone 2025” | Nitto<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nitto Denko Corporation<\/font>","source.href":"https:\/\/www.nitto.com","source.title":"Nitto Denko Corporation","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"The Nitto Groups places ESG (Environment, Social, Governance) at the core of management and accelerates to create new products and services at the intersections of the three focus domains. Additionally, we aim to leap forward and contribute further to the healthy living of people and a sustainable global environment. Please access the following site for the details of “Nitto for Everyone 2025.” Nitto for Everyone 2025","filter_flag":1}
{"title":"UM Announces New U.S. Leadership Across Growth, Strategy, Planning, Intelligence, Client Services and Operations - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiogFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VtLWFubm91bmNlcy1uZXctdXMtbGVhZGVyc2hpcC1hY3Jvc3MtZ3Jvd3RoLXN0cmF0ZWd5LXBsYW5uaW5nLWludGVsbGlnZW5jZS1jbGllbnQtc2VydmljZXMtYW5kLW9wZXJhdGlvbnMtMzAxODIzMzU1Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiogFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VtLWFubm91bmNlcy1uZXctdXMtbGVhZGVyc2hpcC1hY3Jvc3MtZ3Jvd3RoLXN0cmF0ZWd5LXBsYW5uaW5nLWludGVsbGlnZW5jZS1jbGllbnQtc2VydmljZXMtYW5kLW9wZXJhdGlvbnMtMzAxODIzMzU1Lmh0bWzSAQA?oc=5","id":"CBMiogFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VtLWFubm91bmNlcy1uZXctdXMtbGVhZGVyc2hpcC1hY3Jvc3MtZ3Jvd3RoLXN0cmF0ZWd5LXBsYW5uaW5nLWludGVsbGlnZW5jZS1jbGllbnQtc2VydmljZXMtYW5kLW9wZXJhdGlvbnMtMzAxODIzMzU1Lmh0bWzSAQA","guidislink":false,"published":"Fri, 12 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=132, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiogFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VtLWFubm91bmNlcy1uZXctdXMtbGVhZGVyc2hpcC1hY3Jvc3MtZ3Jvd3RoLXN0cmF0ZWd5LXBsYW5uaW5nLWludGVsbGlnZW5jZS1jbGllbnQtc2VydmljZXMtYW5kLW9wZXJhdGlvbnMtMzAxODIzMzU1Lmh0bWzSAQA?oc=5\" target=\"_blank\">UM Announces New U.S. Leadership Across Growth, Strategy, Planning, Intelligence, Client Services and Operations<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"UM Announces New U.S. Leadership Across Growth, Strategy, Planning, Intelligence, Client Services and Operations - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiogFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VtLWFubm91bmNlcy1uZXctdXMtbGVhZGVyc2hpcC1hY3Jvc3MtZ3Jvd3RoLXN0cmF0ZWd5LXBsYW5uaW5nLWludGVsbGlnZW5jZS1jbGllbnQtc2VydmljZXMtYW5kLW9wZXJhdGlvbnMtMzAxODIzMzU1Lmh0bWzSAQA?oc=5\" target=\"_blank\">UM Announces New U.S. Leadership Across Growth, Strategy, Planning, Intelligence, Client Services and Operations<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"NEW YORK, May 12, 2023 \/PRNewswire\/ -- UM, a global media agency network of IPG Mediabrands, today announced new U.S. leadership, bolstering the agency's commitment to upleveling craft across all practices. The appointments include Grant Ogburn to Chief Growth Officer, Myia Thompkins to Chief Strategy Officer, Preston Larson to Chief Planning Officer, Brendon Volpe to Chief Intelligence Officer and the elevations of Erin Quintana to Chief Client Officer and Jennifer Wadeyka to Chief Operating Officer. All new leadership reports directly to U.S. CEO, W. Joe DeMiero. \"Grant, Myia, Preston, Brendon, Erin and Jen bring a wealth of experience that translates to powerful business results across their respective areas of expertise for some of the world's biggest brands, and I'm thrilled to welcome them to the UM executive team,\" said DeMiero. \"These leaders will plus up our capabilities and offerings in the marketplace while strengthening our core practices and areas of opportunity for our people, internally.\" UM's new leadership bolsters the agency's commitment to upleveling craft across all practices. Post this Grant Ogburn, Chief Growth Officer Ogburn is the driving force behind UM's new business development strategy, responsible for spearheading pitch strategy and generating leads for new client relationships. He works closely across practices to initiate and optimize growth opportunities, ensuring globally scalable prospecting. In partnership with IPG sister agencies, The Martin Agency, McCann, Black Glass and Momentum, Ogburn harnesses Acxiom data and insights to help brands connect with consumers in new and powerful ways. Previously, Ogburn was President of Publicis Experiential; Chief Marketing Officer of Publicis' creative production division, PXP; co-founder of TiltShift, Publicis' XR content start-up; and worked extensively across Microsoft Xbox Marketing and Advertising. He is actively involved in organizations dedicated to advancing the wellbeing of the AAPI community, and also works with the Make-A-Wish Foundation and the Los Angeles Gay and Lesbian Center. Myia Thompkins, Chief Strategy Officer Thompkins is responsible for strengthening the agency's strategy product and capability offering, uncovering new opportunities in the marketplace, and working in partnership with leadership across the agency's practices and accounts to create innovative strategies that deliver exceptional business outcomes for clients. She collaborates closely with Mediabrands Content Studio, the media-fueled creative content agency within IPG Mediabrands, to translate Acxiom insights into inspirational strategies that underpin market-moving branded content. Joining UM from Hero Collective where she led the strategy team, Thompkins also held executive roles at Publicis' Hawkeye. Passionate about advancing diversity, she is a member of the National Black MBA Association, an organization dedicated to the creation of educational, wealth building and growth opportunities for historically underrepresented groups. Preston Larson, Chief Planning Officer In this newly-created role, Larson is unifying UM's industry-leading Planning practice. A 20-year industry veteran, he is charged with reinventing and leading the integrated media planning process across multiple lines of business, inclusive of brand and performance activity. He also leverages the scale and strategic media partnerships of MAGNA, the intelligence and investment arm of IPG Mediabrands, to align large scale value with client objectives and opportunities. Previously at Publicis Groupe's integrated media\/communications agency, Team One, Larson worked in media leadership positions for high-profile brands like Lexus. Committed to creating inclusive talent pipelines into the industry, he is a sponsor for the 4As 2023 Vanguard program, a platform dedicated to growth, impact and exposure for AA\/Black professionals. He is also an original member of the Roku Advisory Board, where he provides guidance, strategic advice and support for go-to-market ad products. Brendon Volpe, Chief Intelligence Officer As UM's first Chief Intelligence Officer, Volpe is focused on building, optimizing and advancing the agency's newly established Strategic Intelligence practice. His responsibilities include fueling business growth by uncovering and creating insight from UM's industry-leading data & analytics, strategy, innovation, research and in-house domain experts to drive the agency's differentiated approach and offerings for new and potential clients. As part of his role, Volpe partners with MAGNA's Intelligence unit to identify media trial opportunities and to activate MAGNA's unmatched data and research on client businesses. A consummate team builder focused on development and success, Volpe is passionate about fostering a culture rooted in collaboration, creativity and innovation. He most recently held leadership positions at Hawkeye as the company's Chief Strategy Officer and Condé Nast as Head of Strategy for CNX. Erin Quintana, Chief Client Officer In her 15+ years at UM, Quintana has specialized in strategy for iconic Johnson & Johnson brands such as Band-Aid, Neutrogena, Listerine and Johnson's Baby and currently leads the global American Express business. Recently elevated to Chief Client Officer, she is responsible for overseeing all account management; establishing a vision and strategic plan that advances key measures of success across client relationships including team health, work quality and business results; and ensuring growth of client business. Quintana is a key driver of the agency's success, from winning new business pitches to training and mentoring up-and-coming talent. Prior to UM, she held media planning roles at OMD and Carat USA. Earlier in her career, she was inducted into the AAF's Advertising Hall of Achievement, the industry's premier award for outstanding advertising rising stars. Jennifer Wadeyka, Chief Operating Officer Wadeyka leads the charge on Business Planning and Operations, Media Operations, Resource Management and New Products and Services to drive efficiencies. She executes all new business transitions and optimizes the agency's commercial and future deal structures with new and existing clients. Over her 13+ years at the agency, Wadeyka has worked on multiple global and US clients and served as a critical member of the new business team. Her leadership has also extended across IPG Mediabrands through various senior business development roles, overseeing all business development and marketing efforts for the network. Wadeyka is a member of She Runs It, an organization committed to removing barriers, creating access, and lifting up women of all identities, ethnicities, and backgrounds through mentorship, development workshops and events, and has previously participated with the NICU Family Advisory Council at Saint Barnabas Medical Center. DeMiero continued: \"These powerhouse leaders are incredibly passionate about driving the growth of our business and our people, and I look forward to the impact they will have on our client relationships, culture and community.\" This announcement follows several accolades UM has recently received, including being named a FORTUNE Best Workplace in Advertising & Marketing, a Top Workplace in the US by Great Places to Work several times over and distinctions for \"Inclusive Workplace\" and \"Sustainability Standout\" in Campaign's 2023 Agency Performance Review. About UM UM is a global media agency committed to Futureproofing our clients' businesses for the now and the next. We leverage the transformational power of rich business analytics and real-time intelligence to maximize growth and activate the full consumer journey across content and connections. Our consultative approach and agile model, rooted in diversity, equity and belonging, drive better business outcomes for brands. As the leading global media network in IPG Mediabrands, UM operates in over 100 countries, with more than 3,500 people innovating on a roster of global clients including Accenture, American Express, ExxonMobil, GoPro, Johnson & Johnson, Levi Strauss & Co, Mattel, Sony and Spotify. For more information, please visit https:\/\/www.umww.com\/. SOURCE UM","filter_flag":1}
{"title":"The challenges of greenhouse gas accounting in the UK's waste and recycling sector - Ricardo PLC","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5yaWNhcmRvLmNvbS9lbi9uZXdzLWFuZC1pbnNpZ2h0cy9pbnNpZ2h0cy90aGUtY2hhbGxlbmdlcy1vZi1ncmVlbmhvdXNlLWdhcy1hY2NvdW50aW5nLWluLXRoZS11ay1zLXdhc3RlLWFuZC1yZWN5Y2xpbmctc2VjdG9y0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5yaWNhcmRvLmNvbS9lbi9uZXdzLWFuZC1pbnNpZ2h0cy9pbnNpZ2h0cy90aGUtY2hhbGxlbmdlcy1vZi1ncmVlbmhvdXNlLWdhcy1hY2NvdW50aW5nLWluLXRoZS11ay1zLXdhc3RlLWFuZC1yZWN5Y2xpbmctc2VjdG9y0gEA?oc=5","id":"CBMiiAFodHRwczovL3d3dy5yaWNhcmRvLmNvbS9lbi9uZXdzLWFuZC1pbnNpZ2h0cy9pbnNpZ2h0cy90aGUtY2hhbGxlbmdlcy1vZi1ncmVlbmhvdXNlLWdhcy1hY2NvdW50aW5nLWluLXRoZS11ay1zLXdhc3RlLWFuZC1yZWN5Y2xpbmctc2VjdG9y0gEA","guidislink":false,"published":"Wed, 24 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=24, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=144, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5yaWNhcmRvLmNvbS9lbi9uZXdzLWFuZC1pbnNpZ2h0cy9pbnNpZ2h0cy90aGUtY2hhbGxlbmdlcy1vZi1ncmVlbmhvdXNlLWdhcy1hY2NvdW50aW5nLWluLXRoZS11ay1zLXdhc3RlLWFuZC1yZWN5Y2xpbmctc2VjdG9y0gEA?oc=5\" target=\"_blank\">The challenges of greenhouse gas accounting in the UK's waste and recycling sector<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Ricardo PLC<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The challenges of greenhouse gas accounting in the UK's waste and recycling sector - Ricardo PLC","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5yaWNhcmRvLmNvbS9lbi9uZXdzLWFuZC1pbnNpZ2h0cy9pbnNpZ2h0cy90aGUtY2hhbGxlbmdlcy1vZi1ncmVlbmhvdXNlLWdhcy1hY2NvdW50aW5nLWluLXRoZS11ay1zLXdhc3RlLWFuZC1yZWN5Y2xpbmctc2VjdG9y0gEA?oc=5\" target=\"_blank\">The challenges of greenhouse gas accounting in the UK's waste and recycling sector<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Ricardo PLC<\/font>","source.href":"https:\/\/www.ricardo.com","source.title":"Ricardo PLC","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"The challenges of greenhouse gas accounting in the UK’s waste and recycling sector The waste and recycling sector is making progress on the journey to net zero but there are specific issues to navigate when in comes to collecting, analysing and reporting emissions in the sector. Ricardo waste expert, Steve Brown, explores these challenges in this blog. In 2020, waste management accounted for 4% of UK’s greenhouse gas (GHG) emissions. Despite its relatively low contribution when compared to other sectors, such as agriculture and transport, the emissions associated with waste management are playing a significant role in the UK’s journey to net zero. The sector has already achieved an emissions reduction of 73% since 1990, mainly due to actions taken to reduce landfilling, and has strong links with other industries, such as energy and transport. Waste management companies have seen an increase in market and policy-related pressures in the recent years. Following the Paris Agreement and the 2019 Climate Change Act, the Environmental Services Association (ESA), the industry body for the waste and recycling sector, commissioned Ricardo to establish the baseline greenhouse gas (GHG) emissions of the sector and set out a pathway to reach net zero by 2040. The publication of the ESA Net Zero Strategy in June 2021 resulted in most large companies in the sector committing to achieve net zero status by 2040. The market is moving forward with local authorities declaring climate emergencies and the publication of the Procurement Policy Note (PPN) 06\/21, which requires organisations procuring goods and\/or services with an anticipated contract value above £5 million per annum to have a published Carbon Reduction Plan. This plan, amongst other requirements, details the organisation’s GHG emissions and confirms its commitment to achieving net zero by 2050. These developments have made GHG emissions a key criteria in procurement. Ricardo’s experience working on decarbonisation projects with waste and recycling organisations has brought to surface some of the challenges the sector faces when attempting to quantify their emissions. Avoided emissions Avoided emissions arise when an activity leads to emissions not being released that would otherwise have occurred. In the case of the waste and recycling sector, materials that are diverted for reuse or recycling can offset the need to make new products from virgin materials, and so can be assigned a credit for the emissions avoided by not making those new products. For example, the generation of electricity in an Energy from Waste facility avoids the need for generation of electricity from other sources, such as coal and natural gas. Similarly, the recycling of aluminium avoids the need to extract and process aluminium ore. The sector contributes to avoided emissions across the supply chains of other industries, to such an extent, that, were avoided emissions included in (i.e., deducted from) the sector’s carbon footprint, the GHG emissions balance would have a negative value. This significant benefit, which the sector cannot claim credits for, has been the subject of debate as the lack of framework on accounting of GHG emissions can discourage companies from fully utilising materials and energy as in many cases that results in an increase of their scope 1 and 2 emissions leaving them further away from their net zero targets. Data collection and reporting When it comes to GHG emissions reporting, waste management companies face two challenges. First, they must collect data which may not be readily available or disaggregated enough to allocate it to specific processes. Secondly, the most frequently used emission factors related to recycling are published as one aggregated value per material, which does not allow reporting in scopes. Consequently, a recycling firm who wishes to exclude a part of the factor which is already accounted for in their footprint is bound to some degree of double counting. Local authorities need to estimate the emissions associated with their waste management contracts. However, due to the information agreements with their contractors, detailed data, such as fuel and electricity consumption and the destinations of collected waste, may not be allowed to be shared. Consequently, the assessment of the total emissions associated with the collection and treatment of waste, from the point of generation at households and businesses to final fate, is usually incomplete. Address these challenges The challenge on avoided emissions requires agreement across the sector on the approach to be followed. As a next step, pressure could be applied to the government to explore how a framework on the accounting of avoided emissions could be developed, to incorporate avoided emissions in the GHG emissions reporting standards. As far as data is concerned, Ricardo can help businesses identify the data required for the assessments and undertake life cycle assessments to break down emissions factors. Moreover, data collected from the various databases available can be used to fill in any data gaps. Support for the waste sector Ricardo has completed many carbon footprints for the operations of waste management companies, usually accompanied with mitigation measures to achieve net zero emissions, procurement exercises (which included GHG emissions in the evaluation criteria) for both bidders and local authorities, and GHG emissions assessments for councils and their waste management contracts and strategies. The outcomes of these projects helped our clients to: Keep up with their competition Understand the concept of GHG emissions and how they associate with them Understand their current position Start thinking about their next steps to reduce emissions Our long experience working with the waste sector means we can help organisations overcome challenges associated with carbon accounting through our technical expertise, bespoke tools and breadth of capabilities. Our dedicated Waste and Resource Management and Carbon Management teams, work with other Ricardo technical specialists in areas such as carbon capture, utilisation and storage and sustainable transport, to find effective and efficient solutions that help organisations progress their journey to net zero. For any questions or to find out how we can support you organisation with decarbonisation get in touch Our services:","filter_flag":1}
{"title":"Tesla Teases Two New EVs That Could Sell More Than 5 Million Units Per Year - CarScoops","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LmNhcnNjb29wcy5jb20vMjAyMy8wNS90ZXNsYS10ZWFzZXMtdHdvLW5ldy1ldnMtdGhhdC1jb3VsZC1zZWxsLW1vcmUtdGhhbi01LW1pbGxpb24tdW5pdHMtcGVyLXllYXIv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LmNhcnNjb29wcy5jb20vMjAyMy8wNS90ZXNsYS10ZWFzZXMtdHdvLW5ldy1ldnMtdGhhdC1jb3VsZC1zZWxsLW1vcmUtdGhhbi01LW1pbGxpb24tdW5pdHMtcGVyLXllYXIv0gEA?oc=5","id":"CBMibmh0dHBzOi8vd3d3LmNhcnNjb29wcy5jb20vMjAyMy8wNS90ZXNsYS10ZWFzZXMtdHdvLW5ldy1ldnMtdGhhdC1jb3VsZC1zZWxsLW1vcmUtdGhhbi01LW1pbGxpb24tdW5pdHMtcGVyLXllYXIv0gEA","guidislink":false,"published":"Wed, 17 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=137, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LmNhcnNjb29wcy5jb20vMjAyMy8wNS90ZXNsYS10ZWFzZXMtdHdvLW5ldy1ldnMtdGhhdC1jb3VsZC1zZWxsLW1vcmUtdGhhbi01LW1pbGxpb24tdW5pdHMtcGVyLXllYXIv0gEA?oc=5\" target=\"_blank\">Tesla Teases Two New EVs That Could Sell More Than 5 Million Units Per Year<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CarScoops<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Tesla Teases Two New EVs That Could Sell More Than 5 Million Units Per Year - CarScoops","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LmNhcnNjb29wcy5jb20vMjAyMy8wNS90ZXNsYS10ZWFzZXMtdHdvLW5ldy1ldnMtdGhhdC1jb3VsZC1zZWxsLW1vcmUtdGhhbi01LW1pbGxpb24tdW5pdHMtcGVyLXllYXIv0gEA?oc=5\" target=\"_blank\">Tesla Teases Two New EVs That Could Sell More Than 5 Million Units Per Year<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CarScoops<\/font>","source.href":"https:\/\/www.carscoops.com","source.title":"CarScoops","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Elon Musk claims that \"both the design of the products and the manufacturing techniques are head and shoulders above anything else that is present in industry\" Tesla’s 2023 Annual Shareholders Meeting included an important announcement for future products, albeit with limited details. In short, Elon Musk teased two new EVs which he predicts could sell more than 5 million units per year combined. The Tesla CEO was coy on details about the two unnamed EVs, as he would prefer a “proper dedicated product launch”. Musk said: “I just want to emphasize that we are actually building a new product, we are actually designing a new product”, adding that “There are two new products that I think you will be very excited about”. More: Could This Be Our First Look Of The Updated Tesla Model 3? The Tesla CEO made some bold claims, saying that “both the design of the products and the manufacturing techniques are head and shoulders above anything else that is present in industry” creating high expectations from the shareholders. He also predicted that the combined sales of those two new products alone would be “in excess of 5 million units per year”, although he clarified that this is just “Elon’s guess” jokingly adding “Don’t sue me”. Musk didn’t clarify if those products are the upcoming facelifts for the Model 3 (Project Highland) and the Model Y (Project Juniper) which are expected to enter production in autumn 2023 and in late 2024 respectively. However, the single shadowy teaser that appeared on the screen looks very similar to the Tesla Model Y, making it less likely to be an all-new and smaller-sized EV. The sloping roofline appears to be unchanged, with a few revisions on the short bonnet and the tail. Judging from leaked photos, rumors, and insider information, the facelifted Model 3 and Y will feature a number of exterior and interior updates, focused on making them cheaper to produce and more technologically advanced in order to stay relevant against a growing number of competitors. You can watch the part of the presentation where Elon Musk talks about the new products after the 29.15 mark in the video below.","filter_flag":1}
{"title":"Global Party Supply Rental Market Report 2023: Increasing Parties and Functions by Human Resource Management in ... - GlobeNewswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi2AFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNS8xOC8yNjcxNzc0LzI4MTI0L2VuL0dsb2JhbC1QYXJ0eS1TdXBwbHktUmVudGFsLU1hcmtldC1SZXBvcnQtMjAyMy1JbmNyZWFzaW5nLVBhcnRpZXMtYW5kLUZ1bmN0aW9ucy1ieS1IdW1hbi1SZXNvdXJjZS1NYW5hZ2VtZW50LWluLUNvcnBvcmF0aW9ucy1Ecml2ZXMtR3Jvd3RoLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi2AFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNS8xOC8yNjcxNzc0LzI4MTI0L2VuL0dsb2JhbC1QYXJ0eS1TdXBwbHktUmVudGFsLU1hcmtldC1SZXBvcnQtMjAyMy1JbmNyZWFzaW5nLVBhcnRpZXMtYW5kLUZ1bmN0aW9ucy1ieS1IdW1hbi1SZXNvdXJjZS1NYW5hZ2VtZW50LWluLUNvcnBvcmF0aW9ucy1Ecml2ZXMtR3Jvd3RoLmh0bWzSAQA?oc=5","id":"CBMi2AFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNS8xOC8yNjcxNzc0LzI4MTI0L2VuL0dsb2JhbC1QYXJ0eS1TdXBwbHktUmVudGFsLU1hcmtldC1SZXBvcnQtMjAyMy1JbmNyZWFzaW5nLVBhcnRpZXMtYW5kLUZ1bmN0aW9ucy1ieS1IdW1hbi1SZXNvdXJjZS1NYW5hZ2VtZW50LWluLUNvcnBvcmF0aW9ucy1Ecml2ZXMtR3Jvd3RoLmh0bWzSAQA","guidislink":false,"published":"Thu, 18 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=138, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi2AFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNS8xOC8yNjcxNzc0LzI4MTI0L2VuL0dsb2JhbC1QYXJ0eS1TdXBwbHktUmVudGFsLU1hcmtldC1SZXBvcnQtMjAyMy1JbmNyZWFzaW5nLVBhcnRpZXMtYW5kLUZ1bmN0aW9ucy1ieS1IdW1hbi1SZXNvdXJjZS1NYW5hZ2VtZW50LWluLUNvcnBvcmF0aW9ucy1Ecml2ZXMtR3Jvd3RoLmh0bWzSAQA?oc=5\" target=\"_blank\">Global Party Supply Rental Market Report 2023: Increasing Parties and Functions by Human Resource Management in ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Global Party Supply Rental Market Report 2023: Increasing Parties and Functions by Human Resource Management in ... - GlobeNewswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi2AFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNS8xOC8yNjcxNzc0LzI4MTI0L2VuL0dsb2JhbC1QYXJ0eS1TdXBwbHktUmVudGFsLU1hcmtldC1SZXBvcnQtMjAyMy1JbmNyZWFzaW5nLVBhcnRpZXMtYW5kLUZ1bmN0aW9ucy1ieS1IdW1hbi1SZXNvdXJjZS1NYW5hZ2VtZW50LWluLUNvcnBvcmF0aW9ucy1Ecml2ZXMtR3Jvd3RoLmh0bWzSAQA?oc=5\" target=\"_blank\">Global Party Supply Rental Market Report 2023: Increasing Parties and Functions by Human Resource Management in ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","source.href":"https:\/\/www.globenewswire.com","source.title":"GlobeNewswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Dublin, May 18, 2023 (GLOBE NEWSWIRE) -- The \"Global Party Supply Rental Market by Type (Corporate Functions, Family Events, NGOs), Product (Audio-Visual, Beverage Servers, Cooking Equipment), Distribution - Cumulative Impact of High Inflation - Forecast 2023-2030\" report has been added to ResearchAndMarkets.com's offering. The Global Party Supply Rental Market size was estimated at USD 12.38 billion in 2022, USD 14.20 billion in 2023, and is projected to grow at a Compound Annual Growth Rate (CAGR) of 14.86% to reach USD 37.54 billion by 2030. Market Dynamics Drivers Increases in Personal Disposable Income Rising Trend and Consumer Preference for Elaborative Celebrations Influence of Social Media and Digital Platforms for Portraying Personal Lifestyle Restraints Thefts, Loss and Damages to the Rental Products Opportunities Rising Social Events Like Parties, Marriages, and Inaugurations Increasing Parties and Functions by Human Resource Managements in Corporatation Challenges Rapid Changing Consumer Trends Market Segmentation & Coverage: This research report categorizes the Global Party Supply Rental Market in order to forecast the revenues and analyze trends in each of following sub-markets: Based on Type, market is studied across Corporate Functions, Family Events, and NGOs. The Corporate Functions is further studied across Conferences, Corporate Parties, Education & University Events, Fundraisers, Hospitality, and Trade Shows. The Family Events is further studied across Anniversary Parties, Baby Showers, Bachelor Party, Birthday Parties, Family Reunions, Graduation Parties, and Weddings. The Corporate Functions is projected to witness significant market share during forecast period. Based on Product, market is studied across Audio-Visual, Beverage Servers, Cooking Equipment, Decor, Flooring & Staging, Glassware & Food Service Supplies, Lighting, Heaters & Fans, Portable Bars, Social Distancing Supplies, Soft Play Zone \/ Fun Activities, Tables, Chairs & Cloths, Tents & Umbrellas, and Wedding Decor. The Soft Play Zone \/ Fun Activities is projected to witness significant market share during forecast period. Based on Distribution, market is studied across Offline and Online. The Offline is projected to witness significant market share during forecast period. Based on Region, market is studied across Americas, Asia-Pacific, and Europe, Middle East & Africa. The Americas is further studied across Argentina, Brazil, Canada, Mexico, and United States. The United States is further studied across California, Florida, Illinois, New York, Ohio, Pennsylvania, and Texas. The Asia-Pacific is further studied across Australia, China, India, Indonesia, Japan, Malaysia, Philippines, Singapore, South Korea, Taiwan, Thailand, and Vietnam. Europe, Middle East & Africa is further studied across Denmark, Egypt, Finland, France, Germany, Israel, Italy, Netherlands, Nigeria, Norway, Poland, Qatar, Russia, Saudi Arabia, South Africa, Spain, Sweden, Switzerland, Turkey, United Arab Emirates, and United Kingdom. The Americas is projected to witness significant market share during forecast period. Market Statistics: The report provides market sizing and forecasts across 7 major currencies - USD, EUR, JPY, GBP, AUD, CAD, and CHF; multiple currency support helps organization leaders to make well-informed decisions. In this report, 2018 to 2021 are considered as historical years, 2022 is base year, 2023 is estimated year, and years from 2024 to 2030 are considered as forecast period. FPNV Positioning Matrix: The FPNV Positioning Matrix is essential for assessing the Global Party Supply Rental Market. It provides a comprehensive evaluation of vendors by examining key metrics within Business Strategy and Product Satisfaction, allowing users to make informed decisions based on their specific needs. This advanced analysis then organizes these vendors into four distinct quadrants, which represent varying levels of success: Forefront (F), Pathfinder (P), Niche (N), or Vital(V). Market Share Analysis: The Market Share Analysis offers an insightful look at the current state of vendors in a particular market space. By comparing vendor contributions to overall revenue, customer base, and other key metrics, we can give companies a greater understanding of their performance and what they are up against when competing for market share. The analysis also sheds light on just how competitive any given sector is about accumulation, fragmentation dominance, and amalgamation traits over the base year period studied. The report provides insights on the following pointers: Market Penetration: Provides comprehensive information on the market offered by the key players Market Development: Provides in-depth information about lucrative emerging markets and analyzes penetration across mature segments of the markets Market Diversification: Provides detailed information about new product launches, untapped geographies, recent developments, and investments Market Trends: Provides comprehensive understanding of the Cumulative Impact of COVID-19, the Russia-Ukraine Conflict, and the High Inflation Competitive Assessment & Intelligence: Provides an exhaustive assessment of market shares, strategies, products, certification, regulatory approvals, patent landscape, and manufacturing capabilities of the leading players Product Development & Innovation: Provides intelligent insights on future technologies, R&D activities, and breakthrough product developments The report answers questions such as: What is the market size and forecast of the Global Party Supply Rental Market? What are the inhibiting factors and impact of COVID-19 shaping the Global Party Supply Rental Market during the forecast period? Which are the products\/segments\/applications\/areas to invest in over the forecast period in the Global Party Supply Rental Market? What is the competitive strategic window for opportunities in the Global Party Supply Rental Market? What are the technology trends and regulatory frameworks in the Global Party Supply Rental Market? What is the market share of the leading vendors in the Global Party Supply Rental Market? What modes and strategic moves are considered suitable for entering the Global Party Supply Rental Market? Key Attributes: Report Attribute Details No. of Pages 248 Forecast Period 2022 - 2030 Estimated Market Value (USD) in 2022 $12.38 Billion Forecasted Market Value (USD) by 2030 $37.54 Billion Compound Annual Growth Rate 14.8% Regions Covered Global Key Topics Covered: 1. Preface 2. Research Methodology 3. Executive Summary 4. Market Overview 5. Market Insights 6. Party Supply Rental Market, by Type 7. Party Supply Rental Market, by Product 8. Party Supply Rental Market, by Distribution 9. Americas Party Supply Rental Market 10. Asia-Pacific Party Supply Rental Market 11. Europe, Middle East & Africa Party Supply Rental Market 12. Competitive Landscape 13. Company Usability Profiles 14. Appendix Companies Mentioned A Classic Party Rental ALL OCCASIONS PARTY RENTAL Avalon Tent Baker Party Rentals Big D Party Rentals Bright Event Rentals, LLC Celebration Party Equipment Rentals, Inc. CORT Party Rental Diamond Event & Tent J&S Party Rental KM Party Rental La Pinata Party Rental, Inc Montana Party Rentals ONE STOP PARTY STORE Party Reflections Party Rentals, INC. Pico Party Rents Pleasanton Rentals RentalHosting.com Resilient Furniture Co. Taylor Rental Ventura Rental Center For more information about this report visit https:\/\/www.researchandmarkets.com\/r\/jifkev About ResearchAndMarkets.com ResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends. Attachment","filter_flag":1}
{"title":"Hershey releases environmental, social and governance report highlighting sustainability targets - Confectionery Production","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5jb25mZWN0aW9uZXJ5cHJvZHVjdGlvbi5jb20vbmV3cy80NDI2MC9oZXJzaGV5LXJlbGVhc2VzLWVudmlyb25tZW50YWwtc29jaWFsLWFuZC1nb3Zlcm5hbmNlLXJlcG9ydC1oaWdobGlnaHRpbmctc3VzdGFpbmFiaWxpdHktdGFyZ2V0cy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5jb25mZWN0aW9uZXJ5cHJvZHVjdGlvbi5jb20vbmV3cy80NDI2MC9oZXJzaGV5LXJlbGVhc2VzLWVudmlyb25tZW50YWwtc29jaWFsLWFuZC1nb3Zlcm5hbmNlLXJlcG9ydC1oaWdobGlnaHRpbmctc3VzdGFpbmFiaWxpdHktdGFyZ2V0cy_SAQA?oc=5","id":"CBMikwFodHRwczovL3d3dy5jb25mZWN0aW9uZXJ5cHJvZHVjdGlvbi5jb20vbmV3cy80NDI2MC9oZXJzaGV5LXJlbGVhc2VzLWVudmlyb25tZW50YWwtc29jaWFsLWFuZC1nb3Zlcm5hbmNlLXJlcG9ydC1oaWdobGlnaHRpbmctc3VzdGFpbmFiaWxpdHktdGFyZ2V0cy_SAQA","guidislink":false,"published":"Wed, 31 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=151, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5jb25mZWN0aW9uZXJ5cHJvZHVjdGlvbi5jb20vbmV3cy80NDI2MC9oZXJzaGV5LXJlbGVhc2VzLWVudmlyb25tZW50YWwtc29jaWFsLWFuZC1nb3Zlcm5hbmNlLXJlcG9ydC1oaWdobGlnaHRpbmctc3VzdGFpbmFiaWxpdHktdGFyZ2V0cy_SAQA?oc=5\" target=\"_blank\">Hershey releases environmental, social and governance report highlighting sustainability targets<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Confectionery Production<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Hershey releases environmental, social and governance report highlighting sustainability targets - Confectionery Production","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5jb25mZWN0aW9uZXJ5cHJvZHVjdGlvbi5jb20vbmV3cy80NDI2MC9oZXJzaGV5LXJlbGVhc2VzLWVudmlyb25tZW50YWwtc29jaWFsLWFuZC1nb3Zlcm5hbmNlLXJlcG9ydC1oaWdobGlnaHRpbmctc3VzdGFpbmFiaWxpdHktdGFyZ2V0cy_SAQA?oc=5\" target=\"_blank\">Hershey releases environmental, social and governance report highlighting sustainability targets<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Confectionery Production<\/font>","source.href":"https:\/\/www.confectioneryproduction.com","source.title":"Confectionery Production","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"The Hershey Company has placed delivering on its sustainability goals at the heart of its 2022 Environmental, Social, and Governance (ESG) Report, outlining progress on core business operating issues, writes Neill Barston. As the business revealed at last week’s Sweets & Snacks Expo event in Chicago (see our exclusive video review of the event here), it has continued its focus on delivering a broad portfolio of products across its brands, as well as improving business resilience amid notable market challenges. Speaking to Confectionery Production at the event, the company explained that it had enjoyed a strong performance in the past year and intended to build on its core principles to grow the business sustainably and support employment diversity (see our next edition for more). Notably, the firm’s ESG report highlighted its inaugural double materiality assessment and an update to the company’s key human rights issues – including targeting improving lives of cocoa farming communities at the centre of its supply chain. The company added that it is also focused on reducing its environmental impact and encouraging more diversity within its workforce. “As we continue to act on the most important areas of focus for our business, including responsible sourcing, reducing our carbon footprint, and promoting inclusivity, we are continually reminded that our progress and achievements are made possible by our employees, farmers, partners and other stakeholders who share our commitment to creating a more sustainable and equitable future,” said Michele Buck, CEO, The Hershey Company. “We are grateful for their input and support and look forward to continuing this journey together.” Significantly, by 2030, Hershey’s Cocoa For Good strategy seeks to invest $500 million to positively impact cocoa farming communities. Hershey recently launched a new Income Accelerator in Côte d’Ivoire, a five-year program based on proven poverty reduction strategies that provides cash transfers and investment in Village Savings and Loan Associations to supplement farmer income and combat poverty. Additional cocoa highlights from 2022 include: Furthermore, in 2022, Hershey achieved 77% cocoa sourcing visibility by volume in Côte d’Ivoire and Ghana and is on track to reach 100% sourcing visibility by 2025. As part of Hershey’s commitment to prevent and eliminate child labor, participating farms are covered by Child Labor Monitoring and Remediation Systems (CLMRS). In 2022, 72% of farmers in Ivory Coast and Ghana were covered by CLMRS, on track to reach 100% by 2025. The company added that its commitment to improving farmer livelihoods is grounded in empowering and investing in cocoa communities to foster a more equitable and sustainable cocoa supply chain. This includes supporting initiatives that provide financial literacy and agricultural training to farmers. Additionally, farmers in Ghana can contribute to emissions reductions through programs like the World Bank Carbon Fund and the Nsuoekyir Apimanim’s Community Resource Management Areas (CREMAs) and earn income as a result. Across its global operations and with the dedication of employees – including its passionate group of Energy Champions – the company is reducing its environmental impact with a goal to achieve a 50% absolute reduction in Scope 1 and 2 greenhouse gas (GHG) emissions by 2030 against a 2018 baseline. In 2022, the company’s Scope 1 and 2 emissions data received limited assurance by EY. Additional environment highlights from 2022 include: In addition, Hershey’s $3 million investment in reporting systems provides real-time utility usage data for electricity, natural gas and water at each of its facilities globally, aiming to reduce energy intensity by approximately 10% over the next five years. These systems were installed in U.S. facilities in 2022, with the remainder to be installed in international facilities during 2023. Leveraging biofuel to reduce carbon intensity: Hershey is taking action to limit and, when possible, remove carbon-intensive fuels from its facilities. Most recently, Hershey’s India plant transitioned from using coal to rice husks as biofuel to power production. Enabled by Hershey’s participation in the U.S. EPA’s ENERGY STAR Challenge for Industry and the U.S. Department of Energy’s Better Buildings, Better Plants programme, the company has improved the energy intensity of its manufacturing sites by 6.1% compared to a 2018 baseline. With support from Hershey’s Energy and Water Management Steering Committee, the company improved global water intensity by 6% in 2022 with a 14% improvement in water intensity at international facilities (compared to 2021). The company also invested nearly $1.5 million in high-efficiency equipment to reduce well water usage at our company headquarters in Hershey, PA. In terms of its employee policies, the company has a five-year diversity, equity and inclusion (DEI) framework – the company continues to develop and invest in a pipeline that provides opportunities for all. Most recently, Hershey was named to DiversityInc’s 2023 ‘Top Companies for Diversity’ list – underscoring the company’s ongoing work to create an inclusive environment that fosters innovation and growth. Additional highlights from 2022 include: Furthermore, it has also launched its’Say Hola’ initiative at the company’s Hazleton, Pennsylvania plant, ‘Say Hola’ seamlessly integrated both Spanish and English-speaking employees under one roof, equipped with bilingual trainings, managers and workplace materials. The program improved hiring and retention and reduced recruitment costs. Today, more than 90% of applicants have the desired manufacturing experience, compared to 50% before the programme launch. Moreover, as part of its commitment to promoting diversity, equity and inclusion, veterans are an important part of the company’s workforce, bringing specialised perspectives, experiences and skill sets to the business. In 2023, the company will expand its partnership with three military hiring organisations and aims to increase veteran hiring by 4%. Under the guidance of its Veteran Business Resource Group (employee resource group), Hershey joined the National Veterans Business Development Council and donated to Veterans Outreach of PA, a nonprofit that supports homeless veterans. Related content","filter_flag":1}
{"title":"B.C. government pledges additional $25 million for coastal cleanup - Aldergrove Star","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmFsZGVyZ3JvdmVzdGFyLmNvbS9uZXdzL2ItYy1nb3Zlcm5tZW50LXBsZWRnZXMtYWRkaXRpb25hbC0yNS1taWxsaW9uLWZvci1jb2FzdGFsLWNsZWFudXAtMjI2OTkwMdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmFsZGVyZ3JvdmVzdGFyLmNvbS9uZXdzL2ItYy1nb3Zlcm5tZW50LXBsZWRnZXMtYWRkaXRpb25hbC0yNS1taWxsaW9uLWZvci1jb2FzdGFsLWNsZWFudXAtMjI2OTkwMdIBAA?oc=5","id":"CBMibGh0dHBzOi8vd3d3LmFsZGVyZ3JvdmVzdGFyLmNvbS9uZXdzL2ItYy1nb3Zlcm5tZW50LXBsZWRnZXMtYWRkaXRpb25hbC0yNS1taWxsaW9uLWZvci1jb2FzdGFsLWNsZWFudXAtMjI2OTkwMdIBAA","guidislink":false,"published":"Wed, 31 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=151, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmFsZGVyZ3JvdmVzdGFyLmNvbS9uZXdzL2ItYy1nb3Zlcm5tZW50LXBsZWRnZXMtYWRkaXRpb25hbC0yNS1taWxsaW9uLWZvci1jb2FzdGFsLWNsZWFudXAtMjI2OTkwMdIBAA?oc=5\" target=\"_blank\">B.C. government pledges additional $25 million for coastal cleanup<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Aldergrove Star<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"B.C. government pledges additional $25 million for coastal cleanup - Aldergrove Star","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmFsZGVyZ3JvdmVzdGFyLmNvbS9uZXdzL2ItYy1nb3Zlcm5tZW50LXBsZWRnZXMtYWRkaXRpb25hbC0yNS1taWxsaW9uLWZvci1jb2FzdGFsLWNsZWFudXAtMjI2OTkwMdIBAA?oc=5\" target=\"_blank\">B.C. government pledges additional $25 million for coastal cleanup<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Aldergrove Star<\/font>","source.href":"https:\/\/www.aldergrovestar.com","source.title":"Aldergrove Star","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Fund aims to restore marine environment by removing derelict vessels, cleaning up marine debris The B.C. government will invest an additional $25 million into its Clean Coast, Clean Waters Initiative Fund, for a total of approximately $50 million. The fund aims to restore and protect B.C.’s marine environment by removing derelict vessels and cleaning up marine debris along more than 4,600 kilometres of shoreline, while creating more than 1,700 well-paying jobs, according to a news release by the province. The announcement was made May 30 at Rathtrevor Beach Provincial Park near Parksville. “We are fortunate to live in a community next to the beautiful shorelines and rich biodiversity of the Salish Sea. Thanks to the Clean Coast, Clean Waters initiative, these natural spaces can be sustainably maintained and support a healthy coastal ecotourism economy in B.C.,” said Adam Walker, MLA for Parksville-Qualicum. Marine debris is collected and managed appropriately, with the goal of recycling as much as possible to reduce the amount of material going to landfills. To date, 64 per cent of shoreline materials have been recycled or up-cycled. Recyclable items are sent to the Ocean Legacy Foundation facility in Steveston for processing into new products, such as pellets that can be used to create new plastic materials. “The Clean Coast, Clean Waters initiative has removed over 1,500 tonnes of marine debris to date, including 118 derelict vessels,” said Nathan Cullen, Minister of Water, Land and Resource Stewardship. “Preventing and cleaning up marine pollution is essential to a healthy and productive coast, and is one aspect of our vision for B.C.’s future as we develop a Coastal Marine Strategy in partnership with First Nations.” READ MORE: Residents question RDN housing bylaw update delay The Coastal First Nations-Great Bear Initiative will receive $4 million, bringing its total funding to $7.5 million since 2020. The remaining $21 million will be awarded to successful funding applicants through a merit-based assessment process, administered by PWC Canada. This initiative brings together nine First Nations living on B.C.’s north and central coasts, and Haida Gwaii. They aim to restore and protect ecosystems through sustainable resource management practices, which promote self-sufficiency and improve the quality of life for people in these communities. “These shoreline cleanup projects are not just important for keeping coastal territories clean, they also support the transfer of Indigenous knowledge and practices to a younger generation,” said Christine Smith-Martin, chief executive officer, Coastal First Nations-Great Bear Initiative. “By sharing their success stories, best practices and challenges in marine debris collection and monitoring, First Nations across the North and Central Coast and Haida Gwaii continue to work together as stewards of the land and sea.” Eligible funding applicants for the merit-based process include coastal First Nations and local governments, as well as non-profits and others with expertise in shoreline debris cleanup or removal of derelict vessels. The funding will be distributed in two rounds, one this spring and another planned for early 2024. The first application period has ended. Successful recipients will be notified in June to allow projects to begin this summer. Projects from the first round must be completed, have their data collected and final reports submitted by Feb. 29, 2024. Clean Coast, Clean Waters is part of the CleanBC Plastics Action Plan. Its goal is to reduce plastic waste and pollution. The government is developing B.C.’s first Coastal Marine Strategy to govern and plan for securing vast marine ecosystems and blue economy in the long term. The strategy guides improved stewardship of coastal marine environments, advances reconciliation with First Nations and fosters coastal community resilience. — NEWS Staff, submitted Like us on Facebook and follow us on Twitter.","filter_flag":1}
{"title":"Top 10 Best Smart Home Companies In India In 2023 - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvc21hcnQtaG9tZS1jb21wYW5pZXMtaW4taW5kaWEtaW4tMjAyMy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvc21hcnQtaG9tZS1jb21wYW5pZXMtaW4taW5kaWEtaW4tMjAyMy_SAQA?oc=5","id":"CBMiSWh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvc21hcnQtaG9tZS1jb21wYW5pZXMtaW4taW5kaWEtaW4tMjAyMy_SAQA","guidislink":false,"published":"Wed, 03 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=123, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvc21hcnQtaG9tZS1jb21wYW5pZXMtaW4taW5kaWEtaW4tMjAyMy_SAQA?oc=5\" target=\"_blank\">Top 10 Best Smart Home Companies In India In 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 10 Best Smart Home Companies In India In 2023 - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvc21hcnQtaG9tZS1jb21wYW5pZXMtaW4taW5kaWEtaW4tMjAyMy_SAQA?oc=5\" target=\"_blank\">Top 10 Best Smart Home Companies In India In 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"INTRODUCTION India is home to many smart home companies offering innovative products and services. Smart home solutions in India are becoming increasingly popular due to their convenience, energy savings, and security benefits. Companies like Wipro, Lutron, MiHome, and Larsen & Toubro are leading the market in providing high-quality, reliable intelligent home solutions. Wipro offers a range of Wi-Fi-enabled devices, including switches, lights, fans, air conditioners, and an app for controlling them. Lutron provides lighting control solutions that can customize rooms according to user preferences. MiHome’s product portfolio includes a range of intelligent appliances for security and automation, such as door locks and automated door openers. Larsen & Toubro’s innovative home solutions enable users to monitor energy consumption and remotely adjust settings. All these companies also offer state-of-the-art home automation systems which can be used to automate everyday tasks and make life easier. With the increasing demand for innovative home solutions in India, more companies are entering the market, bringing innovative products and services. IMPORTANCE Innovative home companies in India will be significant in 2023 as the country continues to become more technologically advanced. The need for intelligent home automation solutions is proliferating, and many Indian companies are at the forefront of this revolution. Innovative home technology can help households save energy, reduce their carbon footprint, and make life easier. In 2023, more Indian households will have access to the latest innovative home technology, allowing them to enjoy a range of features and services such as automated lighting, temperature control, security systems, and voice-activated assistants. With the rise of the Internet of Things (IoT), innovative home companies in India have the potential to offer even more innovative and sophisticated solutions that could revolutionize the way people live. Using machine learning and artificial intelligence, these companies could create products that anticipate user behaviour and automate specific tasks. This will allow users to save time and money and improve the quality of life for many Indians. Furthermore, the current pandemic has led to an increased demand for remote working solutions and video conferencing applications; this means that innovative home companies in India have an opportunity to provide reliable and secure solutions that can help increase productivity. In conclusion, with the increasing demand for innovative home technology in India, smart home companies in 2023 will be of great importance to many households. Here are the top 10 best smart home companies in India in 2023 Wipro Smart Home Solutions – Wipro Smart Home Solutions is a leading provider of cutting-edge home automation solutions. They provide a wide range of solutions, from basic security systems to more advanced solutions such as proactive energy management, home health monitoring and automated climate control. Wipro’s Smart Home Solutions utilizes the latest technologies to provide smart home solutions that are secure, reliable and easy to use. Their products are designed to reduce energy consumption, provide added safety and comfort and even help improve the overall quality of life. Their portfolio of products includes digital door locks, motion sensors, alarm systems, thermostats, surveillance cameras, video doorbells, lighting control systems and access control systems. Wipro’s Smart Home Solutions also include an app-based remote control system that allows users to control their home appliances through voice commands or through the user’s smartphone. This helps users stay connected with their homes even when they are away. Additionally, Wipro also offers energy management solutions for residential customers. These solutions include energy audits, real-time energy tracking, and energy optimization strategies. These solutions help to reduce electricity bills and promote energy efficiency. Furthermore, Wipro also provides invaluable services in terms of customer support and after-sales service. The company has a team of experienced technicians who can be contacted anytime to provide on-site assistance. Wipro also offers a 24\/7 helpline to address any queries or concerns regarding their products. Overall, Wipro Smart Home Solutions is a reliable and efficient provider of cutting-edge home automation solutions. They offer secure and easy-to-use solutions that make life easier and help reduce energy consumption. With their excellent customer service and after-sales support, Wipro ensures that their customers always get the best experience. Johnson Controls India – Johnson Controls India is a leading provider of integrated building solutions, energy and controls, fire protection, safety and security systems. The company has been serving the Indian market since 1995. Johnson Controls India designs, installs and maintains a wide range of systems and services for commercial, industrial and residential buildings. Their services include HVAC, lighting and electrical systems, security systems, fire alarm systems, emergency response systems, and energy management systems. They also provide water heating systems, coolers and chillers, air purification systems, air curtains, and air ducting systems. Their expertise includes designing, building and maintaining efficient energy systems and providing accurate and reliable control systems. They use advanced technologies to ensure safe and secure operations of the systems they install and maintain. They have an expert team of engineers and technicians who are always available to provide technical advice as well as after-sales support. The company has received numerous awards and recognitions for its commitment to quality, innovation and customer satisfaction. These include the 2012 International Quality Crown Award, the 2012 Excellence in Quality Award, and the 2013 National Energy Management Award. Johnson Controls India’s commitment to sustainability has earned them Gold Level certification from the Indian Green Building Council (IGBC). They believe in creating long-term benefits for their clients, society and environment and strive to improve their products and services constantly. The company is committed to providing customers with innovative and sustainable solutions that meet their needs. They are committed to providing a high level of service and customer satisfaction and to continuously improving their products and services. Johnson Controls India also works with local partners in order to better serve their customers in India. Honeywell Automation India – Honeywell Automation India Ltd (HAIL) is a subsidiary of Honeywell International Inc. based in Gurgaon, India. It is involved in designing, manufacturing and supplying a wide range of integrated automation products, systems, and solutions for businesses across industries. HAIL focuses extensively on building efficient automation processes and systems to improve production efficiency and quality. The company offers a variety of automation solutions, such as process control, distributed control systems, safety interlocks, fire and gas detectors, field instruments and more. HAIL also provides services like consulting, engineering and project management to ensure clients get the best out of the automation systems they have invested in. In addition to automation products, HAIL also offers IT Solutions like Machine Learning and Artificial Intelligence, Industrial Internet of Things, Big Data Analytics, and Cloud Computing. These technologies help in managing, monitoring and controlling large-scale operations. HAIL has established strategic partnerships with leading Indian and international companies to ensure that their clients get access to the latest technology. HAIL currently employs more than 2000 people and has offices in more than 30 countries worldwide. The company’s vision is to be the leader in industrial automation, delivering innovative and reliable automation solutions to customers all over the world. They are dedicated to providing cost-effective and efficient automation solutions that make life easier for businesses across different sectors. L&T Technology Services – L&T Technology Services (LTTS) is an engineering services and solutions provider with a global footprint. Founded in 1998, the company has more than 20,000 employees across 30 countries. With over 20 years of industry experience, LTTS provides innovative digital transformation services to leading organizations across Aerospace & Defense, Automotive, Industrial & Medical Devices, Railways & Metros, Hi-tech, Renewable Energy, and Consumer Products & Retail. LTTS helps its customers adopt a holistic approach to technology-enabled strategies, offering a full suite of IT, engineering and product development services from concept to production. The services are aimed at increasing agility, reducing costs and helping customers produce cutting-edge products faster. These cover areas such as 3D printing, cyber security, embedded systems, analytics, augmented reality, artificial intelligence, machine learning, virtual reality, robotics, mechatronics and automation. In addition to its traditional engineering services, LTTS also provides digitalization services, helping clients move from their existing processes to more modern, automated ones. This includes DevOps, cloud computing, IT modernization, data science and analytics, mobility, Internet of Things (IoT), and intelligent system integration. The company’s research initiatives focus on improving customer experiences by integrating emerging technologies. LTTS’ Innovation Centres enable innovation through co-creation, providing a platform for collaboration with customers, partners and the wider ecosystem. Through its commitment to quality, safety and environmental goals, LTTS helps its clients develop products and services that are sustainable, safe, and meet global standards. Highly efficient project execution capabilities have enabled the company to garner recognition for its achievements in engineering excellence. Schneider Electric India – Schneider Electric India is a subsidiary of Schneider Electric, a French multinational corporation that specializes in energy management and automation solutions. Founded in 1997, Schneider Electric India has become one of the most respected names in the power, automation and digital industries in India. The company provides products, services and solutions for industrial, commercial and residential applications, including intelligent building systems, secure data centres, efficient lighting, renewable energy and more. Schneider Electric India also offers differentiated products and services through its two business segments: Schneider Electric India Global and Schneider Electric India Services. With over 2000 employees, Schneider Electric India has become a leader in the field of energy management, both in India and abroad. Its primary focus is to provide energy efficiency solutions that reduce cost, increase productivity and improve safety. Its offering includes integrated solutions such as UPS, switchgear, transformers, motors, automation systems and IT solutions. In addition, the company provides services such as installation and commissioning, monitoring and maintenance, asset management, and training and consulting. Schneider Electric India is committed to sustainable development, and it has implemented several initiatives to support renewable energy, water conservation and responsible resource management. The company works with trusted partners to develop innovative solutions that integrate hardware, software and services. This helps customers reduce their environmental impact while delivering a high level of performance and reliability. Schneider Electric India also supports sustainable innovation by investing in research and development of new technologies. Philips India – Philips India is a leading company in the Indian healthcare sector. It is a subsidiary of the global healthcare giant Royal Philips. The company has been active in the Indian market since 1924 and currently operates in over 100 cities across the country. Philips India offers a wide range of products and services related to health, beauty and lifestyle. Its offerings include medical devices, lighting solutions, consumer electronics, personal care, home appliances and more. The company’s mission is to provide affordable and accessible healthcare solutions to all Indians. To achieve this goal, it has developed products that are tailored to meet the needs of the Indian population. Philips India also provides training and technical support to ensure the quality of its products and services. Philips India has also partnered with several hospitals and other healthcare service providers across the country. This partnership helps in providing quality healthcare to people from all walks of life. Furthermore, Philips India also has research and development centres to create innovative technology and products for the Indian market. In terms of financials, Philips India has reported healthy growth in both revenue and profits in recent years. The company is well-positioned to gain from the growing demand for medical equipment and digital health solutions in India. Philips India also continues to invest in new technologies and products to drive innovation. Tata Power Solar Systems – Tata Power Solar Systems Company is a leading player in the Indian solar energy sector. It is part of the Tata Group, one of India’s oldest and largest conglomerates. The company was established in 1989 and has over three decades of experience in the field. With its headquarter in Mumbai, the company has operations spread across India as well as in many countries around the world. Tata Power Solar Systems Company works with both commercial and residential customers to meet their energy needs. Its services include off-grid and grid-connected solar solutions, energy storage, rooftop solar installation, and energy management services. The company has an extensive portfolio of products, including solar panels, inverters, batteries, water heaters, solar pumps, and solar streetlights. It also provides turnkey solar solutions for various applications, including agricultural, industrial, and commercial. Tata Power Solar Systems Company has a dedicated team of experts who assist clients with project planning, design, engineering, procurement, construction, commissioning, and maintenance. They also ensure that all projects are completed in accordance with the highest standards of safety and quality. The company is certified by several organizations, such as ISO 9001, ISO 14001, OHSAS 18001, IEC 61215 and IEC 61730 for photovoltaic systems, RSPM certification for Pollution Control Board, and CE Certification for solar PV systems components. Tata Power Solar Systems Company strives to be an active participant in the global effort to reduce emissions and conserve energy. Through its commitment to renewable energy and environmental protection, the company contributes to creating a sustainable future. Siemens India – Siemens India is a leading engineering and technology company in India. Founded in 1922, Siemens India is the Indian arm of the global Siemens Group. With its headquarters in Mumbai, Siemens India has over 160 offices across the country with more than 23,000 employees. In addition to its core businesses of energy, industry, and healthcare, Siemens India is actively involved in innovation, digitalization, and smart infrastructure solutions. Siemens India also provides advanced manufacturing technologies, services, and solutions to boost productivity and efficiency. Furthermore, Siemens India provides innovative and sustainable solutions related to cities, buildings, and transportation, as well as Smart Infrastructure Solutions for the energy sector. Siemens India is committed to developing innovative products and solutions that are reliable and cost-effective for its customers. The company has also achieved several milestones in terms of technological breakthroughs, such as the development of India’s first nuclear power plant. Siemens India has also played an important role in greening India and helping it attain carbon neutrality. It continues to invest in R&D and research activities in order to create cutting-edge products and solutions. Siemens India has won numerous awards for its sustainability initiatives and for its commitment to creating an inclusive workplace for all. Syska Smart Homes – Syska Smart Homes is a technology company that specializes in creating smart home solutions. Founded in 2023, it is one of the leading companies providing intelligent automation and connected lifestyle products to customers across India. Its mission is to provide an intelligent living environment for its customers through world-class technology and innovative design. The company provides a wide range of products, such as smart lighting, security systems, home appliances, smart switches, and more. The products are designed to be user-friendly and feature modern technology, such as Wi-Fi and Bluetooth connectivity, voice control, and cloud support. It is constantly innovating to create new products that make it easier for people to lead smarter and more secure lives. Syska Smart Homes also have a mobile app that allows users to control their devices and access other features remotely. The app can be used to automate tasks, set schedules, manage energy use, and receive alerts when something is out of order. Additionally, it integrates with popular third-party services such as Google Assistant, Alexa, and IFTTT, so users can easily connect to the internet and control their devices from anywhere. To ensure that its products are safe and secure, Syska Smart Homes uses advanced encryption technology, such as AES 128-bit encryption. It also follows international standards such as ISO\/IEC 27001 and PCI DSS, which ensures the highest level of data protection and system security. Overall, Syska Smart Homes is dedicated to making people’s lives easier and more comfortable with its innovative products. With its cutting-edge smart home solutions, it has become one of the leading providers of home automation products in India. Havells India – Havells India Company is one of the largest electrical equipment companies in India. Founded in 1958, it is a part of the Havells Group and has a presence in more than 50 countries across the globe. It manufactures a wide range of products, including fans, lighting, switchgear, wires and cables, modular switches, home appliances, electric water heaters, CFL lamps, air conditioners and many more. Havells India is driven by innovation, quality, and performance. It has a state-of-the-art manufacturing facility in Noida, Uttar Pradesh and many regional offices throughout the country. Their products are designed to meet the needs of customers who value efficiency, convenience, economy, and safety. The company also provides financial assistance to its distributors so that they can grow their business. Havells India offers an extensive range of products that can meet the varying needs of its customers. Its innovative product range includes energy-efficient lighting solutions, industrial switchgear, pumps and motors, and premium ceiling fans. It also offers smart home automation systems and solar power solutions. In addition, Havells India provides an extensive after-sales support network to ensure customer satisfaction. Havells India is committed to providing sustainable and affordable energy solutions for the entire nation. It follows stringent quality processes throughout the manufacturing process and ensures that all products meet international quality standards. With its commitment to customer service, Havells India has become a trusted partner for many leading corporates, institutions, and households. CONCLUSION In 2023, India is one of the world’s leading countries in terms of smart home technology. Many companies are offering a wide range of smart home solutions, from security systems to energy-saving devices. Smart home products are mainly used for convenience, convenience, and energy savings. Companies such as MyGate, D-Link, Honeywell, and HomeLane have become popular in India. They offer products such as door locks, cameras, monitoring systems, and automated lights and air conditioners. These products help make homes more efficient, secure, and comfortable while saving time and money. As the demand for smart home technology increases, more and more companies are entering the market and providing innovative solutions.","filter_flag":1}
