{"title":"Beyond Force: A Realist Pathway Through the Green Transition - Information Technology and Innovation Foundation","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vaXRpZi5vcmcvcHVibGljYXRpb25zLzIwMjMvMDcvMTAvYmV5b25kLWZvcmNlLWEtcmVhbGlzdC1wYXRod2F5LXRocm91Z2gtdGhlLWdyZWVuLXRyYW5zaXRpb24v0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vaXRpZi5vcmcvcHVibGljYXRpb25zLzIwMjMvMDcvMTAvYmV5b25kLWZvcmNlLWEtcmVhbGlzdC1wYXRod2F5LXRocm91Z2gtdGhlLWdyZWVuLXRyYW5zaXRpb24v0gEA?oc=5","id":"CBMiZWh0dHBzOi8vaXRpZi5vcmcvcHVibGljYXRpb25zLzIwMjMvMDcvMTAvYmV5b25kLWZvcmNlLWEtcmVhbGlzdC1wYXRod2F5LXRocm91Z2gtdGhlLWdyZWVuLXRyYW5zaXRpb24v0gEA","guidislink":false,"published":"Mon, 10 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=191, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vaXRpZi5vcmcvcHVibGljYXRpb25zLzIwMjMvMDcvMTAvYmV5b25kLWZvcmNlLWEtcmVhbGlzdC1wYXRod2F5LXRocm91Z2gtdGhlLWdyZWVuLXRyYW5zaXRpb24v0gEA?oc=5\" target=\"_blank\">Beyond Force: A Realist Pathway Through the Green Transition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Information Technology and Innovation Foundation<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Beyond Force: A Realist Pathway Through the Green Transition - Information Technology and Innovation Foundation","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vaXRpZi5vcmcvcHVibGljYXRpb25zLzIwMjMvMDcvMTAvYmV5b25kLWZvcmNlLWEtcmVhbGlzdC1wYXRod2F5LXRocm91Z2gtdGhlLWdyZWVuLXRyYW5zaXRpb24v0gEA?oc=5\" target=\"_blank\">Beyond Force: A Realist Pathway Through the Green Transition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Information Technology and Innovation Foundation<\/font>","source.href":"https:\/\/itif.org","source.title":"Information Technology and Innovation Foundation","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Contents Key Takeaways. 1 Introduction. 2 Schools of Force. 7 Once P3 Is Achieved, Markets Are the Key Lever for Decarbonization. 10 Climate Change Is Global, So the Green Transition Must Be Global 12 We Have All the Tech We Need—Perhaps, But Not at P3. 15 Forcing Policies That Ignore P3 Will Fail 19 Regulation. 19 Subsidies. 22 Taxes. 24 Exhortation. 24 Innovation to Get to P3. 29 The Power of the P3 Lens. 32 Conclusion. 38 Endnotes. 41 The climate crisis has rightly galvanized policy and policymakers. Yet, most policy is based on the core premise that governments must force the green transition within their respective borders, because without that, the switch to clean energy will not happen. By “force,” we mean a set of policies that seek to impose solutions that absent force would not be broadly adopted. Thus, we have massive subsidies of clean energy; taxes and proposed bans on dirty energy; regulatory mandates for clean energy; and exhortations on companies and consumers to “go green,” including calls for “degrowth.” If global warming were a set of national problems, especially where the main problems lie in rich Western countries, perhaps this forcing strategy could possibly work, at least in some sectors and some regions. Some countries might be willing to bear significant costs to transition away from fossil fuels—although even in rich countries there is widespread opposition to policy-induced cost increases.[1] Even in the United States, there is no serious appetite to adopt more expensive greener alternatives. But climate change is not a national issue; global warming is global, and as such requires global solutions—specifically, solutions that work in all nations, especially low-income countries where emissions continue to grow rapidly with an expanding population, economic growth, urbanization, and electrification. So effective solutions can only be those that all consumers, corporations, and nations can adopt with little or no extra cost or reduced performance. The current strategy of forcing more expensive and often less functional clean energy solutions onto users cannot, therefore, scale globally and is not even likely to scale in wealthy countries that are most fervently committed to addressing climate change. This is not pessimism; this is realism. It is time then for a fundamentally new strategy: We must use government policy not to force change but to enable change through the widespread development of technologies that meet the price and the performance levels of dirty energy (“price\/performance parity,” or P3). (See box 1.) That central strategy should be reflected in all climate policies. Without that, the world will not transition to clean fuels, no matter how many severe weather events we get, how many roads activists block, or how many speeches climate activists give. But once technology does get to P3, then market forces, coupled with the willingness of most organizations and individuals to want to help address climate change, will do almost all the work. It is time for a fundamentally new strategy: We must use government policy not to force change but to enable change through the widespread development of technologies that meet the price and the performance levels of dirty energy. Other policies, such as regulations, taxes, or selected subsidies, can still help (for specific purposes, as we will see ahead), although the odds are against the further introduction of large subsidies even in the United States. Most rich nations face deep fiscal holes because of the expanding retiree population, past expansion of debt, and slow productivity growth. As such, the odds of a fiscal surplus that could fund expensive green subsidies are minimal. And there is opposition in most countries to higher taxes (e.g., carbon taxes), even if pitched as revenue neutral. Moreover, reliance on these mechanisms is based on a misunderstanding. The implicit question behind almost all countries’ climate policy is simple: “Will this policy reduce emissions nationally?” Unfortunately, that’s the wrong question. Instead, we need to ask, “Does this policy help drive the supported technology getting to P3?” Because only P3 enables worldwide adoption of clean energy and, after all, it’s global warming that matters, not American warming, British warming, or Korean warming. The dominant guiding narrative of climate policy is based on the false presumption that all countries will take sufficient action to dramatically reduce emissions, even with the higher costs involved. Box 1: What Is Price\/Performance Parity (P3)? P3 means that for a given level of performance, a green technology has reached price parity with an existing dirty technology without subsidies or taxes on the dirty technologies. So, for example, P3 for electric vehicles (EVs) will be achieved when the lifecycle costs of EVs are the same as equivalent internal combustion engine (ICE) vehicles, and have approximately the same performance in terms of reliability, refueling, range, acceleration, cargo capacity, etc. “Performance” captures the wide range of product characteristics beyond price—availability, quality, terms and conditions of sale, delivery, reliability, and much more—from the perspective of the end user. For example, if solar energy could be produced at the same cost as coal-fired power, it would still not be at P3 if the electric grid became unreliable or if it could only deliver power for eight hours a day. Factors such as availability and reliability play heavily in purchasing decisions, so they must all be part of the parity equation. P3 therefore requires that green technologies must be close to price competitive on an apples-to-apples basis; price and performance are both essential parts of the equation. Let us be clear. This does not mean we are market absolutists, or that we believe that the market will solve the climate crisis on its own. The energy market is profoundly influenced by numerous factors beyond the simple cost to supply energy and the price at which customers will buy it. Energy prices are the net result of all those variables, which include a vast pile of existing regulations, subsidies, policies, and preferences. What we do believe is that the net result is politically sticky. It is hard to shift, especially in countries where protests are possible and potentially powerful. We argue that it is very hard to move the price of dirty energy upward in most countries, and hence that solutions which require upward movement in energy prices won’t be successful. This is reality. It’s not necessarily the world we want, but it’s the one we’ve got. The current policy environment has been driven partly—perhaps largely—by the urgency of environmentalists, who have successfully pitched a narrative of “emergency” and “climate crisis.” Every extreme weather event is now interpreted as further evidence that the climate ecosystem is on the brink. And in that context, activist demands are about urgency (“Do it now!”) and scale (“It’s not enough!”). These pressures are useful counterweights to a status quo still dominated by fossil fuels, a status quo that, after all, has enormous inertia. But this urgency has some downsides. It has led to a “kitchen sink problem” in which we try to do everything everywhere all at once, without considering trade-offs, cost, or even effectiveness. It has encouraged us to believe that the climate crisis is so catastrophic that we must simply force change as quickly and widely as possible, even if doing so would place completely unachievable burdens on our economies and our societies and, most importantly, a dramatically reduced focus on getting to P3. The dominant guiding narrative of climate policy is based on the false presumption that all countries will take sufficient action to dramatically reduce emissions, even with the higher costs involved. In contrast, we propose a realist approach to the climate crisis, defined by five key pillars that, together, will help us encourage prioritization and accelerate the green transition: 1. All solutions ultimately must be global. Mandating the sale of EVs in the United States, even if successful, is not a global solution. Large subsidies (e.g., the $7,500 available under the Inflation Reduction Act) are not feasible in poorer countries, and other rich-country solutions that add significant cost won’t work either. So, the West should focus primarily not on implementing expensive solutions at home but rather on developing technology and solutions that will work in the entire world—especially the low-income world. That means solutions that will reach price parity with dirty energy, without reliance on forcing mechanisms such as subsidies or carbon taxes. 2. Recognize the growth imperative. When all countries—especially low-income countries—are forced to choose between green and growth, they will (understandably) choose growth, productivity, and lower costs. It’s no surprise that India just sought bids for 121 new coal mines (see box 4). To be effective, any climate solution must ensure that the choice is not between green and growth, but between clean growth and dirty growth. 3. Price and performance both matter to P3. Wind and solar are certainly price competitive in certain regions with fossil energy—but only when the wind is blowing, or the sun is shining. Parity would require that renewables meet the price and reliability of fossil fuels, and not just for eight hours a day. All markets specify quality as well as price; for clean energy, that means matching the performance of fossil fuels, not just the price. 4. P3 must be measured at the point of delivery, not the point of production. Despite the claims of many advocates that we have all the technologies needed to solve global warming, few current solutions are cost competitive without subsidies at the point of delivery. (See box 5.) The costs of wind and solar at the point of production have declined very sharply over the past two decades, and they are now P3 competitive in certain locations, for some of the time. But it’s the cost at the point of end use that matters, not the cost at the point of generation. Against that metric, for most end users much of the time, even wind and solar are still not at P3. 5. Differentiate technology pathways using P3. The P3 lens helps us distinguish between technologies and hence define appropriate government policies. While some technologies are on the path to P3 and may need government help to move down the cost curve (e.g., subsidies for adoption), in other cases, a particular technology may never achieve P3 no matter the scale of production. In these cases, meeting the P3 market test requires substantial and ongoing innovation—often transformative innovation. Many key decarbonizing technologies are currently far from P3, and scale economies and incremental improvement from government-supported demand expansion won’t sufficiently close those gaps, so adoption will lag and net-zero targets will be missed (see figure 1). The four curves in figure 1 illustrate A) the existing price\/performance for a fossil fuel technology; B) the pathway for a green technology that is on course to achieve P3 as demand increases; C) a pathway for a green technology that will not achieve P3 on the current technology pathway; and D) technologies for which there is no conceivable pathway to P3. Current policy often fails to differentiate between B and C or even D technologies. So enormous efforts are made to grow demand for C and D technologies, but since neither will ever reach P3, neither will be adopted globally. Instead, for solutions to certain emissions challenges that are essentially pipedreams, policymakers should simply focus on mitigation, such as offsetting carbon capture. For the many technologies on curve C, the challenge is to shift the curve down entirely by developing new technology solutions; for example, batteries based on chemistries other than lithium-ion. The current pathway for curve C will never intersect with P3, leaving only expensive, endless, and ultimately fruitless efforts to fill the gap with subsidies or regulations. Instead, policy should focus on innovation, seeking to generate and develop alternative technologies that can shift the cost curve downward until it achieves P3. For those technologies that are on track to reach P3 (B technologies), policy should focus on accelerating movement down the existing cost curve until we reach P3. These policies are detailed in the section titled “The Power of the P3 Lens.” Innovation is central and should be targeted at achieving P3 for the most important technologies.[2] Because they see the climate crisis as imminent and overwhelming, many advocates refuse to accept the obvious reality that much more innovation is needed for an effective green transition. Yet, that is indeed the reality. In part, this means encouraging incremental improvements—often linked to increased scale of production—to move curve B technologies down the cost curve toward P3. In sectors with technologies currently on curve C, which will never reach P3, more radical innovation is needed—not just movement along the existing cost curve but a shift of the entire curve downward so that it can eventually reach P3. Both kinds of innovation will be critically important, but government policy should be focused particularly on the transformative technologies needed to shift cost curves, where the private sector likely won’t invest enough because risks and costs are higher. Once P3 is achieved, markets will be the primary lever. At that point, markets can and will do most of the heavy lifting. The scale of the climate crisis is such that only markets are big enough to drive the change that’s needed. The International Energy Agency (IEA) has estimated that the necessary global investments will be $84 trillion by 2050, while the McKinsey Global Institute put the cost at $275 trillion.[3] But governments collectively cannot and will not provide that level of funding or anything like it. Only the spending and investment of market actors making economically self-interested decisions has the leverage and scale to deploy all the products and technologies needed. This does not mean, as some free-market conservatives would believe, that markets alone can manage the green transition. Like almost all technology transitions since the Industrial Revolution, it will take concerted effort from both governments and the private sector focused and organized around getting to P3. And that should be the lodestar for climate policy in all nations. What we propose, therefore, is fundamentally a “realist” approach to climate change, which must become the bedrock on which effective policies should be built. Using the P3 framework, the overriding imperative must be to create cost-competitive solutions that work globally and will be voluntarily adopted via the market. And for that, we must find ways to get to P3 for climate-critical technologies. This realist approach may just seem like common sense, but the P3 lens is important precisely because the climate debate is largely dominated by other voices. The remainder of this paper explains why a force approach will fail and then presents a realist approach to climate policy—one that will simultaneously address the urgency of climate change AND effectively reflect the political and economic realities of the 2020s and beyond. Finally, the report provides pathways through the policy space and through the technical, financial, and political constraints that bind the available options for climate policy in the United States and elsewhere. Recognizing these economic, political, and social realities does not mean we must surrender on climate change. Far from it. It is current efforts to force less than P3 solutions on the world that are unrealistic. There are at least four major schools or groupings in the force approach: radical optimists, nation-centric climate advocates, Cassandras, and hair-shirters. In many ways, they offer different perspectives, but their messages all fundamentally lean in the same direction: We must act now in ways or at speeds that without force we would not. Force-firsters (which includes virtually all climate advocates) believe that force is the only way to solve climate change, focused in particular on forcing policies within their own nation. President Biden, for example, talks about decarbonizing the U.S. electric grid and vehicle fleet, largely through force (regulations and subsidies), but this kind of forcing can only work if most of the world adopts it, which is very unlikely, no matter how much pressure is exerted. As noted in the next section, because climate advocates see the crisis as so severe and action is needed immediately, almost all their recommendations rely on getting individuals, organizations, and governments to take actions they would, in the absence of climate change, not normally take. This includes mandating solutions, subsidizing solutions, taxing and otherwise limiting dirty energy, and pressuring organizations, individuals, and other governments to take action. There are, of course, differences among force-first proponents. Radical optimists (e.g., Stanford professor Mark Jacobson) offer no guidance in making difficult choices because they wrongly deny choices are necessary.[4] For him and many climate activists today, most if not all technologies are on curve B already, with wind and solar, for example, being perceived as cheaper than dirty energy. As we show in box 5, this is false. A related argument is that the clean transition will be net positive economically, because it creates jobs and spurs investment. (See box 6.) But this is only true if we get to P3 and beyond. In the West, the nation-centric advocates largely driving climate policy in their own nation ignore the core observation that climate is truly a global issue. Focusing on policy in rich countries misses the key point: While forcing the green transition through subsidies and regulations will not work in most rich countries (for reasons laid out ahead), those mechanisms will definitely not work in low-income nations, where the lion’s share of the world’s population lives and most of the growth in energy consumption will come from. Cassandras warn that, absent even more force, catastrophe awaits. Case in point, Simon Sharpe’s book Five Times Faster: Rethinking the Science, Economics, and Diplomacy of Climate Change. A better title for the book might have been Five Times More Force, as Sharpe argues that we must decarbonize at a rate five times faster than today, and the way to do that is to motivate governments even more by 1) developing risk models that significantly increase damage estimates; 2) having climate cost-benefit models that significantly ratchet up the cost and benefits; and 3) encouraging countries to cooperate on specific climate projects. Given that climate warnings are now an almost daily part of many people’s lives, it’s not clear that more alarming models will get much more done. These warnings could easily backfire as well, leading people to tune out. Because climate advocates see the crisis as so severe and that action is needed immediately, almost all their recommendations rely on getting individuals, organizations, and governments to take actions they would, in the absence of pressure, not take. Finally, hairshirt environmentalists believe that people must be goaded or shamed into giving up much that they now enjoy—that people can be persuaded to adopt a radically reduced carbon footprint, walking to work, no longer flying, becoming vegans, and “living simply.” The United Nations tells people that they can solve the climate crisis through their individual actions, such as keeping their house colder in the winter, giving up their car, eating less meat, buying fewer clothes.[5] But exhortation on climate hasn’t worked in the past and it won’t work in the future: It hasn’t worked in rich countries, and it certainly won’t in poor ones. It is especially damning that the United Nations, an organization that should reflect, above all, the interests of low-income nations, is arguing that low-income countries should suppress their aspirations and aim instead to live at levels poor people in developed nations would reject out of hand. Box 2: Political Failures of Force Taxes on dirty energy are one tool for forcing change. Economists have argued that carbon taxes are the best way to solve the climate crisis, using price mechanisms to drive shifts in demand. However, it appears that noneconomists are not so keen. Lessons from both the United States and France demonstrate how sensitive energy prices are, and why politicians have become so reluctant to impose carbon taxes on energy. Failure to Pass Cap-and-Trade Carbon Pricing in the United States Numerous U.S. attempts to implement a carbon price have failed. The last concerted effort was the 2009 American Clean Energy and Security Act, widely known as the Waxman-Markey cap-and-trade legislation. It passed the House of Representatives by just seven votes (despite the 79-seat Democratic majority) but was not brought up for a vote in the U.S. Senate and quietly died at the close of the legislative session. Major opposition came from large energy companies, labor and consumer organizations, and environmental groups. Energy providers opposed the cost increase on most fossil fuels and the complicated structure of allowances, credits, phase-ins, carbon banking, etc.[6] Environmental groups such as Greenpeace opposed free allowance allocation—more than 85 percent of proposed allocation through 2026—as giveaways to special interests. Large trade organizations such as the American Petroleum Institute, the American Gas Association, the U.S. Chamber of Commerce, and the National Association of Manufacturers, alongside some national labor groups such as the United Mine Workers Association, also opposed the legislation. Legislative timing—during the Great Recession—further weakened support. Waxman-Markey offers some key lessons, pointing to the failure of force mechanisms like carbon pricing. To attract sufficient support, policies that raise the price of fossil energy must include significant carve-outs, concessions, offsets, and other giveaways to special interests. These “outs” reduce the policy’s effectiveness, and while they are designed to increase industry and public support, they also expand opposition from some environmental groups. Today, the latter largely oppose price-based mechanisms in favor of regulations and prohibitions. The failure of Waxman-Markey demonstrates that an explicit price on carbon is unlikely to be imposed in the foreseeable future in the United States, and price-based policies continue to be unpopular among a wide range of political constituencies. Of course polling is far from conclusive on this, but n one reputable recent poll, less than 38 percent of Americans were willing to pay just $1 a month as a carbon fee, down 14 percentage points from 2021. Only 21 percent said they would be willing to spend $100 a month.[7] The Gilets Jaunes Protests The Gilets Jaunes, or Yellow Vest Protests, a series of civil protests and unrest in France that involved tens of thousands of people on a weekly basis, started in November 2018. They kicked off after the national government announced a modest fuel price increase as part of its climate strategy (about 8 Euro cents per liter or about a 5 percent increase). This “green tax” explicitly aimed to increase the price of gasoline and diesel fuel, and to encourage drivers to conserve, carpool, walk, bike, or take public transport to cut emissions.[8] However, the fuel price hike disproportionately affected rural and outer-urban residents who relied more heavily on personal vehicles (given fewer public transportation options). Many also felt that the national government—based in the urban environment of Paris—did not understand the personal financial difficulties imposed by increased fuel taxes. The protests were a national phenomenon and lasted for more than a year. Protestors also challenged other national economic policies such as the low minimum wage, recission of the national wealth tax, and the ongoing cost of living crisis. National support for the Yellow Vests (named for the obligatory yellow safety vests all French drivers must keep in the boot of their cars) was high, polling at around 70 percent throughout the protests. As a result, French President Emmanuel Macron was quite quickly forced to rescind the proposed fuel tax increase.[9] The Yellow Vests Protests further highlight the weaknesses of mechanisms such as carbon taxes that impose additional costs on consumers. Such price increases were enormously unpopular and quickly generated overwhelming pushback across the political spectrum, even in an affluent county such as France. The scale of the change needed to address climate change is unprecedented, and it requires extraordinary acceleration to meet the demands of a warming world. Typically, it takes decades for foundational technologies to gain even a foothold in the market, much less dominance. True, technology shifts have become faster in recent decades, but the climate transition is still in a class by itself (see Box 3). IEA’s 2021 net-zero road map calls for extraordinary and sustained investment in clean energy (~$84 trillion by 2050).[10] That is a formidable challenge, but it is just the start of issues related to scale. Rapidly rising demand for scarce minerals spiked the price of lithium by more than 200 percent in 2022. Many critical inputs have only a few sources and will be very hard to scale up. Even land for big solar and wind farms is becoming scarcer and more distant from population centers. Building enough production is itself a challenge. The IEA pathway requires enormous additions of wind and solar annually—far more than 2022 levels—as well as massive increases in the production and use of hydrogen, plus necessary investments in supply chains and infrastructure. Critical enabling technologies will be needed. Wind and solar, for example, require long-term storage if they are to replace 24\/7 reliable fossil fuels. Existing storage technologies, including batteries, are too expensive and too difficult to scale. Similarly, fossil fuels can be included in the energy mix if carbon capture, storage utilization and storage (CCUS) become readily available at costs that don’t move P3 out of reach. Currently, the cheapest blue hydrogen (which uses carbon capture) costs about three times as much as hydrogen made without it.[11] And while the global retreat from nuclear has slowed and small modular nuclear reactors may be transformative, a massive scale-up of nuclear seems a long way off. For the green transition to be successful, it must rely on markets—and for markets to work, any new competitor against existing products or services must provide approximately the same performance for about the same price if it is to be successful. These clean production technologies must then reach end users. Electrification is the primary pathway for a decarbonizing world, but the current electric grid is creaking at the seams. Bloomberg New Energy Finance claims that $4.1 trillion in investment is needed to maintain existing electrical infrastructure, and $17.4 trillion more will be required to meet new demand.[12] That includes 80 million kilometers of electric grid expansion globally, doubling the existing global grid. Hydrogen transportation infrastructure is largely absent at the scale needed, while the introduction of CCUS at scale means deploying hundreds of thousands of miles of dedicated carbon dioxide (CO 2 ) transportation pipelines globally, along with hundreds of sequestration sites. All these costs must be included when estimating P3 for clean production technologies. These components of the green transition require extraordinary investments, so scarce resources must be allocated across hundreds—probably thousands—of large and small projects around the globe. The scale, speed, and complexity of this transition can be addressed only through the application of market forces, as only markets can provide the scale (governments certainly won’t) or the speed (governments can’t) that’s needed. And the sheer complexity of the resource allocation problem can also only be solved primarily (though not entirely) through markets. By focusing on P3 technologies, we can use and guide the enormous power of markets to which the economies of almost all countries—even China, even Russia—are now irrevocably committed (North Korea being the only obvious exception). Markets have undeniably raised average living standards and created enormous wealth (albeit in highly unequal ways). Even countries with strong collectivist traditions now accept that they must work within a market-oriented future. We need to harness those markets for the green transition. Archimedes allegedly said, “Give me a lever long enough and I will move the Earth.” For the green transition, only markets are a lever long enough and strong enough to meet the need. This is not to claim that simply unleashing free markets will solve the climate crisis. That’s obviously not true, or we would not have a climate crisis today; private companies would have solved it already. But given its global character and the scale of the green transition—far beyond the capacity of governments to fund or manage—there is no driver close to matching the power of the market. Change at this scale depends on private sector investments (which reflect investor choices). But markets will only work effectively when the cost of green energy becomes price\/performance competitive with fossil fuels. Until that happens, investors will reward market winners, which are the dirty technologies. For the green transition to be successful, it must rely on markets—and for markets to work, any new competitor against existing products or services must provide approximately the same performance for about the same price if it is to be successful. This is P3. It reflects the harsh but undeniable reality that green energy won’t replace gasoline, natural gas, or coal if it costs more or if its performance is worse. Box 3: Scaling for the Green Transition: A Global Challenge[13] To serve the expanded scale of low-carbon technologies by 2050, significant global expansions will be needed to meet net-zero targets. Some perspectives on the scale needed are the following: Production § Global annual clean energy investment must grow from about $1 trillion in 2022 to $4 trillion by 2030 and maintain that level for 20 years through mid-century. § IEA notes that continued additions in renewables are required to meet mid-century goals. By 2030, global annual additions of wind and solar will have to reach 390 gigawatts (GW) and 630 GW each year. In 2022, the world added 75 GW of wind energy and 191 GW of solar, which represented impressive growth but was still far below where 2030 growth must be. § Global hydrogen demand increases dramatically between now and 2050. Current demand for conventional hydrogen is 90 megatonnes per year (MT\/y), with demand expected by IEA to increase to 200 MT\/y by 2030 and 530 MT\/y by 2050. This global growth necessitates a rapid increase in electrolyzers capable of producing low-carbon hydrogen, alongside an entirely new transportation infrastructure for hydrogen, including pipelines and shipping via barge and rail. Transmission § Electric grids must expand rapidly globally to meet the net-zero challenge. Bloomberg New Energy Finance noted that global grid investment will need to top $21.4 trillion by 2050, $4.1 trillion to maintain existing electrical infrastructure and $17.4 trillion to expand the grid. Some 80 million kilometers of electric grid expansion will be needed by 2050—doubling the global grid infrastructure. § CCUS must expand at unprecedented rates. The IEA NZE roadmap models 7.6 billion tonnes (GT) of annual CCUS capacity by 2050, from a current level of 250 MT in 2022, a 30X expansion in roughly 25 years. This includes 6.6 GT CCUS in the electricity, industrial, and fuel supply sectors, and 1 GT of direct air capture sequestration. This equates to hundreds of thousands of miles of dedicated CO2 transportation pipelines and hundreds of sequestration sites. End Users EV sales need to go from 14 percent today to 60 percent by 2030, per IEA. There are 26 million EVs on the road today around the world, and about 1.5 billion ICE vehicles. Decarbonizing heat for both residential consumers and manufacturers is an IEA priority. Heat pumps met only 10 percent of global space heating needs in 2021; by 2050, IEA estimates that heat pumps will be used in 40 percent of residential buildings in emerging markets, and 55 percent in total. By its nature, climate itself is global. That global character is acknowledged in almost every article written about climate change—and is then promptly forgotten. The United States accounts for 12.6 percent of CO 2 emissions (see figure 2).[14] When combined with the rest of the Organization for Economic Cooperation and Development (OECD), the total reaches 35 percent, and both figures are declining.[15] CO 2 emissions from outside OECD are close to two-thirds of all emissions, and both their share and total emissions from low-income countries are growing, as their needs expand rapidly and they mainly use the cheapest (and dirtiest) technologies to meet their needs.[16] So, the future of greenhouse gas (GHG) emissions and hence of the green transition lies not in the EU and not in the United States. It lies in the low-income countries. Indeed, to the extent the green transition takes hold in the West, the center of gravity for GHG emissions shifts more heavily elsewhere. That reality is reinforced by demographic shifts—80 percent of the world’s population growth between 2022 and 2050 will come from Africa and Asia, and predominantly in the poorest countries in the world.[18] Many green technologies will be developed and deployed first in the West, and will also perhaps reach P3 in the West, but the relevant markets for those technologies are global, and adoption by low-income countries will follow regardless of where the tech is developed, once it reaches P3. This doesn’t mean, as some have argued, that the rich countries should be off the climate hook until all countries—or even just the big low-income countries—agree to cut emissions. The rich countries built their economies on the back of GHG emissions, so they bear substantial responsibility for addressing climate change. And of course, the rich countries are best placed financially to do so. Nor does it mean low-income countries lack interest in climate policy. On the contrary, especially as there are close connections between burning fossil fuels and the disastrous air pollution enveloping many cities in low-income countries, as well as the predicted rise in sea level and more intense weather generally, going green seems to be an attractive option. China, for example, knows that it cannot grow indefinitely on the back of coal.[19] In fact, we believe that in the right circumstances, low-income countries will cut emissions and will eventually reach net zero. The challenge, though, is formidable. Take India, for example, which has formally committed to net zero by 2070 and is ramping up renewables. Yet, despite these good intentions and considerable activity, India’s use of coal is still growing fast and will continue to do so (see box 4). It has huge coal reserves that are cheap to exploit, and coal has been the backbone of electricity generation in India for decades. It recently auctioned rights for 121 new coal mines, while existing mines are also being expanded quickly.[20] China’s use of coal is similar. Box 4: India—Power Demand Increases and Supply Choices India’s CO 2 emissions will increase as power demand grows to serve an expanding and urbanizing population (1.8 billion by 2040). An additional 4,600 terra-watt hours (TWh) of additional power will be needed by 2050, a fourfold increase over 2020 power production.[21] Renewables will provide a growing percentage of total power production, but coal-powered energy will still grow substantially in absolute terms (see figure 3).[22] The Modi government aims to add some 500 GW of renewables capacity by 2030 (15x the current renewable capacity in California). Solar, in particular, is becoming price competitive for utility-scale power generation in some parts of India, but system-level costs, the load profile, and the low production costs of fully depreciated fossil-generation assets are slowing adoption.[23],[24] However, the government also plans to substantially expand use of coal; output will approximately triple by 2050.[25] There is simply no way for renewables to provide the growth in cheap power that India is prioritizing. The renewables’ share of total power production varies considerably by state in India. States with more coal production have less renewable power. Interstate energy trading is limited, so utilization rates are not maximized, which negatively affects the economics of renewables. IEA estimates that net zero by 2070 in India would require more than $160 billion in investment annually, equivalent to about 5 percent of the nation’s annual gross domestic product (GDP). India’s recently announced investment of $4.3 billion in clean energy is less than 0.15 percent of the total needed.[26] India’s continuing emphasis on new coal mines and coal energy shows that it will not regulate against fossil fuels if doing so results in higher energy prices or lower energy availability. Growth trumps green every time, and—given India’s profound need for growth—any Indian government that promotes green over growth could be seen as betraying its citizens. The P3 lens focuses attention on other issues as well. We’ve seen that P3 must be measured at the point of consumption, not at the point of production. So India needs an efficient and universal grid to transmit renewable power from where it’s produced to where it’s needed. If renewables cannot reach parity with coal at the point of consumption, coal will continue to dominate the energy mix. India is just one example. Around the globe, no government will abandon growth. Poor countries in particular will not abandon growth to become green, even where the climate crisis is most apparent (e.g., in Bangladesh, where flooding displaces 50,000–200,000 people annually).[28] The focus on growth is a matter of survival for governing elites, and there is a history here too, as many low-income countries previously imposed painful cuts to food or energy subsidies under International Monetary Fund (IMF) or World Bank pressure.[29] Their elites subsequently learned that higher food or energy prices are an exceptionally effective method for generating demands for regime change.[30] Indeed, China’s path has been based explicitly on a social contract that provides for growth in exchange for authoritarian government. That contract is increasingly a model for other low-income countries. Green isn’t part of the equation. In this context, the clear message from the South at COP26 was entirely predictable: They want a green economy, will work toward it, but cannot and will not pay a substantial premium for it. That message has both a practical and a moral dimension. Practically, social contracts everywhere limit what governments can impose, and those limits are far lower than the cost of the green transition in poor countries that need to grow fast. Poor countries cannot and will not pay a substantial green energy premium; and COP26 and COP27 showed that the West—while it will contribute something—will not pay anywhere close to that premium for poor countries either. The seven countries that committed to Loss and Damage contributions at COP27 offered a total of $275 million, which is not a serious amount for a transition that will cost trillions of dollars.[31] In fact, despite recent large investments, the West won’t even pay for its own transition. That’s the practical picture. But the moral dimension is also important. Over the ~150 years since the start of the Industrial Age, industrialization in the West has created the climate crisis. So poor countries see no reason to pay for the cleanup. They believe they didn’t benefit and that they didn’t cause the mess, so they shouldn’t pay to fix the problem.[32] Whatever the truth of arguments about core\/periphery, North\/South, imperialists\/colonies—whatever the justice of these arguments—they are the granite reality into which climate policy will crash. Poor countries are politically unable to pay a heavy price to fix a climate problem that until recently they didn’t even cause (aggregate emissions since the industrial revolution have of course predominantly come from rich countries). These realities suggest we are not going to meet the 2050 timeline to net zero. But they also provide a very specific roadmap that can direct us toward a better approach. If low-income countries will always choose growth over green, then growth and green cannot be cast as alternatives. P3 gives us the tools to avoid that choice. Poor countries cannot and will not pay a substantial green energy premium; and COP26 and COP27 showed that the West—while it will contribute something—will not pay anywhere close to that premium for poor countries either. While few countries will pay the green premium needed to install high-cost clean technologies, many will accelerate their green transition if the cost is low enough. So green technologies must become cheap enough to compete directly and effectively with the status quo. Costs for green tech must shift downward until the green premium eventually vanishes. When that happens, we can have our cake and eat it too. We can continue to grow—a practical and politically imperative, even in the West—while at the same time shrinking GHG emissions to reach the eventual goal of net zero. We need cheap green technologies, so can current technologies become cheap enough quickly enough? Are they all effectively on curve B? It’s become a mantra among certain parts of the policy crowd that we have all the tech we need. Mark Jacobson’s recent book No Miracles Needed is one example, summarized in a recent Guardian article:[33] [T]he best solution is one that can be implemented quickly and at low cost. Enter wind, water and solar (WWS). WWS includes energy from the wind (onshore and offshore wind electricity), the water (hydroelectricity, tidal and ocean current electricity, wave electricity, geothermal electricity and geothermal heat), and the sun (solar photovoltaic electricity, concentrated solar power electricity and heat, and direct solar heat). When combined with electricity storage, heat storage, cold storage and hydrogen storage; techniques to encourage people to shift the time of their electricity use (demand response); a well-interconnected electrical transmission system; and nifty and efficient electrical appliances, such as heat pumps, induction cooktops, electric vehicles and electric furnaces for industry, WWS can solve the ginormous problems associated with climate change at low cost worldwide. This is both true and false. Many existing green technologies will underpin the green transition and become cheaper as they scale up. But there is a formidable gap between the existing price\/performance of most green technologies and that of the cheap and energy-rich fossil fuels they must displace. Rather than grappling with climate realities, Jacobson and others simply adopt a game of let’s pretend: Let’s pretend that the green transition is not only cost free but that we will all magically become richer while paying for it—and that the massive investment required will be paid back within six years. Let’s just pretend that the variability problems of wind and solar will suddenly vanish, and that “a well-connected electrical transmission system will magically spring up around the globe (when it has not done so in the 100 years of grid deployment to date).[34] Jacobson’s solutions will also apparently reduce the amount of energy needed on a global basis by 44 percent (the math apparently works if we add in the magical appearance of “some efficiency improvements beyond what is expected”), even though, as we have seen, global energy demands are growing rapidly. Jacobson is not alone. Indeed, 15 years ago in An Inconvenient Truth (his 2006 documentary), Al Gore claimed that “we have all the technology we need”—and various Biden administration officials have argued much the same.[35] This approach assumes that countries (and the citizens they represent) will not sign up for an arduous, expensive, and uncertain transition to a green future. We agree. But instead of accepting this reality and working to change it, the solution on offer simply applies magical thinking. It just insists that the green transition will be painless, profitable, quick, and certain, using technologies we already have. That’s just not true. And in the end, “we have all the tech we need” is a disastrous message. It suggests that the green transition will be cost-free and easy, hence the only missing ingredient is willpower. We just need to focus our efforts and we will emerge into the sunlit uplands of a green economy that is cheap, more efficient, and cost free.[36] We just have to believe that people will ditch their gas stoves, junk their second-most-expensive asset (ICE cars), install geothermal heating along with a heat pump and electric water heater, solve the energy storage and electricity transmission problems so we can ignore the daily, seasonal, and annual variability of wind and solar, replace 136,000 TWh of fossil fuels primarily with solar and wind, and generate and deliver enough green hydrogen to decarbonize heavy industry, transportation, and aviation.[37] It’s all just an easy lift that requires no significant new technologies at all; just the will to save the planet. Box 5: We Do Not Have All the Clean Tech We Need at a Price Competitive With Dirty Tech In November 2021, as the Biden administration was gearing up for COP26 in Glasgow, it published a white paper setting forth how the United States could cut emissions by investing in renewables, along with other measures. The paper asserts that the strategy would result in a net economic benefit to the United States between now and 2050. It cites 11 studies from energy think tanks, environmental organizations, and universities in support of this conclusion. But what the administration did not say, and what the cited studies do not make clear, is that those net economic benefits are contingent on continued steady declines in renewable energy costs. All studies rely on a single set of cost projections that are updated annually, the National Renewable Energy Laboratory’s (NREL) Annual Technology Baseline (ATB).[38] These projections are fed into varying energy models to predict future overall renewable energy deployment and total system-wide transition costs. Notably, to achieve ambitious climate targets with a net benefit to the economy, continued declines far beyond today’s already low costs will be necessary. For instance, the projections for offshore wind through 2030 imply cost reductions between 25 and 43 percent. With its higher-capacity factors and fewer land-use constraints than traditional onshore wind, offshore wind is seen as vital to a high-renewables grid. Similarly, utility-scale battery storage, which will dramatically expand renewables deployment, is expected to decline in cost by between 33 and 60 percent by 2030. If the energy transition models relied on today’s costs rather than this projected decline, the system transition would be very costly, rather than provide a net benefit. What might upend these projections? To be sure, cost declines are likely as more units are deployed, driving innovation in design, deployment, and management. However, scale and learning effects eventually exhaust themselves, and history suggests they may do so unexpectedly. The recent uptick in renewable costs should serve as a wake-up call, even if it proves to be transitory. IEA, for example, notes that investment costs for utility-scale wind and solar projects could increase by as much as 25 percent over the next few years before inflationary pressures in global commodity markets subside.[39] Continued investment in hardware, software, and soft-cost innovation are crucial to achieving a low-carbon future. So, costs will likely continue to decline thanks to scale economies, incremental innovation, and market forces, but they very well might not, and either way the declines might or might not lead to P3. The cost declines assumed in the models are not necessarily impossible, exaggerated, or somehow deceptive, but policymakers, entrepreneurs, and scholars must avoid the trap of thinking that they describe a future reality. They offer only one version of that reality, and there are numerous and formidable pitfalls on the way. We need to unpack the hidden assumptions that the models use to derive these positive outcomes—especially assumptions about continued policy support—and then take steps to guard against contingencies that could derail the expected progress. To bolster their claims, proponents also argue the climate transition, rather than costing money and reducing productivity, will boost economic growth and jobs. Green technologies will not create net growth or net jobs unless their cost is lower than the cost of dirty energy (also including simply spending a lot of money). In this case, trillions of dollars have no effect on moderate- to long-term economic growth, unless the new technology is more productive than the old. (See box 6.) Box 6: Unless We Get to P3, Climate Solutions Will Not Grow the Economy Many claim that climate solutions will be good for the economy because they will create jobs and spur investment. After all, the thinking goes, the trillions of dollars in needed investment will spur new jobs and economic stimulus. As an article in Foreign Affairs states, “[R]ather than being viewed as a cost to be borne, the needed projects should be seen as strategic investments with the capacity to boost growth in both the short and the long run.”[40] Another study states that “replacing these [dirty] plants with local solar or wind would drive $589 billion in local capital investment that could support economic diversification, job creation, and tax revenue.”[41] But these statements are not true. Unless a national economy is in recession, added spending that does not boost productivity only leads to inflation. If added clean energy is not more productive than dirty energy (e.g., the cost of energy output is lower), then it will lower per capita incomes, not increase them. Even if new clean energy plants are at P3, scrapping usuable existing dirty assets and replacing them with new ones will also reduce global GDP, because the existing capital will not have been fully amortized. As long as clean energy requires more resources (financial and labor) for energy production, fewer resources will be available to produce other goods and services. There are only two ways clean energy investments can grow the economy. The first is if clean energy costs less than dirty energy. If this is the case, then society gets the same amount of energy with fewer societal inputs, and those saved inputs can be used to produce other things (e.g., haircuts, furniture, health care, etc.) The common claim that clean energy investments will create jobs is a reflection of the current ineffeicency of clean energy. If it takes 1,000 workers to produce x BTUs from oil and 1,200 workers to create the equivalent energy from wind or solar, then yes, jobs will be created, but real GDP will decline because those extra 200 workers are not working to produce other things. It would be like saying that we can create jobs if we ban farm tractors. Yes, we would get more jobs in farming, but food prices would go up (making everyone poorer), and employment in other industries would decline. That is why getting to or beyond P3 is so important, because we can have our cake and eat it to: GHG reduction and the same or higher productivity. A related way is if the externality costs of dirty energy are included. If these costs are greater than the added costs of clean energy then global net benefit would be greater. But, importantly, these benefits are global, and the costs are national (or local). So few countries will include these costs in their decision-making. The second possible way clean energy investments can grow the economy is if a nation expands its exports because it gains competitive advantage in clean energy sectors. This allows a nation’s terms of trade to improve, letting its currency appreciate and making imports relatively cheaper. And it is certainly possible, and desirable, for the United States to gain competitive advantage in the clean energy industry. But success is anything but assured, especially given China’s clean energy mercantilism. Moreover, competitive advantage is a zero-sum game: If the United States gains, other nations must, by definition, lose. In other words, the global trade balance in any good, including clean energy goods, must be zero (exports must equal imports on a global basis). Additional exports might make the United State better off, but that argument does not hold globally. As the British say, if wishes were horses, beggars would ride. To address the climate crisis, instead of wishing it out of existence, we must adopt a realist approach tightly focused on helping technologies meet the P3 test. However, we first need a deeper dive into the currently dominant model, which seeks to force the adoption of clean technologies. Broadly, there are four kinds of forcing policies: 1) regulation to directly force adoption of green technology or to outlaw existing fossil-based technologies; 2) subsidies that reduce the cost of green technologies; 3) taxes that increase the cost of dirty technologies; and 4) exhortation: simply demanding that companies, individuals, and other governments change their behaviors and adapt to a low-to-no carbon world. None of these approaches will work to enable global climate solutions. Regulation is used by governments to legally require (or prevent) an action. Regulation can make dirty products more expensive, block their use altogether, or require the adoption of cleaner products. For example, governments could seek to ban gas stoves, gas water heaters, and gas space heaters; block drilling for fossil fuel, fossil fuel pipelines, and fossil fuel exports; eliminate ICE cars; close coal fired power plants or short-haul flights; ban meat advertisements or meat altogether; the use of plastic bags, and much more.[42] Instead of providing end users with choices that will lead to a change in their behavior, regulation imposes change—usually but not always on the producers of goods rather than on consumers.[43] Can we simply impose green energy by fiat? Simply mandate the end of fossil fuel use by a set end date—such as California’s recently mandated phase-out of ICE vehicle sales by 2035?[44] This is superficially plausible, even attractive. It seems to address GHG emissions without needing to meet the P3 test—indeed, without confronting end users at all. Usefully, it centralizes decision-making, so political pressure can be more effective. In the United States and similar federal systems, federal-level regulation can help avoid the slow strangulation of policy by conflicting power centers, while also addressing the free-rider problem between and within countries (some U.S. states, for example, are much more skeptical about the climate crisis and the need for potentially costly mitigation and hence may simply free ride on the efforts of California and other bright-green states). Regulation also reflects the shared assumptions of most economists—including such conservative icons as Hayek and Friedman—that capitalism requires a regulatory framework.[45] That sets boundaries for acceptable economic activity—boundaries that go well beyond obvious guardrails around marketplace activity (fraud, stock manipulation, etc.). Humans have regulated the wider economy since the beginning of recorded history through rules governing currency, trade, apprenticeships, and even who is allowed to buy what. Time after time, new regulation has been accompanied by warnings of direct economic consequences, dating back to the first trade unions, child labor laws, the income tax, and early trade policy. Many of these broad regulations have been effective. Starting in the late 1960s, regulation has, for example, achieved impressive successes in requiring clean air and safe water.[46] It’s now the failures in these areas that are newsworthy— and the costs have long ago been integrated into the general cost of doing business.[47] The Cuyahoga River near Cleveland no longer catches fire, and London is no longer blanketed in crushing fog every winter, now that coal and wood fires have been banned. Why will this top-down approach fail to spur the green transition we need? It will fail because regulatory successes share some key characteristics that make the political and economic costs of regulation bearable, and climate regulation doesn’t meet those tests: ▪ Concealment. In most cases, the costs of regulation are largely hidden from end users. Consumers don’t know that plastic chairs got more expensive because in the late 20th century plastics companies were forced to address environmental externalities. That’s a hidden cost. There is no “Clean Water Tax” line on the U.S. 1040 tax form. Efforts that are more public are, conversely, much harder to implement. The Federal gas tax in the United States has, for example, not been raised since 1993, even though inflation has eaten away half its value. ▪ Scale. The size of the new regulatory burden must be manageable given the productivity and the wealth of the specific society. Clearly, this implies that rich countries are much more able to afford a higher regulatory burden than poor countries. ▪ Feasibility. All aircraft flights that generate GHG emissions could be banned tomorrow. But that’s not feasible because there is no practical transportation alternative to flying across oceans and for long distances. Regulations must offer existing industries an effective pathway forward. ▪ Limited impact on competition. Some ways of doing things die out, but differences in readiness to accept them do not reshape the balance of power within an industry. The decision to ban DDT was important, but it did not significantly affect even the pesticide industry—the same manufacturers in general just moved on to new legal products.[48] ▪ Costs and benefits are aligned across time and geography. The Clean Air and Clean Water reforms of the early 1970s worked largely because the costs and benefits aligned. Society picked up the costs (via increased regulation) but also received the benefits: clean air and clean water improved life across the United States. Climate is a different problem. The benefits are widely distributed around the entire globe, while the costs are concentrated in energy-producing and energy-intensive industries along with selected energy end users, and regulatory impacts are experienced quite differently between countries and regions, rich and poor, and urban and rural populations. Costs also apply now, while benefits may emerge only decades later in the entirely imperceptible form of global warming foregone. Regulations to ban GHG emissions fail all five of these tests. They would transform the competitive landscape in many industries; they would be extremely public; closing the P3 gap via regulation implies an enormous new cost burden; some regulations (e.g., banning ICEs immediately) are currently not feasible; and the benefits are global and distant, while the costs are local and immediate. What would happen if ICEs were banned overnight? The pitchforks would be out almost as quickly. There is no supply chain to support deployment of millions of non-ICE vehicles. Green energy sources today don’t have the capacity to power the millions of non-ICE vehicles that would be needed. Most consumers won’t buy them willingly except at P3. And the millions of ICE vehicles now on the road (300 million in the United States alone) represent an enormous pool of assets that would become worthless overnight. So even the most aggressive green regulators have built in a looooong runway. For instance, California has banned just the sale (not the use) of new ICE-powered light vehicles by 2035; millions of those vehicles will be on the road for many years after that. Of course, not all regulations ban something. And regulatory reforms that accelerate change will be welcome—in fact, they will be needed. We will certainly need a better regime for deploying nuclear power, and for moving much more electricity more effectively across the grid to where it is needed. Regulations that shift the cost of externalities to emitting industries from the society at large could help, but again, these will not be implemented in many places because of costs that ultimately will be borne by consumers. Relying on the regulatory option would leave us all poorer—if that were even possible—and there is no political constituency for doing so in either the West or low-income countries. Regulation can sometimes help grow demand when the pathway to P3 is viable (curve B), but reliance on regulation will fail, especially when faced with curve C technologies. Box 7: Beyond the Black Box Economists and modelers have long treated innovation as a black box, something that just occurs as technologies developed, scaled, and deployed. But the black box approach is too simplistic, given the stakes for the climate of sustaining innovation to create better, cheaper solutions to achieve a zero-carbon electricity grid by 2035 and economy-wide deep decarbonization by 2050. The Department of Energy’s (DOE’s) 2021 Solar Futures Study opens up the black box of climate-tech innovation.[49] The study lays out two innovation pathways that could achieve a 57 percent cost reduction by 2030. Following either pathway could spur vast investment and widespread deployment of solar power with a cumulative range of 760 GW to 1,000 GW by 2035. One pathway (“low cost”) relies primarily on demand-side drivers to cut the costs of solar PV modules and balance of system (BoS) components through mass production. Key policies that would this pathway could include innovations in financing, such as those that made third-party ownership models, commonplace. These models lowered the up-front cost of installation and brought solar to previously uninterested states such as Georgia and North Carolina. The other pathway (“high performance”) cuts costs mostly as a result of breakthroughs on the supply side, especially new module hardware that is more efficient, durable, and reliable. Thanks in part to Chinese government subsidies, the dominant solar cell material today is crystalline-silicon (c-Si), which is approaching a performance ceiling. Newer materials, such as perovskites, offer capacity and application benefits, but they are costlier, and the global know-how and supply chains to support them are not well developed. To enable this pathway for solar PV technology, the United States will have to continue to invest in targeted research, development, and demonstration (RD&D) and support for manufacturing innovation. Both pathways to very low solar costs are schematics designed to shed light on how components of the overall cost stack might change, but they are definitely not predictions and should not be treated as though they are are. Given the intrinsic uncertainty of further solar innovation, and energy markets more broadly, we should be betting on innovation and scale to deliver solar at P3—a comprehensive solar PV innovation policy pushing for more breakthroughs in solar technology (e.g., improving technologies’ physical characteristics) while also accelerating scale and process innovation by strengthening demand. The United States has made good progress developing and deploying low-cost renewable energy. But the modeling is clear: Building a reliable grid that will serve as the backbone for a cleaner, more-electrified economy without raising energy costs will require technological improvements that drastically drive down the costs and improve performance. Telling Americans that the nation can make this transition with today’s technology without paying more for energy is not only misleading, it makes it harder to generate support for innovation policies. Subsidies encourage rather than require change. Subsidies are the carrots offered by governments to induce the adoption of green technology and can powerfully influence the development and adoption of new technologies. Seeding markets via subsidies can drive adoption in a new market, such as in solar energy, where feed-in tariffs have clearly had a dramatic impact on demand.[50] Such subsidies can help draw in early adopters and, at a larger scale, encourage the demand from more mainstream users that may be needed to drive scale-up. The massive tax incentives for clean energy in the Inflation Reduction Act are an example of subsidies, as are existing tax credits for installing solar or wind generation or buying an EV. More widely, proposals for debt relief for low-income nations in exchange for climate action are in fact just subsidies.[51] Subsidies can be effective. Take Norway, where 79 percent of new cars sold are electric.[52] But that is not because most Norwegian consumers prefer EVs; it is because the Norwegian government made consumers an offer they could not refuse, including reduced taxes, reduced toll-road charges, access to bus lanes and priority parking, subsidized charging stations, an abundance of cheap hydroelectricity, and more. On top of that, Norway imposes $2.84 in taxes per gallon of gasoline—10 times more than U.S. gas taxes.[53] So why not just subsidize our way through the green transition? The answers are scale and timing. Subsidies by definition cost money, so the bigger the gap between P3 and the cost of new technologies, the larger the subsidy must be. Similarly, the longer the period before green technologies are market competitive, the larger the overall burden of subsidy. And some technologies are likely on curve C and will never become price competitive, and will therefore need subsidies in perpetuity. That $7,500 in EV subsidies is a substantial amount, but it’s only about 11 percent of median household income in the United States. In India, that would be about 349 percent of household income; in Nigeria it would be 361 percent. Subsidies thus carry three main risks: First, they may be very expensive. Second, they may lead to permanent (and unnecessary) expenses. Finally, they are usually highly persistent and difficult to reduce or eliminate. They will therefore be hugely expensive if there is a substantial P3 gap between the cost of current dirty technologies and new clean technologies, where the period of subsidization is long. The acceptable level of subsidy varies with the financial capacity and willingness of different governments, but large permanent subsidies are simply not feasible, even in richer countries—and far less so in poorer countries. So, while there is a role for subsidies, the core problem is cost, as end-user energy subsidies tend to be expensive. Take the new EV subsidy in the United States: up to $7,500 per vehicle for EVs manufactured in the United States (there are other restrictions).[54] About 15 million vehicles are sold annually in the United States, so subsidizing all of them would cost about $112 billion annually.[55] Obviously, the available subsidy will cover a much lower share than that, but the scale of subsidy needed to make a serious dent in ICE sales is formidable, even in the United States. But that’s not the most important cost question. We already know that the low-income world is where the green transition must work. That $7,500 in EV subsidies is a substantial amount, but it’s only about 11 percent of median household income in the United States.[56] In India, that would be about 349 percent of household income, in Nigeria it would be 361 percent, in Indonesia it would be 325 percent, and even in China it would be 158 percent.[57] And while the cost of EVs designed for these markets might be lower (though it also might not), that scale of subsidy is not feasible in poorer countries, which is where the climate crisis is most urgent and where emissions are still rising rapidly.[58] EVs are just one example, but they show quite dramatically that subsidies for green technologies at scale are not in themselves the primary solution, even in the United States and Europe. Given the scale of the transformations needed to address climate change, a subsidy-driven approach across all sectors and technologies would simply be far too expensive. And given the massive U.S. federal budget deficit and political pressures to not increase spending or taxes, there is little chance that a political coalition can be formed behind further green subsidies, let alone to levels that would drive accelerated change at the required scale. The challenges for subsidy-based policies are much worse in low-income countries. There the mismatch between resources and need is enormous, and there is no evidence at all that the resources needed for a subsidy-driven solution will be made available, either from internal resources (they are too poor) or from the rich countries (which so no sign of paying the piper). Finding pathways to the green transition in the United States and Western Europe is important, and subsidies will likely play a role, but deep and extended subsidies are very difficult to imagine politically and economically in the West—and are just not viable at all in the low-income world.[59] If we can’t lower prices of clean technology throughout the world with subsidies, many argue that governments should raise the price of dirty technologies through taxes or tariffs. We have no problem with that concept. Of course, dirty technologies should pay for the external damage they cause, and a carbon tax would be an elegant way to impose those costs. Standard economic theory indicates that productivity is maximized when the full costs of existing production—including the social externalities associated with it—are borne by the producer. That’s what’s behind the push for carbon taxes and various attempts to develop markets for carbon related to energy production. Such policies would be rational and helpful. Unfortunately, political realities are different. Many nations subsidize oil and gasoline, and would face a political revolt if they eliminated the subsidies to raise the price. Many nations, such as the United States, have not been able to impose a carbon tax, and even nations that have done so mostly impose only limited taxes that are insufficient to move the climate needle. The IMF reported that “only about one-fifth of global emissions are covered by pricing programs, and the global average price is only $3 a ton. That’s a far cry from the global carbon price of about $75 a ton needed to reduce emissions enough to keep global warming below 2°C.”[60] The point here is simple: We can pretend that governments will summon the political courage to impose and keep the levels of carbon taxation needed to change behavior. Or we can look at the reality—such as the total failure of the United States to increase the federal gas tax, or the success of the Gilets Jaunes in France in forcing the Macron government to rollback very modest fuel tax increases (see box 2). Those indicators identify the limits of a tax-led policy. As advocates realize the difficulties of changing public policy, they are increasingly turning to exhortation, of individuals, companies, and governments. Some environmentalists have proposed a different option: a no-growth or even de-growth pathway that calls for the radical reduction of energy use. These environmentalists believe profoundly that the green transition can be induced by persuading the masses to change their behavior and give up their material aspirations. A number, such as Jason Hickel, call explicitly for de-growth, especially in the West, and for replacing current societies by a low energy\/low carbon future.[61] The hairshirt brigade has made a difference, much of it positive.[62] The sheer centrality of climate in politics today—and in the plans of corporations and governments—is largely due to the extraordinary volume and impact of environmental concern and protests over the past decade. Dating back beyond Rachel Carson’s pivotal book Silent Spring, environmentalists have shown—sometimes dramatically—how modern economies have carelessly offloaded negative externalities onto the environment, with the climate crisis only the most recent case. The Clean Air Act and Clean Water Act were direct responses to pollution in the United States, and set the table for the politics of the climate crisis by demonstrating that change is possible, that protest matters, and that corporate complaints about additional costs or delays can be overcome.[63] Determined environmentalists and the much-improved science of climate change have therefore helped transform the context in which environmental and economic policies are made. Indeed, the movement’s greatest success is that we no longer debate these as entirely separate topics; today, economic policy is also environmental policy. Activists assume that if enough pressure and guilt can be brought to bear, often sugarcoated as “this is good for you,” widespread action will result. Don’t fly. Don’t have kids. Don’t consume. Don’t eat meat. Turn down your swimming pool heater.[64] Lower your thermostat in winter and raise it in summer. Install a “green roof.”[65] And, eat insects.[66] Box 8: The False Lesson of the Montreal Protocol Despite the endless list of delays and broken promises, some people retain a touching faith in the power of international cooperation to solve major probelms such as climate change. People such as Simon will argue that it is necessary for countries to come together to address global problems. They often cite the 1987 Montreal Protocol on Substances that Deplete the Ozone Layer that regulates the production and consumption of nearly 100 “ozone depleting substances.” After all, the depletion of ozone, like the build up of GHGs, affects the entire planet, not just one country. Presumably, the incentives for freeriding might be similar. Yet, every nation signed the agreement. The Protocol is not a model for climate change for two reasons. The transition involved was relatively minor—replacing about 100 chemicals with alternatives. Compared with the massively expensive task of transitioning the entire world to clean tech, this was child’s play. Moreover, the costs were relatively minor. As Cass Sunstein wrote: To the United States, the monetized benefits of the Montreal Protocol dwarfed the monetized costs, and hence the circumstances were extremely promising for American support and even enthusiasm for the agreement. Remarkably, the United States had so much to lose from depletion of the ozone layer that it would have been worthwhile for the nation to act unilaterally to take the steps required by the Montreal Protocol.[67] In contrast, the costs of addressing global warming are orders of magnitude greater. In addition, the technical challenges for coming up with ozone-safe alternatives, while real, were relatively straightforward, and industry quickly responded. Growing demand for air conditioning also meant that costs were allocaated in aa growing market, and incumbent manufacturers were not severely disadvantaged. Even in rich countries, hairshirts just don’t work. Trade-offs that involved some personal sacrifice—some actual cost—have been rejected. The eat-local movement—which has the added benefit of offering fresher food—is a barely visible pimple on the enormous backside of the United States grocery business.[68] Similarly, efforts to persuade people to walk or bike more and take public transport have had some impact at the margin—the notion of the 15-minute city has gained some currency among city planners and local government (although it has also generated pushback). But these efforts are effective only in certain quite limited geographies for a quite limited demographic; most modern cities are built for and require access to a car, and there is simply no sign that auto sales will fall, even though cars are no longer the cultural badge they were, even for young people. Global light-vehicle sales reflect this reality (see figure 5). Recent efforts by the Dutch government to force farmers to cut nitrogen use as part of its climate policy led to massive protests and the rise of a new political party.[69] Similarly, the anti-flying movement has had no discernible impact, aside from ritualized attacks on private jets. GHG emissions are simply not a concern for consumers as they buy airline tickets. The growth in the global number of air passengers continues to accelerate and was (pre-pandemic) growing faster than the long-term trend (see figure 6). Even private jet travel—the target of hairshirt activists—continues to soar.[71] The many failures underscore the limits of hairshirt activism. It’s no surprise that not a single government has been elected on a no-growth platform—not in the rich countries, and not in the low-income world either. The growth imperative still dominates, and within that, hairshirts have only a limited role to play. In the end, hairshirts are even less attractive than regulations or subsidies, as they demand that we agree to become poorer—not always in a direct financial sense (though that as well), but in abandoning comforts most people in the West are accustomed to, and to which low-income countries aspire: car ownership and use, heating and cooling of buildings, a meat-based diet, suburban living, air travel, the list is long. Unfortunately, the parallel list of behavioral changes that have been adopted is exceptionally short. And not a single government has been elected in the West or the low-income world on a platform based around less. So, exhortation confronts a reality that wants little to do with it. In the end, hairshirts are even less attractive than regulations or subsidies, as they demand that we agree to become poorer—not always in a direct financial sense (though that as well), but in abandoning comforts most people in the West are accustomed to, and to which low-income countries aspire. As climate activists realize the political difficulty of the regulation, subsidy, and tax mechanisms, they are increasingly pressuring corporations, knowing that large corporations are sensitive to their image with consumers, investors, and government. As Biden administration Climate Envoy John Kerry noted, “At the Glasgow climate summit, numerous governments and large corporations committed to start buying clean industrial products, sending a crucial market signal.”[73] This is not really a market signal; it is a signal from exhortation. To be sure, many companies have made climate commitments, but most have not, especially non-publicly traded companies and companies in lower- and middle-income countries. Indeed, a number of banks have recently backed off commitments made at COP28 to invest more in clean tech because doing so was too risky. Similarly, pressuring banks and investment firms to divest from companies that are not green enough will do nothing because there are more than enough other investors to buy these companies’ shares, especially if they fall in price from green divestitures. Large corporations, at least in many high-income, democratic countries, have made numerous commitments to address climate (even if some share of that is “greenwashing”). But there are sharp limits to what companies can do in competitive markets that put a premium on price and quality. For example, a significant number of insurance companies have dropped out of the Insurance Climate Alliance after realizing that their commitments made no financial sense.[74] Exhortation of governments is the principle focus of the COP summits, where governments are pressured by activists to make climate commitments. To date, these have been met nowhere, but the response to these failures is more exhortation. Alok Sharma, a former UK minister who led the COP26 talks in Glasgow in 2021, argued that: COP28 must deliver strengthened emissions reduction targets, and a commitment to peak global emissions by 2025... [There must be] a plan to turbocharge the clean energy revolution, and a commitment to phase out fossil fuels. And a meaningful agreement on how to scale up finance, both public and private, to support developing nations to decarbonize their economies—moving from the billions to the trillions.[75] China has been a particular target of this form of exhortation, as it has become the largest global emitter of GHGs (it is responsible for about one third of the global total, according to the World Bank). The view among many policymakers in the West is that if they just exhort and bribe enough (through concessions on other matters), China will somehow reduce its emissions; John Kerry argues that “We need to ‘get’ China,” while five senior foreign policy experts recently wrote an open letter in The Washington Post arguing that “China’s engagement in the international system is essential … to effective action on common problems such as climate change.” Joseph Nye, a top foreign policy academic and assistant secretary of defense in the Clinton administration, recently agreed.[76] For these and other policymakers, that means making concessions to China in other areas, such as trade policy. Despite all the calls to action, U.S. efforts to exchange emissions cuts in China for U.S. concessions elsewhere have failed to date and won’t work in the future.[77] China shows little willingness to impoverish its citizens by abandoning cheaper coal plants for more expensive renewables. It will cut emissions if and only if it is in their China’s self-interest to do so. As a result, China’s current energy strategy includes a continuing reliance on (and growth in) fossil fuel energy, alongside growth in renewables.[78] Box 9: Exhortation: Growth Hurts the Planet Growth rejecters argue that if we want to save the planet from global warming, we can no longer afford growth. Four natural scientists warned in an article in Nature that we need “an equitable downscaling of throughput with a concomitant securing of wellbeing, aimed at a subsequent downscaled steady-state economic system that is socially just and in balance with ecological limits.”[79] In case you didn’t get that, we need to be poorer to save the planet. This is why Tim Jackson proposes higher taxes (to limit “pathological” consumption by the masses), with the money to be spent on “less productive” social services.[80] In an economy with a much larger share of spending devoted to social services, the arts, care, and recreation, we can limit growth “precisely because the nature of these economic activities resists labour productivity growth.”[81] Likewise, Banerjee and Duflo want the government to tax workers and spend the money “to increase the demand of labor-intensive public services.”[82] Baumol’s disease (low-productivity industries hurting growth) now becomes Baumol’s cure (low-productivity industries stopping growth). Few people are willing to consume less to save the planet, certainly not the three billion who live on less than $2.50 per day.[83] And hair shirts would not be enough: Even if global GDP were cut in half—consigning billions of people to much worse lives—carbon emissions would be cut by only half at best, which is not enough to stop climate change. The famous bet between environmentalist Paul Ehrlich and business professor Julian Simon was won by Simon, as the projected shortage of copper, chromium, nichel, tin, and tungsten never materialized. In fact, faster growth is exactly what’s needed to address climate change and other environmental challenges. Indeed, the widely accepted environmental Kuznets curve shows that it is at low and high levels of economic output that environmental pollution is reduced.[84] Faster economic growth makes it more likely voters will accept costly environmental policies such as a carbon tax—and also generates more societal resources that could be used to address climate change. Unless clean energy technologies get to P3, the world will not come close to net zero. Getting to P3 requires innovation, through both product and process innovation, and via both radical and incremental product innovation. And that innovation requires coherent and well-funded national technology policies.[85] Indeed, climate is much more of a tech policy challenge than a regulatory one. “Innovation” is a very flexible term. Broadly speaking, it’s best defined as the introduction of new products, services, or processes to the marketplace. In contrast, “invention” is the initial creation of new technologies. So, innovation is not patents, it is not research and development (R&D), it is not invention, even though these are all components within the innovation ecosystem, supporting the development and deployment of new products and processes. It’s also useful to distinguish between incremental innovation—what can be done today to improve performance, reduce costs, etc.—and longer term more transformative innovation focused on the development of entirely new products. Incremental innovation powers the shift along the cost curves described earlier in figure 1 but remains tied to that curve. Transformative innovation is different: It shifts the entire curve, creating a new set of opportunities for incremental innovation along the way. Movement down the cost curve primarily occurs in three ways: learning, scale, and specialization. As each unit is produced, it helps a company learn more about how to produce the unit most effectively. That is learning by doing, and it is significant; manufacturers (and other companies) learn how to do things better, waste less material, and sequence activities more effectively. The revolution in manufacturing introduced by Toyota and other Japanese companies some 30 years ago was based on a new and much more systematic understanding of (and commitment to) process improvements through the Kaizen system.[86] However, learning economies peter out past a certain point. Scale refers to the bulk manufacturing first of components and then of finished products. Typically, new products move through a pathway from hand-crafted or artisan production (for prototypes and the first few examples), then batch production, where there are efficiencies from building a small number of products in ways that allow for more specialized labor, and then finally into production-line manufacturing. When Ford first applied the production-line and mass-production techniques to the auto industry, it could more than double the average wage of workers and at the same time cut prices for consumers dramatically. The Model-T sold for $850 in 1908, and for under $300 in 1925. As a result, by 1923, Ford was producing more than half of America’s automobiles.[87] Henry Ford’s famous dictum, that Ford would provide a Model T in “[a]ny color the customer wants, as long as it’s black” shows just how much he valued the power of scale.[88] Production improvements shade into minor product improvements as well, without requiring the introduction of an entirely new product. Ford might, for example, introduce a better door handle, which marginally improves the product. That too is an incremental innovation. Incremental innovation powers the shift along the cost curve, but remains tied to that curve. Transformative innovation is different: It shifts the entire curve, creating a new set of opportunities for incremental innovation along the way. The rise of the global economy has demonstrated a third force driving incremental innovation: the creation of more complex supply chains. Ford was a vertically integrated company (e.g., it had a steel mill on site), but modern producers are often systems integrators of parts and components from numerous sources. That’s how Apple builds iPhones and Boeing builds aircraft. The iPhone has eight major component manufacturers plus the design team at Apple HQ in California and final assembly mostly by Foxconn in Shenzhen China. Most of the component manufacturers have their own suppliers and subgroups, so overall, Apple has 180 direct suppliers spread across 30 countries, and many of these have their own supply chains.[89] In some cases, it is component manufacturers that can benefit most from economies of scale. Corning, for example, supplies the glass used for smartphone screens by many phone manufacturers. Serving multiple clients lets Corning benefit from economies of scale, which reduces the cost of the glass to manufacturers. Perhaps the same will be true in some clean energy markets: Scaled-up production of wind turbine blades using distributed supply chains has helped cut the cost of new land-based wind energy from $89\/MWh in 2000 to $32\/MWh in 2021, even though global orders run in the thousands, not the millions.[90] These extraordinarily complex supply chains are possible because global trade barriers were brushed aside (especially via the entry of China into the World Trade Organization in 1993), and because modern computing and instant communications allow management of such complex systems at minimal cost. Of course, some technologies never reach economies of scale. For example, while green hydrogen has become a technology of high interest and considerable policy push, it’s unlikely that hydrogen plants themselves will become a mass production commodity. Scale benefits for green hydrogen must therefore come from the mass production of components instead, notably electrolyzers. Looking through the P3 lens, we can see that transformative innovation will sometimes be needed (e.g., in long-term energy storage, as the existing dominant technology—lithium-ion batteries—cannot provide the length of storage needed at economically viable prices). But transformative technologies have special challenges. They are inherently higher risk, their benefits may not be easy for their owners to capture, and they may never reach scale. Spillover effects are substantial, competitors may surpass the innovator, and business problems (e.g., dysfunctional distribution systems or badly run production facilities) can derail them. Transformative innovations face internal challenges as well, fighting for their lives against established products within large existing companies. Clay Christenson’s book The Innovator’s Dilemma captures this contradiction—it helps to explain why Kodak failed the opportunity in digital cameras, Nokia failed in smart phones, and US Steel failed with mini-mills.[91] The further a technology is from the market, the bigger the risks, which is why governments play a bigger role as we reach back toward earlier stages of development. Basic research has for many decades been dominated by government funding, but there is an important government role in funding applied research as well. In the case of climate change, the pressing need for new technology demands different roles for the government at different stages of technology development. An existing Technology Readiness Level (TRL) model is already in use at DOE, as well as other agencies (notably the Department of Defense and NASA).[92] This model illustrates different kinds of government support for technology development but is limited to pre-commercial development. That existing model no longer sufficiently captures government engagement with technology development; the green transition will require government support well beyond the initial commercial deployment of green technologies, to the point where they reach P3. So the TRL model must be extended further into the market space, where milestones toward P3 are marked by the level of market adoption and the remaining gap to full P3 (see figure 7). Artificially limiting government support for new green technologies to the point where products enter the market is a recipe for failure. The path to the green transition is a path through the swamp: quicksand, traps, and diversions on every side. It’s easy to enter the land of endless subsidies; much harder to leave. Simply depending on the virtue of humans (as defined by the virtuous, of course) has a poor track record. Magical thinking won’t work. The modern world is not one in which rules are handed down and immediately implemented universally, or (often) at all. And everywhere, growth trumps green. These tools do not have to be applied globally. As long as one country can help get the cost curve to P3, those technologies can be adopted globally through market forces. A deeper view into P3 illuminates the cost curves that govern the adoption of green technology. We know that green technologies must reach P3 to fully engage those powerful market levers; we also know that costs for new technologies do decline over time, thanks to economies of scale and incremental innovation. What’s much harder is to determine whether a particular cost curve will ever reach P3. If it will, the job of the government is to accelerate movement along the cost curve as rapidly as possible. This can involve regulation, government procurement, subsidies, and other demand-creation measures. Nor do these tools have to be applied globally. As long as one country can help get the cost curve to P3, those technologies can be adopted globally through market forces. But if P3 won’t be reached, then the primary task is to find substitutes, better technologies, or better implementations that will reach P3 instead. The cost curves in figure 1 (revisited in figure 8) illustrate the price\/performance pathways available to new technologies. The policy implications and related prescriptions for the four cost curves differ profoundly: 1. Technologies already at P3 (curve A). Governments here have no role to play in terms of price\/performance improvements, but they can help to accelerate the deployment of these new green technologies by helping to smooth market entry and market expansion. This could take the form of trade policies, regulatory reforms that sweep away barriers to entry and deployment, training for workforce development, and new infrastructure. It should not, however, include subsidies, or regulations seeking to force a transition. Let the market do its work, but smooth the transition pathway, because big transitions are never as well-greased as economics textbooks would suggest. 2. Technologies on the path to P3 (curve B). For these technologies, getting to P3 requires movement down the cost curve. This is driven by scale, learning by doing, and specialization improvements associated with mass production. The role of the government is therefore to support the scale-up of technologies that are within reach of P3, and to provide supporting capabilities (e.g., technical standards) that spread best practices. This could sometimes mean subsidies to accelerate the adoption of new green technologies. However, these subsidies should be both time limited and provide just enough support to make a difference, while phasing out as the need declines. Mechanisms such as contracts for difference seem especially useful.[93] 3. Technologies not on the path to P3 (curve C).Some technologies will never reach P3. For example, blue hydrogen (which is dirty hydrogen plus the additional step of carbon capture) will never, by definition, reach P3 with dirty hydrogen. So, investments in blue hydrogen will never gain market traction without ongoing subsidies. In such cases, policy should seek to find alternative technologies. This may well require moving back upstream away from production and back into R&D. Box 10: Looking at Hydrogen Through the P3 lens. Hydrogen illustrates the usefulness of the P3 lens. Hydrogen can help decarbonize some difficult-to-reach industries. It could perhaps also become an important store of energy to handle long-term variations in renewable energy production. Additional uses have been hyped—for commercial and residential heating, or light vehicles—because hydrogen produced from renewable energy is zero polluting. But it is not zero cost, and for these additional applications, it is not likely to reach P3. Currently, production of green hydrogen costs ~6x high-pollution gray hydrogen. Blue hydrogen costs ~3x. We also know that blue hydrogen will never reach P3 with gray hydrogen because it is made using the gray hydrogen steam methane reforming or autothermal reforming process plus an additional step (carbon capture). Looking through the normal climate policy lens, blue hydrogen is a step forward, as it can replace much more polluting gray hydrogen, thus reducing emissions (if carbon capture works as advertised). But the P3 lens tells us that blue hydrogen’s role in the green transition is inherently limited, and in particular that it will never be a cost-effective element in a global transition. So while it can be used perhaps to develop new markets for hydrogen, or possibly with sufficient subsidies to help decarbonize some industries in the West, that comes at a significant cost (even in the West): the ongoing subsidies needed to fill the gap between the prices of gray and blue hydrogen. Highly subsidized blue hydrogen could also block the market entry of green hydrogen by offering a solution that’s price competitive (after substantial subsidies) and cleaner than gray hydrogen while being considerably cheaper and less supply constrained than green hydrogen. Through the P3 lens, though, green hydrogen is more promising, but at an earlier stage of development. Current costs are higher, but the costs of the key component (electrolyzers) will fall, and there will be scale and learning gains as well. IEA has estimated that green hydrogen will be cheaper than blue hydrogen by 2035, and will eventually reach $1\/kg, the approximate price of gray hydrogen. However, this is an estimate for the point of production, not the point of consumption. There is a long distance between the two, and it’s the delivered price and performance that matters to customers—and that’s a further challenge. Michael Liebreich, for example, has pointed out the immense difficulties in transporting hydrogen.[94] Thus we may still need transformative technologies to reach P3 even for green hydrogen., If we don’t invest in them, the much-anticipated hydrogen revolution could deflate like a punctured dirigible. Given the intrinsic uncertainty of innovation and energy markets, a smart policy would focus on both accelerating green hydrogen down its current cost curve while investing in transformative hydrogen technologies—and monitoring those cost curves very closely indeed. Any role for blue hydrogen should be carefully measured and assessed in terms of creating markets that will soon be filled by green hydrogen. It matters a lot whether hydrogen is on curve B or C. 4. Finally, there are sectors that simply cannot decarbonize (curve D). Aviation is perhaps the most prominent. Efforts to force the adoption of sustainable aviation fuel (SAF)—notably in the EU—will fail even in the West (see box 11). Battery-powered aviation is impractical beyond short-haul flights by smaller planes—a small fraction of total industry mileage. And while a new hydrogen-powered long-haul aviation sector is possible, the economics are beyond daunting, even if the technical and scale-up challenges could be met. Part of aviation’s climate impact could perhaps be mitigated by better routing and increased industry efficiency, as well as by solving the contrails problem (contrails reflect heat back toward the earth, and account for more than 50 percent of aviation’s impact on climate change).[95] But beyond that, policy should shift resources away from fruitless efforts to repeal the laws of physics and, toward sectors where success is possible. Box 11: Aviation Net Zero: No Path to P3 Aviation is responsible for 2.5 percent of global CO 2 emissions and 3.5 percent of global warming (when non-CO 2 climate impacts are considered).[96] The high energy density needed to power flight and the long lifespan of aircraft make the aviation industry especially challenging to decarbonize, while performance needs vary by market segment. Sustainable aviation fuel (SAF) is the most commercially advanced technology for decarbonization, and it can be used in existing aircraft without sacrificing performance. The most widely adopted pathway uses Hydroprocessed Esters and Fatty Acids (HEFA). This fuelis made from from waste cooking oils and fats, and is two to three times the cost of conventional jet fuel. It is severely supply constrained, because there are only limited sources and also competing uses.[97] Global SAF production totaled 80 million gallons in 2022, just over 0.1 percent of the production of standard jet aviation fuel (usually known as Jet-A).[98] The cost of producing HEFA fuel is unlikely to decrease significantly, as the feedstock is expensive to collect and is volume limited.[99] HEFA will therefore not be cost competitive with conventional jet fuel without very large subsidies for the forseeable future.[100] An alternative nascent pathway produces SAF from clean hydrogen and carbon. This approach is know as power to liquid, (PtL) or e-kerosene. This pathway does not face feedstock limitations, but prices are currently ~5x the price of Jet-A. Upwards of 70 percent of production costs stem from the cost of clean hydrogen. While thosxe may fall substantially in comping years, a hydrogen-driven aviation system would also require enormous investments in new planes (which likely would need to be completelty redesigned) as well as new ground facilities. The enormous P3 gap between jet-A and alternative fuels illustrated in figure 9, and the complete lack of realistic pathways to close that gap, means that regardless of scale economies, SAF cannot reach P3 within the foreseeable future. Facing this large P3 gap, the EU has recently proposed a blending mandate for SAF, requiring that airlines use a growing percentage of SAF despite its significantly higher costs. This regulatory-centric approach faces strong industry opposition, and countries outside the EU are unlikely to follow suit.[101] The EU approach shows that only force will drive the use of SAFs. EU thinking therefore seems muddled: On the one hand, the determination to drive use seems to suggest that SAF is on curve B where scale will eventually allow SAF to reach P3. But the weight of the regulations suggests that EU regulators know that SAF is on curve D, and they are simply determined to force adoption at any cost. This approach has some advantages, it is industry-wide regulation (in the EU at least), it is reasonably well hidden from the consumers, it doesn’t initially at least aadd too much cost to the overall cost sstructure of the industry, and it is imposed primarily on those who have more money than average (airline passengers). Perhaps the EU will be able to defend policies that load costs onto paasseners, but other countries will likely not follow suit. Aviation is therefore a difficult and discouraging case. It reflects our belief that some sectors simply cannot be decarbonized, and that aviation will be one of those sectors. But as the world decarbonizes, it won’t give aviation a pass, even if SAF fails. We therefore expect to see the gradual introduction of mandatory carbon mitigation programs (and related taxes) to eventually balance the carbon that is still emitted by aviation after other industries have gone green. Innovation is, as we noted earlier, inherently risky (though perhaps less risky than doing nothing), for both companies and countries. In this uncertain environment, P3 lights the path forward by focusing attention on what matters and what needs to be done. The power of the P3 lens lies in its unique ability to define a formal milestone for the end of the path. We know that the transition will work when the necessary technologies reach performance\/price parity with existing technologies. Without that, we are left with desperate measures to fake P3: subsidies, regulations, perhaps targeted public procurement, plaintive calls to virtue, and eventually geoengineering and other remediation strategies. The problem then lies not in the mechanisms—all mechanisms have a place. The problem lies in the substitution of mechanisms for the endpoint, the milestone we must reach. By identifying specific P3 milestones for specific technologies, we can understand the key barriers and challenges that must be overcome if each milestone is to be reached. Mechanisms can help to do that—supporting the supply side when the market isn’t there yet, building infrastructure, and even seeding end use. It can all contribute, but only if the P3 goal is clear and the milestones along the way toward that specific objective for each technology and sector are clearly marked. Thus, a key task for rich-nation governments is to conduct thorough assessments of the wide range of technologies being supported to get a clearer sense of whether they are curve C or curve B technologies—as the appropriate policy packages are quite different—and where there may be no feasible path to decarbonization (curve D). Of course, despite the potential power of the P3 lens, it is much easier to call for the P3 approach than it is to implement it. Some of the more important pitfalls are outlined in box 12. But despite challenges, the P3 lens is the only way to reach a market-based green transition—and only a market-based transition will work for low-income countries as well as most of the rich countries and hence for all of us. Box 12: P3 Pitfalls to Avoid The P3 framework is powerful. As we have explained, it’’s central to effective policy and hence to a successful green transition. But it’’s not easy, as common pitfalls can derail the use of the P3 lens: 1. Delivery, not production. It’’s easy to focus on the cost of energy production, partly because it’’s simpler and partly because the data are more easily available. Energy is typically produced at a large scale and under tight-enough regulation that wholesale production prices are easy to identify. But it is the price to the user that matters, not the price of production, and that’’s much more difficult to figure out and varies across a wide spectrum of specific circumstances. That delivered price reflects the entire value chain, not just production. Reaching P3 for delivered energy means that, collectively, all components of the system must reach P3 without subsidies. 2. Differences between new and old. Typically, new production plants have cost advantages over existing plants. New plants use the latest technology, can sometimes be sited in ways that are newly advantageous (e.g., near delivery infrastructure or an end user), and may benefit from declining component costs. But old plants have advantages as well. Critically, the capital cost of the plant (CAPEX) may have been completely amortized over time, giving the plant substantial cost-structure advantages, while old plant production has likely been optimized. So the P3 lens must address these distinctions, and policies should seek to ensure that the old is not allowed to use incumbency to defeat the new. 3. Sensitivity analysis. P3 analysis is complex and often highly sensitive to a wide range of variables, as changes in the price or availability of key inputs or components, for example, can dramatically change the economics of a proposed project. For instance, blue hydrogen is highly sensitive to the cost of natural gas, which can be very volatile. P3 must therefore include sensitivity analysis as well.[103] 4. Performance, not just price. It’’s tempting to focus on the price of commodities such as energy and simply assume that performance is standard or at least fungible. This is not always the case, though. Performance includes the technical capability of the product—for example, petroleum is sold at various purity levels for different uses. But “performance” also includes less-standardized characteristics such as availability, delivery time, reliability, and storability. Performance is central to P3 analysis—and, in particular, helps bring distribution issues into the analysis 5. Monitoring and review. Given the complexities, it’’s tempting to be one and done—to do a comprehensive P3 analysis and assume that it will suffice for a considerable period. However, that may not be the case—and energy policies cannot be locked into outdated models. Fortunately, DOE has committed to a living document approach, as the recent commercialization pathways published by DOE for three sectors are explicitly designed to remain under regular review.[104] 6. The analogies trap. The cost of solar power has declined by 85 percent in the past decade.[105] This seems similar to (and is partly based on) the remarkable and sustained improvement in P3 for semiconductors (following Moore’s Law). But P3 improvements are driven by specific innovations and the capacity to scale effectively. Arguing by analogy that P3 for green technologies will necessarily follow Moore’s Law for semiconductors—or that other technologies such as electrolysis or nuclear will follow this pathway—is a dangerous form of magical thinking. Only detailed sector-specific analysis, using carefully constructed scenarios, can support such critically important conclusions. The P3 lens helps us both at the macro level and in the detailed understanding of green pathways. Resources are inevitably finite, especially government resources. So, making good calls about which technologies to back is critical. The P3 lens helps us see which technologies to prioritize and which require further development. It also allows us to explore the most efficient way to get the GHG reductions we need, and to avoid expensive investments in dead-end options. That helps us make the right strategic choices amid multiple potential options. Important conclusions follow from the arguments above, and many will be explored in more detail in a subsequent series of Information Technology and Innovation Foundation (ITIF) papers. The most important is that climate policy needs a fundamental overhaul. Over the last two decades at least, virtually the entire climate policy discussion has been centered around force rather than getting to P3 and then letting markets do the heavy lifting. We argue that the P3 lens should be brought to bear on every climate policy. And if there is a reasonable risk that force cannot achieve P3in a particular technology\/application, policymakers must quickly focus significant resources on the RD&D needed to support transformative innovation. Indeed, the goal should not be net zero by 2050, but rather to reach P3 for multiple technologies on a global basis (especially in low-income countries) well before 2050. Bearing these core arguments in mind, we know the following: 1. The P3 imperative. Getting as close to P3 as possible, as quickly as possible, should remain the primary driver of policy. That’s because climate change is global, so solutions must be tuned, in particular, to the needs of big low-income countries where market levers will be absolutely central. So, every climate policy must answer the basic question: is that policy the best way to get to P3 for that technology\/sector? Answering that question requires a much-expanded framework for analysis. The existing TRL model is good for capturing development toward the market but is no help beyond that. 2. Missing technologies. It is a mistake to believe that we have all the technologies we need to complete the green transition. Some existing technologies will fully address GHG emissions, but cannot compete at current price\/performance levels even in the United States, let alone globally. In other areas, for example nuclear and biotech, we need fundamentally new technologies. And it’s not whether a technology works that matters, it’s whether it delivers at P3. That means we need a clean technology policy portfolio focused on a wider array of technologies, including high-risk, high-reward technology solutions. 3. What matters is P3 for energy delivered to the end user, not just P3 for energy at the point of production. Many distribution challenges, for example, grow as scale expands (e.g., electrification of vehicles will soon require radical expansion of the electric grid), and the markets that matter are at the user end of the supply chain. So, policy should not focus too tightly on the price of energy at the point of production. 4. Mechanisms. We will not subsidize, regulate, or exhort our way to parity. But there will be important roles for both regulation and subsidies. Especially as technologies get near P3, subsidies, regulations, and carbon taxes can sometimes help get us there by seeding markets, creating scale through standardization, and encouraging deployment—all of which can help move technologies along curve B. But by far the biggest global lever is the market, and P3 is the key to unlock it. 5. Innovation remains critical. In many sectors and for many technologies, it won’t be enough to move down the cost curve as scale grows, as that curve will never reach P3. And so, despite the urgency to accelerate the green transition, we must not starve better technologies—currently further upstream of the market—of R&D funding and support. In many cases, we must find transformative technologies that will shift the entire cost curve downward, not just help production move down it. Finally, it’s important to consider the possibility that it might be impossible to get to P3 for all needed solutions. After all, there are likely to be realities grounded in physics that cannot be overcome. The history of technological innovation suggests that human ingenuity finds a way past what were considered insurmountable barriers. But maybe this time is indeed different, at least in some sectors and for some technologies. If that is the case, there are only three choices. First, higher-income countries could step up and pay to capture and sequester the remaining carbon emissions. It makes little sense to expect lower-income countries to do that. It could be an expensive option, but it’s likely to be needed. Many climate advocates reject CCS altogether because they prefer a world in which renewables work and fossil fuels are unnecessary. It’s unfortunate that our world is not that world.[106] Second, climate impacts could become so severe that political pressure mount enough so that even low-income countries take action. We are a long way from that happening, in part because of the free-rider problem, and it will almost certainly come too late, but it is possible. Third, governments could decide that the best we can do is some reduction in emissions, and to switch the primary focus toward climate mitigation: reducing damage from climate impacts. That, however, is not a solution for a specific sector, and seems equally unlikely. These are all possibilities, but before considering adopting them, the planet deserves a full-scale and focused attempt to get to P3. The P3 lens demands that we pay attention to the details, that we differentiate the needs and conditions of various specific technologies and sectors and their production and commercialization pathways. Differentiating between technologies that are on different curves toward P3 will be at the same time difficult and mandatory, but we need those sector- and technology-specific transition strategies to achieve a low-carbon world. We will need to be honest about what we know and where there is uncertainty. We must specifically focus on end-use markets rather than the cost of production. And we should tailor our policy packages to technologies at very different places, all while extending our understanding of how to make the critically important distinctions that should drive policy. It’s a tall order, but it is doable—and, as we have shown, it is the only realistic path to the green transition. Acknowledgments The authors wish to thank Hannah Boyles for research on the India and Aviation boxes and for help with formatting and references. We thank Stefan Koester for research on the Political Failures of Force and Scale boxes. Kayleen Schreiber provided help with graphics for which we are grateful. Randolph Court and Alex Ambrose provided their expertise on editing, for which we are also grateful. About the Authors Dr. Robin Gaster is president of Incumetrics Inc. and a visiting scholar at George Washington University. Dr. Gaster’s primary interests lie in climate, economic innovation policy, metrics, and assessment. He has worked extensively on innovation and small business, regional economic development, transformation in education, and the rise of the big technology companies. He serves as a nonresident senior fellow at ITIF’s Center for Clean Energy Innovation. Dr. Robert D. Atkinson (@RobAtkinsonITIF) is the founder and president of ITIF. His books include Big Is Beautiful: Debunking the Myth of Small Business (MIT, 2018), Innovation Economics: The Race for Global Advantage (Yale, 2012), Supply-Side Follies: Why Conservative Economics Fails, Liberal Economics Falters, and Innovation Economics Is the Answer (Rowman Littlefield, 2007), and The Past and Future of America’s Economy: Long Waves of Innovation That Power Cycles of Growth (Edward Elgar, 2005). Atkinson holds a Ph.D. in city and regional planning from the University of North Carolina, Chapel Hill. Ed Rightor is a consultant focusing on decarbonization and sustainability. His work in both industry and nonprofit programs focuses on reducing energy use, greenhouse gas emissions, and water and waste impacts in the manufacturing sector. He was previously director of ITIF's Center for Clean Energy Innovation. About ITIF The Information Technology and Innovation Foundation (ITIF) is an independent 501(c)(3) nonprofit, nonpartisan research and educational institute that has been recognized repeatedly as the world’s leading think tank for science and technology policy. Its mission is to formulate, evaluate, and promote policy solutions that accelerate innovation and boost productivity to spur growth, opportunity, and progress. For more information, visit itif.org\/about.","filter_flag":1}
{"title":"NextEra Energy Resources and Sysco collaborate to develop plan to reduce the foodservice leader's carbon emissions ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMisgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25leHRlcmEtZW5lcmd5LXJlc291cmNlcy1hbmQtc3lzY28tY29sbGFib3JhdGUtdG8tZGV2ZWxvcC1wbGFuLXRvLXJlZHVjZS10aGUtZm9vZHNlcnZpY2UtbGVhZGVycy1jYXJib24tZW1pc3Npb25zLWF0LXNjYWxlLTMwMTg3NjE5My5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMisgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25leHRlcmEtZW5lcmd5LXJlc291cmNlcy1hbmQtc3lzY28tY29sbGFib3JhdGUtdG8tZGV2ZWxvcC1wbGFuLXRvLXJlZHVjZS10aGUtZm9vZHNlcnZpY2UtbGVhZGVycy1jYXJib24tZW1pc3Npb25zLWF0LXNjYWxlLTMwMTg3NjE5My5odG1s0gEA?oc=5","id":"CBMisgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25leHRlcmEtZW5lcmd5LXJlc291cmNlcy1hbmQtc3lzY28tY29sbGFib3JhdGUtdG8tZGV2ZWxvcC1wbGFuLXRvLXJlZHVjZS10aGUtZm9vZHNlcnZpY2UtbGVhZGVycy1jYXJib24tZW1pc3Npb25zLWF0LXNjYWxlLTMwMTg3NjE5My5odG1s0gEA","guidislink":false,"published":"Thu, 13 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=194, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMisgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25leHRlcmEtZW5lcmd5LXJlc291cmNlcy1hbmQtc3lzY28tY29sbGFib3JhdGUtdG8tZGV2ZWxvcC1wbGFuLXRvLXJlZHVjZS10aGUtZm9vZHNlcnZpY2UtbGVhZGVycy1jYXJib24tZW1pc3Npb25zLWF0LXNjYWxlLTMwMTg3NjE5My5odG1s0gEA?oc=5\" target=\"_blank\">NextEra Energy Resources and Sysco collaborate to develop plan to reduce the foodservice leader's carbon emissions ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"NextEra Energy Resources and Sysco collaborate to develop plan to reduce the foodservice leader's carbon emissions ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMisgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25leHRlcmEtZW5lcmd5LXJlc291cmNlcy1hbmQtc3lzY28tY29sbGFib3JhdGUtdG8tZGV2ZWxvcC1wbGFuLXRvLXJlZHVjZS10aGUtZm9vZHNlcnZpY2UtbGVhZGVycy1jYXJib24tZW1pc3Npb25zLWF0LXNjYWxlLTMwMTg3NjE5My5odG1s0gEA?oc=5\" target=\"_blank\">NextEra Energy Resources and Sysco collaborate to develop plan to reduce the foodservice leader's carbon emissions ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"JUNO BEACH, Fla. and HOUSTON, July 13, 2023 \/PRNewswire\/ -- Through an agreement announced today, NextEra Energy Resources, LLC, the world's largest generator of renewable energy from the wind and sun, a world leader in battery storage and a driving force in the development of the green hydrogen economy, will work to develop tailored solutions to support Sysco Corporation, the global leader in foodservice distribution, reduce their carbon footprint. Sysco's science-based climate goal aims to lower Scope 1 and 2 emissions by 27.5% by 2030. An important element of the company's plans includes sourcing 100% renewable energy for its global operations. As a pioneer with over 25 years of experience in renewable energy, NextEra Energy Resources is uniquely positioned to develop a customized strategy to help Sysco achieve this goal. \"A fundamental way we are progressing our goal of leading the decarbonization of the U.S. economy is by working hand in hand with commercial and industrial companies to help them achieve their decarbonization goals,\" said NextEra Energy Resources president & CEO, Rebecca Kujawa. \"We are honored that Sysco has selected NextEra Energy Resources to work with them to develop sustainable solutions to benefit not only their operations but also the many industries that rely on their products.\" \"Collaboration with great partners is a critical element of Sysco's journey to reach our climate goals by 2030,\" said Neil Russell, Sysco chief administrative officer. \"As the largest foodservice company in the world, we're excited to work with NextEra Energy Resources; they are the right partner to help us achieve our renewable energy goal at scale and ensure we meet the urgency that climate change demands.\" Leading the charge in cutting-edge decarbonization products, NextEra Energy Resources leverages its industry expertise to develop and deploy tailor-made carbon reduction strategies for a sustainable future. Under the agreement, NextEra Energy Resources expects to develop, implement and finance a customized suite of solutions including large scale renewable energy projects, on-site renewable generation, retail renewables, reliability infrastructure and active energy management services. \"We know that every company is going to have a unique decarbonization journey, and one size will not fit all,\" said Elena Bueno-Gonzalez, vice president of Clean Energy Solutions at NextEra Energy Resources. \"With this in mind, our team collaborates with our customers to understand their business and goals and then craft customized solutions for their specific needs.\" The agreement bolsters the companies' shared commitment to decarbonization and paves the way for a cleaner and more sustainable future. About NextEra Energy Resources NextEra Energy Resources, LLC (together with its affiliated entities, \"NextEra Energy Resources\") is a clean energy leader and is one of the largest wholesale generators of electric power in the U.S., with approximately 27,400 megawatts of total net generating capacity, primarily in 40 states and Canada as of year-end 2022. NextEra Energy Resources is the world's largest generator of renewable energy from the wind and sun, a world leader in battery storage and is driving the development of the green hydrogen economy. The business operates clean, emissions-free nuclear power generation facilities in New Hampshire and Wisconsin as part of the NextEra Energy nuclear fleet. NextEra Energy Resources offers a wide range of clean energy solutions to help businesses and customers across the country meet their emissions reduction goals. NextEra Energy Resources, LLC is a subsidiary of Juno Beach, Florida-based NextEra Energy, Inc. (NYSE: NEE). For more information, visit www.NextEraEnergyResources.com. About Sysco Corporation Sysco is the global leader in selling, marketing and distributing food products to restaurants, healthcare and educational facilities, lodging establishments and other customers who prepare meals away from home. Its family of products also includes equipment and supplies for the foodservice and hospitality industries. With more than 71,000 colleagues, the company operates 333 distribution facilities worldwide and serves approximately 700,000 customer locations. For fiscal year 2022 that ended July 2, 2022, the company generated sales of more than $68 billion. Information about our Sustainability program, including Sysco's 2022 Sustainability Report and 2022 Diversity, Equity & Inclusion Report, can be found at www.sysco.com. For more information, visit www.sysco.com or connect with Sysco on Facebook at www.facebook.com\/SyscoFoods. For important news and information regarding Sysco, visit the Investor Relations section of the company's Internet home page at investors.sysco.com, which Sysco plans to use as a primary channel for publishing key information to its investors, some of which may contain material and previously non-public information. In addition, investors should continue to review our news releases and filings with the SEC. It is possible that the information we disclose through any of these channels of distribution could be deemed to be material information. SOURCE NextEra Energy Resources, LLC; Sysco Corporation","filter_flag":1}
{"title":"Kohler Co. Outlines Strategy, Ambitions, and Progress in 2022 ESG Report - Contractor Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5jb250cmFjdG9ybWFnLmNvbS9iYXRoLWtpdGNoZW4vYXJ0aWNsZS8yMTI2OTU1MS9rb2hsZXItY28tb3V0bGluZXMtc3RyYXRlZ3ktYW1iaXRpb25zLWFuZC1wcm9ncmVzcy1pbi0yMDIyLWVzZy1yZXBvcnTSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5jb250cmFjdG9ybWFnLmNvbS9iYXRoLWtpdGNoZW4vYXJ0aWNsZS8yMTI2OTU1MS9rb2hsZXItY28tb3V0bGluZXMtc3RyYXRlZ3ktYW1iaXRpb25zLWFuZC1wcm9ncmVzcy1pbi0yMDIyLWVzZy1yZXBvcnTSAQA?oc=5","id":"CBMigQFodHRwczovL3d3dy5jb250cmFjdG9ybWFnLmNvbS9iYXRoLWtpdGNoZW4vYXJ0aWNsZS8yMTI2OTU1MS9rb2hsZXItY28tb3V0bGluZXMtc3RyYXRlZ3ktYW1iaXRpb25zLWFuZC1wcm9ncmVzcy1pbi0yMDIyLWVzZy1yZXBvcnTSAQA","guidislink":false,"published":"Thu, 13 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=194, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5jb250cmFjdG9ybWFnLmNvbS9iYXRoLWtpdGNoZW4vYXJ0aWNsZS8yMTI2OTU1MS9rb2hsZXItY28tb3V0bGluZXMtc3RyYXRlZ3ktYW1iaXRpb25zLWFuZC1wcm9ncmVzcy1pbi0yMDIyLWVzZy1yZXBvcnTSAQA?oc=5\" target=\"_blank\">Kohler Co. Outlines Strategy, Ambitions, and Progress in 2022 ESG Report<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Contractor Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Kohler Co. Outlines Strategy, Ambitions, and Progress in 2022 ESG Report - Contractor Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5jb250cmFjdG9ybWFnLmNvbS9iYXRoLWtpdGNoZW4vYXJ0aWNsZS8yMTI2OTU1MS9rb2hsZXItY28tb3V0bGluZXMtc3RyYXRlZ3ktYW1iaXRpb25zLWFuZC1wcm9ncmVzcy1pbi0yMDIyLWVzZy1yZXBvcnTSAQA?oc=5\" target=\"_blank\">Kohler Co. Outlines Strategy, Ambitions, and Progress in 2022 ESG Report<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Contractor Magazine<\/font>","source.href":"https:\/\/www.contractormag.com","source.title":"Contractor Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"KOHLER, WI – Kohler Co. released its 2022 Environmental, Social and Governance (ESG) report with key metrics of the company’s Believing in Better philosophy outlining ambitions and progress across environmental sustainability; diversity, equity and inclusion (DEI); and social impact initiatives. “Over the past year, we made substantial progress advancing Kohler’s environmental sustainability, DEI, and social impact strategies. We established targets for relevant Scope 3 emissions, conducted a climate risk assessment, and continued to innovate new products that conserve water and materials,” says David Kohler, Chair and CEO, Kohler Co. “We increased investment in Kohler WasteLAB to advance the company’s circularity strategy and acquired businesses like Heila Technologies and Curtis Instruments to strengthen our clean energy offerings.” In 2022, Kohler intensified the operationalization of its environmental practices around energy, water, and waste; continued to advance its diversity hiring; engaged more associates to give back to their communities; and expanded programs and partnerships that positively impact lives through arts, education, health, and wellbeing support. Highlights From the 2022 Report: GHG, water, and waste intensity reductions : Achieved 16% reduction in GHG emissions, 10 percent reduction for water, and 23 percent reduction in waste, respectively Global operational energy use intensity reduction : Saw a 41% reduction since 2008, an increase from 30 percent in 2021 Water savings and products : Contributed 88 billion gallons of water saved in 2022, and over 560 billion gallons saved since 2007, with Kohler WaterSense-labeled products Diverse hiring : Exceeded 2022 goal for diverse hiring with 53 percent of new hires, permanent and exempt, in the US representing diverse backgrounds Associate engagement: Hosted over 300 associate-led global community engagement activities, up from 80 in 2021, and increased the number of Business Resource Groups (BRGs) available to associates to 10 – including Bold Ability (creating a disability friendly workplace) and ARK (Asian Resources of Kohler) Lives impacted: Positively impacted over 1 million lives in 2022 and more than 17.1 million since 1990 through Kohler Safe Water for All, educational, and arts and industries programs Innovative, Inclusive, Sustainable “We’re proud of the progress we’ve made to bring more innovative, inclusive, and environmentally sustainable solutions to more people, in addition to providing safe water and sanitation for communities that lack equitable access,” says Laura Kohler, Chief Sustainability and DEI Officer. “Our passionate associates and leadership are integrating our Believing in Better philosophy into business strategies and operations which generates ideas and actions for improvement across the organization.” In 2022, Kohler also expanded its efforts to promote energy resiliency and resource conservation, as well as innovations in renewable and clean energy solutions. Kohler Kitchen and Bath continued to lead in U.S. EPA WaterSense-labeled offering by certifying 85 new products across toilets, bathroom faucets and showerheads. Continued expansion of global EPD and Declare label product transparency offerings. The company’s in house innovation incubator for products with a social purpose, Innovation for Good, launched a porcelain pour flush toilet (Kohler Rinse) for communities without access to piped water and electricity. Kohler’s subsidiary, Mira, launched HeatCapture™ which is a double wall stainless steel heat exchanger to help specifiers and new build developers in the UK comply with new reduced emissions regulations. Meanwhile, Kohler’s Clarke Energy was part of a consortium that won the 2022 Water Breakthrough Challenge sponsored by Ofwat to support the demonstration of an innovative carbon capture and conversion system at the Severn Trent wastewater treatment site in England. Additionally, Kohler partnered with Polar explorer Robert Swan on his excursion through Antarctica to the Geographic South Pole where he relied only on renewable energy sources. Kohler equipped him with a customized KOHLER generator that utilized a KOHLER diesel engine fueled by hydrotreated vegetable oil (HVO). The off-grid sustainable system provided the energy needed to operate Swan's base camp and provide battery charge to his mobile equipment. To read more on Kohler’s progress and impact, you can access the 2022 ESG Report here: https:\/\/www.kohlercompany.com\/social-impact\/believing-in-better\/","filter_flag":1}
{"title":"Kohler Launches Limited-Edition Heritage Colors Collection in Spring Green and Peachblow - Yahoo Finance","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9rb2hsZXItbGF1bmNoZXMtbGltaXRlZC1lZGl0aW9uLWhlcml0YWdlLTE2NDEwMDMyMS5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9rb2hsZXItbGF1bmNoZXMtbGltaXRlZC1lZGl0aW9uLWhlcml0YWdlLTE2NDEwMDMyMS5odG1s0gEA?oc=5","id":"CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9rb2hsZXItbGF1bmNoZXMtbGltaXRlZC1lZGl0aW9uLWhlcml0YWdlLTE2NDEwMDMyMS5odG1s0gEA","guidislink":false,"published":"Tue, 25 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=206, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9rb2hsZXItbGF1bmNoZXMtbGltaXRlZC1lZGl0aW9uLWhlcml0YWdlLTE2NDEwMDMyMS5odG1s0gEA?oc=5\" target=\"_blank\">Kohler Launches Limited-Edition Heritage Colors Collection in Spring Green and Peachblow<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Kohler Launches Limited-Edition Heritage Colors Collection in Spring Green and Peachblow - Yahoo Finance","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9rb2hsZXItbGF1bmNoZXMtbGltaXRlZC1lZGl0aW9uLWhlcml0YWdlLTE2NDEwMDMyMS5odG1s0gEA?oc=5\" target=\"_blank\">Kohler Launches Limited-Edition Heritage Colors Collection in Spring Green and Peachblow<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance<\/font>","source.href":"https:\/\/finance.yahoo.com","source.title":"Yahoo Finance","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Designers Justina Blakeney and Jonathan Adler Showcase the Vibrant New Products KOHLER, Wis., July 25, 2023 \/PRNewswire\/ -- In honor of the company's 150th anniversary, Kohler has officially launched the Heritage Colors Collection featuring vintage Spring Green and Peachblow colors on select kitchen and bath products now available for purchase. The Heritage Colors Collection showcases Kohler's design leadership and celebrates the dynamic use of color as an innovative movement within the global company's iconic legacy. Kohler Farmstead Kitchen sink in Peachblow Kohler first introduced vibrant, colorful products in 1927 to great acclaim and inspired turn-of-the-century America to look beyond the utilitarian white fixtures of the day. The bold colorful products created a cataclysmic shift within residential design bringing warmth and personality into the home – and gracious living into everyday life. To help celebrate the launch, color authorities and renowned designers Justina Blakeney and Jonathan Adler each showcase their own unique style and creativity by designing inspirational bathroom spaces with Heritage Colors Collection products. Known for creating vibrant rooms full of life, Justina and Jonathan demonstrate how color can be incorporated into the home to help accentuate personal style when designing kitchen and bath spaces. View the bathrooms here. The exclusive Heritage Colors Collection features a variety of signature KOHLER products in Spring Green (1927) inspired by the blue-green waters of a cool northern spring, and Peachblow (1934) an original pastel that can be a standout as well as a complementary natural tone: Artifacts® Freestanding Bath with Heritage Colors Exterior, White Interior and Claw Feet available in Heritage Color-matched hues Brockway® Kitchen Sink with Heritage Colors Exterior and White Enamel Interior Farmstead® Kitchen Sink with Heritage Colors Exterior, White Enamel Interior and Heritage Color-matched Legs Memoirs® Two-Piece Concealed Toilet Memoirs® 30\" Pedestal Lavatory or Console Table San Souci® One-Piece Skirted Toilet Vox® Rectangular Vessel The products are available for a limited time through Kohler.com, Kohler Signature Stores, Kohler Experience Centers, and Kohler registered showrooms nationwide. For more information, visit www.kohler.com\/forever-in-color. About Kohler Co. Founded in 1873 and headquartered in Kohler, Wisconsin, Kohler Co. is one of America's oldest and largest privately held companies comprised of more than 40,000 associates. With more than 50 manufacturing locations worldwide, Kohler is a global leader in the design, innovation and manufacture of kitchen and bath products; luxury cabinetry, tile and lighting; engines, generators, and clean energy solutions; and owner\/operator of two, five-star hospitality and golf resort destinations in Kohler, Wisconsin, and St. Andrews, Scotland. Kohler's Whistling Straits golf course recently hosted the 43rd Ryder Cup in 2021. The company also develops solutions to address pressing issues, such as clean water and sanitation, for underserved communities around the world to enhance the quality of life for current and future generations. For more details, please visit KohlerCompany.com. Story continues Media Contact Jillian Rosone Kohler Public Relations Jillian.Rosone@kohler.com Kohler Farmstead Kitchen sink in Spring Green Cision View original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/kohler-launches-limited-edition-heritage-colors-collection-in-spring-green-and-peachblow-301885382.html SOURCE Kohler Co.","filter_flag":1}
{"title":"Qcells maintains No. 1 position in both U.S. residential & commercial solar market segments - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3FjZWxscy1tYWludGFpbnMtbm8tMS1wb3NpdGlvbi1pbi1ib3RoLXVzLXJlc2lkZW50aWFsLS1jb21tZXJjaWFsLXNvbGFyLW1hcmtldC1zZWdtZW50cy0zMDE4NjgxMjEuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3FjZWxscy1tYWludGFpbnMtbm8tMS1wb3NpdGlvbi1pbi1ib3RoLXVzLXJlc2lkZW50aWFsLS1jb21tZXJjaWFsLXNvbGFyLW1hcmtldC1zZWdtZW50cy0zMDE4NjgxMjEuaHRtbNIBAA?oc=5","id":"CBMijwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3FjZWxscy1tYWludGFpbnMtbm8tMS1wb3NpdGlvbi1pbi1ib3RoLXVzLXJlc2lkZW50aWFsLS1jb21tZXJjaWFsLXNvbGFyLW1hcmtldC1zZWdtZW50cy0zMDE4NjgxMjEuaHRtbNIBAA","guidislink":false,"published":"Mon, 03 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=184, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3FjZWxscy1tYWludGFpbnMtbm8tMS1wb3NpdGlvbi1pbi1ib3RoLXVzLXJlc2lkZW50aWFsLS1jb21tZXJjaWFsLXNvbGFyLW1hcmtldC1zZWdtZW50cy0zMDE4NjgxMjEuaHRtbNIBAA?oc=5\" target=\"_blank\">Qcells maintains No. 1 position in both U.S. residential & commercial solar market segments<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Qcells maintains No. 1 position in both U.S. residential & commercial solar market segments - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3FjZWxscy1tYWludGFpbnMtbm8tMS1wb3NpdGlvbi1pbi1ib3RoLXVzLXJlc2lkZW50aWFsLS1jb21tZXJjaWFsLXNvbGFyLW1hcmtldC1zZWdtZW50cy0zMDE4NjgxMjEuaHRtbNIBAA?oc=5\" target=\"_blank\">Qcells maintains No. 1 position in both U.S. residential & commercial solar market segments<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"The latest U.S. PV Leaderboard Report issued by Wood Mackenzie Power & Renewables solidifies Qcells as a leading choice for solar panels. With the Q1 2023 results available, Qcells continues to hold these No.1 market share positions, while offering popular turnkey solutions for the residential, commercial, and utility sectors. SAN FRANCISCO, July 3, 2023 \/PRNewswire\/ -- Qcells, a dominant provider in complete energy solutions, continues to lead the solar industry in both U.S. residential and commercial markets, according to a recent report issued by Wood Mackenzie, a leading energy research and consultancy firm. According to Wood Mackenzie's U.S. PV Leaderboard Report for Q2 2023 (the \"Leaderboard Report\"), Qcells obtained 35 percent market share in the U.S. residential solar module market for Q1 2023, marking 15 consecutive quarters occupying No.1. Over one-third of U.S. households that installed solar in Q1 2023 used Qcells panels, meaning the company has set a new record for the highest market share by an individual supplier over the past ten years. The Leaderboard Report also ranks Qcells as the U.S. commercial market leader with 35.3 percent market share for Q1 2023. Qcells has held this No.1 position in the commercial segment for more than four years. Qcells is set to maintain its leading market performance in the U.S. by making a significant investment of over $2.5 billion to establish a comprehensive solar supply chain within the country. The recent announcement marks the largest investment in the history of American solar and sets Qcells up as the only company in the U.S. to establish a fully integrated, silicon-based solar supply chain from raw material to finished panel. Alongside its capacity expansion plans, Qcells has achieved significant milestones in developing turnkey energy solutions for the residential, commercial, and utility sectors, demonstrating its commitment to serving diverse customers' needs across three segments. Qcells is pursuing the Electronic Product Environmental Assessment Tool (EPEAT) ecolabel for some of our solar panels. EPEAT is a globally recognized, voluntary label that helps purchasers identify low-carbon solar panels and inverters. Such ecolabels allow customers to confidently partner with solar manufacturers like Qcells, who are committed to being a leader in sustainability and reducing the solar industry's climate footprint. Qcells CEO Justin Lee said: \"Qcells stands by the quality of its products and is proud that our customers agree that we're a reliable choice for solar. We are building a company that wants to go above and beyond for our customers, making it easy for them to take advantage of the clean energy technology that is affordable, reliable, and sustainable.\" About Qcells Qcells is one of the world's leading clean energy companies, recognized for its established reputation as a manufacturer of high-performance, high-quality solar cells and modules, portfolio of intelligent storage systems, and growing international pipeline of large-scale renewable energy projects. Qcells also provides renewable electricity retail services and packages to end customers the world over. The company is headquartered in Seoul, South Korea (Global Executive HQ) with its diverse international manufacturing facilities in the U.S., Malaysia, China, and South Korea. Qcells offers Completely Clean Energy through the full spectrum of photovoltaic products, storage solutions, renewable electricity contracting and large-scale solar power plants. Through its growing global business network spanning North America, Europe, Asia, South America, Africa and the Middle East, Qcells provides excellent services and long-term partnerships to its customers in the utility, commercial, governmental and residential markets. For more information, visit: https:\/\/qcells.com\/us\/ Safe-Harbor Statement This press release contains forward-looking statements. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates\" and similar statements. Among other things, the quotations from management in this press release and Qcells' operations and business outlook, contain forward-looking statements. Such statements involve certain risks and uncertainties that could cause actual results to differ materially from those expressed in or suggested by the forward-looking statements. Except as required by law, Qcells does not undertake any obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Leaderboard Report Disclaimer The data and information provided by Wood Mackenzie should not be interpreted as advice and you should not rely on it for any purpose. You may not copy or use this data and information except as expressly permitted by Wood Mackenzie in writing. To the fullest extent permitted by law, Wood Mackenzie accepts no responsibility for your use of this data and information except as specified in a written agreement you have entered with Wood Mackenzie for the provision of such of such data and information. SOURCE Hanwha Q CELLS America Inc.","filter_flag":1}
{"title":"Risen Energy Signs 1GW HJT Module Supply Agreement with Athein - Canada NewsWire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3Lm5ld3N3aXJlLmNhL25ld3MtcmVsZWFzZXMvcmlzZW4tZW5lcmd5LXNpZ25zLTFndy1oanQtbW9kdWxlLXN1cHBseS1hZ3JlZW1lbnQtd2l0aC1hdGhlaW4tODQ0Mjg4MzYzLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3Lm5ld3N3aXJlLmNhL25ld3MtcmVsZWFzZXMvcmlzZW4tZW5lcmd5LXNpZ25zLTFndy1oanQtbW9kdWxlLXN1cHBseS1hZ3JlZW1lbnQtd2l0aC1hdGhlaW4tODQ0Mjg4MzYzLmh0bWzSAQA?oc=5","id":"CBMic2h0dHBzOi8vd3d3Lm5ld3N3aXJlLmNhL25ld3MtcmVsZWFzZXMvcmlzZW4tZW5lcmd5LXNpZ25zLTFndy1oanQtbW9kdWxlLXN1cHBseS1hZ3JlZW1lbnQtd2l0aC1hdGhlaW4tODQ0Mjg4MzYzLmh0bWzSAQA","guidislink":false,"published":"Mon, 03 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=184, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3Lm5ld3N3aXJlLmNhL25ld3MtcmVsZWFzZXMvcmlzZW4tZW5lcmd5LXNpZ25zLTFndy1oanQtbW9kdWxlLXN1cHBseS1hZ3JlZW1lbnQtd2l0aC1hdGhlaW4tODQ0Mjg4MzYzLmh0bWzSAQA?oc=5\" target=\"_blank\">Risen Energy Signs 1GW HJT Module Supply Agreement with Athein<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Risen Energy Signs 1GW HJT Module Supply Agreement with Athein - Canada NewsWire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3Lm5ld3N3aXJlLmNhL25ld3MtcmVsZWFzZXMvcmlzZW4tZW5lcmd5LXNpZ25zLTFndy1oanQtbW9kdWxlLXN1cHBseS1hZ3JlZW1lbnQtd2l0aC1hdGhlaW4tODQ0Mjg4MzYzLmh0bWzSAQA?oc=5\" target=\"_blank\">Risen Energy Signs 1GW HJT Module Supply Agreement with Athein<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","source.href":"https:\/\/www.newswire.ca","source.title":"Canada NewsWire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"NINGBO, China, July 3, 2023 \/CNW\/ -- Risen Energy Co., Ltd., a leading vertically integrated solar company, has signed a supply agreement with Athein Holding Pte Ltd, an independent power producer (IPP) platform company incorporated in Singapore. The agreement will see Risen Energy provide up to 1 GWp of cutting-edge Heterojunction with Intrinsic Thin layer (HJT) photovoltaic modules to Athein Holding Pte Ltd, a move that cements Risen Energy's position as a leader in HJT technology and renewable energy innovation. Signing Ceremony As an IPP platform company, Athein Holding Pte Ltd has a critical role in driving the development of renewable energy infrastructure in Southeast Asia and India. Through this venture, Risen Energy will contribute to Athein Holding Pte Ltd's mission to acquire, develop, build, and operate utility-scale and rooftop solar projects in these regions. This strategic agreement demonstrates Risen Energy's commitment to driving the development of clean energy solutions worldwide and aligns perfectly with the company's vision of creating a sustainable future for all. HJT technology is a cutting-edge PV technology that combines high efficiency with low degradation, offering superior performance compared to traditional PV modules. As a global leader in HJT technology, Risen Energy is uniquely positioned to deliver high-quality and high-performance HJT PV modules that meet Athein Holding Pte Ltd's unique requirements and support their expansion plans across the APAC regions and the Indian market. Moreover, Risen Energy will provide additional services such as technical support, training, and after-sales services to ensure a seamless experience for Athein Holding Pte Ltd. \"Risen Energy HJT modules open a new way for us to enhance our ability to meet the growing global demand for clean energy solutions,\" said Milan Koev, the CEO of Athein. \"This collaboration marks a significant milestone for Athein as we continue to solidify our position as a leader in the renewable energy industry.\" \"We are thrilled to enter into this strategic partnership with Athein, which marks a significant milestone in our efforts to drive the development of renewable energy technology worldwide,\" said B.V.Chaudary, the Chief Sales and Marketing Officer (CSMO) of Risen Energy. \"Through this partnership, we are confident that our high-quality and reliable HJT PV modules will help Athein achieve their renewable energy goals and contribute to the growth of the renewable energy industry.\" This supply agreement underscores Risen Energy's position as a leader in HJT technology and its commitment to delivering innovative and sustainable solutions to customers around the world. By partnering with forward-thinking companies like Athein Holding Pte Ltd, Risen Energy is well-positioned to accelerate the adoption of clean and sustainable energy solutions worldwide. About Risen Energy Risen Energy is a leading, global, Tier 1 manufacturer of high-performance solar photovoltaic products and provider of total business solutions for power generation. The Company, founded in 1986 and publicly listed in 2010, compels value generation for its global customers, gaining remarkable market share in over 60 countries including China, Europe, USA, India, Brazil, Columbia, Chile, Australia amongst others. Risen Energy is well provisioned to provide excellent services and long-term partnerships to its customers in the utility, commercial, and residential markets. For more information, please visit our website: www.risenenergy.com About Athein Athein is a Joint-Venture partnership between 5 companies in Southeast Asia and India. The platform company is committed to help its multinational manufacturing customers to achieve their net zero targets and plans to operate 1 GWp of renewable assets by 2026. For more information, please visit our website: www.athein.net SOURCE Risen Energy Co., Ltd [email protected]","filter_flag":1}
{"title":"Shifting the EV sector to the next gear - The Borneo Post","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LnRoZWJvcm5lb3Bvc3QuY29tLzIwMjMvMDcvMzAvc2hpZnRpbmctdGhlLWV2LXNlY3Rvci10by10aGUtbmV4dC1nZWFyL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LnRoZWJvcm5lb3Bvc3QuY29tLzIwMjMvMDcvMzAvc2hpZnRpbmctdGhlLWV2LXNlY3Rvci10by10aGUtbmV4dC1nZWFyL9IBAA?oc=5","id":"CBMiUWh0dHBzOi8vd3d3LnRoZWJvcm5lb3Bvc3QuY29tLzIwMjMvMDcvMzAvc2hpZnRpbmctdGhlLWV2LXNlY3Rvci10by10aGUtbmV4dC1nZWFyL9IBAA","guidislink":false,"published":"Sun, 30 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=30, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=211, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LnRoZWJvcm5lb3Bvc3QuY29tLzIwMjMvMDcvMzAvc2hpZnRpbmctdGhlLWV2LXNlY3Rvci10by10aGUtbmV4dC1nZWFyL9IBAA?oc=5\" target=\"_blank\">Shifting the EV sector to the next gear<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Borneo Post<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Shifting the EV sector to the next gear - The Borneo Post","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LnRoZWJvcm5lb3Bvc3QuY29tLzIwMjMvMDcvMzAvc2hpZnRpbmctdGhlLWV2LXNlY3Rvci10by10aGUtbmV4dC1nZWFyL9IBAA?oc=5\" target=\"_blank\">Shifting the EV sector to the next gear<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Borneo Post<\/font>","source.href":"https:\/\/www.theborneopost.com","source.title":"The Borneo Post","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"WITH the arrival of the first official electric vehicle (EV) from Tesla Inc (Tesla) here, Malaysia is bound to see major changes in its automotive sector. In line with its goals to shift Malaysia’s transportation industry to greener alternatives, the government has been ramping up its effort to grow the nascent EV industry here. On top of increasing its efforts to encourage more foreign investments on EV production in the country, the government has also introduced policies to push the uptake of EVs in the domestic market. In its retabled Budget 2023, the government has extended a number of tax exemption deadlines to incentivise local EV uptake and this includes a two-year extension of the excise duty, sales tax exemption, and import tax exemption for components used in locally-assembled (CKD) EVs to December 31, 2027 (previously until December 31, 2025). Import and excise duty exemption for fully-imported (CBU) EVs have also been extended to December 31, 2025 which was previously set to the end this year before it was previous extended in the first tabling of Budget 2023 to December 31, 2024. Furthermore, under the Low Carbon Mobility Blueprint (LCMB) 2021-2030, the government aims to achieve at least 15 per cent of xEVs out of the total industry volume (TIV) by 2030 and 38 per cent of xEV by 2040 under the National Energy Policy (NEP) 2022 to 2040, with 10,000 units of Charging Facilities built by 2025 (comprising 9,000 alternating current (AC) units and 1,000 direct currents (DC) units). With Tesla’s entry through one of its most affordable EV model as well as its commitment to further invest in charging facilities across key areas in Malaysia, analysts observed that sentiments are gearing towards more positive for the EV sector. Confidence in Malaysia’s market Following the launch of Tesla’s Model Y here, Investment, Trade and Industry (Miti) Minister Tengku Datuk Seri Zafrul Tengku Abdul Aziz had pointed out that the opening of Tesla’s first charging station in Malaysia will make the local automotive ecosystem more competitive and help signal to the global market that the country is serious about developing its EV industry. Tengku Zafrul said that given that the EV industry is relatively new to Malaysia, many investors, both local and foreign, are still waiting for the ‘certainties’ in the market before making any investment decision. He believed that the opening of Tesla’s charging station would help instil confidence among EV investors who are not only keen to invest in the charging facilities but also take part in the entire supply chain. “We are, in a way, liberalising the industry, and we have to push. We want to make sure the regulations are clear. “They also want to know how fast the cars are coming in. So for the people investing in (the) charging (stations), they want to see us opening up also. Tesla is setting a good example by installing the charging stations first,” he was quoted by Bernama as saying. Concurring his view, Malaysian Automotive Association president Mohd Shamsor Mohd Zain said the entry of US-headquartered Tesla as well as China’s Zhejiang Geely Holding Group Co (Geely) into the Malaysian market serves as a clear indication of the country’s relevance in the regional automotive landscape. He was quoted as saying by Bernama that the two auto makers, with their vast global experience and access to leading technologies, could introduce new ideas and ways of doing businesses to the local automotive sector, such as high-tech research and development (R&D) in new products that might not be currently available in the country. “For example, electrification means a change in vehicle components, with more focus given to battery manufacturing and other specialised components for EVs. “We would also see the industry adopting new skillsets and infrastructure suited to varying degrees of electrification – from mild hybrids to fully electric vehicles – besides reskilling or upskilling the automotive workforce, whilst opening up new opportunities for innovation, R&D and high-value manufacturing of components,” he said. With the right government support, infrastructure and policies in place, Malaysia is well positioned to be a regional hub supporting the global growth of EVs given its strategic positioning and favourable economic conditions, he pointed out. Malaysia’s strong electrical and electronics manufacturing industry also makes it ideal for automakers and automotive investors to seamlessly secure their supply chains for growing their production of next-generation vehicles (NxGVs), he added. The components sub-sector can be capitalised on to service the whole automotive value chain, covering semiconductors, sensors, automotive electronics, transceivers, batteries, and vehicle assembly. Mohd Shamsor had also pointed out that with more than 40 brands in the domestic market currently, the entry of new players would undoubtedly add greater excitement to the market and generate more interest among consumers. He also believed that it would also create a buyer’s market by providing more choices and increasing competitiveness, keeping all automotive players on their toes and resulting in better services and offerings for consumers. “Malaysia may be new to the EV industry, but with the solid support of the current government and progressive national policies coupled with fast-growing consumer uptake, we foresee rapid holistic growth in our local EV market. “New players in the EV space will lead to greater competition, which in turn will spur more investments from automotive players and improvements in the quality of products and services offered,” he pointed out. Additionally, Mohd Shamsor said, with more EVs, including the completely knocked down models, coming into the country, there would also be new business opportunities for the vendors. Currently, the Malaysian Investment Development Authority (MIDA) has approved 58 projects totalling RM26.2 billion in the EV and its related ecosystems from 2018 to March 2023. In a statement, it said, the approved investments span various areas, including EV assembly, manufacturing of EV parts and components as well as its charging components. “As the demand for sustainable transportation continues to rise, MIDA’s support and facilitation of these projects contribute to the advancement of the EV sector in Malaysia, fostering economic development, job creation, and a greener future,” it said. Rising demand for EV across Southeast Asia AS developing countries worldwide push their energy transition agenda, there is no better time than now, to leverage on the growing demand for EV and its much-needed components. According to the International Energy Agency (IEA), early indications from first quarter sales of 2023 point to an upbeat EV market, supported by cost declines as well as strengthened policy support in key markets such as the US. “Globally, our current estimate is therefore for nearly 14 million electric cars to be sold in 2023, building on the more than 2.3 million already sold in the first quarter of the year. “This represents a 35 per cent increase in electric car sales in 2023 compared to 2022 and would bring the global electric sales share to around 18 per cent, up from 14 per cent in 2022,” it said in its ‘Global EV Outlook 2023’ report. It pointed out that electric car sales in the first three months of 2023 have shown strong signs of growth compared to the same period in 2022. In the US, more than 320 000 electric cars were sold in the first quarter of 2023, 60 per cent more than over the same period in 2022. The latest available data suggests a quick recovery in China’s EV market with electric car sales in China reaching more than 20 per cent higher than in the first quarter of 2022, with more than 1.3 million electric cars being registered, in the first quarter of 2023. Outside of the major EV markets, electric car sales are expected to reach around 900 000 in 2023 – 50 per cent higher than in 2022. In India and across all regions outside the three major EV markets, electric car sales are expected to represent two to three per cent of car sales in 2023, a relatively small yet growing share, it said. There are, of course, downside risks to the 2023 outlook, it pointed out. A sluggish global economy and the phase-out of subsidies for NEVs in China could reduce 2023 growth in global electric car sales could dampen the market. “On the upside, new markets may open up more quickly than anticipated, as persistent high oil prices make the case for EVs stronger in an increasing number of settings. And new policy developments, such as the April 2023 proposal from the US Environmental Protection Agency (EPA) to strengthen GHG emissions standards for cars, may send signals that boost sales even before going into effect,” it added. Within the Asean region, according to a report by Mordor Intelligence, the EV market size is expected to grow from US$0.86 billion in 2023 to US$3.54 billion by 2028, at a compounded annual growth rate (CAGR) of 32.73 per cent from 2023 to 2028. In Southeast Asia, Counterpoint Technology Market Research pointed out that the region’s passenger battery electric vehicle (BEV) sales grew by almost 10-times year-on-year (y-o-y) in 1Q23. The share of BEVs in total passenger vehicle sales experienced significant growth in 1Q23, reaching 3.8 per cent compared to a mere 0.3 per cent one year ago, it said, based on its latest survey on the market. Commenting on the market dynamics, Counterpoint Technology Market Research analyst Abhilash Gupta said, “Passenger EV demand is increasing gradually across the Southeast Asia region but sales are tiny compared to global EV sales, constituting just 0.5 per cent of the global total for 2022. “However, as geopolitical tensions are rising between China and the West, Southeast Asia is becoming an attractive option for Chinese auto manufacturers looking to expand abroad. Therefore, we can expect to see more production plants in Southeast Asia in the longer term, which will help boost EV sales.” Commenting on the market outlook, senior analyst Soumen Mandal said, “Although EVs are currently a niche market in SEA, we do expect their sales to double in 2023. “However, it will be difficult for the Southeast Asia countries to achieve their EV targets and increase the share of renewables in the electricity grid at the same time. “Southeast Asia countries have the opportunity to display their manufacturing capabilities and grow, given the interest of many international auto manufacturers to invest in the region. “Those that enter the market early will have an edge, allowing them to secure a substantial share of the market. The Southeast Asia region could adopt the approaches taken by China and Europe, which provide incentives based on CO2 emission levels. “Doing so would encourage both consumers and manufacturers to shift towards more environment-friendly vehicles.” Sarawak gets ready for greener mobility AS for Sarawak, the government has been pushing its Zero Carbon Goal within the transportation sector as well. SEDC Energy and Association of Malay Vehicle Importers and Traders of Malaysia (Pekema) Sarawak are working together to bring more electric vehicles (EVs) into Sarawak. According to Sarawak Economic Development Corporation (SEDC) chairman Tan Sri Datuk Amar Abdul Aziz Dato Husain, SEDC Energy is currently piloting a subscription model, starting with the Tesla Model Y. “This model may bring in more adoption and confidence to the people as more EV offerings become available into the market. This echoes our country’s commitment of abating climate change effects and significantly reducing carbon emissions in our dear country and state. “We want Sarawak to lead the way in this respect as we are in the prime condition to do so and in preserving our environment. We are part of the solution and we implore agencies to set an example and be a part of our very own electric mobility adoption efforts,” he said at the launch of the ‘EV-fy Adoption’ event earlier this yeart. Abdul Aziz said it was ‘very progressive and welcoming’ for organisations such as Pekema Sarawak to ally themselves with SEDC Energy in pursuing green mobility by way of developing the EV market in Sarawak. “We hope to see the Sarawak state (government) invest in green mobility solutions and we can see this in the investments towards developing the public transport systems to fuel cell EVs. “We hope the government would also incentivise energy efficient vehicles to promote resilient infrastructure that prioritise green-based solutions, particularly the EV charging infrastructure across the state, either for Battery Electric Vehicles (BEVs) or Fuel Cell Electric Vehicles (FCEVs),” he said. “No doubt the cost may be high now, but as the demand grows and more car manufacturers shift the production to EVs, BEVs or FCEVs alike, the cost would lower over time,” he said. He added that SEDC Energy was also procuring hydrogen fuel-cell vehicles. Clean energy solutions provider Gentari Sdn Bhd (Gentari) had also recently signed two Strategic Collaboration Agreements (SCAs) with Sarawak Energy and SEDC Energy to explore potential opportunities on developing and deploying clean energy solutions in Sarawak. The collaboration between Gentari, Saraway Energy and SEDC also include establishing a comprehensive and wide-ranging EV charging network in Sarawak – an initiative that will be vital for promoting green mobility solutions and encouraging the shift towards low carbon transportation in the state. With Sarawak Energy’s generation mix predominantly based on renewable hydropower, the state is well positioned to enhance and diversify its energy sources, as well as to further decarbonise the transportation sector. “This collaboration reflects our commitment to driving Sarawak’s energy transition and decarbonisation initiatives, while reinforcing our position as a regional leader in the renewable energy sector. “This partnership is a significant step towards realising our vision of achieving sustainable growth and prosperity for our communities in Sarawak, while safeguarding the environment,” Sarawak Energy chief executive officer Datu Sharbini Suhaili following the signing of the SCAs between the three companies. SEDC Energy chief executive officer Robert Hardin said such collaboration enables the company to advance the implementation of sustainable energy solutions in Sarawak as it plays an active role in the state’s transition to cleaner energy sources and reduced carbon emissions. He said the partnership encompasses a comprehensive approach to meet Sarawak’s clean energy requirements. “By harnessing each other’s expertise to apply integrated solutions, our objective is clear on contributing to a greener and more resilient energy future for the state. “Additionally, our focus on the clean hydrogen sector aims to position Sarawak as a regional frontrunner in clean energy,” Robert added. To ensure the full success of the strategic collaboration, Gentari said it will work closely with the Sarawak government and other stakeholders in a public-private coordination framework. With this, the parties aim to comprehensively enhance communications, foster greater synergy, and streamline efforts towards achieving Sarawak’s clean energy goals, and making greater progress to create a sustainable future for the state.","filter_flag":1}
{"title":"Toray Set to Increase Carbon Fiber Capacity to Meet Growing Demand in Pressure Vessel Applications - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3RvcmF5LXNldC10by1pbmNyZWFzZS1jYXJib24tZmliZXItY2FwYWNpdHktdG8tbWVldC1ncm93aW5nLWRlbWFuZC1pbi1wcmVzc3VyZS12ZXNzZWwtYXBwbGljYXRpb25zLTMwMTg3NjEyNS5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3RvcmF5LXNldC10by1pbmNyZWFzZS1jYXJib24tZmliZXItY2FwYWNpdHktdG8tbWVldC1ncm93aW5nLWRlbWFuZC1pbi1wcmVzc3VyZS12ZXNzZWwtYXBwbGljYXRpb25zLTMwMTg3NjEyNS5odG1s0gEA?oc=5","id":"CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3RvcmF5LXNldC10by1pbmNyZWFzZS1jYXJib24tZmliZXItY2FwYWNpdHktdG8tbWVldC1ncm93aW5nLWRlbWFuZC1pbi1wcmVzc3VyZS12ZXNzZWwtYXBwbGljYXRpb25zLTMwMTg3NjEyNS5odG1s0gEA","guidislink":false,"published":"Thu, 13 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=194, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3RvcmF5LXNldC10by1pbmNyZWFzZS1jYXJib24tZmliZXItY2FwYWNpdHktdG8tbWVldC1ncm93aW5nLWRlbWFuZC1pbi1wcmVzc3VyZS12ZXNzZWwtYXBwbGljYXRpb25zLTMwMTg3NjEyNS5odG1s0gEA?oc=5\" target=\"_blank\">Toray Set to Increase Carbon Fiber Capacity to Meet Growing Demand in Pressure Vessel Applications<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Toray Set to Increase Carbon Fiber Capacity to Meet Growing Demand in Pressure Vessel Applications - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3RvcmF5LXNldC10by1pbmNyZWFzZS1jYXJib24tZmliZXItY2FwYWNpdHktdG8tbWVldC1ncm93aW5nLWRlbWFuZC1pbi1wcmVzc3VyZS12ZXNzZWwtYXBwbGljYXRpb25zLTMwMTg3NjEyNS5odG1s0gEA?oc=5\" target=\"_blank\">Toray Set to Increase Carbon Fiber Capacity to Meet Growing Demand in Pressure Vessel Applications<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Major expansion at carbon fiber facility in Spartanburg, SC announced by Toray Composite Materials America, Inc. Post this Toray CMA, the largest producer of carbon fiber in the United States, is a primary supplier of carbon fiber to alternative energy, the emerging hydrogen economy and the ongoing clean energy revolution. The South Carolina plant expansion will increase the supply of industrial-strength carbon fiber for compressed natural gas, hydrogen tanks, and other pressure vessel applications. The increased supply is necessary as the market experiences growing demand for energy and associated storage, transportation and handling infrastructure. \"The market for clean energy solutions is continuing to rapidly develop. As released earlier this year under Toray's Medium-Term Management Program, Project AP-G 2025, we are committed to accelerating technologies that will greatly reduce our environmental burden. This next expansion enables us to keep-pace with the needs of our customers and maintain our leadership position,\" says Tim Kirk, Toray CMA's Vice President of Marketing. Toray's production system is a fully integrated supply chain, with the Spartanburg plant operating with production lines from precursor to carbon fiber and prepreg. Other Toray CMA manufacturing facilities are located in Decatur, Alabama and Tacoma, Washington. The expansion will add flexibility and capability, enabling Toray to better serve customers in aerospace and defense, industrial, sports and recreation, and automotive markets. About Toray Composite Materials America, Inc. Toray Composite Materials America, Inc. (Toray CMA) is a subsidiary of Toray Industries, Inc. (Toray). Toray addresses global challenges by delivering high value-add products including fibers and textiles, resins and films, and carbon fiber composite materials. Toray operates in 29 countries and regions with more than 48,000 employees worldwide. Toray Composite Materials America is the manufacturer and supplier of TORAYCA™ carbon fiber materials and high quality advanced composite prepreg. Toray CMA serves the needs of aerospace and defense, sports and recreation, automotive, and industrial markets. For more information about Toray CMA, visit www.toraycma.com. For information on Toray Industries, visit www.toray.com. SOURCE Toray Composite Materials America, Inc.","filter_flag":1}
