{"title":"In a nod to Oppenheimer's legacy, US officials vow to prioritize cleanup at nuclear lab - The Associated Press","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL21hbmhhdHRhbi1wcm9qZWN0LWxvcy1hbGFtb3MtY29udGFtaW5hdGlvbi1jbGVhbnVwLTcyZjkyN2FjNjQzYzlhZTdjMDIzZDg4MmJhNTdlYmE00gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL21hbmhhdHRhbi1wcm9qZWN0LWxvcy1hbGFtb3MtY29udGFtaW5hdGlvbi1jbGVhbnVwLTcyZjkyN2FjNjQzYzlhZTdjMDIzZDg4MmJhNTdlYmE00gEA?oc=5","id":"CBMibmh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL21hbmhhdHRhbi1wcm9qZWN0LWxvcy1hbGFtb3MtY29udGFtaW5hdGlvbi1jbGVhbnVwLTcyZjkyN2FjNjQzYzlhZTdjMDIzZDg4MmJhNTdlYmE00gEA","guidislink":false,"published":"Thu, 20 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=201, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL21hbmhhdHRhbi1wcm9qZWN0LWxvcy1hbGFtb3MtY29udGFtaW5hdGlvbi1jbGVhbnVwLTcyZjkyN2FjNjQzYzlhZTdjMDIzZDg4MmJhNTdlYmE00gEA?oc=5\" target=\"_blank\">In a nod to Oppenheimer's legacy, US officials vow to prioritize cleanup at nuclear lab<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Associated Press<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"In a nod to Oppenheimer's legacy, US officials vow to prioritize cleanup at nuclear lab - The Associated Press","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL21hbmhhdHRhbi1wcm9qZWN0LWxvcy1hbGFtb3MtY29udGFtaW5hdGlvbi1jbGVhbnVwLTcyZjkyN2FjNjQzYzlhZTdjMDIzZDg4MmJhNTdlYmE00gEA?oc=5\" target=\"_blank\">In a nod to Oppenheimer's legacy, US officials vow to prioritize cleanup at nuclear lab<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Associated Press<\/font>","source.href":"https:\/\/apnews.com","source.title":"The Associated Press","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Cleanup\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"ALBUQUERQUE, N.M. (AP) — The price tag for cleaning up waste from the once top-secret Manhattan Project and subsequent Cold War-era nuclear research at Los Alamos National Laboratory has more than doubled in the last seven years, and independent federal investigators say federal officials will have to do better to track costs and progress. The Government Accountability Office in a report issued Wednesday said while some improvements have been made, the U.S. Energy Department hasn’t taken a comprehensive approach to prioritizing cleanup activities at the New Mexico lab. The report came as federal officials hosted a forum Thursday in Los Alamos to talk about cleaning up contaminated soil and groundwater and handling hazardous waste generated by decades of research that started with development of the atomic bomb during the 1940s. Ike White, who heads DOE’s Office of Environmental Management, said the release this week of the “Oppenheimer” film makes it a good time to talk about the legacy that came from the dawning of the atomic age. Part of the environmental cleanup mission requires an examination of history, White told those gathered at the historic Fuller Lodge in the heart of Los Alamos. He characterized the nation’s multibillion-dollar cleanup program as the third largest liability on the books for the federal government — behind only Social Security and Medicaid. “It is a large, it is a complicated, it a technologically challenging program,” White said. “It is extremely important to a lot of people who live across the country from coast to coast, and all of us who are part of that program feel an extraordinary responsibility to make that program successful.” Still, the GAO pointed to weaknesses in oversight by the Office of Environmental Management at Los Alamos. They said failure to finalize a performance baseline for the cleanup contractor prevented the office from tracking ongoing costs, the scope of work and progress. New Mexico environmental regulators said the report validates their longstanding concerns — that cleanup is mired in unnecessary delays that threaten public health and the environment. New Mexico Environment Department spokesman Matthew Maez pointed specifically to the federal government’s responsibility to protect drinking water. “The frequent delays and lack of transparency in cleanup must be remedied,” he said. “We hope this report galvanizes DOE-EM to enact change in Los Alamos.” Environmental management officials at Los Alamos said they expect to complete remaining cleanup activities at the lab by 2043 at an estimated cost of about $7 billion. Michael Mikolanis, who heads DOE’s environmental management office at Los Alamos, said Thursday that his team is developing a long-term strategic vision for the remaining cleanup that will be based on priorities identified through numerous meetings with state regulators, the leaders of neighboring Native American communities and others. While White agrees with the GAO that prioritizing the scope of work is important, he said optimum efficiency is not always the most important factor. “One of the things that we’ve arranged with our strategic vision effort and our stakeholder engagement is to try to make sure we’re doing that prioritization of the work in a way that is transparent to the community and that doesn’t just reflect a sort of bureaucratic set of values,” he said. Don Hancock with the Albuquerque-based nuclear watchdog group Southwest Research and Information Center said the DOE in 2010 had issued a roadmap that included a goal of disposing of most of the transuranic waste — that which contains manmade elements heavier than uranium — by the end of 2015. He asked the DOE officials at the forum about the timeline and how much waste remained. Mikolanis said his office plans to unveil an interactive map this fall that will include estimates of the waste at Los Alamos that is stored above ground and that which has yet to be unearthed. White said estimates for the cleanup project nationwide are hard to calculate because the ultimate volume of waste can change depending on the scope of a project. The GAO report includes several recommendations for the DOE that include implementing a plan to account for cost and schedule increases, building trust with state regulators and including consideration of potential risks when making decisions.","filter_flag":1}
{"title":"Lighting Construction Jobsites in New Ways - For Construction Pros","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmZvcmNvbnN0cnVjdGlvbnByb3MuY29tL2VxdWlwbWVudC93b3Jrc2l0ZS9hcnRpY2xlLzIyODY1NTQ5L2xpZ2h0aW5nLWNvbnN0cnVjdGlvbi1qb2JzaXRlcy1pbi1uZXctd2F5c9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmZvcmNvbnN0cnVjdGlvbnByb3MuY29tL2VxdWlwbWVudC93b3Jrc2l0ZS9hcnRpY2xlLzIyODY1NTQ5L2xpZ2h0aW5nLWNvbnN0cnVjdGlvbi1qb2JzaXRlcy1pbi1uZXctd2F5c9IBAA?oc=5","id":"CBMicmh0dHBzOi8vd3d3LmZvcmNvbnN0cnVjdGlvbnByb3MuY29tL2VxdWlwbWVudC93b3Jrc2l0ZS9hcnRpY2xlLzIyODY1NTQ5L2xpZ2h0aW5nLWNvbnN0cnVjdGlvbi1qb2JzaXRlcy1pbi1uZXctd2F5c9IBAA","guidislink":false,"published":"Mon, 31 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=212, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmZvcmNvbnN0cnVjdGlvbnByb3MuY29tL2VxdWlwbWVudC93b3Jrc2l0ZS9hcnRpY2xlLzIyODY1NTQ5L2xpZ2h0aW5nLWNvbnN0cnVjdGlvbi1qb2JzaXRlcy1pbi1uZXctd2F5c9IBAA?oc=5\" target=\"_blank\">Lighting Construction Jobsites in New Ways<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">For Construction Pros<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Lighting Construction Jobsites in New Ways - For Construction Pros","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmZvcmNvbnN0cnVjdGlvbnByb3MuY29tL2VxdWlwbWVudC93b3Jrc2l0ZS9hcnRpY2xlLzIyODY1NTQ5L2xpZ2h0aW5nLWNvbnN0cnVjdGlvbi1qb2JzaXRlcy1pbi1uZXctd2F5c9IBAA?oc=5\" target=\"_blank\">Lighting Construction Jobsites in New Ways<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">For Construction Pros<\/font>","source.href":"https:\/\/www.forconstructionpros.com","source.title":"For Construction Pros","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Cleanup\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"As the construction industry moves toward zero emissions with large equipment, pressure to minimize or eliminate the use of diesel generators is increasing, including decreasing or eliminating their use for site lighting. As with diesel internal combustion engines, these generators will continue to be used for the near future. However, for lighting jobsites, other options are available that can help contractors begin the move away from diesel lighting solutions. This includes other solutions that are also not traditional tower lights. Reasons Diesel May Need to Be in the Rearview Many operational, monetary and environmental reasons exist to move away from diesel-powered light sources. According to Rob Brockel, Senior Director Marketing - Global Industrial & Mobile, Generac, “Historically, diesel-powered lighting has been the go-to choice for construction sites due to its reliability, accessibility and ability to operate for extended periods. However, it's not without its drawbacks, and the advent of innovative alternatives has resulted in a substantial change in the mobile lighting market landscape.” Generac Among these drawbacks are maintenance and refueling, carbon emissions and noise. Dan McKenzie, President of Progress Solar Solutions, agrees and includes other problems with diesel-powered lighting such as running fuel trucks through operations, the cost of constantly burning diesel, fuel delivery costs, the labor to operate the generators and the cost of environmental cleanup of fuel spills. Carl Miller, Chief Operating Officer, Blue Vigil sights the poor and sometimes hazardous illumination provided by traditional construction lighting. “Traditional diesel-powered, light towers are standard for lighting nighttime construction sites. However, they do a poor job of illuminating work [areas] due to the inherent constraint in the tower height and lack of flexibility in placement, which affects the safety and the productivity of the workers. These tower lights typically have a maximum mast height of 25 feet and as such the lights are angled at the work area (sometimes even pointing up at workers on overpasses).” These angles may lead to hazardous glare and shadows. With today’s brighter LEDs, Miller said, even more glare and shadows impact workers, motorists and pedestrians. Other Options Other power and configuration options are available including: Hybrid configurations that use diesel with solar or battery power Solar Batteries (they can be charged during off-hours and while in operation, produce zero emissions, are virtually noise-free and require minimal equipment maintenance) Hydrogen fuel cells (gaining traction but not yet widely used in lighting applications) Tethered drones (powered by wall\/shore power, smaller generator or vehicle inverter) “We make mobile solar light towers that run completely on solar power and batteries,” McKenzie said. “Our most commonly used models, the SLT-700 and SLT-1400, can operate from Florida to Canada [because] we designed them to have enough solar power and batteries. Our mobile solar light towers can turn off and on automatically with either a photocell (light sensor) or timers reducing labor and fuel costs. They also run silently so your team can work right up next to them without any noise.” “There are numerous benefits to using alternative power sources for construction lighting,” Brockel said. “Most notably, they are more environmentally friendly, producing fewer emissions and contributing less to noise pollution. In addition, these products can also realize significant cost savings from decreased fuel usage and equipment maintenance.” Progress Solar Solutions Another option is the need for a smaller generator or using an inverter to power a drone lighting system. “The ALED Portable [from Blue Vigil] is much quieter and more energy efficient than current LED light towers … it can be powered by wall\/shore power; a smaller, quieter portable 3,000-watt generator; or a common vehicle inverter,” Miller said. Flexibility “Alternative power sources can offer more flexibility and portability, making them suitable for remote or difficult-to-access sites,” Brockel said. Mobility and ease of use are part of many new lighting sources. The mobility available in the battery-powered towers discussed by Brockel provides easy location and relocation of the towers. Blue Vigil’s new Aerial LED (ALED) Portable Light uses tethered drone technology to position a high-intensity LED array between 40 feet and 100 feet above a jobsite for as long as needed. According to Miller, it “puts nearly twice as much useable light on the ground as traditional towed light towers and does not produce glare and shadows. Its 100,000-lumen LED array produces 8,000 square feet of OSHA-quality, useable light (defined as greater than 5 feet candles) on the ground … By illuminating a work zone from above, light shines directly down onto the area of operation offering significantly less light spillage without creating dangerous impacts.” Blue Vigil The tethered-drone technology is also person-portable, allowing for more flexibility in transport and setup. It weighs 75 pounds and can be rolled into place by a single person. “To use, simply open the case, plug it in and use the pendant control to raise the tethered light up to the desired height (up to 100 feet),” Miller said. “From the ground, the operator can angle the light up to 20 degrees away from center and can adjust the brightness as needed.” Alternative Power Challenges The pushback against new technology is not a novel response. Comfort with known entities is common. One major challenge to the adoption of alternative lighting options is the something-new factor. “One of the biggest challenges for us to overcome is the market bias against something new,” Miller said. According to Brockel, sunlight availability, battery recharging and initial investment costs may affect the adoption of alternatives. “Solar-powered lights depend on adequate sunlight for charging, which might not be reliable in all locations or seasons,” Brockel said. “Battery-powered lights, on the other hand, need to be recharged, which requires access to a power source. Lastly, the initial investment for some alternative power solutions might be higher than traditional diesel lighting, although this cost can often be offset by lower operating costs over time.” Progress Solar Solutions McKenzie agrees with these impediments. “The first [challenge] is purchasing the right equipment that is designed to work year-round in the area you are in. We help customers select the right unit and sell units with more solar and batteries. The second is setting up the unit in a sunny area with the panels facing south to get the full benefit of the sun.” While the initial purchase price may be a deterrent, the total cost of ownership is lower for some alternatives. “Cost savings and reduced labor requirements [are benefits],” McKenzie said. “For the purchase of a solar light tower, the savings are about $100,000 over five years. For renting a solar light tower the savings are about $1,000 per month in fuel costs even though the rent is higher.” The Future While traditional lighting will likely dominate the landscape for the near future, exciting options that decrease emissions, save costs, and improve light quality and site safety are available today. With these options, jobsite lighting efficiency and sustainability look bright.","filter_flag":1}
