{"title":"Apple unveils its first carbon neutral products - Apple","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmFwcGxlLmNvbS9uZXdzcm9vbS8yMDIzLzA5L2FwcGxlLXVudmVpbHMtaXRzLWZpcnN0LWNhcmJvbi1uZXV0cmFsLXByb2R1Y3RzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmFwcGxlLmNvbS9uZXdzcm9vbS8yMDIzLzA5L2FwcGxlLXVudmVpbHMtaXRzLWZpcnN0LWNhcmJvbi1uZXV0cmFsLXByb2R1Y3RzL9IBAA?oc=5","id":"CBMiV2h0dHBzOi8vd3d3LmFwcGxlLmNvbS9uZXdzcm9vbS8yMDIzLzA5L2FwcGxlLXVudmVpbHMtaXRzLWZpcnN0LWNhcmJvbi1uZXV0cmFsLXByb2R1Y3RzL9IBAA","guidislink":false,"published":"Tue, 12 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=255, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmFwcGxlLmNvbS9uZXdzcm9vbS8yMDIzLzA5L2FwcGxlLXVudmVpbHMtaXRzLWZpcnN0LWNhcmJvbi1uZXV0cmFsLXByb2R1Y3RzL9IBAA?oc=5\" target=\"_blank\">Apple unveils its first carbon neutral products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Apple<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Apple unveils its first carbon neutral products - Apple","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmFwcGxlLmNvbS9uZXdzcm9vbS8yMDIzLzA5L2FwcGxlLXVudmVpbHMtaXRzLWZpcnN0LWNhcmJvbi1uZXV0cmFsLXByb2R1Y3RzL9IBAA?oc=5\" target=\"_blank\">Apple unveils its first carbon neutral products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Apple<\/font>","source.href":"https:\/\/www.apple.com","source.title":"Apple","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"September 12, 2023 PRESS RELEASE Apple unveils its first carbon neutral products The new Apple Watch lineup marks major progress toward ambitious Apple 2030 climate goal CUPERTINO, CALIFORNIA Apple today announced its first-ever carbon neutral products in the all-new Apple Watch lineup. Innovations in design and clean energy have driven dramatic reductions in product emissions of over 75 percent for each carbon neutral Apple Watch.1 This milestone marks a major step in the company’s journey toward its ambitious Apple 2030 goal to make every product carbon neutral by the end of the decade, including the entire global supply chain and the lifetime use of every device Apple makes. As part of Apple 2030 and the company’s broader environmental efforts, Apple has also ended the use of leather across all of its product lines, announced its first entirely fiber-based packaging for the new Apple Watch lineup,2 and continued to expand the use of recycled materials in iPhone. The company also introduced a new tool in the Home app called Grid Forecast,3 which helps inform users when their power grid has cleaner energy available, so they can decide when to use electricity. “At Apple, we have a longstanding and proven commitment to leading the fight against climate change. Our focus on renewable energy and low-carbon design has already driven industry-leading emissions reductions, and we’re not slowing down,” said Lisa Jackson, Apple’s vice president of Environment, Policy, and Social Initiatives. “We’ve achieved an important milestone in making the world’s most popular watch carbon neutral — and we will keep innovating to meet the urgency of the moment.” Every Product Carbon Neutral by 2030 Apple has adopted a clear and rigorous approach to product decarbonization that prioritizes reducing greenhouse gas emissions from the three biggest sources across the product life cycle: electricity, materials, and transportation. Only after Apple steeply cuts product emissions, will the company apply high-quality carbon credits from nature-based projects for emissions that cannot yet be avoided or reduced with existing solutions. Each carbon neutral Apple Watch model meets the following strict criteria: 100 percent clean electricity for manufacturing and product use, 30 percent recycled or renewable material by weight, and 50 percent of shipping without the use of air transportation.4 These combined efforts result in at least a 75 percent reduction in product emissions for each model. The company will use high-quality carbon credits to address the small amount of remaining emissions, resulting in a carbon neutral product footprint. Every carbon neutral Apple Watch — which includes any aluminum Series 9 and SE models when paired with a new Sport Loop, and Apple Watch Ultra 2 when paired with a new Trail Loop or Alpine Loop — is certified by SCS Global Services, a leader in environmental standards and certification. The Path to 2030 Apple’s first carbon neutral products are the result of years of significant work and innovation across the company and its global supply chain. They also represent the latest step on a journey that began over a decade ago. In 2020, Apple achieved carbon neutrality for its global corporate operations and announced Apple 2030: a bold strategy to be carbon neutral across its entire value chain by 2030. Apple’s plan centers on an aggressive 75 percent reduction in overall carbon emissions from 2015 levels. By avoiding activities that generate carbon, significantly expanding renewable energy across the company’s corporate operations and supply chain, and designing with recycled and renewable materials, Apple has so far reduced total emissions by over 45 percent since 2015, while still growing revenue by over 65 percent in the same period. As Apple accelerates efforts to decarbonize its value chain, every product represents an opportunity to reduce emissions — from the electricity used for manufacturing and charging devices, to materials and shipping. Spurring Progress in Clean Electricity All manufacturing for the carbon neutral Apple Watch models is powered by 100 percent clean electricity through investments and sourcing by Apple and its suppliers. Additionally, every supplier that manufactures parts and components for these models has committed to 100 percent renewable electricity for all of their Apple production by the end of the decade. Apple also works with manufacturing partners around the world to advocate for policies that support wider deployment of clean energy solutions. Apple began building and investing in large-scale solar and wind farms to power its data centers and offices over a decade ago. In 2015, the company started working with its manufacturing partners to help them create and invest in their own solar and wind projects, and source renewable energy for all Apple production. Since 2018, all of Apple’s corporate offices, data centers, and retail stores worldwide have been powered by renewable electricity. Thanks to these combined efforts, Apple and its global suppliers support more than 15 gigawatts of clean energy around the world today — enough to power over 5 million American homes. Across all product lines, more than 300 global suppliers — representing over 90 percent of Apple’s direct manufacturing spend — have now joined Apple’s Supplier Clean Energy Program, committing to 100 percent renewable electricity for all Apple production by the end of this decade. Electricity for manufacturing and charging devices represents the largest source of Apple’s emissions across all product lines. To address the latter, Apple has committed to invest in large-scale solar and wind projects around the world. For the carbon neutral Apple Watch models, the company will match 100 percent of customers’ expected electricity use for charging. Innovating in Low-Carbon Design Apple has pioneered the use of many key recycled materials in its products through world-class product engineering, extensive design qualification, and supply chain expertise. The new products announced today build on these achievements. To further reduce impact on the planet, Apple is ending the use of leather across all of its product lines, including iPhone accessories and Apple Watch bands. The company will replace leather with a new textile called FineWoven, an elegant and durable twill made from 68 percent post-consumer recycled content. FineWoven offers a subtle luster and a soft, suedelike feel, and is available on iPhone MagSafe cases and wallets as well as the Magnetic Link and Modern Buckle Apple Watch bands. As recycled and renewable materials often have a lower carbon footprint than primary materials, Apple’s industry-leading progress in the use of recycled content also advances the company’s Apple 2030 goal. The new FineWoven material has significantly lower emissions compared to the more carbon-intensive leather, and both the new iPhone 15 and the Apple Watch lineups advance progress toward the company’s 2025 targets for the use of 100 percent recycled metals in key components. This includes 100 percent recycled rare earth magnets and the company’s first use of 100 percent recycled cobalt in the battery of iPhone 15, Apple Watch Series 9, and Apple Watch Ultra 2.5 Additionally, the popular Sport Loop has been redesigned with 82 percent recycled yarn, which includes material from discarded fishing nets. Customers looking to upgrade to the new carbon neutral Apple Watch models can take advantage of Apple Trade In, and Apple will refurbish the device for a new owner, or recycle it for free. Apple is also accelerating progress toward plastic-free packaging by 2025. In addition to achieving the first 100 percent fiber-based packaging for the new Apple Watch and band lineup, the packaging for every iPhone 15 model is over 99 percent fiber-based. Reducing Transportation Emissions Transporting products around the world makes up about 9 percent of Apple’s comprehensive carbon footprint. The company is shifting more product volume to shipping modes that are less carbon-intensive than air transport, such as ocean or rail. Apple’s carbon footprint methodology shows that shipping the same product by ocean emits 95 percent fewer emissions than by air. For the carbon neutral Apple Watch models, including watches and bands, the company will ship at least 50 percent of the combined weight using non-air modes, cutting total transportation emissions nearly in half. Additionally, the packaging of all Apple Watch Series 9 and SE models has been redesigned for compactness, with a new, smaller shape that allows for 25 percent more devices per shipment. At the same time, Apple is committed to supporting broader efforts to decarbonize shipping industries, such as by being a member of the First Movers Coalition, and by supporting analysis to identify pathways for developing sustainable aviation fuels. The company also seeks out technical innovations — including the use of alternative fuels and electric vehicles — and selects vendors that offer low-carbon options to help further drive decarbonization in the industry. Investing in High-Quality Carbon Removal After achieving steep reductions in product emissions, Apple plans to cover residual emissions with high-quality carbon credits primarily from nature-based projects that remove carbon from the atmosphere, like restoring grasslands, wetlands, and forests. Carbon removal is critical to addressing climate change and achieving global climate goals, as leading scientific bodies like the United Nations Intergovernmental Panel on Climate Change have emphasized. Apple defines high-quality credits as those from projects that are real, additional, measurable, and quantified, with systems in place to avoid double-counting, and that ensure permanence. Apple has helped advance natural carbon-removal solutions that meet this definition by creating the innovative Restore Fund, which currently supports projects in Latin America. The company uses credits from projects that are certified to international standards such as Verra; the Climate, Community & Biodiversity Standards; and the Forest Stewardship Council. For the carbon neutral Apple Watch models, the high-quality carbon credits used to compensate for the remaining emissions will come from projects like the Restore Fund’s investments with Arbaro Advisors and BTG Pactual Timberland Investment Group, which are helping to restore and protect high-quality working forests and native ecosystems in Paraguay and Brazil. Introducing Grid Forecast As Apple decarbonizes its value chain, the company is also committed to engaging with customers and creating technology that helps them understand and address their environmental impact. Grid Forecast is a new tool in the Home app on Apple devices that shows when a user’s electrical grid has relatively cleaner or less clean energy sources available. For example, there are times when wind and solar projects produce more energy than the grid can use, leading to some of it being wasted. There are also times when electricity is being generated with lower emissions. By using electricity during these cleaner times, customers may lower the climate impact of the electricity they use at home. Apple uses data that combines grid, emissions, and weather information into one, easy-to-follow signal. This can help people make decisions about the best time to run large appliances and charge electric vehicles or devices throughout the day. In the contiguous United States, Grid Forecast is available in the Home app on iPhone, iPad, Mac, and Apple Watch, and can be added as an iOS widget or a watch face complication. As additional data becomes available through ongoing industry collaboration, Apple will continue refining Grid Forecast to maximize impact. Beyond its 2030 goal, Apple is also working toward a 90 percent reduction in emissions by 2050 — which requires advocating for collective action from governments, businesses, and individuals to accelerate global progress in the fight against climate change. For more information on Apple’s 2030 climate goal and the environmental impact of Apple products, visit apple.com\/2030. Carbon reductions are calculated against a baseline scenario: No use of clean electricity for manufacturing or product use, beyond what is already available on the grid; Apple’s carbon intensity of key materials as of 2015; and Apple’s average mix of transportation modes by product line across three years. The breakdown of U.S. retail packaging is by weight. Adhesives, inks, and coatings are excluded from calculations of plastic content and packaging weight. Grid Forecast will be available in the contiguous United States. 50 percent or more of all carbon neutral products by total weight are planned, as of product launch, to be shipped using non-air modes of transportation — like ocean freight — from the factory to their next destination over the lifetime of the products. All cobalt content claims are based on a mass balance allocation. Apple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, Apple Watch, and Apple TV. Apple’s five software platforms — iOS, iPadOS, macOS, watchOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, and iCloud. Apple’s more than 100,000 employees are dedicated to making the best products on earth, and to leaving the world better than we found it. Press Contacts Apple Media Helpline media.help@apple.com","filter_flag":1}
{"title":"How does technology affect the environment? - Telefónica","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LnRlbGVmb25pY2EuY29tL2VuL2NvbW11bmljYXRpb24tcm9vbS9ibG9nL2hvdy10ZWNobm9sb2d5LWFmZmVjdC1lbnZpcm9ubWVudC_SAVxodHRwczovL3d3dy50ZWxlZm9uaWNhLmNvbS9lbi9jb21tdW5pY2F0aW9uLXJvb20vYmxvZy9ob3ctdGVjaG5vbG9neS1hZmZlY3QtZW52aXJvbm1lbnQvYW1wLw?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LnRlbGVmb25pY2EuY29tL2VuL2NvbW11bmljYXRpb24tcm9vbS9ibG9nL2hvdy10ZWNobm9sb2d5LWFmZmVjdC1lbnZpcm9ubWVudC_SAVxodHRwczovL3d3dy50ZWxlZm9uaWNhLmNvbS9lbi9jb21tdW5pY2F0aW9uLXJvb20vYmxvZy9ob3ctdGVjaG5vbG9neS1hZmZlY3QtZW52aXJvbm1lbnQvYW1wLw?oc=5","id":"CBMiWGh0dHBzOi8vd3d3LnRlbGVmb25pY2EuY29tL2VuL2NvbW11bmljYXRpb24tcm9vbS9ibG9nL2hvdy10ZWNobm9sb2d5LWFmZmVjdC1lbnZpcm9ubWVudC_SAVxodHRwczovL3d3dy50ZWxlZm9uaWNhLmNvbS9lbi9jb21tdW5pY2F0aW9uLXJvb20vYmxvZy9ob3ctdGVjaG5vbG9neS1hZmZlY3QtZW52aXJvbm1lbnQvYW1wLw","guidislink":false,"published":"Wed, 13 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=256, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LnRlbGVmb25pY2EuY29tL2VuL2NvbW11bmljYXRpb24tcm9vbS9ibG9nL2hvdy10ZWNobm9sb2d5LWFmZmVjdC1lbnZpcm9ubWVudC_SAVxodHRwczovL3d3dy50ZWxlZm9uaWNhLmNvbS9lbi9jb21tdW5pY2F0aW9uLXJvb20vYmxvZy9ob3ctdGVjaG5vbG9neS1hZmZlY3QtZW52aXJvbm1lbnQvYW1wLw?oc=5\" target=\"_blank\">How does technology affect the environment?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Telefónica<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How does technology affect the environment? - Telefónica","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LnRlbGVmb25pY2EuY29tL2VuL2NvbW11bmljYXRpb24tcm9vbS9ibG9nL2hvdy10ZWNobm9sb2d5LWFmZmVjdC1lbnZpcm9ubWVudC_SAVxodHRwczovL3d3dy50ZWxlZm9uaWNhLmNvbS9lbi9jb21tdW5pY2F0aW9uLXJvb20vYmxvZy9ob3ctdGVjaG5vbG9neS1hZmZlY3QtZW52aXJvbm1lbnQvYW1wLw?oc=5\" target=\"_blank\">How does technology affect the environment?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Telefónica<\/font>","source.href":"https:\/\/www.telefonica.com","source.title":"Telefónica","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"For the European Union, this is a necessary and successful relationship, and according to its calculations, every euro invested in R&D&I in the bioeconomy will generate 10 euros of added value by 2025. Therefore, for the relationship between environment and technology to be collaborative and offer sustainable opportunities for economic growth, the approach adopted must be based on the protection and preservation of natural resources, and built with a long-term perspective. What are the negative effects of the relationship between environment and technology Although society’s new mindset is aware of the need to veto countless past actions for the benefit of the environment, there are still some negative impacts that the technology sector must ameliorate. These are some of them: Consumption of natural resources. The production of electronic devices coupled with programmed obsolescence (which is already being fought against) and the development of increasingly powerful infrastructures require a large amount of natural resources, such as the extraction of minerals, metals and fossil fuels. This leads to significant environmental impacts, such as deforestation, soil degradation and water pollution. The production of electronic devices coupled with programmed obsolescence (which is already being fought against) and the development of increasingly powerful infrastructures require a large amount of natural resources, such as the extraction of minerals, metals and fossil fuels. This leads to significant environmental impacts, such as deforestation, soil degradation and water pollution. Generation of electronic waste. The rapid obsolescence of technology and the constant supply of new products generate a large amount of waste. These devices contain toxic substances, such as lead, mercury and arsenic, which can leach into the subsoil and affect water if not properly managed. In addition, improper dismantling can release hazardous substances and pose a health risk. The rapid obsolescence of technology and the constant supply of new products generate a large amount of waste. These devices contain toxic substances, such as lead, mercury and arsenic, which can leach into the subsoil and affect water if not properly managed. In addition, improper dismantling can release hazardous substances and pose a health risk. Greenhouse gas emissions. It is not just production. The energy needed to power servers, data centres and devices favours the emission of greenhouse gases, something that has already been seen in cases such as cryptocurrency mining. These emissions contribute to global warming. It is not just production. The energy needed to power servers, data centres and devices favours the emission of greenhouse gases, something that has already been seen in cases such as cryptocurrency mining. These emissions contribute to global warming. Air and water pollution. The lack of proper management of e-waste, including the manufacture of electronic components, often involves intensive industrial processes that emit pollutants into the air and water. These pollutants can have negative effects on air and water quality, as well as on health and species survival. Can technology protect the environment? The answer is yes. Alongside the environmental challenges mentioned above, technology and digitalisation have also become powerful allies in the fight to protect the planet. Every day, innovative applications emerge that help preserve and restore nature, and pursue different objectives. These are some of them: Renewable energies. They have become a key element in the protection of the environment and the transition to a sustainable future. They come from unlimited natural sources, such as solar radiation, wind, biomass, geothermal and hydroelectric energy. Nor does their exploitation produce hazardous waste. In general, they contribute to reducing greenhouse gas emissions and decreasing dependence on fossil fuels. In this sense, the use of new technologies favours their use, to the detriment of fossil fuels, in scenarios such as sustainable mobility in cities or real consumption in intelligent buildings, based on exact demand and in real time. They have become a key element in the protection of the environment and the transition to a sustainable future. They come from unlimited natural sources, such as solar radiation, wind, biomass, geothermal and hydroelectric energy. Nor does their exploitation produce hazardous waste. In general, they contribute to reducing greenhouse gas emissions and decreasing dependence on fossil fuels. In this sense, the use of new technologies favours their use, to the detriment of fossil fuels, in scenarios such as sustainable mobility in cities or real consumption in intelligent buildings, based on exact demand and in real time. Waste management. This involves the collection, treatment, recycling and appropriate final disposal of waste generated by human activities. One of its main strategies is source reduction, through practices such as adopting responsible consumption habits. The recycling industry is another key component of waste management. Recycling reduces the need to extract new raw materials or manufacture new materials and consumes less energy. Technology plays a key role here. On the one hand, it enables the implementation of innovative solutions, such as the development of automated sorting and waste separation systems. Similarly, the implementation of sensors and tracking technologies enables more precise monitoring of waste streams. On the other hand, it stimulates research into new materials. This involves the collection, treatment, recycling and appropriate final disposal of waste generated by human activities. One of its main strategies is source reduction, through practices such as adopting responsible consumption habits. The recycling industry is another key component of waste management. Recycling reduces the need to extract new raw materials or manufacture new materials and consumes less energy. Technology plays a key role here. On the one hand, it enables the implementation of innovative solutions, such as the development of automated sorting and waste separation systems. Similarly, the implementation of sensors and tracking technologies enables more precise monitoring of waste streams. On the other hand, it stimulates research into new materials. Efficient management of natural resources. This is essential to ensure long-term sustainability and reduce the environmental impact of our activities. It consists of using natural resources responsibly, optimising their consumption, reusing and minimising waste. The Internet of Things (IoT) and smart sensors make it possible to monitor and control the consumption of water, energy and other resources. This optimises their use and reduces waste. Likewise, the application of artificial intelligence and machine learning in agriculture or forestry, for example, minimises the use of pesticides and fertilisers and maximises crop yields. In addition, the deployment of new infrastructures such as the 5G network, which are more sustainable than previous ones, leads to a significant improvement in the use of energy, optimising this aspect to the maximum and reducing the energy needs involved in offering a better telecommunications service. The relationship between environment and technology is necessary to ensure the viability of the planet. To this end, it is crucial to promote sustainable innovation and raise awareness of the importance of preserving natural environments. With the right approach, technology is a powerful tool for building a greener and more sustainable future.","filter_flag":1}
{"title":"CSRWire - Better Planet: Helping Kohler Customers Reduce Their Environmental Footprints - CSRwire.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4MzkxNi1iZXR0ZXItcGxhbmV0LWhlbHBpbmcta29obGVyLWN1c3RvbWVycy1yZWR1Y2UtdGhlaXItZW52aXJvbm1lbnRhbC1mb290cHJpbnRz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4MzkxNi1iZXR0ZXItcGxhbmV0LWhlbHBpbmcta29obGVyLWN1c3RvbWVycy1yZWR1Y2UtdGhlaXItZW52aXJvbm1lbnRhbC1mb290cHJpbnRz0gEA?oc=5","id":"CBMiemh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4MzkxNi1iZXR0ZXItcGxhbmV0LWhlbHBpbmcta29obGVyLWN1c3RvbWVycy1yZWR1Y2UtdGhlaXItZW52aXJvbm1lbnRhbC1mb290cHJpbnRz0gEA","guidislink":false,"published":"Wed, 20 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=263, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4MzkxNi1iZXR0ZXItcGxhbmV0LWhlbHBpbmcta29obGVyLWN1c3RvbWVycy1yZWR1Y2UtdGhlaXItZW52aXJvbm1lbnRhbC1mb290cHJpbnRz0gEA?oc=5\" target=\"_blank\">CSRWire - Better Planet: Helping Kohler Customers Reduce Their Environmental Footprints<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CSRwire.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CSRWire - Better Planet: Helping Kohler Customers Reduce Their Environmental Footprints - CSRwire.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4MzkxNi1iZXR0ZXItcGxhbmV0LWhlbHBpbmcta29obGVyLWN1c3RvbWVycy1yZWR1Y2UtdGhlaXItZW52aXJvbm1lbnRhbC1mb290cHJpbnRz0gEA?oc=5\" target=\"_blank\">CSRWire - Better Planet: Helping Kohler Customers Reduce Their Environmental Footprints<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CSRwire.com<\/font>","source.href":"https:\/\/www.csrwire.com","source.title":"CSRwire.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Published 09-20-23 Submitted by Kohler Originally published in Kohler's 2022 Believing in Better Impact Report Kohler’s Better Planet strategy is focused on improving our operational environmental footprint while paying uncompromised attention to designing environmentally friendly products that help our customers and consumers to reduce their own environmental impact. We have been tracking our environmental footprint since 2008 as a key part of our environmental sustainability journey, and we have established goals for reducing greenhouse gas (GHG) emissions, water usage, and waste to landfill across our operations. We continue to develop additional goals to drive improvement on other environmental metrics. DESIGN FOR ENVIRONMENT Our Design for Environment (DfE) methodology, which is applied in Kitchen and Bath and Energy businesses, is a data-driven process that enables us to understand the environmental impact of our products and rethink design aspects accordingly. DfE employs a multistage strategy that considers all aspects of the product life cycle, including the impact of using renewable materials, how decreasing water flow rates affects user experience, and how product materials can be recycled or repurposed. To increase the adoption of DfE, we organized training on DfE methodology for more than 240 Kitchen and Bath associates in China and also developed an interactive DfE workshop and provided training to Kohler Power Systems associates in our Europe, Middle East, and Africa (EMEA) unit. DfE training modules were also launched on the Kohler Learning Academy and Engineering Academy, including modules on product transparency and creating sustainability impact statements. As an internal status for our products, Kohler uses the Positive by Design® designation, which signifies that environmentally friendly aspects were incorporated using the DfE process. All products designated Positive by Design® have been internally verified to have a positive impact, compared to existing product offerings, in one of four key sustainability impact areas—water use, GHG emissions, solid waste, and material toxicity— combined with no negative effects in the other impact areas. In 2022 49% of NPD projects (excluding retail NPD projects) were designated as Positive by Design. ENVIRONMENTALLY FRIENDLY PRODUCTS As part of our efforts to increase awareness of environmentally friendly products, we are a pioneer in providing at-scale solutions for product transparency, including supporting the climate-resilience and green building movement through Environmental Product Declarations (EPDs) and Declare labels. EPDs are based on a third-party-verified life cycle impact assessment (LCIA) and Kohler has expanded our EPD offerings to include 100% of vitreous china, stainless steel, and faucets products. We are continually expanding our data inventory and our capability to produce EPDs upon request. Declare labels provide transparency on a product’s environmental impact through compliance with Living Building Challenge (LBC) criteria developed by the International Living Future Institute, a coalition of architects, engineers, manufacturers, and builders focused on green building. Declare labels and EPDs are used to help builders achieve Leadership in Energy & Environmental Design (LEED) certification for homes, commercial buildings, and communities from the U.S. Green Building Council (USGBC). Kohler continues to receive increased requests for product transparency documents, including EPDs, Declare labels, and other metrics such as embodied carbon or recycled content. In 2022 62% of our transparency requests were for EPDs, and 29% were for Declare labels with 80% of those requests from North America and 20% from countries outside of North America. HELPING CUSTOMERS REDUCE CARBON EMISSIONS Kohler Power Systems (KPS) is developing innovative ways to help customers reduce or replace the use of diesel fossil fuel, which will reduce GHG emissions. In 2022 KPS approved the use of hydrotreated vegetable oil (HVO) fuels to replace fossil diesel in its entire range of mission-critical diesel generators, including the KOHLER KD Series™, with no adaptations required to the installed generators. The switch to renewable HVO fuel can help Kohler’s customers reduce life cycle carbon emissions by up to 90% compared to fossil diesel. Diesel generators used as back up power sources for data centers and other mission-critical uses have historically been tested monthly under load, due to inability of previous technology engines to operate at no load on a regular basis. Advanced technology and efficiency improvements to the modern diesel engine designs enable lower-exercise loading. Test and field experience with generators such as the KOHLER KD Series suggests that unloaded monthly exercise is allowable, as long as the generator is load bank tested annually. KPS is working with customers to reduce load testing frequency that, based on our study, can expect up to 40% reduction in pollutants, such as nitrous oxide (NOx), particulate matter (PM), carbon monoxide (CO), and hydrocarbons (HC), and 44% in fuel consumption annually. WATER-EFFICIENT PRODUCTS Kohler continues to make its largest impact on water conservation globally through leadership in the development and use of water-efficient products. We received our thirteenth WaterSense® award in 2022 from the U.S. Environmental Protection Agency, recognizing that WaterSense-labeled KOHLER toilets, showerheads, and faucets are major contributors to reduced water consumption in America’s households. Kohler was honored in 2008 with the first WaterSense Partner of the Year award. Since 2007, cumulative savings due to Kohler brands in the U.S. was over 560 billion gallons of water, 12.8 million metric tons of avoided CO2 emissions, and $8.3 billion in energy and water costs. KOHLER WASTELAB® KOHLER WasteLAB was established in 2014 as an idea coming out of Kohler’s Innovation for Good® incubator. WasteLAB associates are working to foster a circular economy in which we reuse, rethink, and repurpose our waste streams to design and produce artful tile and other products. WasteLAB uses a variety of landfill-bound materials left over from the manufacturing process, including wastewater sludge, pottery dry cull, cast iron slag, foundry dust, and enamel powder. From 2019 through 2022, sales of KOHLER WasteLAB tiles have diverted 25.5 metric tons (MT) of waste from landfills and diverted 9.3 MT of waste in 2022. In partnership with ANN SACKS in 2019, WasteLAB launched the Crackle Collection, a line of tile created from recycled dry cull. WasteLAB launched a new tile line in early 2022, the Abstra™ Collection, which is made of more than 99.5% recycled waste materials including pottery wastewater sludge, one of Kohler’s largest waste streams. Sales of the Abstra Collection have exceeded forecasts and the award-winning tile collection has been featured in several publications, including Interior Design, Cottages & Gardens, Elle Decor, and Architectural Digest. Kohler has committed to continued investments in KOHLER WasteLAB research and development efforts to identify additional waste materials that can be repurposed for new products. INNOVATION FOR GOOD® Kohler’s Innovation for Good (IfG) program was launched in 2011 as an in-house innovation incubator for our associates to explore new business opportunities with a social purpose. The IfG incubator brings together associates from across Kohler to explore and develop products and solutions for pressing social and environmental issues, including safe water, sanitation, hygiene, and reliable power. Read the full 2022 Kohler Believing in Better Impact Report here.","filter_flag":1}
{"title":"Pirelli Unveils New Logo for 50%+ Sustainable Tires - AftermarketNews.com (AMN)","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd3d3LmFmdGVybWFya2V0bmV3cy5jb20vcGlyZWxsaS11bnZlaWxzLW5ldy1sb2dvLWZvci01MC1zdXN0YWluYWJsZS10aXJlcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd3d3LmFmdGVybWFya2V0bmV3cy5jb20vcGlyZWxsaS11bnZlaWxzLW5ldy1sb2dvLWZvci01MC1zdXN0YWluYWJsZS10aXJlcy_SAQA?oc=5","id":"CBMiUmh0dHBzOi8vd3d3LmFmdGVybWFya2V0bmV3cy5jb20vcGlyZWxsaS11bnZlaWxzLW5ldy1sb2dvLWZvci01MC1zdXN0YWluYWJsZS10aXJlcy_SAQA","guidislink":false,"published":"Fri, 22 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=265, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd3d3LmFmdGVybWFya2V0bmV3cy5jb20vcGlyZWxsaS11bnZlaWxzLW5ldy1sb2dvLWZvci01MC1zdXN0YWluYWJsZS10aXJlcy_SAQA?oc=5\" target=\"_blank\">Pirelli Unveils New Logo for 50%+ Sustainable Tires<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AftermarketNews.com (AMN)<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Pirelli Unveils New Logo for 50%+ Sustainable Tires - AftermarketNews.com (AMN)","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd3d3LmFmdGVybWFya2V0bmV3cy5jb20vcGlyZWxsaS11bnZlaWxzLW5ldy1sb2dvLWZvci01MC1zdXN0YWluYWJsZS10aXJlcy_SAQA?oc=5\" target=\"_blank\">Pirelli Unveils New Logo for 50%+ Sustainable Tires<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AftermarketNews.com (AMN)<\/font>","source.href":"https:\/\/www.aftermarketnews.com","source.title":"AftermarketNews.com (AMN)","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Pirelli has created a bespoke logo to identify tires that contain at least 50% materials of bio-based and recycled origin. The new marking – which depicts two arrows in a circle and will be adopted on new products – underlines Pirelli’s commitment to the environment, maintaining the high level of safety performance inherent in every single tire produced by the Italian firm. This new logo is also designed as a clear indication for customers, allowing them to choose more sustainable tires. The latest Pirelli marking was used for the first time on the P Zero E. This tire contains more than 55% of materials of bio-based and recycled origin throughout the entire range at launch, as certified by Bureau Veritas: a Bureau that verifies conformity and certification in quality, environment, health, safety, and social responsibility standards (ISO14021). Third-party verification of eco-compatible materials will continue to be standard across all future products that adopt the new logo. “For several years, Pirelli has consistently reduced its environmental impact: a policy confirmed by all the main sustainability indices, which have recognized our commitment and transparency both in terms of results and ethos,” said Giovanni Tronchetti Provera, head of sustainability and future mobility at Pirelli. “For this reason, for example, we indicate the percentage of sustainable materials by saying ‘at least’ rather than ‘up to’. We will now continue down this road, which our car manufacturer partners also recognize and appreciate,” Provera continued. Pirelli says its path towards reduced environmental impact includes the ever-increasing use of sustainable materials. Pirelli’s initial objective, originally set for 2025, has already been achieved two years early thanks to P Zero E, the company says. The next step, set for selected product lines by 2030, envisages the use of at least 60% of materials of bio-based origin and 12% recycled, with less than 30% of fossil-derived ingredients. “We aim to regularly improve these targets thanks to the technological innovation of all the different departments involved in tire development,” Pirelli says. In 2021, for example, Pirelli was first to produce an FSC (Forest Stewardship Council) certified tire that uses natural rubber and FSC rayon. As a result, customers had the guarantee that all materials sourced from forests came from plantations that promote biological diversity, while bringing economic sustainability to the lives of local communities and workers. Pirelli says the main challenge in developing the new P Zero E was to combine the need for sustainability with the high performance required from a UHP tire. The company adds this objective was reached thanks to these new materials, which include: LIGNIN Lignin comes from the scrap of the pulp and paper industry. Lignin contributes to tire durability and foreseen rolling resistance reduction. RICE HUSK ASH SILICA Rice husk ash silica derives from the scrap of rice cultivation. Silica is widely used in tread compounds to obtain a high level of performance in wet conditions. Rice husk ash silica is a good replacement for fossil-based silica in such tread applications. CIRCULAR CARBON BLACK Circular carbon black derives from end-of-life tires pyrolysis oil. Pyrolysis is a way to prevent landfill disposal of end-of-life tires. Carbon black is used in rubber compounds to optimize stability, strength, and durability of tires. BIO CIRCULAR POLYMERS Bio-circular polymers are made from monomers derived from used cooking oils or tire pyrolysis oil. They are a replacement for fossil-sourced polymers. NATURAL RUBBER Natural rubber is obtained from the latex of Hevea Brasiliensis, the rubber tree. This is a material 100% derived from biomass. BIO-RESINS Bio resins are plasticisers deriving from vegetal biomass such as plant seeds (sunflower or canola) or forest-based resins. Bio resins are versatile ingredients, providing a better balance of dry and wet performance. RAYON Rayon is a textile reinforcement of a tire, with fibers deriving from cellulose.","filter_flag":1}
{"title":"European Commission Adopts Measures Restricting Intentional Microplastics - Cosmetics & Toiletries","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5jb3NtZXRpY3NhbmR0b2lsZXRyaWVzLmNvbS9yZWd1bGF0aW9ucy9lY28tc3VzdGFpbmFibGUvbmV3cy8yMjg3NDQ2OS9ldXJvcGVhbi1jb21taXNzaW9uLWFkb3B0cy1tZWFzdXJlcy1yZXN0cmljdGluZy1pbnRlbnRpb25hbC1taWNyb3BsYXN0aWNz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5jb3NtZXRpY3NhbmR0b2lsZXRyaWVzLmNvbS9yZWd1bGF0aW9ucy9lY28tc3VzdGFpbmFibGUvbmV3cy8yMjg3NDQ2OS9ldXJvcGVhbi1jb21taXNzaW9uLWFkb3B0cy1tZWFzdXJlcy1yZXN0cmljdGluZy1pbnRlbnRpb25hbC1taWNyb3BsYXN0aWNz0gEA?oc=5","id":"CBMimgFodHRwczovL3d3dy5jb3NtZXRpY3NhbmR0b2lsZXRyaWVzLmNvbS9yZWd1bGF0aW9ucy9lY28tc3VzdGFpbmFibGUvbmV3cy8yMjg3NDQ2OS9ldXJvcGVhbi1jb21taXNzaW9uLWFkb3B0cy1tZWFzdXJlcy1yZXN0cmljdGluZy1pbnRlbnRpb25hbC1taWNyb3BsYXN0aWNz0gEA","guidislink":false,"published":"Wed, 27 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=270, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5jb3NtZXRpY3NhbmR0b2lsZXRyaWVzLmNvbS9yZWd1bGF0aW9ucy9lY28tc3VzdGFpbmFibGUvbmV3cy8yMjg3NDQ2OS9ldXJvcGVhbi1jb21taXNzaW9uLWFkb3B0cy1tZWFzdXJlcy1yZXN0cmljdGluZy1pbnRlbnRpb25hbC1taWNyb3BsYXN0aWNz0gEA?oc=5\" target=\"_blank\">European Commission Adopts Measures Restricting Intentional Microplastics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cosmetics & Toiletries<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"European Commission Adopts Measures Restricting Intentional Microplastics - Cosmetics & Toiletries","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5jb3NtZXRpY3NhbmR0b2lsZXRyaWVzLmNvbS9yZWd1bGF0aW9ucy9lY28tc3VzdGFpbmFibGUvbmV3cy8yMjg3NDQ2OS9ldXJvcGVhbi1jb21taXNzaW9uLWFkb3B0cy1tZWFzdXJlcy1yZXN0cmljdGluZy1pbnRlbnRpb25hbC1taWNyb3BsYXN0aWNz0gEA?oc=5\" target=\"_blank\">European Commission Adopts Measures Restricting Intentional Microplastics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cosmetics & Toiletries<\/font>","source.href":"https:\/\/www.cosmeticsandtoiletries.com","source.title":"Cosmetics & Toiletries","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"For certain \"leave-on\" cosmetic products, per the new restriction, due to their low contribution to the overall emissions of microplastics, as well as the potentially large impact on the cosmetics industry, the agency's committee for socio-economic analysis considered two additional measures as appropriate alternatives to the ban. The European Commission (EC) announced it has taken another major step to protect the environment by adopting measures that restrict microplastics intentionally added to products under the EU chemical legislation REACH. Per the agency, the new rules will prevent the release to the environment of approximately half a million tonnes of microplastics. The measures will prohibit the sale of microplastics, products to which microplastics have been intentionally added, and products that release those microplastics when used. The EC notes that when duly justified, exceptions and transition periods for the affected parties to adjust to the new rules apply. See related: European Commission to Expedite Phasing Out of Animal Testing Definitions and Scope The adopted restriction uses a broad definition of microplastics, covering all synthetic polymer particles below 5 mm that are organic, insoluble and resist degradation. The purpose is to reduce emissions of intentional microplastics from as many products as possible. Some examples of common products in the scope of the restriction are: The granular infill material used on artificial sports surfaces – reportedly the largest source of intentional microplastics in the environment; Cosmetics where microplastics are used for multiple purposes, such as exfoliation (microbeads) or obtaining a specific texture, fragrance or color; and Detergents, fabric softeners, glitter, fertilizers, plant protection products, toys, medicines and medical devices. The EC adds that products used at industrial sites or not releasing microplastics during use are exempt from the sale ban but their manufacturers must provide instructions about how to use and dispose of the products to prevent microplastic emissions. The first measures, such as the ban on loose glitter and microbeads, will apply once the restriction enters into force — 20 days after the Sept. 25, 2023 announcement. In other cases, the sales ban will apply after a longer period to give affected stakeholders the time to develop and switch to alternatives. See related: La Pink Introduces Microplastic-free Skin Care Formulations in India Cosmetic Specifications The adopted measures specify that, concerning the ban on microbeads, i.e., synthetic polymer microparticles for use as an abrasive, namely to exfoliate, polish or clean, mainly used in rinse-off cosmetic products or detergents, no transitional period was proposed, as industry was expected to have voluntarily phased out their use by 2020. For certain \"leave-on\" cosmetic products, such as makeup, lip products and nail products, per the new restriction, due to their low contribution to the overall emissions of microplastics, as well as the potentially large impact on the cosmetics industry of a ban of synthetic polymer microparticles in those products, the agency's committee for socio-economic analysis (SEAC) considered two additional measures as appropriate alternatives to the ban on the placing on the market of those products after a six-year transitional period (as proposed by the Annex XV dossier). The additional measures included either: Appropriate instructions for use and disposal, or A transitional period longer than six years. However, the measures also cite that uncertainties related to the different impacts on industry and concerning releases did not allow the agency's committee for SEAC to conclude whether either option would be more appropriate than a ban and a six-year transitional period.","filter_flag":1}
{"title":"New REGARD Products Make Commercial Cleaning More Sustainable - GlobeNewswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wOS8yOC8yNzUxMzU2LzAvZW4vTmV3LVJFR0FSRC1Qcm9kdWN0cy1NYWtlLUNvbW1lcmNpYWwtQ2xlYW5pbmctTW9yZS1TdXN0YWluYWJsZS5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wOS8yOC8yNzUxMzU2LzAvZW4vTmV3LVJFR0FSRC1Qcm9kdWN0cy1NYWtlLUNvbW1lcmNpYWwtQ2xlYW5pbmctTW9yZS1TdXN0YWluYWJsZS5odG1s0gEA?oc=5","id":"CBMiiAFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wOS8yOC8yNzUxMzU2LzAvZW4vTmV3LVJFR0FSRC1Qcm9kdWN0cy1NYWtlLUNvbW1lcmNpYWwtQ2xlYW5pbmctTW9yZS1TdXN0YWluYWJsZS5odG1s0gEA","guidislink":false,"published":"Thu, 28 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=271, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wOS8yOC8yNzUxMzU2LzAvZW4vTmV3LVJFR0FSRC1Qcm9kdWN0cy1NYWtlLUNvbW1lcmNpYWwtQ2xlYW5pbmctTW9yZS1TdXN0YWluYWJsZS5odG1s0gEA?oc=5\" target=\"_blank\">New REGARD Products Make Commercial Cleaning More Sustainable<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New REGARD Products Make Commercial Cleaning More Sustainable - GlobeNewswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wOS8yOC8yNzUxMzU2LzAvZW4vTmV3LVJFR0FSRC1Qcm9kdWN0cy1NYWtlLUNvbW1lcmNpYWwtQ2xlYW5pbmctTW9yZS1TdXN0YWluYWJsZS5odG1s0gEA?oc=5\" target=\"_blank\">New REGARD Products Make Commercial Cleaning More Sustainable<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","source.href":"https:\/\/www.globenewswire.com","source.title":"GlobeNewswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"BURLINGTON, Ontario, Sept. 28, 2023 (GLOBE NEWSWIRE) -- Bunzl Canada announced today the recent launch of its new, environmentally preferable cleaning product line under the REGARD™ brand banner. Utilizing smart, innovative packaging is just one way the new line effectively reduces the environmental impact associated with procurement and delivery. Consistent with Bunzl’s commitment to offering more sustainable solutions to customers in all its business segments, REGARD™ Eco-Friendlier Cleaning Solutions is a new line of ECOLOGO® and Green Seal™-certified, environmentally responsible cleaning products. The line is formulated to be non-caustic, hypoallergenic and provide a safer and healthier cleaning alternative. Most importantly, the high-performance products deliver exceptional cleaning results. “More than ever, there’s a greater awareness of the importance of more sustainable cleaning practices,” said Jay Creek, Bunzl Cleaning & Hygiene’s Director of National Accounts. “Expectations have increased to ensure both the cleanliness and overall health of the building, its occupants, and it’s cleaning staff.” The “eco-friendlier” aspects of these new products extend to both packaging and formulations. From disinfectants to washroom cleaners, each product is designed to minimize waste and resource consumption. REGARD™ Eco-Friendlier Cleaning Solutions’ packaging is made with 100% post-consumer recycled content, which exceeds the ECOLOGO® standard. The exclusion of virgin plastics is critical in reducing the amount of crude oil, gas and emissions required to for new plastic production. This initiative further supports the circular economy and the secondary market for recycled plastic. REGARD™ Eco-Friendlier Cleaning Solutions are packaged to ensure every shipping pallet contains more units than pallets carrying products with traditional packaging to achieve a lower overall ecological footprint. Although many traditional cleaning chemicals come in circular bottles that provide stability and good pouring flow, they also leave a lot of unused space inside boxes when packaged and are not efficient in shipping. REGARD™ Eco-Friendlier Cleaning Solutions bottles have been purposefully designed in a unique ellipses shape that results in more product per box and less warehousing and transportation resource waste. The concentrated formulas in the new REGARD line also help reduce environmental impact by providing more end-use cleaning solution delivered in fewer shipments. A single 3.78L bottle of highly concentrated REGARD™ Eco-Friendlier Glass and Multi-Surface Cleaner can produce more than 245 litres of diluted solution, equivalent to 64 containers of 3.8 litre pre-mixed glass cleaner—a significant environmental and cost savings. “REGARD™ Eco-Friendlier Cleaning Solutions are world-class products with world-class performance - at a price that's competitive and more sustainable,” said Creek. According to Brock Tully, Vice President, Bunzl Cleaning and Hygiene, the company’s customers increasingly seek more sustainable cleaning product alternatives with the required efficacy for a wide range of commercial cleaning applications. “Our customers count on us to lead the way with innovation that helps them achieve their sustainability objectives while maintaining the highest standards of cleaning quality,” said Brock Tully, Vice President, Bunzl Cleaning and Hygiene. “Our new REGARD™ Eco-Friendlier Cleaning Solutions offers a complete line of products designed to do exactly that.” For more information on REGARD Eco-Friendlier Cleaning Solutions and the full line of products, visit bunzlch.ca\/products\/regard-eco-line\/ About Bunzl Canada Bunzl Canada Inc. (bunzlcanada.ca) provides the cleaning and hygiene products and equipment, food and retail packaging, safety products and industrial supplies which keep over 45,000 Canadian businesses running optimally, every day. The company brings its customers the advantage of global sourcing, product innovation and national scale combined with responsive local service and deep category expertise. Bunzl Canada Inc. is a division of Bunzl Distribution USA, LLC. About Bunzl Distribution Bunzl Distribution USA, LLC (bunzldistribution.com), headquartered in St. Louis, Mo., is the largest division of London-based Bunzl plc, an international distribution and outsourcing group. With more than 100 distribution centre throughout the U.S., Canada, Mexico and the Caribbean, Bunzl supplies a wide range of products to food processors, supermarkets, retailers, convenience stores and other users. Media Inquiries Margo Hunnisett Vice President, Marketing & Communications Bunzl Canada Inc. margo.hunnisett@bunzlcanada.ca (905) 630-3749 Photos accompanying this announcement are available at https:\/\/www.globenewswire.com\/NewsRoom\/AttachmentNg\/ed11ed07-0e3c-4c29-944f-7171219b3b69 https:\/\/www.globenewswire.com\/NewsRoom\/AttachmentNg\/2c7a2845-33b9-4c71-9125-4fcedb0315c3 https:\/\/www.globenewswire.com\/NewsRoom\/AttachmentNg\/2a8f7697-8cf0-4450-a673-55b7b5809f8e https:\/\/www.globenewswire.com\/NewsRoom\/AttachmentNg\/11644a8e-2d3f-462f-8fd9-b7f552e4d3ad https:\/\/www.globenewswire.com\/NewsRoom\/AttachmentNg\/b6d191c5-ecb8-4a40-8e47-c0ac8eb483e2","filter_flag":1}
{"title":"Sustainability: How to measure the impact of cosmetic products? - Premium beauty","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9zdXN0YWluYWJpbGl0eS1ob3ctdG8tbWVhc3VyZS10aGUsMjI1NTnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9zdXN0YWluYWJpbGl0eS1ob3ctdG8tbWVhc3VyZS10aGUsMjI1NTnSAQA?oc=5","id":"CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9zdXN0YWluYWJpbGl0eS1ob3ctdG8tbWVhc3VyZS10aGUsMjI1NTnSAQA","guidislink":false,"published":"Mon, 11 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=254, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9zdXN0YWluYWJpbGl0eS1ob3ctdG8tbWVhc3VyZS10aGUsMjI1NTnSAQA?oc=5\" target=\"_blank\">Sustainability: How to measure the impact of cosmetic products?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sustainability: How to measure the impact of cosmetic products? - Premium beauty","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9zdXN0YWluYWJpbGl0eS1ob3ctdG8tbWVhc3VyZS10aGUsMjI1NTnSAQA?oc=5\" target=\"_blank\">Sustainability: How to measure the impact of cosmetic products?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","source.href":"https:\/\/www.premiumbeautynews.com","source.title":"Premium beauty","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Taking place in Paris on October 30 - 1st November 2023, the next edition of the Sustainable Cosmetics Summit will discuss the various impacts of cosmetic and personal care products. The summit will feature green ingredients, sustainability metrics, and biodiversity & customer impacts. The highlights of the agenda include: Measuring Impacts of personal care products For the first time, the summit will give detailed insights into how sustainability associated impacts of personal care products are measured. Professor Miguel Mendonca Reis Brandao from KTH University (Sweden) will host a workshop on sustainability metrics. He will show how environmental, social, and financial indicators can be utilised by cosmetic and related firms in their sustainability programmes. The EcoBeautyScore Consortium will give an update on its science-based approach to measure impacts and its harmonised scoring system for cosmetic products. Ioana Dobruscu from Water Footprint Implementation will explain how operators can measure the water footprint of such products. Aurelie Weinling from Garnier will show how the brand is reducing its impacts via its Green Beauty initiative. Garnier has pledged to move away from virgin plastic and to have CO2 neutral factories by 2025. Climate-Friendly Cosmetics The climate emergency is putting pressure on cosmetic companies to reduce their carbon emissions. Lucy Kirkup from ClimatePartner will discuss how operators can measure, reduce, and offset their carbon emissions. Details will be given of its certification scheme, which is gaining traction with cosmetic brands. Sabine Kaestner from one of Europe’s leading natural cosmetic companies Lavera, will share their experiences in adopting the ClimatePartner label. Regenerative Agriculture A growing number of cosmetic & raw material firms are looking at adopt regenerative agriculture because of its sustainability merits. Davines is a frontrunner, setting up the European Regenerative Organic Center in partnership with the Rodale Institute. Its Research Director Dario Fornaro will give details of the cosmetic raw materials it is growing according to regenerative agriculture, which improves soil fertility, enhances biodiversity, sequestrates carbon, and can have socio-economic benefits. Sustainable Coconut Charter Coconut oil is widely used in personal care products, however the industry is facing a crisis. Many of the coconut palms in South-East Asia are reaching the end of their lives, whilst farmers are leaving the industry. Laura Schlebes from AAK will explain how the Sustainable Coconut Charter aims to improve farmer livelihoods, lessen the carbon footprint of coconuts and boost supply to meet rising global demand. AAK is one of the first signatories of the Sustainable Coconut Charter. Biodiversity Impacts At last year’s UN Biodiversity conference, 195 countries made a commitment to protect 30% of land and water by 2030. An industry expert will discuss the implications of the Kunming-Montreal Global Biodiversity Framework, especially in terms of sourcing of cosmetic ingredients. Emma Trogen, Deputy Director General of Cosmetics Europe, will share some of the initiatives the industry association is undertaking to protect biodiversity. Novel Green Chemicals New technologies are facilitating the move to green cosmetic ingredients. There is high interest in precision fermentation as it can produce sustainable alternatives to petroleum-based ingredients. The Danish start-up Biosyntia will show how it is using fermentation techniques to produce cosmetic ingredients. Dr. Prateek Mahalwar, Founder of Bioweg, will explain how it is using new technologies to make micropowders and rheology modifiers from agri-food waste. The start-up recently partnered with Ginkgo Bioworks to create sustainable alternatives to plastics. Other speakers will cover innovations in upcycled materials and ingredients for waterless cosmetics. Regulations Update Details will be given of the new EU deforestation-free regulation which ensures products sold in Europe do not come from deforested or degraded land. The regulation applies to palm oil, soya, cocoa, and other agricultural commodities. Farmforce will show how its technology can help operators develop deforestation-free supply chains for their raw materials. Greenwashing is a major issue in the cosmetics industry, as many products are marketed as natural, organic, vegan, free-from, etc. without meeting any industry standards or certification. The EU Green Claims Directive aims to establish clear criteria for companies to make such claims. The Obelis Group will give details on the proposed directive and its marketing implications to brands. Responsible consumption Various studies show the highest environmental impact of cosmetic and personal care products is at the consumer level. For rinse-off products like shampoos and soaps, over 95% of carbon emissions are from consumer use. Approaches to encourage responsible consumption and disposal of cosmetic & personal care products will be discussed. Dr. Helen Holmes from the Sustainable Consumption Institute (University of Manchester) will discuss approaches to modify consumer behaviour for sustainability. Julien Kaibeck from the Slow Cosmetique Association will share its experiences in encouraging consumers to make greener choices when buying personal care products. Future predictions As sustainability issues rise on the corporate agenda, there are questions about the future. How will raw materials and packaging change so there will be more sustainable cosmetics? How are emerging trends likely to influence product development? How will consumer behaviour evolve in the coming years? The futurist Monique Large (PollenConsulting) will give some of her predictions in the opening keynote of the summit. Organized by Ecovia Intelligence, the European edition of the Sustainable Cosmetics Summit will be hosted at the Crowne-Plaza - Republique Paris. More information is available from www.sustainablecosmeticssummit.com\/Europe\/","filter_flag":1}
{"title":"Gruppo Mastrotto, a commited tannery - Leather - Premiere Vision","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LnByZW1pZXJldmlzaW9uLmNvbS9lbi9tYWdhemluZS9tYXN0cm90dG8tb3JnYW5pYy1sZWF0aGVyL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LnByZW1pZXJldmlzaW9uLmNvbS9lbi9tYWdhemluZS9tYXN0cm90dG8tb3JnYW5pYy1sZWF0aGVyL9IBAA?oc=5","id":"CBMiRWh0dHBzOi8vd3d3LnByZW1pZXJldmlzaW9uLmNvbS9lbi9tYWdhemluZS9tYXN0cm90dG8tb3JnYW5pYy1sZWF0aGVyL9IBAA","guidislink":false,"published":"Thu, 14 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=257, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LnByZW1pZXJldmlzaW9uLmNvbS9lbi9tYWdhemluZS9tYXN0cm90dG8tb3JnYW5pYy1sZWF0aGVyL9IBAA?oc=5\" target=\"_blank\">Gruppo Mastrotto, a commited tannery - Leather<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premiere Vision<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Gruppo Mastrotto, a commited tannery - Leather - Premiere Vision","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LnByZW1pZXJldmlzaW9uLmNvbS9lbi9tYWdhemluZS9tYXN0cm90dG8tb3JnYW5pYy1sZWF0aGVyL9IBAA?oc=5\" target=\"_blank\">Gruppo Mastrotto, a commited tannery - Leather<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premiere Vision<\/font>","source.href":"https:\/\/www.premierevision.com","source.title":"Premiere Vision","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"New window Share on Facebook New window Share on Twitter New window Share on Linkedin New window Share on Email Gruppo Mastrotto is one of the main players in the leather industry. Starting out as a family business in Italy, the tannery is now a large international organization, with operations spanning 15 production sites worldwide. Specializing in the manufacturing of bovine leathers, the company caters to a diverse range of industries, including the clothing, accessories, furniture, automotive and aviation sectors. As with the fashion industry as a whole, the leather sector, prompted by the environmental crisis, has focused in recent years on finding new solutions to meet the new challenges of sustainability. Gruppo Mastrotto has long been committed to reducing its environmental impact. Alongside the development of new products, the tannery is strengthening its environmental management, the main driver for the transformation of the leather industry, with a production approach that involves implementing and monitoring best practices throughout the value chain. New industrial tools and methods are focused on key areas such as traceability, water and energy consumption, effluent management, management of chemical inputs. Thanks to its research and development efforts, Mastrotto has obtained LWG Gold Standard and ISO 14001 certifications. On the product side, Mastrotto’s innovative collections push the boundaries of the industry in terms of impacts. The tannery is tackling the issue of circularity and the reduction of impacts in the transformation of raw hides, a key area for improvement. The challenge is to produce materials that are resistant, but which disintegrate at the end of their lifecycles, and do so without harming the environment. The company’s Organic Leather range meets this challenge. The leathers are of European origin, and tanned in metal-free conditions using organic materials. Finishing is done with waxes and anilines. This process ensures that leathers are highly biodegradable, in line with ISO 20136 standards: 90% of leather is biodegraded within 6 months (under specific conditions). The virtues of this innovation are numerous and impact the entire production chain : reduction of chemical impacts, management of product end-of-life, management of effluents and production waste. This kind of initiative, applied on an industrial scale, positions the Gruppo Mastrotto tannery as an innovation leader in the leather industry.","filter_flag":1}
{"title":"DuPont demonstrates how PPE can be more sustainable at A+A - Cleanroom Technology","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vY2xlYW5yb29tdGVjaG5vbG9neS5jb20vZHVwb250LWRlbW9uc3RyYXRlcy1ob3ctcHBlLWNhbi1iZS1tb3JlLXN1c3RhaW5hYmxlLWF0LWEtYS0yMTEzNzLSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vY2xlYW5yb29tdGVjaG5vbG9neS5jb20vZHVwb250LWRlbW9uc3RyYXRlcy1ob3ctcHBlLWNhbi1iZS1tb3JlLXN1c3RhaW5hYmxlLWF0LWEtYS0yMTEzNzLSAQA?oc=5","id":"CBMiYWh0dHBzOi8vY2xlYW5yb29tdGVjaG5vbG9neS5jb20vZHVwb250LWRlbW9uc3RyYXRlcy1ob3ctcHBlLWNhbi1iZS1tb3JlLXN1c3RhaW5hYmxlLWF0LWEtYS0yMTEzNzLSAQA","guidislink":false,"published":"Thu, 14 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=257, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vY2xlYW5yb29tdGVjaG5vbG9neS5jb20vZHVwb250LWRlbW9uc3RyYXRlcy1ob3ctcHBlLWNhbi1iZS1tb3JlLXN1c3RhaW5hYmxlLWF0LWEtYS0yMTEzNzLSAQA?oc=5\" target=\"_blank\">DuPont demonstrates how PPE can be more sustainable at A+A<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cleanroom Technology<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"DuPont demonstrates how PPE can be more sustainable at A+A - Cleanroom Technology","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vY2xlYW5yb29tdGVjaG5vbG9neS5jb20vZHVwb250LWRlbW9uc3RyYXRlcy1ob3ctcHBlLWNhbi1iZS1tb3JlLXN1c3RhaW5hYmxlLWF0LWEtYS0yMTEzNzLSAQA?oc=5\" target=\"_blank\">DuPont demonstrates how PPE can be more sustainable at A+A<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cleanroom Technology<\/font>","source.href":"https:\/\/cleanroomtechnology.com","source.title":"Cleanroom Technology","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"At A+A 2023, DuPont is set to demonstrate how personal protective equipment (PPE) can be more sustainable without compromising safety and comfort. DuPont’s latest Tyvek, Nomex, and Kevlar solutions and initiatives enhance worker protection and comfort, help reduce the environmental footprint of PPE, and support the companies at the forefront of the green transition. Workers across the growing renewable energy sector rely on PPE for their safety, from gigafactories to recycling carbon fibre used in wind turbine blades. On the other hand, reducing waste, emissions, and pollution linked to PPE is essential. During the COVID-19 pandemic alone, PPE led to up to 87,000 tonnes of waste globally, according to the World Health Organisation (WHO). DuPont is improving PPE sustainability along the value chain, from product development and manufacturing to packaging, distribution, and recycling. One of the highlights is the DuPont Tyvek 400 Dual TG coverall that provides a head-to-toe frontal barrier against hazardous chemicals in electric vehicle (EV) battery production while enhancing comfort for workers wearing PPE over long shifts. Additionally, Tyvek 400 Dual TG helps reduce waste by eliminating individual packaging and reducing the number of user instructions from one per garment to one per box. Like this story? Subscribe to Cleanroom Technology magazine for incisive analysis of the latest news and developments in hi-tech industries manufacturing in controlled environments. From the end of 2023, packaging across the DuPont Tyvek industrial range will be gradually introduced to the market, incorporating up to 50% PCR (Post Consumer Recycle) content, reducing the use of first grade polymers. Visitors at A+A will also get an exclusive preview of the new DuPont Tychem 6000 Air-Line (AL) ventilated coverall. The suit combines maximum protection against hazardous liquids and particles with ease of use and comfort. Some key features include a simplified closure for easier donning and improved comfort thanks to constant air exchange and body cooling. Keeping workers safe remains our priority - Andrzej Palka, Marketing Manager EMEA at DuPont Personal Protection Tychem 6000 AL will be available in four options - with or without attached dissipative socks and under gloves - to meet the needs of multiple applications across the chemical, pharmaceutical, and oil and gas industries. Besides showcasing its new products, DuPont will present its latest initiatives to help minimise the environmental impact of PPE. For example, the company recently launched a new programme that will help users to recycle non-contaminated DuPont Tyvek protective garments, which can help to reduce the amount of waste currently being landfilled or incinerated. Visitors can also learn about the latest Nomex PPE solutions. The newly launched DuPont Nomex Comfort with EcoForce technology offers best-in-class flame resistance and chemical protection while taking the sustainability of PPE to the next level. The fabric’s chemical-repellent finish is made from over 50% bio-based materials and is not based on fluorine chemistry. Additionally, Nomex Comfort with EcoForce technology is highly durable, as its inherent FR protection cannot be washed or worn away, decreasing the need for frequent replacements. At A+A, we want to demonstrate how effective worker protection can go hand in hand with improved comfort - Andrzej Palka, Marketing Manager EMEA at DuPont Personal Protection The innovative portfolio of DuPont Kevlar engineered yarns, developed to help deliver comfortable multi-hazard protection for gloves and sleeves, will also be highlighted at the DuPont booth. The Kevlar engineered yarns portfolio can provide industry-leading protection against cut, heat, flame, and electric arc hazards without compromising comfort and dexterity. Gloves and sleeves made with Kevlar also help reduce waste as they can be laundered more than 10 times extending their life span and require 25% less material than other competitive products. Furthermore, most Kevlar fibres and yarns are certified by OEKO-TEX 100 meeting the requirement of a safer textile against harmful substances. \"Keeping workers safe remains our priority. At A+A, we want to demonstrate how effective worker protection can go hand in hand with improved comfort and sustainability,” said Andrzej Palka, Marketing Manager EMEA at DuPont Personal Protection.","filter_flag":1}
{"title":"Vivobarefoot Is Serious About Circularity and Scoring Its Environmental Impact - Footwear News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vZm9vdHdlYXJuZXdzLmNvbS9idXNpbmVzcy9idXNpbmVzcy1uZXdzL3Zpdm9iYXJlZm9vdC1zdXN0YWluYWJpbGl0eS1jaXJjLWRlYWwtbGNhLTEyMDM1MDgwODkv0gFpaHR0cHM6Ly9mb290d2Vhcm5ld3MuY29tL2J1c2luZXNzL2J1c2luZXNzLW5ld3Mvdml2b2JhcmVmb290LXN1c3RhaW5hYmlsaXR5LWNpcmMtZGVhbC1sY2EtMTIwMzUwODA4OS9hbXAv?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vZm9vdHdlYXJuZXdzLmNvbS9idXNpbmVzcy9idXNpbmVzcy1uZXdzL3Zpdm9iYXJlZm9vdC1zdXN0YWluYWJpbGl0eS1jaXJjLWRlYWwtbGNhLTEyMDM1MDgwODkv0gFpaHR0cHM6Ly9mb290d2Vhcm5ld3MuY29tL2J1c2luZXNzL2J1c2luZXNzLW5ld3Mvdml2b2JhcmVmb290LXN1c3RhaW5hYmlsaXR5LWNpcmMtZGVhbC1sY2EtMTIwMzUwODA4OS9hbXAv?oc=5","id":"CBMiZWh0dHBzOi8vZm9vdHdlYXJuZXdzLmNvbS9idXNpbmVzcy9idXNpbmVzcy1uZXdzL3Zpdm9iYXJlZm9vdC1zdXN0YWluYWJpbGl0eS1jaXJjLWRlYWwtbGNhLTEyMDM1MDgwODkv0gFpaHR0cHM6Ly9mb290d2Vhcm5ld3MuY29tL2J1c2luZXNzL2J1c2luZXNzLW5ld3Mvdml2b2JhcmVmb290LXN1c3RhaW5hYmlsaXR5LWNpcmMtZGVhbC1sY2EtMTIwMzUwODA4OS9hbXAv","guidislink":false,"published":"Fri, 08 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=251, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vZm9vdHdlYXJuZXdzLmNvbS9idXNpbmVzcy9idXNpbmVzcy1uZXdzL3Zpdm9iYXJlZm9vdC1zdXN0YWluYWJpbGl0eS1jaXJjLWRlYWwtbGNhLTEyMDM1MDgwODkv0gFpaHR0cHM6Ly9mb290d2Vhcm5ld3MuY29tL2J1c2luZXNzL2J1c2luZXNzLW5ld3Mvdml2b2JhcmVmb290LXN1c3RhaW5hYmlsaXR5LWNpcmMtZGVhbC1sY2EtMTIwMzUwODA4OS9hbXAv?oc=5\" target=\"_blank\">Vivobarefoot Is Serious About Circularity and Scoring Its Environmental Impact<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Footwear News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Vivobarefoot Is Serious About Circularity and Scoring Its Environmental Impact - Footwear News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vZm9vdHdlYXJuZXdzLmNvbS9idXNpbmVzcy9idXNpbmVzcy1uZXdzL3Zpdm9iYXJlZm9vdC1zdXN0YWluYWJpbGl0eS1jaXJjLWRlYWwtbGNhLTEyMDM1MDgwODkv0gFpaHR0cHM6Ly9mb290d2Vhcm5ld3MuY29tL2J1c2luZXNzL2J1c2luZXNzLW5ld3Mvdml2b2JhcmVmb290LXN1c3RhaW5hYmlsaXR5LWNpcmMtZGVhbC1sY2EtMTIwMzUwODA4OS9hbXAv?oc=5\" target=\"_blank\">Vivobarefoot Is Serious About Circularity and Scoring Its Environmental Impact<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Footwear News<\/font>","source.href":"https:\/\/footwearnews.com","source.title":"Footwear News","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Vivobarefoot was one of the first companies to use Bloom bio-based foam in its footwear continues to push for a more sustainable shoemaking process. This week, the U.K.-based footwear brand announced a new partnership with textile-to-textile recycling company Circ to kickstart cross-industry collaboration in order to develop more circular design solutions. The two B Corp companies said they will work together to design and develop footwear uppers made entirely of a single material (polyester) that can be chemically recycled and reused in the production of new footwear without the need to add any virgin materials. Their end goal is to achieve a shoe that is truly “recyclable.” Their joint creation — already dubbed the Vivobarefoot Primus Circular — is slated to launch in fall 2024. Related Will the New York Fashion Act 'Get Over the Finish Line'? Adidas CEO Hints Brand May Cease Using K-Leather 'Faster Than You Think' Crocs Expands Its Pre-Loved Shoe Takeback Program After 'Encouraging' Pilot Project “Our north star goal at Vivobarefoot is to develop performance footwear that is both durable and fully recyclable — and for us that means being able to use our recycled materials to make new footwear, rather than downcycling them,” said Charlotte Pumford, Vivobarefoot’s head of regeneration. Watch on FN The companies noted that the current method used by many brands to recycle footwear involves a mechanical process of shredding and grinding the materials for reuse. But those materials are often turned into new products that cannot be recycled in the future, eventually ending up in a landfill. By contrast, Circ says its process reduces cotton and polyester textiles to their fundamental molecules, which can be rebuilt into high-quality lyocell and polyester multiple times, and which are competitive with virgin materials. Up to this point, Circ has focused primarily on apparel textiles, but is embracing a new challenge in footwear. “Shoes are a complicated and challenging problem for recyclers that, to solve, necessitates incorporating circularity into the design from the start. Transforming shoes will take time and effort,” said Circ chief business officer Luke Henning. “When we met the team at Vivobarefoot, we immediately knew we had found a like-minded and committed team who lived sustainability and circularity. Their passion for the planet mirrors ours, making them a natural fit.” Galahad Clark, co-founder of Vivobarefoot, has been in the sustainability game for roughly 20 years, going back to the early aughts, when he started another eco-minded footwear brand, Terra Plana. At Vivobarefoot, which launched in 2012, he has taken a holistic view of responsible shoemaking, grounding the brand in the principles of natural, barefoot movement and making minimalist footwear with better materials and processes. “The definition [of sustainability] we really like is from a guy called John Ehrenfeld, who said it is about all life on Earth being able to flourish,” Clark told FN last month during a visit to the States. “Products should help us connect more with nature and or they should help us feel more human, improve human health and ask important environmental and ethical questions.” But he said at least two of those goals — connecting with nature and improving health — are ignored in most studies of environmental impact. Which is why Vivobarefoot created its own lifecycle analysis (LCA) blueprint to more fully understand and communicate its impact. Its V-Matrix scoring system was developed with its impact analysis partner, Made2Flow, and goes beyond many of the typical LCAs by also examining a product’s durability, complexity and repairability. It draws from primary and secondary data, as well as its own performance indicators, to assign each shoe an overall sustainability score (the higher the score, the less harmful the product). The Primus Lite III will be the first Vivobarefoot shoe to be scored by the V-Matrix and will be followed by the Primus Trail, Primus Lite Knit, Tracker II and Tracker Forest through the end of this year. Vivobarefoot Primus Lite III When it comes to understanding environmental impact, Clark compared it to the rigorous transparency in the financial markets. “The world has fought long and hard to create accounting standards, so you can compare different companies and financial performances,” he said. “When it comes to impact reporting, everybody’s really just marking their own homework and grading it as they see fit. In a perfect world, we’d be able to do all of our reporting by an agreed method, so our apples look like other people’s apples. But we’re comparing apples with oranges and grapes and who knows what else.” He noted that since starting to work with Made2Flow, Vivobarefoot has already uncovered surprising results. For instance, he said they discovered that many of the no-sew technologies used to construct shoes are even worse for the environment than expected. As for what it will take for manufacturers to align under one model, he predicted that government action will be needed, starting with the European Union’s proposed new legislation. Those regulations are set to start in 2025, though details are still limited, said Clark. “Companies right now are having to take a guess which aspects of which [environmental] frameworks they think [the EU] is going to actually enforce. So the good companies are saying — which everyone should really do anyway — let’s basically use them all.”","filter_flag":1}
{"title":"Turning waste textiles into new products in Hull - Innovation in Textiles","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3Lmlubm92YXRpb25pbnRleHRpbGVzLmNvbS90dXJuaW5nLXdhc3RlLXRleHRpbGVzLWludG8tbmV3LXByb2R1Y3RzLWluLWh1bGwv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3Lmlubm92YXRpb25pbnRleHRpbGVzLmNvbS90dXJuaW5nLXdhc3RlLXRleHRpbGVzLWludG8tbmV3LXByb2R1Y3RzLWluLWh1bGwv0gEA?oc=5","id":"CBMiVmh0dHBzOi8vd3d3Lmlubm92YXRpb25pbnRleHRpbGVzLmNvbS90dXJuaW5nLXdhc3RlLXRleHRpbGVzLWludG8tbmV3LXByb2R1Y3RzLWluLWh1bGwv0gEA","guidislink":false,"published":"Fri, 15 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=15, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=258, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3Lmlubm92YXRpb25pbnRleHRpbGVzLmNvbS90dXJuaW5nLXdhc3RlLXRleHRpbGVzLWludG8tbmV3LXByb2R1Y3RzLWluLWh1bGwv0gEA?oc=5\" target=\"_blank\">Turning waste textiles into new products in Hull<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Innovation in Textiles<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Turning waste textiles into new products in Hull - Innovation in Textiles","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3Lmlubm92YXRpb25pbnRleHRpbGVzLmNvbS90dXJuaW5nLXdhc3RlLXRleHRpbGVzLWludG8tbmV3LXByb2R1Y3RzLWluLWh1bGwv0gEA?oc=5\" target=\"_blank\">Turning waste textiles into new products in Hull<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Innovation in Textiles<\/font>","source.href":"https:\/\/www.innovationintextiles.com","source.title":"Innovation in Textiles","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"New factory will house a complete, state-of-the-art recycling and remanufacturing process for waste textiles, from clothing to accessories and home furnishings. Yorkshire waste management firm MYGroup is building a sustainable textiles factory at its Hull site with a £500,000 investment that will create up to 30 jobs. The new factory will see waste textiles remanufactured end-to-end into new products in a UK-first that MYGroup says will put Hull on the map as an innovation centre for textiles recycling, leading the charge in reducing the environmental impact of and promoting circularity in the fashion industry. The local community in Hull stands to benefit from the factory's opening, with the creation of up to 30 new jobs, contributing to the economic growth of the city region and bringing new skills to the area. The two-storey,1300 square metre factory space, being constructed within a derelict former laboratory and offices within MYGroup’s Morley Street recycling campus in Hull, will house a complete, state-of-the-art recycling and remanufacturing process for waste textiles, from clothing to accessories and home furnishings. Textiles will enter a sorting and grading room before being processed through a commercial-grade cleaning cycle and a deconstruction process to remove hardware, such as zippers and buttons, and separate multi-materials. Once cleaned and broken down to bare constituent materials, the textiles will be transformed into new garments, accessories and other products by MYGroup’s dedicated ReFactory team, working in a state-of-the-art pattern-cutting and design studio, as well as an industrial-grade machine production floor. MYGroup will employ a multi-disciplinary team at the new factory, from designers, pattern cutters and sewing machinists, to sales and administrative support staff. By adopting an end-to-end recycling and remanufacturing process, the factory aims to divert a substantial portion of textile waste from landfill and incineration. The circular approach will ensure that discarded textiles find new life, reducing the demand for virgin resources and mitigating the environmental impact of textile production. Sustainability will be built into the very fabric of the building, with MYGroup’s own MYboard, a material similar in consistency to plywood, produced entirely from plastic the company recycles at its Hull facility. MYboard will be used for interior walls, together with other environmentally conscious design elements, such as sensor-lighting in high-traffic areas and water-saving toilets. MYGroup also recently purchased industrial sewing machines and other specialist equipment from a ceased clothing manufacturer, further ensuring sustainability and circularity in the approach to the factory launch. The first phase of the factory will be complete this Autumn, including the sewing floor, pattern-cutting studio and storage. Further phases will add the sorting, grading and washing spaces, as well as offices and a training centre. A further £400,000 investment is planned for the factory, which is set to be fully operational by the spring of 2024. Katie Robinson, Textiles Manager, MYGroup, said: “The landscape of the fashion and textiles industry is changing. No longer can the linear model of ‘take, make and dispose’ continue. Legislation to enforce a more circular approach is fast approaching and we are seeing more and more of the largest brands in the industry engaging with us on recycling their waste textiles.” Steve Carrie, Director, MYGroup, added: “We are proud to launch this pioneering venture that showcases the company and the city of Hull's commitment to sustainability and innovation. We’re ahead of the curve and building a factory of the future – our end-to-end recycling process combined with remanufacturing capabilities will revolutionise the way our industry thinks about textiles waste.” Established for over 30 years, MYGroup is trusted by some of the largest brands and organisations in the UK to process over 800,000 tons of waste a year, fully in-house and through transparent procedures across four state-of-the-art facilities in Yorkshire. mygroupltd.com","filter_flag":1}
{"title":"Octavia Spencer Steals Show as Apple Announces New iPhone 15 - Kiss 95.1","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8va2lzczk1MS5jb20vMjAyMy8wOS8xMi9vY3RhdmlhLXNwZW5jZXItc3RlYWxzLXNob3ctYXMtYXBwbGUtYW5ub3VuY2VzLW5ldy1pcGhvbmUtMTUv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8va2lzczk1MS5jb20vMjAyMy8wOS8xMi9vY3RhdmlhLXNwZW5jZXItc3RlYWxzLXNob3ctYXMtYXBwbGUtYW5ub3VuY2VzLW5ldy1pcGhvbmUtMTUv0gEA?oc=5","id":"CBMiXGh0dHBzOi8va2lzczk1MS5jb20vMjAyMy8wOS8xMi9vY3RhdmlhLXNwZW5jZXItc3RlYWxzLXNob3ctYXMtYXBwbGUtYW5ub3VuY2VzLW5ldy1pcGhvbmUtMTUv0gEA","guidislink":false,"published":"Tue, 12 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=255, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8va2lzczk1MS5jb20vMjAyMy8wOS8xMi9vY3RhdmlhLXNwZW5jZXItc3RlYWxzLXNob3ctYXMtYXBwbGUtYW5ub3VuY2VzLW5ldy1pcGhvbmUtMTUv0gEA?oc=5\" target=\"_blank\">Octavia Spencer Steals Show as Apple Announces New iPhone 15<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Kiss 95.1<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Octavia Spencer Steals Show as Apple Announces New iPhone 15 - Kiss 95.1","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8va2lzczk1MS5jb20vMjAyMy8wOS8xMi9vY3RhdmlhLXNwZW5jZXItc3RlYWxzLXNob3ctYXMtYXBwbGUtYW5ub3VuY2VzLW5ldy1pcGhvbmUtMTUv0gEA?oc=5\" target=\"_blank\">Octavia Spencer Steals Show as Apple Announces New iPhone 15<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Kiss 95.1<\/font>","source.href":"https:\/\/kiss951.com","source.title":"Kiss 95.1","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Octavia Spencer Steals Show as Apple Announces New iPhone 15 Apple introduced the new iPhone 15 Tuesday, but it was Octavia Spencer that stole the show as Mother Nature. Yes, a new iPhone 15 and Apple Watch 9 are coming, but it was Octavia Spencer who stole the show on Tuesday’s Apple “Wonderlust” event. Apple’s fall event, where upgrades and new products are introduced, had the usual suspect upgrades. However the focus on the company’s environmental impact was a bigger theme throughout. Apple will be ditching leather on all products and has all sorts of company-wide changes to improve environmental impact. The emphasis was so key, that they even brought Mother Nature in for a company meeting to discuss it. Actress Octavia Spencer took on the role of Mother Nature in a video presentation, barging in on an Apple staff meeting. She made jokes about how companies make all kinds of unrealistic promises about long-term environmental impacts. But Apple’s team came ready to impress Mother Nature, with actionable items about how the company is changing its ways to help our environment. It’s worth the time to watch the video below, if for nothing other than one of the greatest actresses on the planet as Mother Nature. And you can check out all the things Apple is doing for the environment here. Apple iPhone 15 and iPhone 15 Pro The new iPhone 15 will make good use of Apple’s new “Dynamic Island” at the top of the screen. We heard a lot about that earlier this year, but now we’re seeing how it can be used. The phone will come in five colors, but they’ll look different than what we’re used to. The glass is colored and has some technical differences that help improve the visuals. All of which will be irrelevant once you put a case on it anyway. But it’ll feel good at first. The camera will have a ridiculous 48-megapixel camera on it, so now all your drunken party photos will show your friends in extreme detail. The selfie cam is improved too, so get ready for even better selfies. Portrait mode also got a major upgrade, so those of you who discovered the secret to amazing iPhone photos now get some cooler features. You’ll get focus-changing features, and even auto portrait mode. Oh, and you can finally use portrait mode in bad lighting situations. All of that comes with – of course – a faster, more powerful system under the hood, as you’d expect now with every step up from Apple. The iPhone 15 starts at $799, and iPhone 15 Plus at $899. That’s the same pricing structure as last year’s phones. On the pro end, the biggest change is a titanium enclosure, the same alloy used on the Mars Rover. So, ya know, if you need to make phone calls during an Armageddon-type event, your phone is going to hold up well. The Pro models of course take things to a ridiculous other level, and that comes with a price jump as well. They start at $999 and the Pro Max starts at $1,199. You can order them this Friday, and they’ll be available on September 22. Apple Watch Series 9 and Ultra 2 On the Apple Watch end of things, Apple introduced Apple Watch Series 9 and Ultra 2. Lots of performance improvements and a new finger gesture for certain actions feature were played up. Surely, nothing will ever go wrong for someone wearing an Apple Watch. Oh, and the new Apple Watches are the first products from the company to be produced carbon-neutral – 7 years ahead of schedule. Take that Mother Nature! Apple Watches will be available on September 22, but can be ordered now. They’ll start at $399, and the Apple Watch SE will start at $249. Brandon Plotnick is a former sports journalist, now living in the digital space with interests all over the musical and pop culture map.","filter_flag":1}
{"title":"Zara SWOT Analysis (2024) - Business Model Analyst","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vYnVzaW5lc3Ntb2RlbGFuYWx5c3QuY29tL3phcmEtc3dvdC1hbmFseXNpcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vYnVzaW5lc3Ntb2RlbGFuYWx5c3QuY29tL3phcmEtc3dvdC1hbmFseXNpcy_SAQA?oc=5","id":"CBMiNGh0dHBzOi8vYnVzaW5lc3Ntb2RlbGFuYWx5c3QuY29tL3phcmEtc3dvdC1hbmFseXNpcy_SAQA","guidislink":false,"published":"Wed, 20 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=263, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vYnVzaW5lc3Ntb2RlbGFuYWx5c3QuY29tL3phcmEtc3dvdC1hbmFseXNpcy_SAQA?oc=5\" target=\"_blank\">Zara SWOT Analysis (2024)<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Model Analyst<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Zara SWOT Analysis (2024) - Business Model Analyst","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vYnVzaW5lc3Ntb2RlbGFuYWx5c3QuY29tL3phcmEtc3dvdC1hbmFseXNpcy_SAQA?oc=5\" target=\"_blank\">Zara SWOT Analysis (2024)<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Model Analyst<\/font>","source.href":"https:\/\/businessmodelanalyst.com","source.title":"Business Model Analyst","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Zara is a Spanish multinational clothing retailer based in Arteixo, A Coruña, Galicia. It is the flagship chain store of the Inditex group, the world’s largest apparel retailer. Zara was founded in 1975 by Amancio Ortega Gaona and his ex-wife Rosalía Mera Goyenechea. The company operates over 3,000 stores in 96 markets. Its products range from clothing, accessories, shoes, swimwear, beauty, and perfumes. The company is known for its fast fashion business model, allowing it to quickly adapt to trends and bring new products to market. Zara‘s success has been attributed to its vertically integrated supply chain, which enables it to design, produce, and distribute products quickly and efficiently. Zara has been praised for its innovative business model and ability to stay ahead of the competition. However, the company has also been criticized for its labor practices and environmental impact. In 2022, Zara was ranked the world’s most valuable fashion brand by Interbrand. The company’s annual revenue is over €32 billion. Zara has been very successful in terms of sales and revenue. The company has been able to adapt to trends and bring new products to market quickly. It has a strong brand identity recognized worldwide and a loyal customer base. However, the company has faced some challenges, such as criticism of its labor practices and environmental impact. It has been accused of copying designs from other brands. Below, there is a detailed Zara SWOT Analysis to better understand its strengths, weaknesses, opportunities, and threats in the global market. Zara Strengths Zara has many enviable strengths, including data-driven decision-making, an innovative supply chain, and strong financial performance, among others. Below, there are more details about the strengths: Data-driven Decision-making Zara uses data from its stores, social media, and customer feedback to inform its design and production decisions. This data-driven approach allows the company to understand better and cater to its customer’s preferences. For example, Zara tracks sales data from its stores to see which items are selling well and which are not. This information then determines which items to produce more and which to discontinue. This data-driven approach has allowed the company to quickly adapt to changing fashion trends, stay ahead of its competitors, and maintain a high level of customer satisfaction. Corporate social responsibility Zara is a socially responsible company committed to giving back to the communities in which it operates. It has several sustainability initiatives in place, including programs to support sustainable development, help people in need and recycle clothing. Its program to support sustainable development focuses on reducing the company’s environmental impact. Zara’s sustainability initiatives are a testament to the company’s commitment to positively impacting the world and have been recognized by many organizations, including the World Economic Forum and the United Nations. Strong financial performance The company is financially strong with a strong track record of profitability. The company’s revenue has grown steadily in recent years, and its profits have also increased. For instance, Zara’s revenue in 2022 was €27.8 billion, and its net income was €3.8 billion. Its return on equity was 20%, and its return on assets was 12%. Its strong financial performance has allowed the company to invest in new stores, products, and technologies. The company’s ability to generate strong revenue and profits has allowed it to grow its business and become one of the most successful fashion retailers in the world. Effective branding and marketing The brand relies primarily on word-of-mouth marketing and its reputation for trendy, affordable clothing. The company’s word-of-mouth marketing is so effective that Zara spends little on traditional advertising. Instead, Zara relies on its customers to spread the word about the brand through social media and word-of-mouth. This strategy has been very successful for Zara, as it has helped the company to build a strong brand image and a loyal customer base. Its reputation for trendy, affordable clothing is also helped by its use of social media. The company regularly posts photos of its latest collections on social media, which helps to generate excitement and anticipation among its followers. Fast-fashion Model Zara is known for its fast-fashion model, which allows the company to quickly adapt to changing fashion trends and customer preferences. This is made possible by Zara’s vertical integration, which controls its supply chain from design to distribution. Its speed to market is one of its most important competitive advantages. The company can design, produce, and distribute new clothing items in as little as 15 days, allowing it to respond quickly to changing fashion trends and customer preferences, which keeps customers returning for more. The company’s ability to quickly adapt to changing fashion trends and customer preferences allows it to stay ahead of the competition and offer customers the latest styles. Strong global presence In addition, Zara has over 2,000 stores in over 90 countries, giving it a solid global presence. This allows the company to reach a broad customer base and capitalize on international fashion trends. Zara’s global presence allows it to tap into local fashion trends and adapt its products accordingly. For example, if a particular style is popular in China, Zara can quickly produce that style for its stores in China. This helps Zara to stay ahead of the competition and offer customers the latest styles in their respective countries. Zara’s global presence also allows the company to source materials from all over the world, which helps to keep its costs down. Unique Designs The brand’s designers are constantly working to create new and innovative designs that align with the latest fashion trends. This helps Zara to differentiate itself from its competitors. Zara’s designers are often inspired by street fashion and popular culture, which helps them to create designs that are both trendy and accessible. For example, Zara’s designers have been known to take inspiration from social media influencers and celebrities. This helps Zara to stay ahead of the curve and offer customers the latest styles. The designs are also often simple and understated, which allows the company to focus on quality and fit. Zara’s clothes are often made from high-quality materials and are well-tailored to fit the body. This helps Zara to create clothes that are both stylish and comfortable. Loyal customer base With a loyal customer base attracted to the company’s affordable prices, unique designs, and high-quality products, Zara’s customers are often young and fashion-conscious, looking for stylish and affordable clothes they can wear regularly. The affordable prices are a significant draw for customers. The company’s clothes are often priced lower than other high-end fashion brands but are still made from high-quality materials and well-designed. This makes Zara a popular choice for people who want to look stylish without breaking the bank. Zara’s unique designs are another major draw for customers. The company’s clothes are often well-tailored to fit the body. This helps Zara to create clothes that are both stylish and comfortable. Zara Weaknesses The company’s weaknesses include stiff competition from other brands, commitment to fast fashion, and poor customer service, among others. Below, there are more details: Future uncertainty The future of the fast-fashion industry is uncertain, and this could pose a challenge for Zara, as it is a major player in this industry. The fast-fashion industry is facing increasing scrutiny for its environmental and ethical impact. This could lead to consumer backlash, which could hurt Zara’s sales. Additionally, the rise of online shopping is a challenge for Zara, as Zara’s brick-and-mortar stores are a significant part of its business model. Zara will need to adapt to the changing retail landscape to remain successful, such as changing its business model, product offerings, or marketing strategy. For example, Zara could focus on producing more sustainable clothing to address the environmental concerns raised about the fast-fashion industry. Commitment to fast fashion Zara’s commitment to fast fashion has led to environmental and ethical concerns. Fast fashion is a business model that relies on the rapid production and consumption of clothing. This can lead to environmental problems, such as the overconsumption of resources and the production of large amounts of waste. Zara has also been criticized for its ethical implications. The company has been accused of using sweatshop labor and not paying its workers a fair wage. Zara has taken steps to address these concerns, such as introducing a code of conduct for its suppliers. However, the company still faces criticism, as some believe that Zara’s commitment to fast fashion is inherently unsustainable and unethical. Poor customer service Another major weakness is poor customer service. Customers have complained about long wait times, unhelpful staff, and a lack of transparency. This has led to some customers taking their business elsewhere. For example, some customers have waited hours to speak to a customer service representative. Others have been told they cannot return purchased items, even if they are defective. Still, others have been given incorrect information about products or shipping. Zara has acknowledged the issue and is working to improve its customer service. The company has hired more staff and provided training to its employees. However, the company still has a long way to go. Dependence on trend forecasting More so, Zara’s success relies heavily on its ability to predict and respond to fashion trends accurately. It has a team of trend forecasters who travel the world to keep up with the latest fashion trends. This information is used to design and produce clothing likely to be popular with consumers. However, if Zara fails to predict trends accurately, it can lose market share to competitors who are more successful at forecasting trends. Zara’s dependence on trend forecasting is a double-edged sword. On the one hand, it allows the company to stay ahead of the curve and offer customers the latest fashion trends. On the other hand, it makes the company vulnerable to changes in fashion trends and losing market share to competitors who are more successful at forecasting trends. Disruption to the supply chain Zara’s supply chain is a complex network of suppliers around the world. This agile supply chain allows the company to respond to fashion trends quickly. However, it is also vulnerable to disruptions caused by natural disasters, political instability, or labor strikes, which can lead to delays in production and delivery, disappoint customers, and hurt Zara’s sales. Zara’s supply chain is a complex issue with positive and negative implications. The company’s success depends on maintaining a reliable supply chain. However, this also makes it vulnerable to disruptions. Zara will need to continue to monitor its supply chain and take steps to mitigate the risk of disruptions. Stiff competition Zara faces stiff competition from other fast-fashion brands, such as H&M and Forever 21, making it challenging to maintain market share and attract new customers. The fast-fashion industry is becoming increasingly competitive as more brands enter the market. This makes it even more difficult for Zara to maintain its market share and attract new customers. Zara’s competitive advantage is its ability to respond to fashion trends quickly. However, this advantage is becoming less and less sustainable as other brands adopt similar strategies. Zara will need to find new ways to differentiate itself from its competitors, such as focusing on sustainability, offering more personalized products, or expanding into new markets. Zara Opportunities The opportunities Zara can leverage include influencer marketing, developing sustainable products, launching loyalty programs, and personalization. Here are more details: Influencer marketing Influencer marketing is a powerful way for Zara to reach new customers and build brand awareness. By partnering with the right influencers, Zara can create engaging and authentic marketing campaigns that resonate with its target audience. It could also partner with influencers with a large following in the target market, helping the brand reach a wider audience and generate more sales. Additionally, it could partner with influencers willing to create original content. This would help the brand to stand out from the competition and create more engaging marketing campaigns. Sustainable products Zara has already made some progress in sustainability, but there is still more that the company can do. It could develop more sustainable materials, such as recycled polyester and organic cotton, to help reduce the environmental impact of the company’s products. Zara could also improve its recycling and waste disposal practices, ensuring that the company is not contributing to the problem of waste pollution. Also, Zara could make changes to its production processes. For example, the company could use more energy-efficient machines and adopt water-saving practices. These changes would help to reduce the environmental impact of the company’s operations. Launch a loyalty program A loyalty program is a great way to build customer loyalty and encourage repeat purchases. Zara could launch a loyalty program that rewards customers with points for every purchase. These points could be redeemed for discounts, free products, or exclusive access to new products or events. Zara could also offer customers the chance to earn bonus points for referring friends or following the company on social media. A loyalty program is a great way to show customers that Zara values their business. It can also help to encourage customers to shop more often at Zara and to spend more money each time they shop. Personalization Zara is already known for its trendy clothes, but the company could do more to focus on personalization. Personalization is the process of tailoring the shopping experience to each customer’s individual needs and preferences, which can be done using data from the customer’s purchase history, browsing behavior, and social media activity. Personalization can help Zara to improve the customer experience in several ways. It can help customers find the products they seek more quickly and easily. It can also help customers discover new products they might not have found. Finally, personalization can help to increase customer loyalty and repeat purchases. Expand to new market Zara is currently present in over 96 countries, but there are still many markets where the company could expand. The company could focus on emerging markets with growing middle classes, such as most African countries. These markets offer significant growth potential for Zara, as they have large populations with increasing disposable incomes. Zara could enter these markets through various channels, such as opening new stores, launching an e-commerce platform, or partnering with local retailers. The company would need to adapt its marketing and product strategies to the specific needs of each market. By entering new markets, Zara could expand its customer base and generate new revenue streams. Zara Threats The threats Zara faces include price wars, rising labor costs, product recalls, and economic downturns. Here are more details: Price wars Zara’s core niche is fast fashion, which offers the latest runway trends to customers quickly and at low costs. This has made Zara vulnerable to price wars from imitators, who can produce similar products at even lower prices, putting a strain on Zara’s margins. In addition, price wars can lead to a decrease in the quality of Zara’s products. Zara is pressured to keep its prices low, making it challenging to use high-quality materials and manufacturing processes. Therefore, it needs to find ways to differentiate its products from its imitators while keeping its prices competitive and maintaining its quality, even as it faces pressure to lower prices. Rising labor costs The company’s supply chain is based mainly in Asia, where labor costs have risen recently. This could strain Zara’s margins, as it will have to pay more for its products. In addition, the rising labor cost could lead to Zara moving some of its production to other countries with lower labor costs. This could hurt Zara’s supply chain, making it more difficult for the company to quickly and efficiently get its products to market. As a result, the company needs to find ways to keep its production costs down while also maintaining the quality of its products. It must also be prepared to move some of its production to other countries, if necessary. Product Recalls Zara has been involved in several product recalls in recent years due to safety concerns, such as using harmful chemicals in clothing. Product recalls can damage Zara’s reputation and lead to lost sales. Furthermore, product recalls can lead to lost sales. When a product is recalled, it is often removed from store shelves, and customers are asked to return it. This can lead to a decrease in sales for Zara, as customers may be hesitant to buy products from the company if they are concerned about safety. As a result, the company needs to be proactive in identifying and addressing safety concerns and transparent with customers about product recalls and how they are being addressed. Economic downturn An economic downturn or recession could hurt Zara’s sales. Consumers are less likely to spend money on discretionary items during tough economic times. Zara’s products are considered to be discretionary items, meaning that they are not essential for survival. As a result, consumers may be less likely to buy Zara products if they feel financially insecure. Furthermore, an economic downturn could lead to Zara closing some of its stores, as Zara’s stores are often located in high-rent areas. If consumers are spending less money, Zara may not be able to afford to keep all of its stores open. As a result, the company needs to reduce costs while maintaining its brand image. It also needs to be prepared to close some of its stores, if necessary. Conclusion Zara is a global fashion brand that has faced some challenges in recent years. These challenges include price wars, rising labor costs, product recalls, and economic downturns. However, Zara has also responded to these challenges by innovating and investing in new technologies. As a result, the company has remained profitable and continues to grow. Even though the future of Zara is uncertain, the company has some strengths that could help it overcome its challenges. These strengths include its strong brand image, global reach, and innovative business model. If Zara can continue to innovate and invest in new technologies, it is well-positioned to succeed. In the end, Zara will need to continue to innovate to stay ahead of the competition. The company will also need to address the challenges of rising labor costs and increasing competition from online retailers. If Zara can do these things, it is well-positioned to continue to be a successful fashion brand for many years.","filter_flag":1}
{"title":"SLM Partners Launch New Ag Fund - WealthBriefingAsia","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LndlYWx0aGJyaWVmaW5nYXNpYS5jb20vYXJ0aWNsZS5waHAvU0xNLVBhcnRuZXJzLUxhdW5jaC1OZXctQWctRnVuZCVDMiVBMD9pZD0xOTkxOTXSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LndlYWx0aGJyaWVmaW5nYXNpYS5jb20vYXJ0aWNsZS5waHAvU0xNLVBhcnRuZXJzLUxhdW5jaC1OZXctQWctRnVuZCVDMiVBMD9pZD0xOTkxOTXSAQA?oc=5","id":"CBMiXmh0dHBzOi8vd3d3LndlYWx0aGJyaWVmaW5nYXNpYS5jb20vYXJ0aWNsZS5waHAvU0xNLVBhcnRuZXJzLUxhdW5jaC1OZXctQWctRnVuZCVDMiVBMD9pZD0xOTkxOTXSAQA","guidislink":false,"published":"Wed, 27 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=270, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LndlYWx0aGJyaWVmaW5nYXNpYS5jb20vYXJ0aWNsZS5waHAvU0xNLVBhcnRuZXJzLUxhdW5jaC1OZXctQWctRnVuZCVDMiVBMD9pZD0xOTkxOTXSAQA?oc=5\" target=\"_blank\">SLM Partners Launch New Ag Fund<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">WealthBriefingAsia<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"SLM Partners Launch New Ag Fund - WealthBriefingAsia","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LndlYWx0aGJyaWVmaW5nYXNpYS5jb20vYXJ0aWNsZS5waHAvU0xNLVBhcnRuZXJzLUxhdW5jaC1OZXctQWctRnVuZCVDMiVBMD9pZD0xOTkxOTXSAQA?oc=5\" target=\"_blank\">SLM Partners Launch New Ag Fund<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">WealthBriefingAsia<\/font>","source.href":"https:\/\/www.wealthbriefingasia.com","source.title":"WealthBriefingAsia","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"SLM Partners, an asset manager, joins forces with Impact Ag Partners to create fund. Asset manager SLM Partners, has partnered with Impact Ag Partners to launch a new fund investing in regenerative agriculture and carbon storage in Australia. With inflation high and investors increasingly looking for investments which have a positive environmental impact, regenerative agriculture has recently been seeing much higher investor interest. Regenerative agriculture involves the use of farming and grazing practices which aim to combat climate change by rebuilding soil organic matter and restoring degraded soil biodiversity. Often this doesn't use tillage, resulting in carbon drawdown and improving the water cycle at the same time as enhancing profitability. This joint venture brings together two experienced managers in the field of regenerative agriculture. \"Building on all that we have learned in Australia over the last decade, we are excited to launch this new joint venture with Impact Ag. We are philosophically aligned and bring complementary skills and experience.\" Paul McMahon, a co-founder and managing partner of SLM Partners, said in a statement. He believes that the financial returns from this asset class are good and it also acts as a great inflation hedge. Both SLM and Impact Ag have a track record of building and monetising the natural capital in the assets they manage. They think that regenerative agriculture can deliver essential nature-based climate solutions at scale. SLM Partners is a global real assets investment manager with $550 million in assets under management. It manages funds and separate accounts in the USA, Australia and Europe, focusing on regenerative agriculture and forestry practices which offer attractive risk-returns, increase climate resiliency and deliver positive impacts for nature. In Australia, over the last decade, SLM has acquired more than 1 million acres of grazing land and generated and sold 1.7 million tons of carbon credits. See more here about the firm’s funds. Impact Ag Partners is a specialist agriculture real asset manager and operator with expertise in regenerative farming principles that result in natural capital monetisation opportunities. Founded in 2010, it manages over $500 million across Australia and North America. SLM Agri Carbon Fund The SLM Agri Carbon Fund will combine experience from both SLM Partners and Impact Ag Partners to scale up regenerative, low-carbon farming systems in Australia. The fund has secured commitment from a cornerstone investor that has an appetite for a real asset, mixed farming and carbon investing, the firm said. It will acquire mixed farms in select regions of eastern Australia and implement regenerative practices such as large-scale rotational grazing, reduced tillage, cover cropping, integrating livestock with grain rotations, afforestation and environmental plantings of native vegetation. The SLM Agri Carbon Fund will also seek to establish carbon projects on its farms under government-approved modelled and measured methodologies to demonstrate the impacts of these practices. \"Australian agricultural real assets continue to be a positive climate and nature-based solution for the future, whilst also producing high quality food and fibre. Our confidence in the carbon market dynamics in Australia continues to grow as does the number of carbon projects we have registered,” Bert Glover at Impact Ag Partners said. Tarun Nagpal, CEO and founder of global alternatives solutions provider S64 also believes that there has been increased appetite for agricultural land, which acts as an inflation hedge, especially in regenerative agriculture in Australia. See here.","filter_flag":1}
{"title":"Apple to stop using leather in all new products - The Independent","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3RlY2gvYXBwbGUtbGVhdGhlci1zdHJhcC13YXRjaC1pcGhvbmUtY2FzZS1iMjQxMDQ2Mi5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3RlY2gvYXBwbGUtbGVhdGhlci1zdHJhcC13YXRjaC1pcGhvbmUtY2FzZS1iMjQxMDQ2Mi5odG1s0gEA?oc=5","id":"CBMiVmh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3RlY2gvYXBwbGUtbGVhdGhlci1zdHJhcC13YXRjaC1pcGhvbmUtY2FzZS1iMjQxMDQ2Mi5odG1s0gEA","guidislink":false,"published":"Wed, 13 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=256, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3RlY2gvYXBwbGUtbGVhdGhlci1zdHJhcC13YXRjaC1pcGhvbmUtY2FzZS1iMjQxMDQ2Mi5odG1s0gEA?oc=5\" target=\"_blank\">Apple to stop using leather in all new products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Independent<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Apple to stop using leather in all new products - The Independent","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3RlY2gvYXBwbGUtbGVhdGhlci1zdHJhcC13YXRjaC1pcGhvbmUtY2FzZS1iMjQxMDQ2Mi5odG1s0gEA?oc=5\" target=\"_blank\">Apple to stop using leather in all new products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Independent<\/font>","source.href":"https:\/\/www.independent.co.uk","source.title":"The Independent","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Sign up to our free weekly IndyTech newsletter delivered straight to your inbox Sign up to our free IndyTech newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy policy Thanks for signing up to the IndyTech email {{ #verifyErrors }} {{ message }} {{ \/verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ \/verifyErrors }} Apple will stop using leather, it has announced. It will offer no new products using materials taken from animals, it said. That includes iPhone cases and Watch bands, both of which make heavy use of leather. Lisa Jackson, Apple’s vice president of environment, policy and social initiatives, noted that leather is a popular material for accessories. But it has considerable environmental impact, she noted, especially at the scale that Apple uses it. As such, it has committed to phasing out those materials. Instead, it will rely on new materials that have been especially developed. For the Apple Watch’s sport loop, for instance, it has changed the material to use 82 per cent recycled yarn. For the straps that are currently made out of leather, it will rely on a new seemingly custom developed material called “FineWoven”. That will presumably also be used for the cases made for the new iPhone 15. And Apple has developed new straps with Nike and Hermès. The latter collaboration has relied heavily on leather – but recently Apple has been rumoured to be selling off those products cheaply. The new materials will help make the new Apple Watch Series 9 the first carbon neutral product the company has made.","filter_flag":1}
{"title":"New Pirelli Logo To Identify Tyres With At Least 50% Sustainable Material - indianautosblog.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vaW5kaWFuYXV0b3NibG9nLmNvbS9uZXctcGlyZWxsaS1sb2dvLXRvLWlkZW50aWZ5LXR5cmVzLXdpdGgtYXQtbGVhc3QtNTAtc3VzdGFpbmFibGUtbWF0ZXJpYWwtcDMyNjIxNtIBcmh0dHBzOi8vbS5pbmRpYW5hdXRvc2Jsb2cuY29tL25ldy1waXJlbGxpLWxvZ28tdG8taWRlbnRpZnktdHlyZXMtd2l0aC1hdC1sZWFzdC01MC1zdXN0YWluYWJsZS1tYXRlcmlhbC1wMzI2MjE2L2FtcA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vaW5kaWFuYXV0b3NibG9nLmNvbS9uZXctcGlyZWxsaS1sb2dvLXRvLWlkZW50aWZ5LXR5cmVzLXdpdGgtYXQtbGVhc3QtNTAtc3VzdGFpbmFibGUtbWF0ZXJpYWwtcDMyNjIxNtIBcmh0dHBzOi8vbS5pbmRpYW5hdXRvc2Jsb2cuY29tL25ldy1waXJlbGxpLWxvZ28tdG8taWRlbnRpZnktdHlyZXMtd2l0aC1hdC1sZWFzdC01MC1zdXN0YWluYWJsZS1tYXRlcmlhbC1wMzI2MjE2L2FtcA?oc=5","id":"CBMibGh0dHBzOi8vaW5kaWFuYXV0b3NibG9nLmNvbS9uZXctcGlyZWxsaS1sb2dvLXRvLWlkZW50aWZ5LXR5cmVzLXdpdGgtYXQtbGVhc3QtNTAtc3VzdGFpbmFibGUtbWF0ZXJpYWwtcDMyNjIxNtIBcmh0dHBzOi8vbS5pbmRpYW5hdXRvc2Jsb2cuY29tL25ldy1waXJlbGxpLWxvZ28tdG8taWRlbnRpZnktdHlyZXMtd2l0aC1hdC1sZWFzdC01MC1zdXN0YWluYWJsZS1tYXRlcmlhbC1wMzI2MjE2L2FtcA","guidislink":false,"published":"Thu, 21 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=264, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vaW5kaWFuYXV0b3NibG9nLmNvbS9uZXctcGlyZWxsaS1sb2dvLXRvLWlkZW50aWZ5LXR5cmVzLXdpdGgtYXQtbGVhc3QtNTAtc3VzdGFpbmFibGUtbWF0ZXJpYWwtcDMyNjIxNtIBcmh0dHBzOi8vbS5pbmRpYW5hdXRvc2Jsb2cuY29tL25ldy1waXJlbGxpLWxvZ28tdG8taWRlbnRpZnktdHlyZXMtd2l0aC1hdC1sZWFzdC01MC1zdXN0YWluYWJsZS1tYXRlcmlhbC1wMzI2MjE2L2FtcA?oc=5\" target=\"_blank\">New Pirelli Logo To Identify Tyres With At Least 50% Sustainable Material<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">indianautosblog.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New Pirelli Logo To Identify Tyres With At Least 50% Sustainable Material - indianautosblog.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vaW5kaWFuYXV0b3NibG9nLmNvbS9uZXctcGlyZWxsaS1sb2dvLXRvLWlkZW50aWZ5LXR5cmVzLXdpdGgtYXQtbGVhc3QtNTAtc3VzdGFpbmFibGUtbWF0ZXJpYWwtcDMyNjIxNtIBcmh0dHBzOi8vbS5pbmRpYW5hdXRvc2Jsb2cuY29tL25ldy1waXJlbGxpLWxvZ28tdG8taWRlbnRpZnktdHlyZXMtd2l0aC1hdC1sZWFzdC01MC1zdXN0YWluYWJsZS1tYXRlcmlhbC1wMzI2MjE2L2FtcA?oc=5\" target=\"_blank\">New Pirelli Logo To Identify Tyres With At Least 50% Sustainable Material<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">indianautosblog.com<\/font>","source.href":"https:\/\/indianautosblog.com","source.title":"indianautosblog.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Pirelli has created a bespoke logo to identify tyres that contain at least 50% materials of bio-based and recycled origin. The new marking – which depicts two arrows in a circle and will be adopted on new products – underlines Pirelli’s commitment to the environment, maintaining the high level of safety performance inherent in every single tyre produced by the Italian firm. This new logo is also designed as a clear indication for customers, allowing them to choose more sustainable tyres. The latest Pirelli marking was used for the first time on the P Zero E. This tyre contains more than 55% of materials of bio-based and recycled origin* throughout the entire range at launch, as certified by Bureau Veritas: a world leader in verifying conformity and certification in quality, environment, health, safety, and social responsibility standards (ISO14021). Third-party verification of eco-compatible materials will continue to be standard across all future products that adopt the new logo. Pirelli’s path towards reduced environmental impact includes the ever-increasing use of sustainable materials. Pirelli’s initial objective, originally set for 2025, has already been achieved two years early thanks to P Zero E. The next step, set for selected product lines by 2030, envisages the use of at least 60% of materials of bio-based origin and 12% recycled, with less than 30% of fossil-derived ingredients. Pirelli aims to regularly improve these targets thanks to the technological innovation of all the different departments involved in tyre development. These innovations have set in motion a virtuous path both at quantitative level – thanks to increasingly higher percentages of sustainable materials – and qualitative level, through the certification of supply chains to internationally accredited standards. In 2021, for example, Pirelli was first to produce an FSC (Forest Stewardship Council) certified tyre that uses natural rubber and FSC rayon. As a result, customers had the guarantee that all materials sourced from forests came from plantations that promote biological diversity, while bringing economic sustainability to the lives of local communities and workers.","filter_flag":1}
