{"title":"Herbalife Releases Second Global Sustainability Report :: Herbalife Ltd. (HLF) - Investor Relations :: Herbalife Ltd. (HLF)","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vaXIuaGVyYmFsaWZlLmNvbS9uZXdzLWV2ZW50cy9wcmVzcy1yZWxlYXNlcy9kZXRhaWwvODYyL2hlcmJhbGlmZS1yZWxlYXNlcy1zZWNvbmQtZ2xvYmFsLXN1c3RhaW5hYmlsaXR5LXJlcG9ydNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vaXIuaGVyYmFsaWZlLmNvbS9uZXdzLWV2ZW50cy9wcmVzcy1yZWxlYXNlcy9kZXRhaWwvODYyL2hlcmJhbGlmZS1yZWxlYXNlcy1zZWNvbmQtZ2xvYmFsLXN1c3RhaW5hYmlsaXR5LXJlcG9ydNIBAA?oc=5","id":"CBMidWh0dHBzOi8vaXIuaGVyYmFsaWZlLmNvbS9uZXdzLWV2ZW50cy9wcmVzcy1yZWxlYXNlcy9kZXRhaWwvODYyL2hlcmJhbGlmZS1yZWxlYXNlcy1zZWNvbmQtZ2xvYmFsLXN1c3RhaW5hYmlsaXR5LXJlcG9ydNIBAA","guidislink":false,"published":"Tue, 25 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=206, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vaXIuaGVyYmFsaWZlLmNvbS9uZXdzLWV2ZW50cy9wcmVzcy1yZWxlYXNlcy9kZXRhaWwvODYyL2hlcmJhbGlmZS1yZWxlYXNlcy1zZWNvbmQtZ2xvYmFsLXN1c3RhaW5hYmlsaXR5LXJlcG9ydNIBAA?oc=5\" target=\"_blank\">Herbalife Releases Second Global Sustainability Report :: Herbalife Ltd. (HLF)<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investor Relations :: Herbalife Ltd. (HLF)<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Herbalife Releases Second Global Sustainability Report :: Herbalife Ltd. (HLF) - Investor Relations :: Herbalife Ltd. (HLF)","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vaXIuaGVyYmFsaWZlLmNvbS9uZXdzLWV2ZW50cy9wcmVzcy1yZWxlYXNlcy9kZXRhaWwvODYyL2hlcmJhbGlmZS1yZWxlYXNlcy1zZWNvbmQtZ2xvYmFsLXN1c3RhaW5hYmlsaXR5LXJlcG9ydNIBAA?oc=5\" target=\"_blank\">Herbalife Releases Second Global Sustainability Report :: Herbalife Ltd. (HLF)<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investor Relations :: Herbalife Ltd. (HLF)<\/font>","source.href":"https:\/\/ir.herbalife.com","source.title":"Investor Relations :: Herbalife Ltd. (HLF)","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"New Report Underscores the Global Health and Wellness Company's Commitments to Product, People and Planet LOS ANGELES, July 25, 2023 \/PRNewswire\/ -- Premier health and wellness company, Herbalife, today released its second Global Sustainability Report: Live Your Best Life. The report covers the impacts the Company made from 2021-2022 and provides transparency into its sustainable business practices and commitments across three priority areas: quality product, healthy people and communities, and a thriving planet. \"Herbalife is built on a proud legacy of helping people live their best lives and today this purpose is more important than ever,\" said Michael Johnson, Chairman and CEO of Herbalife. \"As we look to the future, we are modernizing our business to meet the needs of our distributors, customers, employees, investors, and communities, while meeting our commitments to sustainable and integrated business practices and products that improve the overall health of our communities and the impact on our planet.\" Prioritizing the areas where the Company can have the greatest impact, Herbalife's Global Sustainability strategy focuses on environmental stewardship, social responsibility, and transparent governance practices. This strategy is informed by stakeholder priorities, enterprise risks and is aligned with the United Nations Sustainable Development Goals (SDGs). In 2022, Herbalife conducted a formal stakeholder assessment to gather insight on its sustainability performance, priorities, and how the company could enhance its sustainability transparency and reporting. This assessment allowed Herbalife to identify the most significant sustainability issues facing the company. The Herbalife 2021-2022 Global Sustainability Report highlights the company's achievements in each of the three priority areas, including: Quality Product Launched 27 new products and 20 new flavors of existing products across 95 markets Maintained recognition as the World's #1 brand for Weight Management and Well-being*, as well as World's #1 brand in Health Shakes** Received more than 40 awards and recognitions for product quality and excellence Of the 12,000 nutrition clubs owned by Herbalife Independent Distributors in the United States, 79% were within a five-mile radius of a food desert in 2022, providing affordable access to nutrient-dense Herbalife products Healthy People Won \"America's Best Employers for Diversity\" and \"America's Best Midsized Employers\" by Forbes in 2022, and 'Elite 8' Employer in Achievers 50 Most Engaged Workplaces Awards in 2021 Received 10 awards for best-in-class offerings for its HN Grow mobile app, which delivers educational training to its independent distributors Partnered with government organizations across Mexico, Brazil, Indonesia, and India, that support campaigns on obesity and noncommunicable disease prevention through healthy lifestyle and nutrition education, food handling and hygiene Expanded partnership with nonprofit organizations World Food Program USA, Global Food Banking Network, Feed the Children, among others, to include more than 20 programs focused on health wellness and nutrition worldwide Thriving Planet Removed 322 metric tons of virgin plastic (representing 2.5% of total plastic use) from its product packaging by including 25% recycled materials (PCR) into its Formula 1 product packaging in select markets Recycled 5,475 metric tons of plastic and the materials from its sales and distribution centers in over 30 markets around the world Improved efficiencies across Herbalife Innovation and Manufacturing (HIM) facilities in U.S. and China, as well as office facilities in U.S. and Mexico, and launched solar-powered office space in Costa Rica that supports emission reductions Set targets to assess 80% of our product ingredient suppliers for sustainable practices by 2025 and 100% of our soy and cocoa suppliers by 2025 Additionally, through the generous support of the Company's independent distributors and employees, the Herbalife Nutrition Foundation (HNF) continues to provide the proper nutrition and education necessary for the wellness of children and communities. HNF granted $5.12 million to 178 local organizations in 2022, benefitting 229,000 children worldwide. Herbalife's Global Sustainability Report can be viewed in full here. About Herbalife Ltd. Herbalife (NYSE: HLF) is a premier health and wellness company and community that has been changing people's lives with great nutrition products and a business opportunity for its independent distributors since 1980. The Company offers science-backed products to consumers in more than 90 markets through entrepreneurial distributors who provide one-on-one coaching and a supportive community that inspires their customers to embrace a healthier, more active lifestyle in order to live their best life. For more information, visit https:\/\/ir.herbalife.com. * Source Euromonitor International Limited; per Consumer Health 2023ed, weight management and wellbeing definition; combined % RSP share GBO, 2022 data. ** Source Euromonitor International Limited; per Consumer Health 2023ed, Health Shake as per sports protein powder, sports protein RTDs, meal replacement, supplement nutrition drinks and protein supplements, combined % RSP share GBO, 2022 data. View original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/herbalife-releases-second-global-sustainability-report-301885540.html SOURCE Herbalife (NYSE: HLF)","filter_flag":1}
{"title":"East Penn Manufacturing power a closed loop circular economy - Sustainability Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vc3VzdGFpbmFiaWxpdHltYWcuY29tL2FydGljbGVzL2Vhc3QtcGVubi1tYW51ZmFjdHVyaW5nLXBvd2VyLWEtY2xvc2VkLWxvb3AtY2lyY3VsYXItZWNvbm9tedIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vc3VzdGFpbmFiaWxpdHltYWcuY29tL2FydGljbGVzL2Vhc3QtcGVubi1tYW51ZmFjdHVyaW5nLXBvd2VyLWEtY2xvc2VkLWxvb3AtY2lyY3VsYXItZWNvbm9tedIBAA?oc=5","id":"CBMiY2h0dHBzOi8vc3VzdGFpbmFiaWxpdHltYWcuY29tL2FydGljbGVzL2Vhc3QtcGVubi1tYW51ZmFjdHVyaW5nLXBvd2VyLWEtY2xvc2VkLWxvb3AtY2lyY3VsYXItZWNvbm9tedIBAA","guidislink":false,"published":"Fri, 28 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=209, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vc3VzdGFpbmFiaWxpdHltYWcuY29tL2FydGljbGVzL2Vhc3QtcGVubi1tYW51ZmFjdHVyaW5nLXBvd2VyLWEtY2xvc2VkLWxvb3AtY2lyY3VsYXItZWNvbm9tedIBAA?oc=5\" target=\"_blank\">East Penn Manufacturing power a closed loop circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sustainability Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"East Penn Manufacturing power a closed loop circular economy - Sustainability Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vc3VzdGFpbmFiaWxpdHltYWcuY29tL2FydGljbGVzL2Vhc3QtcGVubi1tYW51ZmFjdHVyaW5nLXBvd2VyLWEtY2xvc2VkLWxvb3AtY2lyY3VsYXItZWNvbm9tedIBAA?oc=5\" target=\"_blank\">East Penn Manufacturing power a closed loop circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sustainability Magazine<\/font>","source.href":"https:\/\/sustainabilitymag.com","source.title":"Sustainability Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"East Penn Manufacturing operates the largest single-site, lead battery manufacturing facility, providing energy across North America, Europe and Asia. The company was founded in 1946 in Philadelphia, US, by the Breidegam family in response to the demand for batteries for the war effort. The father and son duo began collecting old batteries and built them anew, and now East Penn Manufacturing is one of the world’s leading battery manufacturers. Sustainability at the heart of manufacturing East Penn Manufacturing has sustainability at the core of its operations — from day one, it rebuilt used batteries from recycled materials — and it works to boost sustainability. The company’s 2023 Sustainability Report allows a look into the goals and achievements of the company. It summarises its sustainability highlights: Powering a circular economy — through recycling and reusing all three major parts of a lead battery (plastic, lead and acid), the company closes the loop with its distribution system that collects used batteries for recycling when delivering new products. . In 2022, the Lyon Station facility recycled over 188 million pounds of lead, more than 10.2 million pounds of plastic, and over 6 million pounds of acid. Investing in people — East Penn Manufacturing is proud of its family roots, and works to support its over 10,000 employees through programmes including healthcare premiums, training and personal development. Around 23% of employees have been with the company for over a decade. Renewable energy — the company is committed to procure 15 megawatts of renewable electricity over a 15 year period through a solar energy project. In 2023, John Deere awarded East Penn Manufacturing with the Supplier Sustainability Award in recognition of closed loop manufacturing processes and environmental stewardship. “East Penn’s growth has always gone hand-in-hand with our commitment to sustainability,” says Chris Pruitt, East Penn Manufacturing’s President and CEO. “We operate a circular economy that is supported by the recyclability of our batteries, so the only way for us to grow is sustainably.” ************************************************* For more insights into Sustainability - check out the latest edition of Sustainability Magazine and be sure to follow us on LinkedIn & Twitter Other magazines that may be of interest - EV Magazine | Energy Digital Please also check out our upcoming event - Sustainability LIVE in London at the BDC on Sept 6\/7th 2023 ********************************************* BizClik is a global provider of B2B digital media platforms that cover 'Executive Communities' for CEO's, CFO's, CMO's, Sustainability Leaders, Procurement & Supply Chain Leaders, Technology & AI Leaders, Cyber Leaders, FinTech & InsurTech Leaders as well as covering industries such as Manufacturing, Mining, Energy, EV, Construction, Healthcare + Food & Drink. BizClik, based in London, Dubai & New York offers services such as Content Creation, Advertising & Sponsorship Solutions, Webinars & Events. ","filter_flag":1}
{"title":"PFAS Anyone? - Textile World Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LnRleHRpbGV3b3JsZC5jb20vdGV4dGlsZS13b3JsZC9mcm9tLXRoZS1lZGl0b3IvMjAyMy8wNy9wZmFzLWFueW9uZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LnRleHRpbGV3b3JsZC5jb20vdGV4dGlsZS13b3JsZC9mcm9tLXRoZS1lZGl0b3IvMjAyMy8wNy9wZmFzLWFueW9uZS_SAQA?oc=5","id":"CBMiT2h0dHBzOi8vd3d3LnRleHRpbGV3b3JsZC5jb20vdGV4dGlsZS13b3JsZC9mcm9tLXRoZS1lZGl0b3IvMjAyMy8wNy9wZmFzLWFueW9uZS_SAQA","guidislink":false,"published":"Thu, 27 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=208, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LnRleHRpbGV3b3JsZC5jb20vdGV4dGlsZS13b3JsZC9mcm9tLXRoZS1lZGl0b3IvMjAyMy8wNy9wZmFzLWFueW9uZS_SAQA?oc=5\" target=\"_blank\">PFAS Anyone?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Textile World Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"PFAS Anyone? - Textile World Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LnRleHRpbGV3b3JsZC5jb20vdGV4dGlsZS13b3JsZC9mcm9tLXRoZS1lZGl0b3IvMjAyMy8wNy9wZmFzLWFueW9uZS_SAQA?oc=5\" target=\"_blank\">PFAS Anyone?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Textile World Magazine<\/font>","source.href":"https:\/\/www.textileworld.com","source.title":"Textile World Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"By Jim Borneman, Editor In Chief Manufacturers, brands and retailers are getting the message. Consumers are interested and want to know more about the products in their life. From the food they eat to the clothes they wear, consumers want to know more than ever where products come from, how wholesome the ingredients are and what impact they have on the environment — both as they are produced and after they are consumed. One doesn’t have to look back too far to see how dramatic this transformation has been. Who knew the tree hugging, Birkenstock wearing, granola eaters of the late-1960s were ahead of their time? The mainstreaming of environmental awareness demands manufacturers, brands and retailers get on board or be lost, awash in the green tide. It wasn’t that long ago the concept of sustainability was something new and it established a need for transparency throughout supply chains. Early pioneers — like Ray Anderson, the founder and chairman of modular carpet manufacturer Interface Inc. — put the impact of industry on the environment at the center of his company’s culture. Sustainable production and consumption were essential to Anderson, who passed away in 2011.The Ray C. Anderson Foundation was established in his memory to perpetuate Anderson’s notion of “ … businesses doing well by doing good,”and continue his legacy. The foundation notes, “It’s these noble qualities of advancing knowledge and innovation around environmental stewardship and sustainability that recognized Ray as a pioneer in industrial ecology.” Along the way, the industry learned that cost saving initiatives that reduced water, power and chemical consumption were not only good for business and the environment, but also curried favor with brands and retailers. At the time, who knew brands were even interested? Today, communicating the environmental impact of products has become an integral part of marketing, branding and personal relations. Industry response to downstream industry demands couldn’t be more clearly demonstrated than in the “PFAS In The News” feature in this issue of Textile World. Executive Editor Rachael Davis explores the multifaceted debate of the use of per- and polyfluoroalkyl substances (PFAS), particularly in textiles. But PFAS chemistry is everywhere and used in countless consumer and industrial applications. Known for conferring performance properties as a repellent finish and more, chemistry based on the powerful chemical bond between fluorine and carbon molecules was a magical discovery that led to the development of thousands of chemical compounds. Now, government regulation, industry and the consumer are driving innovation and change in the world of PFAS chemistry. An informed debate is essential here because not all PFAS are the same. And it can be argued that in some applications PFAS chemistry is necessary to achieve the performance required for some very highly technical products. Real change is happening in products that are less performance oriented or those that can achieve the necessary performance attributes with alternative chemistries. A rush to judgment and government regulation is concerning, but pivoting to less concerning chemistries when possible may not be such a bad outcome. July\/August 2023","filter_flag":1}
{"title":"Why DE&I is Key to Business Sustainability: Considerations for Incorporating It into Your Plan - Security Management Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5hc2lzb25saW5lLm9yZy9zZWN1cml0eS1tYW5hZ2VtZW50LW1hZ2F6aW5lL2FydGljbGVzLzIwMjMvMDcvZGl2ZXJzaXR5LWVxdWl0eS1hbmQtaW5jbHVzaW9uL2RlaS1idXNpbmVzcy1zdXN0YWluYWJpbGl0eS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5hc2lzb25saW5lLm9yZy9zZWN1cml0eS1tYW5hZ2VtZW50LW1hZ2F6aW5lL2FydGljbGVzLzIwMjMvMDcvZGl2ZXJzaXR5LWVxdWl0eS1hbmQtaW5jbHVzaW9uL2RlaS1idXNpbmVzcy1zdXN0YWluYWJpbGl0eS_SAQA?oc=5","id":"CBMihAFodHRwczovL3d3dy5hc2lzb25saW5lLm9yZy9zZWN1cml0eS1tYW5hZ2VtZW50LW1hZ2F6aW5lL2FydGljbGVzLzIwMjMvMDcvZGl2ZXJzaXR5LWVxdWl0eS1hbmQtaW5jbHVzaW9uL2RlaS1idXNpbmVzcy1zdXN0YWluYWJpbGl0eS_SAQA","guidislink":false,"published":"Mon, 03 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=184, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5hc2lzb25saW5lLm9yZy9zZWN1cml0eS1tYW5hZ2VtZW50LW1hZ2F6aW5lL2FydGljbGVzLzIwMjMvMDcvZGl2ZXJzaXR5LWVxdWl0eS1hbmQtaW5jbHVzaW9uL2RlaS1idXNpbmVzcy1zdXN0YWluYWJpbGl0eS_SAQA?oc=5\" target=\"_blank\">Why DE&amp;I is Key to Business Sustainability: Considerations for Incorporating It into Your Plan<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Security Management Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why DE&I is Key to Business Sustainability: Considerations for Incorporating It into Your Plan - Security Management Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5hc2lzb25saW5lLm9yZy9zZWN1cml0eS1tYW5hZ2VtZW50LW1hZ2F6aW5lL2FydGljbGVzLzIwMjMvMDcvZGl2ZXJzaXR5LWVxdWl0eS1hbmQtaW5jbHVzaW9uL2RlaS1idXNpbmVzcy1zdXN0YWluYWJpbGl0eS_SAQA?oc=5\" target=\"_blank\">Why DE&amp;I is Key to Business Sustainability: Considerations for Incorporating It into Your Plan<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Security Management Magazine<\/font>","source.href":"https:\/\/www.asisonline.org","source.title":"Security Management Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Why DE&I is Key to Business Sustainability: Considerations for Incorporating It into Your Plan The average lifespan of a company is 10 years, according to an often-cited study by the Santa Fe Institute. The U.S. Bureau of Labor Statistics notes that 50 percent of small businesses fail within the first five years. And, for large companies, consider that only 49 of the original Fortune 500 companies remain on the list. While there’s nothing that can guarantee long-term success, there are things that businesses can do to improve how they hire, innovate, and conduct activities, which can contribute to their success. One of the keys is a formal sustainability plan with a diversity, equity, and inclusion (DE&I) program as a major component. What is DE&I, and Why is it Important? Diversity includes (but is not limited to) gender, age, nationality, background, culture, skills, neurodivergence, socio-economic status, and other attributes. And, while sustainability is usually associated with environmental stewardship, that’s just part of the equation. In simple terms, sustainability is defined as the ability to endure. This is where DE&I can help, as it can play a significant role in a company’s longevity. So, how can DE&I contribute to a company’s long-term success? Consider that DE&I can help: Attract the right talent. Two out of three job candidates seek companies that have diverse workforces. (What Job Seekers Really Think, Glassdoor) Increase job satisfaction and improve employee retention. Companies experience a 50 percent drop in turnover risk and a 75 percent reduction in sick days when workers feel like they belong. (The Value of Belonging at Work, Harvard Business Review) Enhance team performance. Three-quarters of organizations with frontline decision-making teams that reflect a diverse and inclusive culture exceed financial targets. (Diversity and inclusion Build High-Performance Teams, Gartner) Generate ideas and innovate. Companies with above-average diversity produce a greater proportion of revenue from innovation (45 percent) than companies with below average diversity (26 percent). (How Diverse Leadership Teams Boost Innovation, Boston Consulting Group) Gain a competitive business advantage. Companies with the most ethnically diverse executive teams are 33 percent more likely to outperform their competitors on profitability. (Delivering Through Diversity, McKinsey & Company) A diverse workforce and an inclusive and fair environment are appealing to today’s business professionals. It’s clear that an inclusive, positive work climate that promotes diversity and equity can attract and retain the right people, drive engagement, and foster both creativity and innovation because it takes into account many different points of view. Ultimately, this can lead to a much more sustainable business. DE&I Starts with a Commitment If your company is serious about trying to improve sustainability via efforts like improving DE&I, it’s best to make a formal commitment and set goals. For example, many companies have signed the United Nations Global Compact and use its agenda and goals as a blueprint for aligning company strategies and operations with their universal principles on human rights, labor, environment, and anti-corruption. The UN Global Compact is the world's largest corporate sustainability and corporate social responsibility initiative, with 13,000 corporate participants and other stakeholders in more than 170 countries. Implementing a sustainability plan in your workplace should be approached like any other company initiative. It’s important to conduct a proper assessment and evaluate where your organization is pertaining to DEI and sustainability in order to define needs, set strategy and goals, and develop a way to measure success. Looking at my organization, Axis Communications, for example—in its 2022 Sustainability Report, Axis reported a significant 33 percent increase in gender diversity among both managers and employees in its global operations. Overall, 29 percent of Axis employees are women, and 71 percent are men. Although there is clearly still work to be done, the gap between males and females at Axis, especially in leadership positions, is narrowing. Using Axis corporate sustainability efforts as a guide, Axis Americas has been working on increasing DE&I in our hiring practices, as well. When we began a deep dive into the issue of diversity about five years ago, we didn’t score as well as our counterparts across the globe in this area, so we committed to making improvements. Not only was there an imbalance between the percentage of women and men, but the problem was being exacerbated by the lack of job applications from women. The same applied to the other identities. Accordingly, we committed to working harder to attract a pool of diverse and qualified candidates for our management positions. We’ve moved the needle from 27 percent women in management positions five years ago to 33 percent today. That’s a very positive growth indicator, and we’re working just as hard to increase the number of other types of diverse representation in management. Why focus on management positions first? Because these new hires bring new thinking and new networks of people with them. This change didn’t happen overnight. It was part of a formalized plan, and it’s exciting to see progress being made. Sustainability is defined as the ability to endure. This is where DE&I can help, as it can play a significant role in a company’s longevity. Working Together to Make a Difference No longer just a “nice to have” initiative, improving diversity has become a “have to have” initiative. A diverse employee makeup better reflects society and includes input from a wider variety of stakeholders, which ultimately helps diversify and improve the products and services that a company creates. To increase sustainability and DE&I efforts in security companies, the industry can and should band together to leverage industry associations, working groups, and committees to bring industry-wide change that benefits all of us. One great example is the Security Industry Association’s (SIA) Women in Security Forum. This group offers programs, professional development opportunities, and networking events with the goal of supporting the involvement of women in the security industry. The forum’s purpose is to engage all security professionals to promote, recruit, and cultivate the leadership of women for a more inclusive and diversified industry. In just five short years, the Women in Security Forum has rapidly grown to over 1,300 members. This summer Axis Americas—which played a role in creating the forum—served as a co-chair of the forum’s inaugural Security LeadHER event in Nashville, Tennessee, which brought together security professionals committed to advancing, connecting, and empowering women in security. The work of the Women in Security Forum has also helped raise more than $100,000 in scholarships, provided mentoring opportunities, and included a partnership with Dress for Success where we’ve collected clothing and funds for women looking for assistance in elevating themselves to better jobs. Report Cards Can Help You Evaluate Your Efforts As companies begin or continue efforts to improve sustainability, they should evaluate their efforts—and there are resources available to help do so. EcoVadis, for example, is the world’s largest and most trusted provider of business sustainability ratings, and it has created a global network of more than 100,000 rated companies. It works as a third-party to provide reliable, globally recognized sustainability ratings and insights that enable companies to reduce risk, drive improvement, and accelerate a positive impact on the planet and society. Axis undertakes an assessment each year carried out by EcoVadis to evaluate our environmental, social, and governance (ESG) efforts. For the last two years, Axis has earned a Silver Sustainability Rating from EcoVadis. These ratings not only serve as a testament to your efforts, but they help the organization identify gaps and develop plans for ongoing improvement. The great news is that there are many examples of companies, in general, and in the security industry, in particular, that are incorporating DE&I initiatives and sustainability into long-term planning. This move not only improves diversity within employee populations, but it also encourages diversity of thought and, ultimately, innovation in the development, design, production, and quality of products and services. As we in the security industry work to continue to improve existing technology and invent new products, let’s continue tapping into an expanded talent pool that can add experience, perspective, and diversity of thought. Together, we can raise the bar for the industry and improve our collective sustainability and success. Elaine Palome is the director of human resources, Americas, for Axis Communications.","filter_flag":1}
{"title":"All the latest on ethically sourced ingredients - dairyfoods.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmRhaXJ5Zm9vZHMuY29tL2FydGljbGVzLzk2NTgyLWFsbC10aGUtbGF0ZXN0LW9uLWV0aGljYWxseS1zb3VyY2VkLWluZ3JlZGllbnRz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmRhaXJ5Zm9vZHMuY29tL2FydGljbGVzLzk2NTgyLWFsbC10aGUtbGF0ZXN0LW9uLWV0aGljYWxseS1zb3VyY2VkLWluZ3JlZGllbnRz0gEA?oc=5","id":"CBMiWWh0dHBzOi8vd3d3LmRhaXJ5Zm9vZHMuY29tL2FydGljbGVzLzk2NTgyLWFsbC10aGUtbGF0ZXN0LW9uLWV0aGljYWxseS1zb3VyY2VkLWluZ3JlZGllbnRz0gEA","guidislink":false,"published":"Fri, 21 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=202, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmRhaXJ5Zm9vZHMuY29tL2FydGljbGVzLzk2NTgyLWFsbC10aGUtbGF0ZXN0LW9uLWV0aGljYWxseS1zb3VyY2VkLWluZ3JlZGllbnRz0gEA?oc=5\" target=\"_blank\">All the latest on ethically sourced ingredients<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">dairyfoods.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"All the latest on ethically sourced ingredients - dairyfoods.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmRhaXJ5Zm9vZHMuY29tL2FydGljbGVzLzk2NTgyLWFsbC10aGUtbGF0ZXN0LW9uLWV0aGljYWxseS1zb3VyY2VkLWluZ3JlZGllbnRz0gEA?oc=5\" target=\"_blank\">All the latest on ethically sourced ingredients<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">dairyfoods.com<\/font>","source.href":"https:\/\/www.dairyfoods.com","source.title":"dairyfoods.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"The sourcing of ingredients for dairy products is becoming increasingly complex. Evolving consumer and corporate interests regarding the development of food and its impact on the environment, people, and animals is triggering greater demand for ingredients that were sourced in an ethical manner. Ethical sourcing can be far-reaching. While the term often refers to the leveraging of ingredients that suppliers produce using processes and systems that are non-polluting, economically efficient, and conserve non-renewable natural resources and energy, it also can include animal welfare, environmental sustainability, and worker treatment and wages. “In today’s competitive marketplace, it’s no longer enough to create a great-tasting product,” says Kate Clancy, group sustainability director for ingredient supplier Cargill Cocoa & Chocolate, a unit of Minneapolis-based Cargill Inc. “Increasingly, it’s the compelling story that captivates consumers.” The treatment of workers and the environment are key considerations in the ethical sourcing of ingredients. Photo courtesy of Cargill Inc. By sourcing ingredients responsibly, companies also can better meet their environmental corporate governance (ESG) goals, which typically include reducing greenhouse gas emissions, more efficiently managing water, and supporting human rights and farmer livelihoods, Clancy says. Retailers join the movement Whole Foods Market is among the retailers focusing on ethical sourcing by, for instance, only offering cage-free or “better” eggs in its dairy cases. The operator’s Animal Welfare Standards for Laying Hens requires that suppliers’ hens have room to roam and scratch about; that no antibiotics are given to hens; that there are no land-animal byproducts in hen feed; that nests and perches are available for hens to roost at night; and that hens receive foraging material. Stores communicate such ethical sourcing to shoppers by tagging all eggs in dairy cases with one of four logos that indicate how the chickens live. Designations include: “cage-free plus,” in which birds must be able to move about freely indoors with amenities that support their natural behaviors; “outdoor access,” which signifies access to an outdoor area that is at least equivalent to the area of the house; “pasture-raised,” in which birds must have access to rangeland or grassland; and “outdoor living,” where birds are raised in an outdoor system that supports life on rangeland or grassland for their entire production cycle. Farmers choose their production system based on climate and their farm’s unique environment, and Whole Foods audits each farm on a 15-month interval to ensure compliance and to see the farm in all seasons over the course of time, the retailer reports. “Consumers want their consumption to have a positive impact,” says Jennifer Block, senior vice president, of dairy community relations for the Rosemont, Ill.-based Innovation Center for U.S. Dairy. “They want to know where their food comes from; that it’s healthy for their bodies; and that it’s produced in ways that take care of the environment, animals, and workers.” Efficient water management is among operators’ key ESG goals. Photo courtesy of Dairy Management Inc. Some processors are emphasizing the ethical sourcing of ingredients through the U.S. Dairy Stewardship Commitment, a voluntary pledge in which companies document and demonstrate social responsibility progress in such areas as animal care, environmental stewardship, product traceability, and community contributions. To date, 36 dairy companies representing approximately 75% of U.S. milk production have adopted the Stewardship Commitment, reports the Innovation Center for U.S. Dairy. “Ethical sourcing policies and programs are seen not only as ‘the right thing to do,’ but also as a way of gaining a competitive advantage,” says Mike Aquino, director of ESG for the Washington, D.C.-based International Dairy Foods Association (IDFA). “Long-run chances of supply chain disruption will be lower in well-managed chains that consider environmental, social, and governance risk factors. The demographic difference Demand for dairy products with ethically sourced ingredients, meanwhile, is set to rise as millennial and Gen Z shoppers increase their share of overall grocery spending and baby boomer activity declines, states Anne-Marie Roerink, president and founder of 210 Analytics LLC, a San Antonio-based market research and marketing strategies firm. “It is these younger generations that have a much higher tendency to weigh ethnical sourcing into their purchasing decisions, whether it be fair wages throughout the supply chain, taking care of the animal, or being mindful of the impact on the planet,” she notes. “This means that the importance of ethical sourcing is only going to get bigger over the next decade.” Product claims also will increasingly spotlight the use of grass-fed cows for cheese and milk production, as well as regenerative agriculture, Roerink highlights. Regenerative agriculture is a food production system that is designed to nurture and restore soil health while protecting the climate, water resources, and biodiversity, and enhancing farm productivity, she explains. “There is a growing group of consumers that understand that they are voting with their dollars on how the world is used,” says Andrew Martino, category manager of sugar and sweeteners at Global Organics, a Cambridge, Mass.-based certified organic ingredient supplier. “Dairy processors will benefit by communicating clearly to these consumers that they use ethically sourced ingredients and how they selected them.” More ingredient suppliers are opting for grass-feeding while enabling animals to roam. Photo courtesy of Dairy Management Inc. Such shoppers also are often willing to pay more for products that they perceive as being ethically and sustainably sourced, says Amanda Greenlee, Global Organics sustainability coordinator. “As more ethically sourced products come in the marketplace across multiple departments, the gap between interest and purchase will start to narrow,” Roerink states. “Stores with a high focus on ethical sourcing may also use pasture-raised eggs or grass-fed milk in their cakes and other baked goods and will often call this out in the bakery or on pack. The rise in assortment will subsequently drive an increase in awareness and demand.” Verification is vital Processors, meanwhile, can demonstrate their commitment to ethical sourcing and guarantee product integrity by incorporating ingredients that meet the guidelines of third-party certification organizations, notes James Ede, Cargill sustainability lead for starches, sweeteners, and texturizers. Yet, verifying that suppliers are meeting ethical standards is perhaps the biggest challenge for processors that are seeking to incorporate ethically sourced ingredients, relays David Thorrold, general manager, sales and marketing, for Hamilton, New Zealand-based Monk Fruit Corp. “Dairy processors should ask their suppliers to provide details of how they incorporate ethical sourcing into their business practices,” he states, adding that “third-party certification can be helpful for reducing the administrative burden when verifying that suppliers are meeting the expected ethical standards.” Company sustainability programs that establish standards and requirements for compliance and typically undergo audits on a yearly basis by independent third parties will further spotlight an adherence to ethical sourcing, Ede maintains. “It starts by partnering with a trusted supplier that offers sustainable, ethically sourced ingredients and transparent, traceable supply chains,” he notes. Establishing baseline expectations for all suppliers, which can involve working with stakeholders and legal counsel to develop a supplier code of conduct, will strengthen ethical sourcing initiatives as well, IDFA’s Aquino says. In addition, programs should have clearly defined, transparent, and, when applicable, science-based methodologies or criteria that is understandable to shoppers, he notes. “It is important to assess consumer familiarity with such programs in order to have sustainable sourcing certifications that build trust,” Aquino states. Yet, operating in an ethical manner can be challenging. The absence of a single unified definition for ethical, responsible, or sustainable sourcing, for instance, is making it difficult for processors to identify and incorporate the optimal ingredients, Cargill’s Clancy says. Animal welfare is a vital element in ethical sourcing decisions. Photo courtesy of Dairy Management Inc. “The proliferation of definitions and indicators for monitoring, along with the lack of standardization, is a key issue facing not just dairy processors but the entire industry,” she notes. “As a result, making comparisons between the available solutions has become an unenviable task.” Additional issues include tight supplies; uncertainty that consumers will notice and choose to pay for a differential product; the need to ensure that actions and communications will convey credibility with stakeholders; and having to instruct shoppers on standards and certifications, IDFA’s Aquino says. Education is essential Indeed, 210 Analytics' Roerink notes “the real challenge and opportunity are to educate consumers and clear up a lot of the confusion in the marketplace. That’s step one before the various production and sourcing methods can truly become differentiators.” Such confusion includes uncertainty regarding the difference between “free range” and “pasture-raised” products, and a lack of knowledge about regenerative agriculture, she states. “I had one shopper speculate that regenerative agriculture is taking the cells of an animal and growing the meat in a laboratory,” Roerink notes. “These are powerful reminders that industry jargon may not have the same meaning, and certainly not the impact, among consumers while demand for such products is growing.” It also can be arduous for processors to confirm that all the necessary product ingredients have valid third-party ethical sourcing certifications, Martino says. “As sustainability is becoming more of a consumer priority, there’s a lot of greenwashing going on and it isn’t always easy to decipher what’s really 'sustainable' without having oversight over your entire supply chain,” Global Organics’ Greenlee notes. “It’s important to work with trusted suppliers who do their due diligence and vet their sources well.” Processors also should team with suppliers that focus on ethically sourced ingredients, Cargill’s Clancy suggests. “Responsible sourcing efforts provide brands with visibility into their supply chains, giving manufacturers peace of mind, while further benefiting from the assurance that sustainability risks in the chain are being assessed and addressed,” she explains. “At the same time, it provides opportunities to build credible brand stories, engage with consumers, and foster trust and brand preference.” Dairy processors seeking ethically sourced ingredients, meanwhile, should first survey their existing suppliers as they “may be pleasantly surprised that many are already doing things the 'right way,'” Global Organics’ Martino says. Martino notes that operators also should give preferential treatment in the bid process to suppliers that ethically source. “Treating a farmer or ingredient producer ethically often involves giving them more money as those farmers and producers should not be forced to match the bid from those with non-ethically produced goods,” he suggests. While he says that it may be difficult for processors to locate all the necessary ingredients that have a valid third-party ethical sourcing certification, Greenlee concludes that there still are “ethical options for nearly any ingredient a processor is interested in sourcing.”","filter_flag":1}
{"title":"Task force to tackle construction waste in Manitoba - Daily Commercial News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vY2FuYWRhLmNvbnN0cnVjdGNvbm5lY3QuY29tL2pvYy9uZXdzL3Jlc291cmNlLzIwMjMvMDcvdGFzay1mb3JjZS10by10YWNrbGUtY29uc3RydWN0aW9uLXdhc3RlLWluLW1hbml0b2Jh0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vY2FuYWRhLmNvbnN0cnVjdGNvbm5lY3QuY29tL2pvYy9uZXdzL3Jlc291cmNlLzIwMjMvMDcvdGFzay1mb3JjZS10by10YWNrbGUtY29uc3RydWN0aW9uLXdhc3RlLWluLW1hbml0b2Jh0gEA?oc=5","id":"CBMicWh0dHBzOi8vY2FuYWRhLmNvbnN0cnVjdGNvbm5lY3QuY29tL2pvYy9uZXdzL3Jlc291cmNlLzIwMjMvMDcvdGFzay1mb3JjZS10by10YWNrbGUtY29uc3RydWN0aW9uLXdhc3RlLWluLW1hbml0b2Jh0gEA","guidislink":false,"published":"Mon, 31 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=212, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vY2FuYWRhLmNvbnN0cnVjdGNvbm5lY3QuY29tL2pvYy9uZXdzL3Jlc291cmNlLzIwMjMvMDcvdGFzay1mb3JjZS10by10YWNrbGUtY29uc3RydWN0aW9uLXdhc3RlLWluLW1hbml0b2Jh0gEA?oc=5\" target=\"_blank\">Task force to tackle construction waste in Manitoba<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Daily Commercial News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Task force to tackle construction waste in Manitoba - Daily Commercial News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vY2FuYWRhLmNvbnN0cnVjdGNvbm5lY3QuY29tL2pvYy9uZXdzL3Jlc291cmNlLzIwMjMvMDcvdGFzay1mb3JjZS10by10YWNrbGUtY29uc3RydWN0aW9uLXdhc3RlLWluLW1hbml0b2Jh0gEA?oc=5\" target=\"_blank\">Task force to tackle construction waste in Manitoba<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Daily Commercial News<\/font>","source.href":"https:\/\/canada.constructconnect.com","source.title":"Daily Commercial News","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Construction, renovation and demolition (CRD) activities represent one of the largest waste streams in Manitoba. The sector generates up to 30 per cent of the total waste that goes to landfill sites in the province. A new task force is hoping to change that by exploring ways Manitoba can move toward greater recycling of CRD waste materials, diverting them from landfills and producing new products for use in a variety of ways. The task force will examine what’s working well and consider options from other Canadian jurisdictions surrounding the reuse and recycling of construction materials. Members will also look for best practices to develop recommendations and engage with stakeholders to understand the issue from multiple perspectives. Chris Lorenc, president and CEO of the Manitoba Heavy Construction Association, is co-chair of the task force with Colleen Sklar, executive director of the Winnipeg Metropolitan Region. “Our industry is looking forward to sharing its experiences and innovations, including in the recycling of concrete aggregates, asphalt, shingles, water used in the production of aggregates, steel rebar and the likes,” Lorenc said. “The models we’ve read about in use in other countries, provinces and municipalities can be used to guide our best efforts here in Manitoba. “The construction industry has been recycling select materials from road or other projects, but there are numerous materials that could be recovered and reused from broader construction activities to promote resource management and environmental stewardship.” The task force will include participation from the City of Winnipeg, Association of Manitoba Municipalities, Winnipeg Construction Association and the Manitoba Home Builders’ Association. It has been asked to submit a report with recommendations to the Manitoba government this fall. The group was launched because a waste diversion and recycling framework review completed in 2021 identified CRD activities create one of the largest waste streams in Manitoba. Manitoba has one of the lowest rates of CRD material recycling. The construction and demolition sector, in particular, is one of the largest resource consumers and waste producers in society, using up to 40 per cent of the total raw materials extracted globally and generating about 35 per cent of the world’s waste. A 2015 study commissioned for Environment Canada estimated only 16 per cent of CRD waste was reused or recycled, while the remaining 84 per cent was disposed, mostly in landfills. But some jurisdictions have moved to adopt policies and practices for reclaiming and reusing construction and demolition waste. A provincial spokesperson said in a statement CRD waste represents four million tonnes, or 12 per cent, of the solid waste stream in Canada. “Reducing this waste stream extends the life of landfills, preserves finite resources, boosts the circular economy and reduces greenhouse emissions,” the spokesperson said. According to the province, reduce, reuse, recycle and recover are key elements that underpin the transition towards a circular economy, where construction and other post-consumer waste materials are integrated back into use and production cycles. The process leads to better preservation of natural resources, a reduction in GHG emissions, and the generation of new economic opportunities for Manitoba, the spokesperson stated. The most prevalent types of materials that can be recycled are wood, which includes clean, engineered, treated or painted wood, asphalt roofing and drywall. Other materials include metals, plastics, concrete, asphalt paving, bricks, glass, cardboard, and certain rock, gravel and aggregates. The ability to recycle materials varies by region and depends on a number of factors such as processing capacity, end use and market value. The province expects a greater focus on recycling CRD waste materials will create new jobs around recycling. “Waste diversion and recycling activities can create new green jobs,” the spokesperson said. “Exploring opportunities to increase the circular economy in Manitoba, including the creation of new green jobs, is one of the objectives of the CRD task force.” A final report with recommendations will be provided to Environment and Climate Minister Kevin Klein once the task force completes its work. “Construction, renovation and demolition waste is a major contributor to our landfills, so by diverting these materials through reuse and recycling, we help address the problem while protecting our environment,” said Klein, noting diverting materials from the waste stream is a good deal for everybody. The benefits of greater recycling of CRD waste aligns with the Winnipeg Metropolitan Region’s draft Plan 20-50, which will establish a regional approach supporting waste minimization, diversion and recycling. “Building resiliency in our region is a key objective in Plan 20-50,” said co-chair Sklar. “This starts with improved data sharing and good working relationships across all levels of government, which ensure sound decision-making and an environment of trust.”","filter_flag":1}
{"title":"Expansion of Evonik's methionine production capacity in Singapore moves to next stage - Aquafeed.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihgFodHRwczovL3d3dy5hcXVhZmVlZC5jb20vcHJvZHVjdHMvc3VwcGxpZXJzLW5ld3MvZXhwYW5zaW9uLW9mLWV2b25pa3MtbWV0aGlvbmluZS1wcm9kdWN0aW9uLWNhcGFjaXR5LWluLXNpbmdhcG9yZS1tb3Zlcy10by1uZXh0LXN0YWdlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihgFodHRwczovL3d3dy5hcXVhZmVlZC5jb20vcHJvZHVjdHMvc3VwcGxpZXJzLW5ld3MvZXhwYW5zaW9uLW9mLWV2b25pa3MtbWV0aGlvbmluZS1wcm9kdWN0aW9uLWNhcGFjaXR5LWluLXNpbmdhcG9yZS1tb3Zlcy10by1uZXh0LXN0YWdlL9IBAA?oc=5","id":"CBMihgFodHRwczovL3d3dy5hcXVhZmVlZC5jb20vcHJvZHVjdHMvc3VwcGxpZXJzLW5ld3MvZXhwYW5zaW9uLW9mLWV2b25pa3MtbWV0aGlvbmluZS1wcm9kdWN0aW9uLWNhcGFjaXR5LWluLXNpbmdhcG9yZS1tb3Zlcy10by1uZXh0LXN0YWdlL9IBAA","guidislink":false,"published":"Tue, 25 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=206, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihgFodHRwczovL3d3dy5hcXVhZmVlZC5jb20vcHJvZHVjdHMvc3VwcGxpZXJzLW5ld3MvZXhwYW5zaW9uLW9mLWV2b25pa3MtbWV0aGlvbmluZS1wcm9kdWN0aW9uLWNhcGFjaXR5LWluLXNpbmdhcG9yZS1tb3Zlcy10by1uZXh0LXN0YWdlL9IBAA?oc=5\" target=\"_blank\">Expansion of Evonik's methionine production capacity in Singapore moves to next stage<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Aquafeed.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Expansion of Evonik's methionine production capacity in Singapore moves to next stage - Aquafeed.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihgFodHRwczovL3d3dy5hcXVhZmVlZC5jb20vcHJvZHVjdHMvc3VwcGxpZXJzLW5ld3MvZXhwYW5zaW9uLW9mLWV2b25pa3MtbWV0aGlvbmluZS1wcm9kdWN0aW9uLWNhcGFjaXR5LWluLXNpbmdhcG9yZS1tb3Zlcy10by1uZXh0LXN0YWdlL9IBAA?oc=5\" target=\"_blank\">Expansion of Evonik's methionine production capacity in Singapore moves to next stage<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Aquafeed.com<\/font>","source.href":"https:\/\/www.aquafeed.com","source.title":"Aquafeed.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"The company plans a reduced production in Singapore in Q4\/2023 and for three months in H1\/2024 due to expansion shutdowns. Evonik is making progress with the expansion of its DL-methionine production plant in Singapore. In order to reach an important milestone in the construction process, production at the Singapore plant on Jurong Island will be reduced for three months in Q4\/2023, followed by another three-month tie-in shutdown in the first half of 2024. This shutdown is part of the implementation of Evonik’s methionine asset strategy to safeguard long-term global supply security. The expansion is proceeding as expected and the planned production stops in Q4\/2023 and H1\/2024, which are necessary for maintenance and safety reasons, will allow modifications to be made that would not be possible during day-to-day operations. “We fully understand that these shutdowns may pose challenges for our customers and our teams have prepared mitigation plans for MetAMINO® supply from our global production network. We are in continuous communication with regional and global customers to carefully plan shipments,” said Noel Kim, regional vice president Animal Nutrition. Earlier this year, Evonik announced a high double-digit million-euro investment to boost the production capacity of MetAMINO® (DL-methionine) on Jurong Island, Singapore, by 40,000 metric tons per year to around 340,000 metric tons per year. The expansion will improve the efficiency of the facility’s processes and reduce the carbon footprint of all Evonik’s MetAMINO® production in Singapore by 6% (Scope 1+2+3).","filter_flag":1}
{"title":"Jindal Group Makes a Grand Comeback: Snaps up Sohar Steel After Three-Year Break - ChemAnalyst","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiigFodHRwczovL3d3dy5jaGVtYW5hbHlzdC5jb20vTmV3c0FuZERlYWxzL05ld3NEZXRhaWxzL2ppbmRhbC1ncm91cC1tYWtlcy1hLWdyYW5kLWNvbWViYWNrLXNuYXBzLXVwLXNvaGFyLXN0ZWVsLWFmdGVyLXRocmVlLXllYXItYnJlYWstMTg5NDDSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiigFodHRwczovL3d3dy5jaGVtYW5hbHlzdC5jb20vTmV3c0FuZERlYWxzL05ld3NEZXRhaWxzL2ppbmRhbC1ncm91cC1tYWtlcy1hLWdyYW5kLWNvbWViYWNrLXNuYXBzLXVwLXNvaGFyLXN0ZWVsLWFmdGVyLXRocmVlLXllYXItYnJlYWstMTg5NDDSAQA?oc=5","id":"CBMiigFodHRwczovL3d3dy5jaGVtYW5hbHlzdC5jb20vTmV3c0FuZERlYWxzL05ld3NEZXRhaWxzL2ppbmRhbC1ncm91cC1tYWtlcy1hLWdyYW5kLWNvbWViYWNrLXNuYXBzLXVwLXNvaGFyLXN0ZWVsLWFmdGVyLXRocmVlLXllYXItYnJlYWstMTg5NDDSAQA","guidislink":false,"published":"Fri, 21 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=202, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiigFodHRwczovL3d3dy5jaGVtYW5hbHlzdC5jb20vTmV3c0FuZERlYWxzL05ld3NEZXRhaWxzL2ppbmRhbC1ncm91cC1tYWtlcy1hLWdyYW5kLWNvbWViYWNrLXNuYXBzLXVwLXNvaGFyLXN0ZWVsLWFmdGVyLXRocmVlLXllYXItYnJlYWstMTg5NDDSAQA?oc=5\" target=\"_blank\">Jindal Group Makes a Grand Comeback: Snaps up Sohar Steel After Three-Year Break<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ChemAnalyst<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Jindal Group Makes a Grand Comeback: Snaps up Sohar Steel After Three-Year Break - ChemAnalyst","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiigFodHRwczovL3d3dy5jaGVtYW5hbHlzdC5jb20vTmV3c0FuZERlYWxzL05ld3NEZXRhaWxzL2ppbmRhbC1ncm91cC1tYWtlcy1hLWdyYW5kLWNvbWViYWNrLXNuYXBzLXVwLXNvaGFyLXN0ZWVsLWFmdGVyLXRocmVlLXllYXItYnJlYWstMTg5NDDSAQA?oc=5\" target=\"_blank\">Jindal Group Makes a Grand Comeback: Snaps up Sohar Steel After Three-Year Break<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ChemAnalyst<\/font>","source.href":"https:\/\/www.chemanalyst.com","source.title":"ChemAnalyst","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Jindal Group Makes a Grand Comeback: Snaps up Sohar Steel After Three-Year Break Oman: The acquisition of Sohar Steel by Jindal Group and Vulcan Investments, an industrial conglomerate based in Oman, has been successfully finalized following an impressive three-year hiatus. This accomplishment marks a turning point for the Steel sector and exemplifies Jindal Group's commitment to assisting the country, developing social sustainability, and encouraging economic diversification. Harsha Shetty, a senior official from the Jindal Group Oman, expressed her sincere gratitude to H E Qais Mohammed al Yousef, Minister of Commerce, Industry, and Investment Promotion; and the members of the Competition Protection and Monopoly Prevention Center (CPMPC) for their invaluable support and cooperation in the successful acquisition of Sohar Steel. Harsha Shetty added that the acquisition represents an extraordinary step forward for Jindal Group and solidifies its position as a prominent leader in the Steel industry. This historic deal became a reality thanks in large part to their commitment to upholding fair standards, Shetty said. Sohar Steel, which is strategically situated in Oman next to the seaport of Sohar, will be essential in fostering industrial growth and strengthening the sultanate's infrastructure. The plant has a production capacity of 700,000 tonnes per year and is equipped with cutting-edge machinery, such as the Bendotti Walking Beam Reheating Furnace and Automatic Tension Control. It specializes in high-quality Steel products, including billets, rebars, and the proposed new products, wire rods between 5.5mm and 16mm. This strategic step harmonizes with unshakable commitment to Oman's socioeconomic development and reflects a strong willingness to advance Oman's industrial environment. Well-positioned to spearhead ground-breaking initiatives, create exciting employment opportunities, and contribute to the realization of the nation's vision for a vibrant and sustainable future by combining cutting-edge innovations and leveraging significant knowledge. Together, we will push forward, turning obstacles into chances to create a thriving and durable economy for future generations. The plant's highly successful revival is proof of Jindal Group's proactive strategy and unwavering commitment. Through its involvement, the group has given the institution new life, revitalized its successful operations and encouraged a positive vibe in the neighborhood. Beyond simply rehiring more than 150 local talents, this strategic acquisition supports the sultanate's goals for a thriving and diverse economy. Additionally, this acquisition demonstrates Jindal Group's unwavering dedication to developing local talent and offering a wealth of prospects for advancement. The Jindal Group strengthens the sultanate's human capital by giving the re-employed people the opportunity to grow professionally, experience social mobility, and enhance their talents. This empowers the sultanate's citizens to greatly advance the country. With a proven track record in the Steel industry and a commitment to low carbon footprint projects, community-centric values, social sustainability, and environmental stewardship, Jindal Group continues to advance Oman's development and competitiveness on a worldwide scale. The company is still committed to advancing the nation and guiding the achievement of its enormous potential, according to Jindal Group.","filter_flag":1}
