{"title":"Why Constellation Energy, a Nuclear-Heavy Giant, Is Primed for Power Futurity - POWER magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LnBvd2VybWFnLmNvbS93aHktY29uc3RlbGxhdGlvbi1lbmVyZ3ktYS1udWNsZWFyLWhlYXZ5LWdpYW50LWlzLXByaW1lZC1mb3ItcG93ZXItZnV0dXJpdHkv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LnBvd2VybWFnLmNvbS93aHktY29uc3RlbGxhdGlvbi1lbmVyZ3ktYS1udWNsZWFyLWhlYXZ5LWdpYW50LWlzLXByaW1lZC1mb3ItcG93ZXItZnV0dXJpdHkv0gEA?oc=5","id":"CBMiZWh0dHBzOi8vd3d3LnBvd2VybWFnLmNvbS93aHktY29uc3RlbGxhdGlvbi1lbmVyZ3ktYS1udWNsZWFyLWhlYXZ5LWdpYW50LWlzLXByaW1lZC1mb3ItcG93ZXItZnV0dXJpdHkv0gEA","guidislink":false,"published":"Wed, 01 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=1, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=32, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LnBvd2VybWFnLmNvbS93aHktY29uc3RlbGxhdGlvbi1lbmVyZ3ktYS1udWNsZWFyLWhlYXZ5LWdpYW50LWlzLXByaW1lZC1mb3ItcG93ZXItZnV0dXJpdHkv0gEA?oc=5\" target=\"_blank\">Why Constellation Energy, a Nuclear-Heavy Giant, Is Primed for Power Futurity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">POWER magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why Constellation Energy, a Nuclear-Heavy Giant, Is Primed for Power Futurity - POWER magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LnBvd2VybWFnLmNvbS93aHktY29uc3RlbGxhdGlvbi1lbmVyZ3ktYS1udWNsZWFyLWhlYXZ5LWdpYW50LWlzLXByaW1lZC1mb3ItcG93ZXItZnV0dXJpdHkv0gEA?oc=5\" target=\"_blank\">Why Constellation Energy, a Nuclear-Heavy Giant, Is Primed for Power Futurity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">POWER magazine<\/font>","source.href":"https:\/\/www.powermag.com","source.title":"POWER magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Mitigation\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Spun out of Exelon Corp. a year ago, Constellation Energy’s competitive generation and customer-facing energy businesses represent a new power company paradigm that conforms to decarbonization. But the company that today holds the largest nuclear fleet in the U.S. will still face a unique array of challenges. In 1882, soon after inventor and researcher Thomas Edison developed the practical lightbulb, several prominent Chicagoans banded together to charter the Western Edison Light Co. and develop a central station electric system as an Edison agency. Within five years, the company became part of Chicago Edison Co., and in 1892, 22-year-old Samuel Insull—who would later become a prime mover of the electric utility model—assumed the burgeoning company’s presidency. After incorporating another utility, the Commonwealth Electric Light & Power Co., in 1897, Insull formally merged the company with Chicago Edison in 1907, creating Commonwealth Edison Co. Separately, in Philadelphia, efforts to consolidate the Brush Electric Light Co. evolved into the organization of the Edison Electric Light Co. of Philadelphia in 1886, and after another frenzied period of consolidation, the Philadelphia Electric Co. (PECO) emerged in 1902. 1. An image from 1958 shows the inside of Dresden Unit 1. Built by Commonwealth Edison, the 210-MW unit was one of General Electric’s first boiling water reactors. It was also the first privately financed commercial nuclear power plant in the U.S. Construction on the unit began in 1957 and was completed two years later. While the unit was shuttered for maintenance in October 1978, the Three Mile Island accident occurred, and ensuing regulations made the multi-million-dollar investment needed to bring Unit 1 into compliance economically unfeasible. Source: U.S. Atomic Energy Commission Both companies quickly grew in parallel as demand for electricity soared in the 1920s. While PECO built the Conowingo hydroelectric dam in 1928 and fostered several major generating projects—like Eddystone Unit 1, a pioneering supercritical coal-fired plant in 1960—Commonwealth Edison built the iconic Fisk Street power plant in Illinois and the State Line Generating plant in Indiana. When commercial nuclear generation became feasible, Commonwealth Edison began operating the nation’s first privately financed commercial nuclear power station, Dresden 1 (Figure 1), a boiling water reactor (BWR) near Morris, Illinois, in 1960, while PECO built a prototype helium-cooled, graphite-moderated reactor at Peach Bottom, Pennsylvania, in 1967. PECO expanded its nuclear assets with the Limerick generating station in 1968, and ultimately expanded Peach Bottom with two full-size BWRs in 1974. Commonwealth Edison, meanwhile, constructed several more dual-unit nuclear plants, completing Quad Cities in 1973, La Salle in 1982, Byron in 1984, and Braidwood in 1986. In 1994, however, ComEd, as it was then known, became part of a newly formed parent company, Unicom. Meanwhile, PECO was working on expanding its nuclear fleet. In 1997, it formed AmerGen as a joint venture with British Energy. AmerGen acquired the Clinton Power Station and Three Mile Island Unit 1 in December 1999, and the Oyster Creek Generating Station in August 2000. In October 2000, as part of a bid to create the nation’s nuclear powerhouse, Unicom and PECO merged, creating Exelon Corp., a giant electric utility with a combined capacity of 19.1 GW (including 14 GW of nuclear, 2.8 GW of coal, and 2 GW of gas generation). At the time, analysts lauded the merger’s potential to streamline nuclear production as states opened up their utilities to competition, betting that nuclear plants would produce energy more economically than competing sources of power. Exelon continued its rich nuclear heritage, and even expanded it in December 2003, when Exelon Generation acquired British Energy’s 50% stake in AmerGen. Then, in January 2009, Exelon Generation officially integrated the nuclear generation assets held by AmerGen into Exelon Nuclear and dissolved the AmerGen legal entity. In 2012, Exelon merged with Constellation Energy Group (CEG), adding majority shares of Calvert Cliffs nuclear plant in Maryland (a 2022 POWER Top Plant), and R.E. Ginna and Nine Mile Point in upstate New York to the company’s fleet. In 2017, it added the 838-MW James A. FitzPatrick Nuclear Power Plant in New York to its fleet, acquiring the former Entergy plant after New York adopted its Clean Energy Standard. The company did cut its fleet in 2018, however, with the closure of its Oyster Creek unit. In February 2021, responding to rapid changes in the power industry, Exelon Corp. cleaved its business into two publicly traded companies: Chicago-based Exelon, which comprises its six regulated electric and gas utilities, and Baltimore-based Constellation Energy, a spinoff comprising its 31-GW competitive generation fleet and customer-facing businesses. The business separation concluded in February 2022. A Generating Giant with Nuclear at Its Core Though Constellation Energy has officially functioned as an independent, publicly traded company for only a year, the company appears to have emerged with a sharply defined purview and strategy. Today, the company is primarily a power supplier—one of the largest competitive electric generation companies in the U.S.— that holds a 32.4-GW fleet (Figure 2). Its generating profile comprises 21 GW of nuclear from 23 units, which provide baseload zero-emission power, and 12 GW of natural gas, oil, hydroelectric, wind, and solar assets, which provide baseload, intermediate, and peaking functions. 2. Constellation Energy’s 32.4-GW generating fleet produces an output that is nearly 90% carbon-free. The company owns a fleet of 23 nuclear units with a combined capacity of 20.9 GW, 8.8 GW of natural gas and oil generating plants, and 2.7 GW of renewable assets. Source: Constellation Energy\/POWER Its generating assets are spread across five segments. These include 11.9 GW in the Midwest, spanning the western half of PJM and most of the Midcontinent Independent System Operator (MISO); 10.5 GW in the Mid-Atlantic, which covers the eastern half of PJM Interconnection; 3 GW in the New York Independent System Operator (NYISO); 3.6 GW in the Electric Reliability Council of Texas (ERCOT); and another 3.3 GW in other power regions, including New England, the South, the West, and Canada. Constellation, however, also holds a “customer-facing” business, selling electricity, natural gas, and other energy-related products and solutions to 2 million customers, including distribution utilities, municipalities, cooperatives, commercial and industrial (C&I), governmental, and residential customers in competitive markets across multiple geographic regions. In 2021, Constellation supplied about 140 TWh of electric power load through the retail market and 800 billion cubic feet of gas—mainly to C&I customers—and 65 TWh of power load through wholesale channels across competitive load procurements and bilateral sales to municipalities, co-ops, banks, and other wholesale entities. Another notable element of Constellation’s businesses is its “energy solutions” arm—one of the largest of its kind in the U.S.—which it describes as a “non-commodity element” that functions to provide its customers with sustainability, efficiency, and technology solutions. “The ongoing ability to optimize energy consumption for customers allows us to support customer demands with the right combination of technology and efficiency program options,” the company says. “For example, our CORe [Constellation Offsite Renewables] product serves C&I customers’ sustainability needs by matching contracted, third-party renewable generation with customer desire to add additional carbon-free generation to the grid (additionality) and geographic preference.” Finally, the company’s forward-looking solutions are fostered by a dedicated commercialization team, Constellation Technology Ventures, which invests in and collaborates with portfolio companies to deploy value-driving products and technologies across its broad customer base, such as for electric vehicle and charging infrastructure, sustainability monitoring and reporting tools, distributed energy resources and financing solutions, and a web-based energy marketplace. A Strategy Primed for Unprecedented Changes Constellation notes that these businesses evolved from a mission it inherited from Exelon to provide environmentally friendly energy. Today, Constellation strives to own 100% carbon-free generation by 2040, with an interim goal of going 95% carbon-free by 2030 (though Constellation noted that will depend on “policy support and technology advancement”). It is also working to reduce its operations-driven emissions by 100% by 2040, and reduce its methane emissions 30% from 2020 levels by 2030. Another key aspect of its strategy involves reducing its supply chain emissions. The company is committed to providing “100% of C&I customers with customer-specific information on their GHG [greenhouse gas] impact for facilities contracting for power and gas supply from Constellation, including mitigation opportunities that include 24\/7 clean electric use,” it notes. A final but significant goal involves committing to enable future technologies and business models that could drive a clean energy economy. Constellation said its strategy responds to “unprecedented changes” in the U.S. energy sector that are poised to “increase the demand for reliable, clean power generation.” While recent government and corporate policies have targeted accelerated decarbonization, recent policy support for nuclear energy is rooted in bolstering energy security, reliability, and diversification, it notes. The strategy also caters to rapid electrification of the U.S. economy, and evolving customer preferences that favor clean energy, choice, and digitization. “We expect widespread electrification could result in U.S. electricity demand to nearly double from what it is today by 2050,” it said in its most recent 10-K filing (dated December 2021). However, “The foundation of our sustainability approach is our best-in-class, carbon-free, 24\/7 generation assets, which enable us to produce more clean energy than any generation company in the U.S.,” the company stressed. “We believe our generation fleet is uniquely positioned to support reaching clean-energy targets at the state and national levels. Our world-class nuclear operations are a cornerstone in response to the climate crisis, and these assets are durable with the potential to operate well into the 2050s and 2060s and potentially beyond.” Constellation’s Technology Focus While 65% of Constellation Energy’s generating profile is nuclear-based, it acknowledges that the future of its business will depend on technology enhancements. The company, notably, envisions transforming its nuclear fleet into “clean energy centers” that could satisfy growing demand for carbon-free and flexible energy, but also provide an array of new products, including hydrogen. Work is nearing completion under a $5.8 million Department of Energy (DOE) award supporting the construction and installation of a low-temperature electrolysis system at the Nine Mile Point Nuclear Station in upstate New York (Figure 3) that will demonstrate hydrogen production from nuclear energy. The project will be the first nuclear-powered clean hydrogen production facility in the U.S. and will use the hydrogen to help cool the plant. A separate $12.5 million award from the New York State Energy Research and Development Authority (NYSERDA) to power a fuel cell at the facility is also underway and is expected to start providing additional power to the grid in 2025. Along with these projects, Constellation is “seeking to expand hydrogen production to other plants in its fleet and is exploring ways to reduce emissions at its fossil plants by blending clean hydrogen with natural gas,” said Constellation President and CEO Joseph Dominguez. In tandem, Constellation is exploring the benefits of constructing Carbon Engineering’s direct air capture (DAC) technology at its Byron nuclear plant in northern Illinois. The study, slated to conclude this year, will explore leveraging the massive flow of clean water vapor from the plant’s twin 495-foot-tall hyperbolic cooling towers to capture and later sequester carbon dioxide from the air. “In this way, nuclear plants have the potential not only to be carbon-free, but carbon negative,” Dominguez noted. Constellation is meanwhile partnering with Microsoft to develop a “24\/7\/365” clean energy matching technology that could help customers across the country achieve “true-zero emissions, as opposed to the current practice of annualizing renewable energy certificates and credits,” he added. “Our 24\/7\/365 solution will be the most advanced, real-time carbon accounting solution of its kind, going beyond other net zero programs that aggregate clean energy megawatts over time, and giving customers clearer and more accurate data on their emissions impact.” It is also notably piloting solutions that could potentially decarbonize natural gas generation. As part of these efforts, Constellation Energy has forged a strategic partnership with NET Power, a technology developer that is promoting a supercritical carbon dioxide power cycle that promises to produce low-carbon natural gas power. In addition, Constellation has a 10-year agreement to provide renewable natural gas (RNG) to American Natural Gas procured from the Landfill Group’s RNG production facility in Iowa. An Optimistic Outlook Buoyed by Policy Triumphs While Constellation’s strategy appears to fit snugly within decarbonization channels today, getting there has required notable gambles from the company, including dogged advocacy on state and federal levels. The competitive generator has marked a series of notable triumphs in recent months. Today, after seven years of rigorous lobbying—sometimes at significant odds with other competitive generators—Constellation can bank on state programs that compensate some nuclear plants for their carbon-free contributions. These include zero-emissions credit (ZEC) programs, which New York and Illinois launched in 2017, and New Jersey launched in 2019. (Deliveries under Illinois’ recent carbon mitigation credit contracts began in June 2022.) To date, 66% of Constellation’s nuclear capacity operates under state programs, providing essential “stable revenues that enable continued investment in our nuclear plants and provide essential customer protections to buffer against price fluctuations,” the company said. “By 2023, 56% of our total power generation output will be receiving state-level compensation for their clean attributes,” it said. The August 2022 Inflation Reduction Act (IRA), meanwhile, enacted other key benefits, including a production tax credit (PTC) of $15\/MWh for existing nuclear, beginning in 2024 and through 2032, and up to a $3\/kilogram credit for producing hydrogen from clean sources, including nuclear, after 2022. Over the past few years, the company has also advocated for federal authority to regulate GHG emissions from power plants under the Clean Air Act, for Pennsylvania’s entry into the Regional Greenhouse Gas Initiative, and for other federal environmental rules limiting hazardous pollutants. Constellation suggests these policy boosts have been long overdue. The nuclear PTC, in particular, provides “consistent returns by creating downside protection through commodity cycles with inflation protection,” said Constellation’s president and CEO, Joseph Dominguez, during a November 2022 earnings call. “We’ve said this before, but it bears constant repeating. The most important energy commodity in the world today is a reliable zero-emission clean energy megawatt. I don’t care how you make it, but producing affordable clean energy that shows up whenever and wherever you want is the foundation of any modern energy system that deals with climate,” he said. “The PTC begins to recognize the value of that scarce commodity and we make more of it than anyone in America,” he said. A Complex Risk Landscape The company, however, continues to grapple with key uncertainties. One stems from a second 20-year license renewal for Peach Bottom Units 2 and 3. Though the Nuclear Regulatory Commission (NRC) granted the units the authority to operate through 2053 and 2054, respectively, in February 2022, the NRC later moved to reevaluate environmental impacts resulting from subsequent license renewal (SLR), and reverted the units’ license expiration dates to 2033 and 2034. While the NRC is now slated to complete the reevaluation process by April 2024, Constellation said it expects that the license expiration dates will be restored to 2053 and 2054. The company is now considering SLR renewals for its other reactors. In November, Constellation asked the NRC to renew licenses for its Clinton and Dresden units in Illinois. Among the company’s near-term concerns are potential sanctions on Russian nuclear fuel supply and enrichment activities, as well as a “yet undefined action by Russia to limit energy deliveries.” Constellation noted that its nuclear fuel deliveries have not been affected by the Russian-Ukraine conflict, mainly because they are obtained predominantly through a “diverse set of domestic and international suppliers” via long-term uranium supply and service contracts. However, “Approximately 50% of our uranium concentrate requirements from 2022 through 2026 are supplied by three suppliers,” the company acknowledged. For now, the company is currently working with federal policymakers and other stakeholders to “facilitate the expansion of the domestic nuclear fuel cycle within the U.S. to improve carbon-free energy security,” it said. Finally, like other competitive power generators, Constellation is exposed to commodity price risk—risks associated with price movements resulting from changes in supply and demand; fuel costs; market liquidity; weather conditions; governmental, regulatory, and environmental policies; and other factors. The vulnerability was especially pronounced in Texas during Winter Storm Uri in 2021, when its state-of-the-art gas-fired Colorado Bend II, Wolf Hollow II, and Handley plants experienced outages owing to extreme cold weather conditions. The company noted, however, that it proactively uses hedging strategies to mitigate commodity price risks. Over the past few years, the company has also grappled with regulatory uncertainty in organized wholesale markets like PJM and NYISO, where capacity markets include a minimum-offer price rule (MOPR). While the MOPR in PJM applied only to certain new gas-fired resources before December 2019, the Federal Energy Regulatory Commission (FERC) required PJM to broadly apply the MOPR to all new and existing resources including nuclear and renewables. While FERC included some limited exemptions, those exemptions were not available to state-supported nuclear resources. As a result, the MOPR applied in the 2022\/23 capacity auction to Constellation’s owned or jointly owned nuclear plants receiving a benefit under the Illinois and New Jersey ZEC programs, and it ultimately prevented the Quad Cities nuclear power plant from clearing in the capacity auction (though the Quad Cities plant has continued to operate with support provided under the 2017 Illinois Future Energy Jobs Act). MOPR reforms later enacted in September 2021, however, determined that the MOPR would no longer apply to Constellation nuclear plants. Constellation said its ratable hedging strategies, coupled with stable revenues generated through capacity markets and contracts for zero-emission attributes would enable the business to continue to mitigate volatility, while “preserving long-term optionality to realize potential upside from market price improvements and\/or state and federal clean energy programs.” New developments, particularly on the policy front, have ushered in a bright outlook for the company, Dominguez suggested. “Looking ahead, I have never been more optimistic about the future of our industry and our company,” he said. “A majority of Fortune 500 companies have set climate and clean energy goals, as have 25 states and 600 local governments. Our federal government has a plan to procure 100% carbon pollution-free electricity by 2030. And there is growing consensus among leading climate scientists and policymakers that nuclear energy is critical to meeting the climate challenge. The call for meaningful change is undeniable and growing louder.”","filter_flag":1}
