{"title":"Automation Shines at First Solar | ASSEMBLY - Assembly Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85NzU0Mi1hdXRvbWF0aW9uLXNoaW5lcy1hdC1maXJzdC1zb2xhctIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85NzU0Mi1hdXRvbWF0aW9uLXNoaW5lcy1hdC1maXJzdC1zb2xhctIBAA?oc=5","id":"CBMiS2h0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85NzU0Mi1hdXRvbWF0aW9uLXNoaW5lcy1hdC1maXJzdC1zb2xhctIBAA","guidislink":false,"published":"Sun, 08 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=8, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85NzU0Mi1hdXRvbWF0aW9uLXNoaW5lcy1hdC1maXJzdC1zb2xhctIBAA?oc=5\" target=\"_blank\">Automation Shines at First Solar | ASSEMBLY<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Assembly Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Automation Shines at First Solar | ASSEMBLY - Assembly Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85NzU0Mi1hdXRvbWF0aW9uLXNoaW5lcy1hdC1maXJzdC1zb2xhctIBAA?oc=5\" target=\"_blank\">Automation Shines at First Solar | ASSEMBLY<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Assembly Magazine<\/font>","source.href":"https:\/\/www.assemblymag.com","source.title":"Assembly Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Manufacturing\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Every day in more than 45 countries, photovoltaic modules designed and manufactured by First Solar go to work converting sunlight into clean, reliable electricity. First Solar is the only American company ranked among the world’s top 10 solar manufacturers. The company’s headquarters is in Tempe, AZ, but its roots are in Ohio, where it operates the largest solar manufacturing footprint in the Western Hemisphere. More than half of First Solar’s 2,700 U.S. employees are located in Ohio. What’s more, First Solar’s U.S. manufacturing footprint will soon be getting even bigger. In August 2021, the company begun construction of a new $680 million solar module assembly plant near its existing factory in Perrysburg, OH. That factory—the company’s third—is expected to come on line this year. And, in November 2022, First Solar announced that it will invest more than $1 billion to build a fourth assembly plant in Florence, AL. Expected to create more than 700 jobs, the factory is part of a previously announced plan to increase First Solar’s U.S. manufacturing capacity to more than 10 gigawatts by 2025. The Alabama project will bring the company’s total investment in U.S. manufacturing to more than $4 billion. The company also operates factories In Malaysia and, soon, in India. To get the scoop on all this investment, we sat down with Mike Koralewski, chief manufacturing operations officer for First Solar. ASSEMBLY: Why is First Solar producing photovoltaic modules here in the U.S.? Koralewski: First Solar is the only American company among the world’s largest solar manufacturers. We’ve been producing modules in Ohio since we first started manufacturing back in 2002. Our module technology is uniquely American: It was developed in our research and development facilities in Ohio and California. The U.S. is also our single largest market. In the past several years, the U.S. solar industry has had to contend with amplified political and trade risks as a consequence of the tariffs employed to protect our markets from anti-competitive practices by Chinese solar manufacturers. In addition, challenging conditions in ocean freight over the past several years really impacted the ability to ship modules around the globe. All that has led to an increase in demand for domestically made modules, and we are aligning our manufacturing capacity to accommodate that. All the major players in the solar industry are now thinking about the shortcomings of maintaining a single global hub for manufacturing. Locating our supply chain and manufacturing as close to each customer base as possible allows us to mitigate a lot of the negative impacts associated with overreliance on transoceanic shipping. It allows us to be competitive with our pricing and to provide a reliable supply to our customers moving forward. First Solar’s factory in Ohio can turn a sheet of glass into a fully functional photovoltaic module in just four and a half hours, end to end, all under one roof. Photo courtesy First Solar Inc. ASSEMBLY: First Solar’s factory in Ohio can turn a sheet of glass into a fully functional photovoltaic module in just four and a half hours, end to end, all under one roof. In contrast, competing products can take days to make. How can you produce modules so quickly? Koralewski: Our factories are among the most advanced in the solar industry, using technology and process optimization that effectively competes against Chinese-made solar panels that are only cheap because they’re heavily subsidized by the government. To compete with the Chinese, we needed to leapfrog their technology with American ingenuity and innovation. So we really push on cycle time and throughput. The key is our thin-film deposition process, which is completely different than that of our competitors. Our process is actually more similar to making a flat-screen TV than a crystalline silicon solar panel. We are vertically integrated, which also helps with speed. We go from beginning to end. We don’t have multiple factories producing individual components. We start with that raw sheet of glass and finish with a solar module by using a continuous process vs. a batch process like our competitors. ASSEMBLY: What’s the difference between a continuous process and a batch process? Koralewski: Let’s say the first step in your manufacturing process is a washing operation. In a batch process, you might wash 100 modules at a time. You would then put those in a container and move that batch to the next operation in the process. Our manufacturing process is continuous. Think of it like a highway, where one car is always followed by another. All of our assets are interconnected by a conveyor. You go from one process straight to the next one. There’s no batching. You just continuously flow from one process to the next. ASSEMBLY: What is the most challenging aspect of making a photovoltaic module? Koralewski: One of the most challenging aspects, at least for U.S. manufacturers, is ensuring a level playing field for our products. Eight of the top 10 solar panel manufacturers are Chinese companies that benefit from unfair subsidies and other forms of government support that contravene World Trade Organization rules on fair trade. For example, many Chinese companies practice unfair trade policies, such as dumping photovoltaic panels at prices that are designed to decimate international competitors. Other manufacturers circumvent trade duties by routing products through Southeast Asia even though they’re actually made in China. We are building a competitive, responsibly produced, high-quality product, but we spent a tremendous amount of time and resources fighting for fairness. ASSEMBLY: First Solar’s Series 6 modules are made using less energy, less water, and less semiconductor material than competing modules. Can you talk more about your company’s commitment to responsible solar? Koralewski: Our vision of leading the world’s sustainable energy future is important to us. Sustainability has been at the heart of everything that we’ve done since the beginning. It’s not focused on meeting industry standards. It’s set on exceeding them and setting new ones for others to follow. We’re proud to produce solar technology that meaningfully supports the fight against climate change. And, we consider both the social and environmental impact of our operation, and we work hard to make people’s lives healthier now and in the future. Our thin-film modules have a carbon footprint that is two and a half times lower than crystalline silicon. Our modules are recyclable and actually boast a recovery rate of about 90 percent of its of its value, which includes the semiconductor, the glass, the capsule and several other materials. As a matter of fact, the new modules that we’re making today actually contain about 10 percent recycled semiconductor, which is unique to the photovoltaic industry today. Our approach to responsible solar continues to be a significant reputational differentiator in the solar manufacturing industry, not only from a sustainability aspect, but in the in the true meaning of responsibility. There are reports of forced labor in the crystalline silicon supply chain in Xinjiang, China. We do not support that. In May 2021, we joined the Responsible Business Alliance, the world’s largest industry coalition dedicated to supporting the rights and well-being of workers and communities in the global supply chain. We are the first of the world’s 10 largest solar manufacturers to join the alliance. So to us, sustainability not just a tag line; it’s actually the way that we conduct our business in every respect. ASSEMBLY: Last August, first solar broke ground on its third Ohio factory. Congratulations on that. How is the project going? Will you be doing anything differently with the new facility than you did with the first two? Koralewski: The factory is right on track. Its walls are up. Roof is installed. Equipment is starting to ship into the facility now. We’ll definitely be ready by the first half of 2023. This third factory will combine a highly skilled workforce and Industry 4.0 architecture, which includes machine to machine communication. We are eliminating human decisions and having our assets actually talk to each other. Artificial intelligence will control much of the manufacturing process. This will allow us to produce solar panels with a higher degree of automation, precision and continuous improvement. We’ll have a module coming off the line about every 3 seconds across our northwest Ohio footprint. That’s pretty phenomenal when you think about it. The manufacturing setup in the new factory is a game-changer, and it represents to us a significant evolution in solar manufacturing. For instance, if you go back to 2012, a typical solar factory in First Solar would have employed about 1,200 associates and it produced about 250 megawatts per year. The new factory in Ohio produces 3.3 gigawatts per year with 700 people. This level of advanced manufacturing is obviously great for the American worker, as well, because it allows us to focus on upskilling our associates. We are creating people who are capable of troubleshooting our process, rather than serving on the line, moving pieces and parts. ASSEMBLY: What role do people play in First Solar’s production lines? Koralewski: We believe in upskilling our people. It’s very important to us. We want our people to feel like they work in a high-tech environment that is safe and clean. We offer good wages and benefits, healthcare, tuition reimbursement, internal career progression, and wellness programs. We also partner with local community colleges, universities and vocational schools to train our people effectively to grow into these roles. As our technology advances, we want our people to advance as well. Editor’s note: This article is based on an interview we recorded for ASSEMBLY Audible. This podcast explores the people, processes and technologies for assembling parts into finished products. Whether you make large products in small volumes or small products in large volumes, our goal is to provide insights, ideas and inspiration you can put to work. To hear the latest ASSEMBLY Audible podcast, click here.","filter_flag":1}
{"title":"SCIO briefing on development of industry and information technology in 2022 - Official website of the State Council Information Office of China","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHA6Ly9lbmdsaXNoLnNjaW8uZ292LmNuL3ByZXNzcm9vbS9ub2RlXzkwMDA0OTIuaHRt0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHA6Ly9lbmdsaXNoLnNjaW8uZ292LmNuL3ByZXNzcm9vbS9ub2RlXzkwMDA0OTIuaHRt0gEA?oc=5","id":"CBMiNWh0dHA6Ly9lbmdsaXNoLnNjaW8uZ292LmNuL3ByZXNzcm9vbS9ub2RlXzkwMDA0OTIuaHRt0gEA","guidislink":false,"published":"Wed, 18 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=18, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=18, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHA6Ly9lbmdsaXNoLnNjaW8uZ292LmNuL3ByZXNzcm9vbS9ub2RlXzkwMDA0OTIuaHRt0gEA?oc=5\" target=\"_blank\">SCIO briefing on development of industry and information technology in 2022<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Official website of the State Council Information Office of China<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"SCIO briefing on development of industry and information technology in 2022 - Official website of the State Council Information Office of China","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHA6Ly9lbmdsaXNoLnNjaW8uZ292LmNuL3ByZXNzcm9vbS9ub2RlXzkwMDA0OTIuaHRt0gEA?oc=5\" target=\"_blank\">SCIO briefing on development of industry and information technology in 2022<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Official website of the State Council Information Office of China<\/font>","source.href":"http:\/\/english.scio.gov.cn","source.title":"Official website of the State Council Information Office of China","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Manufacturing\" \"new products\"+after:2023-01-01+before:2023-01-31","text":". Read in Chinese Speakers: Tian Yulong, chief engineer and spokesperson of the Ministry of Industry and Information Technology (MIIT) Zhao Zhiguo, spokesperson of the MIIT and director general of the Bureau of Information and Communications Administration of the MIIT Tao Qing, an official of the Bureau of Operation Monitoring and Coordination of the MIIT Chairperson: Xing Huina, deputy director general of the Press Bureau of the State Council Information Office (SCIO) and spokesperson of the SCIO Date: Jan. 18, 2023 Xing Huina: Friends from the media, good afternoon. Welcome to this press conference held by the State Council Information Office (SCIO). Today, we have invited Mr. Tian Yulong, chief engineer and spokesperson of the Ministry of Industry and Information Technology (MIIT). Mr. Tian will brief you on the development of the industry and information technology sector in 2022 and take your questions. We are also joined by Mr. Zhao Zhiguo, spokesperson of the MIIT and director general of the Bureau of Information and Communications Administration of the MIIT, and Ms. Tao Qing, an official of the Bureau of Operation Monitoring and Coordination of the MIIT. Now, I'll give the floor to Mr. Tian Yulong for a brief introduction. Tian Yulong: Ladies and gentlemen, friends from the media, good afternoon. As the new year begins and the Spring Festival approaches, I would like to take this opportunity to extend my best Chinese New Year wishes to you in advance and wish you happiness and good luck in the upcoming Year of Rabbit. I'd also like to thank you for your continued interest in and support for the development of the industry and information technology sector. Now, I'll brief you on the sector's general situation in 2022. The year 2022 was of crucial significance in history to both the Communist Party of China (CPC) and the nation. Under the strong leadership of the CPC Central Committee with Comrade Xi Jinping at its core, the MIIT, together with all localities and government departments, has thoroughly implemented the decisions and plans of the CPC Central Committee and the State Council. It has acted in full accordance with the key requirements of ensuring effective COVID-19 containment, economic stability, and development security. It has also proactively responded to the shocks of unexpected factors. As a result, China's industry and information technology sector achieved generally stable growth while making further progress. Specifically, the industrial economy has resumed steady growth with a promising outlook; the information and communications technology (ICT) industry has posted a stable growth; and the industrial and supply chains has achieved unimpeded and stable operations. In addition, the industrial sector's contributions to the national economy have further increased; the nation's industrial development has shown greater resilience; and the specialized development of small- and medium-sized enterprises (SMEs) has been further accelerated. In general, the sector has the following four highlights. First, the industrial economy has resumed its steady growth with a promising outlook, and its role as an anchor of the macro economy has become even more evident. Ensuring stable growth was high on the agenda last year. Given this, we took multiple measures to expand investment, boost spending, and stabilize foreign trade, and our efforts to ensure the unimpeded and stable operations of industrial and supply chains have paid off. In 2022, China's added value of industries above the designated size grew by 3.6% year on year, and that of the manufacturing industry increased 3% year on year. Investment in the manufacturing sector climbed 9.1% from a year earlier, and the export delivery value of industrial enterprises above the designated size rose 5.5% year on year. The industrial economy provided a strong support for stabilizing the macro economy. The industrial sector contributed to 36% of the nation's economic growth, a relatively high level compared to recent years. The industrial sector lifted the nation's economic growth by 1.1 percentage points, which included a boost of 0.8 percentage points from the manufacturing industry. The added value of the manufacturing industry accounted for 27.7% of the nation's gross domestic product (GDP), up 0.2 percentage points over the previous year. Second, industrial restructuring, transformation, and upgrading have been thoroughly advanced, and industrial development has shown greater resilience. We have continued regarding high-quality development as our top priority and strived to promote industrial restructuring, transformation, and upgrading. As a result, the manufacturing sector has become higher-end, smarter, and more eco-friendly at an accelerated pace. A number of sci-tech innovation achievements have been made. For example, China's first self-developed C919 large passenger aircraft was delivered at the end of last year. Breakthroughs were also made in the whole machine and key spare parts of China's self-developed extracorporeal membrane oxygenation (ECMO), which has been certified for marketing and put into use. A total 45 national-level advanced manufacturing clusters and another 100 SME clusters for distinctive local business were developed. The industrial internet has been used in 45 major categories of the national economy, and there has been more than 240 influential industrial internet platforms, injecting new impetus to industrial upgrading. Steady progress has been made in the eco-friendly and low-carbon transformation of industries. In the first 11 months of 2022, the energy consumption per unit of added value of industries above the designated size dropped 1.4% year on year. The added value of high-tech manufacturing industry grew by 7.4% year on year in 2022, 4.4 percentage points higher than the growth rate of the added value of the manufacturing sector as a whole. The production of new products maintained a high growth rate. In particular, the production of new energy vehicles has been ranking first globally for eight consecutive years, and their production and sales grew by 96.9% and 93.4% year on year, respectively. This speaks volumes for the resilience and stability of industrial development. Third, the ICT industry posted a stable and continuous growth, and industrial integration further enabled the sector's development. We continued leveraging the leading role of new-generation information technologies, and ramped up efforts to develop new business forms and tech applications. In 2022, the revenue of China's telecommunication sector grew by 8%. Investment in the sector continued to expand, and infrastructure kept improving. China built 887,000 new 5G base stations in 2022, and the total number amounted to 2.312 million, accounting for over 60% of the global total. Among Chinese cities, 110 have reached the standard of building 1000M fiber optic networks. The number of mobile Internet of things (IoT) connections in China reached 1.84 billion, making China the first among major economies to have more IoT connections than internet users. The number of 5G users reached 561 million, accounting for one-third of all mobile phone users, 2.75 times that of the global average. Integration of tech applications were further accelerated. More than 50,000 5G applications have enabled multiple sectors such as industries and healthcare services. The management of mobile applications saw further progress in 2022, and users' rights and interests were effectively safeguarded. More efforts were made to strengthen the protection of critical information infrastructure and improve data security management in industry and information technology sector at an accelerated pace. The capacity to ensure emergency communications continued to strengthen, and the nation's basic telecommunication networks maintained their safe and stable operations. The ICT industry has effectively supported and guaranteed economic and social development and the construction of the digital economy. Fourth, policy planning continued to take effect, which further boosted business confidence. We earnestly implemented the decisions and plans of the CPC Central Committee and the State Council, kept policy planning as our main focus in order to stabilize growth, and continued to unleash policy dividend and boost business confidence. We scaled up the efforts to carry out the policy package on stabilizing economy and its follow-up measures. We also worked with relevant government bodies to introduce a series of policy documents on further boosting the industrial economy and providing assistance to SMEs. We organized and rolled out 27 plans in the industry and information technology sector for the 14th Five-Year Plan period (2021-2025), in a bid to ensure the coordination and implementation of key industries, projects, and programs. The driving force of these policies and plans has translated into a strong momentum to restore the industrial economy and boosted business confidence and expectations. In 2022, China's tax and fee cuts, tax refunds, and tax and fee deferrals for all types of market entities topped 4 trillion yuan, about 40% of which were offered for micro and small businesses. This has created a solid guarantee to ease the difficulties of SMEs and enable their sound and stable development. In 2023, the development of the industry and information technology sector still faces a severe and complicated domestic and overseas environment. In particular, the sector's stable operations in the first quarter requires arduous efforts. We believe that, with the optimization of COVID-19 response and the effect of both existing and new policies, we have the confidence, resolve, and ability to cope with various difficulties and challenges. Looking forward, we will fully carry out the guiding principles of 20th CPC National Congress and the decisions and plans of the Central Economic Work Conference. We will keep ensuring stable growth high on the agenda and strive to expand demand, foster market circulation, assist businesses, strengthen growth momentum, and stabilize expectations. We will see to it that the industry and information technology sector achieve new progress, expedite the development of new industrialization, and make new and greater contributions to building a modern socialist country in all respects. That concludes my introduction. Next, my colleagues and I will take your questions. Thank you. Xing Huina: The floor is now open for questions. Please indicate the media organization you work for before raising questions. _ueditor_page_break_tag_ Yi Cai: In recent years, the new energy vehicle industry has maintained rapid development. Can you talk about the development of this industry in 2022? What measures will be adopted by the MIIT to promote its high-quality development? Thank you! Tian Yulong: Thank you. I will answer your questions. The new energy vehicle industry is a major direction for the transformation and upgrading of the global automobile industry. This industry has been developing rapidly in all countries. And it is also an important option for emission reduction. Last year was another bumper year for the development of the new energy vehicle industry, mainly reflected in the following aspects. First, China has been leading the world in market size. In 2022, a total of 7.058 million new energy vehicles were produced, and 6.887 million were sold, with a year-on-year increase of 96.9% and 93.4%, respectively, ranking top globally for eight consecutive years. The sales of new energy vehicles accounted for 25.6% of the total sales of new vehicles. The data is promising, and the industry shows a strong momentum for development. Second, new breakthroughs have been made in key technologies. The energy density of mass-produced power batteries stood at 300 watt-hours per kilo, reaching an advanced level globally. The gravimetric specific power of the driving motor surpassed 4.8 kWh per kilo, with the highest rotational speed reaching 16,000 rpm. These indicators show that great improvement has been achieved in key components and parts. In particular, breakthroughs have been made in technologies concerning laser radar, AI chips, and intelligent cabins, reaching an advanced global level. Third, brand competitiveness has markedly improved. In 2022, sales of Chinese-brand new energy passenger vehicles took up 79.9% of the total sales in the domestic market, up 5.4% year on year. The new energy vehicle exports reached 679,000, a 1.2-fold increase over the previous year. Among the global top 10 enterprises in terms of sales of new energy vehicles, three are Chinese enterprises. Among the global top 10 enterprises in terms of installed capacity of power batteries, six are Chinese. The competitiveness and brand impact have been increasingly stronger. Fourth, supporting facilities have been increasingly optimized. As of the end of 2022, a total of 5.21 million charging plies and 1,973 battery charging stations have been established. 2.593 million charging piles and 675 battery charging stations were added in 2022. The construction of battery charging and swapping facilities has been notably accelerated. At the same time, over 10,000 service outlets for recycling power batteries have been built, basically ensuring that people can access battery recycling services close to home. Currently, China's new energy vehicle industry has entered a period of market expansion across the board and maintained rapid growth. Next, we will strengthen our work in the following aspects. First, stronger policy support will be provided. We will work with relevant departments to establish a coordination mechanism for developing this industry and strengthen coordination and synergy between central and local governments. In particular, we will promote the implementation of supporting policies concerning vehicle purchase tax, vehicle and vessel tax, license plates, and others. We will formulate a roadmap for green development of the automobile industry, revise and issue \"double credits\" management provisions for corporate average fuel consumption and new-energy vehicles, and launch trials for the market access of intelligent connected vehicles. Second, steady performance will be ensured. We will conduct research on formulating follow-up supporting policies for the new energy vehicle industry. We will promote the application of battery-charging facilities and the development of fuel-cell vehicles. In particular, we will launch pilot programs in establishing pioneering zones for comprehensive electrification of vehicles in public areas in cities. Further steps will be taken to promote quality brands, and to maintain consumer market stability. Third, integrated innovation will be supported. We will give full play to the role of leading enterprises and national manufacturing innovation centers and promote small, medium, and large enterprises to pursue development through greater synergy. We will accelerate research and industrial development of new technologies, including new types of batteries, automotive-grade chips, and automotive operating systems, advance integrated development of autonomous driving vehicles and the cooperative vehicle infrastructure system, and enhance the integrated and innovation-driven development of the new energy vehicle industry and sectors such as energy, transportation, and ICT. Fourth, the development environment will be optimized. We will carry out strict management of production access and provide stronger guidance for investment to avoid low-level and redundant construction. Development and distribution of domestic and overseas resources will be carried out in a coordinated way to ensure the supply of raw materials and key parts. Regulations on recycling power batteries will be formulated at a faster pace to improve the system for recycling power batteries. Greater efforts will be taken to advance the construction of charging piles, and their accessibility will be improved to provide sound facilities and environment for the development of new energy vehicles. Thank you! _ueditor_page_break_tag_ China Electronics News: The industrial internet plays a crucial role in promoting deep integration of the digital economy and the real economy, and it has been producing positive effects on advancing the transformation and upgrading of traditional industries. What new progress was made regarding China's industrial internet in 2022? What will be done to advance wider application of the industrial internet? Thank you. Zhao Zhiguo: Thank you for your questions. In 2022, we resolutely implemented the decisions and plans of the CPC Central Committee and the State Council, sped up the development of the industrial internet, with the total output value of this industry estimated to be 1.2 trillion yuan, providing strong support for high-quality economic and social development. First, an analysis system for industrial internet identification has been fully established. Five national top-level nodes covering the eastern, western, southern, northern, and central regions and two nodes for disaster tolerance and backup have been put into use. Second-level nodes have fully covered 31 provinces (autonomous regions, municipalities) and provided services for nearly 240,000 enterprises. Over 240 influential industrial internet platforms have been developed, with 28 cross-industry and cross-sector platforms, effectively promoting data sharing and resource coordination among the whole process of product development, all links of production, and upstream and downstream supply chains, and accelerating digital transformation of enterprises. Second, the \"5G+Industrial Internet\" 512 Project has been accomplished successfully. Five public service platforms for the industry have been built, providing services for industrial enterprises in their application of 5G technologies. Over 4,000 projects have been launched in more than 10 key industries, including automobile and mining industries. The application of 20 typical application scenarios such as coordinated research, development and design, and the remote control of equipment have been promoted at a faster pace, effectively promoting enterprises to improve quality, reduce costs, and increase efficiency. The integration of the industrial internet and 5G has produced an increasing variety of products. The price of modules has dropped by 80% from the early stages for commercial use. Waves of constructing 5G connected factories have swept across the country, advancing the application of 5G technologies to the core links of production. Third, multiple measures have been adopted to empower the transformation of the industry. Based on the common needs of the industry, we have developed a batch of carriers to serve the promotion of the application of the industrial internet and foster low-cost and lightweight solutions, lowering the thresholds for enterprises, especially SMEs, to carry out digital transformation. Focusing on the characteristics of various industries, we have formulated and promoted the guidance for integration and application of the industrial internet for over 10 key industries, such as the steel industry and the electronic industry, guiding the industries and enterprises to apply the industrial internet in accordance with the conditions specific to their industries and enterprises. Addressing weak links, we have implemented innovative projects for the industrial internet development, advanced research and industrialization of key technologies and products, and issued a series of national standards, industrial, and group standards, furthering improving the system of standards. Next, our work will focus on three aspects to accelerate the large-scale development of the industrial internet, promote deep integration of the digital economy and real economy, keep unleashing momentum for industrial upgrading, and support the industrial economy to steadily rebound. First, we will optimize the environment by enhancing policy guidance. We will, together with other government departments and local authorities, take solid steps to advance the implementation of a three-year action plan (2021-2023) for the innovative development of the industrial internet to ensure that all work will be accomplished. We will formulate policies and measures to promote the large-scale development of the industrial internet, further improve the top-level design, make good and full use of fiscal, tax, and financial policies, and strengthen cooperation between industry and finance and integration between industry and academia to further create a sound development environment. Second, we will create more drivers for development by promoting innovation. We will enhance technological innovation and continue to implement innovative projects for industrial internet development, strive to make major breakthroughs in technologies, and improve the system of standards to remove the major obstacles hindering the large-scale development of the industrial internet. We will deepen industrial innovation, support all kinds of market entities such as telecommunication enterprises, internet platform companies, and industrial enterprises to leverage their strengths and create greater synergy. We will make great efforts to nurture leading enterprises and specialized and sophisticated SMEs that produce new and unique products, and strengthen the industry alliance for the industrial internet to create a healthy and sustainable environment for the industry. Third, we will push for wider application by accelerating the promotion and popularization of the industrial internet. We will move faster to foster advanced factories, and encourage enterprises to carry out the digital transformation of factories by means of 5G and other technologies to promote wider applications of new technologies, new scenarios, and new models. We will accelerate upgrading clusters of industries, launch the campaign to promote the application of the industrial internet in 1,000 industrial parks of 100 cities and summarize and promote successful cases to advance digitalization and green development of industrial parks. We will expand the application of the industrial internet in key sectors and in key industrial chains, and widely promote supply-demand matching to promote high-quality development of the real economy by large-scale application of the industrial internet. Thank you! _ueditor_page_break_tag_ CCTV: The report to the 20th CPC National Congress has underlined that the resilience and security of China's industrial and supply chains will be improved. What has been done by the MIIT to enhance the resilience, security, and competitiveness of industrial and supply chains? What measures will be adopted next? Thank you. Tian Yulong: Thank you. We will have Mr. Tao Qing answer your questions. Tao Qing: Thank you for your questions. Since the beginning of 2022, the MIIT has resolutely implemented the decisions and plans of the CPC Central Committee and the State Council, taken it as a top priority of its work to maintain security and stability in industrial and supply chains and worked with relevant departments to effectively respond to the impact of unexpected factors. With all these efforts, the overall security and stability of the manufacturing industry in China have been maintained, and the resilience of China's industrial and supply chains has been further enhanced. First, we have given equal emphasis to short-term response and long-term prevention and made every effort to ensure smooth circulation of industrial and supply chains to consolidate the foundation for ensuring stability. Especially when responding to the impact of the pandemic in April last year, we rapidly established a white list system for enterprises in key industrial and supply chains and promoted work and production resumption along industrial chains in a coordinated and systematic way. We have built up coordination platforms for key industrial and supply chains such as integrated circuits, automobiles, and medical supplies, established a \"red light\" early warning mechanism for auto parts inventory, and a \"red, yellow, and blue\" early warning coordination mechanism for bulk raw material supply, and helped to resolve problems that concerned enterprises one by one to ensure stability in key industrial chains. Meanwhile, we have comprehensively summarized the experience, guided local authorities to strengthen early warning and monitoring of emergencies, and set up contingency plans in advance to resist risks to reinforce the ability to withstand risks. Second, we have worked to shore up weak links and build up strengths at the same time and adopted a package of steps to strengthen the core competitiveness of the industrial and supply chains. We have held International Forum on Resilient and Stable Industrial and Supply Chains. General Secretary Xi Jinping has sent a congratulatory letter to the forum. During the forum, we, together with Indonesia, and five other countries, have jointly released the Initiative of International Cooperation on Resilient and Stable Industrial and Supply Chains. Focusing on the blockages in industrial and supply chains, we have launched projects to achieve breakthroughs in core technologies in key fields and projects for upgrading foundational industrial infrastructure to promote breakthroughs in important basic products and core technologies in key fields. We have given play to the guiding role of plans in promoting traditional competitive industries and emerging industries to break growth bottlenecks. We have fostered clusters of advanced manufacturing, with global competitive edges in some areas taking shape. We have promoted the development of specialized and sophisticated SMEs that could produce novel and unique products and given play to the leading role of competitive enterprises to boost the dynamism of the manufacturing industry. Next, we will keep putting equal emphasis on development and security, give priority to major tasks of shoring up weak links, building up strengths, consolidating foundations, and fostering clusters of industries, and accelerate the upgrading of the industrial base and modernization of industrial chains. Our work will mainly focus on the following three aspects. First, we will cement foundations and move faster to shore up weak links. We will implement projects for upgrading foundational industrial infrastructure and projects to achieve breakthroughs in core technologies in key fields to build a more self-supporting, safer, and more reliable industrial system with their risks better controlled. We will encourage leading enterprises in industrial chains to strengthen cooperation with upstream and downstream SMEs on technology research, production verification, and standards setting to enhance collaborative innovation and integrated development of industrial chains. Second, we will consolidate the advantages and create new growth drivers. We will take active steps to reinforce advantages in key advantageous areas, enhance the competitiveness of traditional industries, and accelerate the deep integration of the new generation information technology and the manufacturing industry. We will work hard to develop the digital economy, seize new strategic opportunities, accelerate the development of new technologies, new forms and new models, and promote the development of advanced manufacturing clusters. Third, we will guard against risks and ensure stable and smooth industrial and supply chains. We will improve the ability to identify and cope with risks, strengthen the monitoring of key areas and key industries, and strengthen synergies between departments and regions to enhance the ability to cope effectively with risks in a coordinated way. We will expedite the implementation of policies on benefiting enterprises and keeping business operations stable, and guarantee the supply of industrial production factors to ensure normal production and operations of enterprises to the maximum possible extent. Thank you! ThePaper.cn: Recently, the demand for medicine and medical devices such as antipyretic and analgesic drugs and oxygen concentrators has increased. What is the current production and supply situation of medicine and medical devices? What's the MIIT's judgment about the next stage of their production and supply? Thank you. Tian Yulong: Thank you for your questions. Recently, the MIIT has implemented the decisions and deployments of the CPC Central Committee and the State Council in conjunction with relevant departments. Under the direct command of the joint COVID-19 prevention and control mechanism, the MIIT, leading this mechanism's medical supply support group, has further guaranteed access to medical supplies together with group member departments and relevant localities. We have also made every effort to help pharmaceutical and medical enterprises fulfill their production goals as well as stabilize and expand production and capacity. We have increased the supply of key drugs in the market and guided their reasonable, orderly, and precise distribution. The current characteristics are as follows: First, we have made every effort to ensure the production and supply of key medical materials. In terms of drugs, as of Jan. 17, on the basis of maintaining a production capacity of 200 million tablets for 17 consecutive days, 5.14 billion tablets of two key antipyretic and analgesic drugs - ibuprofen and acetaminophen - have been supplied, which can fully meet the medicine demand. In terms of medical equipment and devices, as signs of higher demand for medical resources for severe case treatment emerge, the MIIT recently focused its work on \"preventing severe cases and ensuring equipment supply\" in a timely manner. As of Jan. 17, the daily output of Azvudine, a small-molecule antiviral drug, has increased by 148% to 744,000 bottles compared with before New Year's Day. Daily output and production capacity have been greatly improved, which can meet the medicinal needs of medical institutions for patients with severe conditions as well as subsequent severe cases. Currently, thanks to a rising scale in production, the daily output of invasive ventilators has increased by 239% to 1,808 units compared with that before New Year's Day. The daily output of oxygen concentrators has increased by 280% in four days, and the maximum daily output can exceed 20,000 units. The supply of oxygen concentrators has been able to meet the basic needs of medical institutions. The daily output of much-needed finger pulse oximeters has exceeded 460,000 units, which can not only meet the needs of medical institutions but can also gradually and sufficiently supply society's needs. Second, we have conducted precise distribution to prioritize needs in key areas. We share people's concerns. In accordance with the principle of \"focusing on key areas and providing targeted distribution,\" we have worked with relevant departments to actively align with the departments in charge of civil affairs, rural affairs, education, among others and provided targeted medical supplies for key areas (populations), such as in elderly care, rural areas, and schools. Since mid-December last year, we have delivered nearly 136 million doses of drugs through large e-commerce platforms and local drug support platforms, benefiting more than 60 million people in total. Thanks to the convenience and accessibility of e-commerce, we have created a precise distribution model. At the same time, we have equipped every rural clinic with two finger pulse oximeters and supplied 1.172 million finger pulse oximeters in four batches so as to bring finger pulse oximeters to rural areas. Meanwhile, through various financial drives, including corporate donations, more than 10,000 medical oxygen concentrators have been provided free of charge for more than 800 counties lifted out of poverty across the country, fully covering 10,000-plus towns and townships in these counties. We have fully met the needs of key medical supplies for old-age care and child welfare institutions nationwide, as proposed by the civil affairs departments. Currently, we are working with education departments to ensure that the needs of universities for key medical supplies nationwide are satisfied. Third, we have smoothed the supply channels of medical supplies through various cooperations. We have worked with the transport and postal departments to prioritize delivering urgently-needed medical materials at the community level, especially in rural and remote areas, and spared no effort to link up the \"last kilometer\" of delivery. We have also formulated a plan to guarantee smooth logistics of enterprises during the Spring Festival and strived to ensure transport and reserve capacities during the Spring Festival and other holidays. Next, the MIIT will continue to further support the stable production of key medical material enterprises, strengthen supplies, targeted coordinated distribution, and never reduce its efforts in ensuring supplies. Thank you! _ueditor_page_break_tag_ CGTN: As we all know, China has been adhering to the path of green development. Especially since the carbon peak and carbon neutrality goals were put forward, a green and low-carbon transformation has been further accelerated across society. What are the future considerations of the MIIT regarding energy saving, carbon reduction, and green transformation in the industrial sector? Thank you. Tian Yulong: Thank you, and I'll give the floor to Ms. Tao Qing for this question. Tao Qing: Thank you for your question. Industry is the backbone of the national economy and its engine of growth. It is also an important battlefield for promoting green development transformation. The MIIT has thoroughly implemented the guiding principles of the 20th CPC National Congress and earnestly promoted a green and low-carbon transformation of the manufacturing industry. First, the action plan for peaking industrial carbon emissions has been carried out in an orderly manner. Together with the National Development and Reform Commission and the Ministry of Ecology and Environment, we have issued an implementation plan for carbon peak in the industrial sector and coordinated in mapping out a timetable and a roadmap for peaking industrial carbon emissions. Second, solid progress has been made in industrial green transformation and development. We have thoroughly implemented the plan for the green development of China's industrial sectors during the 14th Five-Year Plan period (2021-2025), introduced and implemented a package of schemes and action plans for improving energy and water efficiency, as well as comprehensive utilization of resources, and formulated the measures for supervision and inspection on industrial energy conservation. We have organized energy conservation monitoring on 3,572 key enterprises, and provided diagnostic services for 124 key enterprises and 1,187 specialized and sophisticated SMEs that produce new and unique products. Third, green and low-carbon models have been cultivated and expanded. A number of national green factories, green industrial parks, and green supply chain enterprises have been selected. In addition, 99 green design demonstration enterprises, 282 enterprises meeting the industrial standards and conditions, and 32 pilot enterprises (parks) recycling industrial wastewater have been cultivated. Fourth, the popularization and application of green and low-carbon technologies have been accelerated. Efforts have been intensified to popularize and apply advanced techniques, technologies, and equipment for energy and water-saving plans, cleaning and environmental protection, and comprehensive utilization of resources. Various supply-demand matching and technical training exchanges have been held online and offline. Next, the MIIT will earnestly implement the guiding principles of the 20th CPC National Congress and the Central Economic Work Conference, take the carbon peak and carbon neutrality goals as the leading principles, take promoting green and high-quality development of the manufacturing industry as its own responsibility, and advance carbon and pollution reduction, green expansion, and growth in a coordinated manner so that green development can become the defining feature of the new type of industrialization. First, we will accelerate the green and low-carbon transformation of the manufacturing industry. We will formulate and introduce the Guidelines for Accelerating the Green and High-Quality Development of the Manufacturing Industry, clarify the implementation measures, give differentiated guidance, and implement industry-specific policies, as well as promote the green and low-carbon development transformation of key industries, parks, enterprises, and localities in an integrated manner. Second, we will conduct special actions for industrial energy conservation and carbon reduction. We will fully implement the carbon peak plans in the industry and key sectors. We will continue to monitor national energy conservation, and carry out in-depth activities providing industrial energy conservation diagnostic services and energy conservation services to enterprises. We will launch a number of pilot projects, including developing industrial green microgrids and digital carbon management systems. Third, we will advance green manufacturing. On the basis of building green factories, we will accelerate the construction of the green manufacturing system and improve the evaluation index system in accordance with the new goals of achieving carbon peak and carbon neutrality. Fourth, we will promote improving quality and efficiency in the comprehensive utilization of resources. We will carry out projects to optimize battery recycling and utilization and improve the recycling and utilization system. We will strengthen the standardized management of comprehensive utilization industries of renewable resources such as scrap steel and waste paper, promote the pilot implementation of extended producer responsibility for automobile products, and improve our ability to utilize complex and hard-to-use solid waste and emerging solid waste. We will update and publish the catalog of advanced and applicable technologies for the comprehensive utilization of industrial resources. Fifth, we will strive to improve the level of clean industrial production. We will coordinate and promote green and high-quality development in the Beijing-Tianjin-Hebei region, along the Yangtze Economic Belt, and other areas. In particular, we will focus on steel, petrochemical, chemical, and other key water-using industries to carry out pilot recycling projects for industrial wastewater. Sixth, we will foster new drivers of green growth. We will vigorously develop green and environmental protection industries and cultivate key enterprises with advantages. We will improve the mechanism for promoting green transformation and guide fiscal and financial resources to increase support for the green development of the manufacturing industry. Thank you! _ueditor_page_break_tag_ Economic Daily: As we know, the monthly data of value added of industrial enterprises above the designated size fluctuated markedly last year. How to evaluate the industrial performance for the whole year? Will the trend of recovery continue this year? Thanks. Tian Yulong: Thanks for your questions. As I said in my opening remarks, the industrial economy in 2022 faced a relatively severe and complex environment both at home and abroad, and was under great pressure to ensure steady growth. Over the past year, under the support from all regions and departments, the MIIT put steady growth as its top priority, adopted a series of measures to achieve recovery of the industrial economy in a short time, and maintained sound momentum, demonstrating the \"ballast\" role of the industrial economy in the macroeconomic performance, as well as contributing China's share in stabilizing the global industrial and supply chains and in promoting the recovery of world economy. Overall, the value added of industrial enterprises above the designated size grew 3.6% year on year in 2022. The first quarter got off to a good start with a sound momentum, while it fell sharply in April and began to stabilize and rally again in May. This fluctuation was relatively large. In the fourth quarter, the downward pressure increased because of the pandemic. But on the whole, the positive trend of stability has remained unchanged. In terms of industries, key industries generally performed stably. In particular, the equipment manufacturing industry registered fast growth. In 2022, the value added of this sector grew 5.6%, contributing 50.3% to the overall industrial growth. Among them, a representative sector, including electric machinery as well as instruments and meters, increased by 11.9% and 4.6%, respectively. The automobile industrial and supply chains were fully restored, with annual production and sales rising by 3.4% and 2.1%, respectively, in 2022. Generally, the driving power of the equipment manufacturing sector was very strong. Raw material for manufacturing was growing despite of the pressure. In 2022, the value added of the sector rose 1.6% year on year, with the first three quarters running at a low level, and the growth accelerated since September. The consumer goods manufacturing gradually recovered. In 2022, the value added of the sector grew 0.6% year on year. Daily necessities industry such as food, agricultural and non-staple food, wine, beverage, and refined tea maintained certain growth. In terms of key products, products of new energy and new drivers of growth grew rapidly, and daily necessities rose steadily. The production and sales of new energy vehicles reached 7.058 million and 6.887 million, up 96.9% and 93.4% year on year, respectively, while the output of charging piles and solar panels soared by 80.3% and 47.8% year on year, respectively. New material products grew at a high level - the production of polysilicon and monocrystalline silicon, for example, grew rapidly, reaching 64.4% and 51.8%. High-tech products also posted rapid growth, with the output of mobile communication base station equipment as well as the industrial control computers and systems increasing by 16.3% and15.0% respectively. We have guided enterprises to focus on the needs of the people and increased the production and processing of related products to effectively meet consumer needs. The output of flash frozen food and dairy products rose 3.3% and 2.0%, respectively, and the woolen fabrics up 4.7%. In terms of regions, most provinces saw their industrial economy recovering steadily. Last year, 24 of the 31 provinces, autonomous regions and municipalities directly under the central government logged growth to value added to industry. Among them, major industrial provinces such as Jiangsu, Shandong, Zhejiang, Henan, Fujian, Sichuan, Hubei, Hunan, and Hebei posted higher growth rates than the national level. The growth rate of major economic indicators in the central and western regions took the leading position. Last year, the value added of industry of these regions increased by 6.8% and 6.2%, respectively; while the eastern region raised 3.0% year on year, showing steady signs of recovery. In 2023, the external environment remains complex, and the development of the industrial sector is still under great pressure. However, in general, the growth trend and pattern remain unchanged, and the economic fundamentals that will sustain long-term growth have been stabilized and consolidated. We believe that with the effective release of the vitality of market entities, the potential of consumer consumption, and the impetus for industrial upgrading, the steady recovery of the industrial economy will keep unchanged so as to provide stronger support for the macroeconomy. That's all for me. Thanks! _ueditor_page_break_tag_ Southern Metropolis Daily: We noticed that the MIIT recently solicited public opinion on further improving the service capacity of mobile internet applications, aiming to optimize the services and enhance user experience. What achievements has the MIIT made in promoting ICT serving people's livelihoods in the past year? What's the next plan? Thanks. Zhao Zhiguo: Thank you for your question. The MIIT attaches great importance to the protection of users' rights and interests and personal information, and continues to improve the ICT capacity and services so as to effectively protect the legitimate rights and interests of users. First, the quality of services has been improved, and user perception has been refined constantly. We launched campaigns to improve service perception and guided information and communications enterprises to provide quality services. We optimized the business handling process, realized online and remote telecommunication services such as plans change, contract cancellation, and other common services; promoted 100 key internet enterprises to establish customer service hotlines with real person responding to users' demands timely; prompted app stores to improve their review mechanism before launching an app. By the end of last year, the number of various high-quality apps in use exceeded 2.58 million in China, and intelligent applications have enriched people's production and life. Second, we have improved the accessibility of convenient digital services. More solid outcomes have been delivered and shared by all. We have continued to expand the coverage of the internet, further promoted universal telecom services, supported rural and remote areas to speed up the coverage of the internet, and worked hard to realize broadband connection in all administrative villages nationwide for the first time in history. We have also adopted targeted fee cut measures like preferential policies for special groups such as micro-, small- and medium-sized enterprises (MSMEs), poor households, the elderly, and the disabled. As a result, the average rates for broadband and dedicated internet access services for MSMEs have dropped by 24.2% and 21.9%, respectively, as compared with those in December 2021. More than 32 million households of seniors and disabled people have benefited from the measures, doubling the number in 2021. By doing so, users are increasingly feeling the benefit. We have steadily improved telecom services for the convenience of senior citizens by facilitating usage and improving service quality. Enterprises have been encouraged to provide elderly users with telecom services that can be handled remotely and to resolve technical difficulties for them. A total of 648 websites and apps have finished such improvements. Third, we have improved oversight effectiveness. Protection of users' rights and interests has been strengthened. We have enhanced management at the source, urged and guided app stores and other distribution platforms to fully harness the role of \"goalkeepers,\" so that apps are reviewed and hit the shelves in accordance with laws and regulations. In 2022, we conducted tests on 1.51 million apps in six batches, achieving a much higher percentage of passing than in 2021. We have built a strong technology shield and established an anti-fraud platform in the ICT industry. Since 2022, we have intercepted a total of 1.82 billion scam phone calls. Cyber security and protection have been increasingly strengthened. We have improved the governance model, curbed spamming on an ongoing basis, intensified administrative guidance, and made regulatory bodies get involved at earlier stages. By doing so, complaints from users dropped to the lowest level in history. ICT services concern the interests of hundreds of millions of users. Providing high-quality services is an important part in pursuing a people-centered development philosophy. Next, we will focus on our work in three aspects. First, we will enhance policy guidance to foster an enabling environment for the industry. We will take action to increase the service capacity of mobile applications so that both service supply and user experience will be improved. We will also build a public service platform involving mobile applications to efficiently support the regulation and development of the industry. In addition, we will develop sound systems to coordinate our work, strengthen the self-discipline of the telecom industry, and create an enabling environment for its healthy and orderly development. Second, we will focus on key problems to address the concerns and aspirations of the people, such as personal information protection and telecom and internet fraud. We will strengthen the regulation of apps at all stages for all entities, urge app stores, terminals, and other key links to fulfill their primary responsibility, and realize joint prevention and governance throughout the industrial chain. We will also accelerate the establishment of a united resource database for the industry to combat fraud, and step up efforts to promote the service that enables citizens to inquire about all mobile phone cards registered under their own ID numbers. Integrated protection capacity will be enhanced, and a sound environment for information consumption will be jointly fostered. Third, we will step up efforts to improve our capacity to benefit the public and provide more convenient services. We will advance online and cross-regional handling of telecom services, carry out consumer satisfaction measurement of key internet services, speed up the improvement of websites and apps with local features, and provide more comprehensive, considerate, and satisfactory ICT services. Thank you. Shangyou News: Rapid development of the green energy equipment industry is one of the important areas of forging new industrial competitive strengths of green and low-carbon industries. How did the situation of the green energy equipment industry develop in 2022? What new measures will be taken next to further boost the industry? Thank you. Tao Qing: Thank you for your questions. To develop the green energy equipment industry is an important measure to promote green and low-carbon development and achieve our carbon peak and neutrality targets. In recent years, the MIIT has worked with relevant departments to issue and implement an action plan to improve energy efficiency in industries, making a big push to develop the green energy equipment industry. First, we have accelerated the promotion of high-efficiency and energy-saving equipment. We issued a catalog of selected and recommended energy-saving technologies and equipment in the field of industry and information technologies. Also, we moved faster to promote 133 pieces of energy-saving equipment, including high-efficiency electric motors, transformers, compressors, and draught fans. Second, we have built up manufacturing capability and competitive production capacity in the whole industrial chain of renewable energy, including wind and photovoltaic power and lithium-ion batteries. At the end of 2022, China led the world with the photoelectric conversion efficiency of self-developed silicon heterojunction cells. The output of wind power generators in China accounted for two-thirds of the world's total. The single-unit capacity continued to grow, with the capacity of the latest developed onshore wind power generator exceeding 6 MW. In 2022, the newly installed capacity of wind and photovoltaic power reached more than 120 million kW, and their cumulative installed capacity exceeded 700 million kW, driving the installed capacity of renewable energy to exceed 1.2 billion kW. Next, we will stick to our carbon peak and neutrality targets, implement the plan to improve the energy efficiency of electric motors and transformers, organize the compiling of the energy-saving technologies and equipment catalogs in the field of industry and information technologies, and hold a series of themed events at enterprises to promote energy conservation service. By speeding up the development of the green energy equipment industry and e-energy industry in the field of wind, solar, and hydroelectric power, hydrogen energy, and energy storage, we will push green and low-carbon development to a new level and make a positive contribution to the green transition in all respects of economic and social development. Thank you. _ueditor_page_break_tag_ People's Post and Telecommunications News: We have seen that the ICT sector achieved steady and rapid growth in 2022. What are the main achievements? What other work considerations are there for this year? Thank you. Zhao Zhiguo: Thank you for your question. In 2022, the MIIT conscientiously implemented the decisions and plans of the CPC Central Committee and the State Council, made stability our top priority, and pursued progress while ensuring stability, promoting the high-quality development of the ICT sector to achieve new results with a strong sense of responsibility and mission. The first achievement is that we have created new highlights, and the scale of the ICT industry has continued to grow. The annual telecommunications services revenue was 1.58 trillion yuan, a year-on-year increase of 8%, injecting impetus into economic growth empowerment and boosting market confidence. We continuously optimized the industry structure, with the revenue of emerging businesses such as internet data centers, cloud computing, and the Internet of Things increasing by 32.4% year on year, driving the growth of telecommunications services revenue by 5.1 percentage points and becoming an important growth pole of the telecommunications services. The effective investment was steadily expanded. The investment in telecommunications fixed assets for the year reached 419.3 billion yuan, a year-on-year increase of 3.3%, and the growth rate of investment remained stable. Consumption vitality was effectively stimulated, mobile internet traffic increased by 18.1% year on year, and national online retail sales reached 13.8 trillion yuan, a year-on-year increase of 4%, driving both the quantity and quality of information consumption to increase. The second achievement is that we have consolidated the new base, and the infrastructure construction has achieved remarkable results. We worked in coordination to promote the \"Double Gigabit\" networks construction, and a total of 2.312 million 5G base stations have been built and the gigabit optical networks have been expanded to be able to cover more than 500 million households, realizing \"every city is covered by the gigabit optical network\" and \"every county can access 5G services.\" We coordinated the layout of data and computing power facilities, with the total number of data center racks in use across the country now exceeding 6.5 million standard racks and the average annual growth rate of the total computing power exceeding 25% in the past five years. We continued to optimize internet network architecture, added five national-level internet backbone direct connection points, increased the interconnection bandwidth to 38T, built four new switching centers, and accelerated the formation of an all-round, multi-level, three-dimensional network interconnection architecture, with the network service performance reaching an internationally advanced level. The third achievement is that we have opened up \"a new track,\" and the process of industrial digitalization continues to accelerate. In terms of industries, the integration of information and communications applications has accelerated to expand and deepen in the fields of industry, medical care, education, and transportation. The number of virtual private networks in the 5G industry has exceeded 10,000, and the number of mobile Internet of Things connections accounts for 70% of the global total. The industrial internet has been fully integrated into 45 major categories of the national economy. In terms of individual users, the number of apps has exceeded 2.58 million, enriching various user needs in consumption, entertainment, social networking, travel, etc., and comprehensively improving quality of life, and promoting the formation of the world's largest and most active digital service market. Going forward, the MIIT will thoroughly implement the spirit of the 20th CPC National Congress and the plans of the Central Economic Work Conference; ensure both development and security; focus on consolidating foundations, promoting applications, and ensuring security; and consolidate the leading position of the information and communications industry in a bid to serve the high-quality development of the digital economy. The first is to build high-quality information infrastructure. We will accelerate the in-depth coverage of the \"Double Gigabit\" networks; implement gigabit city construction actions; build an integrated computing power infrastructure application system with cloud-edge-terminal collaboration and integration of computing, storage, and operation; launch the \"Broadband Frontier\" project for universal telecommunications services; and promote high-quality development of the mobile Internet of Things, smoothing the information artery. The second is to cultivate high-level integrated innovative applications. We will vigorously promote the integrated application of new-generation ICT such as 5G and gigabit optical networks in information consumption, vertical industries, people's wellbeing, and digital government. We will also promote the large-scale application of the industrial internet so as to lead the high-end, intelligent, and green development of industries. The third is to build a highly reliable network security line of defense. We will comprehensively promote the construction of basic telecommunications network security capabilities, deepen the construction of data security management systems and supervision practices in the field of industry and information technology, advance the development of network and data security industries, and improve the network security system based on the security of network facilities, focusing on data security and supported by the security industry. Thank you. _ueditor_page_break_tag_ Hong Kong Bauhinia Magazine: SMEs provide important support for China's economic resilience and are related to overall economic and social development. May I ask how the operation and development of SMEs were in 2022? What measures did the MIIT introduce to help and solve the difficulties of SMEs? Thank you. Tian Yulong: Thank you for your question. I will answer this question. The whole of society pays close attention to SMEs. SMEs connect thousands of households and are also an important force in promoting innovation, employment, and improve people's livelihoods. Since 2020, due to the continuous impact of the epidemic, SMEs have been greatly impacted and faced difficulty in business operations. Under the strong leadership of the CPC Central Committee and the State Council, especially by giving full play to the role of the leading group of the State Council for promoting the development of SMEs, the MIIT, together with relevant departments, has introduced a series of policies and measures to help SMEs ease their difficulties and develop healthily and steadily. Some measures have been taken in the following aspects. In terms of tax and fee reductions in 2022, tax cuts, fee reductions, tax refunds, and tax and fee deferrals added up to more than 4 trillion yuan for various market entities throughout the year, with about 4% being enjoyed by small and micro-enterprises. In terms of increasing financing, as of the end of November 2022, the national inclusive small and micro-enterprise loan balance reached 23.2 trillion yuan, a year-on-year increase of 23.7%. In addition, the National Small and Medium Enterprises Development Fund has led social capital to invest a total of 35 billion yuan, which has played a very good role in alleviating loan difficulties. In terms of corporate innovation, we have established a gradient cultivation system for high-quality SMEs, accumulatively cultivating 8,997 national-level \"little giant\" enterprises with high growth potential, advanced technology and strong market competitive edge, and over 70,000 provincial-level SMEs with such strengths. In terms of services, in 2022, we launched the \"Together to Benefit Enterprises\" service action for SMEs, organized various high-quality resources, and provided policies, management, and technologies. We have provided more than 50 million services to SMEs. Their feelings are good. At the same time, we actively carried out special actions to prevent and resolve payment arrears to SMEs and promote the clearing of undisputed arrears in the ledger. Recently, the office of the leading group issued \"Measures for Assisting in Growth Stabilization, Structural Adjustment, and Capacity Enhancement of MSMEs.\" The move was reported in various news outlets. The document put forward 15 specific measures to help MSMEs solve difficulties and achieve high-quality, sustainable development, especially focusing on their current difficulties and problems and based on a dual strategy of both easing difficulties and providing service, and adjusting structure and building up capabilities in parallel. With the support of these policies, the vast number of SMEs have continued to strive for self-improvement, rise up to challenges, and overcome various difficulties to achieve stable production and operations. According to the National Bureau of Statistics, from January to November 2022, the number, operating income, and total profit of industrial SMEs above the designated size increased by 10.5%, 6.0%, and 0.3% year-on-year, respectively, demonstrating SMEs' strong resilience and vitality. A survey conducted by MIIT of 43,000 SMEs shows that in 2022, nearly 40% of enterprises had new loans, more than 60% of enterprises invested in research and development, and more than 60% of enterprises invested in fixed assets, demonstrating their growing confidence in development. At the same time, we conducted a survey of more than 1,800 \"little giant\" enterprises with high growth potential, advanced technology and strong market competitive edge, and found that from January to November, the profit margin of operating income of \"little giant\" enterprises was 10.7%, which was 5.2 percentage points higher than that of industrial enterprises above the designated size. In 2023, the difficulties and challenges for the stable development of SMEs remain big. In this regard, all departments and localities need to join efforts. In accordance with the plans of the Central Economic Work Conference, we will continue to work unswervingly both to consolidate and develop the public sector and to encourage, support and guide development of the non-public sector. We will further strengthen policies and measures to promote the high-quality development of SMEs, including improving the policies and environment for their development, providing better services, encouraging innovation and cultivating talents. Thank you. Xing Huina: If you have no more questions, today's briefing is hereby concluded. Thank you to the three speakers and friends from the media. Goodbye. Translated and edited by Zhang Tingting, Li Huiru, Xu Xiaoxuan, Zhou Jing, Yan Bin, Yuan Fang, Li Xiao, Liu Sitong, Xu Kailin, Liu Qiang, Wang Qian, Zhu Bochen, Daniel Xu, and Tom Arnsten. In case of any discrepancy between the English and Chinese texts, the Chinese version is deemed to prevail.","filter_flag":1}
{"title":"How Technology is Facilitating Comfort in Your Footwear - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L3RyZW5kcy9ob3ctdGVjaG5vbG9neS1mYWNpbGl0YXRpbmctY29tZm9ydC15b3VyLWZvb3R3ZWFy0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L3RyZW5kcy9ob3ctdGVjaG5vbG9neS1mYWNpbGl0YXRpbmctY29tZm9ydC15b3VyLWZvb3R3ZWFy0gEA?oc=5","id":"CBMibmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L3RyZW5kcy9ob3ctdGVjaG5vbG9neS1mYWNpbGl0YXRpbmctY29tZm9ydC15b3VyLWZvb3R3ZWFy0gEA","guidislink":false,"published":"Tue, 03 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=3, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=3, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L3RyZW5kcy9ob3ctdGVjaG5vbG9neS1mYWNpbGl0YXRpbmctY29tZm9ydC15b3VyLWZvb3R3ZWFy0gEA?oc=5\" target=\"_blank\">How Technology is Facilitating Comfort in Your Footwear<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How Technology is Facilitating Comfort in Your Footwear - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L3RyZW5kcy9ob3ctdGVjaG5vbG9neS1mYWNpbGl0YXRpbmctY29tZm9ydC15b3VyLWZvb3R3ZWFy0gEA?oc=5\" target=\"_blank\">How Technology is Facilitating Comfort in Your Footwear<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Manufacturing\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Year Ender: How India is embracing New-Age Beauty and Personal Care Brands With the eventful year of 2022 coming to an end, every Indian can be seen to rejoice and prep for the new year as the same is happening after a pandemic-struck hiatus of 2 long years. With festivities around the corner, there has been a significant surge in demand in the markets which are flooded with consumers. Every industry is witnessing the surge, and Beauty and Personal Care is not behind. However, the stiff competition for customers between online and offline brands has become more prominent than ever. To understand the commotion among the brands this season, these brands give us an insight into their 2022 journey and their 2023 growth plans. SUGAR Cosmetics This year SUGAR Cosmetics touched larger milestones, becoming one of the select few brands that have launched 120+ of their own stores in retail, reaching a total of 45000+ retail touchpoints across 550+ cities. SUGAR’s IG page garnered 2.4M+ followers, becoming the largest consumer brand in India on the platform, along with our experiment into gamified AR filters that hit virality on platforms like Instagram and Moj. The brand’s #ShukarHaiSUGARHai Campaign with campaign ambassadors Ranveer Singh and Tamannaah Bhatia was also a huge viral success allowing the brand to receive support from impactful investors namely LCatterton and Ranveer Singh. “At SUGAR in 2022, we managed to almost double our sales over the previous year, achieved the target of being one of the Top 3 brands in color cosmetics in India, and are looking at another year of massive growth,” said Vineeta Singh, Co-founder, and CEO, SUGAR Cosmetics. She further added, “Our plans for 2023 include targeting and achieving a 100 percent Y-O-Y revenue growth over last year, expansion to more than 60,000 retail outlets, making our D2C platform base stronger and larger, and growing our team size to 3,000 employees.” Keeping its audience in mind, SUGAR is looking forward to tapping into different categories of the beauty industry. The brand will also focus on creating solid content to keep educating and engaging its community across all platforms–digital and others. The Body Shop \"We at The Body Shop are embarking upon a new strategy of ‘Change Making Beauty’, which means that we aim to empower customers, employees, and partners to drive positive change for the world through our channels, our products, and our activism,\" stated Vishal Chaturvedi, Vice President, The Body Shop, South Asia. With this vision, the brand is aligned to reach its goal of 25 new stores in 2022 at various locations. Currently, having 200 highly visible and accessible stores all over India, including Tier I and II cities, with the latest additions in Itanagar, Surat, and Indore. The brand's current product portfolio is already over 60 percent Vegan, aiming to become 100 percent Vegan by 2023. This aim is the natural next step forward for the brand's Cruelty-Free commitment, including reformulating all our core products from 100 percent Vegetarian to 100 percent Vegan, while focusing on making its product packaging 100 percent recyclable thus reducing its environmental impact. \"We are strengthening our retail and e-commerce channels by opening more workshop stores and launching new digital experiences. We are expanding our retail footprint with a clear focus on smaller cities and towns. Rolling out the new Workshop store format in as many stores as possible: 30+ new ACTIVIST Workshop stores per year, every year till 2025 bringing the brand to people where they love to shop,\" added Chaturvedi. Plum Plum would be closing the financial year at over 2x the revenue of the previous FY, complemented by the 44 percent growth seen in its overall customer base with a 96.54 percent increase in repeat buyers which is a great win in the D2C space. “We raised $35 million (Rs 270 crore) in a Series C round in March 2022 totaling our funding to over $50 million. With this, our efforts have been towards bringing in more salient brand communication, growing our omnichannel presence and onboarding high-quality talent with a focus on investments in marketing and technology,” said Shankar Prasad, Founder & CEO, Plum Having launched over 8 exclusive brand outlets in the last year across cities, the brand plans to scale this up to 50 in the coming year. Furthermore, Plum onboarded Rashmika Mandanna and Mithila Palkar as its brand ambassadors for the Plum skincare range and Ananya Panday for the Plum Body Lovin’ fragrance range. “We would be expanding our makeup range aggressively with a host of innovative product formats in the coming year. We would also be launching a line of products in the essentials and advanced ranges under both skincare and haircare categories,” added Prasad. Colorbar The post-pandemic period has witnessed a radical shift in consumer behavior and expectations. As per research, the total retail sale is expected to reach $5.5 trillion by 2027 with online sales making up 30 percent of the market. The retail industry has been largely shadowed by challenges across the supply chain, economic uncertainty, and geo-political factors. I feel that going forward, the only way for retailers to sail through is by exhibiting strong levels of adaptability, agility, and flexibility. \"As we graduate into the next year, we can expect a renewed focus on enhancing the customer shopping journey by providing a seamless experience for hybrid shopping. Re-invention of physical store designs along with a robust omnichannel strategy would, however, emerge as a top priority. Many companies will be seen adding features to support new shopping initiatives while integrating technologies supporting AR\/VR advancements. We are aligned to lead the change and have a strong conviction that our strategy would create benchmarks of excellence in 2023,” stated Samir Kumaar Modi, Founder, and Managing Director, Colorbar Cosmetics. Kapiva “We have been relentlessly working towards improving the health and wellness quotient of Indians with Ayurveda. Recently, we expanded in the US and UAE to enable this for the global audience as well. Our focus this year was on increasing the effectiveness of our products. We’ve moved the needle on that front by successfully conducting a clinical trial for our Dia Free Juice. It has also proven to be effective in decreasing HbA1c to an extent of 11 percent and increasing insulin production in the body by up to 25-30 percent. However, the highlight of the year was definitely the recognition by Honorable PM Modi,” said Ameve Sharma, Founder, Kapiva. In the upcoming year, Kapiva aims to double down, concurrently increasing brand awareness and recall to become a household name. Modern consumers are less concerned with outward appearance than they once were, and are more concerned with their complete well-being, which encompasses physical, mental, and emotional health. In order to capitalize on this trend, Kapiva is constantly creating consumer awareness by keeping the emphasis on the paramount importance of Ayurveda and how it can enable people to live a holistic lifestyle. Earth Rhythm 2022 was a favorable year for Earth Rhythm, as it brought in a lot of positive changes in terms of organization, growth, and product. At an organizational level, the brand was able to double the size of the team with its customer base growing 4x times compared to the previous financial year. The brand also went offline with the launch of its exclusive kiosks at 12 different locations across India. “We are expanding our makeup category which will go on to strengthen Earth Rhythm’s wide-ranging portfolio, we have also been intensifying the existing categories. True to our digital-first identity, it was also a natural step for us to continue investing in technology in a bid to further streamline operations and give our customers every convenience they desire. We successfully launched our very own mobile App for both Android and iOS platforms this year and have been gaining steady traction on it. Next year, we plan to further build our portfolio by deepening the makeup category launched in 2022. We reckon 2x growth over FY 2021-22,” said Harini Sivakumar, Founder, and CEO, Earth Rhythm. In keeping with this shift in the consumer’s preference, the brand aims to reinforce its multifunctional product range in both makeup and personal care (face, body, hair), aimed at eliminating the need for and use of multiple products in everyday makeup and skincare routines. ARATA This year at Arata launched over 20 products and 30 offline stores across India, steadily growing 10 percent month on month with respect to GMV. “In the upcoming year, we will go full throttle to bridge the gaps in our product line and be a one-stop shop for all hair care needs. We have already begun our groundwork and have set processes to create formulas in the anti-hair fall, hair colorants, and hair styling segments,” said Dhruv Madhok, Co-Founder, ARATA. BlushBee 2022 has been the year of the first full-fledged operations for Blushbee. Beginning with just three products and later expanding to 10 categories with 64 unique SKUs, the brand has witnessed massive organic growth in its customer base. BlushBee as a cosmetics line is a product of careful decisions in choosing what it wants, the other advantage is that being a clean and green beauty brand which is an important factor in the value proposition. “We hope to grow into a one-stop shop for all things related to color cosmetics, so we are actively looking into introducing new products like foundations, gloss, and so on. We have also discussed extending our horizons beyond just the realm of color cosmetics very soon,” stated Shobana and Navneethan, Founders, BlushBee Organic Beauty Brand. Crazy Owl - Your Skin Co The brand was launched in 2022 with the mindset of embracing the true self and exploring the crazy side. The brand is PETA and IFRA certified, FDA approved, and currently provides the best possible sensorial experience in Hair Care with India's First Date Seed Oil Shampoo, Conditioner, and Hair Oil. “In the short term, we are working towards expanding on two fronts- launching more affordable luxury products across categories in which we operate. With the right set of team, products, and marketing strategy we were able to launch our brand, and today, 6 months post the launch we are happy to serve more than 2000+ households,” commented Damanjit Kohli and Karishma Sahni, Founders, Crazy Owl - Your Skin Co. Increasing its touchpoint and interaction with the product, currently, Crazy Owl has signed up on all major marketplace platforms – Amazon Launchpad, Flipkart Propel Program, Purple, Snapdeal, Tata 1 mg, First cry, Myntra, Nykaa, Bigbasket and will be launching itself on Blink it, Paytm, Pharmeasy and Shopperstop planning to grow its channel every month. Pilgrim “As one of the fastest growing personal care brands in India, we have seen significant growth in the last 12 months and clocked a sale of Rs 10 crore per month along with a growth of 6X. With the trust that the brand has built throughout, we have had some great partnerships this year for our campaigns. Celebrity shout-outs from personalities like Soha Ali Khan, and Vidya Balan, and association with Kalki Koechlin in our most recent commercial have been one of the key highlights,” said Anurag, Co-Founder and CEO, Pilgrim. With a strong consumer base of 1 million, the brand aims to improve its interaction and thus upgraded its technology. Along with updating its technology, the brand is also using innovative ways to reach its target audience. Pilgrim aims to be a Rs 1,000 crore brand in the next 3-4 years by facilitating new product and category launches and exploring newer international markets like the Middle East. Moreover, planning to double down on its R&D capabilities and increase brand investments by bringing in global experiences for its customers, both online and offline. Along with establishing its presence internationally, Pilgrim aims to achieve an annualized run rate of Rs 500 crore by December 2023. iluvia Professional As a new-age, self-care brand pioneering product-driven innovation and technology, during the course of the year iluvia witnessed growth across different channels, and new launches, and hit several milestones. The organization has grown 25x in revenue between October 2021 and 2022 along with a 20x growth in its online consumer base, currently present across key marketplaces and in over 1800 salons in India across 70+ cities. “It is a very exciting time for us as we are working on introducing new patented treatment technologies and new launches in the haircare category. We also expect a positive growth trajectory of 6x to 7x in the coming year,” stated Nishant Gupta and Palash Pandey, Directors, Renaura Wellness Pvt. Ltd. Beauty and Skincare, as a category, has burst forth since the onset of the pandemic in late 2019. The D2C space, especially, has seen remarkable growth which we expect will continue in 2023 and beyond. Moreover, The Indian beauty and personal care segment, which stood above Rs 54,500 crore only two years ago, is expected to grow at a CAGR of 11 percent over the next five years.","filter_flag":1}
