{"title":"'Deloitte 2023 Financial Services Industry Predictions': Generative AI, Carbon Offset Financing, Driverless Vehicles ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi8AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2RlbG9pdHRlLTIwMjMtZmluYW5jaWFsLXNlcnZpY2VzLWluZHVzdHJ5LXByZWRpY3Rpb25zLWdlbmVyYXRpdmUtYWktY2FyYm9uLW9mZnNldC1maW5hbmNpbmctZHJpdmVybGVzcy12ZWhpY2xlcy1vZmZpY2Utc3BhY2UtY29udmVyc2lvbi1hbW9uZy10b3AtdHJlbmRzLXRyYW5zZm9ybWluZy1maW5hbmNpYWwtc2VydmljZXMtMzAxODg4ODE0Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi8AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2RlbG9pdHRlLTIwMjMtZmluYW5jaWFsLXNlcnZpY2VzLWluZHVzdHJ5LXByZWRpY3Rpb25zLWdlbmVyYXRpdmUtYWktY2FyYm9uLW9mZnNldC1maW5hbmNpbmctZHJpdmVybGVzcy12ZWhpY2xlcy1vZmZpY2Utc3BhY2UtY29udmVyc2lvbi1hbW9uZy10b3AtdHJlbmRzLXRyYW5zZm9ybWluZy1maW5hbmNpYWwtc2VydmljZXMtMzAxODg4ODE0Lmh0bWzSAQA?oc=5","id":"CBMi8AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2RlbG9pdHRlLTIwMjMtZmluYW5jaWFsLXNlcnZpY2VzLWluZHVzdHJ5LXByZWRpY3Rpb25zLWdlbmVyYXRpdmUtYWktY2FyYm9uLW9mZnNldC1maW5hbmNpbmctZHJpdmVybGVzcy12ZWhpY2xlcy1vZmZpY2Utc3BhY2UtY29udmVyc2lvbi1hbW9uZy10b3AtdHJlbmRzLXRyYW5zZm9ybWluZy1maW5hbmNpYWwtc2VydmljZXMtMzAxODg4ODE0Lmh0bWzSAQA","guidislink":false,"published":"Mon, 31 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=212, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi8AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2RlbG9pdHRlLTIwMjMtZmluYW5jaWFsLXNlcnZpY2VzLWluZHVzdHJ5LXByZWRpY3Rpb25zLWdlbmVyYXRpdmUtYWktY2FyYm9uLW9mZnNldC1maW5hbmNpbmctZHJpdmVybGVzcy12ZWhpY2xlcy1vZmZpY2Utc3BhY2UtY29udmVyc2lvbi1hbW9uZy10b3AtdHJlbmRzLXRyYW5zZm9ybWluZy1maW5hbmNpYWwtc2VydmljZXMtMzAxODg4ODE0Lmh0bWzSAQA?oc=5\" target=\"_blank\">'Deloitte 2023 Financial Services Industry Predictions': Generative AI, Carbon Offset Financing, Driverless Vehicles ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"'Deloitte 2023 Financial Services Industry Predictions': Generative AI, Carbon Offset Financing, Driverless Vehicles ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi8AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2RlbG9pdHRlLTIwMjMtZmluYW5jaWFsLXNlcnZpY2VzLWluZHVzdHJ5LXByZWRpY3Rpb25zLWdlbmVyYXRpdmUtYWktY2FyYm9uLW9mZnNldC1maW5hbmNpbmctZHJpdmVybGVzcy12ZWhpY2xlcy1vZmZpY2Utc3BhY2UtY29udmVyc2lvbi1hbW9uZy10b3AtdHJlbmRzLXRyYW5zZm9ybWluZy1maW5hbmNpYWwtc2VydmljZXMtMzAxODg4ODE0Lmh0bWzSAQA?oc=5\" target=\"_blank\">'Deloitte 2023 Financial Services Industry Predictions': Generative AI, Carbon Offset Financing, Driverless Vehicles ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Offset\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"The report highlights emerging trends that will significantly impact the financial services industry over the next decade NEW YORK, July 31, 2023 \/PRNewswire\/ -- Deloitte today announced its \"2023 Financial Services Industry Predictions\" report, which outlines emerging trends across the banking & capital markets, insurance, real estate, and investment management sectors. The report highlights the impact of data and emerging technologies, products and services, and climate change on the future of financial services – and as a result, on society and the economy. \"The reality is that emerging technological changes could be more pervasive and impactful going forward in ways that can be scarcely imagined today,\" said Jim Eckenrode, managing director, Deloitte Center for Financial Services. Deloitte Services LP. \"Financial services will likely play an important role in helping these breakthroughs emerge to the benefit of us all, while simultaneously opening up new avenues of revenue and profit.\" Some of Deloitte's predictions for the financial services industry over the next decade: Generative AI is expected to boost productivity: Generative AI is expected to have a significant impact on the investment banking industry and the financial services industry as a whole, as organizations explore ways to harness the power of the technology to improve productivity. Deloitte predicts the top 14 global investment banks could boost their front-office productivity by an average of 25% by using Generative AI (GAI), thereby earning potentially an additional revenue of $3 million per front-office employee in 2026, from an average of $11.3 million during 2020-22. Demand for carbon credit offset financing: Deloitte predicts that global consumers will purchase $115 billion of carbon offsets a year by 2030. Carbon credits will likely be embedded in many of the purchasing decisions that consumers make in their day-to-day lives. The surge in demand for these credits could produce new trading networks that offer tailored, localized and niche options for climate change mitigation projects. Banks could be instrumental in developing and supporting the back-end infrastructure that connect brands' payment processes to the carbon credit market. And banks can play an instrumental role in developing and supporting the carbon credit market. Insurers prepare for driverless vehicles: Deloitte estimates advancements in self-driving technology may eliminate the need for around 380,000 long-haul truck drivers in the next five years. This alone would have a major impact on workers' compensation insurers, with a potential loss of around $3 billion worth of premiums. But widespread adoption of autonomous vehicles could also result in a shift in premiums across multiple insurance lines, including commercial auto, product and professional liability, and cyber coverage. Office space to fill the affordable housing gap: Deloitte predicts office-to-residential conversions could become profitable within the next five years, estimating that around 14,700 affordable units in central business districts across the country can be added by 2030, assuming approximately 20% of converted square footage can be earmarked for affordable housing. \"As financial services firms grapple with what's on the horizon, they need to think about how the landscape is radically shifting,\" said Monica O'Reilly, Vice Chair, US Financial Services Industry Leader, Deloitte & Touche LLP. \"Market and economic pressures, emerging technologies, and new revenue opportunities will impact tomorrow's business strategies, and financial services firms should prepare for that now.\" Additional trends included in the report that are expected to shape the financial services industry: Democratization of financial advice: Financial advice shouldn't just be for the wealthy anymore — and it doesn't have to be. Financial firms can leverage robo-advisory platforms to bring much-needed financial advice to the global mass market and make it profitable. Deloitte estimates net financial wealth held by the mass retail population segment globally to almost double to $22 trillion by 2030. Synthetic identity fraud could trigger need for more sophisticated biometric security systems: Synthetic identity fraud—a hoax in which cybercriminals create new identities with some stolen or fabricated data — is the fastest growing financial crime in the United States,i and it shows no sign of abating. Deloitte expects it to generate at least $25 billion in losses by 2030, prompting banks to develop more advanced biometric security systems to weed out would-be perpetrators. Higher deposit costs expected to challenge banks: Deloitte predicts the average cost of interest-bearing deposits for the U.S. banking industry in 2024 and 2025 to remain elevated at 1.7% and 1.5%, respectively, even as the fed funds rate declines from the recent peak. This may crimp bank profitability in the medium term. Real-time B2B payments could take off: Deloitte expects real-time payments could tap an addressable market of $12 trillion in check-based business-to-business (B2B) transaction volume globally by 2028. Banks and payment firms could play a pivotal role in helping usher in a new era of more efficient and instant domestic and cross-border value exchange among businesses. Rise of embedded insurance: Embedded finance, and particularly embedded insurance, is expected to continue to expand. Execution may not be easy for insurers, though, and it could take the rest of the decade for embedded finance to fully shake out. Increased spending on quantum computing: Spending on quantum-related capabilities will likely grow quickly over the next few years as indicated by the increased capital investments and patent filings for the hardware technology. Globally, the financial services industry's spending on quantum computing capabilities is expected to grow 233x from just US$80 million in 2022 to US$19 billion in 2032, growing at a 10-year CAGR of 72%. Alternative data in investment management: Deloitte estimates the revenue for alternative data providers, earned from all industries globally with the majority coming from investment management firms, to grow 29x between 2022 and 2030. The new data largely consist of novel types and forms of data such as satellite images, social media posts, geolocation data, credit card transactions, and mobile application data that are starkly different from the traditionally structured financial data. Funding for climate hardtech: An additional US$2 trillion in private hardtech investment is predicted to be needed to help effectively slow global warming. Most of total climate funding will likely need to come from the private sector — but so far, there isn't enough. Financial services organizations can play a lead role in bridging the funding gap. About Deloitte Deloitte provides industry-leading audit, consulting, tax and advisory services to many of the world's most admired brands, including nearly 90% of the Fortune 500® and more than 7,000 private companies. Our people come together for the greater good and work across the industry sectors that drive and shape today's marketplace — delivering measurable and lasting results that help reinforce public trust in our capital markets, inspire clients to see challenges as opportunities to transform and thrive, and help lead the way toward a stronger economy and a healthier society. Deloitte is proud to be part of the largest global professional services network serving our clients in the markets that are most important to them. Building on more than 175 years of service, our network of member firms spans more than 150 countries and territories. Learn how Deloitte's more than 415,000 people worldwide connect for impact at www.deloitte.com . Deloitte refers to one or more of Deloitte Touche Tohmatsu Limited, a UK private company limited by guarantee (\"DTTL\"), its network of member firms, and their related entities. DTTL and each of its member firms are legally separate and independent entities. DTTL (also referred to as \"Deloitte Global\") does not provide services to clients. In the United States, Deloitte refers to one or more of the US member firms of DTTL, their related entities that operate using the \"Deloitte\" name in the United States and their respective affiliates. Certain services may not be available to attest clients under the rules and regulations of public accounting. Please see www.deloitte.com\/about to learn more about our global network of member firms. iFedPayments Improvement, \"Synthetic identity fraud,\" accessed June 8, 2023. SOURCE Deloitte","filter_flag":1}
{"title":"Sustainability Matters: Carhartt Expands Resale Program to More Stores + More News - Footwear News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vZm9vdHdlYXJuZXdzLmNvbS9idXNpbmVzcy9idXNpbmVzcy1uZXdzL2Zhc2hpb24taW5kdXN0cnktc3VzdGFpbmFiaWxpdHktZWNvLWZyaWVuZGx5LW5ld3MtbGl2ZS11cGRhdGVzLTIwMjMtMTIwMzM5NDY2My_SAYMBaHR0cHM6Ly9mb290d2Vhcm5ld3MuY29tL2J1c2luZXNzL2J1c2luZXNzLW5ld3MvZmFzaGlvbi1pbmR1c3RyeS1zdXN0YWluYWJpbGl0eS1lY28tZnJpZW5kbHktbmV3cy1saXZlLXVwZGF0ZXMtMjAyMy0xMjAzMzk0NjYzL2FtcC8?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vZm9vdHdlYXJuZXdzLmNvbS9idXNpbmVzcy9idXNpbmVzcy1uZXdzL2Zhc2hpb24taW5kdXN0cnktc3VzdGFpbmFiaWxpdHktZWNvLWZyaWVuZGx5LW5ld3MtbGl2ZS11cGRhdGVzLTIwMjMtMTIwMzM5NDY2My_SAYMBaHR0cHM6Ly9mb290d2Vhcm5ld3MuY29tL2J1c2luZXNzL2J1c2luZXNzLW5ld3MvZmFzaGlvbi1pbmR1c3RyeS1zdXN0YWluYWJpbGl0eS1lY28tZnJpZW5kbHktbmV3cy1saXZlLXVwZGF0ZXMtMjAyMy0xMjAzMzk0NjYzL2FtcC8?oc=5","id":"CBMif2h0dHBzOi8vZm9vdHdlYXJuZXdzLmNvbS9idXNpbmVzcy9idXNpbmVzcy1uZXdzL2Zhc2hpb24taW5kdXN0cnktc3VzdGFpbmFiaWxpdHktZWNvLWZyaWVuZGx5LW5ld3MtbGl2ZS11cGRhdGVzLTIwMjMtMTIwMzM5NDY2My_SAYMBaHR0cHM6Ly9mb290d2Vhcm5ld3MuY29tL2J1c2luZXNzL2J1c2luZXNzLW5ld3MvZmFzaGlvbi1pbmR1c3RyeS1zdXN0YWluYWJpbGl0eS1lY28tZnJpZW5kbHktbmV3cy1saXZlLXVwZGF0ZXMtMjAyMy0xMjAzMzk0NjYzL2FtcC8","guidislink":false,"published":"Thu, 20 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=201, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vZm9vdHdlYXJuZXdzLmNvbS9idXNpbmVzcy9idXNpbmVzcy1uZXdzL2Zhc2hpb24taW5kdXN0cnktc3VzdGFpbmFiaWxpdHktZWNvLWZyaWVuZGx5LW5ld3MtbGl2ZS11cGRhdGVzLTIwMjMtMTIwMzM5NDY2My_SAYMBaHR0cHM6Ly9mb290d2Vhcm5ld3MuY29tL2J1c2luZXNzL2J1c2luZXNzLW5ld3MvZmFzaGlvbi1pbmR1c3RyeS1zdXN0YWluYWJpbGl0eS1lY28tZnJpZW5kbHktbmV3cy1saXZlLXVwZGF0ZXMtMjAyMy0xMjAzMzk0NjYzL2FtcC8?oc=5\" target=\"_blank\">Sustainability Matters: Carhartt Expands Resale Program to More Stores + More News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Footwear News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sustainability Matters: Carhartt Expands Resale Program to More Stores + More News - Footwear News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vZm9vdHdlYXJuZXdzLmNvbS9idXNpbmVzcy9idXNpbmVzcy1uZXdzL2Zhc2hpb24taW5kdXN0cnktc3VzdGFpbmFiaWxpdHktZWNvLWZyaWVuZGx5LW5ld3MtbGl2ZS11cGRhdGVzLTIwMjMtMTIwMzM5NDY2My_SAYMBaHR0cHM6Ly9mb290d2Vhcm5ld3MuY29tL2J1c2luZXNzL2J1c2luZXNzLW5ld3MvZmFzaGlvbi1pbmR1c3RyeS1zdXN0YWluYWJpbGl0eS1lY28tZnJpZW5kbHktbmV3cy1saXZlLXVwZGF0ZXMtMjAyMy0xMjAzMzk0NjYzL2FtcC8?oc=5\" target=\"_blank\">Sustainability Matters: Carhartt Expands Resale Program to More Stores + More News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Footwear News<\/font>","source.href":"https:\/\/footwearnews.com","source.title":"Footwear News","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Offset\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"FN highlights the latest sustainable initiatives this year, including product launches, material innovations and corporate strategies. Send your news to web@footwearnews.com. July 19, 2023: Carhartt is expanding its in-store resale trade-in program, Carhartt Reworked, to 35 of its retail stores across the U.S., effective immediately. The brand will also roll out a mail-in trade-in system starting later in 2023 for the program, which is powered by Trove. The expansion builds upon Carhartt’s initial pilot program across six stores. “We are encouraged by the positive support and feedback the program has received over the first three months, and we are excited to expand it so more hardworking people can get their hands on gear that is not done working,” said Gretchen R. Valade, director of sustainability at Carhartt. June 8, 2023: Capri Holdings – the parent company of Michael Kors, Jimmy Choo and Versace – has announced a new 3-year partnership with the National Fish and Wildlife Foundation (NFWF) to accelerate the adoption of voluntary regenerative management and conservation practices in the United States, a key leather-sourcing region within the company’s supply chain. The initiative is expected to generate $3 million in on-the-ground conservation impact through $1.5 million in funding from Capri Holdings and matching contributions through NFWF. This first-of-its-kind partnership between NFWF and the fashion industry seeks to improve 150,000 acres of U.S. grasslands by working with private landowners and local partners to drive a more sustainable future for the leather industry, while helping to meet the company’s corporate social responsibility (CSR) commitments. Through this partnership, Capri and NFWF will work to restore the health of critical grazing lands in the Northern Great Plains, Southern Great Plains and Rocky Mountain Rangelands. The goal of the partnership is to advance regenerative agriculture practices by improving the resiliency of ranching communities, while sequestering greenhouse gas emissions and restoring critical habitat for wildlife. May 25, 2023: Performance foam manufacturer Dahsheng Chemical (DSC) has introduced Dreamcell Xpresso, a new foam technology made with 20 percent spent coffee grounds. The eco-friendly insole is intended to provide both performance and comfort, while also reducing waste and greenhouse gas emissions. Johnson Chang, CEO of Dahsheng Chemical, said in a statement, “With Dreamcell Xpresso, we can extend the life cycle and support a circular economy that benefits both manufacturers and consumers without compromising on comfort and performance.” DSC expects to produce 300,000 Dreamcell Xpresso insoles this year, recycling approximately 0.657 metric tons of spent coffee grounds, thereby preventing the creation of 0.16 metric tons of methane emissions in landfills (that’s equivalent to 4 metric tons of CO2). The company also noted that the coffee grounds provide the insoles with bonus odor- and moisture-controlling features. The Dreamcell Xpresso performance insole made with 20% spent coffee grounds. CREDIT: Courtesy of Dahsheng Chemical April 24, 2023: Having worked to limit its emissions and offset its footprint with eligible-verified credits, La Sportiva North America announced that it is Climate Neutral Certified. “As an organization that was born in the mountains, we feel that it is our responsibility to reduce our environmental impact where possible and offset our remaining footprint,” La Sportiva North America president Jonathan Lantz said in a statement. “To put it simply, it’s just the right thing to do. We are very proud of the efforts that we have made here, but we know that there is more work to be done.” Having this certification from the nonprofit organization that works to eliminate carbon emissions, La Sportiva North America said in a statement, is the latest step in reducing its impact on the environment and making climate action a central aspect of its business model. The offset, according to the brand, accounts for every item brought into the U.S. and Canada, and the brand garners credits “by investing in projects that cover emissions generated from material production, transportation and manufacturing.” As a part of its carbon offset initiatives, La Sportiva North America said it is supporting several projects throughout the world. These include partnering with global sustainability and environmental solutions company ClimeCo in the selection of these carbon offset project options; assisting the Sichuan Furong Coal Mine Methane Utilization Project, which reduces greenhouse gas emissions by capturing and using coal mine methane for power generation; assisting with the Cordillera Azul National Park REDD+ Project in Central Peru that works to avoid deforestation in the Cordillera Azul National Park; and working with the Crow Lake Wind Project, which generates emissions reductions by displacing grid-connected sources through the production of renewable wind energy. April 17, 2023: Oregon-based footwear company Softstar Shoes announced it has been certified as a B Corp. Sustainability has long been a cornerstone of the company’s mission. Tim Oliver founded the brand in 1985, using a broken-down school bus as his shoe-making workshop, where he made healthy shoes for his daughter. Now led by CEO Tricia Salcido, Softstar produces high-quality footwear at its 12,000-square-foot, energy-efficient workshop in rural Oregon and continues to support its employees, the environment and the local community. For instance, the company donates all revenue from scrap-made pet toys to charity and has been one of Oregon’s 100 greenest companies for eight years in a row. Softstar Shoes has been certified as a B Corp CREDIT: Courtesy of Softstar Shoes April 12, 2023: PrimaLoft Inc. has created a new insulation made with Ocean Bound Plastic (at-risk plastic collected near coastlines to prevent it from reaching the ocean). The company’s new high-performance insulation is made from 100% post-consumer recycled content, with 60% of that recycled material coming from plastic bottles sourced within a 30-mile radius of coastal areas. The process has been certified by third-party social enterprise OceanCycle. The first companies to use the PrimaLoft insulation with Ocean Bound Plastic are Helly Hansen, which has incorporated the material into its ski collection; and Isbjörn of Sweden, which will feature it in its exclusive online apparel collection this winter. March 29, 2023: GoldToe Socks, a division of Gildan Activewear Inc., has launched a Free Recycling Program in partnership with TerraCycle. The program will offer people an easy way to recycle used socks from any brand, which will then be made into new products. In return, users are rewarded with points that can be turned into donations to nonprofits, schools or the charitable organizations of their choice. To participate, consumers can mail in used socks via a prepaid shipping label found on the TerraCycle website. Once collected, the fabrics are separated into their respective categories (polyesters, cottons, etc.) and reused, upcycled, or recycled as appropriate. March 13, 2023: OrthoLite today announced an exclusive partnership with biochemical firm Novamont to support the creation of OrthoLite Cirql, the company’s circular foam material solution for footwear. Last year, OrthoLite announced the development of Cirql, an eco-friendly foam meant to be biodegradable, recyclable and industrially compostable and that can be used make midsoles, the core cushioning component in shoes. In its latest announcement, it said Novamont Research tailor made the bio-polymer material for Cirql’s chemical-free foaming process, which uses nitrogen (from the air we breathe) combined with renewable energy. OrthoLite said it sought out Novamont for its 30 years of experience in the development of chemical and biotechnological processes to create low-impact certified biodegradable and compostable solutions with multiple end of life options for everyday life. The company also noted that OrthoLite Cirql is moving from the lab into production scale in the back half of 2023. March 9, 2023: Oboz is now B Corp certified, a journey the Bozeman, Mont.-based outdoor brand began in 2021. “Achieving B Corp certification is an incredible milestone and the culmination of our team’s hard work and ongoing collaborations across our entire network of suppliers and partners,” Oboz president Amy Beck said in a statement. “B Corp certification is another step in a long journey to becoming the best corporate and global citizen we can be.” To achieve B Corp status, which is given to for-profit organizations, a company must document its positive impact via the B Impact Assessment. The assessment, according to nonprofit network B Lab, is divided into five “Impact Areas” that include Governance, Workers, Community, Environment and Customers. In a statement, Oboz — which has planted a tree for every pair of shoes sold and has planted more than 5 million trees to date — has identified climate, circularity and community as its initial areas for improvement. For climate and circularity, the brand said it is focusing on material choices and science-aligned targets and emission reductions within its operations and value chain. For community, Oboz stated it is working to expand its healthcare benefits offering and is working to increase employee diversity, among other community related goals. Feb. 7, 2023: Children’s brand Stride Rite, a division of Wolverine Worldwide, has unveiled two new eco-conscious kids’ sneakers as part of its Stride Forward collection. The new styles include the Sprout for first walkers and the Fern for toddlers. Both retail for $50 and feature an upper made of chrome-free suede and twill composed of 30% seaweed fiber and 70% organic cotton, and their slip-resistant outsoles contain 10% recycled rubber. The Stride Forward collection launched last year with the Stride Rite 360 Aseel sneaker, which uses materials from recycled plastic bottles. To date, 43,764 bottles have been recycled through production. The new Sprout and Fern are available now at Striderite.com and select independently owned Stride Rite retail stores. Jan. 18, 2023: Sock maker Renfro Brands has selected TrusTrace as the partner to support its traceability efforts. TrusTrace CEO and co-founder Shameek Ghosh said in a statement, “Using the TrusTrace platform, Renfro Brands will be able to centralize its current supply chain data for continued compliance with laws such as the UFLPA, as well as measure and document progress towards its sustainability goals.” Renfro has already made progress in its environmental mission. All of its suppliers have achieved at least one sustainable certification, including OEKO-TEX, GRS and ISO, and 30% of its packaging components are recyclable or reusable — with the goal of reaching 100% by 2030. Renfro also aims to use sustainable yarns and materials in 100% of the products it produces by 2030. Jan. 17, 2023: As part of its ongoing sustainability initiative, J.Crew announced it has launched two new endeavors. First, the retailer is partnering with ThredUp to launch a 360-resale program designed to keep product out of landfills and encourage circular wardrobes. Customers can now buy and resell gently-worn J.Crew women’s and kids’ items online at Jcrew.thredup.com and receive J.Crew shopping credit for items sold. Additionally, the company is launching J.Crew Vintage, a curated selection of some of its best womenswear looks that will be sold in its Fifth Avenue store in New York. Featured looks include the 1990s cotton sweater vest, 1980s cropped jean jacket, 1990s denim skirt and more. Jan. 9, 2023: Rack Room Shoes has launched a new initiative with recycling partner Sneaker Impact. Customers can now donate gently worn sneakers by placing them in a collection box at any Rack Room Shoes location to reduce waste across the company’s footprint, which spans more than 500 communities and 36 states. Sneaker Impact will collect and upcycle the donated shoes throughout the year and ship them to developing countries around the globe, providing footwear to people in need while creating jobs in the marketplace. Sneaker Impact will also donate $1 for every pair of footwear collected to Shoes That Fit, a nonprofit organization that has a longstanding partnership with Rack Room.","filter_flag":1}
{"title":"Gipsy Hill launches offset-free carbon negative beers - The Grocer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnRoZWdyb2Nlci5jby51ay9uZXctcHJvZHVjdC1kZXZlbG9wbWVudC9naXBzeS1oaWxsLWxhdW5jaGVzLW9mZnNldC1mcmVlLWNhcmJvbi1uZWdhdGl2ZS1iZWVycy82ODA5OTIuYXJ0aWNsZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnRoZWdyb2Nlci5jby51ay9uZXctcHJvZHVjdC1kZXZlbG9wbWVudC9naXBzeS1oaWxsLWxhdW5jaGVzLW9mZnNldC1mcmVlLWNhcmJvbi1uZWdhdGl2ZS1iZWVycy82ODA5OTIuYXJ0aWNsZdIBAA?oc=5","id":"CBMieGh0dHBzOi8vd3d3LnRoZWdyb2Nlci5jby51ay9uZXctcHJvZHVjdC1kZXZlbG9wbWVudC9naXBzeS1oaWxsLWxhdW5jaGVzLW9mZnNldC1mcmVlLWNhcmJvbi1uZWdhdGl2ZS1iZWVycy82ODA5OTIuYXJ0aWNsZdIBAA","guidislink":false,"published":"Mon, 10 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=191, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnRoZWdyb2Nlci5jby51ay9uZXctcHJvZHVjdC1kZXZlbG9wbWVudC9naXBzeS1oaWxsLWxhdW5jaGVzLW9mZnNldC1mcmVlLWNhcmJvbi1uZWdhdGl2ZS1iZWVycy82ODA5OTIuYXJ0aWNsZdIBAA?oc=5\" target=\"_blank\">Gipsy Hill launches offset-free carbon negative beers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Grocer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Gipsy Hill launches offset-free carbon negative beers - The Grocer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnRoZWdyb2Nlci5jby51ay9uZXctcHJvZHVjdC1kZXZlbG9wbWVudC9naXBzeS1oaWxsLWxhdW5jaGVzLW9mZnNldC1mcmVlLWNhcmJvbi1uZWdhdGl2ZS1iZWVycy82ODA5OTIuYXJ0aWNsZdIBAA?oc=5\" target=\"_blank\">Gipsy Hill launches offset-free carbon negative beers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Grocer<\/font>","source.href":"https:\/\/www.thegrocer.co.uk","source.title":"The Grocer","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Offset\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Gipsy Hill Brewery is claiming a world first with the launch of two beers it says are carbon negative without the need for offsetting schemes, such as planting trees. Swell Lager and Trail Pale (both 4.0% abv) use barley grown by Wildfarmed, a promoter of regenerative practices such as intercropping, cover cropping and reduced tillage, which locks more carbon into the soil than it releases into the atmosphere. Both beers are made using recaptured hops taken from a fermentation process for a previous batch of beer. The carbon footprint for a pint of Swell Lager is –40g carbon dioxide equivalent (CO2e) and –30g CO2e for a pint of Trail Pail, as verified by Zevero, a carbon accounting firm. A typical lager pint produces 350g of CO2, while craft IPAs can generate 500g CO2e or above, according to Gipsy Hill. “We have always tried to make sure our beer has a positive impact, and that’s why we have actively sought to introduce new innovations to the brewing process and work with the most innovative producers to push the boundaries of sustainable brewing,” said the brewery’s co-founder Sam McMeekin. “By truly embedding sustainability into our brewing process, rather than simply offsetting emissions, we have created a blueprint for a sustainable beer range.” The beers are on draught at Gipsy Hill’s own taproom in south London, as well as The Understudy at the National Theatre, Kerb Street food markets, Seven Dials market and various Youngs venues. They are the latest in a string of “carbon negative” beer launches over recent years, the most prominent example being from BrewDog, which launched a carbon negative beer club in March 2021. In spring 2021 it relaunched Lost Lager, profits from which have been pledged to the planting of the Lost Forest, a carbon offset project in Scotland. In its most recent update on progress of the Lost Forest in April, CEO James Watt claimed the company had planted 500,000 trees.","filter_flag":1}
