{"title":"Singapore's plastic recycling conundrum: Could bioplastics hold the key? | KrASIA - KrASIA","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8va3ItYXNpYS5jb20vc2luZ2Fwb3Jlcy1wbGFzdGljLXJlY3ljbGluZy1jb251bmRydW0tY291bGQtYmlvcGxhc3RpY3MtaG9sZC10aGUta2V50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8va3ItYXNpYS5jb20vc2luZ2Fwb3Jlcy1wbGFzdGljLXJlY3ljbGluZy1jb251bmRydW0tY291bGQtYmlvcGxhc3RpY3MtaG9sZC10aGUta2V50gEA?oc=5","id":"CBMiWWh0dHBzOi8va3ItYXNpYS5jb20vc2luZ2Fwb3Jlcy1wbGFzdGljLXJlY3ljbGluZy1jb251bmRydW0tY291bGQtYmlvcGxhc3RpY3MtaG9sZC10aGUta2V50gEA","guidislink":false,"published":"Tue, 03 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=276, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8va3ItYXNpYS5jb20vc2luZ2Fwb3Jlcy1wbGFzdGljLXJlY3ljbGluZy1jb251bmRydW0tY291bGQtYmlvcGxhc3RpY3MtaG9sZC10aGUta2V50gEA?oc=5\" target=\"_blank\">Singapore's plastic recycling conundrum: Could bioplastics hold the key? | KrASIA<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">KrASIA<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Singapore's plastic recycling conundrum: Could bioplastics hold the key? | KrASIA - KrASIA","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8va3ItYXNpYS5jb20vc2luZ2Fwb3Jlcy1wbGFzdGljLXJlY3ljbGluZy1jb251bmRydW0tY291bGQtYmlvcGxhc3RpY3MtaG9sZC10aGUta2V50gEA?oc=5\" target=\"_blank\">Singapore's plastic recycling conundrum: Could bioplastics hold the key? | KrASIA<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">KrASIA<\/font>","source.href":"https:\/\/kr-asia.com","source.title":"KrASIA","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Singapore, often touted for its proactive commitment to sustainability and green initiatives, has a plastic recycling problem. In the past year, the nation generated over one million tonnes of plastic waste, but only 6%, roughly 57,000 tonnes, were recycled. This dismal recycling rate underscores a pressing issue that is unobvious yet pervasive, demanding urgent attention and propositions of solutions. Plastic recycling in Singapore In Singapore, plastic waste typically faces one of two outcomes: recycling or incineration. By the country’s definition, effective plastic recycling starts with categorizing plastics into seven distinct groups, including: Polyethylene terephthalate (PET) High-density polyethylene (HDPE) Polyvinyl chloride (PVC) Low-density polyethylene (LDPE) Polypropylene (PP) Polystyrene (PS) Other plastics, including polycarbonates (PC) These groups are segmented based on their unique properties, in particular melting points as it is an important consideration when processing and recycling plastic. There are four key stages to plastic recycling: Sorting: Plastics are sorted based on their classification before processing. Crushing and blending: Plastics are crushed into smaller fragments and blended to form a consistent, homogenous mixture. Melting and forming: The blended mixture is melted and passed through a screen to create strands of plastic. Pelletization: These plastic strands are cut into pellets, which can be used to create new products. Challenges in Singapore’s plastic recycling practices While some countries have mandated the separation of recyclables into paper, plastic, and metal, Singapore has instead adopted a commingled system, allowing residents to deposit recyclables of any type into blue recycling bins situated islandwide. In a reply to Singaporean politician Murali Pillai, who had probed into the efficacy of the commingled system, Grace Fu, Singapore’s minister for sustainability and the environment, emphasized that the commingled system has been adopted to simplify recycling for residents, aiming to enhance cost-effectiveness and reduce carbon footprints. However, while the commingled system offers convenience, it also presents significant challenges. One of its most pressing issues is the resultant high contamination rate of approximately 40%. Contamination occurs when non-recyclable waste, contaminated recyclables, or reusable items are incorrectly placed into recycling bins. When these items are mixed with recyclables within bins, they are difficult to filter out and may result in cross-contamination. This often results in the entire pool of materials getting incinerated, defeating the original purpose Additionally, Singapore’s land constraints have compelled the country to export a substantial portion of its plastic waste to other nations for recycling. According to CNA, around 92% of Singapore’s plastic waste is exported, mainly to Malaysia, while China and Vietnam also import some of Singapore’s plastic waste. However, the landscape of plastic waste management in these recipient countries is gradually changing. China has already implemented an import ban on plastics, while Malaysia and Vietnam are imposing stricter regulations on the quantity they are willing to accept. For Singapore, establishing recycling plants on home ground is challenging due to its limited land area and high population density. The low economies of scale result in recycled pellets being produced at a cost higher than new plastic pellets. This underscores the complexities of plastic recycling and the need for innovative solutions to address the issue effectively. How bioplastics could solve the problem In the endeavor to address the issue of plastic waste, bioplastics have emerged as a possible solution. Bioplastics are generally bio-based, which means they are sourced from biomass—organic materials from plants and animals. They offer a sustainable alternative to traditional plastics, and can fall under either one of three classifications: Non-biodegradable, and fully or partially bio-based. Biodegradable, and petroleum-based. Biodegradable, and fully or partially bio-based. However, biodegradability can be a confusing concept as most materials will eventually biodegrade to some extent, according to Daniel Carraway, co-founder and CEO of RWDC Industries, a Singapore-based biodegradable material producer. Instead, Carraway emphasizes the need to differentiate materials based on multiple factors: bio-based nature, biodegradability, and compostability. “The issue with bioplastics is that they can be just as harmful to the environment and human health and safety as petroleum-based plastics,” Carraway said. For bioplastics to be sustainably produced, the right materials have to be selected. For example, RWDC Industries has developed a biopolymer known as polyhydroxyalkanoate (PHA). Unlike traditional plastics, PHA is biodegradable and derived from waste materials such as cooking oil and olive oil extraction byproducts. These are materials that would otherwise be unfit for human use and likely disposed of as waste. In natural settings such as soil, freshwater, or marine water, PHA can biodegrade relatively quickly. PHA is also compostable. Composting is the process by which organic materials, including food waste, are decomposed by bacteria and microorganisms, transforming them into nutrient-rich compost. According to Carraway, PHAs can be composted in facilities together with food waste, grass trimmings, and other compostable materials. However, composting is not a widely adopted practice in Singapore. Initiatives like Project Black Gold are working diligently to change that, having launched composting trials in three neighborhoods to encourage the local community to compost their food scraps. Singapore is home to over 1,900 community gardens situated in various housing estates. These community gardens have the potential to not only support but also benefit from composting practices. However, to fully reap the benefits of alternative solutions such as RWDC’s PHA, a broader transformation is necessary within Singapore’s context. For one, although PHA is biodegradable and compostable, integrating its usage without modifying the commingled recycling system is likely to lead to PHA being inadvertently processed within the existing recycling stream, ultimately getting incinerated due to pervasive contamination issues. Thus, to fully realize the potential of PHA in Singapore, education and dialogue will be pivotal. “There’s a strong recognition of the necessity for these materials [such as PHA], and we collaborate with a diverse range of global brand owners to assist them in achieving their goals. This strong interest is driven by the human health and safety concerns associated with traditional plastics,” Carraway said. RWDC serves customers in North America, Europe, and Southeast Asia, with notable interest from the food service and packaging sectors in these regions. While the PHA industry is still in its early stages, Carraway shares that the firm is operating at a pre-commercial demonstration scale. At this stage, it has generated substantial quantities of material to assist its clients in their endeavors to validate and commercialize its products. The company’s ongoing focus is on establishing commercial production facilities to realize this objective on a larger scale. According to Carraway, it may take another three to five years before PHA becomes commonplace globally. As the industry continues to evolve and expand, alternative solutions like PHA offer a beacon of hope in the global quest for sustainability.","filter_flag":1}
{"title":"Wildfire Detection Concept Wins Dezeen and Samsung's Re:Create Design Challenge - Samsung","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vbmV3cy5zYW1zdW5nLmNvbS9nbG9iYWwvd2lsZGZpcmUtZGV0ZWN0aW9uLWNvbmNlcHQtd2lucy1kZXplZW4tYW5kLXNhbXN1bmdzLXJlY3JlYXRlLWRlc2lnbi1jaGFsbGVuZ2XSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vbmV3cy5zYW1zdW5nLmNvbS9nbG9iYWwvd2lsZGZpcmUtZGV0ZWN0aW9uLWNvbmNlcHQtd2lucy1kZXplZW4tYW5kLXNhbXN1bmdzLXJlY3JlYXRlLWRlc2lnbi1jaGFsbGVuZ2XSAQA?oc=5","id":"CBMibWh0dHBzOi8vbmV3cy5zYW1zdW5nLmNvbS9nbG9iYWwvd2lsZGZpcmUtZGV0ZWN0aW9uLWNvbmNlcHQtd2lucy1kZXplZW4tYW5kLXNhbXN1bmdzLXJlY3JlYXRlLWRlc2lnbi1jaGFsbGVuZ2XSAQA","guidislink":false,"published":"Thu, 26 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=299, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vbmV3cy5zYW1zdW5nLmNvbS9nbG9iYWwvd2lsZGZpcmUtZGV0ZWN0aW9uLWNvbmNlcHQtd2lucy1kZXplZW4tYW5kLXNhbXN1bmdzLXJlY3JlYXRlLWRlc2lnbi1jaGFsbGVuZ2XSAQA?oc=5\" target=\"_blank\">Wildfire Detection Concept Wins Dezeen and Samsung's Re:Create Design Challenge<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Samsung<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Wildfire Detection Concept Wins Dezeen and Samsung's Re:Create Design Challenge - Samsung","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vbmV3cy5zYW1zdW5nLmNvbS9nbG9iYWwvd2lsZGZpcmUtZGV0ZWN0aW9uLWNvbmNlcHQtd2lucy1kZXplZW4tYW5kLXNhbXN1bmdzLXJlY3JlYXRlLWRlc2lnbi1jaGFsbGVuZ2XSAQA?oc=5\" target=\"_blank\">Wildfire Detection Concept Wins Dezeen and Samsung's Re:Create Design Challenge<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Samsung<\/font>","source.href":"https:\/\/news.samsung.com","source.title":"Samsung","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Samsung Electronics and Dezeen, a design and architecture magazine, have unveiled the champion of their latest global design competition titled Re:Create Design Challenge. The winning entry is “Solar Lookout,” a conceptual wildfire detection system crafted from recycled Samsung smartphones and powered by renewable energy. Hailing from different corners of the United States, designers Abi Lambert, Cade Thurlby, Karl Wagner and Tyler Boshard claimed the top prize of £10,000 with their project. Participants in the Re:Create Design Challenge developed creative ideas to repurpose old Samsung devices or materials and transform them into new products or services. The competition aimed to discover creative ideas that could potentially help people’s lives and the planet in meaningful ways. Solar Lookout proposal would see Samsung smartphone repurposed into wildfire detection devices, powered by renewable energy. The proposal was designed with the ambition to reduce the time elapsed between the start of a fire and when it is first reported. Envisioned to be positioned 10 feet above ground in areas prone to wildfires, these devices would utilize smartphone cameras to spot abnormalies like fires or smoke — harnessing an AI system for precise identification. To blend in with its natural surroundings, the Samsung smartphone would be encased within a metal container that includes a strategically placed opening to allow the phone’s camera to capture its environment. According to the designers, the phone would communicate via a mesh network and would be developed to report geospatial data including weather patterns and air quality. The designers proposed that the device would be equipped with a 50W solar panel mounted atop the pole, serving a dual purpose of generating power for the phone and offering shade to prevent overheating. Each device would also have space for a Samsung power bank to ensure usability overnight and during limited lighting conditions. “So many great designs were shortlisted for Samsung and Dezeen’s Re:Create Design Challenge,” said Cajsa Carlson, Deputy Editor of Dezeen. “It was a joy to see how people across the world envisioned creative ideas that could have a positive impact.” “Solar Lookout stood out for its proposed utility and well-executed design. The thought and attention to detail that the designers put into the project, and the intention to help communities, makes it a very worthy winner,” she continued. The runners-up of the competition were London design studio Landor & Fitch and Korean designer Eunsu Lee. Landor & Fitch’s project, known as “Robin,” proposed a modular kit that empowers children to build their own equipment to explore the outdoors. The concept was designed to foster education and curiosity about how products are made and, hopefully instill positive recycling practices from a young age. Robin would be an interactive toolkit that utilizes parts from old Samsung devices like cameras, speakers and LEDs. The interchangeable components of such devices would be repurposed into multiple products that can be easily assembled such as a camera, fan and flashlight. Lee’s proposal, “Memory Capsule,” introduced a concept for a recycling campaign that would transform discarded smartphones into USB devices that would serve as symbolic storage devices preserving memories in the form of images, videos and other data from old phones. As a playful nod to its name, the design of the device mirrors the shape of a medical capsule and would feature a transparent cap which, according to the designer, would be made from “recycled polycarbonate sourced from discarded fishing nets.” The device’s packaging would be crafted from recycled pulp, while the metals and plastics within the USB would be repurposed from discarded smartphones. “The entrants really showcased the power of design through a meaningful and sustainable approach to innovation,” Samsung said. “The implementation and actual impact on planet remains untested. However, with consistent effort and creativity in mind, we hope brainstorming such small changes could possibly help create our vision for the future together.” Finalists were selected from over 45 countries worldwide, with Solar Lookout emerging as the winner of the Re:Create Design Challenge. The initial entries were narrowed down to a shortlist of 11 designs, from which the jury selected the top three prize winners. Each design was evaluated based on its innovative ideas and consideration for use of old Samsung devices and recycled materials. The total prize pool for the top three finalists amounted to £18,000 with £10,000 going to the designers of Solar Lookout for their winning concept. *The proposed designs above by the entrants are conceptual and have not been implemented. No assessment was made regarding implementation feasibility and actual or potential social and environmental impact of the designs, which were judged purely on the strength and creativity of the ideas presented. Please find more stories of the winners in Dezeen Website.","filter_flag":1}
{"title":"Why recycle? Recycle Week 2023 - University of Birmingham","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LmJpcm1pbmdoYW0uYWMudWsvbmV3cy8yMDIzL3doeS1yZWN5Y2xlLXJlY3ljbGUtd2Vlay0yMDIz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LmJpcm1pbmdoYW0uYWMudWsvbmV3cy8yMDIzL3doeS1yZWN5Y2xlLXJlY3ljbGUtd2Vlay0yMDIz0gEA?oc=5","id":"CBMiRGh0dHBzOi8vd3d3LmJpcm1pbmdoYW0uYWMudWsvbmV3cy8yMDIzL3doeS1yZWN5Y2xlLXJlY3ljbGUtd2Vlay0yMDIz0gEA","guidislink":false,"published":"Thu, 19 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=292, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LmJpcm1pbmdoYW0uYWMudWsvbmV3cy8yMDIzL3doeS1yZWN5Y2xlLXJlY3ljbGUtd2Vlay0yMDIz0gEA?oc=5\" target=\"_blank\">Why recycle? Recycle Week 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">University of Birmingham<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why recycle? Recycle Week 2023 - University of Birmingham","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LmJpcm1pbmdoYW0uYWMudWsvbmV3cy8yMDIzL3doeS1yZWN5Y2xlLXJlY3ljbGUtd2Vlay0yMDIz0gEA?oc=5\" target=\"_blank\">Why recycle? Recycle Week 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">University of Birmingham<\/font>","source.href":"https:\/\/www.birmingham.ac.uk","source.title":"University of Birmingham","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Only 20% of plastics worldwide are recycled. It is therefore important to consider that recycling alone cannot be the solution for the plastic waste problem. Imagine if we had circular solutions for plastic that were perfect, carbon-zero, regenerative, socially and environmentally responsible and economically viable. Of course, this is not currently the case, and the avalanche of plastic has been gathering pace for decades. Since plastic became widely commercialised in the mid-20th century, the world has produced over 10 billion tonnes and thrown away almost 8 billion tonnes. Of the plastic in the UK, 37% has been sent for recycling, 44% incinerated for energy recovery, and 19% has gone to landfill. Even today, existing technologies have significant drawbacks and only 20% of plastics worldwide are recycled compared to 80% of steel. It is therefore important to consider that recycling alone cannot be the solution for the plastic waste problem, and we must also prioritise reduction and reuse. However, like waste collection and management, engaging in recycling is better than not as it generally conserves energy, emissions and resources. What are the current methods of recycling for plastics? Mechanical The most common form is mechanical recycling, in which plastic is sorted into various types, then washed, shredded, melted and re-extruded into pellets to manufacture new products. This method generally consumes less energy and emits less CO2 than producing virgin plastic. Whilst mechanical recycling is usually considered to be the most cost-effective method of recycling plastic, the problem is that the separation of different plastic streams is never perfect, and, because each stream is always likely to be contaminated with other types of plastic, food residues or dirt, the chemical properties of recycled pellets will be inferior to those of the virgin material. This causes ‘downcycling’, in which food-grade plastic is recycled into (say) car components and those into (say) garden furniture. Typically, virgin plastic will go through only three cycles before ending up in landfill or Energy from Waste (EfW). Chemical and Biological Chemical recycling goes one stage further. Techniques such as pyrolysis and gasification recycle plastic by heating to high temperatures in conditions of low or no oxygen, which degrades the plastic without combustion, producing an oil or gas that can be used to make virgin-quality plastic. Many different types of plastic can be processed simultaneously – including soft plastic, which can’t be recycled mechanically – which reduces the need for sorting. All this goes some way towards solving downcycling. However, chemical recycling is typically energy intensive, although an external renewable energy source could provide the necessary heat. There are encouraging developments in biological and chemical methods which claim to make PET (polyethylene terephthalate- a type of plastic commonly used in food and beverage packaging) recycling entirely circular; this is also being extended to other plastics, alongside upcycling approaches, that seek to apply plastic feedstocks as a source for chemicals, which is encouraging given that PET represents less than 10% of all plastics. Organic Other biological recycling methods include industrial composting or anaerobic digestion, which only applies to a limited set of plastics. While they are a promising way to deal with plastic waste, questions remain about what is left of this plastic and what impact these have once the composted matter is introduced into the soil biome. So, existing recycling technologies either fail to conserve molecules and avoid greenhouse gas (GHG) emissions for long or are energy-intensive and expensive. What do the public think of recycling? In the UK, public attitudes towards plastic recycling suggest we must deliver on public expectations of what good recycling might look like. The results of our 2022 YouGov survey suggest there is a desire for recycling to be more efficient, easier to understand or simpler to undertake, and most importantly, for recycling our plastic to be globally, socially and environmentally responsible. Almost 9 in 10 people (87%) think that, as a society, we should be looking into better ways to recycle. Just over 8 in 10 people (82%) think recycling should be completed in the UK, and we shouldn’t send our waste abroad. Almost 3 in 4 people (74%) admit that it is hard to understand exactly what plastic can or can’t be put in recycling bins. So, why bother? What does the future look like? Whilst recycling practices and infrastructure are still developing, it is still an essential step towards creating a greener future, as long as it is used in collaboration with reduction and reuse. As technology improves, engagement with recycling from the general public will be essential to its investment and successful delivery. At the University of Birmingham Plastics Network, we are passionate about finding solutions for an improved approach to plastics recycling in the UK. We are running a policy commission to gather evidence which will inform recommendations to the UK government in this area, among others, across the plastics lifecycle, taking into account environmental, social, economic and political impacts to ensure that future policy is well considered and avoids unintended consequences. What can I do at home and in the workplace to make a difference? At the University of Birmingham, there are a range of ways you can engage with recycling plastics and other materials on campus. Recycle Now, one of the citizen-facing brands brought to you by the Waste & Resources Action Programme (WRAP), has produced a series of helpful guidelines for engaging with recycling; take a look! To read more about our work on the plastics problem, and to see references for all figures in this article, please read our Call to Action report.","filter_flag":1}
{"title":"Du exemplifies commitment to sustainability, innovation, and digitalisation at GITEX Global 2023 - ZAWYA","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMinQFodHRwczovL3d3dy56YXd5YS5jb20vZW4vcHJlc3MtcmVsZWFzZS9jb21wYW5pZXMtbmV3cy9kdS1leGVtcGxpZmllcy1jb21taXRtZW50LXRvLXN1c3RhaW5hYmlsaXR5LWlubm92YXRpb24tYW5kLWRpZ2l0YWxpc2F0aW9uLWF0LWdpdGV4LWdsb2JhbC0yMDIzLXM2cDhvYjhu0gGjAWh0dHBzOi8vd3d3Lnphd3lhLmNvbS9lbi9wcmVzcy1yZWxlYXNlL2NvbXBhbmllcy1uZXdzL2R1LWV4ZW1wbGlmaWVzLWNvbW1pdG1lbnQtdG8tc3VzdGFpbmFiaWxpdHktaW5ub3ZhdGlvbi1hbmQtZGlnaXRhbGlzYXRpb24tYXQtZ2l0ZXgtZ2xvYmFsLTIwMjMtczZwOG9iOG4_YW1wPTE?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMinQFodHRwczovL3d3dy56YXd5YS5jb20vZW4vcHJlc3MtcmVsZWFzZS9jb21wYW5pZXMtbmV3cy9kdS1leGVtcGxpZmllcy1jb21taXRtZW50LXRvLXN1c3RhaW5hYmlsaXR5LWlubm92YXRpb24tYW5kLWRpZ2l0YWxpc2F0aW9uLWF0LWdpdGV4LWdsb2JhbC0yMDIzLXM2cDhvYjhu0gGjAWh0dHBzOi8vd3d3Lnphd3lhLmNvbS9lbi9wcmVzcy1yZWxlYXNlL2NvbXBhbmllcy1uZXdzL2R1LWV4ZW1wbGlmaWVzLWNvbW1pdG1lbnQtdG8tc3VzdGFpbmFiaWxpdHktaW5ub3ZhdGlvbi1hbmQtZGlnaXRhbGlzYXRpb24tYXQtZ2l0ZXgtZ2xvYmFsLTIwMjMtczZwOG9iOG4_YW1wPTE?oc=5","id":"CBMinQFodHRwczovL3d3dy56YXd5YS5jb20vZW4vcHJlc3MtcmVsZWFzZS9jb21wYW5pZXMtbmV3cy9kdS1leGVtcGxpZmllcy1jb21taXRtZW50LXRvLXN1c3RhaW5hYmlsaXR5LWlubm92YXRpb24tYW5kLWRpZ2l0YWxpc2F0aW9uLWF0LWdpdGV4LWdsb2JhbC0yMDIzLXM2cDhvYjhu0gGjAWh0dHBzOi8vd3d3Lnphd3lhLmNvbS9lbi9wcmVzcy1yZWxlYXNlL2NvbXBhbmllcy1uZXdzL2R1LWV4ZW1wbGlmaWVzLWNvbW1pdG1lbnQtdG8tc3VzdGFpbmFiaWxpdHktaW5ub3ZhdGlvbi1hbmQtZGlnaXRhbGlzYXRpb24tYXQtZ2l0ZXgtZ2xvYmFsLTIwMjMtczZwOG9iOG4_YW1wPTE","guidislink":false,"published":"Fri, 20 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=293, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinQFodHRwczovL3d3dy56YXd5YS5jb20vZW4vcHJlc3MtcmVsZWFzZS9jb21wYW5pZXMtbmV3cy9kdS1leGVtcGxpZmllcy1jb21taXRtZW50LXRvLXN1c3RhaW5hYmlsaXR5LWlubm92YXRpb24tYW5kLWRpZ2l0YWxpc2F0aW9uLWF0LWdpdGV4LWdsb2JhbC0yMDIzLXM2cDhvYjhu0gGjAWh0dHBzOi8vd3d3Lnphd3lhLmNvbS9lbi9wcmVzcy1yZWxlYXNlL2NvbXBhbmllcy1uZXdzL2R1LWV4ZW1wbGlmaWVzLWNvbW1pdG1lbnQtdG8tc3VzdGFpbmFiaWxpdHktaW5ub3ZhdGlvbi1hbmQtZGlnaXRhbGlzYXRpb24tYXQtZ2l0ZXgtZ2xvYmFsLTIwMjMtczZwOG9iOG4_YW1wPTE?oc=5\" target=\"_blank\">Du exemplifies commitment to sustainability, innovation, and digitalisation at GITEX Global 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ZAWYA<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Du exemplifies commitment to sustainability, innovation, and digitalisation at GITEX Global 2023 - ZAWYA","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinQFodHRwczovL3d3dy56YXd5YS5jb20vZW4vcHJlc3MtcmVsZWFzZS9jb21wYW5pZXMtbmV3cy9kdS1leGVtcGxpZmllcy1jb21taXRtZW50LXRvLXN1c3RhaW5hYmlsaXR5LWlubm92YXRpb24tYW5kLWRpZ2l0YWxpc2F0aW9uLWF0LWdpdGV4LWdsb2JhbC0yMDIzLXM2cDhvYjhu0gGjAWh0dHBzOi8vd3d3Lnphd3lhLmNvbS9lbi9wcmVzcy1yZWxlYXNlL2NvbXBhbmllcy1uZXdzL2R1LWV4ZW1wbGlmaWVzLWNvbW1pdG1lbnQtdG8tc3VzdGFpbmFiaWxpdHktaW5ub3ZhdGlvbi1hbmQtZGlnaXRhbGlzYXRpb24tYXQtZ2l0ZXgtZ2xvYmFsLTIwMjMtczZwOG9iOG4_YW1wPTE?oc=5\" target=\"_blank\">Du exemplifies commitment to sustainability, innovation, and digitalisation at GITEX Global 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ZAWYA<\/font>","source.href":"https:\/\/www.zawya.com","source.title":"ZAWYA","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"The showcases at GITEX demonstrated du's advancements in technology solutions in manufacturing, farming, education, healthcare, telecommunications, recycling, and banking. Strategic collaborations were announced with organisations such as Dubai Municipality, Microsoft, and Emirates NBD to foster innovation and develop digital solutions. du launched an ICT marketplace in partnership with Cloud Blue, offering swift enablement of new products and faster time-to-market for customers. Dubai, UAE:– du, from Emirates Integrated Telecommunications Company (EITC), made a powerful impact at GITEX Global 2023, which took place in Dubai between October 16 and 20, 2023. Under the theme \"Shaping a Sustainable Tomorrow Through Advanced Technology,\" du showcased their dedication to sustainability, innovation, and digitalisation, aligning their efforts with the UAE's vision for a sustainable future. du's participation revolved around three key pillars: Technology, Innovation and Connectivity, and Sustainability. Each pillar represented their commitment to utilising technology for societal betterment, revolutionising industries, and fostering sustainable practices. The Technology pillar harnessed cutting-edge solutions to create a better society. Innovation and Connectivity were driving forces behind du's efforts to empower businesses and government entities. Sustainability remained a core focus throughout the event, with du constructing the stand with recyclable materials and enhancing sustainability with a 40% increase in greenery, adding aesthetic value to the overall design. du's showcases attracted multiple VIP visitors who visited du's stand to witness the cutting-edge technologies and innovations. Fahad Al Hassawi, CEO of du, stated: \"In line with our commitment to driving positive change and harnessing the power of technology, our participation at GITEX Global 2023 highlighted our commitment to sustainability, innovation, and digitalisation. We showcased our latest advancements in sustainable technology solutions, demonstrating their potential to create a greener future. The visit of distinguished VIPs further reinforced the significance of our showcases in Future Factory and Smart Agriculture, captivating their interest and showcasing our transformative impact. Through strategic partnerships with industry leaders, we explored collaborative opportunities to accelerate the digital transformation journey for businesses and contribute to the UAE's strategic vision for a sustainable tomorrow.\" With a diverse range of showcases, du captivated visitors and demonstrated their commitment to sustainability, innovation, and digitalisation: Rethinking Manufacturing: The Future Factory showcase highlighted the integration of technologies such as robotics, automation, IoT, AI and ML in the manufacturing industry to promote sustainability and Industry 4.0. The showcase aimed to revolutionise the defense industry manufacturing sector. Maximising Efficiency and Sustainability: The Future of Farming and Agriculture showcase focused on smart farming and agricultural technology, utilising agritech, IoT, ML, AI, and drones to enhance efficiency and promote sustainable practices. Transforming Recreation Spaces: The Future of Parks showcase showcased an innovative ICT digital platform for government entities involved in recreation and wellness, particularly Dubai Municipality. With features like ticketless entry and streamlined identity management processes, this platform aimed to enhance park experiences while prioritising worker satisfaction, tech skills, and sustainability. Empowering the Next Generation: The Future of Education showcase introduced CHATGPT, a virtual tutor on campus, and 3D screen tech skills, leveraging technologies like generative AI, Microsoft Azure, Celebal Technologies, and Huawei. Advancing Healthcare Solutions: The Future of Wellness and Healthcare showcase demonstrated a one-stop geriatric assessment center and 4D organ simulation before procedures, using technologies like IoT, AI, and digital twinning to improve patient care. Sustainable Connectivity: The Future of Telco showcase emphasised sustainable connectivity, featuring a mobile tower with a solar panel installation. Transforming Recycling Practices: The Connected Recycling (Reverse Supply Chain) showcase aimed to develop a global end-to-end marketplace solution for digitalising and connecting reverse supply chains. With a focus on sustainability, the showcase showcased the use of 5G M2M sensors. Unlocking Business Potential: Amani the AI Business Enabler showcase focused on AI business enablement, highlighting technologies like AI, blockchain, sustainability, and AI cloud. Startups and SMEs in digital economies were the target vertical for this showcase. Enhancing Security in Banking: API Fraud Detection and Identity Management showcase presented innovative API technology for fraud detection and identity management in the banking sector, leveraging AI and cloud. In alignment with the sustainability and digitalisation objectives set by the UAE government, du seized the opportunity to announce strategic collaborations at the event. Among the key organisations, du partnered with Dubai Municipality for their Destination & More project for public parks, Microsoft to drive digital transformation, and Emirates NBD to host full IT systems in Tier III data centers. These partnerships sought to create an environment conducive to innovation, collaboration, and the development of digital solutions that would propel the parks and recreation sector to new heights. Moreover, du solidified its commitment to advancing technology, corporate social responsibility (CSR), and enterprise by signing several Memorandums of Understanding (MoUs). In a significant move, du also launched an ICT marketplace in partnership with CloudBlue. This cutting-edge marketplace, hosted on Azure within the UAE, promises a range of remarkable features. It allows for the swift enablement of new products and offerings, ensuring a faster time-to-market for customers. GITEX Global 2023 was a resounding success for du, providing opportunities for future partnerships and new customers interested in support for their digital transformation. The showcases reinforced du's position at the forefront of technology and connectivity, extending beyond the realm of telecommunications. As a result of their participation, du is one step closer to fulfilling their core objective of being the leading digital telco. Looking forward to next year, they are excited to continue driving positive change through technological advancements at GITEX Global. For more information, please visit www.du.ae -Ends- About du Operating under the steadfast umbrella of Emirates Integrated Telecommunications Company (EITC), du is an integral driver of the UAE’s economic, social and digital transformation. Thriving on digitally innovating all facets of the contemporary telecom experience, we touch the lives of millions of customers everyday as a dedicated enabler of connectivity, continuity and growth across consumer and enterprise segments. Whether delivering state-of-the-art Smart City infrastructure, bespoke enterprise ICT solutions, government communications, secure data solutions, or the very best in home entertainment and value, we are a reliable telco and ICT player shaping the future of communication for a more connected tomorrow. http:\/\/du.ae","filter_flag":1}
{"title":"Bus Éireann transforms recycled bottles into uniforms - RTE.ie","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LnJ0ZS5pZS9uZXdzL2J1c2luZXNzLzIwMjMvMTAxMi8xNDEwNDUzLWJ1cy1laXJlYW5uLXRyYW5zZm9ybXMtcmVjeWNsZWQtYm90dGxlcy1pbnRvLXVuaWZvcm1zL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LnJ0ZS5pZS9uZXdzL2J1c2luZXNzLzIwMjMvMTAxMi8xNDEwNDUzLWJ1cy1laXJlYW5uLXRyYW5zZm9ybXMtcmVjeWNsZWQtYm90dGxlcy1pbnRvLXVuaWZvcm1zL9IBAA?oc=5","id":"CBMiaWh0dHBzOi8vd3d3LnJ0ZS5pZS9uZXdzL2J1c2luZXNzLzIwMjMvMTAxMi8xNDEwNDUzLWJ1cy1laXJlYW5uLXRyYW5zZm9ybXMtcmVjeWNsZWQtYm90dGxlcy1pbnRvLXVuaWZvcm1zL9IBAA","guidislink":false,"published":"Thu, 12 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=285, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LnJ0ZS5pZS9uZXdzL2J1c2luZXNzLzIwMjMvMTAxMi8xNDEwNDUzLWJ1cy1laXJlYW5uLXRyYW5zZm9ybXMtcmVjeWNsZWQtYm90dGxlcy1pbnRvLXVuaWZvcm1zL9IBAA?oc=5\" target=\"_blank\">Bus Éireann transforms recycled bottles into uniforms<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RTE.ie<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bus Éireann transforms recycled bottles into uniforms - RTE.ie","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LnJ0ZS5pZS9uZXdzL2J1c2luZXNzLzIwMjMvMTAxMi8xNDEwNDUzLWJ1cy1laXJlYW5uLXRyYW5zZm9ybXMtcmVjeWNsZWQtYm90dGxlcy1pbnRvLXVuaWZvcm1zL9IBAA?oc=5\" target=\"_blank\">Bus Éireann transforms recycled bottles into uniforms<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RTE.ie<\/font>","source.href":"https:\/\/www.rte.ie","source.title":"RTE.ie","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Repak said today that Team Green Member Bus Éireann has achieved a milestone in its sustainability strategy by using its 150,000th recycled plastic bottle in the design and creation of its staff uniforms. Bus Éireann announced its first uniform redesign in more than a decade just 22 months ago. Repak today launched its new Team Green Most Valuable Players campaign which focuses on innovative organisational recycling practices created by Repak Team Green supporters. The aim of the campaign is to inspire other organisations to join Team Green and publicly commend those helping Ireland get to 50% of all plastic recycled by 2025 by showcasing their work. Repak said that the components of the Bus Éireann uniform are made from ethically sourced and recycled materials. The polyester used in the uniforms is made from recycled plastic bottles and each uniform prevents 20 plastic bottles going to landfill. Since Repak Team Green launched in 2018, the collective efforts of the public to recycle has resulted in an increase of recycled plastic packaging tonnes by 32% or 25,720 tonnes. The theme of the campaign is to \"Re-Imagine\" and has been created to help consumers understanding of how recycled plastic can be made into many different products and materials if recycled correctly. Seamus Clancy, CEO of Repak, said the use of plastic bottles in Bus Éireann's driver uniforms is a fantastic example of what can be done when we re-imagine our relationship with plastic to create a more circular future. \"Using recycled materials to create new uniforms is a great incentive to reimagine how we deal with packaging and we hope that this effort inspires others to follow suit,\" he said. But he said that despite the achievements made by Repak Members and other businesses, attaining the 2025 EU plastic packaging recycling targets remains a formidable challenge for Ireland. \"Forecasts indicate that Ireland will miss its national plastic target. If all organisations in Ireland focused on recycling their plastic and being innovative in their approach, Ireland would make significant progress to meet these targets,\" he added.","filter_flag":1}
{"title":"Greenham unveils new state of the art Tongala beef plant + PICTURES | - Beef Central","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmJlZWZjZW50cmFsLmNvbS9wcm9jZXNzaW5nL2dyZWVuaGFtLXVudmVpbHMtbmV3LXN0YXRlLW9mLXRoZS1hcnQtdG9uZ2FsYS1iZWVmLXBsYW50LXBpY3R1cmVzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmJlZWZjZW50cmFsLmNvbS9wcm9jZXNzaW5nL2dyZWVuaGFtLXVudmVpbHMtbmV3LXN0YXRlLW9mLXRoZS1hcnQtdG9uZ2FsYS1iZWVmLXBsYW50LXBpY3R1cmVzL9IBAA?oc=5","id":"CBMiaWh0dHBzOi8vd3d3LmJlZWZjZW50cmFsLmNvbS9wcm9jZXNzaW5nL2dyZWVuaGFtLXVudmVpbHMtbmV3LXN0YXRlLW9mLXRoZS1hcnQtdG9uZ2FsYS1iZWVmLXBsYW50LXBpY3R1cmVzL9IBAA","guidislink":false,"published":"Mon, 09 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=282, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmJlZWZjZW50cmFsLmNvbS9wcm9jZXNzaW5nL2dyZWVuaGFtLXVudmVpbHMtbmV3LXN0YXRlLW9mLXRoZS1hcnQtdG9uZ2FsYS1iZWVmLXBsYW50LXBpY3R1cmVzL9IBAA?oc=5\" target=\"_blank\">Greenham unveils new state of the art Tongala beef plant + PICTURES |<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Beef Central<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Greenham unveils new state of the art Tongala beef plant + PICTURES | - Beef Central","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmJlZWZjZW50cmFsLmNvbS9wcm9jZXNzaW5nL2dyZWVuaGFtLXVudmVpbHMtbmV3LXN0YXRlLW9mLXRoZS1hcnQtdG9uZ2FsYS1iZWVmLXBsYW50LXBpY3R1cmVzL9IBAA?oc=5\" target=\"_blank\">Greenham unveils new state of the art Tongala beef plant + PICTURES |<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Beef Central<\/font>","source.href":"https:\/\/www.beefcentral.com","source.title":"Beef Central","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Victorian red meat processor HW Greenham & Sons officially opened its new state of the art Tongala beef plant on Saturday, bringing new employment and cattle supply opportunities to Victoria’s Murray Plains region. The event signifies not only a major achievement for Greenham, a sixth generation family-owned processing business, but also heralds a new era of economic opportunity for the local community. The initiative marks the first new processing facility built in Victoria since the 1990s. The project’s design focuses on animal welfare, safety, and zero-waste carcase utilisation. Saturday’s opening event was a diverse celebration attended by international and domestic beef customers, local livestock producers and members of the local community. The facility was officially opened by local Federal MP for Nicholls Sam Birrell. The Federal government supported the project through a $10 million grant under the Modern Manufacturing Initiative. “Greenham’s sustainable and efficient production is world-leading, and their commitment to this facility showcases confidence in the food bowl of Australia and its farmers, Mr Birrell said. “The impact of this project has been significant through the use of local contractors, and the investment will continue to yield economic benefits to the region through increased processing efficiency and employment.” The journey at Tongala began in 1993, and 30 years later in 2023, Greenham has ushered in a new era with its multi-million-dollar investment into the complete redevelopment of the Tongala site. Read this earlier Beef Central article for details about the project. The transformation has greatly enhanced the plant’s processing capabilities, with a new processing capacity of 1050 cattle per day. The site will create an additional 230 jobs upon reaching total capacity. See Beef Central’s earlier article last week about the confluence of four new processing plants kicking off at a similar time in southern Australia. The plant’s expanded capabilities now allow it to process a variety of cattle types, including the ability to handle high-quality cattle designed to produce chilled beef, providing new opportunities for the region’s cattle suppliers. Greenham managing director Peter Greenham told the official opening the new facility represented a pivotal moment for his company. “Greenham’s dedication to branding and marketing ensures that these exceptional cattle products make their way onto menus at renowned restaurants worldwide, further enhancing the reputation of these premium offerings,” he said. “Leveraging the latest technology, we are poised to deliver exceptional beef to consumers worldwide in a way that’s sustainable and efficient.” Among the many investments made during the upgrade, the facility boasts 1000 solar panels, harnessing clean and renewable solar energy, while also utilising co-generation systems for electricity and heat capture. Combined, these provide 70 percent of the plant’s energy needs, and upgraded water recycling capabilities are reducing water consumption by up to 30pc. These efforts aligned with Greenham’s commitment to sustainability and environmental responsibility, including advanced water recycling practices, the opening audience was told. The facility also features substantially increased freezing capacity to meet global export demands. “Greenham can extract the most value out of every animal with state-of-the-art trim management systems and cutting-edge technology to process all parts of the animal,” Mr Greenham said during the opening. Value-adding is another focus, with precise portioning for retail and the development of new products and brands. Following a soft-start mid-year, Tongala has focussed on refining processes and systems, reaching a projected capacity of 700 cattle per day by Christmas before building to its full projected capacity of 1050 cattle per day by May 2024. As the new facility ramps up production, Greenham invites skilled and unskilled individuals to join its team and contribute to the company’s progress. “As we expand our operations at the new facility, we will continue to run both shifts at Tongala’s existing hot boning facility to meet the requirements of our suppliers of cows and bulls,” Greenham said in an earlier statement. Expanded brand capability Greenham’s Tasmanian and Gippsland operations have built a strong portfolio of premium beef brands, including Cape Grim Beef, Bass Strait, Wanderer and Pure Black Barley Fed Angus. With the addition of the new Tongala facility, Greenham expands its processing capabilities, increasing the supply of existing brands while also creating opportunities for the launch of new products and brands. “Our investment in the Tongala facility will see us here for another 30 years and continue our commitment to our employees, local producers and the community,” Peter Greenham told Saturday’s launch gathering.","filter_flag":1}
