{"title":"Otsuka Pharmaceutical Finalizes Agreement with Naruto City and Toyota Tsusho Corporation to Promote Horizontal ... - otsuka.co.jp","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3Lm90c3VrYS5jby5qcC9lbi9jb21wYW55L25ld3NyZWxlYXNlcy8yMDIzLzIwMjMwMjEwXzEuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3Lm90c3VrYS5jby5qcC9lbi9jb21wYW55L25ld3NyZWxlYXNlcy8yMDIzLzIwMjMwMjEwXzEuaHRtbNIBAA?oc=5","id":"CBMiRWh0dHBzOi8vd3d3Lm90c3VrYS5jby5qcC9lbi9jb21wYW55L25ld3NyZWxlYXNlcy8yMDIzLzIwMjMwMjEwXzEuaHRtbNIBAA","guidislink":false,"published":"Fri, 10 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=41, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3Lm90c3VrYS5jby5qcC9lbi9jb21wYW55L25ld3NyZWxlYXNlcy8yMDIzLzIwMjMwMjEwXzEuaHRtbNIBAA?oc=5\" target=\"_blank\">Otsuka Pharmaceutical Finalizes Agreement with Naruto City and Toyota Tsusho Corporation to Promote Horizontal ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">otsuka.co.jp<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Otsuka Pharmaceutical Finalizes Agreement with Naruto City and Toyota Tsusho Corporation to Promote Horizontal ... - otsuka.co.jp","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3Lm90c3VrYS5jby5qcC9lbi9jb21wYW55L25ld3NyZWxlYXNlcy8yMDIzLzIwMjMwMjEwXzEuaHRtbNIBAA?oc=5\" target=\"_blank\">Otsuka Pharmaceutical Finalizes Agreement with Naruto City and Toyota Tsusho Corporation to Promote Horizontal ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">otsuka.co.jp<\/font>","source.href":"https:\/\/www.otsuka.co.jp","source.title":"otsuka.co.jp","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Otsuka Pharmaceutical Finalizes Agreement with Naruto City and Toyota Tsusho Corporation to Promote Horizontal Recycling of PET bottles Otsuka Pharmaceutical Co., Ltd. (Otsuka) has finalized a collaborative agreement with Naruto City (Tokushima Prefecture, Japan; Mayor: Michihiko Izumi) and Toyota Tsusho Corporation (Head office: Nagoya, Japan; President: Ichiro Kashitani) aiming to contribute to realization of a sustainable society through promotion of horizontal \"bottle-to-bottle\" recycling of PET bottles. The agreement was finalized on February 9, 2023. ■Objectives of Collaboration 1 Used PET bottles collected from the municipality will be recycled as resin for production of PET bottles with the aim of promoting Japan-based bottle-to-bottle resource circulation (horizontal recycling). 2 The three participating entities will collaborate for collection, manufacturing, and sales, aiming to promote effective circulation of resources and contribute to the realization of a sustainable environment, economy, and society. 3 This new approach to resource recycling will be launched in Naruto City, Japan, where Otsuka was founded, in order to contribute to achieving a circular economy*1, identified as a material issue in the environmental policies adopted by the Otsuka group of companies. From the perspectives of limiting use of petroleum-based materials and promoting resource circulation, the soft drink industry*2 is working to develop horizontal bottle-to-bottle recycling, in which used PET bottles are reproduced as PET bottles for re-use. Previously, PET bottles discarded by households have been recycled as food packaging trays, textiles, and other items, while bottles that didn't meet the quality requirements for recycling were incinerated. However, recent technological innovations have made it possible to create high quality recycled PET material from used PET bottles, leading to increased adoption of horizontal bottle-to-bottle recycling initiatives. With this technology, semi-permanent recycling of PET bottles becomes a possibility. Resulting reductions in consumption of petroleum-based resources and decreased CO 2 emissions are expected to reduce the overall environmental impact of business activities. . With achievement of a circular economy defined as one of the material issues addressed by the Otsuka group's environmental policy, the Otsuka Group Plastic Policy*3 was formulated with the aim of developing containers and packaging suitable for a sustainable society. In collaboration with stakeholders, Otsuka group companies are engaged in various efforts to achieve environmental goals*4. Through collection of used PET bottles for production of PET bottles, this collaborative agreement represents a yet another step toward realization of a sustainable society. After launching this initiative in Naruto City, the birthplace of the Otsuka group of companies, Otsuka will continue to develop new initiatives to achieve a circular economy. *1 Use of sustainable materials *2 Japan Soft Drink Association: http:\/\/www.j-sda.or.jp\/about-jsda\/english.php *3 Otsuka Group Plastic Policy: https:\/\/www.otsuka.com\/en\/csr\/environment\/plastic.html *4 Otsuka Group Environmental Vision: https:\/\/www.otsuka.com\/en\/csr\/environment\/ Reference * Otsuka Group's Environmental Policy: https:\/\/www.otsuka.com\/en\/csr\/environment\/ * Otsuka Group Plastic Policy: https:\/\/www.otsuka.com\/en\/csr\/environment\/plastic.html","filter_flag":1}
{"title":"ACI responds to NY law limiting solvent in personal care products - CosmeticsDesign.com USA","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi5jb20vQXJ0aWNsZS8yMDIzLzAyLzIwL2FjaS1yZXNwb25kcy10by1ueS1sYXctbGltaXRpbmctc29sdmVudC1pbi1wZXJzb25hbC1jYXJlLXByb2R1Y3Rz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi5jb20vQXJ0aWNsZS8yMDIzLzAyLzIwL2FjaS1yZXNwb25kcy10by1ueS1sYXctbGltaXRpbmctc29sdmVudC1pbi1wZXJzb25hbC1jYXJlLXByb2R1Y3Rz0gEA?oc=5","id":"CBMidGh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi5jb20vQXJ0aWNsZS8yMDIzLzAyLzIwL2FjaS1yZXNwb25kcy10by1ueS1sYXctbGltaXRpbmctc29sdmVudC1pbi1wZXJzb25hbC1jYXJlLXByb2R1Y3Rz0gEA","guidislink":false,"published":"Mon, 20 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=20, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=51, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi5jb20vQXJ0aWNsZS8yMDIzLzAyLzIwL2FjaS1yZXNwb25kcy10by1ueS1sYXctbGltaXRpbmctc29sdmVudC1pbi1wZXJzb25hbC1jYXJlLXByb2R1Y3Rz0gEA?oc=5\" target=\"_blank\">ACI responds to NY law limiting solvent in personal care products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign.com USA<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ACI responds to NY law limiting solvent in personal care products - CosmeticsDesign.com USA","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi5jb20vQXJ0aWNsZS8yMDIzLzAyLzIwL2FjaS1yZXNwb25kcy10by1ueS1sYXctbGltaXRpbmctc29sdmVudC1pbi1wZXJzb25hbC1jYXJlLXByb2R1Y3Rz0gEA?oc=5\" target=\"_blank\">ACI responds to NY law limiting solvent in personal care products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign.com USA<\/font>","source.href":"https:\/\/www.cosmeticsdesign.com","source.title":"CosmeticsDesign.com USA","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Last year, New York state passed a law limiting trace amounts of 1,4-dioxane, an organic solvent, in detergent products including cosmetics and personal care products. While 1,4-dioxane is not a product ingredient but a by-product of the manufacturing process, the New York state legislature has still implemented regulations regarding its presence in consumer products. The law, which went into effect on December 31, 2022, has caused some confusion for manufacturers and suppliers to the beauty care industry. In response to the new law, the American Cleaning Institute (ACI), a trade organization representing the interests of U.S. cleaning product manufacturers and suppliers, has co-authored a study exploring different methods to assess 1,4-dioxane levels in commercial products available for consumer consumption. To learn more about 1,4-dioxane, the study’s results, and the law’s potential impact on the cosmetics and personal care product industries, CosmeticsDesign spoke with Kathleen Stanton, M.S., Associate Vice President, Technical & International Affairs at the ACI and Douglas G. Hayes, PhD, MBA Institute Professor at the Department of Biosystems Engineering and Soil Science in University of Tennessee and Editor-in-Chief, Journal of Surfactants and Detergents​ for their insights. Both Kathleen and Doug served as panelists for a workshop on 1,4-dioxane in September 2019 that was hosted by the California EPA, Department of Toxic Substances Control and began discussions on preparing a review paper together, which led to the recently published paper in JSD​. CDU​: What is 1,4-dioxane, and what are its current practical applications in personal care and\/or cosmetics products? Stanton\/Hayes: ​1,4-Dioxane is a polar organic solvent that is used for a few industrial applications, such as serving as a stabilizer for 1,1,1-trichloroethane and other chlorinated solvents. However, it is an irritant and a possible human carcinogen. Its presence in personal care, home care, and cosmetic products, at ppb-to-ppm levels, is therefore unintentional. 1,4-Dioxane is a minor by-product that is formed during the synthesis of sodium lauryl ether sulfate (SLES), a surfactant that is a component of several home care personal care, and cosmetic products, and to a lesser extent in fatty alcohol and fatty acid ethoxylate surfactants. CDU​: What are the most common ways 1,4-dioxane makes its way into ground\/drinking water supplies? Stanton\/Hayes: ​1,4-Dioxane enters municipal wastewater treatment facilities due to its presence in home and personal care and cosmetic products. Because of its high solubility in water, 1,4-dioxane is difficult to remove by municipal facilities. And its very low concentration in consumer products makes its capture and mitigation in wastewater purification facilities difficult and impractical. In addition, 1,4-dioxane is poorly biodegradable and difficult to break down, which leads to its persistence in water, particularly in groundwater. Most of the 1,4-dioxane pollution that exists occurred decades ago. Surfactant manufacturers have improved their manufacturing processes over the last 20 years to reduce the formation of 1,4-dioxane. CDU​: What types of testing can confirm 1,4-dioxane contamination? Stanton\/Hayes: ​1,4-Dioxane occurs at ppb-ppm levels in groundwater and waterways, which limits its detection to chromatographic analysis using the same approaches we discuss for home and personal care and cosmetic products in our JSD ​review paper. CDU​: What methods or techniques can be used to cleanup contamination? Stanton\/Hayes: ​There is not a robust means to clean up contamination due to 1,4-dioxane. The most significant barriers to mitigation are the low (ppb-ppm) levels of 1,4-dioxane that occur in water and the strong hydrogen bonding network that exists between water and 1,4-dioxane. Several methods are being developed, with Advanced Oxidation Processes (AOP) being the most promising. AOP involves chemical catalysts such as hydrogen peroxide and ozone, photochemical agents, and electrochemical agents. Bioremediation technologies are also under development. CDU​: What are the best ways to reduce exposure to 1,4-dioxane? Stanton\/Hayes: ​1,4-Dioxane contamination is primarily associated with unintended spills, historical disposal practices, and industrial wastewater have been identified as major sources of 1,4-dioxane contamination in surface water and groundwater that may serve as a source of drinking water. 1,4-Dioxane is also present as a minor impurity of SLES and other ethoxylated surfactants. The best approach to reduce exposure is to reduce the release of 1,4-dioxane to the environment, so that drinking water and food sources do not become contaminated. For consumer products, reducing 1,4-dioxane contamination can be achieved by further improving the performance of catalysts used in the industrial manufacturing of SLES. Another approach is to reformulate personal care, home care, and cosmetic products to minimize the amount of SLES and other ethoxylated surfactants employed. CDU​: Per the study, “a recent report stated that 59% of shampoos and 62% of body cleansers contained 1,4-dioxane levels above 1 ppm.” What are the potential long term health concerns associated with long-term use of these products? Stanton\/Hayes: ​The main route for human exposure remains through contamination of drinking water resulting from the release of contaminated water from municipal facilities and the long term accumulation of 1,4-dioxane in groundwater. Although 1,4-dioxane is an irritant to skin, eyes, and nasal passages, exposure through use of personal care, home care, or cosmetic products presents a minor source of internal exposure due to the low concentration of 1,4-dioxane in these products. The US EPA (2020) has evaluated 8 consumer uses of surface cleaners, laundry\/dishwashing detergents, paint\/floor lacquer, etc. where 1,4-dioxane is present as a byproduct and found no unreasonable risks. The chronic cancer risk was determined for surface cleaners, laundry, and dishwashing products. CDU​: Are there any alternatives to 1,4-dioxane currently in development, or already available for personal care product manufacturers to reformulate? If so, are there increased or decreased costs associated with utilizing alternative solvents in cosmetics\/personal beauty care products? Stanton\/Hayes: ​To reformulate a product so that SLES and other ethoxylate surfactants are replaced or their concentration is minimized, one must realize that there is not a “drop-in” replacement for these. The most promising approach is to employ surfactant mixtures, such as anionic surfactant \/ nonionic surfactant mixtures, since there can be synergy in surface activity for the surfactant mixtures compared to the neat surfactants. Reformulating products that contain surfactants and numerous other ingredients is quite challenging; but improved models that predictive wetting, coating, and emulsification activity of surfactants and their mixtures has reduced the time and labor required. Replacing SLES with a surfactant mixture may create new problems, such as instability at different temperatures, reduced foaming, differences in consumer perceptions, and the like. Therefore, there are labor and supply costs involved with the research and development of new formulations. The production cost for the new formulation may be higher or lower than the previous formulation, depending on the costs involved with the ingredients and the labor involved with manufacturing. CDU​: Natural personal beauty care products are a current industry trend. Are there any natural alternatives to 1,4-dioxane? Stanton\/Hayes: ​ Surfactant mixtures are promising alternatives to SLES and other ethoxylate surfactants. There are many biobased surfactants (i.e., surfactants whose building blocks are derived from natural resources) that can be used in formulations for surfactant mixtures. Glycolipid biosurfactants, such as sophorolipids or rhamnolipids, possess excellent surface activity and antimicrobial activity and are highly biocompatible and biodegradable. (A biosurfactant is a surfactant obtained directly from nature, particularly from microorganisms.) Similarly, amino acid surfactants serve as a versatile platform of biobased surfactants derived from amino acids and acyl or alkyl group. Amino acid surfactants are excellent emulsifiers, foamers, and antimicrobial agents. Alkyl glucosides are biobased nonionic surfactants commonly used in home and personal care products that have similar emulsification activity as alkyl ethoxylates. Reformulation of products incurs research and development costs and could increase or decrease the cost of the alternative ingredients. Another concern is whether the surfactants described above can be supplied at a rate that will meet demand. CDU​: How are legislators responding regarding regulating, limiting, or eliminating 1,4-dioxane in personal beauty care products? Stanton\/Hayes: ​ As stated in our recent review paper: “On January 1, 2022, the New York Legislature enacted amendments to Environmental Conservation Law (ECL) Articles 35 and 37 to establish limits on the amount of 1,4-dioxane that can be present in household cleansing, personal care, and cosmetic products sold or offered for sale in New York State. Specifically, the maximum allowable concentration of 1,4-dioxane for household cleansing and personal care products is 2 ppm (effective December 31, 2022; 1 ppm after December 31, 2023) and for cosmetics is 10 ppm.” The EPA released a Final Risk Evaluation of 1,4- dioxane in 2022. The report found that, although 1,4-dioxane presented a potential health risk for workers involved with the manufacture of 1,4-dioxane, its presence in commercial products did not “present an unreasonable health risk.” The EPA determined that additional analysis was necessary prior to risk management phase. The EPA is continuing its research on the impact of 1,4-dioxane on drinking water and environmental justice. The California Department of Toxic Substances Control (DTSC) continues to investigate the ecotoxicity of 1,4-dioxane, particularly its impact on water supply systems and the possible aggregate exposure to humans. The Australian Department of Health has identified cosmetics as presenting a potential risk to consumers of cosmetic products because some cosmetic products tested in Australia possess 1,4-dioxane levels above the 10 ppm threshold level. The same agency raised concerns about worker exposure to 1,4-dioxane, aligned with the 2022 EPA report. Per a survey, Germany’s Federal Institute for Occupational Safety and Health (BAuA) proposed a 1 ppm limit for 1,4-dioxane in surfactants CDU​: To your knowledge, have any companies in the personal beauty care space already taken steps to limit or eliminate 1,4-dioxane from their formulations? Stanton\/Hayes: ​Companies that sell personal care products in the State of New York must verify that their products contain at most 2 ppm (1 ppm after December 31, 2023) and at most 10 ppm for cosmetic products hose or show their intention to compliant to these thresholds though the waiver process. These strict requirements require that companies measure 1,4-dioxane concentration in their products and make the necessary adjustment to be compliant.","filter_flag":1}
{"title":"Venterra Farms Launches Sustainably Grown Cannabis Powered by Farming First - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3ZlbnRlcnJhLWZhcm1zLWxhdW5jaGVzLXN1c3RhaW5hYmx5LWdyb3duLWNhbm5hYmlzLXBvd2VyZWQtYnktZmFybWluZy1maXJzdC0zMDE3MzYwNzAuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3ZlbnRlcnJhLWZhcm1zLWxhdW5jaGVzLXN1c3RhaW5hYmx5LWdyb3duLWNhbm5hYmlzLXBvd2VyZWQtYnktZmFybWluZy1maXJzdC0zMDE3MzYwNzAuaHRtbNIBAA?oc=5","id":"CBMigwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3ZlbnRlcnJhLWZhcm1zLWxhdW5jaGVzLXN1c3RhaW5hYmx5LWdyb3duLWNhbm5hYmlzLXBvd2VyZWQtYnktZmFybWluZy1maXJzdC0zMDE3MzYwNzAuaHRtbNIBAA","guidislink":false,"published":"Wed, 01 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=1, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=32, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3ZlbnRlcnJhLWZhcm1zLWxhdW5jaGVzLXN1c3RhaW5hYmx5LWdyb3duLWNhbm5hYmlzLXBvd2VyZWQtYnktZmFybWluZy1maXJzdC0zMDE3MzYwNzAuaHRtbNIBAA?oc=5\" target=\"_blank\">Venterra Farms Launches Sustainably Grown Cannabis Powered by Farming First<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Venterra Farms Launches Sustainably Grown Cannabis Powered by Farming First - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3ZlbnRlcnJhLWZhcm1zLWxhdW5jaGVzLXN1c3RhaW5hYmx5LWdyb3duLWNhbm5hYmlzLXBvd2VyZWQtYnktZmFybWluZy1maXJzdC0zMDE3MzYwNzAuaHRtbNIBAA?oc=5\" target=\"_blank\">Venterra Farms Launches Sustainably Grown Cannabis Powered by Farming First<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Founded by Fifth Generation Farmers, Venterra Farms Combines Indoor Grow Technology with Outdoor Sustainability for High-Quality, Eco-Friendly Cannabis Products VENTURA, Calif., Feb. 1, 2023 \/PRNewswire\/ -- California cannabis company Farming First, LLC (\"The Company\") today announced the launch of Venterra Farms, a sustainably grown cannabis brand on a mission to cultivate joy. Founded by farmers who have been working the land off the Central Coast of California for five generations, the Venterra Farms is dedicated to producing the highest quality cannabis products while also being mindful of the environment. \"Venterra Farms is rooted in the belief that cannabis should be grown with care and attention.\" Post this Introducing Venterra Farms, a new cannabis brand from Farming First, LLC. The Company's proprietary \"hybrid farming\" approach combines the best of indoor growing technology with the sustainability and cost efficiency of sun-grown outdoor cultivation. The result is an enhanced version of premium 'light-dep' cannabis. \"We are excited to bring our passion for farming and commitment to sustainability to the cannabis industry with our first consumer brand, Venterra Farms,\" said Jered Micheli, Director of Agriculture at Farming First. \"Venterra Farms is rooted in the belief that cannabis should be grown with care and attention. Our unique approach is about more than just producing high-quality cannabis. It's about creating a better future for the local environment and future generations.\" Powered by Farming First, positioned to become California's largest contiguous outdoor cultivation operation, Venterra Farms' product line includes a range of cannabis strains with high terpene expression and a full spectrum of cannabinoids, each carefully selected and grown to provide the perfect combination of aroma, taste and effects. Initial product offerings include jarred flower, pre-rolls and vape pens in the following strains: Wedding Cake, Peanut Butter Breath, Lemon Cherry Gelato, and Apples & Bananas. Additional details include: Jarred Flower : Hand-harvested, slow-cured sun-kissed nugs that feature the perfect balance of taste, aroma and effects. Hand-harvested, slow-cured sun-kissed nugs that feature the perfect balance of taste, aroma and effects. Pre-rolls: Single source, field-fresh flower carefully hand-harvested, slow-cured, and packed into individual tubes. No trim or fillers included. Single source, field-fresh flower carefully hand-harvested, slow-cured, and packed into individual tubes. No trim or fillers included. Vape Pens: Discrete and conveniently rechargeable, these pens are designed to preserve flavor. Cannabis derived terpenes means all ingredients come directly from cannabis for a 'true to plant' experience. The company extracts their own material to make the vape pen oils. Discrete and conveniently rechargeable, these pens are designed to preserve flavor. Cannabis derived terpenes means all ingredients come directly from cannabis for a 'true to plant' experience. The company extracts their own material to make the vape pen oils. Gummies: Full spectrum gummies, crafted with a combination of Indica and Sativa hybrid strains containing a full spectrum of cannabinoids such as CBN and CBG in each gummy. Available in four bold fruit flavors at 5MG THC per gummy. In addition to using sustainable farming practices, Venterra Farms is deeply committed to giving back to the community and will donate a portion of its profits to organizations that support sustainable farming and environmental conservation. The habitat plan for the company includes incorporating setbacks from native waterways to protect water quality, designated areas for preserving and restoring native grasses and plants, and the protection of a rare black walnut tree. Additionally, the use of solar power and upcycled water demonstrate the company's commitment to reducing their environmental impact and promoting conservation. Venterra Farms is now available at select dispensaries throughout California. For more information on Venterra Farms, visit https:\/\/venterrafarms.com\/ ABOUT VENTERRA FARMS Venterra Farms is a sustainably grown cannabis brand powered by Farming First and founded by farmers who have been cultivating the land off the Central Coast of California for five generations. Using a unique hybrid farming methodology that combines the best of indoor growing technology and cost efficiency with the sustainability of sun-grown farming, the company is dedicated to producing high-quality cannabis products while minimizing its environmental impact. In addition to its commitment to sustainability, Venterra Farms also gives back to the community by donating a portion of its profits to organizations that support sustainable farming and environmental conservation. ABOUT FARMING FIRST Founded in 2019, Farming First is the creator of the cannabis \"hybrid farming\" methodology. As a cannabis cultivator, processor, and distributor in the heart of California's Central Coast, Farming First focuses on bringing best-in-class farming and sustainability practices to the state's cannabis industry. With 134 acres of rolling cultivation, Farming First possesses entitlements for what will become the largest contiguous outdoor cultivation operation in California. The Company offers a plethora of options for the cannabis industry: single-source bulk wholesale cannabis; white-labeling; co-packaging; and custom farming contracts for specific needs, including dried and cured flower, fresh frozen, unique phenotypes, cannabinoid specific strains and more. Harnessing the natural resources of California's Central Coast, Farming First supplies some of the state's leading cannabis brands, in addition to having its own recently launched portfolio of brands. The team includes fourth- and fifth-generation farmers who know the land and are committed to growing high-quality sun-grown cannabis in the most sustainable way possible. Media Contact: Alice Moon Trailblaze [email protected] SOURCE Farming First, LLC","filter_flag":1}
{"title":"Tokio Marine is Preparing for Risks Beyond Insurance Services | NIKKEI ESG Management Forum - 日経BP","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi80Ny_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi80Ny_SAQA?oc=5","id":"CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi80Ny_SAQA","guidislink":false,"published":"Fri, 24 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=24, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=55, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi80Ny_SAQA?oc=5\" target=\"_blank\">Tokio Marine is Preparing for Risks Beyond Insurance Services | NIKKEI ESG Management Forum<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">日経BP<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Tokio Marine is Preparing for Risks Beyond Insurance Services | NIKKEI ESG Management Forum - 日経BP","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi80Ny_SAQA?oc=5\" target=\"_blank\">Tokio Marine is Preparing for Risks Beyond Insurance Services | NIKKEI ESG Management Forum<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">日経BP<\/font>","source.href":"https:\/\/project.nikkeibp.co.jp","source.title":"日経BP","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Japan now faces climate change, energy security challenges, a graying population which is decreasing year by year, and increasing cybercrime. The risks faced by individuals and businesses continue to become increasingly diverse, leading customers to expect more from risk coverage professionals in the non-life insurance sector. The United Nations developed Sustainable Development Goals (SDGs) now serve as guidelines toward effective action. Utilizing observation satellite data for prompt insurance payments and support for disaster stricken areas in the event of flood damage Invaluable Support for Daily Life Insurance claims are paid when houses are flooded. In the event of a traffic accident, medical expenses are covered when a person is injured together with car repair costs. The traditional perception of non-life insurance companies is that they pay compensation claimed due to disasters and accidents under particular insurance contracts. However, in the case of Tokio Marine Group, the risk coverage provided goes beyond making payouts in times of emergency. The Group works on disaster and accident prevention, along with damage mitigation when catastrophe does strike. The Group is rapidly expanding the range of coverage services it provides for both pre- and post-emergency situations. Tokio Marine launched CORE, a disaster prevention and mitigation consortium that brings together expertise from business operators in diverse fields A program initiated in July 2021 with Central Community Chest of Japan is one example that allows customers to choose paperless, web-based contracts and certificates. Opting in to this system allocates a portion of the money saved through using less resources to be donated to the Red Feather Welfare Fund. Contributions are distributed to local governments to support efforts for disaster prevention, mitigation, and recovery. In other words, Tokio Marine enables customers to choose paperless communication as an option, and money saved through this initiative goes toward enhancing disaster preparedness in local communities while also contributing to decarbonization through the reduction of paper use. The Group also uses satellite data to assist disaster struck areas. These activities are carried out together with a Finnish start-up which makes radar systems able to observe conditions on the ground regardless of the weather or time of day. When the town of Murakami, Niigata, was struck by torrential rain in August 2022, this technology was used to rapidly understand the extent of flooding and quickly pay insuranece claims. These conditions updates were also provided to local support groups via a non-profit organization working to facilitate assistance. The new head office building being constructed in Tokyo's Marunouchi district makes extensive use of wood to reduce carbon dioxide emissions during construction by about 30% In April 2022, the disaster prevention and mitigation consortium CORE launched its complete operations led by Tokio Marine. Seventy-one legal entities make up the membership with participants drawn from a wide range of fields including fluviology, geology, disaster recovery, and community development. The aim is to bring together experts with a diversity of knowledge and know-how from various fields to create new initiatives for disaster prevention and mitigation. Support both prior to and following disasters is not limited to only natural catastrophes. The Group is also working to realize its aim for a society without traffic accidents so that people can enjoy safe, secure mobility and where healthy lifestyles are supported through the early detection of disease and other maladies together with preventing severe cases of medical conditions. Tokio Marine, which has always supported customers in times of need, is pursuing the goal of transforming itself into a presence of constant support for clients everyday in accordance with the SDGs.","filter_flag":1}
{"title":"Blinkit to Expand Dark Store by 40 pc over Next 1 yr - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2JsaW5raXQtZXhwYW5kLWRhcmstc3RvcmUtNDAtcGMtb3Zlci1uZXh0LTEteXLSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2JsaW5raXQtZXhwYW5kLWRhcmstc3RvcmUtNDAtcGMtb3Zlci1uZXh0LTEteXLSAQA?oc=5","id":"CBMiUmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2JsaW5raXQtZXhwYW5kLWRhcmstc3RvcmUtNDAtcGMtb3Zlci1uZXh0LTEteXLSAQA","guidislink":false,"published":"Mon, 13 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=44, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2JsaW5raXQtZXhwYW5kLWRhcmstc3RvcmUtNDAtcGMtb3Zlci1uZXh0LTEteXLSAQA?oc=5\" target=\"_blank\">Blinkit to Expand Dark Store by 40 pc over Next 1 yr<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Blinkit to Expand Dark Store by 40 pc over Next 1 yr - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2JsaW5raXQtZXhwYW5kLWRhcmstc3RvcmUtNDAtcGMtb3Zlci1uZXh0LTEteXLSAQA?oc=5\" target=\"_blank\">Blinkit to Expand Dark Store by 40 pc over Next 1 yr<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Quick commerce player Blinkit is looking to expand its micro-fulfillment centers or dark stores, targeting up to a 40 percent increase in store count in the next 12 months, according to company CEO Albinder Dhindsa. The company, which was acquired by online food delivery firm Zomato last year, currently has over 400 dark stores that act as warehouses. \"We have identified several new high-potential neighborhoods in existing as well as new cities. We should start seeing the net dark store number increase going forward,\" Dhindsa said. He further said, \"We are seeking opportunities for store openings in high potential areas based on the data our systems generate, the management bandwidth, and time to supply creation.\" Dhindsa, however, said, unlike the food delivery business, the growth in the quick commerce business is dependent on various factors such as availability of products from the brand, seller ability, and supply chain capacity. \"Only when we feel confident that we can provide a great experience for our customers in a high potential location, do we start the process of opening new stores. Currently, we believe that we can comfortably grow our dark store count by around 30-40 percent over the next 12 months,\" he added. This will also depend on the company's ability to find the best and most cost-effective locations for these stores, Dhindsa said. In the third quarter, he said Blinkit was less impacted compared to the food delivery business as \"our typical purchase basket tends to be more skewed towards essential\/ non-discretionary spends.\" The slight downward pressure on average order value might be a result of the slowdown where customers are preferring to buy smaller packs instead of larger ones, he said, adding, \"Overall however, the last quarter was the highest ever in terms of new and returning customers.\" Blinkit posted a revenue of Rs 301 crore in the third quarter that ended December 31, 2022, up 28 percent quarter-on-quarter (QoQ), while gross order value (GOV) stood at Rs 1,749 crore, a growth of 18 percent QoQ. \"All of this growth has come without any expansion in our dark store footprint,\" Dhindsa noted. On advertising income becoming a meaningful source of revenue for Blinkit, he said, \"We expect advertisement revenue to be a significant driver for the increase in revenue per order going forward.\" In line with that vision, he said, \"We launched our new self-serve advertising platform for brands - Blinkit Brand Central, in December 2022. The self-serve platform allows brands to bid on their search keywords of interest, as well as create customized brand stores on the platform.\" Blinkit has become a preferred platform for advertising and engagement for over 500 brands, he said, adding \"these brands, large and emerging, use us to build brand awareness and to also push their sales on the platform with performance advertising.\"","filter_flag":1}
{"title":"Top 20 Best Sporting Goods Manufacturing Companies In 2023 - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvc3BvcnRpbmctZ29vZHMtbWFudWZhY3R1cmluZy1jb21wYW5pZXMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvc3BvcnRpbmctZ29vZHMtbWFudWZhY3R1cmluZy1jb21wYW5pZXMv0gEA?oc=5","id":"CBMiSmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvc3BvcnRpbmctZ29vZHMtbWFudWZhY3R1cmluZy1jb21wYW5pZXMv0gEA","guidislink":false,"published":"Thu, 23 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=23, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=54, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvc3BvcnRpbmctZ29vZHMtbWFudWZhY3R1cmluZy1jb21wYW5pZXMv0gEA?oc=5\" target=\"_blank\">Top 20 Best Sporting Goods Manufacturing Companies In 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 20 Best Sporting Goods Manufacturing Companies In 2023 - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvc3BvcnRpbmctZ29vZHMtbWFudWZhY3R1cmluZy1jb21wYW5pZXMv0gEA?oc=5\" target=\"_blank\">Top 20 Best Sporting Goods Manufacturing Companies In 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Top 20 Sporting Goods Manufacturing companies in 2023 The global market for sporting goods has experienced significant growth over the past few years, driven by factors such as rising consumer interest in health and wellness, increasing participation in sports and fitness activities, and the growing popularity of organized sports events. As a result, the demand for high-quality sporting goods products has increased, leading to the emergence of several leading manufacturers in the industry. This article provides an overview of the top 20 sporting goods manufacturing companies in 2023. These companies are leaders in the industry, known for their innovative products, high-quality standards, and commitment to customer satisfaction. They manufacture various products, including athletic footwear, sports equipment, and sports apparel. The article provides a brief description of each company, highlighting their key products, areas of expertise, and unique strengths in the market. Whether you are a sports enthusiast or a business looking to partner with a reliable sporting goods manufacturer, this article is sure to provide valuable insights and information. Nike Nike is a multinational corporation that designs, develops, and sells footwear, apparel, and accessories. Founded in 1964 by Bill Bowerman and Phil Knight, Nike has become one of the most recognizable and successful brands in the world. The company’s mission statement is “to bring inspiration and innovation to every athlete in the world,” and its products reflect this commitment to excellence and innovation. One of Nike’s core values is innovation, which is reflected in its products. Nike has always been at the forefront of designing and developing new materials and technologies to enhance their products’ performance. For example, they were the first company to introduce air-cushioned soles in their shoes, which revolutionized the way athletes trained and performed. Nike has also pioneered the use of recycled materials in their products, such as recycled polyester, to reduce their environmental impact. Nike is also known for its marketing campaigns, which have been hugely successful in creating a strong brand identity and connecting with customers. The iconic “Just Do It” slogan, which was introduced in 1988, has become synonymous with Nike and encapsulates the brand’s message of inspiration and motivation. Nike has also used high-profile athletes to endorse their products, including Michael Jordan, LeBron James, and Serena Williams, among others. In recent years, Nike has also been committed to promoting diversity and inclusion in its products and workforce. The company has launched initiatives such as the “Black Community Commitment,” which aims to invest $40 million over four years to support black communities in the United States. Nike has also launched a program to promote gender equality and has committed to increasing the representation of women and people of colour in its leadership positions. Adidas Adidas is a world-renowned sporting goods manufacturer that is known for its high-quality athletic footwear, sports apparel, and sports equipment. The company was founded in 1949 in Germany and has since grown into one of the largest and most recognised sporting goods brands in the world. Adidas has a strong focus on innovation and design, and it has been at the forefront of developing new technologies and materials to improve the performance and comfort of its products. The company has a long history of collaborating with professional athletes, teams, and sporting events to design and develop products that are optimized for performance. Adidas produces a wide range of products, including running shoes, basketball shoes, soccer cleats, training shoes, and more. Its clothing line includes products for men, women, and children, including t-shirts, shorts, pants, jackets, and other sportswear. The company also produces a range of sporting goods equipment, including soccer balls, basketballs, and other gear. Adidas is committed to sustainability and has implemented various initiatives to reduce its environmental impact. It has set ambitious goals to use only sustainable materials in its products and to eliminate waste and carbon emissions in its operations. The company is also committed to promoting social responsibility and has implemented programs to improve working conditions in its supply chain and to support local communities. Overall, Adidas is a global leader in the sporting goods industry, known for its innovative products, commitment to design and quality, and dedication to sustainability and social responsibility. Its products are worn by millions of athletes and sports enthusiasts around the world, and its brand is a symbol of excellence and performance in the sports world. Callaway Golf Company Callaway Golf Company is a leading manufacturer of golf clubs, golf balls, and other golfing accessories. The company was founded in 1982 by Ely Callaway, who believed that innovative designs and cutting-edge technologies could help golfers improve their game. Today, Callaway Golf is one of the most well-known brands in the golfing industry, and its products are used by professional golfers and amateurs alike. One of Callaway’s key strengths is its commitment to innovation. The company invests heavily in research and development to create new designs and technologies that improve golfers’ performance. For example, Callaway was one of the first companies to use computer-aided design (CAD) to create golf clubs, which allowed for greater precision and consistency in the manufacturing process. Callaway also pioneered the use of carbon composite materials in golf club heads, which made the clubs lighter and more durable. Another area where Callaway excels is in marketing and branding. The company has a strong brand identity, reflected in its logo, slogan (“Better Everything”), and marketing campaigns. Callaway has used professional golfers such as Phil Mickelson and Annika Sorenstam to endorse its products and promote its brand. Callaway is also committed to social responsibility and sustainability. The company has launched several initiatives to reduce its environmental impact, such as using recycled materials in its packaging and reducing water consumption in its manufacturing processes. Callaway also supports charitable organizations through its Birdies for the Brave program, which raises money for military charities and provides support to military families. Bauer Hockey Bauer Hockey is a leading manufacturer of ice hockey equipment, including skates, sticks, helmets, gloves, and protective gear. Founded in 1927 by a Canadian businessman named W. W. Bauer, the company has a long history of innovation and excellence in the hockey industry. One of Bauer Hockey’s core strengths is its commitment to research and development. The company invests heavily in creating new materials and technologies that improve hockey players’ performance and safety. For example, Bauer was one of the first companies to introduce lightweight, carbon fibre-reinforced composite hockey sticks, which are now used by many professional players. Bauer also developed a revolutionary material called VAPORLITE, which is used in its skates and provides a comfortable, lightweight fit. Bauer is also known for its strong relationships with professional hockey players. The company works closely with professional athletes to design and develop new products, ensuring that its equipment meets the highest standards of performance and quality. Bauer has worked with some of the top players in the NHL, including Sidney Crosby, Alexander Ovechkin, and Patrick Kane, among others. In addition to its focus on innovation and athlete partnerships, Bauer Hockey is also committed to social responsibility. The company has launched several initiatives to promote diversity and inclusion in hockey, such as the “Hockey Is For Everyone” campaign, which aims to increase participation in hockey among underrepresented communities. Bauer also supports charitable organizations through its “BAUER First Shift” program, which provides free equipment and ice time to children who have never played hockey before. Reebok International Ltd. Reebok International Ltd. is a global athletic footwear and apparel company that designs and manufactures products for a wide range of sports and fitness activities. Founded in 1958 in the United Kingdom, Reebok has grown into a global brand with a presence in over 170 countries. One of Reebok’s core values is innovation, which is reflected in its products. The company has a long history of introducing new technologies and materials to enhance the performance of its products. For example, Reebok introduced the first athletic shoe with air cushioning in 1989 and developed the Pump, a shoe with an inflatable air bladder that provided a customized fit for the wearer. Reebok is also known for its collaborations with high-profile athletes and designers. The company has partnered with professional athletes such as Conor McGregor and CrossFit athletes Rich Froning and Katrin Davidsdottir, as well as fashion designers like Victoria Beckham and Pyer Moss. In addition to its focus on innovation and collaborations, Reebok is also committed to sustainability and social responsibility. The company has launched several initiatives to reduce its environmental impact, such as using recycled materials in its products and reducing its greenhouse gas emissions. Reebok also supports charitable organizations through its “Be More Human” campaign, which aims to promote physical activity and well-being in underserved communities. Overall, Reebok International Ltd.’s commitment to innovation, collaborations, and social responsibility has helped it maintain its position as a leading athletic brand. The company’s dedication to creating high-quality products that enhance performance, while also promoting sustainability and social responsibility, has made it a trusted and respected brand among athletes and consumers around the world. Russell Brands, LLC Russell Brands, LLC is an American sports equipment and apparel company that has been in business for over 100 years. Founded in 1902, Russell Brands is known for its high-quality athletic wear and equipment, as well as its commitment to innovation and customer satisfaction. One of Russell Brands’ key strengths is its dedication to innovation. The company invests heavily in research and development to create new products and technologies that improve the performance and comfort of its athletic wear and equipment. For example, Russell Brands was one of the first companies to introduce moisture-wicking fabrics, which help keep athletes dry and comfortable during intense workouts. The company also developed Dri-Power technology, which helps to regulate body temperature and wick moisture away from the skin. Another area where Russell Brands excels is customer satisfaction. The company is known for its exceptional customer service, and it works closely with its customers to ensure that its products meet their needs and exceed their expectations. Russell Brands also offers a wide range of customizable products, allowing customers to personalize their athletic wear and equipment to suit their individual needs. Russell Brands is also committed to social responsibility and sustainability. The company has launched several initiatives to reduce its environmental impact, such as using recycled materials in its products and reducing its carbon footprint. Russell Brands also supports charitable organizations through its “Russell Cares” program, which provides funding and support to organizations that promote health and wellness in underserved communities. Wilson Sporting Goods Co. Wilson Sporting Goods Co. is a leading American sports equipment and apparel company that has been in business for over 100 years. Founded in 1913, Wilson is known for its high-quality products, particularly its tennis and golf equipment, as well as its commitment to innovation and customer satisfaction. One of Wilson’s core strengths is their dedication to research and development. The company invests heavily in creating new materials and technologies that improve the performance and durability of its products. For example, Wilson introduced the first graphite tennis racket in 1976, which revolutionized the sport and is now the standard for professional players. Wilson also developed the first moisture-wicking golf glove, which helps to keep golfers’ hands dry and comfortable during hot and humid weather. In addition to its focus on innovation, Wilson is also known for its partnerships with professional athletes. The company works closely with athletes to design and develop new products, ensuring that its equipment meets the highest standards of performance and quality. Wilson has worked with some of the top players in tennis, including Serena and Venus Williams, as well as golfers such as Gary Woodland and Kevin Streelman. Wilson is also committed to social responsibility and sustainability. The company has launched several initiatives to reduce its environmental impact, such as using recycled materials in its products and reducing its carbon footprint. Wilson also supports charitable organizations through its “Wilson ONE” program, which provides funding and support to organizations that promote education and youth development. Columbia Sportswear Company Columbia Sportswear Company is a leading American outdoor apparel and equipment company that has been in business for over 80 years. Founded in 1938, Columbia is known for its high-quality, innovative products that are designed to withstand the elements and keep outdoor enthusiasts warm, dry, and comfortable. One of Columbia’s core strengths is its dedication to innovation. The company invests heavily in research and development to create new materials and technologies that improve the performance and durability of its products. For example, Columbia developed Omni-Shade technology, which provides UPF 50+ sun protection, and Omni-Wick technology, which wicks moisture away from the skin to keep the wearer dry and comfortable. Columbia is also committed to sustainability and social responsibility. The company has launched several initiatives to reduce its environmental impact, such as using recycled materials in its products and reducing its carbon footprint. Columbia also supports charitable organizations through its “Greater Good” program, which provides funding and support to organizations that promote conservation and outdoor recreation. Another area where Columbia excels is customer satisfaction. The company is known for its exceptional customer service, and it works closely with its customers to ensure that its products meet their needs and exceed their expectations. Columbia offers a wide range of products, from hiking boots to ski jackets, and it offers customized fitting and sizing services to ensure that its products fit the unique needs of each customer. Everlast Worldwide Inc. Everlast Worldwide Inc. is a leading American manufacturer and marketer of boxing and martial arts equipment, apparel, and accessories. Founded in 1910, Everlast is known for its high-quality products, innovative designs, and commitment to the sport of boxing. One of Everlast’s core strengths is its dedication to innovation. The company invests heavily in research and development to create new materials and technologies that improve the performance and safety of its products. For example, Everlast developed “Powerlock” technology, which provides a secure fit and optimal wrist support for boxers, and “C3 Foam” technology, which provides superior shock absorption and impact resistance for martial arts practitioners. Everlast is also committed to the sport of boxing and has a long history of supporting athletes and events in the boxing community. The company has worked with some of the top boxers in history, including Muhammad Ali, Sugar Ray Leonard, and Mike Tyson, and has sponsored major boxing events such as the Olympic Games and the World Boxing Championship. In addition to its focus on innovation and boxing, Everlast is also committed to social responsibility and sustainability. The company has launched several initiatives to reduce its environmental impact, such as using recycled materials in its products and reducing its carbon footprint. Everlast also supports charitable organizations through its “Fight for Good” program, which provides funding and support to organizations that promote health, wellness, and education in underserved communities. Puma SE Puma SE is a multinational sports brand headquartered in Herzogenaurach, Germany. Founded in 1948, the company has become known for its innovative designs, high-quality products, and commitment to sustainability. One of Puma’s core strengths is its focus on innovation. The company invests heavily in research and development to create new materials and technologies that improve the performance and comfort of its products. For example, Puma has developed “Netfit” technology, which allows customers to customize the fit of their shoes by adjusting the lacing system, and “Ignite” foam, which provides superior cushioning and energy return for runners. Puma is also committed to sustainability and has launched several initiatives to reduce its environmental impact. The company has set ambitious targets to reduce its carbon footprint, water usage, and waste, and has introduced sustainable materials such as recycled polyester and organic cotton into its products. Puma has also established partnerships with organizations such as the Better Cotton Initiative and the Forest Stewardship Council to ensure that its products are made with sustainable materials and responsible practices. In addition to its focus on innovation and sustainability, Puma is also committed to social responsibility. The company has established the Puma Foundation, which provides funding and support to organizations that promote social justice, education, and environmental sustainability. Puma also supports initiatives to promote diversity and inclusion, such as its partnership with the Women’s World Cup and its “Unity Collection” of products, which celebrate different cultures and identities. Under Armour Inc. Under Armour, Inc. is a leading American sports brand known for its innovative performance apparel, footwear, and accessories. Founded in 1996 by Kevin Plank, a former University of Maryland football player, Under Armour has become a household name in the sports industry, known for its high-quality products and cutting-edge technology. One of Under Armour’s core strengths is its focus on innovation. The company invests heavily in research and development to create new materials and technologies that improve the performance and comfort of its products. For example, Under Armour has developed “UA RUSH” technology, which uses minerals in the fabric to recycle energy during workouts and improve performance, and “HOVR” technology, which provides cushioning and energy return for runners. Under Armour is also committed to creating products that are both functional and stylish. The company’s products are designed to meet the needs of athletes across a variety of sports, from basketball and football to yoga and running. Under Armour also collaborates with fashion designers and celebrities to create limited-edition collections and collaborations that appeal to a wider audience. In addition to its focus on innovation and style, Under Armour is also committed to social responsibility. The company has established the Under Armour Foundation, which provides funding and support to organizations that promote health and fitness, education, and entrepreneurship. Under Armour also supports initiatives to promote diversity and inclusion, such as its “United We Win” campaign, which celebrates the accomplishments of athletes from diverse backgrounds. Skechers USA Inc. Skechers USA Inc. is a leading American footwear company that has been providing customers with innovative and stylish footwear options since its inception in 1992. The brand has gained recognition worldwide for its comfortable and trendy shoes, which are designed to cater to the needs of various age groups. One of Skechers’ core strengths is its focus on innovation. The company invests heavily in research and development to create new materials and technologies that improve the comfort and durability of its products. For example, Skechers has developed “Air-Cooled Memory Foam” technology, which provides a comfortable and breathable insole for shoes, and “Go Run” technology, which offers lightweight cushioning and support for runners. Skechers is also committed to creating products that are both functional and stylish. The brand offers a wide range of footwear options, from casual sneakers and sandals to athletic shoes and work boots. Skechers also collaborates with fashion designers and celebrities to create limited-edition collections and collaborations that appeal to a wider audience. In addition to its focus on innovation and style, Skechers is also committed to social responsibility. The company has established the Skechers Foundation, which provides funding and support to organizations that promote education, health, and social services for children. Skechers also supports initiatives to promote diversity and inclusion, such as its “Pride” collection, which celebrates the LGBTQ+ community. The North Face The North Face is a leading American outdoor apparel and equipment company that has been providing customers with high-quality, innovative products since its inception in 1966. The brand is renowned for its commitment to excellence and its dedication to creating outdoor gear that can withstand even the most extreme weather conditions. One of The North Face’s core strengths is its focus on innovation. The company invests heavily in research and development to create new materials and technologies that improve the performance and durability of its products. For example, The North Face has developed “Futurelight” technology, which offers waterproof and breathable protection for outdoor enthusiasts, and “ThermoBall” technology, which provides lightweight insulation for cold weather conditions. The North Face is also committed to creating products that are both functional and stylish. The brand offers a wide range of outdoor apparel options, from jackets and pants to footwear and accessories. The North Face also collaborates with fashion designers and athletes to create limited-edition collections and collaborations that appeal to a wider audience. In addition to its focus on innovation and style, The North Face is also committed to sustainability. The company has established several initiatives to reduce its environmental impacts, such as its “Clothes The Loop” program, which encourages customers to recycle their old clothing and footwear, and its “Renewed” program, which sells refurbished and repaired products at a lower cost. TaylorMade Golf TaylorMade Golf is a leading American golf equipment company that has been providing golfers with high-quality and innovative products since its inception in 1979. The brand is recognized worldwide for its commitment to excellence and its dedication to creating golf equipment that helps golfers of all skill levels to improve their game. One of TaylorMade’s core strengths is its focus on innovation. The company invests heavily in research and development to create new materials and technologies that improve the performance and precision of its products. For example, TaylorMade has developed “Speed Bridge” technology, which provides greater ball speed and distance, and “Twist Face” technology, which helps to reduce side spin and straighten off-centre hits. TaylorMade is also committed to creating products that are both functional and stylish. The brand offers a wide range of golf equipment options, from drivers and irons to putters and golf balls. TaylorMade also collaborates with professional golfers and athletes to create limited-edition collections and collaborations that appeal to a wider audience. In addition to its focus on innovation and style, TaylorMade is also committed to sustainability. The company has established several initiatives to reduce its environmental impacts, such as its “Sustainable Apparel Collection,” which features eco-friendly materials, and its “M5 Driver Recycling Program,” which encourages customers to recycle their old drivers to reduce waste. Asics Corporation ASICS Corporation is a Japanese multinational corporation that specializes in designing and manufacturing sports equipment and footwear for a variety of sports including running, tennis, and volleyball. The brand is recognized worldwide for its focus on innovation, quality, and comfort, and has a loyal following of athletes and fitness enthusiasts around the world. One of ASICS’ core strengths is its focus on innovation. The company invests heavily in research and development to create new materials and technologies that improve the performance and comfort of its products. For example, ASICS has developed “GEL Cushioning System” technology, which provides shock absorption for runners and other athletes, and “FlyteFoam” technology, which offers lightweight cushioning for improved performance. ASICS is also committed to creating products that are both functional and stylish. The brand offers a wide range of sports equipment and footwear options, from running shoes and tennis rackets to sports bras and compression tights. ASICS also collaborates with fashion designers and athletes to create limited-edition collections and collaborations that appeal to a wider audience. In addition to its focus on innovation and style, ASICS is also committed to sustainability. The company has established several initiatives to reduce its environmental impacts, such as its “ASICS Sustainability Vision 2030,” which outlines its commitment to reducing carbon emissions and waste, and its “Eco-Packaging Program,” which uses eco-friendly materials in its packaging. Easton Sports Easton Sports is an American company that designs and manufactures a wide range of sporting goods, including baseball and softball equipment, hockey sticks, and archery equipment. Founded in 1922, the company has a long history of innovation and a commitment to producing high-quality and reliable products for athletes at all levels. One of Easton Sports’ core strengths is its focus on innovation. The company invests heavily in research and development to create new materials and technologies that improve the performance and durability of its products. For example, Easton has developed “CXN” technology, which improves energy transfer and reduces vibration in baseball and softball bats, and “Synergy” technology, which provides greater accuracy and speed in hockey sticks. Easton Sports is also committed to creating products that are both functional and stylish. The brand offers a wide range of sporting goods options, from baseball gloves and batting helmets to archery arrows and quivers. Easton also collaborates with professional athletes and teams to create limited-edition collections and collaborations that appeal to a wider audience. In addition to its focus on innovation and style, Easton Sports is also committed to sustainability. The company has established several initiatives to reduce its environmental impacts, such as its “Eco-Demand” program, which uses eco-friendly materials and production methods in its products, and its “Zero Waste” initiative, which aims to reduce waste and increase recycling in its facilities. Mizuno Corporation Mizuno Corporation is a Japanese sporting goods company that specializes in designing and manufacturing equipment and apparel for a variety of sports, including running, golf, baseball, volleyball, and more. The company was founded in 1906 in Osaka, Japan and has since grown to become a globally recognized brand known for its high-quality products and commitment to innovation. One of Mizuno’s core strengths is its focus on innovation. The company invests heavily in research and development to create new materials and technologies that improve the performance and comfort of its products. For example, Mizuno has developed “Wave Plate” technology, which provides cushioning and stability for runners, and “Boron” technology, which increases the strength and durability of its golf clubs. Mizuno is also committed to creating products that are both functional and stylish. The brand offers a wide range of sporting goods and apparel options, from running shoes and golf clubs to volleyball uniforms and baseball gloves. Mizuno also collaborates with professional athletes and teams to create limited-edition collections and collaborations that appeal to a wider audience. In addition to its focus on innovation and style, Mizuno is also committed to sustainability. The company has established several initiatives to reduce its environmental impacts, such as its “Mizuno Blue Carbon” program, which uses eco-friendly materials and production methods in its products, and its “Mizuno Fit for Charity” program, which donates a portion of its profits to environmental and social causes. New Balance Athletic Shoe Inc. New Balance Athletic Shoe Inc. is an American company that designs and manufactures athletic shoes, apparel, and accessories. Founded in 1906 in Boston, Massachusetts, the company has a long history of producing high-quality products that prioritize comfort, durability, and performance. One of New Balance’s core strengths is its commitment to producing shoes that are tailored to the needs of each customer. The company offers a wide range of sizes and widths to accommodate different foot shapes and sizes, and also allows customers to customize their shoes with various colours and materials. This approach has helped New Balance build a loyal customer base of athletes and fitness enthusiasts who appreciate the company’s attention to detail and emphasis on individual needs. New Balance is also committed to innovation and invests heavily in research and development to create new materials and technologies that improve the performance and comfort of its products. For example, the company has developed “Fresh Foam” technology, which provides cushioning and support for runners, and “REVlite” technology, which offers lightweight responsiveness for athletes in a variety of sports. In addition to its focus on comfort and innovation, New Balance is also committed to sustainability. The company has established several initiatives to reduce its environmental impact, such as its “Reduced Waste” program, which aims to reduce waste and increase recycling in its facilities, and its “Made in USA” initiative, which promotes domestic production and reduces the carbon footprint of its products. Jarden Corporation Jarden Corporation was a publicly traded consumer products company that was founded in 2001 and based in Florida, USA. The company owned and operated a diverse portfolio of brands that offered products across a range of categories, including sporting goods, outdoor products, and home goods. Jarden’s portfolio of brands included a number of well-known names in the sporting goods industry, such as Rawlings, Marmot, K2, and Coleman. These brands offered a range of products, from outdoor camping equipment and sporting goods to home appliances and beauty products. One of Jarden’s core strengths was its focus on innovation and product development. The company invested heavily in research and development to create new and improved products that offered better performance, durability, and convenience for consumers. For example, the company developed the “MaxCold” technology for its Coleman coolers, which kept food and drinks cold for longer periods of time, and the “BackBone” technology for its K2 skis, which provided greater stability and control for skiers. Jarden was also committed to sustainability and social responsibility and had established a number of initiatives to reduce its environmental impact and support charitable causes. The company’s “Reduce, Reuse, Recycle” program aimed to reduce waste and increase recycling in its operations, while its “Jarden Home Brands” initiative promoted the use of reusable canning jars and other sustainable household products. Decathlon Decathlon is a French sporting goods retailer that was founded in 1976. The company operates more than 1,600 stores in 60 countries, making it one of the largest sporting goods retailers in the world. Decathlon offers a wide range of products, from traditional sporting goods like bicycles and running shoes to less common sports equipment like scuba diving gear and archery equipment. One of Decathlon’s core values is accessibility. The company aims to make sports accessible to as many people as possible by offering products at affordable prices and providing high-quality customer service. To this end, Decathlon designs and produces its products in-house, allowing it to offer them at lower prices than many competitors. The company also offers a range of services, including sports equipment rental and repair, to help customers get the most out of their products. Another key aspect of Decathlon’s business is its commitment to sustainability. The company has established several initiatives to reduce its environmental impact, such as using sustainable materials in its products and implementing recycling programs in its stores. Decathlon also partners with organizations and initiatives that promote sustainable sports practices and environmental conservation. Decathlon’s approach to retailing and sustainability has earned it a loyal customer base around the world. The company’s focus on accessibility, affordability and sustainability has resonated with many customers who appreciate its commitment to making sports more accessible and environmentally responsible. As Decathlon continues to expand globally, it is likely to remain a major player in the sporting goods industry. Conclusion: These Top 20 Sporting Goods Manufacturing Companies in 2023 showcase the best in innovation, technology, and quality when it comes to athletic gear and equipment. These companies have established themselves as leaders in the industry, constantly pushing the boundaries of what’s possible in sports equipment and apparel. From Nike’s cutting-edge designs to Bauer Hockey’s commitment to performance and safety, each of these companies has its unique strengths and focus areas. Many of them also prioritize sustainability and social responsibility, demonstrating their commitment to creating a better world for athletes and fans alike. As the sports industry continues to evolve, these companies will no doubt continue to innovate and push the limits of what’s possible. With the growing popularity of sports and fitness around the world, the demand for high-quality athletic gear and equipment is only going to increase. As such, these Top 20 Sporting Goods Manufacturing Companies in 2023 are well-positioned to continue to succeed and provide athletes of all levels with the gear they need to perform at their best.","filter_flag":1}
{"title":"Top 20 Best Dairy Products Manufacturing Companies In India 2023 - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvZGFpcnktcHJvZHVjdHMtbWFudWZhY3R1cmluZy1jb21wYW5pZXMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvZGFpcnktcHJvZHVjdHMtbWFudWZhY3R1cmluZy1jb21wYW5pZXMv0gEA?oc=5","id":"CBMiSmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvZGFpcnktcHJvZHVjdHMtbWFudWZhY3R1cmluZy1jb21wYW5pZXMv0gEA","guidislink":false,"published":"Fri, 24 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=24, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=55, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvZGFpcnktcHJvZHVjdHMtbWFudWZhY3R1cmluZy1jb21wYW5pZXMv0gEA?oc=5\" target=\"_blank\">Top 20 Best Dairy Products Manufacturing Companies In India 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 20 Best Dairy Products Manufacturing Companies In India 2023 - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvZGFpcnktcHJvZHVjdHMtbWFudWZhY3R1cmluZy1jb21wYW5pZXMv0gEA?oc=5\" target=\"_blank\">Top 20 Best Dairy Products Manufacturing Companies In India 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Top 20 Best Dairy products manufacturing companies in India 2023 As of 2023, numerous dairy product manufacturing companies in India have established themselves as leaders in the industry. India is one of the world’s largest producers of dairy products, with a rich history of milk production and consumption that dates back thousands of years. The country’s dairy industry has seen significant growth in recent years, driven by rising demand for dairy products both domestically and internationally. These top 20 dairy product manufacturing companies in India are known for their high-quality products, innovative marketing strategies, and strong market presence. These companies produce a wide range of dairy products, including milk, butter, cheese, curd, paneer, ghee, and ice cream, among others. They have earned the trust and loyalty of their customers through their commitment to quality and consistency. These companies have also made significant contributions to the Indian economy, providing employment opportunities and supporting rural livelihoods through their extensive supply chains. Amul Amul, also known as the Gujarat Cooperative Milk Marketing Federation Ltd, is one of the most well-known and loved dairy brands in India. Founded in 1946 in Anand, Gujarat, Amul has grown to become a major player in the Indian dairy industry, with a turnover of over Rs 52,000 crore in 2020. Amul’s success can be attributed to its unique cooperative model, which involves a network of over 3.6 million milk producers across the country. These milk producers are organized into dairy cooperative societies, which then supply milk to Amul for processing and distribution. One of the most iconic products of Amul is its butter, which has become synonymous with the brand. Amul butter is known for its rich and creamy taste and is used in households and restaurants across the country. In addition to butter, Amul produces a wide range of dairy products including milk, cheese, ice cream, and yoghurt. Amul’s marketing campaigns have also become legendary, with its famous “utterly butterly delicious” tagline and its creative advertisements featuring the Amul girl, a fictional character who has been a part of the brand’s advertising since 1966. The Amul girl has become an iconic figure in Indian advertising, known for her wit and humour in commenting on current events and social issues. Beyond its success as a brand, Amul has also had a significant impact on the Indian economy and society. The cooperative model has helped to empower rural farmers and create sustainable livelihoods, while the brand has become a symbol of national pride and identity. Overall, Amul is a true Indian success story, and a testament to the power of cooperation, innovation, and quality in building a successful business. 2. Mother Dairy Mother Dairy is a well-known dairy brand in India that was established in 1974 as a wholly-owned subsidiary of the National Dairy Development Board (NDDB). The company is headquartered in Delhi and has a wide range of dairy products, including milk, butter, cheese, yoghurt, ice cream, and more. One of the unique features of Mother Dairy is its focus on quality and safety. The company has established a network of over 7000 village-level milk collection centres, where milk is collected from farmers and tested for quality before being processed. This ensures that the milk used in Mother Dairy products is of the highest quality and meets stringent safety standards. Another critical aspect of Mother Dairy is its commitment to social responsibility. The company has implemented several initiatives to support farmers, including providing them with training and education on best practices for milk production and animal care. Mother Dairy also works to promote sustainable farming practices and environmental conservation. In addition to its products, Mother Dairy is also known for its innovative marketing campaigns. The company’s “Happy Food, Happy People” campaign, for example, promotes the idea of healthy and nutritious food for a happy and healthy life. Mother Dairy has also launched several new products, such as flavoured milk and probiotic yoghurt, to cater to changing consumer tastes and preferences. 3. Nestle India Nestle India is a subsidiary of the Swiss multinational food and beverage company, Nestle SA. The company was founded in India in 1959 and has since grown to become one of the leading food and beverage companies in the country. Nestle India is known for its wide range of products, including popular brands such as Maggi noodles, Nescafe coffee, Kit Kat chocolate, and more. The company’s products are sold in over 190 countries, making it a global brand with a strong local presence in India. One of the key strengths of Nestle India is its focus on innovation and product development. The company has a dedicated research and development centre in India, where it works on developing new products and improving existing ones. Nestle India also partners with local farmers and suppliers to ensure the quality and sustainability of its ingredients. Another essential aspect of Nestle India’s operations is its commitment to social responsibility. The company has implemented several initiatives to support farmers, such as providing training and education on sustainable farming practices and helping them access markets for their products. Nestle India also works to promote water conservation and sustainable packaging. In addition to its products, Nestle India is also known for its marketing campaigns. The company’s “Good Food, Good Life” campaign, for example, promotes the idea of healthy and nutritious food for a better life. Nestle India has also launched several new products in recent years, such as ready-to-drink cold coffee and breakfast cereals, to cater to changing consumer tastes and preferences. . 5. Heritage Foods Heritage foods are foods that have a long-standing cultural or historical significance within a particular community or region. These foods often have unique flavours and preparation methods that have been passed down from generation to generation. One example of heritage food is the Native American Three Sisters planting method, which involves planting corn, beans, and squash together in a way that allows each plant to benefit from the others. This method has been used for centuries by Native American tribes and is still used today in many parts of North America. Another example of heritage food is the traditional Japanese tea ceremony, which involves a highly ritualized preparation and presentation of tea. The ceremony dates back to the 16th century and is still practised today in Japan and around the world. Heritage foods are important not only because of their cultural and historical significance but also because they often represent a unique and sustainable approach to food production. Many heritage foods are grown using traditional methods that prioritize environmental sustainability and biodiversity and often involve local and organic farming practices. However, despite their importance, many heritage foods are at risk of disappearing due to modernization, globalization, and changes in consumer preferences. In response, there has been a growing movement to preserve and promote heritage foods through education, advocacy, and support for local producers. 6. Parag Milk Foods Parag Milk Foods is a leading dairy company in India, known for its high-quality products and commitment to innovation. The company was founded in 1992 and has since grown to become one of the most trusted brands in the dairy industry. One of the key strengths of Parag Milk Foods is its focus on quality and safety. The company has implemented several measures to ensure the quality of its products, including stringent testing and quality control processes. Parag Milk Foods also sources its milk from trusted suppliers and has established long-term relationships with local farmers to ensure a steady supply of high-quality milk. Another important aspect of Parag Milk Foods’ operations is its commitment to sustainability. The company has implemented several initiatives to reduce its environmental impact, such as using renewable energy sources and minimizing waste. Parag Milk Foods also works closely with local farmers to promote sustainable agriculture practices and support rural communities. In addition to its focus on quality and sustainability, Parag Milk Foods is also known for its innovative products. The company has introduced several new products in recent years, such as probiotic yoghurt and flavoured milk, to cater to changing consumer tastes and preferences. Parag Milk Foods also offers a wide range of dairy products, including cheese, butter, ghee, and more. 7. Prabhat Dairy Prabhat Dairy is a leading Indian dairy company that specializes in the production of milk and milk-based products. The company was founded in 1998 and has since grown to become one of the largest dairy companies in India, with a presence in over 20 states. Prabhat Dairy is known for its high-quality dairy products, which are produced using state-of-the-art technology and processes. The company sources milk from local farmers, ensuring that its products are fresh and of the highest quality. In addition to milk, Prabhat Dairy produces a wide range of dairy products, including ghee, butter, paneer, and yoghurt. The company’s products are sold under the brand name Prabhat, which is widely recognized and trusted by consumers across India. Prabhat Dairy has also been at the forefront of innovation in the dairy industry, introducing new products and technologies to improve the quality and safety of its products. For example, the company has developed a unique ultra-high temperature (UHT) processing technology that allows it to produce long-life milk with a shelf life of up to six months. Prabhat Dairy is also committed to sustainability and social responsibility. The company works closely with local farmers to promote sustainable farming practices and improve the livelihoods of rural communities. It has also implemented several initiatives to reduce its environmental footprint, including the use of renewable energy sources and the reduction of water and energy consumption. In recent years, Prabhat Dairy has faced some challenges, including a decrease in demand for its products due to changing consumer preferences and increased competition from other dairy companies. However, the company has continued to invest in innovation and sustainability and is well-positioned to capitalize on the growing demand for high-quality dairy products in India. 8. Kwality Limited Kwality Limited is an Indian dairy company that has been in operation for over two decades. The company is primarily engaged in the production and sale of milk and milk-based products, including ghee, butter, skimmed milk powder, and milk protein concentrate. Kwality Limited has a strong presence in the Indian dairy market, with a network of over 3,000 milk collection centres and 10 processing plants nationwide. The company is also involved in international trade, exporting its products to more than 20 countries around the world. One of the key strengths of Kwality Limited is its focus on quality and innovation. The company has invested heavily in modernizing its processing facilities and implementing best-in-class quality control measures to ensure that its products are of the highest quality. In addition, Kwality Limited has been at the forefront of innovation in the dairy industry, introducing new products and technologies to meet the changing needs of consumers. For example, the company has developed a range of lactose-free and organic dairy products to cater to consumers with specific dietary requirements. Despite its strengths, Kwality Limited has faced some challenges in recent years. The company has struggled with debt and financial difficulties, which have led to a decline in its market share and profitability. However, the company is taking steps to address these challenges, including restructuring its debt and focusing on cost optimization measures. 9. Hatsun Agro Products Hatsun Agro Products is a leading dairy company in India, known for its high-quality products and commitment to innovation. The company was founded in 1970 and has since grown to become one of the most trusted brands in the dairy industry. One of the key strengths of Hatsun Agro Products is its focus on quality and safety. The company has implemented several measures to ensure the quality of its products, including stringent testing and quality control processes. Hatsun Agro Products also sources its milk from trusted suppliers and has established long-term relationships with local farmers to ensure a steady supply of high-quality milk. Another important aspect of Hatsun Agro Products‘ operations is its commitment to sustainability. The company has implemented several initiatives to reduce its environmental impact, such as using renewable energy sources and minimizing waste. Hatsun Agro Products also works closely with local farmers to promote sustainable agriculture practices and support rural communities. In addition to its focus on quality and sustainability, Hatsun Agro Products is also known for its innovative products. The company has introduced several new products in recent years, such as flavoured milk and ice cream, to cater to changing consumer tastes and preferences. Hatsun Agro Products also offers a wide range of dairy products, including milk, curd, butter, ghee, and more. 10. Karnataka Cooperative Milk Producers Federation (Nandini) Karnataka Cooperative Milk Producers Federation, also known as Nandini, is a dairy cooperative in Karnataka, India. The company was founded in 1984 and has since grown to become one of the largest dairy cooperatives in the country. One of the key strengths of Nandini is its focus on empowering farmers and promoting sustainable agriculture. The company works closely with local farmers, providing them with training and education on best practices for animal care and crop management. Nandini also sources its milk directly from farmers, ensuring fair prices and a steady supply of high-quality milk. Another important aspect of Nandini’s operations is its commitment to quality and safety. The company has implemented several measures to ensure the quality of its products, including rigorous testing and quality control processes. Nandini also adheres to strict safety standards and uses state-of-the-art manufacturing processes to ensure the safety of its products. In addition to its focus on sustainability and quality, Nandini is also known for its wide range of dairy products. The company offers a variety of milk products, including milk, curd, butter, ghee, and more. Nandini’s products are known for their high quality and rich flavour, making them a popular choice among consumers in Karnataka and beyond. 11. Vadilal Industries Vadilal Industries is one of India’s leading ice cream manufacturers, with a history that dates back to 1926. The company is known for its wide range of ice cream flavours and its commitment to quality and innovation. Vadilal Industries produces a variety of ice cream products, including cups, cones, bricks, and family packs. The company’s products are sold under the brand name Vadilal, widely recognized and trusted by consumers across India. One of the key strengths of Vadilal Industries is its focus on quality and innovation. The company uses only the highest quality ingredients in its products and has implemented strict quality control measures to ensure that its products meet the highest standards of safety and quality. In addition, Vadilal Industries has been at the forefront of innovation in the ice cream industry, introducing new flavours and product formats to meet the changing needs and preferences of consumers. For example, the company has developed a range of sugar-free and low-fat ice cream products to cater to consumers with specific dietary requirements. Vadilal Industries is also committed to sustainability and social responsibility. The company has implemented many initiatives to reduce its environmental footprint, including the use of renewable energy sources and the reduction of water and energy consumption. In addition, the company works closely with local farmers to promote sustainable farming practices and improve the livelihoods of rural communities. Despite its strengths, Vadilal Industries has faced some challenges in recent years, including increased competition from other ice cream manufacturers and a decline in demand for its products due to changing consumer preferences. However, the company is taking steps to address these challenges, including investing in marketing and product innovation to stay ahead of the competition. 12. Creamline Dairy Products Creamline Dairy Products is a leading dairy company based in the southern state of Telangana, India. The company produces and markets a wide range of dairy products, including milk, curd, butter, ghee, paneer, and ice cream. One of the key strengths of Creamline Dairy Products is its focus on quality and innovation. The company sources its milk from its dairy farms, which are equipped with state-of-the-art facilities for milking, handling, and processing milk. The company also uses advanced processing technologies to ensure that its products are of the highest quality. In addition, Creamline Dairy Products is committed to innovation and product development. The company has introduced several new products and flavours in recent years to meet the changing needs and preferences of consumers. For example, the company has introduced flavoured milk products, such as chocolate and strawberry milk, which have been well-received by consumers. Creamline Dairy Products is also committed to sustainability and social responsibility. The company works closely with local farmers to promote sustainable farming practices and improve the livelihoods of rural communities. The company also operates a dairy development program to help farmers improve their productivity and income. Despite its strengths, Creamline Dairy Products has faced some challenges in recent years, including increased competition from other dairy companies and a decline in demand for its products due to the COVID-19 pandemic. However, the company has responded to these challenges by investing in marketing and product innovation to stay ahead of the competition. 13. Ananda Dairy Ananda Dairy is a leading dairy company in India, known for its high-quality products and commitment to sustainability. The company was founded in 1989 and has since grown to become one of the most trusted brands in the dairy industry. One of the key strengths of Ananda Dairy is its focus on quality and safety. The company has implemented several measures to ensure the quality of its products, including rigorous testing and quality control processes. Ananda Dairy also sources its milk from trusted suppliers and has established long-term relationships with local farmers to ensure a steady supply of high-quality milk. Another important aspect of Ananda Dairy’s operations is its commitment to sustainability. The company has implemented several initiatives to reduce its environmental impact, such as using renewable energy sources and minimizing waste. Ananda Dairy also works closely with local farmers to promote sustainable agriculture practices and support rural communities. In addition to its focus on quality and sustainability, Ananda Dairy is also known for its innovative products. The company has introduced several new products in recent years, such as flavoured milk and paneer, to cater to changing consumer tastes and preferences. Ananda Dairy also offers a wide range of dairy products, including milk, curd, butter, ghee, and more. 14. Gokul Dairy Gokul Dairy is a dairy company based in the state of Maharashtra, India. The company is known for its high-quality dairy products, which include milk, curd, butter, ghee, paneer, and ice cream. One of the key strengths of Gokul Dairy is its focus on quality and innovation. The company sources its milk from its network of dairy farms, which are equipped with modern facilities for milking, handling, and processing milk. The company also uses advanced processing technologies to ensure that its products are of the highest quality In addition, Gokul Dairy is committed to innovation and product development. The company has introduced several new products and flavours in recent years to meet the changing needs and preferences of consumers. For example, the company has introduced a range of flavoured milk products, such as chocolate and mango milk, which have been well received by consumers. Gokul Dairy is also committed to sustainability and social responsibility. The company works closely with local farmers to promote sustainable farming practices and improve the livelihoods of rural communities. The company also operates a dairy development program to help farmers improve their productivity and income. Despite its strengths, Gokul Dairy has faced some challenges in recent years, including increased competition from other dairy companies and a decline in demand for its products due to the COVID-19 pandemic. However, the company has responded to these challenges by investing in marketing and product innovation to stay ahead of the competition. 15. Milma (Kerala Cooperative Milk Marketing Federation) The Kerala Cooperative Milk Marketing Federation, also known as Milma, is a dairy cooperative in the state of Kerala, India. The company was established in 1980 to support local dairy farmers and promote the growth of the dairy industry in Kerala. One of the key strengths of Milma is its focus on empowering local farmers and promoting sustainable agriculture. The company works closely with over 10,000 farmers across Kerala, providing them with training and education on best practices for animal care and crop management. Milma also sources its milk directly from farmers, ensuring fair prices and a steady supply of high-quality milk. Another important aspect of Milma’s operations is its commitment to quality and safety. The company has implemented several measures to ensure the quality of its products, including rigorous testing and quality control processes. Milma also adheres to strict safety standards and uses state-of-the-art manufacturing processes to ensure the safety of its products. In addition to its focus on sustainability and quality, Milma is also known for its wide range of dairy products. The company offers a variety of milk products, including milk, curd, butter, ghee, and more. Milma’s products are known for their high quality and rich flavour, making them a popular choice among consumers in Kerala and beyond. 16. Schreiber Dynamix Dairies Schreiber Dynamix Dairies is a leading dairy company in India, known for its high-quality products and innovative approach to the dairy industry. The company was founded in 2001 as a joint venture between Schreiber Foods, Inc. and the Indian company Dynamix Dairies. One of the key strengths of Schreiber Dynamix Dairies is its focus on innovation and technology. The company has invested heavily in state-of-the-art manufacturing facilities and advanced production processes, which enable it to produce a wide range of high-quality dairy products. Schreiber Dynamix Dairies also has a strong research and development team that is constantly working to develop new products and improve existing ones. Another important aspect of Schreiber Dynamix Dairies’ operations is its commitment to sustainability. The company has implemented several initiatives to reduce its environmental impact, such as using renewable energy sources and minimizing waste. Schreiber Dynamix Dairies also works closely with local farmers to promote sustainable agriculture practices and support rural communities. In addition to its focus on innovation and sustainability, Schreiber Dynamix Dairies is also known for its wide range of dairy products. The company offers a variety of milk products, including milk, curd, butter, ghee, and more. Schreiber Dynamix Dairies’ products are known for their high quality and rich flavour, making them a popular choice among consumers in India and beyond. 17. Danone India Danone India is a subsidiary of the French multinational food company, Danone. The company is known for its wide range of food and beverage products, including dairy, plant-based, and medical nutrition products. One of the key strengths of Danone India is its focus on health and nutrition. The company’s products are designed to promote health and wellness and to meet the nutritional needs of different segments of the population. For example, the company offers a range of dairy products that are low in fat and sugar and enriched with vitamins and minerals. In addition, Danone India is committed to sustainability and social responsibility. The company works closely with local farmers to promote sustainable farming practices and improve the livelihoods of rural communities. The company also operates several initiatives to promote recycling and reduce waste. Danone India has also been a pioneer in the area of probiotics. The company’s probiotic products are designed to improve gut health and boost the immune system. Danone India has invested heavily in research and development to improve the effectiveness of its probiotic products. Despite its strengths, Danone India has faced some challenges in recent years, including increased competition from other food and beverage companies and a decline in demand for some of its products due to the COVID-19 pandemic. However, the company has responded to these challenges by investing in marketing and product innovation to stay ahead of the competition. 18. Agro Tech Foods Agro Tech Foods Limited is a leading food company in India that is known for its range of high-quality packaged foods, including cooking oils, snacks, and ready-to-eat meals. One of the key strengths of Agro Tech Foods is its focus on quality and innovation. The company uses state-of-the-art technology and processes to ensure that its products are of the highest quality. In addition, the company is committed to innovation and product development and has introduced several new products and flavours in recent years to meet the changing needs and preferences of consumers. Agro Tech Foods is also committed to sustainability and social responsibility. The company works closely with farmers and suppliers to promote sustainable agriculture and reduce the environmental impact of its operations. The company also operates several initiatives to support the communities where it operates. Despite its strengths, Agro Tech Foods has faced some challenges in recent years, including increased competition from other food companies and a decline in demand for some of its products due to the COVID-19 pandemic. However, the company has responded to these challenges by investing in marketing and product innovation to stay ahead of the competition. 19. Tirumala Milk Products Tirumala Milk Products is a leading dairy company in India that is known for its high-quality dairy products and commitment to sustainability. The company was founded in 1996 and is based in Hyderabad, India. One of the key strengths of Tirumala Milk Products is its focus on sustainability. The company has implemented several initiatives to reduce its environmental impact, such as using renewable energy sources and minimizing waste. Tirumala Milk Products also works closely with local farmers to promote sustainable agriculture practices and support rural communities. Another important aspect of Tirumala Milk Products’ operations is its commitment to quality. The company has implemented several measures to ensure the quality of its products, including rigorous testing and quality control processes. Tirumala Milk Products also uses state-of-the-art manufacturing processes to ensure the safety of its products. In addition to its focus on sustainability and quality, Tirumala Milk Products is also known for its wide range of dairy products. The company offers a variety of milk products, including milk, curd, butter, ghee, and more. Tirumala Milk Products’ products are known for their high quality and rich flavour, making them a popular choice among consumers in India and beyond. 20. Umang Dairies Umang Dairies is a leading dairy company in India that is known for its high-quality dairy products and innovative approach to the dairy industry. The company was founded in 1994 and is based in Gujarat, India. One of the key strengths of Umang Dairies is its focus on innovation and technology. The company has invested heavily in state-of-the-art manufacturing facilities and advanced production processes, which enable it to produce a wide range of high-quality dairy products. Umang Dairies also has a strong research and development team that is constantly working to develop new products and improve existing ones. Another important aspect of Umang Dairies’ operations is its commitment to sustainability. The company has implemented several initiatives to reduce its environmental impact, such as using renewable energy sources and minimizing waste. Umang Dairies also works closely with local farmers to promote sustainable agriculture practices and support rural communities. In addition to its focus on innovation and sustainability, Umang Dairies is also known for its wide range of dairy products. The company offers a variety of milk products, including milk, curd, butter, ghee, and more. Umang Dairies’ products are known for their high quality and rich flavour, making them a popular choice among consumers in India and beyond. Conclusion: In conclusion, the dairy industry in India is a rapidly growing sector, and the top 20 dairy product manufacturing companies in India play a vital role in providing high-quality dairy products to the Indian market. These companies have a strong focus on quality, innovation, and sustainability, and are committed to meeting the changing needs and preferences of consumers. The dairy industry in India is driven by a growing population, rising disposable incomes, and increasing awareness of the health benefits of dairy products. As a result, these top 20 dairy product manufacturing companies are investing heavily in research and development to improve the quality and nutritional value of their products, as well as in marketing and distribution to reach new customers and expand their market share. In addition, these companies are also committed to sustainability and social responsibility and are working closely with farmers and suppliers to promote sustainable agriculture, reduce environmental impact, and improve the livelihoods of rural communities.","filter_flag":1}
