{"title":"13 Flowers Foods bakeries attain 2022 ENERGY STAR certification - Snack Food & Wholesale Bakery","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnNuYWNrYW5kYmFrZXJ5LmNvbS9hcnRpY2xlcy8xMDg1MTUtMTMtZmxvd2Vycy1mb29kcy1iYWtlcmllcy1hdHRhaW4tMjAyMi1lbmVyZ3ktc3Rhci1jZXJ0aWZpY2F0aW9u0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnNuYWNrYW5kYmFrZXJ5LmNvbS9hcnRpY2xlcy8xMDg1MTUtMTMtZmxvd2Vycy1mb29kcy1iYWtlcmllcy1hdHRhaW4tMjAyMi1lbmVyZ3ktc3Rhci1jZXJ0aWZpY2F0aW9u0gEA?oc=5","id":"CBMibmh0dHBzOi8vd3d3LnNuYWNrYW5kYmFrZXJ5LmNvbS9hcnRpY2xlcy8xMDg1MTUtMTMtZmxvd2Vycy1mb29kcy1iYWtlcmllcy1hdHRhaW4tMjAyMi1lbmVyZ3ktc3Rhci1jZXJ0aWZpY2F0aW9u0gEA","guidislink":false,"published":"Wed, 01 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=1, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=60, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnNuYWNrYW5kYmFrZXJ5LmNvbS9hcnRpY2xlcy8xMDg1MTUtMTMtZmxvd2Vycy1mb29kcy1iYWtlcmllcy1hdHRhaW4tMjAyMi1lbmVyZ3ktc3Rhci1jZXJ0aWZpY2F0aW9u0gEA?oc=5\" target=\"_blank\">13 Flowers Foods bakeries attain 2022 ENERGY STAR certification<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Snack Food & Wholesale Bakery<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"13 Flowers Foods bakeries attain 2022 ENERGY STAR certification - Snack Food & Wholesale Bakery","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnNuYWNrYW5kYmFrZXJ5LmNvbS9hcnRpY2xlcy8xMDg1MTUtMTMtZmxvd2Vycy1mb29kcy1iYWtlcmllcy1hdHRhaW4tMjAyMi1lbmVyZ3ktc3Rhci1jZXJ0aWZpY2F0aW9u0gEA?oc=5\" target=\"_blank\">13 Flowers Foods bakeries attain 2022 ENERGY STAR certification<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Snack Food & Wholesale Bakery<\/font>","source.href":"https:\/\/www.snackandbakery.com","source.title":"Snack Food & Wholesale Bakery","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy-Saving Measures\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Thirteen Flowers Foods, Inc. bakeries earned ENERGY STAR certification in 2022; of those recognized, more than half have made the list at least six times. To receive ENERGY STAR certification, bakeries must score in the top 25% of all U.S. commercial bread and roll bakeries for energy efficiency and meet strict energy efficiency performance levels set by the Environmental Protection Agency (EPA). “In the 2022 ENERGY STAR class, nearly 40% of the bakeries that achieved certification are part of the Flowers network,” said Margaret Ann Marsh, vice president of sustainability and environmental at Flowers Foods. “I’m incredibly proud of their collective efforts to help lead the industry and our network of Flowers bakeries in sustainable operations. Each certified location has played a critical role in helping our company lower greenhouse gas emissions by 22% since 2015.” Flowers’ bakeries that earned ENERGY STAR certification in 2022 include: Seven-time honorees Holsum Bakery of Tolleson (Ariz.) Flowers Baking Co. of El Paso (Texas)* Flowers Baking Co. of Norfolk (Va.)* Six-time honorees Dave’s Killer Bread (Ore.)* Flowers Baking Co. of New Orleans (La.)* Flowers Baking Co. of Tyler (Texas) Lynchburg Organic Baking Co. (Va.)* Five-time honorees Flowers Baking Co. of Batesville (Ark.) Tuscaloosa Organic Baking Co. (Ala.) Four-time honorees Mesa Organic Baking Co. (Ariz.)* Flowers Baking Co. of Henderson (Nev.)* Three-time honorees Flowers Baking Co. of Houston (Texas) Two-time honoree Lepage Bakeries – Park Street (Maine) * Scored in the top 10% of U.S. commercial bread and roll bakeries. All Flowers locations continuously monitor energy and emissions with an online energy management program that identifies and helps resolve unusual changes in energy consumption. The company seeks opportunities to improve the energy efficiency of its operations, especially when upgrading equipment or installing new lines. Examples of energy-saving measures include LED lighting, compressed air upgrades, and heat recovery projects that reuse waste from ovens to heat water and warm the bakery.","filter_flag":1}
{"title":"Czechia refills rooftop PV rebate pot – pv magazine International - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzAzLzI5L2N6ZWNoaWEtcmVmaWxscy1yb29mdG9wLXB2LXJlYmF0ZS1wb3Qv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzAzLzI5L2N6ZWNoaWEtcmVmaWxscy1yb29mdG9wLXB2LXJlYmF0ZS1wb3Qv0gEA?oc=5","id":"CBMiTWh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzAzLzI5L2N6ZWNoaWEtcmVmaWxscy1yb29mdG9wLXB2LXJlYmF0ZS1wb3Qv0gEA","guidislink":false,"published":"Wed, 29 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=88, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzAzLzI5L2N6ZWNoaWEtcmVmaWxscy1yb29mdG9wLXB2LXJlYmF0ZS1wb3Qv0gEA?oc=5\" target=\"_blank\">Czechia refills rooftop PV rebate pot – pv magazine International<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Czechia refills rooftop PV rebate pot – pv magazine International - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzAzLzI5L2N6ZWNoaWEtcmVmaWxscy1yb29mdG9wLXB2LXJlYmF0ZS1wb3Qv0gEA?oc=5\" target=\"_blank\">Czechia refills rooftop PV rebate pot – pv magazine International<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy-Saving Measures\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"The EU has projected that 25% of Europe's electricity needs could be met through rooftop solar alone. The Czech Ministry of the Environment has revealed that it has secured new funds from the European Union for its New Green Savings program. It has unveiled plans to cut red tape and bring more households into the program from September. The urgency of last year’s energy crisis resulted in enormous interest in energy-saving subsidies. The CZK 19 billion earmarked from the National Recovery Plan to finance the New Green Savings program were used up two years earlier than planned. “Just in the last year and a half, from October 2021, a record 110,000 households applied for a subsidy. This far exceeded the total number of applications received in the previous seven years of the program,” said Minister of the Environment Petr Hladik. “For example, we have seen a threefold year-on-year increase in PV rebate demand.” Since its launch in 2014, the New Green Savings program has supported 180,000 households to the tune of CZK 22 billion. Its original focus was on energy savings in the residential sector through the renovation and construction of low-energy family and apartment buildings. However, most of the funding is now being used for rooftop PV rebates. The Czech government managed to negotiate an additional CZK 55 billion from the Modernization Fund, which was set up by the European Union in 2021 to help 10 member states upgrade grids and meet 2030 energy targets. To date, resources in the Modernization Fund were available solely for utility-scale PV in Czechia. According to the Czech government, the revamped program will bring many improvements. The process from submission to subsidy payments will be simplified. Some criteria will be relaxed, and the obligation to submit invoices and project documentation will be removed. Popular content Furthermore, the new program should make subsidies under the New Green Savings Light more readily available for vulnerable groups, including senior citizens and low-income households. Subsidies for more demanding home modifications will be automatically increased. Regarding ​​new builds, support will be directed towards buildings in which the effect of energy savings would be the highest. On top of that, subsidies to replace old gas boilers with heat pumps will be offered, including grants for retrofit installations up to €5,701. After a short technical and operational break necessary to implement the new procedures, the program will relaunch in September. All applicant with projects in progress, according to existing conditions, are recommended to submit their applications by June 30. The detailed conditions of support in the revamped program will be gradually introduced in the coming months, said the ministry. Jan Krcmar, chairman of the Czech Solar Association (CSA), said the transition is expected to run smoothly and no rush in applications is expected by the end of June. “We welcome this greatly, but we also hope that the updated program will be able to react to the current situation in the market,” Krcmar told pv magazine. “Grid bottlenecks currently mean that in some regions customers can only connect new PV without any surplus energy being fed into the grid and are experiencing long waiting times for PV to be connected, sometimes more than half a year.” As the payout of the rebate is linked to the connection, many customers wait almost a year to receive the money. This has a knock-on effect on installers, who are usually fully paid only after the rebate has been settled, explained Krcmar.","filter_flag":1}
