{"title":"How AI Can Speed-Up Climate Action | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LWFpLWNhbi1zcGVlZHVwLWNsaW1hdGUtYWN0aW9u0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LWFpLWNhbi1zcGVlZHVwLWNsaW1hdGUtYWN0aW9u0gEA?oc=5","id":"CBMiR2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LWFpLWNhbi1zcGVlZHVwLWNsaW1hdGUtYWN0aW9u0gEA","guidislink":false,"published":"Mon, 20 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=20, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=324, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LWFpLWNhbi1zcGVlZHVwLWNsaW1hdGUtYWN0aW9u0gEA?oc=5\" target=\"_blank\">How AI Can Speed-Up Climate Action | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How AI Can Speed-Up Climate Action | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LWFpLWNhbi1zcGVlZHVwLWNsaW1hdGUtYWN0aW9u0gEA?oc=5\" target=\"_blank\">How AI Can Speed-Up Climate Action | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"With the world on a path to fail to meet the Paris Agreement’s goal to keep warming under 1.5° Celsius, there is an urgent need to accelerate climate action. To get back on track, a substantial reduction in emissions—to 57% of 2010’s level—is required by 2030. And leveraging AI for climate change has enormous promise given the technology’s strength in understanding and modeling complex systems. Accelerating Climate Action with AI—a new BCG report commissioned by and co-authored with Google—finds that deploying today’s AI technology and scaling has already proven that AI applications for climate can significantly reduce global greenhouse gas (GHG) emissions. Moreover, it outlines how AI can also substantially enhance climate-related adaptation and resilience efforts and shape climate-friendly behaviors. It also discusses AI’s potential to contribute to groundbreaking scientific discoveries—for example, in nuclear fusion—that open new avenues for climate action. The report also spotlights early success stories, explores AI-related risks and options to address them, and summarizes opportunities for policymakers and business leaders to maximize the benefits and minimize the risks of AI for climate change. Six Takeaways on AI for Climate Change 1. By scaling currently proven applications and technology, AI has the potential to unlock insights that could help mitigate 5% to 10% of GHG emissions by 2030—and to significantly bolster climate-related adaptation and resilience initiatives. 2. Beyond helping to reduce emissions and enhance the resilience of communities and infrastructure, AI can accelerate climate action by taking climate modeling to the next level, enabling new approaches to climate education, and supporting breakthroughs in climate science, climate economics, and fundamental research. 3. AI’s strengths in curating information, enhancing prediction, and guiding optimization can speed progress in three crucial areas: Mitigating emissions Supporting adaptation and resilience to unavoidable climate impacts Enhancing the state of the art in climate modeling, climate economics, climate education, and climate-related basic research 4. While AI is only just starting to be applied to climate challenges, leading-edge organizations and use cases are already achieving real results—and demonstrating the potential of AI for climate change if adopted at scale. And 87% of executives believe AI has potential to address their climate challenges. 5. AI, of course, also poses risks—data center emissions, water use for data center cooling, and electronic waste as well as broader concerns about equity and privacy—that must be managed thoughtfully. And organizations have options and are already taking steps to mitigate risks. 6. Policymakers have three critical oversight roles to play in maximizing the benefits and minimizing the risks of AI for climate. The report details three critical policy outcomes, offering a potential list of supporting policy moves and policy examples (see the exhibit below) for each:","filter_flag":1}
{"title":"Philips and sustainability at COP28 - News - Philips","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiuAFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMTEzMC1jb3AyOC10ZWFtaW5nLXVwLWZvci1zdXN0YWluYWJsZS1hbmQtYWNjZXNzaWJsZS1oZWFsdGhjYXJlLXdpdGgtcGFydG5lcnMtYWNyb3NzLXRoZS12YWx1ZS1jaGFpbi5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiuAFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMTEzMC1jb3AyOC10ZWFtaW5nLXVwLWZvci1zdXN0YWluYWJsZS1hbmQtYWNjZXNzaWJsZS1oZWFsdGhjYXJlLXdpdGgtcGFydG5lcnMtYWNyb3NzLXRoZS12YWx1ZS1jaGFpbi5odG1s0gEA?oc=5","id":"CBMiuAFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMTEzMC1jb3AyOC10ZWFtaW5nLXVwLWZvci1zdXN0YWluYWJsZS1hbmQtYWNjZXNzaWJsZS1oZWFsdGhjYXJlLXdpdGgtcGFydG5lcnMtYWNyb3NzLXRoZS12YWx1ZS1jaGFpbi5odG1s0gEA","guidislink":false,"published":"Thu, 30 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=30, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=334, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiuAFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMTEzMC1jb3AyOC10ZWFtaW5nLXVwLWZvci1zdXN0YWluYWJsZS1hbmQtYWNjZXNzaWJsZS1oZWFsdGhjYXJlLXdpdGgtcGFydG5lcnMtYWNyb3NzLXRoZS12YWx1ZS1jaGFpbi5odG1s0gEA?oc=5\" target=\"_blank\">Philips and sustainability at COP28 - News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philips<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Philips and sustainability at COP28 - News - Philips","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiuAFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMTEzMC1jb3AyOC10ZWFtaW5nLXVwLWZvci1zdXN0YWluYWJsZS1hbmQtYWNjZXNzaWJsZS1oZWFsdGhjYXJlLXdpdGgtcGFydG5lcnMtYWNyb3NzLXRoZS12YWx1ZS1jaGFpbi5odG1s0gEA?oc=5\" target=\"_blank\">Philips and sustainability at COP28 - News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philips<\/font>","source.href":"https:\/\/www.philips.com","source.title":"Philips","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"On December 3, COP28 will host its first ever dedicated Health Day, addressing growing and urgent worldwide concern about the impact of climate change on people’s health. In the run-up to COP28, we spoke with Robert Metzke, Global Head of Sustainability, on how Philips has continued to make steps to embed sustainability and climate action in healthcare delivery. With its Scope 1 (internal) and Scope 2 (energy sourcing) emissions firmly under control, the company has turned its sights on partnering to reduce its Scope 3 emissions – those beyond its direct control – to ensure end-to-end value chain sustainability. In early 2023, Philips became the first health technology company to have its entire value-chain CO₂ emissions reduction targets approved by the Science Based Targets initiative (SBTi). What is Philips’ focus at COP28? Robert Metzke: One of the best parts of my job is engaging with inspiring thinkers - from international organizations, governments, business companies and civil society - to learn from each other’s expertise, share our own experience, embrace new ways of thinking and operating, and galvanize shared action to tackle global challenges. Our focus at COP28 is extending our sustainability impact with the healthcare industry by engaging with governments and partner stakeholders. In the healthcare industry, there’s strong global momentum – a huge number of care providers recognize that they need to tackle their impact on the environment, in terms of both carbon emissions and beyond. In our conversations with hospitals, they tell us they want to commit to become carbon neutral. We can help them start and scale with our decades of experience, our in-house expertise, successful case studies and best practices. In healthcare, the main share of carbon emissions (71%) are indirect emissions caused by the production and transportation of goods and services that hospitals purchase, such as medicines, food, equipment, clothing, and waste treatment [1]. Reducing these is a big opportunity. The good news is that suppliers are also focused on this topic, where increasingly a combination of legislation, transparency, reporting pressure, and employees who prefer to work for sustainable companies is driving change. The critical part is the capability to act. Philips builds capabilities with its customer and suppliers, providing very practical help. What capabilities does Philips have to contribute the improving sustainability in healthcare? Robert: Underpinned by innovation, digitalization and collaboration, Philips’ efforts to drive sustainable healthcare are based on 1) Energy efficiency within the company’s own operations and across our product portfolio, with an added focus on reducing the amount of energy its products consume when in use; 2) Resource efficiency to maximize the value of our products and solutions over their lifetime, while minimizing material and resource use and reducing waste; 3) Care pathway optimization by co-creating new (digital and circular) health solutions that reduce healthcare’s carbon footprint and enable the delivery of quality care to those who need it, especially in medically underserved communities. What approaches is Philips taking to achieve its energy and resource efficiency goals? Robert: Since 2020 our global operation is carbon neutral, using 100% renewable electricity. We continue to build new partnerships for renewable electricity.” An example is the consortium led renewable energy power purchase agreements (PPAs) through which Philips and global brewing company HEINEKEN agreed to purchase the output of energy company Cero Generation’s new 70MW Pontinia agrivoltaic solar farm project in Lazio, Italy. The agricultural element of the project will also provide crop-growing experience and training to vulnerable and socially excluded people in the Lazio region. ","filter_flag":1}
{"title":"IBM Furthers Commitment to Climate Action Through New Sustainability Projects and Free Training in Green and ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi0QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2libS1mdXJ0aGVycy1jb21taXRtZW50LXRvLWNsaW1hdGUtYWN0aW9uLXRocm91Z2gtbmV3LXN1c3RhaW5hYmlsaXR5LXByb2plY3RzLWFuZC1mcmVlLXRyYWluaW5nLWluLWdyZWVuLWFuZC10ZWNobm9sb2d5LXNraWxscy1mb3ItdnVsbmVyYWJsZS1jb21tdW5pdGllcy0zMDE5ODk5NzEuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi0QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2libS1mdXJ0aGVycy1jb21taXRtZW50LXRvLWNsaW1hdGUtYWN0aW9uLXRocm91Z2gtbmV3LXN1c3RhaW5hYmlsaXR5LXByb2plY3RzLWFuZC1mcmVlLXRyYWluaW5nLWluLWdyZWVuLWFuZC10ZWNobm9sb2d5LXNraWxscy1mb3ItdnVsbmVyYWJsZS1jb21tdW5pdGllcy0zMDE5ODk5NzEuaHRtbNIBAA?oc=5","id":"CBMi0QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2libS1mdXJ0aGVycy1jb21taXRtZW50LXRvLWNsaW1hdGUtYWN0aW9uLXRocm91Z2gtbmV3LXN1c3RhaW5hYmlsaXR5LXByb2plY3RzLWFuZC1mcmVlLXRyYWluaW5nLWluLWdyZWVuLWFuZC10ZWNobm9sb2d5LXNraWxscy1mb3ItdnVsbmVyYWJsZS1jb21tdW5pdGllcy0zMDE5ODk5NzEuaHRtbNIBAA","guidislink":false,"published":"Thu, 16 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=16, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=320, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi0QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2libS1mdXJ0aGVycy1jb21taXRtZW50LXRvLWNsaW1hdGUtYWN0aW9uLXRocm91Z2gtbmV3LXN1c3RhaW5hYmlsaXR5LXByb2plY3RzLWFuZC1mcmVlLXRyYWluaW5nLWluLWdyZWVuLWFuZC10ZWNobm9sb2d5LXNraWxscy1mb3ItdnVsbmVyYWJsZS1jb21tdW5pdGllcy0zMDE5ODk5NzEuaHRtbNIBAA?oc=5\" target=\"_blank\">IBM Furthers Commitment to Climate Action Through New Sustainability Projects and Free Training in Green and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"IBM Furthers Commitment to Climate Action Through New Sustainability Projects and Free Training in Green and ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi0QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2libS1mdXJ0aGVycy1jb21taXRtZW50LXRvLWNsaW1hdGUtYWN0aW9uLXRocm91Z2gtbmV3LXN1c3RhaW5hYmlsaXR5LXByb2plY3RzLWFuZC1mcmVlLXRyYWluaW5nLWluLWdyZWVuLWFuZC10ZWNobm9sb2d5LXNraWxscy1mb3ItdnVsbmVyYWJsZS1jb21tdW5pdGllcy0zMDE5ODk5NzEuaHRtbNIBAA?oc=5\" target=\"_blank\">IBM Furthers Commitment to Climate Action Through New Sustainability Projects and Free Training in Green and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"New sustainability projects: including collaborations with The University of Sharjah (UAE); The University of Chicago Trust ( India ); The University of Illinois (U.S.); Instituto IGUÁ ( Brazil ); and Water Corporation ( Australia ) Training: IBM SkillsBuild launches roadmap of sustainability courses to benefit learners across communities underrepresented in technology and address market need for green and technology skills ARMONK, N.Y., Nov. 16, 2023 \/PRNewswire\/ -- As vulnerable communities worldwide continue to suffer outsized effects of climate change, IBM (NYSE: IBM) is empowering innovators with cutting-edge technologies and training. Ahead of COP28, IBM announced the latest investments in its effort to advance environmental sustainability through its social impact programs. A new set of environmental initiatives pioneering water solutions will be scaled through the IBM Sustainability Accelerator to benefit local communities across the globe. Simultaneously, a first-of-its-kind roadmap of sustainability skills courses, available for free through IBM SkillsBuild, will empower future climate action. \"With nearly half of the global population vulnerable to significant environmental distress, new strategies to help create a sustainable future are essential,\" said Justina Nixon-Saintil, IBM Vice President & Chief Impact Officer. \"This means scaling solutions to help people immediately, while also cultivating a pipeline of future leaders at the intersection of technology and sustainability across industries.\" New IBM Sustainability Accelerator partners and projects: IBM is furthering its commitment to sustainable innovation with projects focused on water management solutions as part of its global social impact program, the IBM Sustainability Accelerator. The 2023 IPCC AR6 Synthesis Report identified that 3.3 billion people live in areas vulnerable to significant impacts from climate change1. With a commitment of $30 million worth of technology and services by IBM through the end of 2025, the program is adding five new projects focused on water management, offering IBM technologies, such as watsonx, and an ecosystem of experts. The University of Sharjah will build a model and application to monitor and forecast water access conditions in the Middle East and North Africa , to help support communities in arid and semi-arid regions with limited renewable internal freshwater resources. will build a model and application to monitor and forecast water access conditions in the and , to help support communities in arid and semi-arid regions with limited renewable internal freshwater resources. The University of Chicago Trust in Bangalore will aggregate water quality information in India ; build and deploy tools designed to democratize access to water quality information and help improve water resource management for key government and nonprofit organizations. will aggregate water quality information in ; build and deploy tools designed to democratize access to water quality information and help improve water resource management for key government and nonprofit organizations. The University of Illinois will develop an AI geospatial foundation model to help predict rain fall and flood forecasting in mountain headwaters across the Appalachian Mountains in the U.S. will develop an AI geospatial foundation model to help predict rain fall and flood forecasting in mountain headwaters across the Appalachian Mountains in the U.S. Instituto IGUÁ will create a cloud-based platform for sanitation infrastructure planning in Brazil , alongside local utility providers and governments. will create a cloud-based platform for sanitation infrastructure planning in , alongside local utility providers and governments. Water Corporation will design a self-administered water quality testing system for Aboriginal communities in Western Australia . The IBM Sustainability Accelerator program is already supporting communities in the Americas, Europe, Africa and Asia on sustainable agriculture and clean energy efforts. New IBM SkillsBuild Sustainability Roadmap New research from IBM and Morning Consult confirms a growing skills gap in sustainability that poses a threat to the workforce across industries. 71% of business leaders surveyed anticipate their business will emphasize sustainability skills criteria in their hiring in the next two years, with 92% expecting to invest in sustainability training in the next year. To help build this pipeline of sustainability talent, IBM SkillsBuild is providing free training that connects cutting edge technologies to ecology and climate change. With AI-powered recommendations available for each learner, this interdisciplinary coursework connect topics such as ecology and biodiversity, with technology training in AI and data analytics. This is a comprehensive curriculum to help equip the next generation of leaders with skills for the green economy. Learners can benefit from a holistic environmental tech training journey from IBM SkillsBuild with digital credentials available each step of the way. Introductory courses will help establish a foundation with historical insights and fundamentals to connect sustainability and technology. will help establish a foundation with historical insights and fundamentals to connect sustainability and technology. Mid-level offerings in design thinking and green entrepreneurship will encourage learners to grow their skills. offerings in design thinking and green entrepreneurship will encourage learners to grow their skills. Advanced coursework will ask learners to apply their skills to sustainability topics across AI, cybersecurity, and ESG reporting. These offerings build on IBM's commitment to skill 30 million people by 2030, with a focus on underrepresented communities. Through collaborations across social service, economic development, and vocational organizations, as well as government agencies, and universities, IBM SkillsBuild makes free online learning widely available, to communities that are underrepresented in technology. These include organizations that will help skill women, including mothers returning to the workforce, ethnic minorities, low-income individuals, and refugees. Read more about the programs here. About IBM Sustainability Accelerator Launched in February 2022 , the IBM Sustainability Accelerator is a social impact program that addresses multiple environmental threats around the world. Each year, the accelerator selects five projects to scale solutions that benefit communities that face challenges such as climate change, pollution, extreme weather and more. The program currently has three active cohorts; the first one is focused on sustainable agriculture, the second on clean energy, and the third on water and sanitation. For more information, visit https:\/\/www.ibm.com\/impact\/initiatives\/ibm-sustainability-accelerator About IBM SkillsBuild IBM SkillsBuild is a free education program focused on underrepresented communities in tech, that helps adult learners, and high school and university students and faculty, develop valuable new skills and access career opportunities. The program includes an online platform that is complemented by customized practical learning experiences delivered in collaboration with a global network of partners. The open version of IBM SkillsBuild is an online platform offering over 1,000 courses in 20 languages on AI, cybersecurity, data analysis, cloud computing, and many other technical disciplines — as well as in workplace skills such as Design Thinking. Most importantly, participants can earn IBM-branded digital credentials that are recognized by the market. The enhanced partner version of IBM SkillsBuild may also include workshops, expert conversations with IBM coaches and mentors, project-based learning, access to IBM software, specialized support from partners through the learning process, and connection to career opportunities. Visit skillsbuild.org to learn more. Media Contacts: Deirdre Leahy Hart IBM Media Relations [email protected] Fernando Arreaza Vargas IBM Media Relations [email protected] 1 AR6 Synthesis Report, A.2.2, from IPCC, 2023: Summary for Policymakers. In: Climate Change 2023: Synthesis Report. Contribution of Working Groups I, II and III to the Sixth Assessment Report of the Intergovernmental Panel on Climate Change [Core Writing Team, H. Lee and J. Romero (eds.)]. IPCC, Geneva, Switzerland, pp. 1-34, doi: 10.59327\/IPCC\/AR6-9789291691647.001). SOURCE IBM","filter_flag":1}
{"title":"Sonos Reports Progress Made Against Climate Action Plan, Showcases Commitment to Product Longevity and ... - Yahoo Finance","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb25vcy1yZXBvcnRzLXByb2dyZXNzLW1hZGUtYWdhaW5zdC0xNDAwMDAwMDkuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb25vcy1yZXBvcnRzLXByb2dyZXNzLW1hZGUtYWdhaW5zdC0xNDAwMDAwMDkuaHRtbNIBAA?oc=5","id":"CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb25vcy1yZXBvcnRzLXByb2dyZXNzLW1hZGUtYWdhaW5zdC0xNDAwMDAwMDkuaHRtbNIBAA","guidislink":false,"published":"Thu, 30 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=30, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=334, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb25vcy1yZXBvcnRzLXByb2dyZXNzLW1hZGUtYWdhaW5zdC0xNDAwMDAwMDkuaHRtbNIBAA?oc=5\" target=\"_blank\">Sonos Reports Progress Made Against Climate Action Plan, Showcases Commitment to Product Longevity and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sonos Reports Progress Made Against Climate Action Plan, Showcases Commitment to Product Longevity and ... - Yahoo Finance","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb25vcy1yZXBvcnRzLXByb2dyZXNzLW1hZGUtYWdhaW5zdC0xNDAwMDAwMDkuaHRtbNIBAA?oc=5\" target=\"_blank\">Sonos Reports Progress Made Against Climate Action Plan, Showcases Commitment to Product Longevity and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance<\/font>","source.href":"https:\/\/finance.yahoo.com","source.title":"Yahoo Finance","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The company released its 2023 Listen Better Report, detailing actions to build a more sustainable future alongside progress on Social Impact and Diversity, Equity and Inclusion SANTA BARBARA, Calif., November 30, 2023--(BUSINESS WIRE)--Today, Sonos (NASDAQ: SONO) released its annual Listen Better Report, offering a comprehensive overview of the company’s Environmental, Social, and Governance (ESG) efforts. Included in the Report are actions made against Sonos’ Climate Action Plan, introduced in 2021, which serves as a framework to drive the company to carbon neutrality by 2030 and net zero by 2040. \"We aim to build products and experiences that bring joy to people, and to do it in a responsible way. Our Listen Better Report outlines how we’re bringing thoughtful innovation to everything we do in pursuit of helping the world listen better,\" said Patrick Spence, Sonos CEO. \"This year, we expanded our portfolio by unveiling three products that tie together immersive sound and sustainable design.\" Creating responsibly-designed products Building sustainability into product hardware and software is central to Sonos’ efforts to respond to climate change. In 2023, Sonos released three new products that deliver on its commitment to provide innovative sound and superior functionality – while doing so responsibly. Sonos Era 100 and Sonos Era 300 are two all-in-one speakers, featuring stereo sound and spatial audio, respectively. Sonos Move 2 is a premium portable speaker. Sonos Era 100 and Sonos Era 300’s idle power consumption was reduced to under 2 watts, marking Sonos’ first plug-in speakers to reach this milestone. The design of the Sonos Era product line facilitates easy in-region repair, reducing transportation emissions and keeping products and component materials in use longer. Sonos achieved its FY23 circular materials goal by including post consumer recycled (PCR) plastic in all three of its new products, with Sonos Era 100 and Sonos Era 300 utilizing approximately 40% recycled plastic. All Sonos products are wrapped in sustainable packaging, providing superior protection and a premium unboxing experience. Sonos was recognized for its responsible packaging efforts, earning The Dieline’s Best in Show award for the Sonos Ray and Sub Mini speakers. The packaging team continues to innovate by utilizing Forest Stewardship Council certified paper, recyclable plant-based fibers, and new recycled clip mechanisms. \"We are proud of the progress we’ve made against our Climate Action Plan, which is showcased by our newest products,\" said Deji Olukotun, Sonos Director of Global Affairs and Sustainability. \"We aim to improve each step of our sustainability journey, and our report celebrates the innovative work happening broadly across the company, from product design, to DEI, to supporting the emerging field of ecoacoustics to protect biodiversity.\" Story continues In line with its Climate Action Plan, Sonos shared its Scope 1, 2, and 3 greenhouse gas emissions with the Carbon Disclosure Project (CDP) for the first time, marking a new level of climate transparency. Sonos also reaffirmed its commitment to the Responsible Business Alliance, an industry group that advocates for fair labor practices. Sonos continued its emphasis on privacy, as demonstrated by Sonos Voice Control, which lets you play music and control your system with hands-free ease and unmatched privacy. Sonos Voice Control processes spoken commands and understands requests entirely on the speaker. No audio or transcript is sent to the cloud, stored, listened to, read, or labeled by anyone — so all the conversations in a user’s home remain in the home. Advancing philanthropic efforts and diversity, equity and inclusion This year, Sonos’ social impact program supported over a dozen nonprofits around the world to drive positive impact. Sonos launched a signature partnership with Rainforest Connection, an ecoacoustics nonprofit operating in 35 countries that uses sound and Artificial Intelligence to promote biodiversity and conservation efforts. Sonos support has enabled the Rainforest Connection to record 85,742,731 minutes of nature sounds and to identify 1,442 unique species of wildlife. This acoustic mapping is essential for providing data to preserve these critical habitats. In November, Sonos strengthened its dedication to environmental preservation by joining 1% for the Planet, committing to donate 1% of annual Certified Refurbished sales to support high-impact environmental organizations. Sonos remains committed to giving back to underserved communities by supporting STEAM learning and education for youth from Title I schools, mentorship and music lessons, and effective humanitarian relief worldwide. Continuing its efforts towards Diversity, Equity, & Inclusion (DEI), Sonos’ dedicated DEI team works across the company and tracks progress. In FY23, targeted recruitment attracted more diverse candidates, resulting in a 28.5% increase in historically underrepresented applicants compared to FY22. Our DEI principles guided many of our actions in 2023. We invested in inclusive recruitment and retention, increased transparency with our staff, and incorporated feedback from Employee Resource Groups and other key stakeholders. Sonos achieved a high score of 100 for LGBTQIA+ equity and workplace friendliness in the Human Rights Campaign Corporate Equality Index for the second year in a row. To read the full Sonos 2023 Listen Better Report, please visit sustainability.sonos.com. About Sonos Sonos (Nasdaq: SONO) is the world’s leading sound experience company. As the inventor of multi-room wireless home audio, Sonos innovation helps the world listen better by giving people access to the content they love and allowing them to control it however and wherever they choose. Known for delivering an unparalleled sound experience, thoughtful design aesthetic, simplicity of use, and an open platform, Sonos makes the breadth of audio content available to anyone. Sonos is headquartered in Santa Barbara, California. Learn more at www.sonos.com. View source version on businesswire.com: https:\/\/www.businesswire.com\/news\/home\/20231130201439\/en\/ Contacts Investor Contact James Baglanis IR@sonos.com Press Contact Erin Pategas PR@sonos.com","filter_flag":1}
{"title":"Lilly to expand injectable manufacturing capacity with planned $2.5 billion site in Germany | Eli Lilly and Company - Investors | Eli Lilly and Company","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vaW52ZXN0b3IubGlsbHkuY29tL25ld3MtcmVsZWFzZXMvbmV3cy1yZWxlYXNlLWRldGFpbHMvbGlsbHktZXhwYW5kLWluamVjdGFibGUtbWFudWZhY3R1cmluZy1jYXBhY2l0eS1wbGFubmVkLTI10gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vaW52ZXN0b3IubGlsbHkuY29tL25ld3MtcmVsZWFzZXMvbmV3cy1yZWxlYXNlLWRldGFpbHMvbGlsbHktZXhwYW5kLWluamVjdGFibGUtbWFudWZhY3R1cmluZy1jYXBhY2l0eS1wbGFubmVkLTI10gEA?oc=5","id":"CBMid2h0dHBzOi8vaW52ZXN0b3IubGlsbHkuY29tL25ld3MtcmVsZWFzZXMvbmV3cy1yZWxlYXNlLWRldGFpbHMvbGlsbHktZXhwYW5kLWluamVjdGFibGUtbWFudWZhY3R1cmluZy1jYXBhY2l0eS1wbGFubmVkLTI10gEA","guidislink":false,"published":"Fri, 17 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=17, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=321, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vaW52ZXN0b3IubGlsbHkuY29tL25ld3MtcmVsZWFzZXMvbmV3cy1yZWxlYXNlLWRldGFpbHMvbGlsbHktZXhwYW5kLWluamVjdGFibGUtbWFudWZhY3R1cmluZy1jYXBhY2l0eS1wbGFubmVkLTI10gEA?oc=5\" target=\"_blank\">Lilly to expand injectable manufacturing capacity with planned $2.5 billion site in Germany | Eli Lilly and Company<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investors | Eli Lilly and Company<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Lilly to expand injectable manufacturing capacity with planned $2.5 billion site in Germany | Eli Lilly and Company - Investors | Eli Lilly and Company","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vaW52ZXN0b3IubGlsbHkuY29tL25ld3MtcmVsZWFzZXMvbmV3cy1yZWxlYXNlLWRldGFpbHMvbGlsbHktZXhwYW5kLWluamVjdGFibGUtbWFudWZhY3R1cmluZy1jYXBhY2l0eS1wbGFubmVkLTI10gEA?oc=5\" target=\"_blank\">Lilly to expand injectable manufacturing capacity with planned $2.5 billion site in Germany | Eli Lilly and Company<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investors | Eli Lilly and Company<\/font>","source.href":"https:\/\/investor.lilly.com","source.title":"Investors | Eli Lilly and Company","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Company also commits to investing up to $100 million in German early-stage life sciences ecosystem INDIANAPOLIS , Nov. 17, 2023 \/PRNewswire\/ -- Eli Lilly and Company (NYSE: LLY) today announced plans to construct a new $2.5 billion high-tech manufacturing site in Alzey, Rhineland-Palatinate, Germany . This new facility will further expand the company's global parenteral (injectable) product and device manufacturing network and support an increased demand for Lilly 's medicines, including its diabetes and obesity portfolio. The company has launched 21 treatments since 2014 and plans to launch several more in the coming years. \"Every investment into our manufacturing capacity around the world is a renewed commitment to patients today – and to those who may need our medicines tomorrow,\" said Edgardo Hernandez, executive vice president and president, Lilly manufacturing operations. \"This state-of-the-art parenteral site with the latest technology will enable us to continue to deliver medicines with safety first and quality always around the world.\" With the planned manufacturing facility in Alzey, Lilly will operate a total of six manufacturing sites in Europe , including one in nearby Fegersheim, France . Lilly 's ongoing investments in Europe will create operational synergies, strengthen university and government relationships, support the early-stage life science ecosystem, and diversify the growing Lilly presence in Europe . With extensive experience across the pharmaceutical industry, Germany's workforce will play a vital role in bolstering Lilly 's incretin supply when the new site is operational beginning in 2027. The site in Alzey will employ up to 1,000 highly skilled workers such as engineers, operators and scientists, who will leverage state-of-the-art technology, including automation and high-speed manufacturing lines, to produce life-changing medicines. In addition, an estimated 1,900 jobs will be created during construction, which is scheduled to begin in 2024. Lilly 's investment in Alzey is contingent upon finalization of government permitting and local approvals. \"The decision to locate here is good news for Germany as a business location,\" said Dr. Robert Habeck , vice chancellor and federal minister for Economic Affairs and Climate Action. \"It creates new and future-oriented jobs, shows the confidence of companies in the attractiveness of Germany as a pharmaceutical and industrial location and helps to improve healthcare for our citizens. The new location will make an important contribution to industrial value creation in Germany with high-tech production facilities and research and development.\" Lilly has announced investments of more than $11 billion in its global manufacturing footprint in the past three years to help ensure the safe and reliable supply of Lilly 's innovative medicines. The company continues to invest in the expansion of its global manufacturing to address the growth expected from potential new medicines to treat diabetes and obesity, Alzheimer's disease, cancer and autoimmune conditions. \"As we look to usher in the next generation of medicines, we're looking for people and partners who share our passion for improving health outcomes,\" said Ilya Yuffa , executive vice president and president, Lilly International . \"With this new investment, we hope to spark a new era of collaboration and innovation in Germany and the European Union defined by our shared purpose to find lasting solutions for patients.\" The company is also announcing an investment of up to $100 million to dramatically increase its footprint in Germany's early-stage biotech ecosystem. These investments will focus on biotech and the life sciences venture capital funds – expanding Lilly 's incubator and accelerator engagements, and strengthening Lilly 's ties and activities with world-renowned academic and innovation partners. With these investments, Lilly will pursue strategic partnerships and collaborations utilizing a variety of models that meet a range of business needs, including capital and equity investments; world-class lab space; and outstanding research and development capabilities and expertise to help accelerate innovative medicines that meet the needs of people globally. \"This investment strengthens the Federal Government in its efforts to make Germany more attractive again as a pharmaceutical location,\" added Prof. Dr. Karl Lauterbach , federal minister of health. \"It shows good innovative products can be reliably developed and produced in Germany . But we will continue to improve the framework conditions for research and production. This will ensure that patients have rapid access to new treatment options and make us more independent from fragile supply chains. Europe needs a strong pharmaceutical industry and research – not least for good and secure healthcare. Germany wants to provide new stimuli here.\" About Lilly Lilly unites caring with discovery to create medicines that make life better for people around the world. We've been pioneering life-changing discoveries for nearly 150 years, and today our medicines help more than 51 million people across the globe. Harnessing the power of biotechnology, chemistry and genetic medicine, our scientists are urgently advancing new discoveries to solve some of the world's most significant health challenges, redefining diabetes care, treating obesity and curtailing its most devastating long-term effects, advancing the fight against Alzheimer's disease, providing solutions to some of the most debilitating immune system disorders, and transforming the most difficult-to-treat cancers into manageable diseases. With each step toward a healthier world, we're motivated by one thing: making life better for millions more people. That includes delivering innovative clinical trials that reflect the diversity of our world and working to ensure our medicines are accessible and affordable. To learn more, visit Lilly.com and Lilly.com\/news or follow us on Facebook , Instagram and LinkedIn . C-LLY This press release contains forward-looking statements (as that term is defined in the Private Securities Litigation Reform Act of 1995) about planned capital investments in new manufacturing sites and related initiatives and reflects Lilly 's current beliefs and expectations. However, there can be no assurance that Lilly will successfully or timely complete the planned manufacturing sites or that Lilly will otherwise execute its strategy as planned. There are substantial risks and uncertainties in facilities construction, the manufacturing process and development, and commercialization of pharmaceutical products which could impact the launch of potential new products or the supply and overall commercial success of our products. For further discussion of these and other risks and uncertainties, see Lilly 's most recent Form 10-K and Form 10-Q filings with the United States Securities and Exchange Commission . Except as required by law, Lilly undertakes no duty to update forward-looking statements to reflect events after the date of this release. Refer to: Molly McCully ; mccully_molly@lilly.com; (317) 478-5423 (Media) Stefanie Prodouz ; stefanie.prodouz@lilly.com; (317) 287-9899 (Media) Joe Fletcher ; jfletcher@lilly.com; 317-296-2884 (Investors) View original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/lilly-to-expand-injectable-manufacturing-capacity-with-planned-2-5-billion-site-in-germany-301990884.html","filter_flag":1}
{"title":"Your trash deserves better. These three cases show what’s possible. - Rocky Mountain Institute","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vcm1pLm9yZy95b3VyLXRyYXNoLWRlc2VydmVzLWJldHRlci10aGVzZS10aHJlZS1jYXNlcy1zaG93LXdoYXRzLXBvc3NpYmxlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vcm1pLm9yZy95b3VyLXRyYXNoLWRlc2VydmVzLWJldHRlci10aGVzZS10aHJlZS1jYXNlcy1zaG93LXdoYXRzLXBvc3NpYmxlL9IBAA?oc=5","id":"CBMiUWh0dHBzOi8vcm1pLm9yZy95b3VyLXRyYXNoLWRlc2VydmVzLWJldHRlci10aGVzZS10aHJlZS1jYXNlcy1zaG93LXdoYXRzLXBvc3NpYmxlL9IBAA","guidislink":false,"published":"Fri, 17 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=17, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=321, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vcm1pLm9yZy95b3VyLXRyYXNoLWRlc2VydmVzLWJldHRlci10aGVzZS10aHJlZS1jYXNlcy1zaG93LXdoYXRzLXBvc3NpYmxlL9IBAA?oc=5\" target=\"_blank\">Your trash deserves better. These three cases show what’s possible.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Rocky Mountain Institute<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Your trash deserves better. These three cases show what’s possible. - Rocky Mountain Institute","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vcm1pLm9yZy95b3VyLXRyYXNoLWRlc2VydmVzLWJldHRlci10aGVzZS10aHJlZS1jYXNlcy1zaG93LXdoYXRzLXBvc3NpYmxlL9IBAA?oc=5\" target=\"_blank\">Your trash deserves better. These three cases show what’s possible.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Rocky Mountain Institute<\/font>","source.href":"https:\/\/rmi.org","source.title":"Rocky Mountain Institute","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Shares Your trash deserves better. These three cases show what’s possible. How an ‘All-In’ approach can slash planet-warming methane emissions from the waste sector Landfills are the third largest source of methane in the United States with annual emissions equivalent to driving 66 million cars or operating 79 coal-fired power plants. Methane is generated when organic materials — such as food waste, yard waste, and paper — decompose in landfills without oxygen. In the United States, we send more than 145 million tons of waste to municipal landfills each year. Food waste is the single most landfilled material, causing nearly 60 percent of landfill methane emissions, according to recent EPA analysis. Cutting methane is the strongest lever we have to slow the rate of near-term warming and limit the risk of dangerous climate tipping points. In the waste sector, strategies to cut methane emissions fall into two broad categories: upstream prevention and downstream mitigation. Upstream strategies center around the Environmental Protection Agency’s (EPA) Wasted Food Scale and prioritize waste prevention, food donation, and recycling to turn residual organics into animal feed, compost, or biogas. Downstream strategies focus on improving landfill design, operations, and monitoring practices to increase methane capture and reduce methane leaks. Upstream strategies avoid locking in future landfill methane emissions and ensure organic materials are put to their highest and best use, while downstream strategies are critical to cut methane quickly from all the organic waste already sitting in our landfills today. The Center for Global Sustainability (CGS) at the University of Maryland estimates an “All-In” approach that combines upstream and downstream efforts could slash waste methane emissions by 15 percent by 2030. These emission reductions would help the United States deliver on the North American Leaders’ Summit commitments, the Global Methane Pledge, and its broader nationally determined contribution (NDCs). Beyond the climate benefits, cutting methane emissions from the waste sector can help to address food insecurity, reduce health risks, improve quality of life for landfill-adjacent communities, create circular economy jobs, and produce value-added products, like compost. Three success stories in waste methane mitigation State of Maryland Landfills are the largest source of methane emissions in Maryland, making up about 40 percent of the state’s methane emissions and about 6 percent of total greenhouse gas emissions. Exhibit 1: Maryland’s greenhouse gas emissions in 2020. Source: COMAR 26.11.42 –Control of Methane Emissions from Municipal Solid Waste (MSW) Landfills Maryland has successfully implemented upstream and downstream waste management policies to address these harmful emissions. Maryland’s organics recycling law requires businesses, organizations, and schools that generate at least two tons of food residuals per week (one ton per week beginning in 2024) and are located within 30 miles of an organics recycling facility, to separate and divert food residuals from landfills or incinerators. Acceptable alternatives include source reduction, donation, conversion to animal feed, composting, or anaerobic digestion. Maryland is now home to one of the largest municipal composting facilities on the East Coast (Prince George’s County), and the Baltimore Compost Collective in South Baltimore is working to recycle food waste, improve soil health, and develop youth leaders in a community that was once slated to host the country’s largest toxic trash-burning incinerator. Downstream, Maryland recently finalized a new rule to guard against methane pollution. The rule makes several improvements to landfill design and operations that will meaningfully increase methane capture and reduce the risk of large leaks. When fully implemented, the Maryland rule will reduce greenhouse gas emissions from landfills by an estimated 25-50 percent. Maryland is now the third state after California and Oregon to set stronger landfill standards than the EPA’s. UMD’s CGS estimates that these policies can deliver 39 percent gross emission reductions in Maryland’s Climate Pathways scenario by 2031, or roughly 4 percent of the state’s 60 percent reduction target, while delivering co-benefits to Marylanders through improved environmental health. City of Austin, Texas Austin is a national leader in sustainable resource recovery with an ambitious goal to reduce the amount of trash sent to landfills by 90 percent by 2040. The city has made significant progress on its zero-waste goals, achieving a 42 percent diversion rate in 2021. Austin Resource Recovery (ARR), the city’s solid waste utility, has implemented several programs over the past decade to reduce organic waste disposal in landfills and promote sustainable materials management throughout the city. ARR provides weekly curbside composting collection to more than 220,000 residential customers, converting food scraps, yard trimmings, food-soiled paper, and natural fibers into nutrient-rich compost. Austin offers free composting guides and zero-waste classes for K-12 students to expand uptake and awareness. Private haulers manage the waste streams of commercial and multi-family properties, but the city of Austin has enacted policies and programs to increase organics diversion among these generators. For example, Austin passed a universal recycling ordinance (URO) that requires food-permitted businesses to ensure convenient access to diversion methods that keep organic materials out of landfills, encouraging waste prevention, edible food recovery, and composting. Austin City Council recently approved an amendment to the URO that will expand composting services to multi-family properties. Austin also provides incentives and resources to advance organic waste reduction, donation, and recycling efforts. The city offers a Zero Waste Business Rebate to encourage and support food rescue infrastructure, with up to $3,000 available to businesses for expenses related to improving food storage or equipment for the transport of recovered food. In 2015, the city launched the ReVerse Pitch Program an annual competition with a $10,000 prize and small business support for start-up circular businesses that aim to turn waste into new products. ARR’s Assistant Director, Gena McKinley, cited several benefits to the city’s waste management strategy, beyond emissions reductions. For one, the curbside composting program is beneficial to ratepayers, as the cost to compost organic materials is lower than the cost to landfill them, and the city passes along these savings to residents. Second, the incentives and programs focused on increasing edible food recovery can help to address food insecurity, which impacts about 15 percent of residents (see the Austin Climate Equity Plan and Austin’s State of Food Systems Report). Finally, circular economy programs can create new workforce training and job opportunities, and ARR has partnered with the city’s economic development department to help grow the local circular economy. Sierra Nevada Brewing Company Sierra Nevada Brewing Company is the third largest craft brewery in America and the first TRUE Platinum Zero Waste certified business with an over 99 percent diversion rate of solid waste from the landfill. Spent grain and spent yeast are the largest volume of waste generated by breweries. Sierra Nevada generates about 250,000 pounds per day of spent grain across its operations. Through farm partnerships, the spent grain is then used as cattle feed for dairy cows and is a revenue stream for the company. The company sends part of its spent yeast (~40,000 lbs\/day at its California facility) to farms as animal feed for dairy cows, and the remainder (~30,000 lbs\/day at its North Carolina facility) is anaerobically digested at an on-site wastewater treatment plant along with the brewing effluent. The biogas produced at Sierra Nevada’s North Carolina digester is used in boilers and microturbines, covering about 8 percent of total electricity needs. At its California restaurant and taproom, Sierra Nevada has installed an industrial on-site composter to process food waste, landscaping debris, and small amounts of hops and spent grain. The in-vessel composter can process over 2 tons of organic material per day, and Sierra Nevada estimates it has prevented over 6 million pounds of organic material from reaching landfills, which in turn has avoided almost 2,000 metric tons of CO 2 e over its lifetime. Sierra Nevada utilizes much of the compost for agricultural purposes on-site, growing produce, herbs, hops, and barley. At the North Carolina taproom, Sierra Nevada diverts food waste to a regional composting facility. Sierra Nevada also prevents waste at its California location by donating edible food from its taproom and estate garden to shelters, food banks, and youth organizations. To help facilitate the donations, the brewery has partnered with 530 Food Rescue, a non-profit organization that connects food-rescue volunteers to retailers using a mobile app. Opportunities to Scale Impact These three case studies illustrate some of the many policies and programs that can reduce methane emissions while delivering powerful co-benefits. Historic funding from the Bipartisan Infrastructure Law (BIL) and the Inflation Reduction Act (IRA) can help support and scale subnational efforts to cut waste methane. For example, the Solid Waste Infrastructure for Recycling (SWIFR) Grant Program from the BIL recently invested more than $100 million in local waste infrastructure, including support for organics collection and composting facilities. The IRA’s Climate Pollution Reduction Grant Program (CPRG) provides $5 billion in climate planning and implementation grants to states, local governments, tribes, and territories to develop strong, local greenhouse gas reduction strategies. Applicants must submit a priority climate action plan (PCAP) by March-April 2024 to compete for implementation funding, and we encourage entities to include food waste reduction, organics diversion, and landfill mitigation programs in their PCAPs. The EPA can also help scale efforts to reduce landfill emissions by strengthening the Clean Air Act regulations for landfills to slash planet-warming methane, protect landfill-adjacent communities across the country, and make progress on broader climate and environmental justice goals. The 2023 United Nations Climate Change Conference (COP28) at the end of this year is an exciting opportunity for the United States to highlight subnational progress and announce action to further cut landfill methane. RMI’s Waste Methane Resource List compiles additional funding opportunities, sector-specific toolkits, and model programs and policies to help states, local governments, and organizations take action to reduce food waste and landfill methane emissions. Our trash is a major contributor to climate change, but with an ‘All-In’ approach, we can change that. This article highlights success stories discussed in Tackling Food Waste & Landfill Methane Emissions an event hosted by the America Is All In Coalition and RMI to explain the link between trash and climate change and present solutions for subnational actors. America is All In is an expansive coalition of over 5,000 state, tribal, and local governments, higher ed institutions, businesses, health care organizations, faith groups, and cultural institutions in support of US climate action at the federal and subnational level.","filter_flag":1}
{"title":"Mars reuses old iconic adverts to raise consumer awareness of climate action - ConfectioneryNews.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5jb25mZWN0aW9uZXJ5bmV3cy5jb20vQXJ0aWNsZS8yMDIzLzExLzI5L21hcnMtcmV1c2VzLW9sZC1pY29uaWMtYWR2ZXJ0cy10by1yYWlzZS1jb25zdW1lci1hd2FyZW5lc3Mtb2YtY2xpbWF0ZS1hY3Rpb27SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5jb25mZWN0aW9uZXJ5bmV3cy5jb20vQXJ0aWNsZS8yMDIzLzExLzI5L21hcnMtcmV1c2VzLW9sZC1pY29uaWMtYWR2ZXJ0cy10by1yYWlzZS1jb25zdW1lci1hd2FyZW5lc3Mtb2YtY2xpbWF0ZS1hY3Rpb27SAQA?oc=5","id":"CBMigQFodHRwczovL3d3dy5jb25mZWN0aW9uZXJ5bmV3cy5jb20vQXJ0aWNsZS8yMDIzLzExLzI5L21hcnMtcmV1c2VzLW9sZC1pY29uaWMtYWR2ZXJ0cy10by1yYWlzZS1jb25zdW1lci1hd2FyZW5lc3Mtb2YtY2xpbWF0ZS1hY3Rpb27SAQA","guidislink":false,"published":"Wed, 29 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=29, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=333, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5jb25mZWN0aW9uZXJ5bmV3cy5jb20vQXJ0aWNsZS8yMDIzLzExLzI5L21hcnMtcmV1c2VzLW9sZC1pY29uaWMtYWR2ZXJ0cy10by1yYWlzZS1jb25zdW1lci1hd2FyZW5lc3Mtb2YtY2xpbWF0ZS1hY3Rpb27SAQA?oc=5\" target=\"_blank\">Mars reuses old iconic adverts to raise consumer awareness of climate action<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ConfectioneryNews.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Mars reuses old iconic adverts to raise consumer awareness of climate action - ConfectioneryNews.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5jb25mZWN0aW9uZXJ5bmV3cy5jb20vQXJ0aWNsZS8yMDIzLzExLzI5L21hcnMtcmV1c2VzLW9sZC1pY29uaWMtYWR2ZXJ0cy10by1yYWlzZS1jb25zdW1lci1hd2FyZW5lc3Mtb2YtY2xpbWF0ZS1hY3Rpb27SAQA?oc=5\" target=\"_blank\">Mars reuses old iconic adverts to raise consumer awareness of climate action<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ConfectioneryNews.com<\/font>","source.href":"https:\/\/www.confectionerynews.com","source.title":"ConfectioneryNews.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The campaign, ‘Healthy Planet Productions,’ follows the recent publication of Mars Net Zero Roadmap to accelerate action towards achieving Net Zero emissions by 2050, including a new Science Based Target Initiative (SBTi) approved target to cut carbon emissions in half by 2030 across its entire value chain. Advertisements in the Mars ‘reused’ advertisement campaign will run in the US, UK, and Mexico across Meta platforms and YouTube, including out-of-home activations in select markets. I The campaign will highlight advertisements for M&Ms, TWIX, and Ben’s Original in the US. The UK campaign will feature Bounty, M&Ms, and TWIX. Mexico will include M&Ms. Andrew Clarke, Global President of Mars Wrigley, said consumers want to connect with brands on critical issues: “They share our urgency in tackling climate change, but it’s not always clear what companies are doing to deliver real change. That is why we decided to use our iconic brands in the adverts consumers know and love and deliver a message of hope and optimism on climate change. We are taking action now to reduce carbon emissions - from working with farmers to protect forests to sourcing renewable electricity. We want consumers to know we’re working on having a tangible impact now​.” The Mars ‘reused’ advertisements campaign reduced production emissions by cutting emissions and removing the need for travel, filming, and set production by repurposing content. It minimized remaining emissions by prioritizing carbon avoidance as a key consideration in decision-making and creative development, including forgoing emission-intensive animation techniques for more sustainable methods. Mars also partnered with organizations and businesses committed to sustainability that hold industry designations, such as Certified Green Energy Offices and Studios. Barry Parkin, Chief Procurement and Sustainability Officer, said, “When we launched our Net Zero Roadmap back in September, we talked about delivering real impact and the need to inspire and involve everyone in the challenge. With this campaign, Mars is taking the work we are doing across our value chain to reduce carbon emissions and making it easy for consumers to engage and feel good about the products and brands they know and love.” ​ The announcement was timed for the beginning of COP28, the United Nations Climate Change conference, held from 30 November until 12 December 2023, at the Expo City, Dubai. The Cocoa and Forests Initiative (CFI), which Mars is a member of, is set to present updates on the industry’s commitment to eliminating deforestation ​and restoring degraded forests at the conference.","filter_flag":1}
{"title":"Fashion’s efforts to go green cancelled out by shopaholics - The Guardian","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9mYXNoaW9uLzIwMjMvbm92LzA2L2Zhc2hpb25zLWVmZm9ydHMtZ3JlZW4tY2FuY2VsbGVkLXNob3BhaG9saWNzLXdyYXDSAWFodHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vZmFzaGlvbi8yMDIzL25vdi8wNi9mYXNoaW9ucy1lZmZvcnRzLWdyZWVuLWNhbmNlbGxlZC1zaG9wYWhvbGljcy13cmFw?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9mYXNoaW9uLzIwMjMvbm92LzA2L2Zhc2hpb25zLWVmZm9ydHMtZ3JlZW4tY2FuY2VsbGVkLXNob3BhaG9saWNzLXdyYXDSAWFodHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vZmFzaGlvbi8yMDIzL25vdi8wNi9mYXNoaW9ucy1lZmZvcnRzLWdyZWVuLWNhbmNlbGxlZC1zaG9wYWhvbGljcy13cmFw?oc=5","id":"CBMiYWh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9mYXNoaW9uLzIwMjMvbm92LzA2L2Zhc2hpb25zLWVmZm9ydHMtZ3JlZW4tY2FuY2VsbGVkLXNob3BhaG9saWNzLXdyYXDSAWFodHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vZmFzaGlvbi8yMDIzL25vdi8wNi9mYXNoaW9ucy1lZmZvcnRzLWdyZWVuLWNhbmNlbGxlZC1zaG9wYWhvbGljcy13cmFw","guidislink":false,"published":"Sun, 05 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=309, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9mYXNoaW9uLzIwMjMvbm92LzA2L2Zhc2hpb25zLWVmZm9ydHMtZ3JlZW4tY2FuY2VsbGVkLXNob3BhaG9saWNzLXdyYXDSAWFodHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vZmFzaGlvbi8yMDIzL25vdi8wNi9mYXNoaW9ucy1lZmZvcnRzLWdyZWVuLWNhbmNlbGxlZC1zaG9wYWhvbGljcy13cmFw?oc=5\" target=\"_blank\">Fashion’s efforts to go green cancelled out by shopaholics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Guardian<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Fashion’s efforts to go green cancelled out by shopaholics - The Guardian","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9mYXNoaW9uLzIwMjMvbm92LzA2L2Zhc2hpb25zLWVmZm9ydHMtZ3JlZW4tY2FuY2VsbGVkLXNob3BhaG9saWNzLXdyYXDSAWFodHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vZmFzaGlvbi8yMDIzL25vdi8wNi9mYXNoaW9ucy1lZmZvcnRzLWdyZWVuLWNhbmNlbGxlZC1zaG9wYWhvbGljcy13cmFw?oc=5\" target=\"_blank\">Fashion’s efforts to go green cancelled out by shopaholics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Guardian<\/font>","source.href":"https:\/\/www.theguardian.com","source.title":"The Guardian","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"A fashion industry push to reduce the environmental impact of the clothing it sells is being undermined by an ongoing addiction to buying new clothes, with the average Briton buying 28 items every year. Asos and Primark are among the big names signed up to Wrap’s voluntary environmental pact, Textiles 2030. While the companies involved have managed to reduce both the carbon intensity and volume of water per tonne used in their clothing manufacture, in its annual progress report, published today, the climate action NGO warns of hard-won gains being “cancelled out” because clothing production is “spiralling upwards”. Textiles and fashion are responsible for up to 10% of global carbon emissions. Catherine David, Wrap’s director of behaviour change and business programmes, said the progress made by 130 brands and retailers involved showed “it’s possible to change this”. But that at the moment, “as fast as positive improvements happen, they’re cancelled out by rising production”. The companies had reduced the carbon impact of their textiles by 12% and water by 4% (on a per-tonne basis) between 2019 and 2022. However, this was negated by a 13% increase in the volume of textiles produced and sold, according to the report. The increased production rates meant overall water use actually rose by 8% over the period, while the carbon reduction figure stood at just 2%. Since production is obviously related to consumption, David said consumers had a part to play. “We’re working with companies to improve clothes, but the other part of the equation is our role as shoppers,” she said. “We buy more clothes than any other nation in Europe. “Our research shows that a quarter of most wardrobes go unworn in a year and nearly a quarter of us admit to wearing clothes only a few times,” she continued. “Moving into winter is the perfect time to look through our wardrobes – wear what we have and consider whether it’s time to let something go. You can donate, sell or give clothes away – it all helps them move around the economy and reduce the amount produced.” Wrap wants businesses to design clothes for a longer life, with good durability and recyclability and more recycled content. On a positive note, the report revealed that increased use of recycled polyester and polyamide had helped reduce the amount of fabric made from virgin materials. Also nearly three-quarters of cotton used by signatories now comes from improved sources such as the Better Cotton Initiative. With more brands and retailers operating take-back schemes, the volume of used textiles collected and sold for reuse or recycling between 2019 and 2022 had doubled, it said. skip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion However, production of new clothing far overshadows the preloved market, and the gap between brand-new products and preloved items sold remains significant. Second-hand makes up just 9% of textiles placed on the market, according to Wrap.","filter_flag":1}
{"title":"British Fashion's Environmental Gains Undone by Shopaholics – Mother Jones - Mother Jones","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3Lm1vdGhlcmpvbmVzLmNvbS9lbnZpcm9ubWVudC8yMDIzLzExL2JyaXRpc2gtZmFzdC1mYXNoaW9uLWVudmlyb25tZW50YWwtcHJvZ3Jlc3Mv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3Lm1vdGhlcmpvbmVzLmNvbS9lbnZpcm9ubWVudC8yMDIzLzExL2JyaXRpc2gtZmFzdC1mYXNoaW9uLWVudmlyb25tZW50YWwtcHJvZ3Jlc3Mv0gEA?oc=5","id":"CBMiXGh0dHBzOi8vd3d3Lm1vdGhlcmpvbmVzLmNvbS9lbnZpcm9ubWVudC8yMDIzLzExL2JyaXRpc2gtZmFzdC1mYXNoaW9uLWVudmlyb25tZW50YWwtcHJvZ3Jlc3Mv0gEA","guidislink":false,"published":"Wed, 08 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=312, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3Lm1vdGhlcmpvbmVzLmNvbS9lbnZpcm9ubWVudC8yMDIzLzExL2JyaXRpc2gtZmFzdC1mYXNoaW9uLWVudmlyb25tZW50YWwtcHJvZ3Jlc3Mv0gEA?oc=5\" target=\"_blank\">British Fashion's Environmental Gains Undone by Shopaholics – Mother Jones<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mother Jones<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"British Fashion's Environmental Gains Undone by Shopaholics – Mother Jones - Mother Jones","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3Lm1vdGhlcmpvbmVzLmNvbS9lbnZpcm9ubWVudC8yMDIzLzExL2JyaXRpc2gtZmFzdC1mYXNoaW9uLWVudmlyb25tZW50YWwtcHJvZ3Jlc3Mv0gEA?oc=5\" target=\"_blank\">British Fashion's Environmental Gains Undone by Shopaholics – Mother Jones<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mother Jones<\/font>","source.href":"https:\/\/www.motherjones.com","source.title":"Mother Jones","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"This story was originally published by the Guardian and is reproduced here as part of the Climate Desk collaboration. A fashion industry push to reduce the environmental impact of the clothing it sells is being undermined by an ongoing addiction to buying new clothes, with the average British person buying 28 items every year. Asos and Primark are among the big names signed up to Wrap’s voluntary environmental pact, Textiles 2030. While the companies involved have managed to reduce both the carbon intensity and volume of water per metric ton used in their clothing manufacture, in its annual progress report, published today, the climate action NGO warns of hard-won gains being “canceled out” because clothing production is “spiraling upwards.” Textiles and fashion are responsible for up to 10 percent of global carbon emissions. Catherine David, Wrap’s director of behavior change and business programs, said the progress made by 130 brands and retailers involved showed “it’s possible to change this.” But that at the moment, “as fast as positive improvements happen, they’re canceled out by rising production.” “We’re working with companies to improve clothes, but the other part of the equation is our role as shoppers.” The companies had reduced the carbon impact of their textiles by 12 percent and water by 4 percent (on a per-ton basis) between 2019 and 2022. However, this was negated by a 13 percent increase in the volume of textiles produced and sold, according to the report. The increased production rates meant overall water use actually rose by 8 percent over the period, while the carbon reduction figure stood at just 2 percent. Since production is obviously related to consumption, David said consumers had a part to play. “We’re working with companies to improve clothes, but the other part of the equation is our role as shoppers,” she said. “We buy more clothes than any other nation in Europe. “Our research shows that a quarter of most wardrobes go unworn in a year and nearly a quarter of us admit to wearing clothes only a few times,” she continued. “Moving into winter is the perfect time to look through our wardrobes—wear what we have and consider whether it’s time to let something go. You can donate, sell or give clothes away—it all helps them move around the economy and reduce the amount produced.” Wrap wants businesses to design clothes for a longer life, with good durability and recyclability and more recycled content. On a positive note, the report revealed that increased use of recycled polyester and polyamide had helped reduce the amount of fabric made from virgin materials. Also nearly three-quarters of cotton used by signatories now comes from improved sources such as the Better Cotton Initiative. With more brands and retailers operating take-back schemes, the volume of used textiles collected and sold for reuse or recycling between 2019 and 2022 had doubled, it said.","filter_flag":1}
{"title":"The A List: Cities taking climate action highlighted by CDP - CityMetric","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vY2l0eW1vbml0b3IuYWkvc3VzdGFpbmFiaWxpdHkvY2RwLWxhdW5jaGVzLWNpdGllcy1hLWxpc3QtY2xpbWF0ZS1hY3Rpb27SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vY2l0eW1vbml0b3IuYWkvc3VzdGFpbmFiaWxpdHkvY2RwLWxhdW5jaGVzLWNpdGllcy1hLWxpc3QtY2xpbWF0ZS1hY3Rpb27SAQA?oc=5","id":"CBMiT2h0dHBzOi8vY2l0eW1vbml0b3IuYWkvc3VzdGFpbmFiaWxpdHkvY2RwLWxhdW5jaGVzLWNpdGllcy1hLWxpc3QtY2xpbWF0ZS1hY3Rpb27SAQA","guidislink":false,"published":"Tue, 14 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=318, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vY2l0eW1vbml0b3IuYWkvc3VzdGFpbmFiaWxpdHkvY2RwLWxhdW5jaGVzLWNpdGllcy1hLWxpc3QtY2xpbWF0ZS1hY3Rpb27SAQA?oc=5\" target=\"_blank\">The A List: Cities taking climate action highlighted by CDP<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CityMetric<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The A List: Cities taking climate action highlighted by CDP - CityMetric","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vY2l0eW1vbml0b3IuYWkvc3VzdGFpbmFiaWxpdHkvY2RwLWxhdW5jaGVzLWNpdGllcy1hLWxpc3QtY2xpbWF0ZS1hY3Rpb27SAQA?oc=5\" target=\"_blank\">The A List: Cities taking climate action highlighted by CDP<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CityMetric<\/font>","source.href":"https:\/\/citymonitor.ai","source.title":"CityMetric","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"In a testament to the global commitment to environmental action, 119 cities from around the world have been recognised for their leadership in climate change initiatives, according to the sixth annual Cities A List published by CDP, a non-profit organisation running the world’s environmental disclosure system. This achievement underscores a paradigm shift where climate action is not just a priority but has become the mainstream for urban areas across the globe. Lima has been regonised in the A List for its climate inititavites. (Photo by Christian Vinces\/Shutterstock) The 2023 A List, consisting of cities from every continent, showcases a diverse group of urban centres, including notable returns and newcomers. Particularly noteworthy is the increasing representation from the Global South, with cities in Indonesia, Türkiye and Vietnam making their debut on the A List. Some 40% of the total cities on the list are newcomers, emphasising the growing global momentum towards environmental consciousness. CDP’s analysis reveals that the top-ranking cities are not merely symbolic in their commitment but are actively implementing measures to address climate change. Cities on the A List report four times as many mitigation and adaptation actions compared with their counterparts not on the list. This is a strong indicator that these cities are not just vocal about climate change but are taking tangible steps to combat its effects. There were some notable exmples included with the report. In Lima, for example, Nestlé is making a positive impact by donating treated wastewater for the irrigation of green areas, covering 9% of the capital’s green spaces. Guadalajara is leading the way in Mexico with 38 fully electric buses, forming the first all-electric transport route in the country. Elsewhere, Cape Town is committed to renewable energy, installing 1.5MW of solar panels in 2023, with plans for an additional 5MW between 2024 and 2026. Istanbul is pioneering electric-hybrid sea taxis for cleaner maritime transportation, while Paris engaged nearly 27,000 climate volunteers to spread awareness and promote sustainability. Oslo is focusing on nature-based solutions, restoring 260 acres of bogs since 2019 to prevent flooding. Toronto‘s Eco-Roof Incentive Programme diverted 71.5 million litres of stormwater annually through green roofs, surpassing the rest of Canada combined. Denver enforces a Single-Use Accessory Restriction Ordinance, reducing plastic waste in retail food establishments. Can Tho in Vietnam is set to enhance its street lighting by replacing 30,579 high-voltage lamps with energy-efficient LEDs and creating 381 smart light poles. Quezon City in the Philippines invests in Early Warning Systems and Automated Weather Stations to protect communities from tropical storms and flooding. Adelaide secures a sustainable water supply by recycling up to 1.1 billion liters annually for green spaces and public amenities. Wellington, through the Charged Up Capital Programme, is installing 60 electric vehicle fast chargers across 30 public locations by June 2025. The City of London employed a digital twin to identify vulnerable areas and implement measures against heat stress and flooding. As a final example, also in the UK, Sunderland, known for its ‘Bee Bus Stops,’ is installing living roofs on 90 bus shelters made of recycled materials and planted with native wildflowers. These roofs not only support biodiversity but also provide natural cooling, absorb rainwater, and filter air pollutants, contributing to a greener and healthier urban environment. How are A List cities taking climate action? The statistics further demonstrate that renewable energy usage is on the rise among A List cities, with some reporting that renewable sources constitute the majority of their energy consumption. The actions taken by these cities are diverse and impactful, ranging from innovative waste management solutions to the deployment of electric buses and large-scale renewable energy projects. It is heartening to see cities in the Global South making significant strides, with countries like Brazil, Colombia and the Philippines achieving their highest-ever number of A-list cities. This dispels the myth that environmental leadership is confined to certain regions, showcasing a global commitment to sustainability. Europe leads the charge with the largest share of cities on the A List, closely followed by North America and Latin America. The US, in particular, boasts the highest number of A List cities, underscoring the importance of local action in a country facing diverse climate challenges. While celebrating the achievements of the A List cities, Maia Kutner, CDP director of cities, states and regions, emphasised the need for continued efforts: “2023 will be remembered as the year when centuries-long climate records weren’t just broken, but smashed, in mere days and weeks. While cities around the world felt the full force of the year’s climate disasters, from heatwaves to floods, it’s positive that many are leading by example in tackling climate change with tangible action. “Today, we are delighted to celebrate the 119 cities, from Lima to London, whose effective action makes them global climate leaders. Even more encouragingly, this is not the first time that many – including from the Global South – are on CDP’s A List, showing that serious climate action is now mainstream for many of the world’s cities. “This is no time for complacency, though. Cities not reporting environmental data must step up their transparency, while many more need to accelerate their efforts to reach net zero and create a more sustainable future for all, especially the most vulnerable.” [Read more: European housing market shifts towards affordable and sustainable living, new research shows]","filter_flag":1}
{"title":"How carbon markets should evolve to meet net-zero ambitions - Deloitte","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihgFodHRwczovL3d3dzIuZGVsb2l0dGUuY29tL3hlL2VuL2luc2lnaHRzL2luZHVzdHJ5L2ZpbmFuY2lhbC1zZXJ2aWNlcy9ob3ctdG8tZXZvbHZlLWNhcmJvbi1tYXJrZXRzLWZvci1kZWNhcmJvbml6YXRpb24tdG8tbmV0LXplcm8uaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihgFodHRwczovL3d3dzIuZGVsb2l0dGUuY29tL3hlL2VuL2luc2lnaHRzL2luZHVzdHJ5L2ZpbmFuY2lhbC1zZXJ2aWNlcy9ob3ctdG8tZXZvbHZlLWNhcmJvbi1tYXJrZXRzLWZvci1kZWNhcmJvbml6YXRpb24tdG8tbmV0LXplcm8uaHRtbNIBAA?oc=5","id":"CBMihgFodHRwczovL3d3dzIuZGVsb2l0dGUuY29tL3hlL2VuL2luc2lnaHRzL2luZHVzdHJ5L2ZpbmFuY2lhbC1zZXJ2aWNlcy9ob3ctdG8tZXZvbHZlLWNhcmJvbi1tYXJrZXRzLWZvci1kZWNhcmJvbml6YXRpb24tdG8tbmV0LXplcm8uaHRtbNIBAA","guidislink":false,"published":"Wed, 29 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=29, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=333, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihgFodHRwczovL3d3dzIuZGVsb2l0dGUuY29tL3hlL2VuL2luc2lnaHRzL2luZHVzdHJ5L2ZpbmFuY2lhbC1zZXJ2aWNlcy9ob3ctdG8tZXZvbHZlLWNhcmJvbi1tYXJrZXRzLWZvci1kZWNhcmJvbml6YXRpb24tdG8tbmV0LXplcm8uaHRtbNIBAA?oc=5\" target=\"_blank\">How carbon markets should evolve to meet net-zero ambitions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deloitte<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How carbon markets should evolve to meet net-zero ambitions - Deloitte","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihgFodHRwczovL3d3dzIuZGVsb2l0dGUuY29tL3hlL2VuL2luc2lnaHRzL2luZHVzdHJ5L2ZpbmFuY2lhbC1zZXJ2aWNlcy9ob3ctdG8tZXZvbHZlLWNhcmJvbi1tYXJrZXRzLWZvci1kZWNhcmJvbml6YXRpb24tdG8tbmV0LXplcm8uaHRtbNIBAA?oc=5\" target=\"_blank\">How carbon markets should evolve to meet net-zero ambitions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deloitte<\/font>","source.href":"https:\/\/www2.deloitte.com","source.title":"Deloitte","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"To meet decarbonization needs at scale, compliance carbon markets should push for greater integration At the start of 2023, more than two dozen compliance markets operated around the world, and several more are expected to launch in coming years.29 These include: Cities such as Shenzhen and Tokyo; States and provinces, such as California, Quebec, and Guangdong; Nations, such as Mexico, South Korea, and New Zealand; and Supranational entities, such as the EU Emissions Trading System (ETS).30 To facilitate greater market integration, many governments are starting to link their compliance markets. This move can bring a number of potential benefits, including expanding their scope of coverage and enabling progress in local jurisdictions, such as states or cities, where national-level mandatory climate action may not be feasible. Linking markets can also lead to price convergence.31 Establishing a common carbon price across systems can minimize price fluctuations and increase liquidity. Additionally, linkages can cause the overcall cost of emissions to fall by allowing companies in regions with higher abatement costs to purchase allowances from regions where abatement is cheaper. This, in turn, can prompt countries to set more ambitious climate targets for their public and private sectors. In fact, a 2017 study found that an international linkage of worldwide ETSs could reduce the total expense of achieving NDCs by 32% before 2030, and by 54% before 2050.32 The 2014 linkage between the cap-and-trade systems in the state of California and the province of Quebec systems (the first international linkage) is an example of a relationship that delivered value to both entities by significantly reducing emissions while generating billions of US dollars in revenue. The initiative has been so successful that the state of Washington is considering joining, nearly a full decade later.33 These jurisdictions are also considering states and provinces beyond North America and may soon try to recruit additional states within Mexico and Brazil.34 States in the Northeast United States are also espousing the benefits of linkages. New York, for example, is already part of the 12-state Regional Greenhouse Gas Initiative (RGGI), which sets regional caps on emissions from power plants.35 Its forthcoming “cap-and-invest” program seeks to return one-third of revenues to consumers, while the rest would support renewable energy projects.36 This revenue model is similar to California’s cap-and-trade system that funds the Greenhouse Gas Reduction Fund, which has generated US$9 billion for investments in energy-efficiency, public transit, and affordable housing. The governor of New York has indicated that its program will be designed to easily link with other jurisdictions. There are also varying degrees of linkages that jurisdictions can pursue, depending on their capabilities and how closely they wish to be interlinked. Direct or “full” linkages permit jurisdictions to buy and sell allowances across trading systems. The Swiss ETS and the EU ETS have a direct linkage that creates a single carbon price and permits members to use allowances in both systems. The UK ETS, which was created in 2021 after Brexit, may seek a direct link with the EU ETS, or possibly a new multilateral arrangement altogether.37 Indirect linkages, on the other hand, are less formal, but can involve sharing design elements, leading practices, or experiences and information. When China was setting up its new carbon market, the state of California offered advice on design, reporting and verification protocols, and enforcement mechanisms. As a result, the California-Quebec carbon market and Chinese ETS have similar emission thresholds and reporting requirements, and firms doing business in China and California may swap or trade credits from one carbon market for credits in the other through structured financial deals.38 Eventually the governments may seek a more direct linkage.39 National-level cap-and-trade programs can also embed Article 6.2 accounting principles into their linking agreements so the resulting change in emission flows are reflected in their NDC calculations. Although Article 6.2 provisions are not a prerequisite for linkages, they can help reduce the risk of double counting and make it easier for countries to stay on track toward NDCs.40 When negotiating new forms of voluntary cooperation, leaders can incorporate Article 6.2 through memorandums of understanding, treaties, or informal agreements, as Singapore did with countries such as Bhutan, Cambodia, Colombia, Kenya, Peru, and Sri Lanka.41 These agreements can add more credibility to carbon market collaborations since Article 6.2 accounting, reporting, and disclosure obligations were designed to boost transparency and environmental integrity. Linkages may be easier to establish between countries in close proximity, especially if they share similar environmental goals, economic backgrounds, and histories of mutually beneficial trade agreements.42 The linkage of the EU’s carbon market with the Swiss market is an example of a relationship that has benefited from existing ties. Carbon markets are also easier to converge when they have compatible design and market structures, including similar methodologies for certifying carbon credits, platforms for storing registry data, and penalties for noncompliance. Moreover, linkages centered on regional hubs can harmonize governance and design frameworks, as several US and Canadian jurisdictions did when drawing up the Western Climate Initiative (WCI). This program design not only laid the groundwork for California and Quebec’s partnership,43 but it has been used as the model for carbon markets in British Columbia, Manitoba, Ontario, New Mexico, and Washington state.44 Some jurisdictions in Latin America are also considering entering the WCI, which could open the door to more Pan-American linkages, and possibly even a Western Hemisphere–wide carbon market.45 Other parts of the world are also making moves to become carbon-trading hot spots. Singapore, for example, is heavily investing in its capabilities, building upon its experience in commodities trading in the hopes of emerging as the central trading hub within Asia.46 And during the inaugural African Climate Summit, Kenya signaled its intention to become the continent’s carbon trading powerhouse.47 The country’s September 2023 Climate Change Act will introduce a national carbon registry and help regulators guide participation in global carbon markets, including through Article 6 mechanisms.48 These efforts could be impeded by countries imposing trade restrictions that keep the social benefits of emission-reduction projects within their own borders. Malawi, Zambia, and Zimbabwe are redirecting revenues from projects to local stakeholders,49 for example, while India50 and Papua New Guinea51 have temporarily banned external sales entirely. Creating new regional carbon markets or facilitating greater integration among them using Article 6.2 cooperative approaches can create common infrastructure, align pricing mechanisms, and attract new players. These regional markets could eventually serve as the groundwork for a global trading regime, helping ensure that countries are better prepared for greater market convergence. Just a handful of countries working together to establish a minimum carbon price could provide a marked boost to carbon markets. The G20 economies together will account for 85% of the world’s emissions in 2030—and their alignment on a carbon price floor could advance climate equity, given their record of historical emissions.52","filter_flag":1}
{"title":"KKR's second impact fund closes at $2.8bn, more than double size of first - Impact Investor","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vaW1wYWN0LWludmVzdG9yLmNvbS9ra3JzLXNlY29uZC1pbXBhY3QtZnVuZC1jbG9zZXMtYXQtMi04Ym4tbW9yZS10aGFuLWRvdWJsZS1zaXplLW9mLWZpcnN0L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vaW1wYWN0LWludmVzdG9yLmNvbS9ra3JzLXNlY29uZC1pbXBhY3QtZnVuZC1jbG9zZXMtYXQtMi04Ym4tbW9yZS10aGFuLWRvdWJsZS1zaXplLW9mLWZpcnN0L9IBAA?oc=5","id":"CBMiY2h0dHBzOi8vaW1wYWN0LWludmVzdG9yLmNvbS9ra3JzLXNlY29uZC1pbXBhY3QtZnVuZC1jbG9zZXMtYXQtMi04Ym4tbW9yZS10aGFuLWRvdWJsZS1zaXplLW9mLWZpcnN0L9IBAA","guidislink":false,"published":"Wed, 08 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=312, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vaW1wYWN0LWludmVzdG9yLmNvbS9ra3JzLXNlY29uZC1pbXBhY3QtZnVuZC1jbG9zZXMtYXQtMi04Ym4tbW9yZS10aGFuLWRvdWJsZS1zaXplLW9mLWZpcnN0L9IBAA?oc=5\" target=\"_blank\">KKR's second impact fund closes at $2.8bn, more than double size of first<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Impact Investor<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"KKR's second impact fund closes at $2.8bn, more than double size of first - Impact Investor","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vaW1wYWN0LWludmVzdG9yLmNvbS9ra3JzLXNlY29uZC1pbXBhY3QtZnVuZC1jbG9zZXMtYXQtMi04Ym4tbW9yZS10aGFuLWRvdWJsZS1zaXplLW9mLWZpcnN0L9IBAA?oc=5\" target=\"_blank\">KKR's second impact fund closes at $2.8bn, more than double size of first<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Impact Investor<\/font>","source.href":"https:\/\/impact-investor.com","source.title":"Impact Investor","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"KKR’s second impact fund closes at $2.8bn, more than double size of first The close underscores the firm’s commitment to contributing to the UN Sustainable Development Goals. The fund will target four key investment themes: climate action, sustainable living, lifelong learning and inclusive growth. The new fund is targeting four key investment themes: climate action, sustainable living, lifelong learning and inclusive growth | Ben Goode on iStock KKR, a US-based alternative asset manager, closed its Global Impact Fund II to new investors after raising $2.8bn. The firm’s first global impact fund, which launched in 2018, raised $1.3bn from investors, making it one of the biggest of its kind at the time. KKR’s second impact fund, which is aimed at addressing social and environmental problems, received “strong backing from a diverse group of new and existing global investors, including public pensions, family offices, insurance companies, and other institutional investors”, KKR said in a press release. When contacted by Impact Investor, the New York-based private equity firm declined to disclose the identities of the investors. KKR said it would be investing $250m of capital into the fund through its balance sheet, affiliates and employee commitments. ‘Global problems’ The new impact fund will invest in companies whose products and services contribute measurable progress toward the UN SDGs, the firm said. It will target four key investment themes: climate action, sustainable living, lifelong learning and inclusive growth. “We launched KKR Global Impact in 2018 because we saw an opportunity to invest behind proven companies that deliver scalable, commercial solutions to global problems,” said Robert Antablin, KKR partner and co-head of KKR Global Impact. “Since then, that opportunity set has continued to grow, and we are thrilled with the outcomes our portfolio companies have been able to achieve. We are grateful for the support of our investors who share our conviction in this space, which we believe is well placed given the strong performance of our first fund.” ‘Macro tailwinds’ Since its launch in 2018, KKR Global Impact has invested in 18 companies including GreenCollar, Australia’s biggest environmental markets investor, natural resource manager and conservation-for-profit organisation, CoolIT, which helps data centres to cut energy consumption with cooling liquid, and CMC Machinery, which makes automated packaging solutions in Italy. Since its inception five years ago, KKR’s global impact team has grown to more than 20 employees. “Globally, there is increased urgency to solve some of the world’s greatest challenges, such as the energy transition, supply chain resiliency, digitisation and a shortage of skilled workers,” said Ken Mehlman, KKR partner and co-head of KKR Global Impact. Mehlman pointed to analysis by Lightcast, a leader in labour market analytics and one of the KKR Global Impact’s portfolio companies, which found that the skills requested for the average US job have changed measurably since 2016. This development demands a “significant acceleration of upskilling,” of the American workforce, Mehlman said. “We believe our global impact strategy is well-positioned to invest behind these macro tailwinds,” Mehlman added.","filter_flag":1}
{"title":"VF Corp publishes sustainability advances | Fashion & Retail News | News - Ecotextile News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmVjb3RleHRpbGUuY29tLzIwMjMxMTE0MzEzOTYvZmFzaGlvbi1yZXRhaWwtbmV3cy92Zi1jb3JwLXB1Ymxpc2hlcy1zdXN0YWluYWJpbGl0eS1hZHZhbmNlcy5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmVjb3RleHRpbGUuY29tLzIwMjMxMTE0MzEzOTYvZmFzaGlvbi1yZXRhaWwtbmV3cy92Zi1jb3JwLXB1Ymxpc2hlcy1zdXN0YWluYWJpbGl0eS1hZHZhbmNlcy5odG1s0gEA?oc=5","id":"CBMia2h0dHBzOi8vd3d3LmVjb3RleHRpbGUuY29tLzIwMjMxMTE0MzEzOTYvZmFzaGlvbi1yZXRhaWwtbmV3cy92Zi1jb3JwLXB1Ymxpc2hlcy1zdXN0YWluYWJpbGl0eS1hZHZhbmNlcy5odG1s0gEA","guidislink":false,"published":"Tue, 14 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=318, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmVjb3RleHRpbGUuY29tLzIwMjMxMTE0MzEzOTYvZmFzaGlvbi1yZXRhaWwtbmV3cy92Zi1jb3JwLXB1Ymxpc2hlcy1zdXN0YWluYWJpbGl0eS1hZHZhbmNlcy5odG1s0gEA?oc=5\" target=\"_blank\">VF Corp publishes sustainability advances | Fashion & Retail News | News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Ecotextile News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"VF Corp publishes sustainability advances | Fashion & Retail News | News - Ecotextile News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmVjb3RleHRpbGUuY29tLzIwMjMxMTE0MzEzOTYvZmFzaGlvbi1yZXRhaWwtbmV3cy92Zi1jb3JwLXB1Ymxpc2hlcy1zdXN0YWluYWJpbGl0eS1hZHZhbmNlcy5odG1s0gEA?oc=5\" target=\"_blank\">VF Corp publishes sustainability advances | Fashion & Retail News | News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Ecotextile News<\/font>","source.href":"https:\/\/www.ecotextile.com","source.title":"Ecotextile News","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"DENVER - VF Corporation, which owns brands such as Timberland, Vans, Dickies and North Face, is claiming significant progress in its work to reduce its environmental impact in its newly published 2023 environmental and social responsibility report. The report, “Purpose. Driven\" shows that VF's sourcing of recycled polyester increased to 40% in 2022, an improvement from 36% the previous year, putting the group well on its way toward achieving its target to use 50% recycled polyester by 2026.","filter_flag":1}
{"title":"Mars \"Reuses\" Fan-Favorite Ads for M&Ms®, TWIX®, SNICKERS® and Ben's Original™ to Deliver Message of Hope ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiqgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hcnMtcmV1c2VzLWZhbi1mYXZvcml0ZS1hZHMtZm9yLW1tcy10d2l4LXNuaWNrZXJzLWFuZC1iZW5zLW9yaWdpbmFsLXRvLWRlbGl2ZXItbWVzc2FnZS1vZi1ob3BlLWZvci1jbGltYXRlLWFjdGlvbi0zMDE5OTgyNTkuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiqgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hcnMtcmV1c2VzLWZhbi1mYXZvcml0ZS1hZHMtZm9yLW1tcy10d2l4LXNuaWNrZXJzLWFuZC1iZW5zLW9yaWdpbmFsLXRvLWRlbGl2ZXItbWVzc2FnZS1vZi1ob3BlLWZvci1jbGltYXRlLWFjdGlvbi0zMDE5OTgyNTkuaHRtbNIBAA?oc=5","id":"CBMiqgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hcnMtcmV1c2VzLWZhbi1mYXZvcml0ZS1hZHMtZm9yLW1tcy10d2l4LXNuaWNrZXJzLWFuZC1iZW5zLW9yaWdpbmFsLXRvLWRlbGl2ZXItbWVzc2FnZS1vZi1ob3BlLWZvci1jbGltYXRlLWFjdGlvbi0zMDE5OTgyNTkuaHRtbNIBAA","guidislink":false,"published":"Tue, 28 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=332, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hcnMtcmV1c2VzLWZhbi1mYXZvcml0ZS1hZHMtZm9yLW1tcy10d2l4LXNuaWNrZXJzLWFuZC1iZW5zLW9yaWdpbmFsLXRvLWRlbGl2ZXItbWVzc2FnZS1vZi1ob3BlLWZvci1jbGltYXRlLWFjdGlvbi0zMDE5OTgyNTkuaHRtbNIBAA?oc=5\" target=\"_blank\">Mars \"Reuses\" Fan-Favorite Ads for M&amp;Ms®, TWIX®, SNICKERS® and Ben's Original™ to Deliver Message of Hope ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Mars \"Reuses\" Fan-Favorite Ads for M&Ms®, TWIX®, SNICKERS® and Ben's Original™ to Deliver Message of Hope ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hcnMtcmV1c2VzLWZhbi1mYXZvcml0ZS1hZHMtZm9yLW1tcy10d2l4LXNuaWNrZXJzLWFuZC1iZW5zLW9yaWdpbmFsLXRvLWRlbGl2ZXItbWVzc2FnZS1vZi1ob3BlLWZvci1jbGltYXRlLWFjdGlvbi0zMDE5OTgyNTkuaHRtbNIBAA?oc=5\" target=\"_blank\">Mars \"Reuses\" Fan-Favorite Ads for M&amp;Ms®, TWIX®, SNICKERS® and Ben's Original™ to Deliver Message of Hope ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"In a first-of-its-kind digital and out-of-home campaign for the company, Mars revives iconic advertisements from beloved brands to engage and inspire the public around climate action. The Mars campaign is aimed at raising consumer awareness by 'reusing' old, iconic adverts and showcasing creative ways to leave a lighter environmental footprint in advertising, following the recent publication of the Mars Net Zero Roadmap. The focus on engaging a wider consumer audience comes after a recent Ipsos\/Mars survey involving over 14,000 people across the world's seven largest economies found, on average, 69% of adults want businesses to focus on tackling climate change as much as, or even more than, economic issues. Andrew Clarke , Member of the Global Mars, Incorporated Leadership Team and President of Mars Wrigley , welcomed the campaign as a fun way to harness the power of iconic brands and marketing to inspire and drive consumer awareness. MCLEAN, Va., Nov. 28, 2023 \/PRNewswire\/ -- Mars, Incorporated launches a first-of-its-kind digital and out-of-home campaign that 'reuses' fan-favorite advertisements giving them a second life with new messages of hope and progress around climate. The campaign, titled \"Healthy Planet Productions\", follows the recent publication of Mars Net Zero Roadmap to accelerate action towards achieving Net Zero emissions by 2050, including a new Science Based Target Initiative (SBTi) approved target to cut carbon emissions in half by 2030 across its full value chain. Advertisements in the Mars 'reused' advertisement campaign will run in the U.S., U.K. and Mexico across Meta platforms and YouTube and will include out-of-home activations in select markets. In the U.S., the campaign will highlight advertisements for M&Ms®, TWIX® and Ben's Original™. The U.K. will feature Bounty®, M&Ms® and TWIX®. Mexico will include M&Ms®. Andrew Clarke, Global President of Mars Wrigley, said consumers want to connect with brands on critical issues: \"They share our urgency in tackling climate change, but it's not always clear what companies are doing to deliver real change. That is why we decided to use our iconic brands in the adverts consumers know and love and deliver a message of hope and optimism on climate change. We are taking action now to reduce carbon emissions - from working with farmers to protect forests to sourcing renewable electricity. We want consumers to know we're working on having tangible impact now.\" Barry Parkin, Chief Procurement and Sustainability Officer said, \"When we launched our Net Zero Roadmap back in September, we talked about delivering real impact and the need to inspire and involve everyone in the challenge. With this campaign, Mars is taking the work we are doing across our value chain to reduce carbon emissions and making it easy for consumers to engage and feel good about the products and brands they know and love.\" The Mars 'reused' advertisements campaign reduced production emissions by cutting emissions and removing the need for travel, filming and set production by repurposing content; and it minimized remaining emissions by prioritizing carbon avoidance as a key consideration in decision-making and creative development, including forgoing emission-intensive animation techniques for more sustainable methods. Mars also partnered with organizations and businesses committed to sustainability and that hold industry designations, such as Certified Green Energy Offices and Studios. Find more information on the Mars Net Zero Roadmap at www.mars.com\/sustainability-plan\/healthy-planet\/net-zero-2050. For media, please find a media kit of assets for download here: https:\/\/www.mars.com\/healthy-planet-productions\/mars-net-zero-roadmap-2050-multimedia-assets NOTES TO EDITORS For more information and full results from Ipsos, visit: https:\/\/www.ipsos.com\/en-uk\/perceptions-businesses-focus-economic-challenges-vs-climate-change ABOUT MARS, INCORPORATED Mars, Incorporated is driven by the belief that the world we want tomorrow starts with how we do business today. As a global, family-owned business, Mars is transforming, innovating, and evolving to make a positive impact on the world. Across our diverse and expanding portfolio of quality snacking, food, and pet care products and services, we employ 140,000+ dedicated Associates. With more than $47 billion in annual sales, we produce some of the world's best-loved brands including Ben's Original™, CESAR®, Cocoavia®, DOVE®, EXTRA®, KIND®, M&M's®, SNICKERS®, PEDIGREE®, ROYAL CANIN®, and WHISKAS®. We are creating A Better World for Pets through our global network of pet hospitals and diagnostic services – including AniCura, BANFIELD™, BLUEPEARL™, Linnaeus and VCA™ – using cutting edge technology to develop breakthrough programs in genetic health screening and DNA testing. For more information about Mars, please visit www.mars.com. Join us on Facebook, Instagram, LinkedIn and YouTube. Press contacts: Liza Pluto [email protected] Dan Strechay [email protected] SOURCE Mars, Incorporated","filter_flag":1}
{"title":"Why Emerging Markets Need to Prepare for the EU's New Climate and ESG Regulations - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LWVtZXJnaW5nLW1hcmtldHMtY2FuLXByZXBhcmUtZm9yLXRoZS1uZXctZXNnLXJlZ3VsYXRpb25z0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LWVtZXJnaW5nLW1hcmtldHMtY2FuLXByZXBhcmUtZm9yLXRoZS1uZXctZXNnLXJlZ3VsYXRpb25z0gEA?oc=5","id":"CBMiYmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LWVtZXJnaW5nLW1hcmtldHMtY2FuLXByZXBhcmUtZm9yLXRoZS1uZXctZXNnLXJlZ3VsYXRpb25z0gEA","guidislink":false,"published":"Tue, 14 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=318, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LWVtZXJnaW5nLW1hcmtldHMtY2FuLXByZXBhcmUtZm9yLXRoZS1uZXctZXNnLXJlZ3VsYXRpb25z0gEA?oc=5\" target=\"_blank\">Why Emerging Markets Need to Prepare for the EU's New Climate and ESG Regulations<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why Emerging Markets Need to Prepare for the EU's New Climate and ESG Regulations - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LWVtZXJnaW5nLW1hcmtldHMtY2FuLXByZXBhcmUtZm9yLXRoZS1uZXctZXNnLXJlZ3VsYXRpb25z0gEA?oc=5\" target=\"_blank\">Why Emerging Markets Need to Prepare for the EU's New Climate and ESG Regulations<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"In December 2021, European leaders returned home from the COP26 climate conference in Glasgow determined to honor pledges to back their climate commitments with concrete action. Since then, the European Union has issued a flurry of regulations applying environmental, social, and governance (ESG) standards to trade. These measures are expected to significantly reduce CO 2 emissions, protect greener European producers from unfair competition, and discourage bad trade practices. Their greatest economic impact, however, will likely be felt not in the EU but in emerging markets. Few companies and governments in developing nations are prepared for what is about to hit them. In the absence of a real sense of urgency, concrete actions, and multilateral cooperation, many are in jeopardy of being shut out of their key export markets. Two of the most significant EU measures relate to climate. One is the Carbon Border Adjustment Mechanism (CBAM), which will soon place the same price on carbon emissions associated with materials produced in developing nations—including steel, aluminum, and chemicals—that producers in the EU now pay. The other is the EU Deforestation Regulation (EUDR), which bans the sale of commodities such as cocoa, coffee, palm oil, and timber harvested from recently cleared rainforest. This will affect important export industries in Latin America, Africa, and Southeast Asia. Taken together, these and other climate- and values-based measures amount to one of the biggest changes to global trade since the creation of the World Trade Organization in 1995. They will eventually affect virtually every significant emerging-market export sector. Emerging-market companies and governments must act now. The measures needed to remain competitive in Europe and in markets that adopt similar ESG rules can’t be implemented overnight. If they haven’t done so already, companies need to establish systems for documenting and reporting the greenhouse gas footprints and other data relating to their products and supply chains. And rather than merely react to new requirements as they arise, companies should adopt “smart compliance”—a pragmatic approach to fulfilling mandatory disclosure requirements. Companies also need a holistic strategy and game plan for decarbonizing and for improving their overall ESG performance. The Growing Sustainability Imperative The movement to get companies to adhere to ESG standards has been gaining momentum in advanced economies for decades. Now, the sustainability movement is hitting emerging markets at full force. These nations, which by 2050 are expected to account for 62% of the global economy and 88% of the population, are crucial to mitigating climate change. Although they emit less CO2 per capita than advanced economies, they account for around 85% of the global total—a share that’s projected to grow. Emerging-market companies are under intensifying pressure, not just from the demands of their trade partners, but from consumers, investors, regulators, and employees at home and abroad to back their commitments with verifiable action. (See Exhibit 1.)","filter_flag":1}
{"title":"Moving Beyond Net Zero to Nature Positive - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvbW92aW5nLWJleW9uZC1uZXQtemVyby10by1uYXR1cmUtcG9zaXRpdmXSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvbW92aW5nLWJleW9uZC1uZXQtemVyby10by1uYXR1cmUtcG9zaXRpdmXSAQA?oc=5","id":"CBMiT2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvbW92aW5nLWJleW9uZC1uZXQtemVyby10by1uYXR1cmUtcG9zaXRpdmXSAQA","guidislink":false,"published":"Tue, 28 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=332, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvbW92aW5nLWJleW9uZC1uZXQtemVyby10by1uYXR1cmUtcG9zaXRpdmXSAQA?oc=5\" target=\"_blank\">Moving Beyond Net Zero to Nature Positive<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Moving Beyond Net Zero to Nature Positive - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvbW92aW5nLWJleW9uZC1uZXQtemVyby10by1uYXR1cmUtcG9zaXRpdmXSAQA?oc=5\" target=\"_blank\">Moving Beyond Net Zero to Nature Positive<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"On December 19, 2022, some 195 countries adopted the Kunming-Montréal Global Biodiversity Framework (GBF) aimed at halting and reversing the global decline of nature and biodiversity. The GBF established 23 targets, including those focused on the protection of freshwater and other ecosystems and the disclosure of biodiversity impacts by companies. Nature is also at the heart of the COP28 agenda, with thematic programming that includes creating nature-positive cities, protecting and restoring marine and coastal ecosystems, and more. The private sector will play a vital role in achieving the targets of the GBF. This means working to become nature positive—ensuring that the sum of an organization’s actions and impacts on nature will contribute to the reversal of the global decline in biodiversity by 2030, followed by full recovery by 2050. As our interviews with business and other leaders acting on the tenets of the nature positive movement indicate, the need to expand these efforts is pressing, and the financial first-mover advantage is likely considerable. We lay out an action plan for leaders to seize that advantage. The Business Case for Focusing on Nature The economic value produced by biodiversity is more than $150 trillion annually—nearly twice the world’s GDP. But natural ecosystems don’t simply underpin our economic wellbeing, they provide the water we drink, the food we eat, the air we breathe, and the stable climate needed for human development. The drive to nature positive is especially pressing for industries that not only have significant impacts on nature, but also are heavily dependent on nature. These industries include agriculture, energy, forestry, food and fisheries, manufacturing, mining, retail, and pharmaceuticals. The economic value produced by biodiversity is more than $150 trillion annually. That’s why, in the lead up to COP15, more than 400 companies from 52 countries with $2 trillion in combined revenue signed onto Business for Nature’s “Make it Mandatory” campaign. This campaign called for formidable targets, such as the adoption of mandatory nature-related disclosures for large business and financial institutions by 2030. “What was impressive at COP15 was hearing the reactions of negotiators to businesses asking them to be as ambitious as possible,” recalls Varsha Vijay, technical director of the Science Based Targets Network (SBTN). Our interviews and research revealed four benefits of nature positive that can help leaders make a compelling business case for action. Nature positive is central to business resilience. Taking action for nature reduces the risks that companies face. First, it lowers the risk of being unable to obtain the natural resources or assets on which the company depends. For example, when manufacturers reduce and conserve the ground water needed in their processes, they are helping to ensure that it will continue to be available in sufficient quantity and at an acceptable price. “For us, poor soils give poor yields and it’s a business risk. The worse nature gets, the more expensive it is to get the same productivity,” says Adrien Geiger, group chief sustainability officer of L’Occitane, the French manufacturer and retailer of beauty products. Second, it lowers risk of misalignments between companies and their stakeholders. When pharmaceutical companies source chemical compounds in ways that place less stress on at-risk species, they lower the risk that they will run afoul of new regulations and customer preferences. “Pharma relies on natural diversity to create medicines and compounds, and we need to protect those species and environments in nature,” says Sandrine Bouttier-Stref, global head of corporate social responsibility for pharmaceutical and healthcare company Sanofi. Companies that assess their nature impacts, risks, and dependencies better understand the ways in which nature contributes to their businesses and can position themselves to protect the resources that are essential to their operations. “Protecting nature makes our business more resilient and helps to ensure the ongoing supply of raw materials needed for manufacturing and delivering the products that patients rely on,” says Claire Lund, global vice president for Sustainability at global biopharma GSK. In many cases, this understanding leads to the more efficient use of natural inputs and ecosystem services, as well as a measure of protection from price increases that arise from scarcity. “You have nature and businesses win-win; if you use less water on sites, you can ensure this natural resource is available for your business and you may even save on costs in the long term,” says Renata Pollini, head of Nature at Holcim, the Switzerland-based global cement and building materials company. Companies that assess their nature impacts, risks, and dependencies better understand the ways in which nature contributes to their businesses. Nature positive can add substance to ESG. ESG is a growth opportunity: ESG-related assets in the capital markets are projected to rise to $50 trillion globally by 2025; sustainability-linked loans and financing exceeded $1.6 trillion in 2021; and green public-procurement initiatives will provide an estimated $6 trillion boost to global GDP and create 3 million net new jobs by 2050. As with net zero, nature positive reporting and disclosure will help financial institutions and governments to identify and invest in companies that are addressing nature risks and capturing the opportunities they offer. Nature positive can generate demand side opportunities. As nature consciousness increases, more customers are likely to pay a premium for nature positive products and services. In B2C, some customers favor consumer goods companies and products that are climate friendly, and the same advantage is likely to accrue to first movers on nature. In B2B, some buyers are anticipating demand from their customers or regulators and are moving to securing access to the limited pool of nature sensitive commodities, while some suppliers are acting to capture these emerging “nature procurement” opportunities. Nature positive can enhance employer brands. We know that companies with net zero strategies and those acting to tackle climate change are more successful at attracting and retaining talent. Indeed, about half of the employee respondents to a 2020 BCG\/The Network web survey said they would not work for organizations that do not reflect their personal beliefs regarding the environment. As with climate action, being nature positive can give companies an advantage in attracting and retaining talent in what is a challenging market for many employers. The competition for nature-related professionals is particularly intense. “There is a massive skills gap in the biodiversity area,” says Benj Sykes, vice president of Offshore and head of Environment, Consenting & External Affairs at Ørsted, the multinational power company. Companies that act early to establish a nature positive reputation will gain an advantaged position in the talent market as they seek to recruit and develop skilled nature teams. An Action Plan To answer the call to action embodied in the targets of the Kunming-Montreal Global Biodiversity Framework and begin to reap the benefits of nature positive, company leaders can take four steps. Establish a clear North Star for the company’s nature ambition. Net zero has been a galvanizing and specific goal for addressing climate change, and companies will need a similar clarity. The challenge is that GBF’s list of global targets does not easily translate into a clear action plan at the company level. “The COP15 outcome is more complex than the 1.5° target due to nature not having a singular measure—in contrast to greenhouse gas emissions for climate,” says Nathalie Borgeaud, lead for Financial Markets Stakeholder Engagement at the Taskforce on Nature-related Financial Disclosures. What nature positive lacks is a focal point of action for achieving its ambition. All the leaders we interviewed support the global ambition of nature positive, but their initiatives are at different levels of maturity, and they are responding to the ambiguous focus of nature positive in different ways: Some are seeking an active role in defining its standards; others are waiting for a consensus to emerge. Nature is not like climate change. Net zero is a more straightforward target: units of carbon emitted or abated are concrete, measurable, and have the same impact on the atmosphere wherever the occur. Nature is more complex, and it spans realms, resources, and locations. Even if it were possible to boil nature down to a single metric (like CO 2 e for carbon), the metric would be too broad to use. “Nature as a concept needs that complexity to ensure that when companies are taking action, they are taking meaningful actions on concrete dimensions of nature,” says SBTN’s Varsha Vijay. Nature is not like climate change. The various elements of nature, the diversity of natural ecosystems, and the many different ways these ecosystems support economic activity make it challenging to define what nature positive means for companies. Despite this challenge, more concrete definitions of what nature positive means are emerging. The IPBES (Intergovernmental Science-Policy Platform on Biodiversity and Ecosystem Services) provides a helpful framework for companies to assess their impacts by defining five main pressures that human activity exerts on nature. These are: land use and land use change; resource use, including wild species and water resources; land, water, and air pollution; greenhouse gases; and disturbances, such as invasive species. Companies need to understand which of these pressures are material in their operations and value chain. Additionally, many of these pressures are local by nature. For example, water use is a problem if a company has water-intensive processes in water-stressed areas, but the same activity in a locale with no water constraints may not be material. Thus, companies need to understand where their material pressures are contributing to the degradation of nature systems by examining specific pressures in specific landscapes. Moreover, nature’s impacts are nonfungible. Generally speaking, companies cannot offset one pressure for another: restoring water sources cannot serve as a substitute for deforestation. The individual pressures need to be avoided and reduced, then restored and regenerated, and then the system that produced them must be transformed. For example, if the pressure is on water, water may be conserved, then wetlands may be replanted to restore the capacity of the watershed, and finally, funding may be provided to change local farming practices. The meaning and measurement of positive actions for biodiversity will vary by what business activities occur, where they occur, and which ecosystem services are impacted or relied upon in the commission of that activity. As Benj Sykes of Ørsted says, “You’re not going to have one number for biodiversity measures. That’s not going to happen.” Rather, Ørsted is working toward a comprehensive set of metrics and indicators to quantify the net-positive impact its projects are having on local ecosystems. Given these conditions, the idea of a company declaring itself a nature positive business is a high hurdle in present moment. Instead, companies can make a commitment to nature positive and as Sandrine Bouttier-Stref of Sanofi says, “Back it up with actions having real impacts and real delivery at the local level.” Ultimately, aligning a company with the goal of nature-positivity requires more than curbing only its most egregious nature-harming activities. We believe companies need to ensure that their nature goals: Extend across the full value chain, in the same way that Scope 1, 2, and 3 emissions do in carbon reduction. Address all the principal pressures exerted on nature by the company, as defined by the nine planetary boundaries. Encompass all impacted landscapes by adopting specific measures and targets that address the unique conditions and needs of local environments. Prioritize impact reductions now and incorporate long-term, transformational restoration and regeneration goals by 2030. Decide how and where to start taking action on nature, now. Many companies and financial institutions are unsure how to begin on the journey to nature positive. The maze of nature-related scientific opinions, standards, and frameworks is central to this dilemma. As Michael Ofosuhene-Wise of Business for Nature states, however, “We cannot let the perfect be the enemy of the good at this point. There are many no-regret actions and commitments businesses can already begin to make.” Consequently, the emergence of two voluntary standards as clear leaders at COP15 has been well received: the impact assessment and target-setting tools of the Science Based Targets Network (SBTN) and the risk and disclosure guidelines of the Taskforce on Nature-related Financial Disclosures (TNFD). SBTN enables companies to understand their impacts on nature and offers tools for assessing those impacts, evaluating materiality, prioritizing areas of impact, setting targets, and taking action. TNFD enables companies to understand the ways in which they are dependent on nature and provides tools to identify, quantify, and disclose nature-related dependencies and risks. The two frameworks have been designed to work together and enable companies to consider double materiality, that is, both the impact of the company on nature and the impact of nature on the company. After much anticipation, guidance from both SBTN and TNFD has finally been released for use this year. As of May 2023, the first SBTN methods companies can use to set science-based targets for nature are available. These methods are in different stages of development but include methods for freshwater quality and quantity, conversion of natural land, land footprint reduction, and landscape engagement. Several of the executives with whom we spoke said their companies have already used SBTN’s guidance to identify their material impacts on nature. (See “Leading on Nature.”) Leading on Nature Companies can use the current guidance by the Science Based Targets Network (SBTN) and the Taskforce on Nature-related Financial Disclosures (TNFD) to get started on the nature positive journey. Doing so now is important for a number of reasons: Several key ecosystems are nearing collapse and could result in the disappearance of valuable ecosystem services by 2030. Even action taken now is likely to take 5–10 years to deliver results. As Holcim’s Renata Pollini says, “Nature cannot wait. We need to act now.” The opportunity to establish a position as frontrunner will not last. Those lagging in ambition will not only expose themselves to unnecessary risk, but they will also lose the opportunity to inform the frameworks and standards against which they will be measured and regulated in the future. “By adopting the significant amount of existing guidance, businesses can already begin to transform and understand how they impact and depend on nature,” urges Martin Lok, executive director of Capitals Coalition, a global collaboration effort working to ensure that businesses, financial institutions, and governments include the value of natural, social, and human capital in their decision making. Companies that start now can play a proactive role in testing and refining the guidance and tools that will define nature positive in the years ahead. For companies in food and agriculture, forestry, extractive, and heavy industries, the need to start is increasingly acute: They have significant impacts and dependencies on nature and are most likely to be affected as governments adopt nature protection regulations. “The frontrunners don’t start because they already know everything, they start because they want to be ahead of the game and see the benefit in taking action now,” adds Lok. Even though setting nature targets, assessing nature impacts and risk exposures, and developing pathways aimed at stopping nature decline are novel pursuits in most companies, nature will not require a wholly new transformation. Companies that have already started on sustainability journeys that address climate, water, and\/or waste will have some of the required organizational muscle and technical expertise already in place, and their stakeholders are likely to see nature as an expansion of that journey. “Having a climate strategy already means you have the internal mechanisms in place for addressing nature impacts. Setting science-based targets for nature builds upon the work that companies have already done,” says Varsha Vijay of SBTN. Moreover, companies that have adopted science-based targets for net zero and file climate-related disclosures will have a head start on nature. “If you have already gone through TCFD [the Task Force on Climate-Related Financial Disclosures], you’re gaining five years,” says Nathalie Borgeaud of the Taskforce on Nature-related Financial Disclosures. SBTN continue to work closely with SBTi to align requirements and provide companies a clear indication of what best practice looks like for environmental impact management. The joint guidance from SBTN and TNFD on target setting has been refined to reflect the latest developments from both organizations on impact assessment and targets. A company should conduct a materiality assessment of its value chain and set targets for action: Use SBTN and TNFD to paint a full picture of the impacts of your company on nature and the magnitude of its nature-related risks and dependencies. This double materiality is likely to differ significantly between your company and companies in your industry and in other industries. Based on your materiality assessment, move quickly to set and prioritize science-based targets that will support your headline ambition. Be prepared to revise the targets as nature positive goals evolve. Redefine and transform your company’s business models and operations. Achieving nature positive targets and capturing opportunities for value creation that they reveal will require companies to transform their business models and operations. All the leaders we consulted recognized that nature positive has significant implications for business models. Every company will have a different vision and plan for these transformational efforts. (See “Nature-Focused Transformations.”) But all transformations require the same kinds of enablers and nature positive transformation have some clear markers for success: Nature-Focused Transformation Efforts Ørsted, the Danish energy multinational, is a clear and early example of transformation in the face of climate change. By 2006, the company was developing offshore wind farms as the first stage of its transformation from fossil fuels-based operator to a renewable energy operator. Currently, Ørsted is incorporating net positive biodiversity goals into this transformation by, for example, installing artificial reefs at offshore wind sites. The company has also declared it will deliver a net-positive biodiversity impact from all new renewable energy projects by 2030, and, toward that end, has integrated biodiversity principles across its operations. Accor Hotels is reimagining the internationally standardized model for luxury hotels in pursuit of a differentiated customer experience that also supports nature positive. Instead of providing the same experience globally, the company is redefining itself as “multi-local” and taking biodiversity into account when choosing locations to avoid artificialization of highly biodiverse areas. It is also modifying the services and offerings of its hotels based on their local nature impacts. For example, hotel restaurants build their menus around sustainable and local foods. L’Occitane, the French manufacturer and retailer of beauty products, is returning to its roots by re-establishing nature as a core element of its mission and publicly committing to a nature positive strategy that spans the enterprise. Toward that end, L’Occitane is seeking both marketplace and cost advantages by utilizing natural ingredients in its products and formulas whenever they offer a sustainability advantage over synthetics. GSK, the global biopharma company, recognizes the link between nature, climate, and human health. In 2020, GSK set ambitious goals across its entire value chain—committing to a net zero impact on climate and to contribute to a nature positive, healthier world. It is one of the 17 companies in SBTN’s pilot group aiming to set validated science-based targets for nature and has committed to publishing TNFD aligned disclosures in 2026. GSK is also investing in nature protection and restoration, within and outside its supply chain. In Nashik, India, a water-stressed region where GSK has operations, GSK is partnering with a local NGO on a community-based water replenishment project and is a founding partner of the Women + Water Collaborative. Nature-focused transformations require strong corporate leadership. As Sandrine Bouttier-Stref of Sanofi told us: “It is critical that the whole company leadership, including the CEO and the executive committee understand and acknowledge the issues at stake.” Therefore, leaders must understand why the company needs to act for nature and set a high ambition. They also need to enlist the full commitment of their boards and senior executives through a variety of means, including tailored compensation plans. “We included sustainability incentives for senior leaders’ bonuses,” says Renata Pollini of Holcim. “In addition to performing financially, they have to deliver on climate, freshwater, and circular economy to get their bonus entirely. This is really a shift in their mindset.” As Sandrine Bouttier-Stref of Sanofi told us: “It is critical that the whole company leadership, including the CEO and the executive committee understand and acknowledge the issues at stake.” Therefore, leaders must understand why the company needs to act for nature and set a high ambition. They also need to enlist the full commitment of their boards and senior executives through a variety of means, including tailored compensation plans. “We included sustainability incentives for senior leaders’ bonuses,” says Renata Pollini of Holcim. “In addition to performing financially, they have to deliver on climate, freshwater, and circular economy to get their bonus entirely. This is really a shift in their mindset.” Nature-focused transformations must involve the entire business. The responsibility for change should not rest solely on the central sustainability team. Instead, it should be spread among functions, such as procurement and sourcing, new product development, and operations, if it is to have an impact. Nature positive must be embedded in the corporate culture and in decision-making processes across the company and their interactions across the value chain. “We are supporting our suppliers to step up their ambition and actions on nature, for example, by working with them to implement our sustainability standards for natural materials,” says GSK’s Claire Lund. The responsibility for change should not rest solely on the central sustainability team. Instead, it should be spread among functions, such as procurement and sourcing, new product development, and operations, if it is to have an impact. Nature positive must be embedded in the corporate culture and in decision-making processes across the company and their interactions across the value chain. “We are supporting our suppliers to step up their ambition and actions on nature, for example, by working with them to implement our sustainability standards for natural materials,” says GSK’s Claire Lund. Nature-focused transformations require collaboration. A company can use less water, but if a neighboring company takes this opportunity to use more, it will not reduce the risks of water stress on the local environment. Thus, companies need to engage with participants across their ecosystems and forge connections and relationships with the scientific and political communities, customers and suppliers, other businesses, and the communities in which they operate. In this regard, leaders should pay particular attention to stakeholders at the local level: Indigenous peoples and local communities make up only 5% of the global population, yet they are the stewards of 80% of the world’s biodiversity, according to the World Wildlife Fund. As Sandrine Bouttier-Stref of Sanofi says, “We need to find ways to improve nature together and galvanize action on our common dependencies.” Companies that embark on the transformation journey to nature positive early can benefit from first-mover advantages. These advantages can manifest in the ability to orchestrate and shape new value chains and business ecosystems, and to secure the control points in terms of assets, talent, partnerships, and customers. Coordinate and combine the company’s climate and nature initiatives. The last challenge identified is the additional burden of taking on and managing a nature positive initiative while also pursuing existing sustainability and climate initiatives. This challenge manifests in the complexity of increased reporting, and confusion about competing environmental priorities, with action paralysis cascading across different business units and regions. Companies that embark on the transformation journey to nature positive early can benefit from first-mover advantages. This sounds daunting, but climate and nature are interlinked and so most companies are not starting from scratch. The biggest pressure on biodiversity and natural environments stems from climate change. Similarly, nature loss also significantly accelerates climate change, through the loss of natural carbon sinks in forests and wetlands, which currently sequester one-third of global GHG emissions annually. “Biodiversity and carbon issues are actually two faces of the same coin,” explains Brune Poirson, chief sustainability officer of Accor, a global hospitality group. “We cannot build a carbon-neutral world without protecting nature.” Companies can reap positive synergies by recognizing and taking a coordinated approach to sustainability. In sourcing less carbon-intensive commodities, for example, a company can also seek to limit its impact on nature—pursuing multiple sustainability benefits from one procurement decision. Another way is to ensure that carbon offsetting strategies also deliver for biodiversity, by selecting projects that offer biodiversity net gain or do not convert existing natural ecosystems. Capturing synergies requires that companies carefully consider these climate-nature interactions when defining their sustainability strategy. This offers an opportunity to spot both complements and conflicts between proposed climate and nature initiatives early on and ensure that they deliver maximum effect without unwittingly doing damage. As Claire Lund of GSK says, “We know that the twin crises of nature loss and climate change are linked and that action on nature is a critical part of achieving a net zero future. So, our nature plan is interdependent with and supports our commitment and pathway for a net zero impact on climate.” Integrating nature with previous initiatives can ease the organizational challenges of nature positive. It creates an opportunity to apply the organizations, mechanisms, capabilities, and governance developed for earlier initiatives to nature positive. It enables companies to tap into previously acquired knowledge regarding their supply chains, operations, and downstream activities. For instance, companies that have tracked their carbon footprints already have much of the information they need to trace the outline of their nature footprints; they only need to identify the place of origin for commodities or location of activity to track their full impact across all planetary boundaries. Further, because nature positive initiatives stand on the shoulders of climate sustainability efforts, it can make it easier to gain management approvals and investor support. The nature positive agenda is still emerging and already evolving. But the adoption of the Kunming-Montréal Global Biodiversity Framework is a clear signal that government leaders are ready to act more aggressively on nature and puts business leaders on notice that they should begin preparing their companies for a nature positive future. Business leaders who embrace that role now will not only be moving to secure the futures of their companies, they also will become agents of change in the protection and restoration of the natural world on which human life depends. The authors appreciate and extend our thanks to our interviewees and other experts and practitioners for their time, contributions, and insights.","filter_flag":1}
{"title":"Benefits of Carbon Pricing to Inspire Action on Net Zero | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYmVuZWZpdHMtb2YtY2FyYm9uLXByaWNpbmctdG8taW5zcGlyZS1uZXQtemVyb9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYmVuZWZpdHMtb2YtY2FyYm9uLXByaWNpbmctdG8taW5zcGlyZS1uZXQtemVyb9IBAA?oc=5","id":"CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYmVuZWZpdHMtb2YtY2FyYm9uLXByaWNpbmctdG8taW5zcGlyZS1uZXQtemVyb9IBAA","guidislink":false,"published":"Mon, 06 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=310, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYmVuZWZpdHMtb2YtY2FyYm9uLXByaWNpbmctdG8taW5zcGlyZS1uZXQtemVyb9IBAA?oc=5\" target=\"_blank\">Benefits of Carbon Pricing to Inspire Action on Net Zero | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Benefits of Carbon Pricing to Inspire Action on Net Zero | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYmVuZWZpdHMtb2YtY2FyYm9uLXByaWNpbmctdG8taW5zcGlyZS1uZXQtemVyb9IBAA?oc=5\" target=\"_blank\">Benefits of Carbon Pricing to Inspire Action on Net Zero | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The bottom line: companies continue to fall short in virtually every aspect of the journey toward net zero. To get there, business leaders must rally their broader organizations behind the decarbonization agenda and initiate ambitious actions to reduce their carbon footprint. This requires more than just measuring and disclosing carbon footprint data and defining actionable reduction goals and a timeline for the effort. Companies must also embed carbon footprint reduction targets in every aspect of their strategy, governance, corporate steering, investment decisions, and operations. The most effective way to accomplish this is by assigning to all corporate GHG emissions an ICP—typically the conversion of tons of CO 2 equivalents (CO 2 -e) to a monetary value. This allows for a high level of comparability among planned initiatives and investments, and in turn enables a direct assessment of the impact of carbon reductions on both opex and capex decisions. In fact, according to the CDP, in 2022 more than 2,000 companies were using or planned to use internal carbon pricing in their efforts to establish and meet their carbon abatement goals. The corporate CFO and the finance function have expertise in financial planning and analysis, as well as investor relations, that is well-suited to assessing the ICP and managing its implementation across the company. The Price Is Right The great virtue of an ICP in reducing GHG emissions is that companies can apply it in a number of ways, taking into account both current and future emissions across their operations. In our experience, companies do best when they follow a consistent path to the full use of an ICP, which ensures that they gain the most value; however, each company’s ICP journey will be different. Many start by using the ICP to reflect the cost of future emissions in investment decisions, effectively improving the economics of any low-emissions projects while penalizing high-emissions projects. This will help companies build a future-ready portfolio of low-carbon assets. At the same time, it is also critical to begin to accelerate the decarbonization of all current assets by charging each asset for the cost of the carbon it emits, and tying emissions to each asset’s P&L performance. Depending on the ICP model used, the funds raised from the charges placed on assets can be spread evenly over years to finance the abatement of each asset’s carbon footprint and to invest in new low-carbon businesses and products. Companies can also embed the ICP in the procurement process for emissions-intensive materials, utilities, and services to reduce their scope 2 and scope 3 emissions and decarbonize their supply chains. Ultimately, companies should be monitoring their ICP-adjusted P&L at both global and brand levels, and fully integrate the cost of carbon into their cost of goods sold, current and forecast commodity prices, margins, and other key financial metrics. Charging the CFO and the finance function with the responsibility for managing the ICP process, in conjunction with the sustainability and strategy teams, will ensure that adequate rigor is brought to the task. Setting the Price The ICP journey begins with companies determining the most appropriate model for pricing carbon—based on how the ICP will be used—and then integrate it into their operations. There are three possible models for the ICP, each with varying applications and benefits, depending on the circumstances. Some companies may choose to mix models to achieve their desired goals. Shadow Price. In this model, companies assign a pre-determined carbon price to the likely GHG emissions of all procurement and investment decisions. This may be a regulatory price as determined through external carbon tax, the price of offsets in voluntary markets, or a function of total estimated abatement costs. Shadow pricing enables the company to determine the cost of their GHG emissions and integrate it into future decision-making. This includes the potential abatement costs involved in reaching corporate net zero goals and all future savings. A shadow price calculated for procurement decisions aims to account for and control upstream scope 2 and 3 emissions by choosing suppliers that are willing and able to provide low-carbon materials and components. In this model, companies assign a pre-determined carbon price to the likely GHG emissions of all procurement and investment decisions. This may be a regulatory price as determined through external carbon tax, the price of offsets in voluntary markets, or a function of total estimated abatement costs. Shadow pricing enables the company to determine the cost of their GHG emissions and integrate it into future decision-making. This includes the potential abatement costs involved in reaching corporate net zero goals and all future savings. A shadow price calculated for procurement decisions aims to account for and control upstream scope 2 and 3 emissions by choosing suppliers that are willing and able to provide low-carbon materials and components. Carbon Fee. By charging a dollar amount for every ton of CO 2 -e emitted on every asset’s scope 1 and 2 emissions—and collecting actual cash as an internal tax—companies can encourage emissions reductions and use the cash flow to support abatement actions throughout the organization. The carbon fee is intended to directly impact the bottom line of each asset and should be part of the incentive scheme for the leadership of the asset. (See “Implementing a Carbon Fee.”) By charging a dollar amount for every ton of CO -e emitted on every asset’s scope 1 and 2 emissions—and collecting actual cash as an internal tax—companies can encourage emissions reductions and use the cash flow to support abatement actions throughout the organization. The carbon fee is intended to directly impact the bottom line of each asset and should be part of the incentive scheme for the leadership of the asset. (See “Implementing a Carbon Fee.”) Cap and Trade. It is also possible for companies to allocate carbon credits to each business area and then devise a system that allows them to trade credits internally. If a business unit exceeds its allotted credits, it must buy additional allowances from other business areas. On occasion, a business unit might choose to offset its emissions using publicly traded credits, and then sell its remaining internal credits into the company’s trading scheme. Few companies, however, are likely to implement a cap-and-trade system given the high level of complexity involved in setting up an internal trading system that merely replicates available public trading systems. Implementing a Carbon Fee A leading Asian petrochemicals player with a global asset base had a problem. Its products were likely to become uncompetitive in Europe after the EU’s Carbon Border Adjustment Mechanism goes into effect in 2026. Meanwhile, the company faces increasing pressure from international customers to reduce the carbon intensity of its products. In response, the board set a strong net zero target and developed a detailed abatement roadmap. Implementing the roadmap, however, turned out to be a challenge—primarily because managers of the company’s assets were reluctant to make the decarbonization investments needed, preferring to protect their assets’ current bottom line. Company leaders decided to institute an internal carbon fee, which, like a tax on emissions, would impact each asset’s bottom line and incentivize fast decarbonization action while penalizing inaction. The company’s CSO and CFO teams worked together during the planning process to review the abatement roadmap. In light of that analysis, the actual size of the fee was designed to adequately support the overall net spend on abatement levers through 2050, starting low and ramping up over time as the cost of abatement rises. The company implemented the carbon fee by integrating it into finance and accounting policies and processes. The price is to be reviewed regularly to ensure that it evolves consistently with the company’s abatement roadmap. And funds generated from the fees will be collected centrally and used to support assets in their abatement initiatives. Which model to use, and how high to set the actual price, depends on the activity, asset, and geography where it is being applied. Companies should use a shadow price in the procurement process when the goal is to control immediate scope 2 and upstream scope 3 emissions—and an investment process when the goal is to account for the cost of future carbon regulations and the social impact of carbon emissions in current investment decisions. Higher prices could be applied on assets with greater carbon intensity to incentivize decarbonization and improve the competitiveness of those assets. Companies with assets and supply chains in regions with stringent regulations could also adopt higher prices to ensure their overall long-term competitiveness. Companies can set the actual ICP in three different ways. One option is to calculate an implicit price based on the company’s average cost of abatement across all assets. The total amount needed to abate all assets is then translated back to a set carbon fee, and the funds collected are then used to fully fund the abatement initiatives required. Alternatively, an external regulatory price, such as a carbon tax or the EU’s Carbon Border Adjustment Mechanism, can be used as an ICP if the organization has high exposure to such markets, either through assets located there or by selling products into them. Finally, companies could use an external offset price as another reference point if they are relying heavily on carbon offsets as part of their net zero strategy. However, certification standards such as Vera and Gold Standard are evolving quickly, so companies need to track them carefully and regularly update the ICPs derived from them. The ICP in Practice To ensure successful implementation, the ICP must be revised regularly in response to changes in market and business conditions. When regulatory carbon prices or external carbon offset prices change, for example, it is critical that companies reflect the change in both their current ICP and their forecast of future prices. Companies should also maintain a rolling forecast of the likely future ICP and embed it in their business planning processes, much like they forecast future commodities prices. This will allow them to better direct corporate steering and investments decision-making as markets and business conditions change. To effectively implement and manage the ICP, appropriate procedures and policies must be put in place. To ensure proper collection and use of carbon fees, for example, companies could create a central carbon fund, cost center, and accounting procedures for deducting the fees from all assets and crediting them to the central fund. To determine how the collected fees should be used to fund GHG reduction initiatives, the proper investment criteria must be defined in line with the company’s decarbonization roadmap. This could include current emissions and intermediate abatement targets and the marginal cost of abatement. Finally, the ICP and associated processes should be incorporated into the annual capital allocation and business planning process. Internal carbon pricing involves changes in the way an organization does business and how its employees work. Companies choosing to implement a shadow carbon price need to consider how to incorporate it into both their procurement and investment decisions. For procurement, companies should establish processes and tools to gather emissions data from suppliers for critical categories of goods and services. This is particularly important in developing or underdeveloped markets, where companies and suppliers may not openly report their emissions. Then they will need to define a mechanism for incorporating the shadow price into the commercial evaluations of supplier bids. It is important to openly communicate to suppliers the company’s plans and procedures for using the ICP as part of the procurement process. The Change Factor Establishing an internal carbon price involves changes in the way an organization does business and how its employees work. As with most change management efforts, companies essentially have two options for implementing an ICP regardless of the pricing model they decide to use. The first approach is to run small-scale pilots, either across individual business units or specific assets, to iron out the kinks, especially at a large organization. This can help to demonstrate that ICP activities can be successfully integrated across all supporting activities—such as finance, investments, and business planning—before rolling it out to the wider organization. The second approach involves launching the ICP uniformly across the company from the start. This can help to drive immediate action, allowing the entire organization to stand behind the sustainability objective. An immediate full roll-out is best suited to organizations that require less differentiated ICPs, such as for all assets within a single geographic area. Internal carbon prices have been shown to be an effective way for companies to account for their current carbon footprint, assess their carbon abatement needs, and then fund the decarbonization effort. By putting the process into the hands of the CFO and the finance function, it can be carried out with thoroughness and accuracy, and ensure that it is fully incorporated into the company’s operations and abatement initiatives.Yet designing and implementing an ICP will take time and should be paired with considerable change management actions. Given the need to begin the decarbonization process soon, if companies are to reach their net zero goals, the time to begin is now.","filter_flag":1}
{"title":"What's Ireland doing when it comes to just transition planning? - RTE.ie","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnJ0ZS5pZS9icmFpbnN0b3JtLzIwMjMvMTEyOC8xNDE4OTgyLWlyZWxhbmQtanVzdC10cmFuc2l0aW9uLXBsYW5uaW5nLXByb2Nlc3MtY2xpbWF0ZS1hY3Rpb24v0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnJ0ZS5pZS9icmFpbnN0b3JtLzIwMjMvMTEyOC8xNDE4OTgyLWlyZWxhbmQtanVzdC10cmFuc2l0aW9uLXBsYW5uaW5nLXByb2Nlc3MtY2xpbWF0ZS1hY3Rpb24v0gEA?oc=5","id":"CBMiaGh0dHBzOi8vd3d3LnJ0ZS5pZS9icmFpbnN0b3JtLzIwMjMvMTEyOC8xNDE4OTgyLWlyZWxhbmQtanVzdC10cmFuc2l0aW9uLXBsYW5uaW5nLXByb2Nlc3MtY2xpbWF0ZS1hY3Rpb24v0gEA","guidislink":false,"published":"Wed, 29 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=29, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=333, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnJ0ZS5pZS9icmFpbnN0b3JtLzIwMjMvMTEyOC8xNDE4OTgyLWlyZWxhbmQtanVzdC10cmFuc2l0aW9uLXBsYW5uaW5nLXByb2Nlc3MtY2xpbWF0ZS1hY3Rpb24v0gEA?oc=5\" target=\"_blank\">What's Ireland doing when it comes to just transition planning?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RTE.ie<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"What's Ireland doing when it comes to just transition planning? - RTE.ie","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnJ0ZS5pZS9icmFpbnN0b3JtLzIwMjMvMTEyOC8xNDE4OTgyLWlyZWxhbmQtanVzdC10cmFuc2l0aW9uLXBsYW5uaW5nLXByb2Nlc3MtY2xpbWF0ZS1hY3Rpb24v0gEA?oc=5\" target=\"_blank\">What's Ireland doing when it comes to just transition planning?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RTE.ie<\/font>","source.href":"https:\/\/www.rte.ie","source.title":"RTE.ie","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Analysis: with COP28 focusing on just transition climate plans, Ireland has much to learn from other countries' experiences in this regard By Vilja Johansson, University of Eastern Finland and Diarmuid Torney, DCU This week, representatives of the world's governments will gather in Dubai for this year’s UN climate change summit. A new item on the agenda for COP28 is the establishment of a work programme on just transition. Here in Ireland, the Government is planning for the establishment of a Just Transition Commission. As it does so, it would do well to learn from other countries’ experiences of setting up just transition planning and policy processes. What is just transition? Just transition seeks to ensure that the rapid phase out of climate-polluting activities is just both in terms of process and outcome. The move away from peat extraction in midland counties has been a prominent focus of just transition initiatives in Ireland. As we move increasingly from the era of aspiration and targets to a focus on the nuts and bolts of climate policy implementation, the importance of just transition will only grow. This new phase in climate policy is increasingly bringing to the fore concerns around how different groups in society are affected by climate action measures. Making sure that the transformation of our economy and society is just and inclusive is crucial to maintaining societal support for the disruptive measures that will be needed to achieve national, EU and international climate goals. We need your consent to load this rte-player contentWe use rte-player to manage extra content that can set cookies on your device and collect data about your activity. Please review their details and accept them to load the content.Manage Preferences From RTÉ Radio 1's Drivetime, Pippa Hackett, Green Party Senator and Minister of State at the Department of Agriculture, Food and the Marine with special responsibility for Land Use and Biodiversity, on the EU Just Transition Fund A growing number of countries are paying increasing attention to the idea of a just transition through political and legal commitments. In Ireland, the Climate Action and Low Carbon Development (Amendment) Act of 2021 explicitly recognises the 'requirement for a just transition to a climate neutral economy’. In addition, the current Programme for Government committed to establish a Just Transition Commission on a statutory basis. A Just Transition Taskforce has been convened to develop proposals for the establishment of a Just Transition Commission, tasked with reporting by early 2024. The international experience The approaches adopted by other countries illustrate four key elements for effective governance of just transitions. First, a strong planning framework is important. International experience shows that this can be done in different ways. Scotland, for example, has integrated just transition planning into the existing climate action planning process. Spain, by contrast, has established a separate planning framework for just transition measures, called a Just Transition Strategy. We need your consent to load this rte-player contentWe use rte-player to manage extra content that can set cookies on your device and collect data about your activity. Please review their details and accept them to load the content.Manage Preferences From RTÉ Radio 1's Drivetime in 2020, Minister for the Environment, Climate and Communications Eamon Ryan on the Just Transition programme in the Midlands Ireland has already taken some steps in this direction. The 2021 Climate Action Plan set out a just transition framework consisting of four principles to underpin both processes and implementation of all climate action policies and measures. However, further integration is needed of just transition considerations into both mitigation and adaptation policy at national and local level. A second important element concerns how scientific and expert advice on just transition practices is incorporated into policymaking. Several jurisdictions have established independent institutions to conduct or commission studies on socioeconomic impacts of climate policies and to advise on best practice approaches to just transition. Scotland, for instance, has established a Just Transition Commission to fulfil these tasks, and a Just Transition Commission is to be established in Northern Ireland under the 2022 Climate Change Act. Third, broad public participation and active stakeholder engagement needs to be central to just transition policies, not least due to the place-based, politically complex and contested nature of just transition. Without a core focus on fair and inclusive policymaking, Ireland's climate transition is likely to face ever increasing resistance In both Scotland and Northern Ireland, the Just Transition Commissions are designed to facilitate stakeholder engagement by bringing together representatives from trade unions, civil society, business, youth groups, academia and key sectors of the economy, among others. Scotland’s Just Transition Commission has also been tasked with engaging specifically with those who are expected to be most impacted by the transition, to help inform the content of, and processes for, just transition policies. Finally, monitoring and accountability is crucial for effective governance of just transitions. In other jurisdictions, just transition commissions have been given a role in scrutinising the implementation of the government’s activities on just transition. This is a key element in ensuring that laudable aspirations set out in plans and commitments are actually implemented. Next steps for Ireland Drawing on these examples, a Just Transition Commission in Ireland could undertake several key tasks. In addition to providing advice to the government and facilitating stakeholder engagement, it could strengthen engagement with the public on climate and just transition policies. Furthermore, the Just Transition Commission could play a crucial role in monitoring and scrutinising implementation of government commitments. In order for the planned Just Transition Commission to live up to its potential, it is important that its mandate and working practices be aligned and integrated with existing climate governance practices, including annual policy planning, reporting and review mechanisms under the 2021 Climate Act. Without a core focus on fair and inclusive policymaking, Ireland’s climate transition is likely to face ever increasing resistance. Establishing a Just Transition Commission that draws on best international practice and placing it on a statutory footing will help to secure the continuation of its work over parliamentary periods. Doing so will give it a stronger ability to contribute to placing just transition at the centre of Ireland’s climate action policies over the medium term. Vilja Johansson is a doctoral researcher at the Center for Climate Change, Energy and Environmental Law at the University of Eastern Finland. Dr. Diarmuid Torney is an associate professor in the School of Law and Government and co-director of the Centre for Climate and Society at DCU. He is an Irish Research Council awardee. The views expressed here are those of the author and do not represent or reflect the views of RTÉ","filter_flag":1}
{"title":"Textiles 2030 announces second annual progress report - UKFT","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vdWtmdC5vcmcvdGV4dGlsZXMyMDMwLXNlY29uZC1wcm9ncmVzcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vdWtmdC5vcmcvdGV4dGlsZXMyMDMwLXNlY29uZC1wcm9ncmVzcy_SAQA?oc=5","id":"CBMiLmh0dHBzOi8vdWtmdC5vcmcvdGV4dGlsZXMyMDMwLXNlY29uZC1wcm9ncmVzcy_SAQA","guidislink":false,"published":"Tue, 14 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=318, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vdWtmdC5vcmcvdGV4dGlsZXMyMDMwLXNlY29uZC1wcm9ncmVzcy_SAQA?oc=5\" target=\"_blank\">Textiles 2030 announces second annual progress report<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">UKFT<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Textiles 2030 announces second annual progress report - UKFT","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vdWtmdC5vcmcvdGV4dGlsZXMyMDMwLXNlY29uZC1wcm9ncmVzcy_SAQA?oc=5\" target=\"_blank\">Textiles 2030 announces second annual progress report<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">UKFT<\/font>","source.href":"https:\/\/ukft.org","source.title":"UKFT","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Textiles 2030, the voluntary agreement for collaborative climate action in the UK fashion and textiles industry, has launched its second Annual Progress Update for 2022\/23. In the first two years, 130 businesses, representing over 62% of all clothing products placed on the UK market, have signed up to the agreement, which incorporates science-based targets to transition to a circular textiles economy leveraging the Textiles 2030 Footprint Tool and the Circularity Roadmap. Through the agreement, signatories have pledged ten-year targets of: 50% reduction in the overall carbon footprint of new textile products by 2030 30% reduction in the overall water footprint of new textile products by 2030 Industry collaboration to achieve the Textiles 2030 Circularity Roadmap ambitions However, the results from year two of Textiles 2030 paint a mixed picture. The collective carbon footprint has decreased by 2% in comparison to the baseline year of 2019 but the water footprint has increased by 8% due to the increased amount of cotton used. Cotton fibre production accounts for 84% of the total water footprint. There has also been a 13% increase in the volume of textile products placed on the market since 2019. Topline statistics 2022 2% decrease in collective carbon footprint 130 signatories representing over 62% of textiles placed on the UK market Improvement actions helped to reduce the carbon impact of textiles by 12% and water impact by 4% on a per tonne basis 8% increase in collective water footprint 84% of total water footprint came from cotton fibre production 44% of textiles produced had a lower environmental impact than conventional counterparts 13% increase in volume of textile products placed on the UK market 8% more textiles collected by reuse and recycling organisations Preloved sales equal to 9% of new products sold Read the full report here Reuse and recycling signatories The activities undertaken by reuse and recycling signatories in 2022 helped to reduce 1.1 million tonnes of carbon dioxide equivalent and 385 million cubic metres of water. These significant reductions are largely attributed to sales of recycled and reused products replacing sales of new products (displacement rate). Recent WRAP evidence has allowed an updated displacement rate to be used in year 2 of reporting. Project Re:claim scales up polyester recycling technology The Salvation Army Trading Company (SATCoL) has partnered with Project Plan B on a pioneering new polyester fibre-to-fibre recycling system under Project Re:claim, aimed at reducing textile waste. The installation of the first commercial-scale post-consumer polyester recycling technology at SATCoL’s textile processing centre in Kettering, Northamptonshire, has commenced and operations are due to begin in Autumn 2023. The new system is able to process end of life textiles and turn it into polyester pellets which can then be used to make polyester yarn. In its inaugural year, the machinery is projected to recycle approximately 2,500 tonnes of textiles, with expectations to scale up to 5,000 tonnes in year two. Textiles 2030 Annual Progress Report 2022\/23 Discover more findings and highlights from the report here.","filter_flag":1}
{"title":"CASE Construction Equipment to Introduce 6 new products at EXCON 2023 - Autocar Professional","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9jYXNlLWNvbnN0cnVjdGlvbi1lcXVpcG1lbnQtdG8taW50cm9kdWNlLTYtbmV3LXByb2R1Y3RzLWF0LWV4Y29uLTIwMjMtMTE3ODUz0gFxaHR0cHM6Ly93d3cuYXV0b2NhcnByby5pbi9uZXdzL2Nhc2UtY29uc3RydWN0aW9uLWVxdWlwbWVudC10by1pbnRyb2R1Y2UtNi1uZXctcHJvZHVjdHMtYXQtZXhjb24tMjAyMy0xMTc4NTM_YW1wPTE?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9jYXNlLWNvbnN0cnVjdGlvbi1lcXVpcG1lbnQtdG8taW50cm9kdWNlLTYtbmV3LXByb2R1Y3RzLWF0LWV4Y29uLTIwMjMtMTE3ODUz0gFxaHR0cHM6Ly93d3cuYXV0b2NhcnByby5pbi9uZXdzL2Nhc2UtY29uc3RydWN0aW9uLWVxdWlwbWVudC10by1pbnRyb2R1Y2UtNi1uZXctcHJvZHVjdHMtYXQtZXhjb24tMjAyMy0xMTc4NTM_YW1wPTE?oc=5","id":"CBMia2h0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9jYXNlLWNvbnN0cnVjdGlvbi1lcXVpcG1lbnQtdG8taW50cm9kdWNlLTYtbmV3LXByb2R1Y3RzLWF0LWV4Y29uLTIwMjMtMTE3ODUz0gFxaHR0cHM6Ly93d3cuYXV0b2NhcnByby5pbi9uZXdzL2Nhc2UtY29uc3RydWN0aW9uLWVxdWlwbWVudC10by1pbnRyb2R1Y2UtNi1uZXctcHJvZHVjdHMtYXQtZXhjb24tMjAyMy0xMTc4NTM_YW1wPTE","guidislink":false,"published":"Mon, 20 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=20, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=324, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9jYXNlLWNvbnN0cnVjdGlvbi1lcXVpcG1lbnQtdG8taW50cm9kdWNlLTYtbmV3LXByb2R1Y3RzLWF0LWV4Y29uLTIwMjMtMTE3ODUz0gFxaHR0cHM6Ly93d3cuYXV0b2NhcnByby5pbi9uZXdzL2Nhc2UtY29uc3RydWN0aW9uLWVxdWlwbWVudC10by1pbnRyb2R1Y2UtNi1uZXctcHJvZHVjdHMtYXQtZXhjb24tMjAyMy0xMTc4NTM_YW1wPTE?oc=5\" target=\"_blank\">CASE Construction Equipment to Introduce 6 new products at EXCON 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Autocar Professional<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CASE Construction Equipment to Introduce 6 new products at EXCON 2023 - Autocar Professional","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9jYXNlLWNvbnN0cnVjdGlvbi1lcXVpcG1lbnQtdG8taW50cm9kdWNlLTYtbmV3LXByb2R1Y3RzLWF0LWV4Y29uLTIwMjMtMTE3ODUz0gFxaHR0cHM6Ly93d3cuYXV0b2NhcnByby5pbi9uZXdzL2Nhc2UtY29uc3RydWN0aW9uLWVxdWlwbWVudC10by1pbnRyb2R1Y2UtNi1uZXctcHJvZHVjdHMtYXQtZXhjb24tMjAyMy0xMTc4NTM_YW1wPTE?oc=5\" target=\"_blank\">CASE Construction Equipment to Introduce 6 new products at EXCON 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Autocar Professional<\/font>","source.href":"https:\/\/www.autocarpro.in","source.title":"Autocar Professional","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"the company plans to unveil machines compliant with the new BS V (CEV\/TREM) emission standards ahead of its official industry transition time. CASE Construction Equipment, a brand of CNH Industrial, will be entering two new categories in the domestic construction equipment market with the launch of six new products at the Excon-2023, a trade fair, which is scheduled to be held in Bengaluru between December 12 and 16. Shalabh Chaturvedi, Managing Director, CASE Construction Equipment—India and SAARC Region, said, “It is an exciting time for India as infrastructure development in the country is at its peak and is currently creating various opportunities for the sector. With our existing and new products in the portfolio, including the introduction of new machines, we look forward to cementing our position as a global legacy brand offering technologically advanced products with world-class quality.” The company, in a statement, said that with a focus on innovation and technology, CASE will be showcasing ten made-in-India products that are manufactured for domestic as well as global markets. Furthermore, the company plans to unveil machines compliant with the new BS V (CEV\/TREM) emission standards ahead of its official industry transition time. Alongside these product launches, CASE will also introduce a comprehensive platform under CNH Industrial, offering accessories and genuine parts. CASE has been present in India since 1989 and boasts of being a market leader in the vibratory compactor segment and a leading player in the backhoe loader segment. With its manufacturing facility in Pithampur, Madhya Pradesh, the company also exports to over 105 export markets in addition to meeting the needs of its domestic market.","filter_flag":1}
{"title":"Agri-food systems helping to foster a cleaner, greener future - Irish Examiner","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vd3d3LmlyaXNoZXhhbWluZXIuY29tL2Zhcm1pbmcvYXJpZC00MTI3MDkwMi5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vd3d3LmlyaXNoZXhhbWluZXIuY29tL2Zhcm1pbmcvYXJpZC00MTI3MDkwMi5odG1s0gEA?oc=5","id":"CBMiOGh0dHBzOi8vd3d3LmlyaXNoZXhhbWluZXIuY29tL2Zhcm1pbmcvYXJpZC00MTI3MDkwMi5odG1s0gEA","guidislink":false,"published":"Thu, 16 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=16, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=320, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vd3d3LmlyaXNoZXhhbWluZXIuY29tL2Zhcm1pbmcvYXJpZC00MTI3MDkwMi5odG1s0gEA?oc=5\" target=\"_blank\">Agri-food systems helping to foster a cleaner, greener future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Irish Examiner<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Agri-food systems helping to foster a cleaner, greener future - Irish Examiner","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vd3d3LmlyaXNoZXhhbWluZXIuY29tL2Zhcm1pbmcvYXJpZC00MTI3MDkwMi5odG1s0gEA?oc=5\" target=\"_blank\">Agri-food systems helping to foster a cleaner, greener future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Irish Examiner<\/font>","source.href":"https:\/\/www.irishexaminer.com","source.title":"Irish Examiner","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Imagine a world free of hunger and extreme poverty, a world where social justice thrives alongside a healthy, natural environment. That’s the ethos behind the 2030 Agenda for Sustainable Development — a plan of action for people, planet and prosperity. Sustainable agrifood systems lie at the heart of the 2030 Agenda. They combine economic growth with social improvements and environmental protection to address many global challenges. Agrifood systems transformations contribute to all 17 Sustainable Development Goals (SDGs) of the 2030 Agenda and are deemed fundamental for their ultimate achievement by the Food and Agriculture Organization (FAO) of the United Nations. Delivering more food with less and cleaner energy and providing small-scale producers with access to innovative technologies, are essential elements of sustainable agrifood systems. So says the FAO, which has also made it clear that pursuing food systems transformations has never been more critical than it is today. It also makes clear that action towards more sustainable agrifood systems is a fundamental prerequisite to putting the world back on course to achieve the 2030 Agenda. In Ireland, we are guided by the Food Vision 2030 Strategy for the Irish agri-food sector. Its vision is that Ireland will, over a ten-year period, become a world leader in Sustainable Food Systems (SFS). The Strategy consists of 22 goals, grouped into four missions. One of those is a climate-smart, environmentally sustainable, agri-food sector. Another is an innovative, competitive and resilient agri-food sector driven by technology and talent. According to UN data, in 2020, two billion people lacked safely managed drinking water, and 771 million of those were without basic drinking water. These facts are difficult to contemplate. Sustainable food systems can ensure the maintainable use of this precious resource and increase access for those who do not have drinking water, while also reducing the amount of pollution in our natural water systems. In 2020, 45.4 million children under five were affected by wasting. This is a devastating fact. It is the UN’s stance that sustainable food systems will support adequate nutrition, to help people of all ages to achieve good health. At the Teagasc\/Bord Bia Conference on Science, Consumers and Irish Food in Ashtown, Dublin with Minister of State at the Department of Agriculture, Food and the Marine, Martin Heydon TD were Prof Tim Benton, Chatham House, UK; Prof Frank O’Mara, Director Teagasc; Nick Curtis-Davis, director of global strategic insight, Bord Bia; Maeve Henchion, head of Department of Agrifood Business and Spatial Analysis, Teagasc and Jim O’Toole, CEO, Bord Bia. Closer to home, the recent Teagasc\/Bord Bia Conference on Science, Consumers and Irish Food, was a forum for lively discussion on the role of science and technology, and consumer and market insights, as part of a sustainable food system. More than 100 food companies, scientists, agencies and policymakers. It was announced at the Conference, that Food Vision 2030, Ireland’s agri-food strategy, foresees an innovative, competitive and resilient agri-food sector, driven by technology and talent as an enabling mission in fulfilling its ambition for Ireland to be a world leader in sustainable food systems. The dynamic environment facing food companies was also highlighted, as were evolving consumer and market developments and advances in science and technology. The point was made, that together they offer opportunities to enhance the Irish food system. Mention was also made of the research being carried out in Ireland and Europe to facilitate the production of plant-based protein. Interestingly, Teagasc’s Dr Linda Giblin pointed out that an environmentally sustainable food system may not necessarily deliver healthier foods. At the Conference, a Teagasc spokesperson spoke of the development of AgNav, the digital platform developed by Teagasc, Bord Bia and ICBF, which will encourage and support farmers in implementing practices that have been proven to improve sustainability of Irish farming systems. Dr Linda Giblin, Teagasc, notes that an environmentally sustainable food system may not necessarily deliver healthier foods. From all sides, and around the clock, all of us are being inundated with the message that the planet’s energy and food systems must be transformed is being heard, and much needs to be done. Understandably perhaps, that message regularly gets drowned out when other pressing and often distressing news events command the news feeds. That said, the importance and the urgency of the message doesn’t diminish and there’s no dearth of information available online, with the digital pages of Knowledge4Policy, the European Union’s official website, being a particularly good source. The reasons why energy and food system transformations must take place are made abundantly clear on this website. The 2030 Agenda must be complied with. The terms of the Paris Agreement on Climate Change must be met. Also, the reason with which most of us will be familiar: the necessity to meet growing demand. Worldwide, energy consumption in agri-food systems is on the increase, growing by more than 20% between 2000 and 2018. The link between energy and food systems is apparent when we consider that agri-food systems consume almost one-third of the world’s energy, while one-third of agri-food systems' greenhouse gas emissions stem from energy use. The European Commission is working to make the EU agri-food industry greener, more digital and resilient. It follows the publication of an analysis of EU policies that support the ‘greening’ of the agri-food sector, with greater use of digital technology. According to a ‘sustainable agrifood systems for a post-growth world’ study, published last year in the Nature Sustainability Journal, sustainable agri-food systems are critical to averting climate-driven social and ecological disasters, to overcoming the growth paradigm and to redefining the interactions of humanity and nature in the twenty-first century. The study points out that global agrifood systems — contemporary knowledge, institutions, infrastructures, practices and crops that define the predominant patterns of food production and consumption — are major forces of climate change, ecological degradation and rural decline. The authors say that tackling these challenges requires the reimagination and re-creation of circuits of food production, processing, distribution, consumption and governance on the basis of humankind’s best experience in agriculture, as an immediate source of community well-being and fundamental field of interaction with nature. They make clear that we do not have the luxury of ignoring viable, successful options when it comes to agri-food system sustainability. Wisely, they assert that we must question the reliance on economic growth as the dominant paradigm. In this paper, researchers are urged to seek solutions to take sustainability challenges seriously, ‘by overcoming ideological blindness’ to the profound practical and theoretical meaning of already existing agrifood system solutions. The authors argue that while there might be strong positions held for or against certain types of solutions, the challenges of sustainability in general — and agri-food systems sustainability in particular — are so complex and urgent, that all types of solutions with real potential for post-growth transformation are needed. They conclude by stressing that efforts made must not perpetuate discourses of delay and should go beyond Sustainable Development Goals. Here in this country, Origin Green, Ireland’s food and drink sustainability programme led by Bord Bia, has made substantial progress in driving sustainability improvements in the agri-food sector. The programme was established over 11 years ago and today, Bord Bia works with 58,000 Irish farmers and over 330 Irish food and drink companies to measure and improve sustainability across the supply chain. Read More World needs to cut carbon intensity seven times faster to limit warming to 1.5°C According to Bord Bia’s Deirdre Ryan: \"Over 800 farm audits take place every week, with sustainability criteria being measured including greenhouse gas (GHG) emissions, biodiversity, water measures, energy efficiency, soil management and socio-economic factors. To date, Bord Bia has conducted over 355,000 carbon footprint assessments on Irish farms and uses this information to help drive change and improvements at farm level.” Ryan says that Origin Green aligns with national climate plans and targets, including Ireland’s Climate Action Plan, the Low Carbon Development Bill and EU policies such as the Farm to Fork strategy. She says that Bord Bia also shares the ambition, optimism and values expressed in Food Vision 2030 and that it recognises that collaboration, both nationally and internationally, is key to delivering on the new level of ambition required by industry. Deirdre said: “In its first decade, Origin Green has provided a unique infrastructure through which we can measure and guide the improvement of the agri-food industry’s sustainability performance at a national level. “As we embrace the next set of challenges we will build on that success through a collaborative approach that matches knowledge with ambition, to support the industry and meet the national agricultural targets set out in the Climate Action Plan and in international commitments.”","filter_flag":1}
{"title":"Cork lecturer features in new TV series on climate change - EchoLive.ie","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vd3d3LmVjaG9saXZlLmllL3dvdy9hcmlkLTQxMjY5MDcyLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vd3d3LmVjaG9saXZlLmllL3dvdy9hcmlkLTQxMjY5MDcyLmh0bWzSAQA?oc=5","id":"CBMiLmh0dHBzOi8vd3d3LmVjaG9saXZlLmllL3dvdy9hcmlkLTQxMjY5MDcyLmh0bWzSAQA","guidislink":false,"published":"Tue, 14 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=318, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vd3d3LmVjaG9saXZlLmllL3dvdy9hcmlkLTQxMjY5MDcyLmh0bWzSAQA?oc=5\" target=\"_blank\">Cork lecturer features in new TV series on climate change<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EchoLive.ie<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Cork lecturer features in new TV series on climate change - EchoLive.ie","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vd3d3LmVjaG9saXZlLmllL3dvdy9hcmlkLTQxMjY5MDcyLmh0bWzSAQA?oc=5\" target=\"_blank\">Cork lecturer features in new TV series on climate change<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EchoLive.ie<\/font>","source.href":"https:\/\/www.echolive.ie","source.title":"EchoLive.ie","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"A UCC lecturer is putting the spotlight on climate change in a new RTÉ series, and she says we all have an important role to play in the global battle, even if it’s just remembering to switch off a light when leaving a room. Michelle McKeown is one of three presenters of Heated, which over six weeks is sharing inspirational stories about practical, informative or inspirational aspects of climate action. Michelle, a lecturer in environmental geography in the Department of Geography in UCC, said she ‘jumped at the opportunity’ to be part of the series. “I like that the series places a strong emphasis around fostering optimism on the issue of climate change. The scale and complexity of climate change can seem overwhelming. There are Irish individuals, businesses and communities striving to pioneer a genuinely sustainable future. \"The series gives them a platform to tell their stories,” said the Louth woman. Hannah Quinn Mulligan, Rónán Ó Dálaigh and Michelle McKeown, co-presenters of new series, Heated. Picture; Damien Eagers Michelle has been lecturing in UCC for over two years, and in a previous position saw the impact of climate change first hand. After completing a PhD focusing on climate change, she moved to Fiji in 2014. “I worked as a lecturer in the University of the South Pacific for three years and loved every minute of it. It was probably the best experience of my life; I taught students from small island nations that are at the front-line of climate change impacts. I’ve often spoken about countries feeling the full weight of a warming world but seeing the effects first hand was an eye opener. “I was in Fiji when tropical cyclone Winston hit in 2016 (the second strongest hurricane ever recorded), and the devastation it had on the community was heart- breaking. Yet, people living on these beautiful islands remained optimistic. “They take steps every day to safeguard their islands, and I was blown away by the level of climate action.” Michelle later moved to New Zealand after three years, where she spent time studying the country’s peatlands before returning to Ireland. Despite her credentials and expertise, she admits that, like so many others, she’s not immune to feeling overwhelmed when faced with the big question: what can I do to help address climate change? “Particularly when I’m updating my lectures and have to replace the carbon dioxide measurements with higher values every year. It’s sometimes hard to believe that my individual action will have any positive impact. \"But that’s only on my off days. Michelle McKeown, who is one of the presenters on Heated. Picture credit; Damien Eagers “I really think that we can make subtle changes in our daily lives that can collectively make a big difference.” Having said that, she feels that our policy-makers could do more to mitigate climate change: “Our policies need to be more ambitious with clear road maps for action.” Some relatively easy-to-adopt climate friendly habits she suggests include buying local. “Purchasing locally sourced products means that they haven’t travelled long distances to reach you. This reduces carbon emissions associated with transportation. You also have the added benefit of supporting Irish businesses to help build a more resilient economy. “Also, conserve energy. Simply turning off lights when not in use, using energy-efficient appliances, and sealing drafts in your home can also help reduce energy bills. “Finally, reduce consumption and make more mindful purchases. “Everything we buy has a carbon footprint, and a water footprint. By buying fewer products and being more selective in your purchases, you can reduce your personal carbon footprint. I say this as someone that falls short of this sometimes (with probably too many shoes). I’m trying to be more mindful. For those that can afford them, electric cars and solar panels are a good investment, she advises. “I don’t own an electric car but I would love one. They are an expensive purchase and not everyone can afford them. I feel this is an area where progress could be made to subsidise them. Michelle McKeown, who is one of the presenters on Heated. Picture credit; Damien Eagers “Also, solar panels. The technology is improving and is only going to get better! Most energy-efficient products are more expensive, and I feel that this is a miss. In Fiji, the government subsidised hybrid cars, they were more affordable, and more were on the road.” Of particular concern to her, are the closely interconnected issues of climate change and water quantity and quality. “In Ireland, climate research suggest that we’re going to have more summer droughts and more high intensity rainfall events in winter. There needs to be investment in infrastructure and nature-based solutions to ensure that we can cope with high levels of rainfall, along with coping with warmer shortages. “Globally, we are going to see more water scarcity due to climate change, and this will likely lead to the displacement of communities and even conflict over water. This could have broader implications for regional stability and security,” she says. Michelle said she learned a lot from filming the show with co-presenters Hannah Quinn Mulligan and Rónán Ó Dálaigh. “For example, I had no idea neoprene in wetsuits was difficult to recycle and that they weren’t sustainable. I also wasn’t aware that there was a GAA Green Clubs Programme.” The segments are concise so you can get a lot of information in a short space of time! “Ultimately, Heated seeks out inspirational stories of ordinary people making significant differences in their communities. These may seem tiny on a global scale, but if more people follow their example, together they can make a big difference. Facing into the festive frenzy, what’s her advice? “Buy local is my top tip, if you can buy something that’s sustainably produced or upcycled, even better.” Heated is on RTÉ One on Thursdays at 8pm.","filter_flag":1}
{"title":"What is Bioeconomy and Why is it Important? - Ground Report","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vZ3JvdW5kcmVwb3J0LmluL3doYXQtaXMtYmlvZWNvbm9teS1hbmQtd2h5LWlzLWl0LWltcG9ydGFudC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vZ3JvdW5kcmVwb3J0LmluL3doYXQtaXMtYmlvZWNvbm9teS1hbmQtd2h5LWlzLWl0LWltcG9ydGFudC_SAQA?oc=5","id":"CBMiQ2h0dHBzOi8vZ3JvdW5kcmVwb3J0LmluL3doYXQtaXMtYmlvZWNvbm9teS1hbmQtd2h5LWlzLWl0LWltcG9ydGFudC_SAQA","guidislink":false,"published":"Thu, 16 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=16, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=320, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vZ3JvdW5kcmVwb3J0LmluL3doYXQtaXMtYmlvZWNvbm9teS1hbmQtd2h5LWlzLWl0LWltcG9ydGFudC_SAQA?oc=5\" target=\"_blank\">What is Bioeconomy and Why is it Important?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Ground Report<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"What is Bioeconomy and Why is it Important? - Ground Report","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vZ3JvdW5kcmVwb3J0LmluL3doYXQtaXMtYmlvZWNvbm9teS1hbmQtd2h5LWlzLWl0LWltcG9ydGFudC_SAQA?oc=5\" target=\"_blank\">What is Bioeconomy and Why is it Important?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Ground Report<\/font>","source.href":"https:\/\/groundreport.in","source.title":"Ground Report","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Climate change threatens our world, making the drive towards a more environmentally friendly economy not just an option, but an obligation. Achieving sustainable development involves focusing on bioeconomy, which according to the FAO, involves the knowledge-based production and usage of biological resources, processes, and methods to offer goods and services sustainably across all economic sectors. This becomes essential for our future. The term \"bioeconomy\" has emerged as a key player in shaping the future of industry, agriculture, and environmental stewardship. But what exactly does bioeconomy entail, and why is it gaining increasing importance on the global stage? What is Bioeconomy The bioeconomy refers to the part of the economy that uses renewable biological resources from land and sea, such as crops, forests, fish, animals, and microorganisms, to produce food, health, materials, products, textiles, and energy. It involves the use of biotechnology and biomass in the production of goods, services, or energy. The bioeconomy is crosscutting, encompassing multiple sectors, in whole or in part, including agriculture, textiles, chemicals, and energy. An important aspect of the bioeconomy is understanding mechanisms and processes at the genetic, molecular, and genomic levels, and applying this understanding to create or improve industrial processes, develop new products and services, and produce new energy. Why is Bioeconomy Important? The bioeconomy is becoming increasingly important globally for several reasons: Sustainable Development: The bioeconomy proposes a sustainable and circular model that is key in the fight against climate change. It aims to reduce our dependence on fossil natural resources, prevent biodiversity loss, and create new economic growth and jobs in line with the principles of sustainable development. Economic Growth: Bioeconomy has enormous potential for creating millions of green jobs in rural and coastal regions, renewing and modernizing industrial fabrics, introducing innovations in agriculture, aquaculture, forestry, and other industries. Food Security: Bioeconomy can play a crucial role in ensuring food security and reducing hydric stress. With the world’s population expected to reach 9.7 billion by 2050, the demand for food will increase significantly. The bioeconomy can help meet this demand sustainably. Energy Production: Bioeconomy can help reduce dependence on fossil fuels and promote renewable energies. Biomass, a renewable biological resource, can be used to produce bioenergy, which can serve as an alternative to fossil fuels. Climate Change Mitigation: The bioeconomy can play a key role in the fight against climate change. By promoting the use of renewable biological resources and reducing dependence on fossil fuels, the bioeconomy can help reduce greenhouse gas emissions. 2030 Agenda and SDGs A 2023 Sustainability paper proposes a research method to assess biodiversity value chains using ecological, economic, and social indicators. Using interviews with local Amazonian actors involved with the pirarucu fish species, the authors aim to understand its value chain dynamics and local community effects. The 2030 Agenda, adopted by the United Nations in 2015, includes 17 Sustainable Development Goals (SDGs) that can greatly benefit from the implementation of the bioeconomy. According to a study by the Food and Agriculture Organization (FAO), the bioeconomy intersects with the SDGs in four key areas: Poverty Alleviation, Food Security, and Equality: The bioeconomy can play a significant role in ending poverty, achieving zero hunger, and reducing inequalities. Clean Water, Sustainable Cities, and Responsible Consumption: The bioeconomy is closely linked to the goals of clean water and sanitation, sustainable cities and communities, and responsible consumption and production. Sustainable Industry, Infrastructure, and Economic Growth: The bioeconomy can drive the development of sustainable industry and infrastructure, promote economic growth, and create decent work opportunities. Health, Climate Action, and Ecosystem Preservation: The bioeconomy can contribute to health and well-being, climate action, and the preservation of underwater and terrestrial ecosystems. Keep Reading Follow Ground Report for Climate Change and Under-Reported issues in India. Connect with us on Facebook, Twitter, Koo App, Instagram, Whatsapp and YouTube. Write us on [email protected].","filter_flag":1}
