{"title":"Label release liners containing PCR content and unbleached fibres revealed by Ahlstrom - Packaging Europe","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3BhY2thZ2luZ2V1cm9wZS5jb20vbmV3cy9sYWJlbC1yZWxlYXNlLWxpbmVycy1jb250YWluaW5nLXBjci1jb250ZW50LWFuZC11bmJsZWFjaGVkLWZpYnJlcy1yZXZlYWxlZC1ieS1haGxzdHJvbS8xMDI1Ni5hcnRpY2xl0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3BhY2thZ2luZ2V1cm9wZS5jb20vbmV3cy9sYWJlbC1yZWxlYXNlLWxpbmVycy1jb250YWluaW5nLXBjci1jb250ZW50LWFuZC11bmJsZWFjaGVkLWZpYnJlcy1yZXZlYWxlZC1ieS1haGxzdHJvbS8xMDI1Ni5hcnRpY2xl0gEA?oc=5","id":"CBMihQFodHRwczovL3BhY2thZ2luZ2V1cm9wZS5jb20vbmV3cy9sYWJlbC1yZWxlYXNlLWxpbmVycy1jb250YWluaW5nLXBjci1jb250ZW50LWFuZC11bmJsZWFjaGVkLWZpYnJlcy1yZXZlYWxlZC1ieS1haGxzdHJvbS8xMDI1Ni5hcnRpY2xl0gEA","guidislink":false,"published":"Thu, 31 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=243, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3BhY2thZ2luZ2V1cm9wZS5jb20vbmV3cy9sYWJlbC1yZWxlYXNlLWxpbmVycy1jb250YWluaW5nLXBjci1jb250ZW50LWFuZC11bmJsZWFjaGVkLWZpYnJlcy1yZXZlYWxlZC1ieS1haGxzdHJvbS8xMDI1Ni5hcnRpY2xl0gEA?oc=5\" target=\"_blank\">Label release liners containing PCR content and unbleached fibres revealed by Ahlstrom<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Europe<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Label release liners containing PCR content and unbleached fibres revealed by Ahlstrom - Packaging Europe","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3BhY2thZ2luZ2V1cm9wZS5jb20vbmV3cy9sYWJlbC1yZWxlYXNlLWxpbmVycy1jb250YWluaW5nLXBjci1jb250ZW50LWFuZC11bmJsZWFjaGVkLWZpYnJlcy1yZXZlYWxlZC1ieS1haGxzdHJvbS8xMDI1Ni5hcnRpY2xl0gEA?oc=5\" target=\"_blank\">Label release liners containing PCR content and unbleached fibres revealed by Ahlstrom<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Europe<\/font>","source.href":"https:\/\/packagingeurope.com","source.title":"Packaging Europe","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Footprint Reduction\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Ahlstrom is extending its Acti-V range of high-performance release liners with new products containing recycled and unbleached fibre content, intended for Pressure Sensitive Adhesive (PSA) laminates and labels. In general, release papers are said to facilitate the efficient printing, cutting, and application of PSA labels – thus reducing product waste, increasing product safely, and helping goods move reliably and efficiently through the distribution process. Those created with Acti-V technology reportedly enable potential reductions in energy, catalyst, and silicone consumption through a ‘highly efficient’ silicone coating and converting process. Acti-V RF Yellow is a supercalendered release paper said to contain at least 15% post-consumer recycled fibre. It is designed to resemble the typical light-yellow colour of paper liners that carry most PSA paper labels in Europe. Meanwhile, Acti-V RF Natural is a light creamy colour that naturally results from the incorporation of post-consumer recycled fibre and both bleached and unbleached cellulose fibres. According to Ahlstrom, it does not use any dye and is based on components estimated to allow a carbon footprint reduction of at least 15% compared to the Acti-V Yellow liner. By replacing a portion of virgin fibres with recyclate, Ahlstrom hopes to support the industry in adopting renewable, bio-based materials and provide sustainability-minded options for laminators, label printers, and end-users. Last year, UPM Raflatac sought to process PET liner waste collected through its recycling service into a raw material, which was then used by Finnfoam to produce insulation. Fedrigoni Self Adhesives has also developed its Re-Play product line, which aims to upcycle the discarded glassine backing of other self-adhesive products into a new premium labelling solution. If you liked this article, you might also enjoy: The Lidl approach to packaging sustainability How did Brazil achieve its 100% aluminium can recycling rate – and can it be replicated in the EU? Experts have their say on the EU’s Packaging and Packaging Waste Directive revisions A deep dive into the most important packaging sustainability trends and solutions","filter_flag":1}
{"title":"Labelexpo Europe 2023 technology preview: A-Z - Labels and Labeling","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL2V1cm9wZS9uZXdzL2Fzc29jaWF0aW9ucy1hbmQtZXZlbnRzL2xhYmVsZXhwby1ldXJvcGUtMjAyMy10ZWNobm9sb2d5LXByZXZpZXctetIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL2V1cm9wZS9uZXdzL2Fzc29jaWF0aW9ucy1hbmQtZXZlbnRzL2xhYmVsZXhwby1ldXJvcGUtMjAyMy10ZWNobm9sb2d5LXByZXZpZXctetIBAA?oc=5","id":"CBMib2h0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL2V1cm9wZS9uZXdzL2Fzc29jaWF0aW9ucy1hbmQtZXZlbnRzL2xhYmVsZXhwby1ldXJvcGUtMjAyMy10ZWNobm9sb2d5LXByZXZpZXctetIBAA","guidislink":false,"published":"Wed, 23 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=235, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL2V1cm9wZS9uZXdzL2Fzc29jaWF0aW9ucy1hbmQtZXZlbnRzL2xhYmVsZXhwby1ldXJvcGUtMjAyMy10ZWNobm9sb2d5LXByZXZpZXctetIBAA?oc=5\" target=\"_blank\">Labelexpo Europe 2023 technology preview: A-Z<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Labels and Labeling<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Labelexpo Europe 2023 technology preview: A-Z - Labels and Labeling","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL2V1cm9wZS9uZXdzL2Fzc29jaWF0aW9ucy1hbmQtZXZlbnRzL2xhYmVsZXhwby1ldXJvcGUtMjAyMy10ZWNobm9sb2d5LXByZXZpZXctetIBAA?oc=5\" target=\"_blank\">Labelexpo Europe 2023 technology preview: A-Z<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Labels and Labeling<\/font>","source.href":"http:\/\/www.labelsandlabeling.com","source.title":"Labels and Labeling","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Footprint Reduction\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"A B Graphic International (ABG) | Abezeta Group | Accraply | Acme RollTech | Actega | Afford Inks | Agergaard Graphic Supplies | Ahlstrom | Alphasonics | Aluminum Féron | Amica Systems | Anytron | Apex International | Applied Laser Engineering | Armor-Iimak | Array Graphics\/norwix | Arrow Systems | Asahi Photoproducts | Ashe | AkeBoose | AtéCé Graphic Products | Avery Dennison | AV Flexologic | Axicon Auto ID | Bar Graphic Machinery | Baltink | Baldwin | bel | Benford UV | Berhalter | Beontag | Bio4Life | Bixolon | Bobst | Busitel | Brotech | BST | Calor | Cartes | Cellopack | Cerm | Cheshire Anilox Technology | Clean Solutions Group | ColorConsulting | Comexi | ContiTech | Daco Solutions | Daetwyler SwissTec | Dantex Group | Darui China | DCM Usimeca | DecoSystem | delfort | Delta ModTech | DG press | Dilli | DNP | Domino | Dongguan Xincai Packaging Materials | Dow | DPR | Drop AG | DuPont Teijin Films | Durico | Durst Group | Eclipse Label Equipment | ECO3 | Ecosystem Costruzioni | Elkem | Emmendinger Maschinenbau (EMB) | Epson | eProducitvity Software | Errepi | Erhardt+Leimer | Esko | Etirama | Eukalin Special-Adhesives | Evonik | EyeC | FAG Graphic Systems | Fedrigoni Self-Adhesives | FLEXcon Global | Flexo Wash | Focus Label Machinery | Fortisblades | Gallus | GEW | GIC | Gietz | Golden Laser | GSE | Grafisk Maskinfabrik (GM) | Grafotronic | Graphic Republik |GTI Graphic Technology | Guangdong Youhua New Material Technology | Hangma Paper Products | Hamillroad Software | HB Fuller | Henan Yinjinda New Materials | Henkel | Hermans | Heaford | Hangzhou Cron Machinery & Electronics | HCI Converting Equipment | Height-LED | HP Indigo | Hönle | Hololens | Holostik | Hontec | HPRT | Hybrid Software Group | Ibeslab | Infigo | Inglese | Innovia Films | International Graphic Films Europe NV | INX International | IST Metz | Italstick | Itasa | Jalema | Jetron | Jiangxi Tianyin Paper Co | Jiangmen Hengyuan Label Technology Co | Jiaxing Huayi Imp and Exp Co | Jindal SMI | Jurmet | Karlville Converting | Karlville Swiss | Klöckner Pentaplast | Kocher + Beck | Konica Minolta | Kurz| Labeltech | Label Traxx | Lartec | Laserclean | Lehmer | Lake Image Systems | Lemmaco | LemuGroup | Lenze | Leonardus SRL | Lintec Europe | Lombardi | Luminochem | Lundberg | Luster | Maan Engineering | Mark Andy | Martin Automatic | Matho | Maxcess | Melzer | Michelman | Meech | Ministone | Miyakoshi | MoistTech Corp | Monotech Systems | MPS | Mühlbauer | Nanovis | Nazdar Ink Technologies | Nikka Research | Nepata Systems | Nilpeter | Norwix Inc | Omet | OneVision | Optimus | Pantec | Polar | Polyart Group | Postek | Prati | Printmark Group | Priber | PrintCity Alliance | Premier Coating & Converters | Print Systems | PrintsPaul | Prisma | QSPAC Industries | Radior | Ravenwood | RK PrintCoat Instruments | Renova | Re SpA | Rheintacho | Rhyguan | Roosen BPL | Rosas Maschinenbau | Rotary Technology (Guangzhou) | Rotary Sp. z o.o. | Rotocontrol EMT | Sandon Global | Sappi Europe | Schobertechnologies | Screen | Seal King | SEI Laser | Sermar Machines | Shree Lamipack | Shenzhen Dicheng | Shenzhen Lamplic Science Co | Shenzhen Puty Technology Co | Shosky Security | Sibress | Siegwerk | Siemens | Sihl | Siltech | Sirpi | Sistrade | SQ Label | Stahl | Starfoil Technology | Sun Chemical | Synthogra | Taghleef Industries | TEG Technologies | Tresu | Troika Systems | Teknova | Teknek | Tecnocut | Tootech | T-Trade | Toyo Ink | Toyobo | TSC Printronix | Unilux | Univacco | UPM Raflatac | Uteco | UV One | UV Ray | Vellerino | Valco Melton | Valloy | VIPColor | Vicut | Voyantic | Wampolet Hi-Tech Co | WHEC | Xeikon | X-Rite Pantone | XSYS | YG Group | YuanMingJie Technology | Zeller+Gmelin | Zhejiang Fulai New Materials | Zhejiang TNME A B Graphic International (ABG) unveils its automation technology ABG Connect, an automated workflow system that connects all stages of the print and finishing process into one automated workflow. New products include advances in non-stop winding technology and a new turret rewinder model. ABG will also introduce the Converter, a compact, fully modular high-speed converting line incorporating an automated flexo coating station. ABG will collaborate with HP on stand P100 to demonstrate its non-stop unwind and rewind system seamlessly integrated into the HP Indigo V12 line. Abezeta Group shows the Strong State SF-DFT hard durometer digital flexo plate featuring Strong’s built-in flat-top dot technology. It offers the convenience of flat-top dots with no additional platemaking steps or equipment required. SF-DFT offers near 1:1 mask-to-plate imaging capability, thus eliminating the need for a bump curve, which helps printers to expand the available color gamut and print a smaller dot. Accraply introduces its Accraply Revolve line of modular shrink sleeve seamers, configured to make shrink sleeve seaming simpler and more efficient. Acme RollTech shows its latest ACE (Advanced Channel Engravings) engraving technology along with ATAC - Acme Tactile for screen-type raise effects, AHDW - Acme High-Density White for opaque white printing for solids and text. Actega presents its latest inks, coatings and adhesives as well as its Ecoleaf technology, a sustainable alternative to traditional metallic decoration. Actega’s range of haptic and visual effect coatings offer soft touch, matte and raised image effects. Actega will also focus on its white and metallic inks. Afford Inks showcases its LED UV narrow web flexo inks, aiming to attract interest from end users, machine integrators, distribution partners and OEM clients. Agergaard Graphic Supplies showcases high-performance end seals and doctor blades. The coatSeal Flexi 3D end seal series is made to withstand abrasive and viscous UV inks and achieves reliable sealing results with an improved rotational contact area between the anilox roller and end seal. The coatSeal Universal molded rubber seals offer sealing for all ink types and coatings, including white and metallics. The low-wear steel and plastic doctor blades steelBlade and polyBlade are designed for high-quality label and packaging printing. Ahlstrom showcases its range of silicone coated release papers. The company will also present new products with enhanced sustainability and circularity features including: Acti-V RF glassine release paper including at least 15 percent post-consumer recycled fiber, and the typical light-yellow color used for label release liners. Acti-V RF Natural glassine release paper features a natural kraft color, based on a combination of post-consumer recycled cellulose fiber (at least 15 percent) and unbleached cellulose fibers. Acti-V RF Natural also eliminates the use of any dye and allows greater carbon footprint reduction with the replacement of bleached cellulose with unbleached. The recently launched Acti-V Industrial RF Natural is a custom version designed for double side silicone coating for application in double-sided PSA tapes. Alphasonics exhibits Plaeto for the first time at Labelexpo Europe. Plaeto is an automatic plate-loading system that sits just in front of the PCX and will automatically feed up to 30 plates directly into the device. The company is also showing a new, improved proofing roll cleaning system, and an array of anilox cleaning systems. Aluminium Féron shows new sustainable Monotex tag materials such as PE films with PCR, as well as recyclable PO films for laser printing. The company also introduces eco friendly tear resistant Tritex product with 100 percent recycled paper and 90 percent PCR core. Amica Systems launches its Gemini digital label press. The new Gemini 330-4C UV label press is fitted with automatic purge, wipe and cap functionality. It offers print quality up to 600x1200 DPI with inter-color pinning lamps and a print width of 216mm or 330mm. The company is showing its LPS330 UV-LED inkjet label press for short and medium-run jobs. Print quality is up to 720x1200 DPI with white-CMYK-varnish. For the narrow web label press market, Amica launches a 6-color (CMYK+orange+green) version of its Scorpio 6C UV-LED inkjet press, expanding the current range of 54mm, 75mm and 108mm wide versions. The presses are equipped with an automatic cleaning system and pinning LED lamps. Anytron unveils its latest Any-Press. This 5-color dry toner press is powered by a 13in wide LED engine with inline lamination. Additionally, Anytron highlights the Any-Jet II, an integration of digital printing and laser die-cutting. The Any-Jet II offers digital printing, laminating, laser cutting, slitting, and matrix removal capabilities. Apex International showcases its patented GTT engraving technology. Apex will launch its embossing technology for textures and raised effects. The company also shows its latest offering in anilox technology, Conical Anilox. Applied Laser Engineering introduces its Twin Track cell engraving technology. Twin Track enables allows users to achieve high cell volumes with a low depth of engraving. Arrow Systems launches its ArrowJet line in the European market. The ArrowJet line features water-based pigment inkjet technology from Memjet and boasts print speeds of up to 50m\/min. The ArrowJet Aqua 330L is built with Siemens servo motors and is designed for use for both labels and flexible packaging. The ArrowJet Aqua 330R Hybrid Pro features inline priming and varnish. Arrow Systems also announces the ArrowBolt line. Featuring Memjet’s latest Durabolt technology, the ArrowBolt can run up to 150m\/min with 4x nozzle redundancy. Armor-Iimak offers new features for its inkanto thermal transfer ribbons. Clean Start is a printhead cleaning feature that is built into the thermal transfer ribbon. It removes debris and dust from the printhead before it builds up and impacts print quality. Array Graphics\/norwix shows the high-speed, high-resolution norwix digital printing systems utilizing HP thermal inkjet heads and piezo-based iM2 assemblies. Asahi Photoproducts debuts its updated wastewater recycling unit for use with the AWPTM plate processing system. The unit features proprietary filtering technology said to reduce wastewater by 75 percent, and detergent usage by 40 percent. Ashe launches the Diamond duplex slitter series for wider web applications, and the Opal TST range of high-speed blank label converters with auto two-spindle turret rewind. Operating on the stand will be a fully automated ‘glueless\/coreless’ four-spindle turret slitter, an Opal ISR with 100 percent camera inspection and a mid-web sized (800mm wide) Solitaire duplex slitter for flexible packaging products. AkeBoose presents its chamber doctor blade systems for label and narrow web flexible packaging applications. The Nova TK chamber doctor blade assembly is particularly suitable for integration in flexible packaging printing. The modular setup allows customization to the press requirements with plug-and-play installation. AtéCé Graphic Products launches a new cutting plotter that operates in both roll to roll and roll to sheet modes. The company also presents ink dispenser systems for mixing conventional, food packaging compliant and UV\/LED-UV offset inks as well as food packaging compliant (LED)UV flexo inks. Avery Dennison unveils a new range of VI and decorative linerless labels, a suite of solutions that eliminate the need for a liner, thereby reducing material use and waste and minimizing the environmental impact of packaging. The company also presents its latest sustainable products and labeling materials with a lower carbon footprint, and products that enable packaging recycling or reuse. Visitors can also experience demos of its digital products and understand how intelligent labels enable consumer interaction and end-to-end supply chain transparency. AV Flexologic and its sister company Tech Sleeves present long-lasting plate sleeves. AV Flexologic features a range of mounters and equipment for printing in the label and narrow web sectors. Products on show include the automated plate mounting SAMM 2.0 800, the automatic SAMM USD for label printing, MOM USD, the motorized mounting machine for labels, tabletop entry level flexo plate mounter for labels, the customizable sleeve storage system, lightweight sleeves for label printing and Cosmolight Water washable plates, by Toyobo. AV Flexologic and Tech Sleeves sales team and flexo experts are available for live demos, answering any questions about their wide range of mounters and equipment. Axicon Auto ID promotes the Axicon 15000 series of 2D and linear barcode verifiers. The 15200 and 15500 models can now measure and grade the quality of DPM (direct part marked) symbols, as well as conventionally printed 2D matrix codes, such as Data Matrix, QR Code, GS1 DataMatrix, and GS1 QR Code, as well as PDF417. The verifiers will also grade the quality of conventional linear barcodes such as EAN-13, UPC-A, and UPC-E provided they are not too large for each verifier’s field of view. The 15200 is set up for smaller symbols, and its field of view is 60x45mm meaning it is suitable for codes typically used on retail, pharmaceutical and healthcare items. The larger field of view of the 15500, 95x75mm, means it can also be used to grade the symbols typically used on outer cases and logistics labels. Bar Graphic Machinery (BGM) shows two next-generation machines. BGM launches its BGM Elite Digiflex 330 flexo die-cutting and converting finishing system with semi-rotary print station, quick-change ink system and screen-printing unit, and the new BGM Elite Dieflex E. Achieving converting and finishing speeds up to 160m\/min, the Digiflex 330 is designed with servo infeed and outfeed, a semi-rotary re-register flexo print station with LED drying, and cold foiling and laminating units. It also comprises a back slitting unit, waste rewind with lay-on roller and rapid slit rotary shear cut slitting system, complemented by master and finishing rewinders. The new BGM Elite Dieflex E is a high-speed plain-label converting and finishing line that can also be equipped with an adjustable anvil as an option. Baltink promotes water-based and UV-curable coatings, including for special effects such as soft touch, matte, deep matte and structured. Baltink also promotes water-dispersion coatings with barrier properties intended for direct food contact and to provide a barrier to fats, oils and liquids. Baldwin launches its upgraded Guardian PQV 4.0 with new Wizard-iQ Interface. Wizard-iQ can set up a repeatable process with a few clicks, lowering the barrier of entry for new employees. PQV 4.0 incorporates automated-Delta-E color monitoring and both single- and dual-sided 100 percent print quality inspection. Benford UV showcases its latest Eco LED UV system designed for web presses as well as its UV, LED UV and IR\/hot air technology for all types of press and industrial applications. bel presents the latest version of its Overprint Management Information System (MIS) for labels, IML and packaging. Its cost estimation tool offers a hybrid view of conventional and digital environments for production proposals, comparing costs in varying print quantities for each press technology. Overprint is further optimized with improved materials management, traceability and quality control features. Additionally, bel showcases its system for automated real-time data collection utilizing IoT devices on the shop floor. The integrations with Esko Automation Engine and Hybrid Cloudflow will be displayed, streamlining process management and workflow automation. Advanced integrations with press manufacturers will be unveiled, such as real-time job ticket submission via JDF integration on a DFE and incorporating inspection reports from other systems into the job ticket. Berhalter presents the new Swiss Die-Cutter B4. With a production speed of 500 strokes a minute, the Swiss Die-Cutter B4 provides an adjustable opening level of the punching tool and digitally monitored penetration depth. Another addition is active substrate guidance. Alongside the B4 model, Berhalter introduces its Cutcontrol technology, linking all production processes and providing key performance indicators. Operators can access real-time data streams from the machine, accessories and punching tools. Bio4Life showcases its entire range of certified compostable materials with a focus on applications for fruit labels. The face materials are derived from renewable resources and all are coated with the BioTAK compostable adhesive. The product range includes paper from agricultural waste, FSC & PEFC certified paper and a variety of bioplastics. The products comply with EN13432 and are certified by DinCertco or TÜV Austria. Beontag shows new technologies made from recycled materials such as PCR-coated paper and liner rPet. The company will also display linerless labels, which require less raw material. Additionally, Beontag will introduce Eco RFID Tag, which are crafted from paper and are responsible for less than half the CO2 per unit when compared to traditional PET tags. Bixolon shows XL5-40 4-inch (114mm) desktop direct thermal linerless label printer side by side with the XD3-40 4-inch (118 mm) direct thermal traditional label printer. The company presents selection of RFID print and encode printers, including mobile, desktop and industrial models. Bixolon shows the XM7-40R 4-inch (112mm), the premium mobile RFID label printer, and the XD5-40tR 4-inch (118mm) RFID enabled thermal transfer desktop label printer. In addition, the XT5-40NR 4-inch (114mm) thermal transfer RFID label printer. Bixolon also presents range of labelling printers including XM7 series featuring XM7-20 2-inch (58mm), XM7-30 3-inch (80mm) and XM7-40 4-inch (112mm) auto-ID mobile liner and linerless label printers. The company also shows the XT3-404-inch (114mm) industrial labelling line, the XQ-8404-inch (118mm) two-in-one, stand-alone label printing solution with integrated tablet, and the compact SLP-DX220 2-inch (60mm) barcode label printer, together with XD5-40 4-inch (118mm) desktop direct thermal printer suitable for small to mid-range businesses. Iconex joins Bixolon and showcases its MAXStick Linerless paper and Iconex Sticky Media liner-free label identification technology in conjunction with Bixolon printers. Bobst showcases the Digital Master 340 All-in-One modular label press, running at 100m\/min. The Bobst Accucheck system performs 100 percent inline quality control at full line speed. The full configuration will include flexo modules and an automated semi-rotary die-cutting unit. Bobst also highlights the Master M6 flexo press with oneECG extended color gamut printing and V-Flower printing units enabling fast, automatic changeovers of the printing cylinders without stopping the press. Busitel shows its new resin ribbon P314. Working on all kinds of printers (flat head, near edge and TTO), P314 offers a mix of resistance, flexibility and high-speed printing. Moreover, based on a 4-micron PET film, P314 allows up to 12 percent plastic reduction for each roll. Brotech launches the SDF Plus digital label converting system, which supports multiple processes including hot foil stamping, flexo printing, cold foil \/adhesive lamination, screen printing, varnishing, die-cutting, slitting, snowball waste removal and dual rewinds. Also displayed is the modular SDF-E series which can be expanded with options such as additional flexo coating stations, printing, cold foil\/lamination, hot air (I\/R) dryer for water-based primer or printing, auto-slitting unit, sheeting or IML stations. The CDF finisher features flexo printing, spot varnish, super varnish, cold foil, lamination, full-rotary\/semi-rotary die-cutting, slitting, and dual rewinds. The TR turret rewind has an auto hotmelt gluing system or glue-less core loading system for core gluing and roll end closure for non-stop rewind. BST shows its BST TubeScan Eagle View 100 percent inspection system. An additional five-megapixel camera allows zooming in on any web section of 35x25mm with a pixel resolution of 14 µm. BST also demonstrates dynamic job changes in realistic production environments where multiple jobs are printed on one roll. TubeScan automatically detects the new job and retrieves the corresponding master image in real time without stopping the press. Calor presents T 850 Sw with highly resistant resin qualities, developed for demanding labelling applications in the electronics and chemical industries. The company shows security tape range including different resin qualities that print black or transparent and fluoresce in bright colours under UV light. Cartes presents six machine configurations. The GE363VJL digital finishing technology is a Jet DScreen (JDS) on the Gemini platform, combined with laser die-cutting. The GT360 series with Jet D-Screen (JDS) is integrated with flexo, traditional silk screen printing, hot stamping and semi-rotary die-cutting. The GE362WL+turret rewinder laser die-cutting machine will be shown with automatic job change. The ILC laser cutter allows cutting of colored substrate without leaving white edges or can remove white borders from dark labels. GE361L is an entry-level laser die-cutting and converting machine. GE364VHWR is equipped with hot stamping on the Gemini platform, along with two flexo stations and a semi-rotary die-cutting unit. Cellopack showcases its new range of self-adhesive label material converted in Egypt. Cerm promotes smart MIS software. It offers an automated workflow connecting all elements of the converting business. Cerm also features on the Automation Arena. Cheshire Anilox Technology launches a new anilox sleeve design developed to lengthen lifespan by protecting the roll edges, and a new engraving designed to enhance ink transfer, reduce pin holing and enable printers to use finer line counts. It also showcases Maxflo+ engraving designed to improve the way ink is transferred to the plate, reducing foaming, ink spitting, mottling, pin holing, plugging and dot gain. The engraving is available in a variety of volume options and can be utilized in multiple print applications, from fine print to flood coat. Cheshire also demonstrates its full range of engraving technology including TactiLoX for high build tactile finishes and easyFlo HD for high opacity whites in a single pass. Clean Solutions Group shows cleaning technology for anilox rolls and sleeves. It will showcase one of its laser cleaners, the JetCleaning AL 900. ColorConsulting showcases its color and ink management technology. The company also unveils InkWeigh version 6.0 with new ‘Smart Traceability’ feature allowing tracking of production batches including orders, leftovers and warehouse locations. ColorConsulting also shows Alwan Color software including PrintStandardizer and HydraFix technology that, combined with Alwan ColorHub, offers a dedicated solution for printers utilizing hybrid digital-flexo technologies. Comexi presents a central impression cylinder used in its Ci8 offset printing press. The Ci8 allows reduction of environmental impact using solventless EB offset inks. ContiTech Elastomer-Beschichtungen presents offset printing blankets optimized for label and packaging production. Daco Solutions launches the Daco PLR slitter rewinder with a three-spindle semi-automatic turret rewinder and an integrated 1m (40in) unwind, with web widths of 350mm (13.75in) and 430mm (17in). The machine is available with an inspection table and a vision system. The company is also exhibiting the Daco PLD350 with a rotary die station for blank label production. The company also brings the new Daco SRV350 fully servo slitter rewinder with a Nikka vision system, back numbering and auto-set slitting knives. The SRV allows clients to specify a machine for most slitting and rewinding requirements. Daetwyler SwissTec displays the MDC Goldstar doctor blade with a low friction coefficient and corrosion-resistant coating. This coating provides a lubricating effect, enhancing the blade’s lifespan. Dantex Group presents its PicoJet technology including PicoCenter and PicoPilot workflow automation software with touchscreen interface. Features include Dantex’s SuperText, SuperWhite, and DecoTactile technologies. It is a hybrid press with reel-to-reel inline finishing capabilities, and it offers an option to add white with 92 percent opacity in a single pass at speeds up to 75m\/min. Darui China showcases a new generation of laser label die-cutting machines. This technology offers both roll-to-roll and roll-to-sheet finishing options. The fully digital laser process system performs well in handling small and medium-sized orders. DCM Usimeca will present a shrink sleeve seaming machine equipped with laser perforation. It will also present a doctoring rewinder for quality control and correction of reels, equipped with a 100 percent inspection system. There will also be a bi-directional narrow web slitter rewinder for inspection and doctoring. DecoSystem will present its full range of inspection systems. Sentinel is a 100 percent print inspection system including color control, 2D and 3D code grading and variable data verification. The Sentinel Workflow option enables connection between press and rewinder to minimize waste and monitor production. Scandiff2 proof software identifies pre-press issues early in the work cycle. Multilabel is optimized for pharmaceutical labels and includes the Sentinel print inspection system and numbering inkjet system. Finally, Deco_GPR is software for tracking production data, accessible from a PC, tablet or mobile device. delfort shows its Tersil UltraLightBase glassine for self-adhesive applications, claimed up to 40 percent lighter than current market alternatives. Delta ModTech demonstrates its updated Crusader Converter, featuring on-demand converting including precision RFID antennae placement. This system integrates multiple processes such as rotary die-cutting, winding, conveying and accurate part placement. Other features include laser die-cutting, multilayer lamination, heat-seal pouching, coating and drying. DG press shows a print unit from its latest sleeve-based web offset press, the DG-Auxo. Using solventless inks, the press is suitable for handling shorter run lengths in the flexible packaging market. The DG-Auxo comes in 520mm, 900mm, and 1085mm widths and operates at speeds up to 400m\/min. The smaller DG- Auxo 520 is tailored for security printing, while the wider DG- Auxo 900 and DG-AUXO 1085 are designed for flexible packaging printing and label printing. Dilli shows its Neo Picasso UV inkjet press incorporating upgraded tension control for a wider substrate range. The Neo Picasso has a maximum print width of 330mm and operates at speeds up to 50m\/m using CMYKOV (with optional OV\/OG\/VG spot colors) and double white, which provides a high level of opacity. Its maximum resolution is 600x1200 dpi. The machine comes standard with a corona treater, chill roller, pin-curing LED system and full-color variable data printing capability. DNP will display its V390 resin labelstock for thermal transfer overprint (TTO) and near-edge printing. Other products on show include V300, M255, M295HD 4.0 and TR4085+. Domino demonstrates the N730i UV inkjet label press and the K600i variable data printer along with the new K300 high-resolution inkjet printer capable of speeds up to 250m\/min. The N730i prints at 1200 dpi using Brother Bitstar print head technology. It is configurable in up to seven colors (CMYKOVW) and can achieve up to 92 percent of the Pantone color range. It has an optional flexo priming station to optimize print quality on more difficult media types. An additional flexo station can be added to support varnishing, a brand spot color or flood white for shrink sleeve applications. The K600i enables variable data printing at speeds up to 492ft\/min, printing serial, batch, random or PINs; alphanumeric characters; variable images; linear barcodes; 2D matrix or QR codes. Domino will also reveal its new online ripping in real-time. Dongguan Xincai Packaging Materials shows special label materials, protective film and adhesive tape. Dow presents its silicone release coatings and acrylic and silicone adhesives. Syl-Off release coating products can handle speeds up to 1,300m\/min. Additionally, Dow will display a range of high-performance silicone and water-borne acrylic adhesives. Dow will also showcase its INVISU 7007 washable adhesive for filmic labels. This adhesive allows PSA labels and PET bottles to be separated in a recycling system. DPR shows Aries and Taurus label finishing technologies. These systems, equipped with rotary module or laser technology, handle up to 350mm media width. The machines offer UV flexo varnish, lamination, die-cutting, slitting and dual shaft rewind functionality in single pass. DPR also introduces the Virgo and Scorpio X2 series powered by cutting knife technology and featuring two inline plotters with two separate and independent cutting heads. Drop AG by Hans Lüscher will show the Drop DirectPoser, a direct exposure system for flexographic printing plates based on EPDM materials. This system produces flexographic printing plates for various sectors including label, pharmaceutical, corrugated, coating plate and dry offset. The system engraves plates directly using a fiber laser without the need for chemicals, which reduces energy consumption and carbon emissions. Drop AG also presents the Drop Phoenix CtS UV laser direct plate setter. The machine provides exposure solutions for screen, offset printing and pad printing applications. DuPont Teijin Films presents Melinex films, designed for long-life durable labels in applications such as auto and electronics. These films offer excellent temperature and chemical resistance. They are printable and available in white, clear, matte and black, and are commonly used in pressure-sensitive labels where durability is essential. The labels based on Melinex polyester films can be directly printed using flexographic and UV inkjet technologies or other digital print technologies with a suitable top coating. Durico shows a range of direct thermal film and inkjet-compatible label facestock. The product line includes new direct thermal films that are phenol-free and heat stable, as well as films resistant to solvent, alcohol, hot water and tallow. Durico also displays translucent direct thermal films and durable inkjet PP films that comply with BS5609 and GHS. Lastly, the company presents inkjet DuPont Tyvek suitable for use with color inkjet printing systems. Durst Group introduces Hawk Eye technology, which uses machine vision and artificial intelligence to automate print quality. In addition, Durst Group is unveiling a new Tau RSC UV ink set, available in CMYK OVG and white, which broadens the Tau print systems’ application range. The company is also showcasing the Tau 510 RSCi equipped with a double white print engine. The press operates at a speed of 100m\/min at a printing width of 510mm, achieving productivity over 3000sqm\/hr. Eclipse Label Equipment showcases its latest ‘print and finish’ systems designed for in-line label production from blank label stock. In addition, the company presents a new in-line laser label finishing machine, the Eclipse LF220-LAS. This is designed to operate either with a pre-printed roll of media or in line with any digital label press or finishing system. ECO3 demonstrates its in-house prepress and plate making systems for narrow- and mid-web flexo converters. Amfortis is a dedicated all-in-one PDF workflow technology covering all prepress production tasks from preflighting, step and repeat and proofing to rendering. All are available via secured cloud services. The company also shows SPIR@L screening and GridTune screening technologies. MAGIS F dry film and MAGIS P-Eco water wash plates are also on display providing flat-top dots topologies. MAGIS DI digital imaging systems provide the imaging engine up to 4.800 dpi. Ecosystem Costruzioni showcases its new single pass roll-to-roll finishing line digitally printing varnishes and UV adhesives. It handles reels up to a diameter of 1,000mm with speeds up to 90m\/min. The base system can be expanded to a double bar version for simultaneous metal transfer and high build varnish application. Maximum resolution is: 2160x720dpi, and coat thickness ranges between 6- 100 microns. Production speed is up to 48m\/min. Elkem introduces the Silcolease UV LED Series release coatings. Elkem provides silicone release coatings in a range of formats, including solvent-based, water-dilutable emulsion formulations, solventless thermal and UV. The new UV LED curable silicone solutions support the industry’s shift toward a more sustainable footprint. Emmendinger Maschinenbau (EMB) presents die-cutting machines for producing lids and labels in large lot sizes. The company also shows sparkling wine capsule machines that offer a wide range of decoration possibilities at high production speeds. Epson debuts its recently extended range of SurePress label presses. The L-4733AW — a major upgrade to the SurePress 4000 series will be shown alongside the SurePress L-6534VW, available with CMYK and white ink plus either orange ink or in-line digital varnish and will be demonstrated in combination with an inline GM DC330 Mini all-in-one compact label finisher. The SurePress L-4733AW short-run label press uses Epson’s newly improved AQ4 ink-set — CMYK with green, orange, and white. Epson also introduces ew cloud enabled ColorWorks label printers. This follows a partnership announcement between Epson and Loftware, the cloud-based enterprise labelling and artwork management provider. eProductivity Software (ePS) showcases the latest portfolio innovations, including an integration between ePS Radius ERP and HP Indigo. ePS demonstrates the advanced integration between its Packaging Suite and HP Indigo PrintOS, which fully automates the process from order receipt through job estimating, planning, prepress and scheduling. And with an integrated data collection system, real-time visibility, and full traceability for any job on HP Indigo presses is now possible. ePS also demonstrates its eFlow Enterprise Service Bus that ties the Packaging Suite together along with third-party software that includes a new ePS Automator capability. ePS also shows its technology including PrintFlow4D, Business Intelligence (BI), iQuote and Auto-Count 4D (AC4D), and Radius ERP. The company also unveils its recently acquired Tharstern SMB Cloud ERP system, designed specifically for small and mid-sized label converters. Errepi updates its Leonardo automatic rewinder, and features products from its portfolio including the Volta and Archimede winders, Galileo flexographic printing machine, Giotto inspection machines, and die-cutting machines such as the Dante and the Vittoria and Vittorino core cutters. Erhardt+Leimer exhibits a new generation of Smartscan print image inspection systems, in addition to its full product range of web guiding, web tension control, web monitoring, web inspection systems, web thickness and basis weight measurement systems. Esko is presenting an ecosystem of automated workflow, flexo platemaking, digital printing and automated print inspection tools. It is showcasing the CDI Crystal XPS 4835 and AVT Helios System along with its range of prepress software, including Esko Phoenix, an AI-based tool for planning and imposition productivity with an interface between prepress and production data. Additionally, Esko is demonstrating how it collaborates with X-Rite Pantone in color management software and measurement solutions to support digital workflows. Etirama launches the Etirama SPS3 press with pre-register system. The servo-driven SPS3 press has a 350mm web width and includes options such as cold foil, delam\/relam, lamination, sheeter and turn bar for reverse printing. An electronic pre-register system facilitates the production of small and medium-sized jobs with a quick and economical setup. The versatile press can run at speeds of up to 150m\/min, allowing it also to handle long runs effectively. The SPS3 can run self-adhesive, light cardboard and paper substrates. When equipped with UV LED or hot air curing, it can print unsupported films to produce wraparound, in-mold and shrink sleeve labels. It is also suitable for printing aluminum blister packs. Eukalin Special-Adhesives showcases its pressure-sensitive adhesive range as well as its water-based adhesive for shrink sleeves. Eukalin’s pressure-sensitive adhesives enable high-performance applications including durable industrial labels and consumer goods. Eukalin also shows its UV-C acrylic hotmelt PSA range. Evonik launches its next generation of Tego RC products made using recycled silicone feedstocks and can be cured using either LED or traditional mercury lamps. Evonik also launches a single-component, ready-to-use release coating. Evonik’s new product will enable label producers to adopt UV LED curing technology. EyeC demonstrates ProofRunner Web HighLight. Installed on a Rotocon rewinder, the latest inline inspection system has been developed for 100 percent inspection of labels and flexible packaging. HighLight illumination allows the system to inspect finishes including hot stamping, holograms, or blind embossing. The EyeC Profiler DT line will also be on display, along with the EyeC ProofText automated web-based artwork proofreading system with sync algorithm. It detects and evaluates deviations from the wanted text, including content and font style, within a single process, based on the original artwork PDF file. FAG Graphic Systems launches the FAG Flex4Pro Flexo Analyzer. Combined with the new FAG Relix4 this is designed to control flexo plate production, enabling quick measurement of dot sizes and relief depths. Fedrigoni Self-Adhesives shows RE-Play, a range of products in which the siliconized backing is recovered and recycled in a closed loop recycling system to produce new luxury label face stocks. The manufacturer shows new neck labels range, branded Manter, a line of premium self-adhesive materials combining collars and labels for luxury products, ideal for the wine and spirits sector. With the development of special ad-hoc adhesives for this type of application, this range offers performance and quality, capable of reducing the so-called 'memory effect' of paper. The company also debuts new premium wash-off range responding to the pressing need to re-use glass bottles. These exclusive materials, designed for wine and spirits products, offer excellent performance during immersion in ice and at the same time ideal results when removing the label in an alkaline solution at 80 degrees Celsius. Fedrigoni also shows products for luxury labelling, such as 100 percent recycled papers and papers made from alternative fibres. Highlights include product for pharma. The products are designed for small-diameter containers and over-the-counter drugs, syringes, ampoules, vials, insulin pens, pharmaceutical carton seals, tamper-evident labels, refrigerated storage labels, peel-off labels, multi-layer constructions and booklet\/multi-page labels. Also on display is products for food and beverage and home and personal care sectors. FLEXcon Global promotes coated and laminated films and adhesives for markets including durables, automotive, industrial and healthcare. Flexo Wash introduces the FW 850 laser anilox cleaner. FW 850 series models clean up to two narrow web rolls in one cycle and can be installed without a water supply or drain. It can handle aniloxes up to 7in in diameter, 27.6in length and 110lbs (49.9kg) weight. Focus Label Machinery promotes AccurioLabel 230 digital toner press from Konica Minolta. The company also focuses on the Reflex 330 Digital Finishing System. Focus demonstrates the accuracy of its re-register system - even at speeds of over 100m\/mint New for 2023 includes option for semi-rotary or full rotary converting system in roll-to-roll or roll-to-sheet formats. Focus also presents the d-Flex digital inkjet press with the latest HiQ 1800 DPI high-speed full-color (CMYK + White) Konica Minolta inkjet technology, which has been integrated into the existing Reflex servo press with in-line UV or LED flexo print head, die-cutting, slitting and rewinding. The company also shows Proflex SE is a full servo driven, modular press available with print widths of 250mm and 330mm. Fortisblades exhibits industrial slitting razorblades. Fortis, Fortis+ and Fortius series are designed for use on all types of film. The high resistance to wear and tear ensures a smooth cut, even in complex structures and\/or recycled materials. Gallus showcases the Gallus One digital label press, developed in conjunction with Heidelberg. Built on the Gallus Labelmaster press platform, Gallus One is a 340mm wide roll-to-roll UV inkjet digital inline label press. It offers print speeds of up to 70 m\/min. GEW shows its full product range with a particular emphasis on its air-cooled UV LED system, AeroLED. AeroLED is a high-power system for full cure, printing, coating and converting applications up to 60cm wide. The design update makes AeroLED compatible with GEW’s ArcLED system. Using the same fan and ducting arrangement as the E2C, printers have the flexibility to switch between arc and LED curing on any station. In an AeroLED system, air is extracted by a single centralized fan sited away from the press. AeroLED features the same LED chassis and core components as GEW’s water-cooled LeoLED lamphead. AeroLED’s design enables the lowest energy usage of all GEW products. GIC launches the Taginnov line for RFID airline baggage tags, clothing labels, tracking tags, logistics labels, pharmaceutical labels, tickets for events or transport, skiing lift tickets and packaging. This new line consists of systems for integration of wet or dry RFID tags in adhesive or cardboard substrates. Gietz shows ROFO 450 web-fed flatbed hot foil stamping system for narrow web embellishment processes. The ROFO 450 Eco will process PS materials, paper, cardboard, film and composite substrates. The machine achieves speeds of up to 120m\/min with a dynamic foil web transport with a 90 degrees rotating foiling unit. Gietz also introduces a wider version ROFO 570 Eco with a larger stamping surface. Golden Laser launches a new sheet-fed laser die-cutting system. Golden Laser also shows a laser die-cutting machine designed and manufactured for the roll-to-roll or roll-to-sheet finishing of package printing. For the digital label printing industry, Golden Laser’s laser die-cutters work well with all pre-press and post-press systems including rotary die-cutting, flatbed die-cutting, screen printing, flexo printing, digital die-cutting, varnish, laminating, hot stamping and cold foil. GSE unveils software and dispensing solutions for fully automated ink and color management in label printing. With programs for purchasing, inventory control, reusing press-returns, ink batch tracing, color formulations and management reports, GSE Ink Manager provides solutions for automating and accelerating every ink-related step in the print house. GSE also showcases its Colorsat ink dispensing systems, which blend accurate spot color on-demand, while cutting out waste, errors and delay in color preparation – claimed to potentially reduce ink consumption by up to 30 percent. They are extendable and tailored to volume and application needs – including for label, flexible packaging, carton and corrugated board printing. Dispensers are available for UV, LED-UV, low-migration, water-based and solvent inks, and flexo, gravure and screen processes. Grafisk Maskinfabrik (GM) brings nine machines on display, including the DC350Flex+ wine line for foiling and embossing, screen colors, and flexo varnish effects. With 130m\/min rotary die-cutting (80m\/min semi-rotary) and a 50-ton pressure hot stamping module, the DC350Flex+ series is fully customizable and can work either standalone or in line with a digital press. The new HF350 hot foil machine adds embossing and foiling effects in a compact footprint. The company will also show DC350Mini compact label finisher and DC350Nano. The SR350 slitter inspection rewinder and the LR250+ inspection rewinder are also on display. The machine can be configured for pharma labels and even turned into a mini-inkjet digital press. Also shown are the CC160S semi-automatic core cutter, and the CS350 high-speed sheeter. Grafotronic brings 10 machines, eight of which are new technology. The company shows Revolver, a fully automatic turret, new modules for full in-register lamination, crossover and printing on the glue side and the DCL2 in five different configurations. Grafotronic demonstrates five machines equipped with the AI-based computer vision system Grafotronic IQ, which allows autonomous job changes, handling all job settings automatically. In the Automation Arena, Grafotronic is the exclusive finishing partner. Together with Xeikon, Esko and Cerm, Grafotronic shows how the converting processes can be automated, showing an IQ-equipped DCL integrated into a fully automated end-to-end workflow. Also on display will be the new Haptic series, with two new screen modules, a new hot stamping machine and the latest digital embellishment system powered by Kurz. On top of that, Grafotronic will show its SCI-FI laser for the digital converting of printed labels and stickers. The company will also present Boon-Tech efficiency-enhancing auxiliary machines including slitter\/rewinder, fan-folding equipment, core cutter and label cutter. Graphic Republik celebrates 15 years of innovation with its digital film solution, Star Plate. Graphic Republik focuses on Star Plate digital films as an alternative to ageing laser imagesetters and chemical processors. It is ideal for making both negative films for use in flexo and letterpress platemaking and positive films for silk screen generation. It produces small text, fine lines and hard dots up to 175 lines per inch under daylight conditions, without the need for post-processing. It removes both the need to purchase and store chemical developer and fixer, and then dispose of those exhausted chemicals. GTI Graphic Technology showcases its LED color viewing systems. CVX-3052\/LED\/FS viewing station with a 29x52in (74x132cm) viewing area. MiniMatcher 4e\/50\/H which includes five light sources: an ISO 3664:2009 compliant D50 source and four LED sources. MiniMatcher 1e\/50\/H includes four light sources: an ISO 3664:2009 compliant D50 source and three LED sources. PDV Series desktop viewers conform to the ISO 3664:2009 viewing standard. Three model sizes are offered - all include D50 lamps, a print bar, and a hinged design. Dimming, a lower luminaire, and side walls are available as options. GTI shows a PDV-3e with dimming. Guangdong Youhua New Material Technology shows modified film coating materials, release protection materials, self-adhesive label materials. Itsproducts are used in food and beverage, supermarket and daily chemicals, medicine and health care, transportation and logistics, household appliances and electronics. DYM Machinery promotes non-stop roll changing technology for label and narrow\/middle web. It promotes automatic butt splicer unwinder, non-stop cold stamping film systems, non-stop waste matrix collector and automatic turret rewinder. The company also shows WBC&WBU automatic non stop stamping film unwinder and rewinder. Hangma Paper Products shows high-quality semi-gloss paper, adhesive thermal paper, BOPP, PP, and special customized material. Hamillroad Software embraces ‘modern legends’ theme by creating a marketing campaign around its own AI generated modern characters, orchestrated for Bellissima’s strapline ‘seeing is believing’. At the center of this campaign is an AI generated ‘Chameleon’ featuring a vivid color spectrum tying into Bellissima’s ultra high-definition print capabilities. HB Fuller introduces Swifttak PS 8405 water-based pressure-sensitive adhesive (PSA) with non-water whitening properties. It is designed for those seeking a premium PET label with a no-label look. This adhesive delivers performance with clarity and optimized peel, tack and aging properties. The company also promotes ultra-removable and highly repositionable Gel-Tac products based on water-based acrylic, pressure-sensitive microsphere technology. Labels can be removed without leaving visible residue, markings or damage to the material. Photo albums, consumer advertising, masking tapes, wall or window decals, graphics, wallpapers, linerless labels and tape constructions that can be repositioned or replaced. Henan Yinjinda New Materials promotes functional polymer film materials. The company develops products for labels and multi-packaging of drinks, medicines, cosmetics and electronics. The company’s products include a regular transparent PETG and also PETG with 30 percent PCR, a white PETG and crystallizable film. Henkel showcases its comprehensive pressure-sensitive adhesives product portfolio and a wide range of new PSA products. The company displays sustainable PSA products to improve food safety, container recycling and waste management. It demonstrates a variety of PSA technologies including water-based, solvent-based acrylic, rubber hotmelt and UV hotmelt PSA. With UV hotmelt PSA, Henkel enables broader use of acrylic-based hotmelt adhesives across a wide range of applications and industries, particularly where solvent-free adhesives with minimal VOC emission can help meet regulatory requirements and sustainability goals. Henkel also presents its ECO and RE PSA portfolio for labels, with targets of reducing carbon emission in label production, reducing waste, and enabling usage of high-quality recyclate. Hermans, a specialist in embossing and foil dies, shows laser-engraved clichés for premium labels and packaging applications. Fine detailing and adding texture to foil and\/or embossing dies will be demonstrated. The company presents Ready2press, a mounting plate that reduces changeover times between foiling jobs, designed for all types of foiling machine system. The company also introduces lenticular clichés with applications ranging from decorative to security. Heaford celebrates its 40th anniversary and offers limited-time offers on its ELS and FTS range. The company also holds ‘Heaford's Fastest Mounter Competition’. This competition puts participants' skills to the test, challenging them to mount flexo plates with ease, speed and precision. Hangzhou Cron Machinery & Electronics promotes the Cron HDI-920 high-definition digital flexo imager designed for mid-sized packaging formats. The HDI-920 can produce plates for labels, hangers, soft bags, paper cups, folded paper boxes or books. The system will image polyester-based letterpress plates, thermal offset printing plates, digital flexo printing plates, ablative film and metal-based letterpress plates. HDI-920 is equipped with Cron’s SMFO laser optical system for accurate and stable imaging, with a resolution up to 9600 DPI. The HDI-920 is equipped with a fully-automatic plate clamping system as standard, which adjusts plate positioning according to the size of the plate without requiring sticky tape. HCI Converting Equipment launches its latest FSL-TR1300 turret rewinder designed for slitting label stock, wraparound labels, shrink sleeve label films and flexible packaging films. It features automatic splicing and roll changing, stand-by paper cores with auto positioning, finished roll eject and an unloading device. The company also promotes the new FP-X250-2 shrink sleeve seaming machine with rewind auto splicing, ultrasonic lay-flat measuring and solvent detection technology, with both seaming and doctoring processes on the same machine. The machine runs at a speed of 500m\/min. Height-LED will bring its latest UV-LED curing products. The LED array delivers an intensity of 26W\/sqcm or 40W\/sqcm for flexographic printing applications. HP Indigo will showcase end-to-end digital production with the first presentation in Europe of both the HP Indigo V12 digital press and the recently-launched HP Indigo 200K digital press. Alongside the HP Indigo 6K digital press, converters will be able to learn about Indigo’s LEP and LEPX technologies. The V12 digital press will be demonstrated showing flexo-matching productivity; the HP Indigo 200K Digital Press delivers a 30 percent improvement in speed and a 45 percent increase in productivity over the 20000 model, and opens the door to more flexible packaging converters who want to enter the digital market. The HP Indigo 6K is demonstrated offering E2E solutions. HP hosts the Digital Pouch Factory, featuring the HP Indigo 200K digital press, demonstrated with prepress and finishing equipment. Hönle presents LED-UV curing devices for pinning and final curing in label printing applications. The new LED Powerline LC HV is supplied with a voltage of 400 V DC. The LED system achieves high intensities for curing printing inks and varnishes. The two device versions differ in the width of the light aperture and thus in the irradiation intensity, reaching up to 25,000 mW\/sqcm. The length of the device can be modularly adapted to the application. Hönle also shows water or air-cooled LED-UV curing systems. Its subsidiary UV-Technik Speziallampen will present tailor-made UV and IR lamps as well as measuring devices. Hololens shows its seamless PET film with PRI (platinum relief image) technology featuring striking 3D visual and metalized effects. Holostik shows Optashield latest anti-counterfeit innovation empowers end-consumers to authenticate products conveniently. Optashield exhibits gradual shift between two colors when tilted either way from the viewing angle. It can be laminated on PET, HDPE, LDPE, and paper. Holostik can provide Optashield with labels, holograms, and revenue stamps. The company also shows Paper Hologram Label. It is made through the application of holography on paper instead of the traditionally used polyester. Hontec promotes the MPX series label finishing platform based on the company’s Digifini platform. It combines a variety of process modules, such as flat-bed hot stamping, intermittent flexographic printing, flat-bed silk screen printing, rotary die-cutting, flat-bed die-cutting, laser die-cutting, buffer and turret rewinding, sheet cutting. Linked through an EtherCAT system, the company can build a variety of customized finishing combinations according to customer needs. HPRT shows the Gala 4in industrial label printer, HT600 4in thermal transfer label printer and other labeling and scanning products. The heavy duty Gala prints at speeds up to 14ips. It has a color touch display, intuitive interface and optional accessories including a cutter and rewinder. Hybrid Software Group showcases technologies covering the full workflow for flexo and digital production of labels and packaging, including Packz PDF editor for prepress automation, CloudFlow workflow suite with flexo screening technologies, color management products, Smart DFE, and a complete portfolio of products for industrial inkjet applications. Ibeslab unveils a comprehensive range of adhesives for shrink sleeve production on a range of different films including PET, PVC, OPS and PLA. These adhesives feature an optical marker to facilitate inspection of the welding line at high speeds under a special UV light. Ibeslab also offers a new line of water-based flexographic cleaning products. Infigo experts will demonstrate how to build and scale an online brand through web-to-print technology, from creating a unique storefront to integrating customer experience and printing workflow modules. Inglese exhibits with its partners Toray Industries, DuPont Cyrel, Esko, Refine Finishing, Breit Technologies and Azul Sistemi. It demonstrates the Refine 17in-wide Compact 2 finishing system, with features such as a semi-rotary flexo unit, UV-LED curing system, cold foil lamination, semi-rotary die cutting and semi-automatic turret. Eco-friendly cast and cure embellishing films by Breit-Technologies will also be on display. PP Cast and Cure films, with a width up to 1016mm, are reusable multiple times and fully recyclable. Films are available in several patterns for holographic or textured effects, matte soft touch and extra clear. It includes anti-scuff and anti-counterfeiting applications. Inglese also features its new AC-J series anilox cleaning machine, suitable for frequent color changes and geared for anilox and sleeves. The product is made for both narrow web and wide web. Innovia Films presents Rayoface CPE45 and WPE45, clear and white-label facestock films intended to replace PE and MDO films in health and personal care applications. These films are claimed thinner than alternative facestock films. The company also showcases Rayofloat APO and APO-HS (high shrink), floatable polyolefin shrink sleeve films designed to improve the purity of recycled PET bottles. Additionally, Innovia Films highlights its EUP IML film. With a density of only 0.55 g\/cm3, EUP is a high-yield, high-opacity, matte IML film. EUP gives outstanding sheet feeding speed during printing, along with excellent ink adhesion. It is available in 50 and 60 microns and is targeted at PP or PE small- to medium-size containers, where zero distortion is a must. Innovia’s Encore range of low-carbon footprint label films will also be on display, along with options for films containing recycled content. International Graphic Films Europe NV shows self-wound self-adhesive over-laminate films. The company offers polypropylene and polyester over-laminates on rolls, which are custom slit according to customer requirements. IST Metz displays its Modulux LED-UV system, a high-performance, no-frills, modular system for narrow web flexo printing applications. The basic equipment includes LED unit, cooling, control cabinet and control system. INX International shows INXFlex Contour and Genesis washable inks, and EcoStage GB-XA Oxygen Barrier coatings. INXFlex Contour flexographic inks for shrink sleeve applications cure both UV and LED. These inks offer high performance, excellent transfer, fast drying, and printability at high speeds, while maximizing shrink contouring and eliminating post-shrink adhesion loss and ink flaking. The Dual Cure (DC) version allows switching from UV or LED unit by unit, providing an option to cure two ways with one ink system for increased efficiencies and lower applied costs. Genesis washable inks are de-inkable from cPET films and floatable with roll-fed OPP labels where ink is typically required to stay attached in the recycling process. With minimal bleed in the caustic wash solution and a reduced impact on recycled PET discoloration, new clear bottles can be produced from the circular reuse of recovered material. EcoStage GB-XA oxygen barrier coatings are formulated to address food safety and preservation issues, as well as improvements in sustainability and recycling. The coatings allow for mono-material packaging to replace multi-layer packaging for certain food applications. An alternative to expensive barrier films, it also extends shelf life and reduces food waste. Other INX products on display include digital inkjet solutions, sealers and primers, various lacquers including high gloss, silicon, tactile, ultra matte, UV and water-based, and Rucoinx UV screen inks. Italstick presents an environmentally friendly line of papers made from 100 percent post-consumer paper waste; grass papers, made of up to 40 percent grass fibers without the addition of coloring agents; and RippedBrown kraft, natural, unbleached, uncoated paper. They also offer phthalate-free PVC and a wide range of plastic films for offset and digital printing, all made with water-based acrylic adhesives. Itasa showcases its latest developments, from Glassine to SCK. Sustainability lies at the core of Itasa’s product design. Jalema shows a unique storage system for flexo and offset plates, protecting them from UV light while saving space. The system includes a coding system for easy plate retrieval. Jiangxi Tianyin Paper Co shows self-adhesive thermal label rolls for logistics labels, barcode labels and supermarket cash register labels, which can be customized in various sizes and colors. Jetron introduces the D2Roll LB3350, UV inkjet label press. This press is designed to print on a wide range of materials including self-adhesive labels, foils, papers and laminated films. The LB3350 can be configured as mono or with up to seven colors and in widths ranging from 50 to 350mm. The press runs up to 50m\/min. Jiangmen Hengyuan Label Technology Co shows a full range of label materials including direct thermal and semi-gloss papers, PP White, PP Clear, PP Silver, PE, PET, Synthetic paper, Woodfree paper and Inkjet papers. Jiaxing Huayi Imp and Exp Co shows self-adhesive labels. The company is certified with ISO 9001, ISO14001 and ISO45001. Jindal SMI introduces two new products: polyolefin base conformable PP and PCR PP. The polyolefin film delivers outstanding conformability and flexibility for label applications with excellent converting characteristics. Available in both clear and white finish, it is claimed 40 percent thinner than standard PE films. PCR PP is made with 30 percent post-consumer recycled content, and can be used in different label applications, helping to reduce the usage of virgin materials. Jurmet exhibits its Langer3 inspection machine, suitable for wraparound labels and other monofoil, linerless as well as linered labels. The machine is equipped with a 100 percent inspection camera, has a working width of 520mm and can operate at speeds of 500m\/min. The company also displays a slitter machine, Winder3, with automatic knife setting, and a programmable core cutter, Cater-d. Karlville Converting presents its Pack Ready thermal laminator, known for high-strength bonds without requiring an adhesive. For shrink sleeves, Karlville Converting displays its latest seamer and inspection combo. Its third-generation Plus series seamer, K3 Plus, operates at 500m\/min and forms the sleeves via an automatic adjustable forming section. For Inspection, Karlville shows a high-speed inspection machine equipped with E+L edge guides on both unwind and rewind. It is possible to adjust the amount of oscillation and the type (sine or square) via the MMI. Karlville Swiss shows the compact KS-SUP-400 pouch machine. This machine offers fast set-up, high production speed, minimum start-up scraps and the capability to manufacture custom-shaped pouches. The company will showcase for the first time live, the possibility to manufacture short-run custom-shaped pouches with an innovative toolless system. Klöckner Pentaplast introduces SmartCycle Pro, a heat shrink sleeve film that is recyclable in the RIC 1 stream and made from 30 percent certified post-consumer recycled material. Kocher + Beck introduces the GapMaster EM, a servo-driven system offering both rotary dial and digital input adjustments. The company will also display its water-recycling processing unit, and flexible dies with an anti-stick coating that results in less adhesive residue on the cutting edges. The new coating is certified in all applications such as pharma\/medical applications (FDA Certified) and is environmentally compliant. Also on display is a digital KMS pressure gauge system equipped with a variety of sensors that offer higher stability under changes of load. A quick-change die-cutting station is also highlighted. Konica Minolta shows a full production workflow for the label converting and packaging industry, in partnership with Grafisk Maskinfabrik (GM) and MGI Digital Technology. Five systems will be running. This includes the first showing in Europe of the AccurioLabel 400 single-pass digital press. Konica Minolta also shows the toner-based entry-level AL 230 press configured with MGI’s DC 330 Mini and a new compact buffer. MGI’s Jet Varnish 3D Web Compact and Octopus Web machines will be shown together with Konica Minolta’s PKG-1300 digital printer, designed for short run, on demand corrugated and box printing. Konica Minolta also brings its comprehensive software suites, including Accurio Pro Flex and Accurio Pro Dashboard. Kurz presents the DM-Uniliner 2D and the DM-Uniliner 3D embellishment systems, and the Distorun module, a material-saving cold transfer unit that enables single-image application. Kurz subsidiary H + M will be showing effects for label finishing with its stamp technology. In addition, the latest products for brand protection will be presented. These include, for example, ValiGate from Scribos and various security solutions from TrustConcept. At its booth, Kurz subsidiary MPrint will be presenting the latest in digital printing technology. Also at a separate booth, Kurz will present a new service to produce thermal transfer ribbons not only in standard black, but to customer-specific special colors and security solutions. Labeltech highlights the Ortles slitter rewinder equipped with the new E+L Smartscan MIS2 4K inspection system and an upgraded version of the Lavaredo automatic knife positioning system, for both razor and rotary knives. Labeltech also debuts Reit, a small versatile rewinder, available in several configurations (bidirectional doctoring machine, slitter rewinder, inkjet printer). The machine is designed to meet the growing demand for small batch productions. The latest version of the Stelvio modular converting machine, with Lombardi flexo unit for printing\/varnish, UV-LED curing, cold foil lamination, full\/semi-rotary die cut and Vajolet semi-automatic turret rewinder is on display. Labeltech also offers the Sciliar bidirectional horizontal rewinder, with REA Jet HR2 inkjet variable data marker and BST 4000 Tubescan inspection system that will be running live. Label Traxx shows MIS\/ERP software for the labels and flexible packaging segments. Its latest Version 9 modernizes the user experience and introduces Cloud API, data warehouse, Siteline Sales Portal \/ CRM, and batched automated scheduling enhancements. Lartec presents new finishes for flexible dies that provide greater durability and cutting precision. Laserclean unveils the ALCS 1000 SF Anilox laser cleaning system, which now includes advanced safety features and a user-friendly interface. The system provides real-time monitoring and hazard alert systems to ensure operator safety, and the interface enables easy navigation and operation. Lake Image Systems presents Discovery PQExpress, an entry-level print quality inspection product for web printing, finishing, label converters, and packaging print lines. Lehmer shows the FlexoMatrix plate mounting system. The company shows workflow concepts for extended job management and new operating concepts for 360 degree-controlled plate mounting. In addition, LEHNER presents camera and scanner technology for the digitalization of plate management and the industrialization of flexo printing. Lemmaco shows hot and cold stamping foil, thermal transfer ribbons, self-adhesive labels, UV varnishes, window patching and BOPP films. The company also offers biodegradable product variants LemuGroup introduces three new machines: LI 220 RFID for multilayer label production and NFC\/RFID chip inserts; MA 350+GTU for premium finishing of digitally printed labels; and the fully automatic GTU 440 with a boxing system that can automatically pack label rolls. The LI 220 offers two operational alternatives in a single module. It enables the production of multilayer labels and also allows NFC\/RFID chip inserts, between the liner and the label, without hindering the visual design of the label. MA 350+, connected to a GBS turret, is targeted at the production of premium finishes for digitally printed labels in the wine, cosmetics and pharmaceutical markets. Lenze presents its digital networking services including Nupano, an open automation platform. The company promotes its other digital services including machine condition monitoring, without requiring extra sensors. Data comes directly from the drives. The company uses AI for machine optimization and predictive maintenance to ensure improved machine availability. If a fault occurs, the machine automatically creates a ticket to inform service technicians. Leonardus SRL launches certified recyclable plastic-free holographic metalized paper that delivers the same performance as traditional holographic film without using plastic. The 70gsm paper is easily printable and recyclable in compliance with Aticelca501 standards. Lintec Europe launches a labelstock material to improve the recyclability of PET bottles and a direct thermal paper as an alternative to synthetic paper products. MMP Mono Material Polyester (PET) is designed for application to polyester packaging such as single-use water bottles. The clear film features a strong yet removable adhesive. The film and adhesive are manufactured from polyester so if any labels are not removed before the washing and grinding process the risk of contamination is reduced. A special top coating also enables the labels to be de-inked in an alkaline washing process. Lintec’s new direct thermal paper offers superior moisture and water immersion resistance, improved rub resistance and is microwave oven compatible. The material has successfully replaced plastic-based labelstocks in the food, beverage and logistics sectors. Lombardi showcases the latest versions of its Synchroline and Invicta presses. The presses offer flexible options for integration and are compatible with a variety of materials. The 670mm wide Invicta i1 press will perform live demonstrations of both unsupported films and PS materials production. The Synchroline platform will be producing full color VDP with digital embellishment options, while several conventional embellishment modules are also displayed. Lombardi also offers hybrid inkjet\/conventional solutions with its Astra model. Also, a preview of the latest version of the mid-web flagship Invicta I2 is offered. Luminochem introduces LuminoMark pigments, organic UV fluorescent pigments suitable for brand protection, labels or direct product marking and creative design. The pigments are virtually invisible in ambient light but show their vivid colors when exposed to UVA light. Lundberg exhibits the MatrixCompactor 200 for label matrix handling. This system enhances production throughput, reduces waste of virgin material, reduces unnecessary disposal of paper cores, and reduces the number of heavy lifts for operators all while contributing to a more sustainable production process. Luster showcases the LabelHero Series inspection system, which consists of a dual-camera inspection system and variable data detection module. It can be integrated with different types of production lines including flexo printing, digital printing, die-cutting and slitting. Maan Engineering presents its hot-melt coating equipment. The company will introduce a network of coating and converting specialists who work in partnership with Maan Engineering and unveils a partnership with ABG. Mark Andy launches the Pro Series flexo press, designed for cost-effective self-adhesive label production. The servo-driven press is based on the established Performance and Evolution Series press platforms. The modular structure of the press means it can be upgraded with a digital toner unit and transformed into a hybrid press. Mark Andy also shows its hybrid digital and flexo technology. The Digital Series HD, equipped with a Kurz Distorun embellishment module, will be on working demonstration. Also, on working display will be the latest version of Mark Andy’s toner hybrid, the Digital Pro Max. The company also highlights the expanding activities of Mark Andy Print Products (MAPP), a portfolio of end-to-end products for label manufacturing, including equipment and consumables, as well as service and consultancy. Martin Automatic displays an MBS automatic unwind butt splicer and an LRD transfer rewinder. Both machines have been sold to German label printer Krämer Druck and will be delivered and installed directly after Labelexpo. These machines save space, can be installed directly against walls at either end of the press and still allow access for maintenance and roll loading and unloading. Matho unveils the CB-100, an advanced mobile cutting and extraction system specifically designed for non-adhesive or self-adhesive edge trims, die-cut pieces and matrix waste generated from production lines. An integrated material separation system enables efficient recycling processes to be implemented. Users have the option to choose from various collection options, including PE bag, octabine, roll container\/bin, screw compactor and others. The CB-100 incorporates an integrated cutting module, reducing waste volume and an energy-efficient radial ventilator, minimizing energy consumption. Maxcess brands RotoMetrics, Fife, Tidland, Maxcess Vision Systems and Componex launch new products, including RotoMetrics’ new flexible die portfolio and RotoScan intelligent die station; Tidland’s RD AutoScore scoring system, FIFE-500 Max web guide and Maxcess vision systems for tag and label applications. The flexible die portfolio makes it easy to find the right die for a specific application for better press performance no matter the liner. The RotoScan intelligent die station provides accurate control of die pressure to account for any substrate variability, while providing Industry 4.0 analytics. Tidland’s RD AutoScore delivers fully automated lateral and depth control. It reduces setup time while increasing operator safety. The Fife-500 Max web guide minimizes waste with networking capabilities. Finally, Maxcess vision systems detect defects, like color variations, misprints and plate issues, while enhancing overall product quality and reducing waste. Melzer offers the SC-X Smart Label Production Line with integrated punching units, trim removal and various other options. This production line for RFID labels and tickets can process both dry and wet inlays at speeds up to 60m\/min. It uses servo-driven easy-to-change transponder unwinds for up to six tracks. Both dry and wet inlays can be processed at full speed of up to 60m\/min. The 330mm (13in) wide web grants high output and efficiency. Melzer’s inline verification system is standard and ensures 100 percent tested final products. Melzer also offers fully automatic machinery solutions producing high-end documents like e-IDcards, driver licenses, e-passports and inlays. Michelman shows water-based primers and overprint varnishes for digital printing on a wide range of substrates, including recyclable and renewably-sourced substrates. The company’s products provides water, oil and grease resistance, oxygen and moisture vapor transmission control and heat seal for paper and film substrates. Michelman’s DigiPrime family includes priming solutions optimized for paper and film applications in labels, flexible packaging and commercial printing. Its HP-certified primers for flexible packaging are used in pouches and lidding. The company’s DigiGuard Plus UV OPV strengtheners provide water, chemical, thermal and mechanical resistance for more durable labels. Its products for pigmented water-based and UV inkjet printing include JetPrime, a family of high-performance primers for paper and film substrates, and DigiGuard IJ OPVs. Michelman also shows products for coated offset substrates that are ideal for high-speed commercial printing, folding cartons and corrugated packaging printed with pigmented water-based inks. Meech unveils Hyperion 650QAC, a quasi AC (QAC) ionizing bar that offers a flexible and adjustable solution for effective ionizationation in various production environments. Its QAC high-voltage waveform generates positive and negative ions from each emitter pin, delivering rapid ionization with very low offset voltage. Equipped with auto-balancing technology, the 650QAC ensures consistent performance. Designed for RFID tag production, the 650QAC bar controls static charges in unwinding, printing, drying and rewinding processes, preventing catastrophic failure and latent defects. Ministone presents its patented 200DPI\/300DPI\/600DPI- thermal transfer, thermal thin-film label printheads, suitable for various industrial label printers. The company can customize the printhead for various resolution, width and speed requirements. Miyakoshi will showcase its machine intelligence Yaless AI operating system and an upgraded version of its established MLP label printing machine with several new options to support more efficient operation. MoistTech Corp shows the IR 3000 moisture sensor, which measures moisture levels, as well as water, solvent-based coatings and coat weight thicknesses during the paper\/converting process. This improves product quality and increases productivity with significant cost savings. The company’s moisture sensors provide continuous, reliable readings with zero maintenance and a one-time calibration. The sensors feature a non-drift optical design allowing operational personnel to confidently make immediate process adjustments based on real-time measurements. Monotech Systems presents the Jetsci dSpark digital label varnish and cold foiling label embellishment press. Also shown is the Jetsci KolorSmart+ 6-color UV inkjet label production press, designed for both short-run and long-run label printing with variable data and security printing features. MPS introduces MPSConnect, a technology that uses sensor technology combined with cloud-based real-time data collection. MPS also explains the EF Next Generation, MPSConnect and MPS’s business vision ‘connect to grow’. MPS also launches the MPS Virtual Coach, a tool designed to assist print operators in maintaining best practices for efficiency and quality. Mühlbauer showcases the CL40000, a flexible RFID inlay converting system suitable for mid and high-volume production. This machine can produce various output products such as smart labels, smart tickets and wet inlays, and features a high throughput rate, label\/ticket lamination, die cutting and 100 percent output testing. It achieves a throughput of up to 40m\/min. Nanovis presents a fast, thorough and environmentally friendly cleaning process for HP Indigo accessories. The Bella’s DC-1300 can clean up to four BIDS simultaneously, combined with manual brush cleaning for the pump sensor units. The company also offers a Bella Trolley for safe and efficient transportation between the printing and cleaning machines. Nanovis will also exhibit sustainable cleaning solutions for all conventional printing presses. Nazdar Ink Technologies shows a number of its products for use across flexible packaging, folding cartons and labels sectors. Knowledgeable Nazdar experts with years of experience will be on hand to explain the formulations behind Nazdar technology including its UV and LED flexo, UV offset and UV letterpress inks, water-based flexo, UV and LED rotary screen inks, and UV and LED overprint varnishes and adhesives. Other highlights include a showcase of its very latest LED curing Nestlé Compliant inks, coatings and adhesives. In addition, the company promotes its new water-based flexible packaging inks. Nikka Research shows the Alis camera used for optical inspection on printing presses and rewinders. The Alis cameras cover web widths from 250 to 880mm and are offered in three lines: M entry-level, L modular and H high-resolution inspection. All models are suitable for new or existing equipment and can be linked in workflows. The company also offers a range of apps for enhancing the functions of the camera. It also introduces a quick job change technology for 100 percent inspection of short production runs. This PDF-driven process enables automatic setup and inspection from the first copy in digital printing and converting lines. Nikka Research products and technologies will be demonstrated live on stations with moving webs, configured for the most common applications – printing press, rewinder and offline. Nepata Systems presents new products from its Saga Label brand - an all-in-one machine for processing labels after digital printing. The LC30 PRO label finisher combines five functions in one device: laminateing, contour cutting, trimming, slitting strands and winding. The Label Finisher provides variable production of labels and stickers in small to medium runs. The contour cut particularly enables the production of labels with complex contours and simultaneous production of various shapes and sizes in one run - without any cutting die. The Saga Label SALF-350 also has an integrated four-color printer. This is a roll-to-roll label printing, laminating, slitting and rewinding machine. The solution is especially interesting for variable data printing. An Epson Colorworks CW-6500Ae takes over the four-color printing on paper or film material. Saga Label also shows roll-to-roll label cutters and vinyl sheet cutters. Depending on the material, the latter can pull in stacks of up to 100 sheets and process them in the contour cut. There is now a Pro version in addition to the standard SC30 model. This is equipped with a CCD camera for fast reading of registration marks and QR codes. Nilpeter demonstrates for the first time at a printing exhibition the 26in\/670mm-wide FA-26 press, designed for short-run production of flexible packaging and labels. The FA-26 supports multiple drying\/curing technologies required for the production of different flexible packaging products. Also shown is a fully automated FA-17 UV flexo press and a digital varnish bar, a product that replaces traditional varnishing techniques. Nilpeter’s Digital Shadow technology is designed to capture data on usage, performance and maintenance needs. And in collaboration with Screen, Nilpeter introduces a new combination press integrating flexo printing units with the advanced Screen Truepress Label SAI S 7C. Norwix Inc shows its latest variable data printers. These include the high-speed, high-resolution PC22 model using HP TIJ 4.0 technology, and the piezo-based iM2 and iM4 printers, suitable for label replacement and label printing in high-speed production environments. Omet offers live demonstrations of its new KFflex UV flexo printing press and an XJet hybrid flexo+inkjet printing press. The company can integrate flexo, digital, offset and gravure printing technologies into its different press platforms. Presses can handle materials from 12 microns mono films such as PET, PVC\/PET shrink, BOPP, IML, foils etc to 600 micron paper-based packaging such as cartons, paper cups and liquid packaging, covering a wide gamut of packaging materials. OneVision shows its Label Automation Suite, flexible, modular automation software which combines production planning with print file optimization. It ensures an error-free and fast production process, with increased throughput and maximum transparency and reliability across all production steps. The intuitive user interface allows label printers to control and monitor all production processes, which are mapped as a ‘digital job ticket’ in the software. Optimus shows MIS software solutions in conjunction with its long-standing Italian distributor Servizio Informatica, including Optimus dash. Pantec presents the new Cheetah N, a rotary embellishment system for applying 3D images to shrink sleeves using heat and pressure. The customized 3D images are applied to the shrink sleeve by heat and pressure from a carrier film. The Cheetah N can apply up to 20 images per second. Also on display is the Rhino S, an embellishment system with a new RSD tool change system for improved machine uptime. This enables the time-consuming set-up process to be done outside the Rhino to increase machine up-time. Polar showcases the LabelSystem DCC-12 die-cutting system, designed for automated in-line production of die-cut labels made of compressible materials. The system is designed for highly automated in-line production of banded die-cut labels made of compressible materials, such as OPP foils for in-mold, and allows for remote maintenance and diagnostics, and integration into the digital workflow. The new industrial control system enables remote maintenance and diagnostics, as well as integration into the digital workflow. The new control system has enabled improvements to various parts of the system, resulting in a 25 percent increase in productivity. The new DCC-12 achieves an output of 10 cycles\/min. Polyart Group launches two sustainable substrates: r-Polyart, a synthetic paper made of 30 percent post-consumer recycled material, and Fiberskin, a weather-resistant paper that’s recyclable, biodegradable and printable by dry toner, for short-term outdoor exposure, outdoor tags, labels and signage. The company also introduces Polyart Laser Food, a food-compliant synthetic paper for dry toner printing. It can be used in direct contact with food according to the European directive EU 10\/2011 and FDA regulations. Postek shows its MX print-and-apply system featuring a built-in logic controller and Python-based printer programming language to provide low-level access APIs. The MX series print-and-apply applicator provides a full printing solution without a PLC or PC. Prati shows its DigiFastone digital finishing line, based on the company’s Futura field-upgradable open platform technology. The line is fully digital from inkjet module to laser die-cutting and turret rewind, and offers the capability to produce short-run promotional labels in the food and beverage, wine and spirits, cosmetics, personal care and home care sectors. DigiFastone can produce tactile effects and textures, decorations and textures up to 130m, and Braille and Marburg Medium printing for pharmaceutical products. The system generates low wastage, reduces setup times, and offers a register accuracy of 0.15mm. Printmark Group introduces Japanese care label printers for woven tapes and single-tag printers for single-sheet tags. The company also introduces the Spica series textile printers for nylon and satin labels. The Spica series is compatible with the ultrasonic cutter UC-50 provided as an option. Priber shows SQ Label barcode and labeling software, an intuitive single-page designer for uncomplicated tasks and a comprehensive job designer for a detailed look at any print job with real WYSIWYG. With its built-in support for various printer models, customers can take advantage of advanced printer features and settings, ensuring the best possible print quality and performance. The company also offers the SQ Label Barcode and Labeling Software for customized printing capabilities. The software offers scalability and flexibility, with built-in support for various printer models. PrintCity Alliance participants include DG Press, GMG, IST Metz, Kocher+Beck, Leonhard Kurz, Weilburger Graphics, Westland and Zeller+Gmelin at a joint stand. A highlight is a jointly produced high-quality label tied to a multifunctional packaging concept for co-branding. GMG offers color management and proofing; IST Metz offers UV curing systems; Kocher+Beck offers rotary die cutting and tooling technology; Leonhard Kurz offers hot stamping, cold transfer and digital transfer applications, holograms; Weilburger Graphics offers finishing varnishes, adhesives and water-based flexo inks; Westland offers rollers; and Zeller+Gmelin offers UV inks and coatings. Premier Coating & Converters displays its Premeco range of sustainable self-adhesive labeling materials that contains substrates such as grass paper, recycled paper, plastic-free film, and PCR content films. These materials are recyclable, contain recycled content, are thinner and are BS EN 13432 certified biodegradable or compostable. Print Systems introduces products for the automated washing of photopolymers, anilox rollers and press parts. The company’s product line also includes a UV-LED exposure unit for flexo and letterpress plate production and a water-washable plate processor with a unique filtration system. PrintsPaul offers a 5-color printing system available in two versions, the entry-level Ecoline and Deluxe. The 5-color toner-based printing unit is also equipped with a flexographic printing unit. The company also presents a one-pass inkjet system for finishing label webs, and Luster inspection units. The company’s product portfolio includes hot foil stamping, flexo units, die-cutters and screen-printing units. Prisma introduces the modular LF-350 finishing line for self-adhesive labels. The line is configured with a flatbed silk-screen printing unit with printing format up to 310x400 mm; a hot stamping\/embossing station; a flexo group; and semi-rotary die cutting and rewinder. The machine operates at 50m\/min in semi-rotary mode, 18.000 imp.\/h with relief foil stamping and 7.000 imp.\/h or 35m\/min with silk-screen printing. The emboss\/ foil stamping unit incorporates a 90 degree swivel foil stamping head, producing over 65 tons pressure, hologram application. The flatbed silk-screen printing features servo-driven squeegee and flood coater with precise movement on two high precision rails. The LF350 incorporates auto-register and is fully modular. QSPAC Industries presents its portfolio of linerless overlam for flexo and digital printing. The company’s new offerings include soft touch, holographic, thermal transfer printable, gloss and matte products. Radior exhibits the latest generation of UV flexo metallic inks, scratch-off inks and release coatings. It will also display its LED UV metallic and fluorescent inks. The company introduces the latest versions of Radiorplus Ecogreen, a mineral oil-free metallic ink and the Radiorplus Foodpack, low-migration metallic inks. The company also presents new water-based inks for food packaging. New Liquimetal W LMFP for coating units and Smart Inks W LMFP for narrow web is also shown. Ravenwood unveils two new linerless machines. The two new innovations will feature alongside a Nobac 5000, Nobac Stacker and Com 500. Nobac 1500 linerless label applicator aims at replacing standard self-adhesive top and (or) base labellers. The new machine applies labels across conventional MAP trays with no protrusion. Label weights range from 100 – 200gsm in both paper and plastic. There is also the option to link weigh price labellers with no need for compressed air. Nobac 40 Vac is a small linerless promo labeler. The Nobac 40 Vac works alongside Ravenwood’s Nobac 5000 range. Expect line speeds to reach a maximum of 40m\/min. RK PrintCoat Instruments showcases the FlexiProof 100 machine, which incorporates a custom-designed LED UV unit. This machine’s main components are identical to a standard flexographic press. FlexiProof 100 utilizes a doctored ceramic anilox roller and a photopolymer plate, and, with a maximum speed of 100 m\/min, realistic printability testing can be undertaken on all types of flexo substrates. The company also shows the VCML Pilot coater, a reel-to-reel machine developed for printing, coating and laminating for R&D and product development. Other displays will include the GP100, Esi Proof, Klox Complete and K Hand Coater. Renova shows brakes and clutches designed for the unwinding and rewinding of rolls of any size and material. Pneumatic brakes and magnetic powder brakes fit any application and maintain the high torque ratio necessary to obtain an accurate web tension. The company also offers core chucks, safety chucks and expanding shafts. Re SpA launches ReVision Net, a web viewing and control system integrated with compact high-quality cameras and a 16X Zoom feature. The company also introduces its web guiding systems, tension control systems, pneumatic and electromagnetic powder brakes, safety chucks, pneumatic air shafts and friction shafts. Rheintacho shows a wide range of stroboscope lights, including the RT Strobe 12000 with a length of 1,000mm, providing optimal lighting for large inspection surfaces. The operation of this stroboscope is handled through an integrated control panel, and a cascade setting is possible, allowing several Rheintacho stroboscopes to connect to one common control. Rhyguan showcases a compact fully digitally controlled finishing machine with corona, full rotary flexo (flood varnish), digital die-cutting and automatic slitting. The machine is designed for efficient finishing of ultra-short run jobs without any tools and prepared for a JDF workflow and standard QR code scanning for automatic set-up. For wine labels, the modular Plus330 is shown with a new fast silkscreen unit, silkfoil, and a heavy-duty hot foil module with dual heating zones and constant dwell-time for reliable and fast set-up. For the longer runs jobs, Rhyguan shows a machine with 50 percent improved productivity by increasing the semi-rotary die-cut speed from 60m\/min to 90m\/min. Also on display is an improved slitting rewinding machine with automatic dual knife slitting blades for wrap-around bands. For the longest run jobs a brand new fully automatic turret with automatic glue applicators and a quick change mandrel system is on display. Roosen BPL shows reel handling equipment designed to reduce the risk of injuries and worker fatigue and includes a range of reel lifting and turning equipment. Rosas Maschinenbau demonstrates its third-generation Gazelle high-speed bidirectional rewinder for imprinting a variety of labels. The new Gazelle III 6-color digital imprinting machine features an unwind diameter 650mm, web widths from 40-330mm, print width up to 200mm, corona treatment, a flexo primer station, Graph-Tech’s EZ 202 DOD color inkjet head based on Epson S3200 technology, double white DOD UV inkjet with 600 dpi, a 4C DOD UV inkjet with 600 dpi, and an LED UV curing unit. Also shown are two of Rosas’ table top rewinders: the Cheetah 500 with AI technology for label inspection with an advanced RFID HF and UHF tag serialization module with code verifier and backside serialization and TIJ printer for numbering and coding. The second is a tabletop rewinder, the Leopard 300, with a Smartscan label inspection system, 2k resolution, and 180m\/min inspection speed. Rotary Technology (Guangzhou) shows a full range of rotary tools, including flexible dies, magnetic cylinders, print cylinders, rotary cutters, slitters, anvil rollers, shafts, screen rings, anilox rollers, tint rollers, rubber rollers and more. Rotary Sp. z o.o. shows rotary tooling, including magnetic die-cutting cylinders, varnishing rollers, gears and embossing rollers. Rotocontrol EMT presents a portfolio of finishing machines for label slitting, rewinding, inspection, die-cutting, overprinting, digital and booklet printed labels. Its machines can be fitted with numerous modules for capabilities like integrated vision inspection, semi-automatic turrets, multiple slitting, counting and product detection. Advanced machines for various printing processes are also part of its offering. Also featured is EMT International’s Chameleon finishing technology and auxiliary processing solutions for the global inkjet market. Sandon Global showcases anilox engravings designed to boost print performance and increase anilox return on investment. Its products include Fluid HEX, Fluid UV, HOW (high opacity white) and its patented GMX Anilox, all designed to overcome common narrow web print issues and technical challenges such as ink spitting or coatings with large particle deposits. Sappi Europe introduces new release liner Sol BCK for visual communication applications as an alternative to PCK paper. Sol BCK helps reduce carbon footprint by more than 50 per cent Produced in Alfeld (Germany), the release liner eliminates plastic coating. A special coating layer improves the flatness of the self-adhesive laminate and simplifies processing, e.g. under challenging climatic conditions Sol BCK paper with special surface coating improves the flatness of the self-adhesive bond The new Sol BCK release liner features a clay coating that ensures a smooth surface. This makes it ideal for siliconization and later ensures easy separation between the release liner and the respective adhesive application. Furthermore, Sappi developed a functional coating that enables the polyethylene previously used for PCK papers to be dispensed with, while still minimising moisture penetration. Schobertechnologies unveils a Twin Spider set-up for their RSM410 IML\/MX. The Twin Spider is specially designed for the high-speed die-cutting and stacking of in-mold labels. The drive technology of the RSM410 IML\/MX combines continuous and vector rotary die-cutting technology in re-registration mode, offering format­ independent solutions. With the Twin Spider set-up, the RSM410 IML\/MX provides a high-speed, programmable robot-automated stacking and counting system (‘Spider’). This robot­ automated delivery is designed in such a way that different products can be stacked with the same print image. Screen together with Nilpeter presents a digital flexo hybrid printing press that combines Screen’s SAI inkjet digital printing technology with Nilpeter’s FA-Line flexo platform. The machine delivers stable and high-quality combination printing, and enables efficient production of value-added labels with expanded gamut printing and white imprinting capabilities. Additionally, Screen introduces an in-line digital primer prototype for the Truepress L350UV SAI label digital printing press. This feature addresses the challenge of poor ink adhesion on various substrates by incorporating a digital primer directly into the press. Screen also showcases the Truepress PAC520P inkjet digital printing press for paper packaging. This high-speed, water-based inkjet press offers label converters entry into the flexible packaging market with a compact footprint, low environmental impact, and compliance with food-safety regulations. Seal King shows a range of high-quality security products, including tamper-evident labels and security tapes. The tamper-evident label materials are available in different colors and transfers such as non-transfer, total transfer and partial transfer. The security tapes function as an anti-theft and counterfeit measure, leaving behind a visible VOID message when opened. The security tape can be used on cartons, paper and pallets wrapped with stretch film. It is available in lengths from 50m to 500m. SEI Laser presents Labelmaster, a laser die-cutting and finishing system available in 350mm and 600mm widths. SEI laser also launches the KyoJet, a high-resolution digital UV inkjet in-line press. Together, the Labelmaster and KyoJet optimize the web-to-label concept in which everything is digital, everything is online, in a single step, without any operator activity, with zero waste, downtime, setup, and without requiring flexible dies. Sermar Machines presents a compact vertical fan folder and showcases the new sheeter range models Smart Cut and Easy 2 Cut with electronic guillotine size change size. It supports single cut or double cut and is provided with a rotary slitting knife unit able to produce two-up jobs. The cut register, according to sheet size, is electronically controlled through a label gap\/print mark sensor reader. The delivery can be to a fixed table or a belt delivery with job separator. Sermar Machines also presents a new label converting unit in line with a spiral fan folder, the model SP-508-E, which operates at speeds up to 150m\/min. Shree Lamipack exhibits a variety of labelstock in paper and filmic material and release liners alongside thermal paper rolls or POS rolls in various grammages. Shosky Security exhibits a paper void label material. This product provides an environmentally friendly alternative to plastic, featuring a translucent paper facestock that reveal a security message when removed. Shenzhen Dicheng shows customized anti-counterfeiting printing materials and Li-ion battery strapping tape. The product appears as a regular tape but reveals a hidden message when removed, providing security protection. The PET surface material can be in opaque silver, shiny silver, sparking silver, laser, white or other color, transparent or non-transparent. Shenzhen Lamplic Science Co shows cationic resin UV ink and LED UV light sources for various printing methods. Shenzhen Puty Technology Co discusses its wide range of products, such as the Puty label identification line, which is utilized across a spectrum of industries, including power telecommunications, warehousing logistics and pharmaceuticals. Sibress shows Veritas measuring system. Siegwerk presents a portfolio of UV, LED-UV, solvent-based and water-based ink systems, including special whites suitable for shrink sleeves used for non-food and food packaging applications. These inks are available as standard and low-migration systems and are suitable for a range of applications including shrink sleeves, food packaging and more. Siegwerk also showcases an ink series for the direct-to-object printing market and for sensitive applications, as well as innovations for improving packaging recyclability. Included will be its newly developed TMPTA-free LED-UV curing systems Sicura Flex Dual Cure for non-food applications as well as Sicura Nutriflex LEDTec for food, pharma and hygiene packaging applications. Siemens shows its ‘digital twin’ technology which allows machine simulation and optimization and leverages machine data to enhance processes, optimize equipment use and improve maintenance scheduling. Sihl presents its developments in label facestock, Artysio flexible packaging, and tags, with a focus on sustainability. The product range includes innovative materials for water-based on-demand inkjet printing, including films with up to 90 percent recycled content. The company also offers pre-made stand-up pouches and an extensive tag range that includes tear-resistant, hang and linerless tags. Many of its products are FSC-certified and recyclable. The company also shows PressureTAC, linerless tags for logistic applications. Siltech shows inks for variable information printing with liner-free labels, aimed at reducing paper waste. The inks are available in multiple colors and can turn any substrate into a thermal-activated area. Sirpi presents a full range of products for the label industry, including UV screen inks and UV varnishes for special effects. It shows black matte UV for wine label production and a full range of UV varnish ideal for the protection and decoration of labels. The company has screen and flexo varnishes suitable for overprinting digital labels that can accept hot stamping and offer a complete range of inks and varnishes for various applications. Sistrade showcases its latest software version V.12.13 which highlights the label technical data sheet (TDS) as the main data repository, which in combination with graphical process management and digital job order contains all the technical data necessary for a smart production and full data traceability. Graphical process management allows users to control in real-time the status of all the different graphical processes of the products and also confirm if the customer approves all the information, design files and samples. TDS stores all the information related to a specific product estimate that was previously approved through the workflow. All the data can be automatically imported into the TDS from estimates or digital job orders. SQ Label presents its customizable barcode and labeling software. It supports various printer models, allowing for advanced printer features and settings. Stahl discusses its new packaging coatings division after the acquisition of ICP Industrial. The company shows Nicoat, MinusNine Technologies and Hi-Tech Coatings now under the Stahl Packaging Coatings umbrella. Starfoil Technology presents the Value Line 1300SXL spooling\/slitting machine featuring a higher speed of 250m\/min and larger diameter rolls up to 350mm. The machine can unwind from 1in, 3in, and 6 into master rolls on 1in and 3in cores using shear slitting or razor slitting with a maximum unwind roll diameter of 700mm. The company also introduces the CLC-600XLR, a cantilevered, compact model designed to slit 3in rolls to 1in or three hot-stamping (rest) rolls to 1in or 3in rolls using shear slitting or razor slitting and runs up to a speed of 300m\/min. Maximum diameters are 650 mm for unwinding and 550mm for rewinding. Sun Chemical presents its portfolio for the packaging and narrow web, tag and label markets. Sun Chemical uses its ‘5Rs’ framework (reuse, reduce, renew, recycle and redesign) to develop the eco-efficiency and sustainability of packaging that uses its inks, coatings and adhesives. Sun Chemical also provides products under its SunEco portfolio, which are bio-renewable, compostable and recyclable. Synthogra introduces its new film, SYN-BOPP transparent HB top coated 70 percent REC UCO, made with 70 percent used cooking oil and available in 26 and 32 microns. The product is produced sustainably from bio-based feedstock that is unsuitable for consumption and is animal-free and in no direct competition with the human food chain. The film is suitable for direct food contact and is designed for use in horizontal and vertical form fill and seal flexible packaging, as well as in overwrapping applications. Taghleef Industries presents its advancements in film products for shrink sleeve, pressure sensitive, in mold, and wrap-around labels. The latest developments include biobased PP films and reLIFE films with recycled content. Taghleef also unveils Shape360 TDS, a floatable shrink sleeve label film, new coated substrates for pressure-sensitive labels, a new substrate for wrap-around films and an ultrahigh-yield film for in-mold labels. TEG Technologies introduces the Sitexco Label L20 anilox cleaning system, a laser system designed using the Sitexco Plus technology for the narrow web industry. The Sitexco laser cleaning technology is designed to be fast, safe and cost-effective. Tresu introduces a variant of the third-generation L-series coating circulator: Tresu H5i G3. Designed for high-performance circulation, it allows for high flow, high viscosity, high speed, high temperatures and high pressure. The H5i G3 is designed for the automation of special coating applications, offering operators control and avoiding micro-foaming and blisters. The H5i G3 also offers data logging capabilities for Industry 4.0 operations using an Ethernet connection. Troika Systems presents the AniCAM HD and SurfaceCAM 3D scanning microscopes, which facilitate accurate measurements and data management. This data can be recorded into inventory management software to improve processes and make-ready times. Quality control management can provide up to 15 percent savings in make-ready waste and a 55 percent reduction of ink waste. Teknova offers the NP series water-based flexo inks suitable for printing on HDPE, LDPE and polypropylene. These inks are compatible with all types of films used in the label industry. Teknek will present the Tek-NW3, a web cleaner designed to deliver defect-free production. Made from 70 percent recyclable aluminum, it meets the OECD Sustainable Manufacturing Framework guidelines. The Tek-NW3 incorporates the new cleaning roller guard feature, preventing the machine from running without adhesive and protecting the cleaning rollers. This helps prolong its own service life. Tecnocut presents the E-Diffsystem, an electronically adjustable anvil. Alongside, Tecnocut will also be showcasing the Pit Stop quick-change cylinder system and a waste matrix removal system. The latest model of the Label Mover unit - which moves the web by a few millimeters for more efficient waste removal - and a motorized slitting station. Tootech showcases the TTE-72FK laser label printer and its patented laser labels LSG01, LSG02, LSG04 and LSG05. The TTE-72FK can penetrate the surface layer of the label and print on the middle layer. It features powerful laser printing technology, up to 2000 DPI using vector printing technology and a scanner path algorithm for faster, more precise printing. It can connect to a user’s PC via USB. When printing, the scanner calculates the shortest path of movement for the laser. In addition, TTE-72FK is equipped with a fly marking function, where the laser follows the moving product and prints at the same time. T-Trade presents its new line of thermal transfer ribbons, the GWC, made in Italy. Toyo Ink showcases the company’s UV-LED flexo and packaging inks. Toyobo offers a wide range of film grades to support eco-friendly packaging and labeling. These include VE707 and VP001 (PET and PP high barrier retortable film), Olyester (PET-based heat sealable films), Extop (high heat resistance and high rigidity BOPP), Lesire (PET and BOPP-based laser printable film without the use of any ink), and Crisper and Kamishine (white PET films for label applications with up to 25 percent PCR recycled content). TSC Printronix introduces a range of printers including an RFID printer fleet, desktop printers and mobile printers. The RFID printer fleet, including the T6000 ODV, T4000 RFID, T8000 and T800 models, enables RFID printing to improve supply chain management. The desktop printers, including the DA-Linerless, TE, TX210 and TC models, meet a range of printing requirements. The mobile printers, including the TDM, Alpha30R and Alpha40L models, enhance productivity and flexibility with on-the-go printing. For industrial needs, the MB-Linerless printer with media and the MH model is offered. The PEX 2000 print engine with an applicator is also featured for small-scale applications. Unilux presents UniPrint, a web inspection system designed for high-quality performance and user-friendly operation. UniPrint features touch-screen operation and users can choose between a standard software package or an upgraded Pro version with advanced inspection features. Unilux also offers over 45 models of stroboscopic lights for surface inspection, ranging from portable battery-powered units to wide-area fixed-mount units. Univacco showcases its ultra-thin transfer foils, which provide unique decorative embellishments for labels. UPM Raflatac introduces materials and services for labels that enable reduction, recycling, renewal and reuse. Highlights include the Ocean Action Labels, made from ocean-bound plastic waste, and the PureCycle paper wash-off labels that cleanly separate from primary packaging in PET and HDPE recycling streams. The RAFNXT+ paper label material range is certified as carbon neutral, and the company’s linerless label materials provide a way to reduce waste. Uteco exhibits OnyxGO, a compact 8\/10-color center drum flexo machine that maximizes ergonomics and energy savings. Capable of reaching 400m\/min maximum speed, it features a range of automation features aimed at maximum reduction of material waste. Uteco also introduces the SleeveBOT, an anthropomorphic robotic arm designed to automate sleeve changes during new print setups. It can safely perform a complete sleeve change in less than 10 minutes and provides strong flexibility and repeatability of the process. UV One is showing EvoLED, a UV curing system designed for industrial printers. It offers high UV power with minimal energy consumption and can adapt to flexo and offset presses. The EvoLED system includes the EvoCure cassette, EvoPower power supply unit, EvoTouch panel and EvoChill chiller. The latest UV LED technology provides environmental and economic benefits. UV Ray unveils the PowerMaxx suite of power supplies. This line includes three versions: Pure, Hybrid and LED. These feature high energy efficiency and compact design. In addition, UV Ray will display its MaxLED lamps. These adaptable lamps are suitable for various UV applications, featuring a modular configuration and accurate power management. The lamps can switch between conventional UV and LED technology and are available in three wavelengths. Lastly, UV Ray will showcase Atom and Maxwell reflectors. These reflectors use borosilicate glass and are tested for narrow web printing applications. Vellerino introduces a heat-resistant water-based primer for flexo and offset printing. It offers temperature resistance between –18 deg C and +40 deg C. Valco Melton is featuring its Akura hot melt inspection system for label manufacturing. The system ensures uniform coating across the web width, improving product quality and reducing production errors. The Akura Solution combines this with quality assurance tools, offering real-time error detection and auto-adjustments for adhesive flow. Valco Melton will also present the BrailleChek Label vision inspection system, which uses high-speed camera technology to detect errors in Braille dot embossing on labels. Valloy unveils a white color kit for the Bizpress13R digital label press with professional rip software for color management and white conversion. The company also shows new roll and sheet-cutting devices, Duoblade WX II and DuoBlade WS. The Duoblade FX, a sheet-fed device, is also shown. VIPColor introduces VP500 and VP600 series of desktop color label printers. The VP500 series supports labels up to 8.5in wide with a 1600 x 1600 dpi and can print up to 1,200 6x4in labels in 10 minutes. The VP600 series offers faster print speeds, larger ink cartridges and water-resistant inks, ideal for labeling chilled and refrigerated products. Vicut will release a series of roll label cutters and a new model DTF cutter VFC90 with an auto-feeding conveyor table. It is compatible with Cadlink RIP software and offers cutting solutions for the DTF industry. Voyantic demonstrates Tagsurance 3, an inline quality testing system for RFID tag and label production lines. The system offers full visibility into the RF performance of labels and measures the performance of UHF and HF RFID inlays, tags and labels at different production stages. The modular system scales to various production volume needs from one to eight lanes with one to five stations per lane, handling lane speeds up to 200m\/min. Wampolet Hi-Tech Co offers 68gsm – 185gsm direct thermal face paper, 54um – 195um direct thermal face film, 54um – 195um matte synthetic paper\/quick-drying matte synthetic paper, 38\/60um pearlescent film, 50um transparent BOPP film, 40G, 50G, 57G white\/blue glassine release liner. WHEC presents the latest high speed color CIS (contact image sensor), a compact line scan camera designed for vision inspection for label, package and web. It can operate at 300x300 DPI (max 600x600 DPI) and speeds of up to 480m a min with true color reproduction. In addition to the high-speed products, WHEC also promotes a small 4-inch CIS, designed for label inspection for thermal label printers. The company showcases a wide range of CIS products with flexible design, it usually suits applications where no enough space for traditional camera systems, such as the integrated vision inspection system for digital presses and industrial label printers, being used for label and web printing quality control, color deviation verification, variable data reading and grading (1D, 2D and postal barcodes). Xeikon introduces Cheetah 3.0, a new iteration of the company’s successful Cheetah technology. Xeikon premieres its new Titon toner technology, developed for paper-based flexible packaging applications. The first press featuring Titon technology is the Xeikon TX-500, which prints in up to five colors at a resolution of 1200 dpi. The press will also be showcased running live in line with a digital embellishment module from Kurz. Xeikon also shows its food-safe Eco toner is formulated with over 60 percent high-grade recycled PET, ideal for environmentally conscious packaging. This toner will be available for the Xeikon CX300 and Xeikon CX500 presses. The company also has developed Quality Measurement Module (QMM), which ensures high-quality printing output while reducing waste. Xeikon has enhanced the capabilities of its Panther Series of inkjet presses with new PantherCure LED inks, which offer improved image quality, lower energy use and reduced ink consumption. X-Rite Pantone, in collaboration with Esko and AVT, presents an ecosystem of color measurement hardware and software. This includes the eXact 2 handheld spectrophotometer, the first color measurement instrument to use X-Rite’s patented video targeting technology. The device’s speed, 10x zoom capabilities and ease of use help printers and converters increase efficiency, reduce production time and improve color accuracy. XSYS presents products including Catena platemaking, ThermoFlexX imaging equipment, plates, sleeves and adapters. For the tag and label market, the company offers flat-top dot flexographic plates, the nyloflex FTV solvent washable plate, the nyloflex XVH thermal plate, and the nyloprint WF Sharp 80 letterpress plate. Its ThermoFlexX TFxX Imagers combined with Woodpecker Surface Screening can help increase quality and efficiency while reducing costs. YG Group brings experts in adhesive labels who will present popular products like wood-free paper labels and direct thermal labels. The company’s offerings are compatible with both inkjet and laser printers. In addition, the company’s expansive product line features adhesive papers, films, tapes and stretch films. YuanMingJie Technology presents its RDSR20 RFID label quality assurance system, which detects HF and UHF chips in finished label reels, replacing bad labels with good ones and checking for appearance defects. It can work with different thicknesses and widths of reel labels. Zeller+Gmelin presents an expanded ink product range for LED-UV applications. It has launched two new offset ink series: Uvalux U540 LED UV and Uvalux LED FCM U581 for food packaging printing. The company has also introduced Uvaflex UV-LED FCM Y581 and NON-FCM Y580, two ink series for flexographic printing, and the latest generation UV and UV-LED inkjet inks for packaging and industrial applications. Zhejiang Fulai New Materials showcases its label facestock materials such as PP\/BOPP\/PE\/PET, base film series, water-based inkjet series, UV inkjet series, direct thermal Series and Recycling series. Zhejiang TNME will be available to discuss its stamping foils.","filter_flag":1}
