{"title":"Sustainability - Kettering University","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vd3d3LmtldHRlcmluZy5lZHUvYWNhZGVtaWNzL2NvbGxlZ2UtZW5naW5lZXJpbmcvc3VzdGFpbmFiaWxpdHnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vd3d3LmtldHRlcmluZy5lZHUvYWNhZGVtaWNzL2NvbGxlZ2UtZW5naW5lZXJpbmcvc3VzdGFpbmFiaWxpdHnSAQA?oc=5","id":"CBMiRmh0dHBzOi8vd3d3LmtldHRlcmluZy5lZHUvYWNhZGVtaWNzL2NvbGxlZ2UtZW5naW5lZXJpbmcvc3VzdGFpbmFiaWxpdHnSAQA","guidislink":false,"published":"Fri, 06 Jan 2023 16:48:32 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=6, tm_hour=16, tm_min=48, tm_sec=32, tm_wday=4, tm_yday=6, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vd3d3LmtldHRlcmluZy5lZHUvYWNhZGVtaWNzL2NvbGxlZ2UtZW5naW5lZXJpbmcvc3VzdGFpbmFiaWxpdHnSAQA?oc=5\" target=\"_blank\">Sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Kettering University<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sustainability - Kettering University","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vd3d3LmtldHRlcmluZy5lZHUvYWNhZGVtaWNzL2NvbGxlZ2UtZW5naW5lZXJpbmcvc3VzdGFpbmFiaWxpdHnSAQA?oc=5\" target=\"_blank\">Sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Kettering University<\/font>","source.href":"https:\/\/www.kettering.edu","source.title":"Kettering University","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Sustainability Programs: About More Than Just Efficiency Whether it’s water conservation, pollution prevention or even plastics reduction, we often associate “sustainability” with one focus area. True sustainability encompasses multiple, intersecting efforts to preserve, reuse and even create new resources, including water, air and energy. Sustainability studies focus on how we can utilize resources and develop as businesses, organizations and even nations without depleting those resources for future generations. Sustainable Engineering: Supporting Smarter Innovation Effective sustainability prioritizes smart, regenerative use of resources. Sustainable engineering helps us move the world forward — inventing new products, creating new processes, providing housing and vehicles — with those goals at the center. In other words, sustainability engineers help us grow and innovate while ensuring that we have enough resources for future development. “Sustainability is about energy development that meets our current needs without compromising the ability of future generations to meet their own needs because of limited natural resources, mainly fossil fuels.” – Dr. Gianfranco DiGiuseppe, Kettering University Mechanical Engineering faculty member","filter_flag":1}
{"title":"Moen® Smart Sprinkler Controller Makes Outdoor Watering Routines Effortless, All From The Palm of Your Hand - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21vZW4tc21hcnQtc3ByaW5rbGVyLWNvbnRyb2xsZXItbWFrZXMtb3V0ZG9vci13YXRlcmluZy1yb3V0aW5lcy1lZmZvcnRsZXNzLWFsbC1mcm9tLXRoZS1wYWxtLW9mLXlvdXItaGFuZC0zMDE3MTMzNjUuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21vZW4tc21hcnQtc3ByaW5rbGVyLWNvbnRyb2xsZXItbWFrZXMtb3V0ZG9vci13YXRlcmluZy1yb3V0aW5lcy1lZmZvcnRsZXNzLWFsbC1mcm9tLXRoZS1wYWxtLW9mLXlvdXItaGFuZC0zMDE3MTMzNjUuaHRtbNIBAA?oc=5","id":"CBMioQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21vZW4tc21hcnQtc3ByaW5rbGVyLWNvbnRyb2xsZXItbWFrZXMtb3V0ZG9vci13YXRlcmluZy1yb3V0aW5lcy1lZmZvcnRsZXNzLWFsbC1mcm9tLXRoZS1wYWxtLW9mLXlvdXItaGFuZC0zMDE3MTMzNjUuaHRtbNIBAA","guidislink":false,"published":"Wed, 04 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=4, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=4, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21vZW4tc21hcnQtc3ByaW5rbGVyLWNvbnRyb2xsZXItbWFrZXMtb3V0ZG9vci13YXRlcmluZy1yb3V0aW5lcy1lZmZvcnRsZXNzLWFsbC1mcm9tLXRoZS1wYWxtLW9mLXlvdXItaGFuZC0zMDE3MTMzNjUuaHRtbNIBAA?oc=5\" target=\"_blank\">Moen® Smart Sprinkler Controller Makes Outdoor Watering Routines Effortless, All From The Palm of Your Hand<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Moen® Smart Sprinkler Controller Makes Outdoor Watering Routines Effortless, All From The Palm of Your Hand - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21vZW4tc21hcnQtc3ByaW5rbGVyLWNvbnRyb2xsZXItbWFrZXMtb3V0ZG9vci13YXRlcmluZy1yb3V0aW5lcy1lZmZvcnRsZXNzLWFsbC1mcm9tLXRoZS1wYWxtLW9mLXlvdXItaGFuZC0zMDE3MTMzNjUuaHRtbNIBAA?oc=5\" target=\"_blank\">Moen® Smart Sprinkler Controller Makes Outdoor Watering Routines Effortless, All From The Palm of Your Hand<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"DISCOVER A SMARTER WAY TO WATER WITH AUTOMATED WATERING ROUTINES NORTH OLMSTED, Ohio, Jan. 4, 2023 \/PRNewswire\/ -- Every lawn is unique. Its soil, the amount of sun and water it receives, the property grade and the region all have an impact on how much and how often it requires watering. Expanding its revolutionary Smart Water Network – an integrated system of products working to monitor and enhance users' experiences with water in the home while facilitating water conservation – Moen is excited to bring its smart home technology to the area of the home where water is most used* with a Smart Sprinkler Controller and Smart Wireless Soil Sensors, together a 2023 CES Innovation Award Honoree. Moen launches Smart Sprinkler Controller and Smart Wireless Soil Sensors to provide simple, intelligent and affordable control over your home’s irrigation system - all from the Moen Smart Water App. This simple, intelligent and affordable way to control a home's irrigation system is accessible from a smartphone app. With the Smart Sprinkler Controller's intelligent features, users can create custom watering schedules and control each zone independently so they can easily manage how much water each zone receives. They also can make seasonal adjustments, enable the weather-skip feature that automatically disables watering based on local weather data, and monitor both water usage and estimated savings. Moen's Smart Wireless Soil Sensors monitor precise data on zone moisture levels and are the only smart wireless soil sensors that work with the Moen Smart Sprinkler Controller. Unlike other soil sensors which require buried cables throughout the lawn, these sensors are simply inserted flush into the ground and then measure the soil moisture and temperature levels at 1-, 3- and 5-inch depths to determine if it is above or below the set thresholds. Measurements are communicated to the Moen Smart Sprinkler Controller to automatically adjust watering schedules when needed – and only in the zones required, reducing water waste and ensuring a happy, healthy lawn. \"Outdoor water use accounts for a tremendous amount of water each day, mainly for landscape irrigation,\" said Joy Trillet, associate product manager, Moen Smart Water Network. \"The Smart Sprinkler Controller and Smart Wireless Soil Sensors are an important expansion of Moen's Smart Water Network, providing users with peace of mind in knowing their outdoor irrigation system is being monitored 24\/7. In fact, the Smart Sprinkler Controller can reduce an average home's irrigation water use by up to 30 percent, saving the home up to 15,000 gallons of water annually compared to a clock-based controller – a major impact on money and water savings.**\" Both products are easy to install: the Smart Sprinkler Controller is installed in less than 30 minutes and retrofits to the existing irrigation system. The Smart Wireless Soil Sensors can be installed in under 5 minutes thanks to their sleek, wireless design and patented technology which allows them to be inserted flush into the lawn, removing the risk of damage from using lawn mowers or other yard mishaps. The Smart Sprinkler Controller is the only controller compatible with Moen's Flo Smart Water Monitor and Shutoff – a device within the Smart Water Network that connects to the home's main water line to monitor its entire water supply system for leaks and vulnerabilities. By using the Controller, the Flo Smart Water Monitor and Shutoff will now recognize users' home sprinkler as another Moen device and will not shut off the home's water due to outdoor irrigation running. With this enhancement to the Smart Water Network, homeowners now have complete control over the water inside and outside their homes when they have both the Smart Sprinkler Controller and the Flo Smart Water Monitor and Shutoff. CES 2023 Stop by booth #52026 (Venetian Expo Halls A-D) at CES 2023 from January 5-8 to experience what's new with Moen and to see the products in action. They also will be on display at CES Unveiled at Mandalay Bay on January 3. For additional information on the Moen Smart Sprinkler Controller and Smart Wireless Soil Sensors, visit moen.com. *https:\/\/www.epa.gov\/watersense\/how-we-use-water **https:\/\/www.epa.gov\/watersense\/statistics-and-facts A BOUT MOEN Moen is the #1 consumer faucet brand in North America, offering a vast array of stylish and innovative kitchen and bath faucets, showerheads, accessories, bath safety products, kitchen sinks, garbage disposals, leak detection products and connected home offerings for residential applications that give consumers more power than ever before to understand and control the water that flows through their homes. These thoughtful designs deliver an exceptional user experience and elevate the way people interact with water every day. In addition, Moen® Commercial offers superior-performing products that can deliver lower lifetime costs for today's facilities. Moen is part of Fortune Brands Innovations, Inc. (NYSE: FBIN), a brand, innovation and channel leader focused on exciting, supercharged categories in the home products, security and commercial building markets. Moen anchors Water Innovations (WINN), which also includes several brands under the House of Rohl® including Perrin & Rowe®, ROHL®, Riobel®, Shaws® and Victoria + Albert®. Fortune Brands' other brands include Fiberon® composite decking and railing products, Master Lock® and Sentry® Safe security products, LARSON® storm doors and windows and Therma-Tru® entry door systems. For more information, please visit www.FBIN.com. SOURCE Moen","filter_flag":1}
{"title":"Brands turn to traditional Chinese culture to attract young customers - China Daily","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmNoaW5hZGFpbHkuY29tLmNuL2EvMjAyMzAxLzMwL1dTNjNkNzE2ZTJhMzEwNTdjNDdlYmFiYmI4Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmNoaW5hZGFpbHkuY29tLmNuL2EvMjAyMzAxLzMwL1dTNjNkNzE2ZTJhMzEwNTdjNDdlYmFiYmI4Lmh0bWzSAQA?oc=5","id":"CBMiSWh0dHBzOi8vd3d3LmNoaW5hZGFpbHkuY29tLmNuL2EvMjAyMzAxLzMwL1dTNjNkNzE2ZTJhMzEwNTdjNDdlYmFiYmI4Lmh0bWzSAQA","guidislink":false,"published":"Mon, 30 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=30, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=30, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmNoaW5hZGFpbHkuY29tLmNuL2EvMjAyMzAxLzMwL1dTNjNkNzE2ZTJhMzEwNTdjNDdlYmFiYmI4Lmh0bWzSAQA?oc=5\" target=\"_blank\">Brands turn to traditional Chinese culture to attract young customers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">China Daily<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Brands turn to traditional Chinese culture to attract young customers - China Daily","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmNoaW5hZGFpbHkuY29tLmNuL2EvMjAyMzAxLzMwL1dTNjNkNzE2ZTJhMzEwNTdjNDdlYmFiYmI4Lmh0bWzSAQA?oc=5\" target=\"_blank\">Brands turn to traditional Chinese culture to attract young customers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">China Daily<\/font>","source.href":"https:\/\/www.chinadaily.com.cn","source.title":"China Daily","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Location Zero, a renovated store in Beijing's Dongcheng district opened by time-honored snack brand Daoxiangcun, offers traditional pastries with new twists. [Photo provided to China Daily] To celebrate the Year of the Rabbit, time-honored Beijing snack brand Daoxiangcun launched gift boxes featuring festive snacks and traditional Chinese packaging. One of the gift boxes that has been particularly popular among young customers due to its cute appearance and trendy contents, features rabbit cake with soybean cheese carrot fillings, among other items. Shi Yan, deputy general manager of Beijing Daoxiangcun, said that in addition to the brand's 200 or so regular snacks, it is creating new products to tempt the taste buds of younger shoppers, in addition to launching seasonal products such as autumn red-leaf cake. \"For those snacks that have been lost over the years, we are trying to replicate them by checking old recipe books and materials, as well as asking folklore experts about them,\" she said. \"The current Chinachic trend is not just about a cool appearance, it has to resonate with traditional Chinese culture.\" Chinese pastry brands are looking to this trend to attract young customers through inheriting traditional Chinese culture, creating stylish products, and collaborating with other domestic brands. In August 2021, Daoxiangcun launched Location Zero, a renovated store in the Chinese capital's Dongcheng district, where a variety of authentic Beijing pastries with new twists are available.","filter_flag":1}
{"title":"TOTO Roars Back to Las Vegas for KBIS 2023 with Innovative New Residential and Commercial Products and a New ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMivAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3RvdG8tcm9hcnMtYmFjay10by1sYXMtdmVnYXMtZm9yLWtiaXMtMjAyMy13aXRoLWlubm92YXRpdmUtbmV3LXJlc2lkZW50aWFsLWFuZC1jb21tZXJjaWFsLXByb2R1Y3RzLWFuZC1hLW5ldy1kZXN0aW5hdGlvbi1ib290aC1uMTUxMi0zMDE3MzQ0MjMuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMivAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3RvdG8tcm9hcnMtYmFjay10by1sYXMtdmVnYXMtZm9yLWtiaXMtMjAyMy13aXRoLWlubm92YXRpdmUtbmV3LXJlc2lkZW50aWFsLWFuZC1jb21tZXJjaWFsLXByb2R1Y3RzLWFuZC1hLW5ldy1kZXN0aW5hdGlvbi1ib290aC1uMTUxMi0zMDE3MzQ0MjMuaHRtbNIBAA?oc=5","id":"CBMivAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3RvdG8tcm9hcnMtYmFjay10by1sYXMtdmVnYXMtZm9yLWtiaXMtMjAyMy13aXRoLWlubm92YXRpdmUtbmV3LXJlc2lkZW50aWFsLWFuZC1jb21tZXJjaWFsLXByb2R1Y3RzLWFuZC1hLW5ldy1kZXN0aW5hdGlvbi1ib290aC1uMTUxMi0zMDE3MzQ0MjMuaHRtbNIBAA","guidislink":false,"published":"Tue, 31 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=31, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=31, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMivAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3RvdG8tcm9hcnMtYmFjay10by1sYXMtdmVnYXMtZm9yLWtiaXMtMjAyMy13aXRoLWlubm92YXRpdmUtbmV3LXJlc2lkZW50aWFsLWFuZC1jb21tZXJjaWFsLXByb2R1Y3RzLWFuZC1hLW5ldy1kZXN0aW5hdGlvbi1ib290aC1uMTUxMi0zMDE3MzQ0MjMuaHRtbNIBAA?oc=5\" target=\"_blank\">TOTO Roars Back to Las Vegas for KBIS 2023 with Innovative New Residential and Commercial Products and a New ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"TOTO Roars Back to Las Vegas for KBIS 2023 with Innovative New Residential and Commercial Products and a New ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMivAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3RvdG8tcm9hcnMtYmFjay10by1sYXMtdmVnYXMtZm9yLWtiaXMtMjAyMy13aXRoLWlubm92YXRpdmUtbmV3LXJlc2lkZW50aWFsLWFuZC1jb21tZXJjaWFsLXByb2R1Y3RzLWFuZC1hLW5ldy1kZXN0aW5hdGlvbi1ib290aC1uMTUxMi0zMDE3MzQ0MjMuaHRtbNIBAA?oc=5\" target=\"_blank\">TOTO Roars Back to Las Vegas for KBIS 2023 with Innovative New Residential and Commercial Products and a New ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"TOTO NEOREST Smart Bidet Toilets offer visionary technology exquisitely designed for consumers' comfort and well-being. Post this \"We are reinvigorated as we return to Las Vegas with a massive in-person experience at KBIS 2023,\" said Hidemi Ishikawa, CEO of TOTO USA. \"We are excited for visitors to experience our new KBIS booth, which highlights TOTO's leadership in revolutionary products and technologies that improve people's lives whether at home or traveling for work or play.\" He continued, \"For more than 100 years, TOTO has focused on the consumer experience in the residential bath space and public restroom, innovating, engineering, and designing high-performance, timelessly beautiful products that anticipate people's needs for beauty, comfort, and cleanliness while conserving our natural resources.\" Pure Luxury: New NEOREST® Smart Bidet Toilets TOTO's new NEOREST Smart Bidet Toilets offer visionary technology exquisitely designed for consumers' comfort and well-being. TOTO's NEOREST line is born of science and the company's belief in the importance of everyday wellness to rejuvenate consumers' bodies and minds. With its new NEOREST LS, NEOREST AS, and NEOREST RS Smart Bidet Toilets, TOTO brings a new form of pure luxury to life. New NEOREST LS Smart Bidet Toilet Winner of two highly coveted international design awards – the Red Dot Design Award and iF Design Award – TOTO's new NEOREST LS expands the NEOREST line of premium smart bidet toilets. NEOREST LS is designed to focus on elegance and comfort, creating a bath environment with hotel-like luxury and spa-like features. The NEOREST LS offers a new design, which provides a modern yet classic aesthetic that fits both modern and traditional bathroom interior design. The new NEOREST LS adds a bit of fun glamour with a new wave-inspired design accentuated by new metallic decorative trim and matching remote control. With options that include silver, nickel, and black, the NEOREST LS allows consumers and designers to express themselves by coordinating with other elements in their bath, such as faucets and paper holders, to bring a sense of unity and harmony to the bathroom's interior design. The NEOREST LS's stick-style remote control has a simple, sophisticated design that evokes a sense of luxury. It matches beautifully with the metallic accents on the smart toilet's body. The full-skirted design offers a clean look reinforcing TOTO's promise of luxury and quality while making maintenance a breeze. New NEOREST AS Smart Bidet Toilet TOTO's new NEOREST AS Smart Bidet Toilet is a prestigious iF Design Award winner. The NEOREST AS offers an elegant linear design to accentuate any bath space with its classic, clean lines. Its sophisticated silhouette with a full-cover lid and precise design lines provides a distinctive, dignified presence. With its sleek, modern design, the NEOREST AS blends seamlessly with a variety of bathroom styles, elevating their aesthetic. Its sense of luxury is underscored by its chic stick-style remote control. NEOREST RS Smart Bidet Toilet The new NEOREST RS Smart Bidet Toilet's design focuses on elegant simplicity and a gently rounded aesthetic. Winner of the celebrated Red Dot Design Award, its soft, gentle curves give this sophisticated, clean-line design a sense of refinement and unobtrusive familiarity. In addition, the new NEOREST RS offers a handsome new white, ergonomic block-style remote control design with an illuminated touchpad to personalize consumers' experience. New NEOREST Advanced Cleaning Technology: EWATER+® for the Bidet Seat's Underside Among their numerous advanced technologies, the NEOREST LS, NEOREST AS, and updated NEOREST NX provide EWATER+ for the bidet seat's underside. After use, EWATER+ automatically sprays the NEOREST's under-seat front to prevent waste accumulation and stubborn yellow stains, reducing the need for harsh cleaning chemicals, which benefits the environment. CLEAN SYNERGY With the need for cleanliness and hygiene at the forefront of consumers' minds, TOTO's new NEOREST Smart Bidet Toilets offer advanced cleaning technologies that work synergistically to keep the toilet bowl fresh and clean at all times: PREMIST ® : The bowl's interior is sprayed with a fine water mist to reduce waste's ability to stick to its surface, which results in a better clean with every flush. : The bowl's interior is sprayed with a fine water mist to reduce waste's ability to stick to its surface, which results in a better clean with every flush. CEFIONTECT ® : TOTO's super-smooth, nano-technology glaze seals the porcelain with an ionized barrier, creating a super-slippery, non-porous surface that leaves waste nowhere to cling. : TOTO's super-smooth, nano-technology glaze seals the porcelain with an ionized barrier, creating a super-slippery, non-porous surface that leaves waste nowhere to cling. TORNADO FLUSH ® SYSTEM : The rimless bowl design and 2.5-diameter trapway use 100% of the water to remove waste effectively and clean every inch of the bowl and rim. TOTO's TORNADO FLUSH system optimizes water conservation (1.28 or 1.0 gallons per flush) while setting a high bar in quiet world-class flushing performance. : The rimless bowl design and 2.5-diameter trapway use 100% of the water to remove waste effectively and clean every inch of the bowl and rim. TOTO's TORNADO FLUSH system optimizes water conservation (1.28 or 1.0 gallons per flush) while setting a high bar in quiet world-class flushing performance. EWATER+: The cleanliness of the bowl's surface, the interior and exterior of the WASHLET and NEOREST bidet wands, and the new NEOREST seat's underside are ensured by automatically misting them with electrolyzed water, a well-known cleaning agent, which reduces the need for harsh cleaning chemicals, which benefits the planet. Electrolyzed water is produced by electrolysis of the chloride ions in ordinary tap water. It is completely free of added chemicals and harsh cleaning agents. Over time, EWATER+ returns to its original state as regular tap water. New GB Shower Series Rain Showers TOTO introduces two new overhead rain shower designs to its GB Shower Series – square and round. The GB Shower Series Square Rain Shower measures 10 inches and is available with water-conserving flow rates of 1.75 GPM or 2.5 GPM. The GB Shower Series Round Rain Shower is available in designs that measure 10 inches or 12 inches. It flows at an eco-friendly 1.75 GPM or 2.5 GPM. TOTO's new GB Shower Series Rain Showers offer its COMFORT WAVE® water technology, which uses a unique nozzle design to add larger drops of water to the shower for a comfortable experience with just the right amount of stimulation. As a result, bathers feel as if they are encased in far more water than they are actually using. This makes their shower experience extremely pleasurable as it honors our water supply by reducing consumption. New GB Shower Series Body Spray with New Water Technology TOTO's new GB Shower Series Round Body Spray measures four inches in diameter and flows at a water-saving 1.5 GPM. It features two TOTO water technologies for the ideal showering experience. The new INTENSE WAVE® provides a more vigorous shower experience. Ideal for relaxing tired muscles or kickstarting your day, while COMFORT WAVE promotes recovery and regeneration any time of day. Switching from one mode to the other is easy; simply rotate the body spray's interior from right to left using the handy grip. New Commercial Toilet with TORNADO FLUSH TOTO's revolutionary new commercial toilet features its market-leading TORNADO FLUSH system, which provides a powerful nozzle to create 360 degrees of centrifugal, cyclonic rinsing action that reduces waste buildup and keeps the bowl cleaner as it effectively removes waste completely. TOTO's new commercial toilet is available in wall-mount and floor-mount models. Using only 1.0 or 1.28 gallons per flush (GPF), TOTO's high-efficiency TORNADO FLUSH system is more effective in one flush than most commercial toilets with multiple flushes. Its modern hole-free concave rim design means that TOTO's new high-efficiency commercial toilet performs consistently and is easy to clean. It is also available in a 1.6 GPF model. TOTO's new commercial toilet also offers CEFIONTECT, its super-smooth, nano-technology glaze that seals the porcelain with an ionized barrier, creating a super-slippery, non-porous surface that leaves waste nowhere to cling. It is also available without CEFIONTECT. Newly Improved ECOPOWER Flush Valve for Commercial Toilets TOTO has improved its touchless exposed and concealed ECOPOWER Flush Valve for commercial toilets. The new ECOPOWER Flush Valve functions effectively at 25 psi, making it ideal for buildings with lower water pressure. TOTO has also improved its sensor eye's strength and detection range. The new ECOPOWER Flush Valve's sensor eye is now 1.2 times stronger and has a broader detection range of 39-3\/8th inches. ECOPOWER technology generates electricity each time water spins a small internal turbine. This auto-generated electrical energy is stored in capacitors that power the flush valve. There is no minimum usage requirement. TOTO's ECOPOWER hydroelectric technology generates power during use. No need for hardwiring to the building's electrical system or routine battery replacement, which is costly and hazardous to the environment. About TOTO TOTO USA is headquarters for the Americas Division of the TOTO Global Group, which was established in 1917 with the founding of TOTO, Ltd., in Kitakyushu, Japan TOTO is the world's largest manufacturer of bathroom fixtures and fittings, with $5.87 billion in annual sales (April 2021 to March 2022). For more than 100 years, TOTO has been the recognized leader in innovation, technology, performance, and design with products that enhance the luxury bathroom experience. Today, the company maintains 36,853 employees in 18 countries and owns manufacturing facilities around the world in countries as diverse as Japan, Mexico, Germany, the USA, India, and China. Guided by its corporate philosophy , the TOTO Global Group strives to create a great company trusted by people worldwide, which contributes to the betterment of society. Dedicated to engineering products that respect the environment while meeting people's needs for comfort, beauty, and performance, TOTO is the sole plumbing manufacturer to maintain a research and development center devoted to universal design, advanced science, and technology. Consumers enjoy the peace of mind that comes from knowing they purchased a brand that innovates to improve people's quality of life. Winner of numerous domestic and international awards and recognitions, TOTO is the only plumbing manufacturer honored as Water Efficiency Leader by the U.S. Environmental Protection Agency. The company continues to raise industry standards and consumer expectations about what is possible in the bath space, as TOTO believes a high-quality bathroom is an experience and an everyday luxury people value and appreciate. For more information, consumers may visit www.totousa.com or call 1.888.295.8134, Option 5. Follow TOTO on Twitter ( @TOTOUSA ) and Instagram (@TOTOUSA) and become a TOTO fan on Facebook . SOURCE TOTO","filter_flag":1}
{"title":"Pure Harvest to build more indoor farms in Saudi Arabia - Verticalfarmdaily.com: global indoor farming news","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LnZlcnRpY2FsZmFybWRhaWx5LmNvbS9hcnRpY2xlLzk0OTk0NDIvcHVyZS1oYXJ2ZXN0LXRvLWJ1aWxkLW1vcmUtaW5kb29yLWZhcm1zLWluLXNhdWRpLWFyYWJpYS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LnZlcnRpY2FsZmFybWRhaWx5LmNvbS9hcnRpY2xlLzk0OTk0NDIvcHVyZS1oYXJ2ZXN0LXRvLWJ1aWxkLW1vcmUtaW5kb29yLWZhcm1zLWluLXNhdWRpLWFyYWJpYS_SAQA?oc=5","id":"CBMiamh0dHBzOi8vd3d3LnZlcnRpY2FsZmFybWRhaWx5LmNvbS9hcnRpY2xlLzk0OTk0NDIvcHVyZS1oYXJ2ZXN0LXRvLWJ1aWxkLW1vcmUtaW5kb29yLWZhcm1zLWluLXNhdWRpLWFyYWJpYS_SAQA","guidislink":false,"published":"Tue, 31 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=31, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=31, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LnZlcnRpY2FsZmFybWRhaWx5LmNvbS9hcnRpY2xlLzk0OTk0NDIvcHVyZS1oYXJ2ZXN0LXRvLWJ1aWxkLW1vcmUtaW5kb29yLWZhcm1zLWluLXNhdWRpLWFyYWJpYS_SAQA?oc=5\" target=\"_blank\">Pure Harvest to build more indoor farms in Saudi Arabia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Verticalfarmdaily.com: global indoor farming news<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Pure Harvest to build more indoor farms in Saudi Arabia - Verticalfarmdaily.com: global indoor farming news","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LnZlcnRpY2FsZmFybWRhaWx5LmNvbS9hcnRpY2xlLzk0OTk0NDIvcHVyZS1oYXJ2ZXN0LXRvLWJ1aWxkLW1vcmUtaW5kb29yLWZhcm1zLWluLXNhdWRpLWFyYWJpYS_SAQA?oc=5\" target=\"_blank\">Pure Harvest to build more indoor farms in Saudi Arabia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Verticalfarmdaily.com: global indoor farming news<\/font>","source.href":"https:\/\/www.verticalfarmdaily.com","source.title":"Verticalfarmdaily.com: global indoor farming news","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"The National Agricultural Development Company (Nadec) has partnered with Pure Harvest Smart Farms (Pure Harvest) to deliver a large-scale national food security project in the Kingdom, which aims to deliver over 27 hectares of production near term – with prospects for significant future expansions on Nadec's lands – serving KSA consumers a wide variety of locally and sustainably grown, high-quality, fresh produce year-round. Pure Harvest will design, construct and operate high-tech, climate-controlled hybrid food production systems that allow year-round production of high-quality, safe, and sustainably-grown fresh fruits & vegetables, free of pesticides, offering Saudi consumers a constant availability of high-quality fresh produce that was never before possible due to the Kingdom's challenging arid climate. Nadec will utilize its existing infrastructure, far-reaching distribution network, and trusted consumer brands to deliver its partner's fresh produce to the market. This strategic alliance is closely aligned with the Kingdom's Vision for a more self-sufficient and sustainable food system. The parties completed and commissioned their first-ever project on December 29, 2021, producing over fifteen (15) varieties of high-quality, hydroponically-grown tomatoes in an approximately 6-hectare high-tech, climate-controlled growing system in Nadec City, Haradh, KSA. This sustainable tomato production facility is fully integrated into Nadec's existing infrastructure, including its innovative 30-MW captive solar farm. The groundbreaking project produces over 5 million kilograms of locally grown tomatoes per annum, harvesting daily throughout the full year, with peak production occurring during the harsh summer months, during which local production has historically been impossible, thus contributing directly to the Kingdom's food sovereignty. This innovative project is the first of many that the partners expect to develop together, integrating the full value chain of controlled-environment agriculture (CEA) production. Pure Harvest seeks to deploy substantial production capacity over the next five (5) years in KSA, farming a wide range of crops, and Nadec will market these products to its expansive consumer base, hotels, restaurants, and catering partners. The partners share a vision to assist in the transition towards greater food security, water conservation, economic diversification, and sustainability in the Kingdom, as well as the broader GCC region. By originating large-scale, renewable energy-integrated food production infrastructure in KSA, Nadec and Pure Harvest are together making possible local-for-local high-quality, pesticide-residue free, clean, and healthy fresh fruits and vegetables production that, thanks to Pure Harvest's pioneering production technology, are \"always in season\" – proudly serving the Kingdom's citizens. Dr. Solaiman A. AlTwaijri, CEO of Nadec, stated: \"We are delighted to be partnering with Pure Harvest Smart Farms and to bring their distinctive controlled-environment agriculture (CEA) solutions and expertise to the Kingdom. Nadec has a long tradition of supplying a broad range of staple food products to both the Kingdom and the surrounding region. Moving into the supply of high-quality fresh fruits and vegetables is a natural extension of our legacy. We remain steadfast in our commitment to providing safe, secure, local food supply for our customers, and this partnership is a new opportunity for us to delight those customers while at the same time making a momentous contribution to the country's food security and water conservation objectives. Nadec is proud to promote sustainable agricultural development in the Kingdom, in accordance with the ambitious goals of the Saudi Vision 2030, as well as the clear vision of our government.\" Sky Kurtz, Founder & CEO of Pure Harvest Smart Farms, added: \"We are honored to begin this partnership with Nadec. They are a formidable incumbent food supplier with a sterling reputation and brand, sizeable landholdings and enabling infrastructure, and an experienced leadership team. We greatly benefit from Nadec's strength, and together we are pioneering a new category of fresh produce for the Saudi people – premium local. High-quality, delicious, safe, and affordable fresh produce that is always in season… offering new varieties, new products, and a fundamentally novel fresh produce experience. Our purpose at Pure Harvest is to enable positive change through smart, sustainable farming, and Nadec shares this objective. We are grateful to work with Nadec to accelerate the Kingdom's vision towards a more sustainable future.\" Compared to traditional, lower-tech farming methods, Pure Harvest's novel resource-efficient food production systems have many advantages aligned with the Kingdom's Vision 2030 mandate to conserve resources and reduce carbon emissions. Other distinctive features of its systems include the absence of soil and pesticides, as well as leveraging information technologies to make the best possible production decisions while largely automating certain agricultural processes such as irrigation, pest control, and climate management. Pure Harvest's growing systems result in very low water consumption per kilogram of production and are principally powered using Nadec's renewable energy. Further, Pure Harvest can harvest waste heat from existing fossil fuel power plants and nearby infrastructure and use this energy to offset power demands in its climate systems while consuming CO2 (a fundamental ingredient for photosynthesis) to significantly increase its productivity. Due to the use of CO2 dosing, renewable energy integration, and the project's close proximity to the Riyadh metro market – resulting in transportation-related cost and CO2 emissions savings – this farm in the Kingdom is among the most innovative and sustainable farming projects in the world. As part of their partnership, Nadec and Pure Harvest will collaborate to support existing local farmers by developing sustainable solutions that they, too can use to improve yields, to reduce water consumption, and to boost production quality.","filter_flag":1}
{"title":"G.O.A.T Brand Labs Acquires Apparel Brand Imara - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2dvYXQtYnJhbmQtbGFicy1hY3F1aXJlcy1hcHBhcmVsLWJyYW5kLWltYXJh0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2dvYXQtYnJhbmQtbGFicy1hY3F1aXJlcy1hcHBhcmVsLWJyYW5kLWltYXJh0gEA?oc=5","id":"CBMiUGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2dvYXQtYnJhbmQtbGFicy1hY3F1aXJlcy1hcHBhcmVsLWJyYW5kLWltYXJh0gEA","guidislink":false,"published":"Fri, 27 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=27, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2dvYXQtYnJhbmQtbGFicy1hY3F1aXJlcy1hcHBhcmVsLWJyYW5kLWltYXJh0gEA?oc=5\" target=\"_blank\">G.O.A.T Brand Labs Acquires Apparel Brand Imara<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"G.O.A.T Brand Labs Acquires Apparel Brand Imara - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2dvYXQtYnJhbmQtbGFicy1hY3F1aXJlcy1hcHBhcmVsLWJyYW5kLWltYXJh0gEA?oc=5\" target=\"_blank\">G.O.A.T Brand Labs Acquires Apparel Brand Imara<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Retail India News: Juicy Chemistry and Mommy Shots by Amrita Unveil 'Scars are Beautiful' In honor of Women’s Day, Juicy Chemistry and Mommy Shots by Amrita join forces for the 'Scars are Beautiful' campaign, shedding light on the beauty of postpartum bodies and stretch marks. The campaign, launched on March 5th, 2024, features 11 mothers proudly displaying their bodies and sharing their motherhood experiences to inspire other women to embrace their bodies and change societal perceptions. Era Vashishta, mother of a 2.5-year-old shares her story “ I was diagnosed with chronic PCOD when I was 28, which got me very scared as to whether or not I would ever get pregnant or have a baby. I never thought of motherhood before this. Because of the PCOD it made me want to be a mom, because I thought maybe I might not happen. After which, I became a mom and everything changed. As soon as I met my baby that’s when I knew this is someone I want to protect for the rest of my life, the love is unconditional. It was so scary and overwhelming, but once you hang on to all these feelings you wouldn’t have it any other way, I’d never not want to be a mom. My scars are my tiger stripes, because I think I draw a lot of power from them. I’m a mom and this body gave birth to a life, which is what makes me bigger, it makes me a tiger.” Megha Asher, the Co-Founder and COO of Juicy Chemistry said, “At Juicy Chemistry, we believe in promoting self-love and body positivity, and we are thrilled to partner with Mommy Shots for this unique campaign. Through this powerful photo series, we hope to inspire and empower women to embrace their bodies, and scars not just physical but emotional ones as well, and celebrate their unique journeys of motherhood. As mothers ourselves, we understand the challenges that come with motherhood and the impact it can have on a woman's body and self-perception. We hope that this campaign will help shift the narrative and encourage women to see their bodies as beautiful and strong, no matter their shape or size. Together, we can create a more inclusive and diverse representation of beauty and promote self-love and acceptance for all women.\" Amrita Samant, Founder and CEO Mommyshots said, “In my world of photography, motherhood, babies and art, creating something meaningful that helps change the world obsessed with perfection was very close to my heart. We want to redefine beauty with every line and every scar that spells resilience strength and a unique journey, we want to go beyond the surface with this campaign. They’re more than blemishes, they’re badges of honor, they are tender and timeliness. I am super proud of the 11 women who came forward to normalize what the society has for far too long considered unsightly.” Sonia Chandrakumar, one of the 11 mothers who posed and actively participated in the shoot said, “The journey of motherhood is very different for me, I had a really tough time the first 6 months. I had all kinds of nausea, I could not brush my teeth and I had a lot of body changes that took place. My husband was my greatest support because he constantly reminded me that there’s something beautiful coming out of this and if you want something beautiful in life you need to cope with the changes that take place in your body or yourself. So I kept reminding myself and dealing with the challenges. I’d describe my marks as Caleb’s wonderful art palette that I have around my stomach. I would not want to get rid of my marks, I want to keep it as a memory.” Motherhood scars, resembling intricate battle scars, symbolize the strength and resilience embedded in a woman's journey. Each mark narrates a story of endurance and courage, celebrating the remarkable strength of women. In honoring these scars, we acknowledge the transformative power of motherhood, inspiring women to embrace their bodies and celebrate their unique journeys. #scarsarebeautiful ","filter_flag":1}
{"title":"Snapdeal Witnesses 14 pc Revenue Jump in FY 22 - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3NuYXBkZWFsLXdpdG5lc3Nlcy0xNC1wYy1yZXZlbnVlLWp1bXAtZnktMjLSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3NuYXBkZWFsLXdpdG5lc3Nlcy0xNC1wYy1yZXZlbnVlLWp1bXAtZnktMjLSAQA?oc=5","id":"CBMiT2h0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3NuYXBkZWFsLXdpdG5lc3Nlcy0xNC1wYy1yZXZlbnVlLWp1bXAtZnktMjLSAQA","guidislink":false,"published":"Thu, 05 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=5, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=5, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3NuYXBkZWFsLXdpdG5lc3Nlcy0xNC1wYy1yZXZlbnVlLWp1bXAtZnktMjLSAQA?oc=5\" target=\"_blank\">Snapdeal Witnesses 14 pc Revenue Jump in FY 22<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Snapdeal Witnesses 14 pc Revenue Jump in FY 22 - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3NuYXBkZWFsLXdpdG5lc3Nlcy0xNC1wYy1yZXZlbnVlLWp1bXAtZnktMjLSAQA?oc=5\" target=\"_blank\">Snapdeal Witnesses 14 pc Revenue Jump in FY 22<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Retail India News: Juicy Chemistry and Mommy Shots by Amrita Unveil 'Scars are Beautiful' In honor of Women’s Day, Juicy Chemistry and Mommy Shots by Amrita join forces for the 'Scars are Beautiful' campaign, shedding light on the beauty of postpartum bodies and stretch marks. The campaign, launched on March 5th, 2024, features 11 mothers proudly displaying their bodies and sharing their motherhood experiences to inspire other women to embrace their bodies and change societal perceptions. Era Vashishta, mother of a 2.5-year-old shares her story “ I was diagnosed with chronic PCOD when I was 28, which got me very scared as to whether or not I would ever get pregnant or have a baby. I never thought of motherhood before this. Because of the PCOD it made me want to be a mom, because I thought maybe I might not happen. After which, I became a mom and everything changed. As soon as I met my baby that’s when I knew this is someone I want to protect for the rest of my life, the love is unconditional. It was so scary and overwhelming, but once you hang on to all these feelings you wouldn’t have it any other way, I’d never not want to be a mom. My scars are my tiger stripes, because I think I draw a lot of power from them. I’m a mom and this body gave birth to a life, which is what makes me bigger, it makes me a tiger.” Megha Asher, the Co-Founder and COO of Juicy Chemistry said, “At Juicy Chemistry, we believe in promoting self-love and body positivity, and we are thrilled to partner with Mommy Shots for this unique campaign. Through this powerful photo series, we hope to inspire and empower women to embrace their bodies, and scars not just physical but emotional ones as well, and celebrate their unique journeys of motherhood. As mothers ourselves, we understand the challenges that come with motherhood and the impact it can have on a woman's body and self-perception. We hope that this campaign will help shift the narrative and encourage women to see their bodies as beautiful and strong, no matter their shape or size. Together, we can create a more inclusive and diverse representation of beauty and promote self-love and acceptance for all women.\" Amrita Samant, Founder and CEO Mommyshots said, “In my world of photography, motherhood, babies and art, creating something meaningful that helps change the world obsessed with perfection was very close to my heart. We want to redefine beauty with every line and every scar that spells resilience strength and a unique journey, we want to go beyond the surface with this campaign. They’re more than blemishes, they’re badges of honor, they are tender and timeliness. I am super proud of the 11 women who came forward to normalize what the society has for far too long considered unsightly.” Sonia Chandrakumar, one of the 11 mothers who posed and actively participated in the shoot said, “The journey of motherhood is very different for me, I had a really tough time the first 6 months. I had all kinds of nausea, I could not brush my teeth and I had a lot of body changes that took place. My husband was my greatest support because he constantly reminded me that there’s something beautiful coming out of this and if you want something beautiful in life you need to cope with the changes that take place in your body or yourself. So I kept reminding myself and dealing with the challenges. I’d describe my marks as Caleb’s wonderful art palette that I have around my stomach. I would not want to get rid of my marks, I want to keep it as a memory.” Motherhood scars, resembling intricate battle scars, symbolize the strength and resilience embedded in a woman's journey. Each mark narrates a story of endurance and courage, celebrating the remarkable strength of women. In honoring these scars, we acknowledge the transformative power of motherhood, inspiring women to embrace their bodies and celebrate their unique journeys. #scarsarebeautiful ","filter_flag":1}
