{"title":"\"Go tech, and Beyond\": Hisense Echo Its Long-term Commitment to Global Consumers - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dvLXRlY2gtYW5kLWJleW9uZC1oaXNlbnNlLWVjaG8taXRzLWxvbmctdGVybS1jb21taXRtZW50LXRvLWdsb2JhbC1jb25zdW1lcnMtMzAxODQyMjE0Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dvLXRlY2gtYW5kLWJleW9uZC1oaXNlbnNlLWVjaG8taXRzLWxvbmctdGVybS1jb21taXRtZW50LXRvLWdsb2JhbC1jb25zdW1lcnMtMzAxODQyMjE0Lmh0bWzSAQA?oc=5","id":"CBMihAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dvLXRlY2gtYW5kLWJleW9uZC1oaXNlbnNlLWVjaG8taXRzLWxvbmctdGVybS1jb21taXRtZW50LXRvLWdsb2JhbC1jb25zdW1lcnMtMzAxODQyMjE0Lmh0bWzSAQA","guidislink":false,"published":"Mon, 05 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=156, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dvLXRlY2gtYW5kLWJleW9uZC1oaXNlbnNlLWVjaG8taXRzLWxvbmctdGVybS1jb21taXRtZW50LXRvLWdsb2JhbC1jb25zdW1lcnMtMzAxODQyMjE0Lmh0bWzSAQA?oc=5\" target=\"_blank\">\"Go tech, and Beyond\": Hisense Echo Its Long-term Commitment to Global Consumers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"\"Go tech, and Beyond\": Hisense Echo Its Long-term Commitment to Global Consumers - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dvLXRlY2gtYW5kLWJleW9uZC1oaXNlbnNlLWVjaG8taXRzLWxvbmctdGVybS1jb21taXRtZW50LXRvLWdsb2JhbC1jb25zdW1lcnMtMzAxODQyMjE0Lmh0bWzSAQA?oc=5\" target=\"_blank\">\"Go tech, and Beyond\": Hisense Echo Its Long-term Commitment to Global Consumers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Lower energy consumption\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"QINGDAO, China, June 5, 2023 \/PRNewswire\/ -- This year's World Environment Day theme focuses on solutions to plastic pollution under the campaign #BeatPlasticPollution. Hisense, the consumer technology brand and a major international provider of home appliances, strives to practice environmental protection to reflect its long-term belief in bringing people a better life together with loved ones, through its appliances with cutting-edge technologies through the story of 'Go tech, and Beyond'. Hisense's long-term commitment “Go tech, and Beyond”. Hisense not only brings people together in front of screens, but it also represents Hisense's environmental practices for a green planet. Hisense continues to put efforts behind greater supply chain management and reducing plastic usage in display products. As a result, Hisense optimized the TV cooling system and reduced the thickness of the TV back cover, saving 4,626 tons of plastic each year, which was equivalent to reducing the use of 514 million plastic bags. Following the concept of environmental protection, Hisense is constantly investing in technology innovation and designing greener products to meet consumers' various life scenarios and offer them a healthy life. For example, Hisense's refrigerators and washing machine series carry an efficient system to deliver lower energy consumption. In the meantime, its air-conditioner products with the cyclone-style cleaning system can ensure consumers breathe fresh and healthy air all the time. 'Go tech, and Beyond' presents Hisense's pursuit of providing technological innovation to millions of families globally with high-quality products and bringing excellent experiences to people's lives. Hisense is actively bringing new innovative products to enhance consumers' quality of life. Thanks to new laser and ultra-short throw projection technologies, Hisense Laser TV brings the biggest home cinema experience to consumers with more vision protection and lower energy consumption. With the arrival of summer sales and the distribution of Hisense's flagship ULED X and hero U8 TVs in Europe, consumers will now have the chance to enjoy Hisense's 'Go tech' innovation for themselves. About Hisense Hisense is a leading global home appliance and consumer electronics brand. Hisense's business covers multimedia products (with a focus on Smart TVs), home appliances, and IT intelligent information. Recently, Hisense has grown rapidly and is now operating in more than 160 countries. SOURCE Hisense","filter_flag":1}
{"title":"Vision Unleashed: Huawei Unveils Latest Innovations at MWC Shanghai 2023 - Telecom Review Africa","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy50ZWxlY29tcmV2aWV3YWZyaWNhLmNvbS9lbi9hcnRpY2xlcy9yZXBvcnRzLWFuZC1jb3ZlcmFnZS8zNTQxLXZpc2lvbi11bmxlYXNoZWQtaHVhd2VpLXVudmVpbHMtbGF0ZXN0LWlubm92YXRpb25zLWF0LW13Yy1zaGFuZ2hhaS0yMDIz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy50ZWxlY29tcmV2aWV3YWZyaWNhLmNvbS9lbi9hcnRpY2xlcy9yZXBvcnRzLWFuZC1jb3ZlcmFnZS8zNTQxLXZpc2lvbi11bmxlYXNoZWQtaHVhd2VpLXVudmVpbHMtbGF0ZXN0LWlubm92YXRpb25zLWF0LW13Yy1zaGFuZ2hhaS0yMDIz0gEA?oc=5","id":"CBMikQFodHRwczovL3d3dy50ZWxlY29tcmV2aWV3YWZyaWNhLmNvbS9lbi9hcnRpY2xlcy9yZXBvcnRzLWFuZC1jb3ZlcmFnZS8zNTQxLXZpc2lvbi11bmxlYXNoZWQtaHVhd2VpLXVudmVpbHMtbGF0ZXN0LWlubm92YXRpb25zLWF0LW13Yy1zaGFuZ2hhaS0yMDIz0gEA","guidislink":false,"published":"Thu, 29 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=180, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy50ZWxlY29tcmV2aWV3YWZyaWNhLmNvbS9lbi9hcnRpY2xlcy9yZXBvcnRzLWFuZC1jb3ZlcmFnZS8zNTQxLXZpc2lvbi11bmxlYXNoZWQtaHVhd2VpLXVudmVpbHMtbGF0ZXN0LWlubm92YXRpb25zLWF0LW13Yy1zaGFuZ2hhaS0yMDIz0gEA?oc=5\" target=\"_blank\">Vision Unleashed: Huawei Unveils Latest Innovations at MWC Shanghai 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Telecom Review Africa<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Vision Unleashed: Huawei Unveils Latest Innovations at MWC Shanghai 2023 - Telecom Review Africa","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy50ZWxlY29tcmV2aWV3YWZyaWNhLmNvbS9lbi9hcnRpY2xlcy9yZXBvcnRzLWFuZC1jb3ZlcmFnZS8zNTQxLXZpc2lvbi11bmxlYXNoZWQtaHVhd2VpLXVudmVpbHMtbGF0ZXN0LWlubm92YXRpb25zLWF0LW13Yy1zaGFuZ2hhaS0yMDIz0gEA?oc=5\" target=\"_blank\">Vision Unleashed: Huawei Unveils Latest Innovations at MWC Shanghai 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Telecom Review Africa<\/font>","source.href":"https:\/\/www.telecomreviewafrica.com","source.title":"Telecom Review Africa","query":"https:\/\/news.google.com\/rss\/search?q=\"Lower energy consumption\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Huawei, a global leader in technology and telecommunications, recently unveiled a range of cutting-edge innovations and solutions at the Mobile World Congress Shanghai 2023. These groundbreaking offerings aim to address key challenges industries face and pave the way for a more intelligent and connected world. From ultra-fast 10Gbps connectivity to intelligent network cores and energy-efficient 5G solutions, Huawei is driving digital transformation and enabling operators to unlock new possibilities. Let's delve into the highlights of Huawei's latest technological advancements and their potential impact on various sectors. The 10 Gbps revolution takes center stage as Huawei accelerates its takeoff with the launch of four F5.5G-focused Intelligent OptiX innovative practices. Richard Jin, president of the Huawei Optical Business Product Line, highlighted the wide adoption and transformative impact of Huawei's F5.5G innovations across the globe. From smart homes to small and micro enterprises, Huawei's FTTR solution enables ultra-gigabit Wi-Fi connections and app-based intelligent O&M and facilitates digital transformation. In the realm of smart manufacturing, Huawei's 50G PON technology drives efficiency and flexibility in industrial internet applications. Additionally, Huawei's Alps-WDM revolutionizes metro networks, offering higher bandwidth rates and ultra-low latency. As the era of 10Gbps approaches, Huawei encourages collaboration in embracing F5.5G for its application across the digital economy. Huawei further solidifies its commitment to intelligent networks with the release of its innovative practice, IntelligentCore. George Gao, president of the Huawei Cloud Core Network Product Line, highlighted the challenges operators face and Huawei's solution of introducing intelligence into core networks. These practices enhance voice and video services, experience differentiation and intelligent operations and maintenance. The implementation of these practices has resulted in improved user experiences, service monetization and network performance. Huawei's innovative solutions include intelligent media processing, 2D-to-3D video conversion, intelligent service awareness and proactive network risk prevention. Moving forward, Huawei plans to continue collaborating with industry partners, led by George Gao, to further enhance network intelligence and foster the growth of 5G networks. Recognizing the importance of sustainability, Huawei launched 5GigaGreen innovations at MWC Shanghai 2023, focusing on network performance and energy efficiency. The company introduced advancements in ultra-wideband, multi-antenna and equipment energy-saving technologies. These include lower energy consumption through combining bands, improved bit energy efficiency with multi-antenna configurations and intelligent strategies for energy savings at the network level. Gan Bin, vice president and chief marketing officer of Huawei Wireless Network Product Line, emphasized Huawei's commitment to continuous innovation in making 5G networks more efficient and working with industry partners to achieve this goal. In addition to these advancements, Huawei hosted a product and solution innovation event where it shared the latest practices and innovations in the data communication field through its digitally managed network solution. This initiative aims to assist carriers in transitioning from internet service providers to managed service providers, enabling them to seize opportunities in digital transformation and drive new growth. The success stories of leading carriers implementing Huawei's digitally managed network solution, including practices like Private Line + Managed Security, Private Line + Managed LAN and IP Private Line Upgrades, have resulted in enhanced B2B services, improved customer experiences and reduced service costs. These solutions have been successfully deployed in over 140 projects worldwide, underscoring Huawei's commitment to ongoing investment and collaboration for future innovations and growth. Huawei's IT Product Line President, Peter Zhou, also played a pivotal role at the event, unveiling a range of new products and solutions that address the technical challenges faced by carriers. These include container storage, AI storage and the OceanDisk Smart Disk Enclosure. These offerings cater to the needs of carriers, tackling issues such as the lack of strong multi-cloud ecosystems, the rise of generative AI apps and data resilience. Huawei showcased its solutions in three key areas: new apps, new data and new resilience, showcasing its ability to accelerate data acquisition, resolve data gravity challenges through intelligent data fabric and enhance storage resilience capabilities against human threats like ransomware. Huawei remains dedicated to collaborating with carriers to drive digital transformation and deliver innovative solutions that meet the evolving needs of the industry. In conclusion, Huawei's recent innovations and solutions unveiled at the Mobile World Congress Shanghai 2023 demonstrate their commitment to driving digital transformation, building intelligent networks and ensuring sustainability. Huawei is positioning itself as a global leader in technology and telecommunications.","filter_flag":1}
{"title":"TCL Hosts Asia-Pacific Launch to Showcase Latest Innovations Designed to Expand Imaginations and Ignite Passions - LEDinside","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3LmxlZGluc2lkZS5jb20vbmV3cy8yMDIzLzYvMjAyM18wNl8wN18wM9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3LmxlZGluc2lkZS5jb20vbmV3cy8yMDIzLzYvMjAyM18wNl8wN18wM9IBAA?oc=5","id":"CBMiM2h0dHBzOi8vd3d3LmxlZGluc2lkZS5jb20vbmV3cy8yMDIzLzYvMjAyM18wNl8wN18wM9IBAA","guidislink":false,"published":"Wed, 07 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=158, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3LmxlZGluc2lkZS5jb20vbmV3cy8yMDIzLzYvMjAyM18wNl8wN18wM9IBAA?oc=5\" target=\"_blank\">TCL Hosts Asia-Pacific Launch to Showcase Latest Innovations Designed to Expand Imaginations and Ignite Passions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">LEDinside<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"TCL Hosts Asia-Pacific Launch to Showcase Latest Innovations Designed to Expand Imaginations and Ignite Passions - LEDinside","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3LmxlZGluc2lkZS5jb20vbmV3cy8yMDIzLzYvMjAyM18wNl8wN18wM9IBAA?oc=5\" target=\"_blank\">TCL Hosts Asia-Pacific Launch to Showcase Latest Innovations Designed to Expand Imaginations and Ignite Passions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">LEDinside<\/font>","source.href":"https:\/\/www.ledinside.com","source.title":"LEDinside","query":"https:\/\/news.google.com\/rss\/search?q=\"Lower energy consumption\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"TCL reveals exciting brand updates and new product range including Mini LED QLED TVS, Soundbars, and Domestic Appliances TCL, the world's TOP 2 TV brand and TOP 1 98-inch TV brand, recently unveiled its latest multi-category products for the Asia Pacific market at an exclusive launch event in Bangkok. From stunning picture quality with its 2023 C Series Mini LED and QLED TVs, to FreshIN air conditioner and a slew of innovative and stylish appliances to enable a healthier and more convenient lifestyle, TCL’s latest product line-up underscores its commitment to bringing customers in the region the very best in technological innovation. TCL Takes the Top 2 TV Brand Position Enjoying Great Success across Asia Pacific TCL is continuing to make its mark across all corners of the globe, with a focus on the Asia Pacific region. The brand is proud to be the No. 1 TV brand in Australia, and the No. 2 TV brand in the Philippines, Myanmar and Indonesia. In other key markets, such as Thailand, TCL announced they are rapidly rising up the ranks, testament to its commitment to providing millions of APAC customers with the innovative technology solutions they deserve. Expanding Imaginations Through Innovative Display Technology – Introducing the Latest Generation of TCL Mini LED with the 2023 C Series A pioneer and a leader of Mini LED technology, TCL proudly introduced its latest generation technology to audiences in APAC. The C845 is the newest addition to TCL’s Mini LED TV line-up, with more local dimming zones at work providing infinite contrast dimensions, high efficiency and wide luminous angle Mini LEDs to achieve the highest brightness levels to date of HDR 2000 nits Available in 55’’, 65’’, 75’’, and 85’’ models and backed by AiPQ Processor 3.0, the TCL C845 delivers outstanding picture quality combined with unparalleled sound thanks to Dolby Vision IQ & Dolby Atmos. Countless Colors and Endless Entertainment with All-New C64 & C74 Series QLED TVs For gamers, TCL introduced its new TCL C74 Series available in 55”, 65” and 75” models, which combines QLED together with Full Array Local Dimming technology, 4K HDR Pro and 144Hz Motion Clarity Pro for smooth, sharp and colorful HDR picture quality. TCL also released its new TCL C64 Series, available in 43”, 50”, 55”, 65”, 75”, and 85” models. Equipped with TCL QLED technology for outstanding color expression, certified with Dolby Vision and Dolby Atmos and packed with a 120 HZ Game Accelerator. Delivering a truly immersive experience, TCL also unveiled its new 2023 S64 Series Dolby Audio Soundbars guaranteeing silky smooth audio with rich bass tones, even with the volume turned right up. Enhanced Domestic Appliances for a Healthier, More Convenient Lifestyle TCL also launched a suite of new products for the home with the aim of enabling a seamless and healthy connected lifestyle. The brand introduced its 3rd generation of TCL Air Conditioners, with its new innovative Gentle Cool and FreshIN Series which allow customers to experience more pleasant atmospheric conditions and more accurate temperature control, with the addition of improved health benefits and lower energy consumption. With sustainability in mind, TCL Refrigerators are equipped with a new Multi Air Flow system, which ensures that food is properly cooled by surrounding it with fresh air wherever it is placed, keeping it fresher for longer. In addition, Automatic Anion Release Technology (AAT) adds a special mineral material to the cabinet's interior lining, providing extra purification and anti-oxidation benefits. TCL also introduced its new P3 Series Washing Machines across Asia Pacific, rated as A-class in both energy efficiency and noise level. These products have a low environmental impact, largely thanks to TCL Brushless Digital Inverter technology which allows the washing machine’s motor to rotate at the optimum speed for the load, using less energy than conventional washing machines. Developing Sustainable Technology for People and the Planet: TCL’s Commitment As a leading consumer electronics company, TCL is committed to technology solutions which are socially responsible, have a low impact on the environment and are developed and manufactured in the most sustainable way. Igniting Passion in Sports; TCL Highlights New Sponsorships for Asia Pacific Market TCL has long been a champion of sports, making it an integral part of its global strategy as it aims to strengthen its influence around the world. In Asia Pacific, TCL announced that it is supporting several leading teams and events across the region. TCL is proud to be bringing the world's largest basketball tournament to the Philippines ahead of the forthcoming FIBA Basketball World Cup 2023, which will be hosted by multiple nations in Asia for the first time in its history. Beyond basketball, TCL has set up a number of well-established partnerships with some of the world’s leading football teams, including the Spanish and Italian national teams as well as with one of the most iconic football clubs in the world – Arsenal, who enjoy a large Asian fanbase. Catering to the needs of Aussie sports fans, TCL are also proud sponsors of the Australian Football League and the Melbourne Renegades cricket team. Through this ambitious sponsorship pipeline, TCL hopes to further demonstrate its commitment to Asia Pacific, offering customers in the region access to the latest and greatest innovations and experiences. TrendForce 2022 Mini LED New Backlight Display Trend Analysis Publication Dates: April 30 and October 31, 2022 Language: Traditional Chinese\/English Format: PDF Number of Pages: The two publications will total 120–130 pages","filter_flag":1}
