{"title":"5 Renewable Energy Companies To Support In 2023 - EARTH.ORG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiLWh0dHBzOi8vZWFydGgub3JnL3JlbmV3YWJsZS1lbmVyZ3ktY29tcGFuaWVzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiLWh0dHBzOi8vZWFydGgub3JnL3JlbmV3YWJsZS1lbmVyZ3ktY29tcGFuaWVzL9IBAA?oc=5","id":"CBMiLWh0dHBzOi8vZWFydGgub3JnL3JlbmV3YWJsZS1lbmVyZ3ktY29tcGFuaWVzL9IBAA","guidislink":false,"published":"Mon, 16 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=16, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=16, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLWh0dHBzOi8vZWFydGgub3JnL3JlbmV3YWJsZS1lbmVyZ3ktY29tcGFuaWVzL9IBAA?oc=5\" target=\"_blank\">5 Renewable Energy Companies To Support In 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EARTH.ORG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"5 Renewable Energy Companies To Support In 2023 - EARTH.ORG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLWh0dHBzOi8vZWFydGgub3JnL3JlbmV3YWJsZS1lbmVyZ3ktY29tcGFuaWVzL9IBAA?oc=5\" target=\"_blank\">5 Renewable Energy Companies To Support In 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EARTH.ORG<\/font>","source.href":"https:\/\/earth.org","source.title":"EARTH.ORG","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Companies committed to making alternative energy sources more widely available are becoming more significant and well-known as the world shifts away from fossil fuels and its reliance on fossil fuels. Whether it be in the form of solar, wind, hydroelectricity, geothermal energy, or biofuel, these businesses are not only working to reduce reliance on fossil fuels but also offer potentially promising investment possibilities. Here are 5 renewable energy companies to look out for in 2023. — The market for renewable energy was valued at $881.7 billion in 2020, and Allied Market Research estimates that it will nearly double in size by 2030. In addition, their analysis shows that 7% of the world’s energy needs are currently met by all renewable energy sources put together. Renewable energy sources will continue to be primarily used to produce electricity, which is anticipated to make up over 30% of the world’s electricity demand this year. The largest contribution, hydropower, is expected to account for 16% of the world’s electricity needs, followed by wind, solar, and biofuels at 6%, 4%, and 3%, respectively. You might also like: Renewables on Track to Become Largest Source of Global Electricity by 2025, IEA Says 5 Top Renewable Energy Companies To Support In 2023 1. Canadian Solar Canadian Solar Inc. is a solar energy company with headquarters in Ontario that specialises in the design, production, and sale of solar modules, inverters, system kits, and utility-level products. The company, which was founded in 2001, has subsidiaries across six continents and has active clients in over 160 nations. The business adheres to fair trade practices and neither buys conflict minerals nor uses child labor. For Canadian Solar, the well-being of its more than 13,500 workers is of utmost importance. It also takes environmental protection and conservation very seriously. In fact, the business keeps reducing the amount of water and electricity used during the production process in an effort to stop climate change. Additionally, the company incorporated the UN Sustainable Development Goals (SDGs) into its business plan by doing things like providing solar panels to a hospital in Sierra Leone. 2. Brookfield Renewable Partners L.P. (BEP) Located in Canada, Brookfield Renewable is a company that owns and manages renewable energy assets. The corporation has a global portfolio of renewable energy-generating installations. In addition to its primarily focused on hydroelectric power operations, it also owns and manages wind, solar, distributed generation, and storage facilities. Currently, the company employs more than 3,200 employees just in its renewable energy division. It is a leader in the field of renewable energy and one of the biggest producers of hydroelectricity, which accounted for 50% of the company’s portfolio in 2022. Moreover, Brookfield’s portfolio, like other companies on this list, has made significant strides in reducing its emissions. More specifically, the company is able to save about 29 million metric tonnes of CO2 emissions, equivalent to the emissions of approximately 6 million vehicles. Around 6,000 power-generating facilities with a combined capacity of about 24,000MW spread across North America, South America, Asia, India, China, and Europe are part of this renewable power business. 3. Vestas Wind Systems Vestas Wind Systems is a Denmark-based wind energy company. It creates, produces, and installs wind turbines. The business also runs a service component that offers service contracts, replacement parts, and related services. The company provides wind turbines for numerous nations across the world. By designing, producing, installing, developing, and maintaining wind energy and hybrid projects all around the world, 29,000 employees contribute to making the world a better place every single day. Their sustainable energy solutions have already prevented 1.5 billion tonnes of CO2 from being released into the environment and contributed to a more sustainable energy system, with +145GW of wind turbines installed in 85 countries. 4. Clearway Energy One of the biggest owners of renewable energy generating facilities in the US is Clearway Energy. With extremely effective natural gas-powered facilities, it complements its portfolio of wind and solar energy. Additionally, Clearway sells its power through PPAs, which give the business a consistent stream of income. In 2022, the company sold its thermal division, bringing in $1.35 billion in cash that is being reinvested in the expansion of its operations. Clearway Energy now anticipates that, as a result of its transactions, it will be able to increase its dividend toward the high end of its target range of 5 to 8% annually through at least 2026. It plans to keep up it’s good financial standing in the interim. In the upcoming years, the company is expected to further expand its activities in the renewable energy sector while also generating significant value for shareholders. 5. SolarEdge Technologies (SEDG) Last on our list of renewable energy companies is SolarEdge Technologies, an Israeli-based company founded in 2006. SEDG specialises in inverter systems for solar projects all around the world. The business has also started to develop other smart energy solutions using its experience in inverters. Through a series of acquisitions, it has increased the range of products it offers. These new products and services address a number of energy market segments, including solar, storage, electric vehicle charging, batteries, uninterruptible power supplies (UPS), electric vehicle powertrains, and grid services solutions. Although SolarEdge presently rules the solar hardware market, its future is likely to be influenced by energy storage. Developers of residential solar energy systems like SunPower, Sunrun, and Tesla are combining their energy storage systems into what are essentially power plants that can provide electricity as needed. In order to add value to all parties and establish a long-term new cash flow stream, they can charge an in-home energy storage system while power is cheap and discharge into the grid when electricity is expensive using control systems. You might also like: 4 Sustainable Aviation Fuel Companies Leading the Way to Net-Zero Flying","filter_flag":1}
{"title":"Op-ed: Keep an eye on medical technology and alternative energy sectors - CNBC","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDEvMzAva2VlcC1hLWNsb3NlLWV5ZS1vbi1tZWRpY2FsLXRlY2hub2xvZ3ktYW5kLWFsdGVybmF0aXZlLWVuZXJneS1zZWN0b3JzLmh0bWzSAW5odHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wMS8zMC9rZWVwLWEtY2xvc2UtZXllLW9uLW1lZGljYWwtdGVjaG5vbG9neS1hbmQtYWx0ZXJuYXRpdmUtZW5lcmd5LXNlY3RvcnMuaHRtbA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDEvMzAva2VlcC1hLWNsb3NlLWV5ZS1vbi1tZWRpY2FsLXRlY2hub2xvZ3ktYW5kLWFsdGVybmF0aXZlLWVuZXJneS1zZWN0b3JzLmh0bWzSAW5odHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wMS8zMC9rZWVwLWEtY2xvc2UtZXllLW9uLW1lZGljYWwtdGVjaG5vbG9neS1hbmQtYWx0ZXJuYXRpdmUtZW5lcmd5LXNlY3RvcnMuaHRtbA?oc=5","id":"CBMiamh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDEvMzAva2VlcC1hLWNsb3NlLWV5ZS1vbi1tZWRpY2FsLXRlY2hub2xvZ3ktYW5kLWFsdGVybmF0aXZlLWVuZXJneS1zZWN0b3JzLmh0bWzSAW5odHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wMS8zMC9rZWVwLWEtY2xvc2UtZXllLW9uLW1lZGljYWwtdGVjaG5vbG9neS1hbmQtYWx0ZXJuYXRpdmUtZW5lcmd5LXNlY3RvcnMuaHRtbA","guidislink":false,"published":"Mon, 30 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=30, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=30, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDEvMzAva2VlcC1hLWNsb3NlLWV5ZS1vbi1tZWRpY2FsLXRlY2hub2xvZ3ktYW5kLWFsdGVybmF0aXZlLWVuZXJneS1zZWN0b3JzLmh0bWzSAW5odHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wMS8zMC9rZWVwLWEtY2xvc2UtZXllLW9uLW1lZGljYWwtdGVjaG5vbG9neS1hbmQtYWx0ZXJuYXRpdmUtZW5lcmd5LXNlY3RvcnMuaHRtbA?oc=5\" target=\"_blank\">Op-ed: Keep an eye on medical technology and alternative energy sectors<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CNBC<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Op-ed: Keep an eye on medical technology and alternative energy sectors - CNBC","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDEvMzAva2VlcC1hLWNsb3NlLWV5ZS1vbi1tZWRpY2FsLXRlY2hub2xvZ3ktYW5kLWFsdGVybmF0aXZlLWVuZXJneS1zZWN0b3JzLmh0bWzSAW5odHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wMS8zMC9rZWVwLWEtY2xvc2UtZXllLW9uLW1lZGljYWwtdGVjaG5vbG9neS1hbmQtYWx0ZXJuYXRpdmUtZW5lcmd5LXNlY3RvcnMuaHRtbA?oc=5\" target=\"_blank\">Op-ed: Keep an eye on medical technology and alternative energy sectors<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CNBC<\/font>","source.href":"https:\/\/www.cnbc.com","source.title":"CNBC","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Dexcom's latest continuous glucose monitoring (CGM) system, to launch in February, will be 60% smaller and warm up 75% faster than previous versions such as this one, pictured on April 8, 2019. Ben Birchall - Pa Images | Pa Images | Getty Images Last year was tough for most investors. Nearly every sector suffered losses except for energy, while defense contractors and pharmaceutical companies were other examples of outliers. Fortunately, the first few weeks of 2023 have been better, thanks partly to some encouraging data showing that inflation and wage growth are beginning to decelerate. Yet, as the earnings season continues to play out and corporate layoffs pile up, questions are mounting about the strength of the U.S. economy. In addition, with policymakers devoted to keeping interest rates \"higher for longer,\" stocks could come under more pressure in the short term. Yet, at some point, the focus will shift to the future. More from Personal Finance: Almost half of Americans think we're already in a recession It's still a good time to get a job, career experts say If you want higher pay, your chances may be better now Indeed, while much of the above paints a bleak picture, the outlook is more favorable for select sectors. That includes medical technology and alternative energy, which are being propelled by some beneficial tailwinds. By contrast, one sector that traditionally holds up during challenging economic times — consumer staples — may struggle over the next few years. Let's take a closer look. Pent-up demand for medical technology During the pandemic, large swaths of technology took off. Medical technology was not one of them, with hospitals putting many elective procedures and surgeries related to non-life-threatening conditions on hold. That has created a lot of pent-up demand today. Additionally, many firms in this space could soon benefit from new products that help treat ailments, including diabetes, sleep apnea and arrhythmia, that plague millions of people. It's also worth noting that higher interest rates are less impactful for medical technology. Unlike other industries that borrow large sums to chase growth, medical technology generally isn't heavily leveraged. watch now Names worth considering include Insulet (PODD ), whose primary offering is a wearable pod that allows diabetes patients to forgo daily insulin injections. It recently cited strong demand for its newest version of that product. Dexcom (DXCM ) is another company addressing the needs of diabetes patients through a glucose-monitoring device. Its latest model, which is set to launch in February, is 60% smaller and warms up 75% faster than previous versions. In the meantime, a subsidiary of Inspire Medical Systems (INSP ), Inspire Sleep, has what could be a game-changing sleep apnea treatment. It's a small device that doctors place within the patient, a contrast to how medical professionals dealt with the issue until very recently: with a clunky, awkward and obtrusive CPAP apparatus. Government support for alternative energy grows Whether the Inflation Reduction Act will do anything to bring down costs is a matter worth debating. But less arguable is that it is the latest example of the massive amount of policy support that exists from governments around the world for green tech firms focused on producing alternative energy sources. The U.S. Department of the Treasury is still hammering out the details about who gets what. We'll likely learn more sometime during the first quarter. But make no mistake, several companies that have been surprisingly resilient during the most recent downturn will have an influx of new capital at their disposal to improve their fortunes even more. Among those that could do well are Array (ARRY ), a utility-scale solar panel producer. Also worth keeping an eye on is SolarEdge (SEDG ), which is focused more on the residential market in Europe. Consumer staples not a best bet anymore Stocks of Johnson & Johnson, Kimberly-Clarke and Procter & Gamble( — which makes many consumer staple products such as Dawn dish soap — may have hit a valuation ceiling. Joe Raedle | Getty Images News | Getty Images Last year, many investors flocked to defensive, income-paying consumer staples. And for the most part, that strategy paid off, with the Vanguard Consumer Staples ETF easily outpacing broad market indexes over the last 12 months, all while providing a dividend of about 2.4%. However, in recent months, valuations for many of these stocks have become far too rich. In fact, consumer staples are as expensive as they have ever been relative to the S&P 500 Index . Therefore, anyone investing for growth (versus dividends) should reconsider their defensive holdings. Indeed, the likes of Johnson & Johnson (JNJ ) — which makes many consumer staple products despite technically being a health-care stock — Proctor & Gamble (PG ) and Kimberly-Clarke (KMB ) have likely hit a valuation ceiling. A Warren Buffett moment?","filter_flag":1}
{"title":"'Raw Deal' takes a hard look at the state of the American meat industry - NPR","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3Lm5wci5vcmcvMjAyMy8wMS8xMS8xMTQ4MzY3NDUxL3Jhdy1kZWFsLXRha2VzLWEtaGFyZC1sb29rLWF0LXRoZS1zdGF0ZS1vZi10aGUtYW1lcmljYW4tbWVhdC1pbmR1c3RyedIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3Lm5wci5vcmcvMjAyMy8wMS8xMS8xMTQ4MzY3NDUxL3Jhdy1kZWFsLXRha2VzLWEtaGFyZC1sb29rLWF0LXRoZS1zdGF0ZS1vZi10aGUtYW1lcmljYW4tbWVhdC1pbmR1c3RyedIBAA?oc=5","id":"CBMib2h0dHBzOi8vd3d3Lm5wci5vcmcvMjAyMy8wMS8xMS8xMTQ4MzY3NDUxL3Jhdy1kZWFsLXRha2VzLWEtaGFyZC1sb29rLWF0LXRoZS1zdGF0ZS1vZi10aGUtYW1lcmljYW4tbWVhdC1pbmR1c3RyedIBAA","guidislink":false,"published":"Wed, 11 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=11, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=11, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3Lm5wci5vcmcvMjAyMy8wMS8xMS8xMTQ4MzY3NDUxL3Jhdy1kZWFsLXRha2VzLWEtaGFyZC1sb29rLWF0LXRoZS1zdGF0ZS1vZi10aGUtYW1lcmljYW4tbWVhdC1pbmR1c3RyedIBAA?oc=5\" target=\"_blank\">'Raw Deal' takes a hard look at the state of the American meat industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">NPR<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"'Raw Deal' takes a hard look at the state of the American meat industry - NPR","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3Lm5wci5vcmcvMjAyMy8wMS8xMS8xMTQ4MzY3NDUxL3Jhdy1kZWFsLXRha2VzLWEtaGFyZC1sb29rLWF0LXRoZS1zdGF0ZS1vZi10aGUtYW1lcmljYW4tbWVhdC1pbmR1c3RyedIBAA?oc=5\" target=\"_blank\">'Raw Deal' takes a hard look at the state of the American meat industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">NPR<\/font>","source.href":"https:\/\/www.npr.org","source.title":"NPR","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"'Raw Deal' takes a hard look at the state of the American meat industry TERRY GROSS, HOST: This is FRESH AIR. I'm Terry Gross. Our next interview will be of interest whether you're a meat eater, a vegetarian or a vegan. Dave Davies has this one. Here's Dave. DAVE DAVIES, HOST: Meatpacking has been the subject of journalistic exposes dating back more than a hundred years to Upton Sinclair's searing descriptions of slaughterhouses as cruel to animals and dangerous and degrading for workers. Our guest, Forbes staff writer Chloe Sorvino, says meatpacking workers today still suffer from low pay and poor working conditions, but that the American meat industry has other serious, far-reaching problems. She finds that market power in meat processing is concentrated in a handful of powerful, multinational companies and that the industry is dominated by factory farms and huge feedlots, where animals get antibiotics and consume feed grown with synthetic fertilizers and pesticides. The industry, she says, pollutes the environment, contributes to climate change and leaves the meat supply chain vulnerable to major disruptions. In a new book, she also explores meat substitutes that are gaining a following and considers whether they have the potential to change the industry and slow global warming. Chloe Sorvino leads coverage of food, drink and agriculture at Forbes. Her new book is \"Raw Deal: Hidden Corruption, Corporate Greed, And The Fight For The Future Of Meat.\" Chloe Sorvino, welcome to FRESH AIR. CHLOE SORVINO: Thank you so much for having me. DAVIES: So let's talk about some meat substitutes that are gaining some traction in the United States, you know, to give people alternatives to beef and pork. You know, Beyond Meat and Impossible Burgers are very well-known. I eat them. They deliver a terrific authentic beef taste. Does it seem that these products will get enough market share to have a real impact on climate change and these other issues? SORVINO: I really felt like I couldn't write about the wealth and power in the meatpacking industry without also talking about the challengers and how they have been trying to take a bite out of big meat. But so far, there's been billions of dollars invested and so little actual sales. The plant-based meat sales right now are still less than 1% of the total meat industry, and that's not the type of scale that's actually going to make any climate difference whatsoever. But we really don't have the time to waste. And before I delved further into the world of alternative proteins, I wanted to address if it actually really could make an environmental difference. And so the alternative milk industry actually does have roughly around 15% of the total milk industry, and so I was using that as a bit of a proxy and figured out if plant-based meat did take a share of around 15% of the total meat industry, it really would be quite significant. It would actually be the equivalent of taking a quarter of all cars off the road in the U.S. DAVIES: So if they can do as well as milk substitutes have done, it might be meaningful. You know, there's another kind of meat alternative which rests on fungi - right? - mushrooms. And you write that, I have come to see fungi as probably the strongest foundation for meatless meat. What makes you optimistic about it? SORVINO: I was growing mushrooms in my apartment in the pandemic. And loved my mushroom share. I'm a big mushroom fan. But there is also this third wave of alternative protein startups that have been trying to commercialize how to grow mostly the root stocks of fungi called mycelium. And it's created a line of new products that are starting to come out very slowly but will be emerging more and more, especially in early next year, and they take no pollution for the soil. They're not using any harshly farmed commodities, while at the same time, these products are often not having to use as much processing. Most of the alternative protein products on the market right now are often very ultra-processed, filled with additives and different ingredients. But the mycelium-based products are actually pretty much sliced and then almost use, like, a chicken breast or a slice of bacon. They take far less manipulation to taste like the meat alternatives that folks want them to taste like. DAVIES: And so where - is it a huge, you know, big kind of airplane-hangar-size room where mycelium are growing and - I mean, what does it look like? SORVINO: Yes, I toured some of these warehouses, and it was amazing to see just the scale of how big these farms can go. They're often vertical. They're very high up. There's rows and rows of trays where this rootstock has been growing. And the warehouses often take a fair amount of energy, which is one of the bigger environmental sources - very low on water, very low on other types of resources. And they take a lot of heat to make these mushrooms bloom quicker. And then you have all these different trays of mycelium and different types of fungi being taken out and sliced and then eventually put in packages and getting out to the market. DAVIES: So if you run this big operation on a coal-fired electrical utility, maybe not so good, but if you do it with sustainable energy, it's a real contribution to the environment? SORVINO: In theory. I mean, there are sustainability tradeoffs with any single type of food, any protein source. And that's why I wanted to talk about mycelium because, while it is a far better option, it's looking like, it isn't without taking up a significant amount of resources. And the founders I spoke to all talk about how they are really relying, at the end of the day, on the government electrifying the grid for their energy source. Few plants right now are using their own solar or alternative energy sources. And, you know, lab-grown meat, cultivated meat also - these plants are taking up huge amounts of energy and also really relying on the government to electrify the grid. But if that happens by 2030 - it remains to be seen - it's another way that this emerging industry is passing the costs down the line to someone else. DAVIES: You do hear that solar is a lot cheaper than it used to be. We'll see. Let me reintroduce you. We're going to take a break here. We are speaking with Chloe Sorvino. She's a staff writer at Forbes. Her new book is \"Raw Deal: Hidden Corruption, Corporate Greed, And The Fight For The Future Of Meat.\" We'll continue our conversation in just a moment. This is FRESH AIR. (SOUNDBITE OF FRANK ZAPPA'S \"UNCLE MEAT: MAIN TITLE THEME\") DAVIES: This is FRESH AIR. And we're speaking with Forbes staff writer Chloe Sorvino, whose new book examines the state of the meat industry, where she finds, after years of mergers, it's dominated by a handful of companies that rely on industrial-scale farms and control large shares of the market. Her new book is \"Raw Deal: Hidden Corruption, Corporate Greed, And The Fight For The Future Of Meat.\" I want to look at some other efforts to come up with meat substitutes that you write about. There's a startling statistic you have - Americans eat 9 billion chickens a year. I knew it was a lot. That's a lot. A lot of them are fed on corn. You write about a company called Cooks Venture that's working to raise chickens that eat more sustainable plant food. It involves actually breeding the chickens a little differently. I didn't realize, you know, chickens are bred to have certain characteristics that the growers want. What is this idea of these chickens eating different foods and bred differently? You actually tasted some of this stuff, right? SORVINO: Cooks Venture chicken tastes completely different from the chicken you find at almost any grocery store or restaurant. I really wanted to tell that story because 99% of all chicken in this country comes from just two companies. To hatch a chicken, you need genetics. And more than 50% of the market in the U.S. is controlled by Tyson and a subsidiary they have. And another 50% is owned by a German conglomerate that I write about that's been driving a lot of consolidation, rolling up pretty much every other player aside from Tyson's in the U.S. And Cooks Venture is trying to create a sustainable, pasture-raised system where these chickens are going out of their houses whenever they want, foraging through the dirt and the forests and even the different streams on this property. And they are only really able to do that and be as athletic and active because they are this different breed that Cooks Venture has been bringing back and may eventually one day start licensing to compete with everything that is out there. DAVIES: So how is it more environmentally responsible? I mean, it tastes better. That's OK. That's good. And the chickens have less miserable lives. Why is it better for the environment? SORVINO: I write about one of the pilot projects Cooks Venture has been working on to transition their chicken entirely off corn and soy, which would be huge, to actually consider how to get less reliance on feed. That's another key way to stop climate change, to really stop some of the soil erosion and water impacts that we've been talking about. But they're testing a bunch of different alternatives from sorghum to wheat. They've been working with farmers to be able to do cover-cropped wheat that they're still actually able to harvest without impacting and tilling the soil. And at the same time, then this holistic system that they're building in Arkansas has orchards that they've been rehabilitating. And the chickens then also are spreading their own manure through the soils. And these are very lively grasses, completely different from a massive feedlot chicken operation with thousands and thousands of birds forced into confinement, unable to move. DAVIES: And can they do it on a cost basis that makes their birds competitive with the stuff that people get in supermarkets? SORVINO: The birds are competitive right now. I mean, not to say that they're making huge profits yet. Industrial meat still maintains the most profits. But Cooks Venture has been raising a lot of money, and they've been spending a lot of money to try to get their marketing out there, get into different stores. You can find Cooks Venture chickens white labeled as a private label for Trader Joe's, even. They're selling at supermarkets. They're also selling online. It's around $20 a chicken. It's more expensive, but you also are getting more nutrients. You're getting higher omega-3 ratios and the bones you can use for a stock - the goodness that comes out of their bones are unlike any other bones I've seen in a commercial setting. DAVIES: You write about something else I've never heard of called air meat - air meat. This sounds pretty wild. What's the idea? SORVINO: Yeah. Lisa Dyson has been pioneering some wild research out in Silicon Valley. Air Protein is her startup, and they have been commercializing research from NASA that was originally from the 1960s that was being looked into so that astronauts could potentially create single-cell protein from the carbon dioxide that they release when they breathe up in space. Essentially, Air Protein is using fermentation to rapidly take these single-cell organisms and slapping on flavor science, doing a bit of food engineering, then creating a chicken breast out of that. DAVIES: Has this actually been done? Has a chicken breast been created from carbon dioxide in the air? SORVINO: This is one of the ones I really tried to eat because I was so curious what air meat would taste like. And it's definitely the most secretive I've encountered. There are a few investors who have tried it under lock and key. I, as a rule, as a journalist, don't sign NDAs, so I was not going to be doing that to try it, but I'm really hopeful to soon. They just raised a Series B and are getting way closer towards production. DAVIES: All right. Well, you have to tell us what that's like on a Whopper. Chloe Sorvino, thanks so much for speaking with us. SORVINO: Thank you so much for having me. GROSS: Chloe Sorvino is a Forbes staff writer. She spoke with FRESH AIR's Dave Davies. Her new book is called \"Raw Deal: Hidden Corruption, Corporate Greed And The Fight For The Future Of Meat.\" Tomorrow on FRESH AIR, we'll talk about how Israel is moving to the far right. Ultra-Orthodox and ultranationalist parties formed a coalition government with recently reelected Prime Minister Benjamin Netanyahu. What will this mean for the Palestinians, women, LGBTQ people, Russia's war in Ukraine, Iran, Israel's relationship with the U.S. and even who is defined as Jewish? Our guest will be Anshel Pfeffer, a columnist for the Israeli publication Haaretz and author of a biography of Netanyahu. I hope you'll join us. Our interviews and reviews are produced and edited by Amy Salit, Phyllis Myers, Sam Briger, Lauren Krenzel, Therese Madden, Ann Marie Baldonado, Thea Chaloner, Seth Kelley, Susan Nyakundi and Joel Wolfram. I'm Terry Gross. (SOUNDBITE OF DAVE HOLLAND AND KENNY BARRON'S \"DR. DO RIGHT\") Copyright © 2023 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information. NPR transcripts are created on a rush deadline by an NPR contractor. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","filter_flag":1}
{"title":"Protectionism, Pandemic, War, and the Future of Trade - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvcHJvdGVjdGlvbmlzbS1wYW5kZW1pYy13YXItYW5kLWZ1dHVyZS1vZi10cmFkZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvcHJvdGVjdGlvbmlzbS1wYW5kZW1pYy13YXItYW5kLWZ1dHVyZS1vZi10cmFkZdIBAA?oc=5","id":"CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvcHJvdGVjdGlvbmlzbS1wYW5kZW1pYy13YXItYW5kLWZ1dHVyZS1vZi10cmFkZdIBAA","guidislink":false,"published":"Tue, 17 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=17, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=17, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvcHJvdGVjdGlvbmlzbS1wYW5kZW1pYy13YXItYW5kLWZ1dHVyZS1vZi10cmFkZdIBAA?oc=5\" target=\"_blank\">Protectionism, Pandemic, War, and the Future of Trade<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Protectionism, Pandemic, War, and the Future of Trade - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvcHJvdGVjdGlvbmlzbS1wYW5kZW1pYy13YXItYW5kLWZ1dHVyZS1vZi10cmFkZdIBAA?oc=5\" target=\"_blank\">Protectionism, Pandemic, War, and the Future of Trade<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"A Less Friendly Trade Environment Overall, the anticipated changes will continue to dilute the economic globalization and trade opening that characterized the first three decades of the post–Cold War period (the 1990s to 2010s). By contrast, the rising trade tensions and economic nationalism that have appeared in recent years accelerated during the pandemic and are projected to persist in coloring world trade relationships over the coming decade. In this environment, corporations are diversifying their trading relationships to reduce global investment and supply chain risks. Trends in Global Trade for 2023 Nikolaus Lang The biggest shock to world trade is attributable to the military conflict in Ukraine, which will have significant economic impacts as both the EU and Russia look elsewhere to fill trade gaps created by the rupture. Over the nine years, from 2023 to 2031, the EU will increase its trade with the US by $338 billion, driven in large part by increased US energy exports to Europe, and will also see a huge expansion in combined trade with ASEAN countries, Africa, the Middle East, and India. Meanwhile, Russia’s trade with China and India will grow by $110 billion, including $90 billion with China alone. The US government’s efforts to promote domestic manufacturing and encourage companies to diversify supply chains started during the Trump Administration and are continuing under the Biden Administration, in the form of such measures as the US Inflation Reduction Act, the US-Mexico-Canada Agreement, and the US CHIPS Act, all of which aim in part to lessen the country’s trade dependence on China. The EU has likewise adopted an increasingly China-wary stance as trade and investment dynamics between the EU and China have become more challenging. An escalating wave of tit-for-tat punitive exchanges started in early 2021 with EU travel bans of Chinese trade officials in a dispute over the EU’s allegations of forced labor in Xinjiang, followed by the EU’s suspension of ratification of the EU-China Comprehensive Agreement on Investment (signed in December 2020). This was followed by the EU’s challenge in the World Trade Organization over China’s trade embargo of Lithuania after that country opened a trade promotion office in Taipei. As a result, trade growth between the EU and China is cooling, with two-way commerce forecast to grow by just $72 billion through 2031, a modest increase in comparison with growth in previous years and lower than the 2.3% average global growth forecast. One effect of slowing Western trade with both Russia and China will be a corresponding rise in commerce between northern and southern regions as countries find new trading partners in Africa, South America, and Southeast Asia. The clear winners here are the ASEAN countries, which are projected to see new commerce—especially with China, Japan, the US, and the EU—boost trade by more than $1 trillion through 2031. More broadly, the evolving trade map shows relationships coalescing around a new East versus West dynamic—a US- and EU-led community and a China-Russia counterpart—along with the potential emergence of a third bloc of ostensibly neutral nations. In a modern echo of the Nonaligned Movement of Cold War days, this group of mostly developing-world countries—including Indonesia and other ASEAN countries, India, Brazil, and African nations such as South Africa—will find opportunities to expand trade by stepping into trade vacuums created by relationship breakups elsewhere. Certain industries will feel the global disruptions more keenly than others, with energy being the most heavily impacted sector due to the West’s phasing out of Russian oil and gas and the scramble to replace Russia as an energy source. Pressure on organizations to improve sustainability and increase use of alternative energy sources will also continue to affect corporate energy strategies and operations worldwide. Meanwhile, industries with intricate global supply chains—such as semiconductors, automobiles, and consumer electronics—will also face difficult transformations as companies take steps to improve resilience and reduce their reliance on China manufacturing. Preparing for Risks in a Challenging Landscape The comparatively secure trade environment that enabled companies to develop extensive world supply networks over the past 30 years has given way to a more uncertain one that will demand a new balance between the traditional objectives of efficiency and lower costs on the one hand and a heightened awareness of global risks and the steps needed to mitigate them on the other. Recent global trade patterns provide clear evidence that many organizations are already prioritizing supply chain resilience and global diversification. In the short term, companies should take several actions to adapt to the evolving global economic situation: Evaluate opportunities in the value chain to improve responsiveness. Prioritize steps to increase resilience such as building up buffer inventories of essential commodities and prequalifying alternative suppliers. Plan contingencies for at-risk supply inputs identified in value chains. For example, companies can fund R&D to identify alternatives for rare minerals, or they can develop supplier relationships in different global regions. In the long term, companies should pursue a number of additional objectives: ","filter_flag":1}
{"title":"Feeds for horses with ulcers – what are your options? - Horse & Hound","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmhvcnNlYW5kaG91bmQuY28udWsvYnV5ZXJzLWd1aWRlcy8xOS1mZWVkcy1zdWl0YWJsZS1mb3ItaG9yc2VzLXByb25lLXRvLWdhc3RyaWMtdWxjZXJzLTgwNzUyMdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmhvcnNlYW5kaG91bmQuY28udWsvYnV5ZXJzLWd1aWRlcy8xOS1mZWVkcy1zdWl0YWJsZS1mb3ItaG9yc2VzLXByb25lLXRvLWdhc3RyaWMtdWxjZXJzLTgwNzUyMdIBAA?oc=5","id":"CBMiaWh0dHBzOi8vd3d3LmhvcnNlYW5kaG91bmQuY28udWsvYnV5ZXJzLWd1aWRlcy8xOS1mZWVkcy1zdWl0YWJsZS1mb3ItaG9yc2VzLXByb25lLXRvLWdhc3RyaWMtdWxjZXJzLTgwNzUyMdIBAA","guidislink":false,"published":"Wed, 04 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=4, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=4, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmhvcnNlYW5kaG91bmQuY28udWsvYnV5ZXJzLWd1aWRlcy8xOS1mZWVkcy1zdWl0YWJsZS1mb3ItaG9yc2VzLXByb25lLXRvLWdhc3RyaWMtdWxjZXJzLTgwNzUyMdIBAA?oc=5\" target=\"_blank\">Feeds for horses with ulcers – what are your options?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Horse & Hound<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Feeds for horses with ulcers – what are your options? - Horse & Hound","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmhvcnNlYW5kaG91bmQuY28udWsvYnV5ZXJzLWd1aWRlcy8xOS1mZWVkcy1zdWl0YWJsZS1mb3ItaG9yc2VzLXByb25lLXRvLWdhc3RyaWMtdWxjZXJzLTgwNzUyMdIBAA?oc=5\" target=\"_blank\">Feeds for horses with ulcers – what are your options?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Horse & Hound<\/font>","source.href":"https:\/\/www.horseandhound.co.uk","source.title":"Horse & Hound","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-01-01+before:2023-01-31","text":" Horse & Hound is supported by its audience. When you purchase through links on our site, we may earn commission on some of the items you choose to buy. Learn more Equine Gastric Ulcer Syndrome (EGUS) isn’t just a problem for performance horses – it can affect any breed or any age – and there are increasing numbers of leisure horses and ponies being identified as, or suspected of, suffering from the condition. This is especially true for horses or ponies whose forage intake is restricted, perhaps due to poor grazing or in efforts to reduce calorie intake. Feeding a horse with gastric ulcers in the right way is key for their health and comfort. It is important that they chew regularly, which produces saliva that helps to neutralise this acid – without frequent intakes of forage, the acidity increases and the horse is at a greater risk of developing ulcers. This increase in acidity is what gastric supplements for horses aim to buffer. Lengthy periods without access to forage can leave the stomach walls vulnerable to acid attack, so calorie control should not come at the expense of fibre or other essential nutrients. A horse with diagnosed or suspected gastric ulcers should receive a high-fibre, high-forage diet that contains little or no whole cereal grains. Adding short chopped fibre, ideally containing alfalfa, to every meal is beneficial as the high protein and calcium content in alfalfa is thought to help buffer stomach acid. In addition to consuming at least 1.5% of their bodyweight a day in forage (hay, haylage or a suitable forage replacer), a feed balancer that provides a concentrated source of vitamins, minerals and quality protein is a valuable addition to the diet. If your horse requires more energy, this is best to be delivered by fats and oils rather than starch and sugars. It’s important to look for high-fibre, low-starch and low-sugar options when selecting feeds for horses with ulcers. What is the BETA EGUS Approval Mark? In 2016, the British Equestrian Trade Association launched a new feed approval mark that offers feed companies the opportunity to highlight products suitable for horses and ponies prone to, or at risk from, EGUS. It aims to make it easier for horse owners to identify feeds most suitable for horses prone to ulcers. There are many legal restrictions around how feed and supplement products can be described in relation to different ailments – in short, they can’t be linked in a way that suggests they are nutritionally beneficial. But the launch of this scheme has allowed feed manufacturers with approved products to highlight feeds (not supplements) best suited for horses and ponies prone to EGUS without breaking the rules and regulations involved in marketing equine feeds. Companies can submit products for approval, which includes the examination of ingredients, labelling, marketing claims and independent laboratory analysis. They must have, among other things, lower levels of sugar and starch than comparable products on the market. If accepted, the companies pay an annual fee to cover the cost of running the scheme and can display the logo on their packaging and marketing materials. Products can be developed that are suitable feeds for horses with gastric ulcers, but the manufacturers may choose not to enter the scheme for various reasons. We’ve rounded up a selection of feeds that have the BETA EGUS approval mark, but have also included a selection of feeds that are low in sugar and starch, and include other ingredients that support the digestive system, that are deemed suitable for horses prone to gastric ulcers or horses requiring low-starch diets. Feeds for horses and ponies prone to gastric ulcers: what are your options? Balancers suitable for horses with or prone to ulcers Spillers Ulca Balancer Bag weight: 15kg RRP: £34.99 Daily feeding rate: 500g Cost per day: £1.17 BETA Approved: Yes This multi-vitamin and mineral balancer has added pre- and probiotics to support gut health, plus pectin, lecithin, FOS and calcium for gastric support. It is a great option for balancing a fibre-based diet is a good-doer and doesn’t need a compound feed. In the UK? View now at amazon.co.uk Baileys No.19 Performance Balancer Bag weight: 20kg RRP: £34 Daily feeding rate: 500g Cost per day: £0.85 BETA Approved: Yes This low-starch (6%), low-sugar (6.5%) formulation is also low in energy, making it ideal for good-doers that don’t need the elevated calories. It includes a superior amino acid profile to help build muscle and topline, without the need for additional supplements, and contains elevated antioxidant and biotin levels to meet the highest demands. In the UK? View now at amazon.co.uk Blue Chip Ulsa-Cool Feed Balancer Bag weight: 3kg RRP: £28.90 Daily feeding rate: 100g Cost per day: £0.96 BETA Approved: No This highly nutrient-dense pelleted balancer is designed to help maintain the acid balance in the gut and formulated to be fed in small quantities alongside a fibre-based diet. It contains prebiotics, probiotics, beta glucans, marine minerals, nucleotides and antioxidants to help with the natural balance of the gut flora. Ulsa-Cool is whole grain and molasses free. In the UK? View now at amazon.co.uk, viovet.co.uk or gsequestrian.co.uk Saracen Competition-Fit Balancer Bag weight: 20kg RRP: £38 Daily feeding rate: 500g Cost per day: £0.95 BETA Approved: Yes This balancer comes in the unique form of a mix, providing a higher level of fibre and oil to support stamina, while the inclusion of micronised maize helps to increase energy when compared to traditional pelleted feed balancers. The blend of energy sources supports a controlled energy release helping to maintain a calm and trainable temperament. It contains live yeast, which supports digestibility and helps to maintain a stable gut flora in times of stress, and an acid buffer to support an optimal stomach environment and digestive function. In the UK? View now at amazon.co.uk Baileys No.14 Lo-Cal Balancer Bag weight: 20kg RRP: £32 Daily feeding rate: 500g Cost per day: £0.80 BETA Approved: Yes This balancer is designed to be fed alongside a light chaff to maximises chew time but minimise calories by supplying essential nutrients that are often lacking from soaked forage, poor\/restricted grazing and low-calorie chaffs. These nutrients include quality protein, to provide the building blocks for muscle, skin and hoof and help maintain topline, plus targeted support for gut health. It contains vitamins and minerals in proportions formulated in the same way as a broad-spectrum supplement. In the UK? View now at amazon.co.uk or ebay.co.uk Chopped fibre feeds suitable for horses with or prone to ulcers Dengie Alfa-A Oil Bag weight: 20kg RRP: £19.95 Daily feeding rate: 1.5kg Cost per day: £1.50 BETA Approved: Yes This is a high-calorie, fibre feed that’s ideal for promoting condition, coat shine and fuelling work. It’s a natural blend of pure alfalfa, which buffers acidity in the digestive tract, and rapeseed oil, that provides a comparable amount of energy to a conditioning mix\/cube, with really low levels of starch (2%) and naturally occurring sugar at (4.5%). It is free from straw, molasses and preservatives. In the UK? View now at amazon.co.uk or viovet.co.uk Dengie Performance Fibre Bag weight: 20kg RRP: £19.95 Daily feeding rate: 2.5kg (med work\/condition) Cost per day: £2.49 BETA Approved: Yes This combination of precision-dried alfalfa and grass has a high oil coating, which promotes coat shine, and a light addition of molasses and spearmint oil to encourage fussy feeders. It helps to increase chew time and support gastric health, while being naturally low in starch (1.5%) and sugar (12%), which is comparable to grass hay. In the UK? View now at amazon.co.uk Spillers Ulca Fibre Bag weight: 20kg RRP: £20.55 Daily feeding rate: 3kg Cost per day: £3.08 BETA Approved: Yes This low-starch, high-oil fibre feed that is designed to support horses prone to gastric ulcers following veterinary treatment. The short-chopped alfalfa extends eating time and provides a natural buffer to stomach acid, while the high oil content provides energy for condition and performance. It contains a full range of vitamins and minerals, including vitamin E for immune support and muscle health, plus high-quality protein to support muscle development. In the UK? View now at amazon.co.uk or ebay.co.uk Dengie Healthy Tummy Bag weight: 20kg RRP: £19.95 Daily feeding rate: 2.5kg (if used as sole feed alongside forage) Cost per day: £2.49 BETA Approved: Yes This nutritionally-balanced, high fibre feed is made from pure, chopped and pelleted alfalfa. The energy provided is comparable to a medium energy mix\/cube, with significantly lower levels of starch (2%) and naturally occurring sugar (4.5%). It contains a prebiotic formula, a high-specification of vitamins and minerals, and a blend of herbs to tempt fussy eaters. It is free from molasses, straw and preservatives. In the UK? View now at amazon.co.uk Dengie Ulser Lite Bag weight: 20kg RRP: £17.95 Daily feeding rate: Up to 2.5kg Cost per day: Up to £2.24 BETA Approved: Yes This high-fibre, low-calorie feed is made of a blend of straw, grass, alfalfa pellets and herbs, which increases chew time without adding too many additional calories. It is naturally low in starch (2%) and naturally occurring sugar (6%). It contains prebiotics and calcium for optimal digestive health, and has a light oil coating that provides slow-release energy and promotes coat shine. It is free from molasses, artificial flavours and preservatives. In the UK? View now at ebay.co.uk Spillers Alfalfa-Pro Fibre Bag weight: 20kg RRP: £17.15 Daily feeding rate: 500g Cost per day: £0.43 BETA Approved: Yes This soft, conditioning alfalfa blend with oil contains added vitamin E to balance the high oil content. In the UK? View now at amazon.co.uk or ebay.co.uk Dodson & Horrell Fibre Up Bag weight: 18kg RRP: £22.10 Daily feeding rate: 2.5kg Cost per day: £3.07 BETA Approved: No This all-in-one, fully balanced conditioning fibre feed is suitable for horses who need to build condition at any level of work, but is particularly ideal for poor-doers, those prone to ulcers, horses coming into (or back into) work, and those who need to gain condition while keeping a cool head. In the UK? View now at ebay.co.uk Blends, cubes, mixes and mashes suitable for horses with or prone to ulcers Baileys No.21 Ease & Excel Bag weight: 15kg RRP: £16 Daily feeding rate: 4kg Cost per day: £4.27 BETA Approved: Yes Ideal for promoting weight gain, maintaining condition and supporting performance in horses requiring a low starch, high specification diet. Ease & Excel is a low-starch feed that includes no micronised cereal flakes, which means the slow-release calories are provided by fibre and oil. It has a full balance of vitamins, minerals and antioxidants, and contains a bespoke blend of antacids, pre- and probiotics. In the UK? View now at amazon.co.uk or ebay.co.uk Saracen Re-Leve Cubes Bag weight: 20kg RRP: £21 Daily feeding rate: 2kg Cost per day: £2.10 BETA Approved: Yes The blackcurrant-flavoured Re-Leve cubes are a highly versatile, low-starch (9%), low-sugar (4.5%) cube is formulated specifically to help support a healthy digestive tract and maintain normal muscle function. Highly digestible super-fibres and oil are the main energy sources, making them ideal for horses prone to ulcers. The cubes are fully fortified with a full spectrum of vitamins, chelated minerals, and antioxidants, including natural vitamin E, along with a live yeast to support optimum digestive health. In the UK? View now at ebay.co.uk Baileys No.24 Ease & Excel Cubes Bag weight: 20kg RRP: £17 Daily feeding rate: 5kg Cost per day: £4.25 BETA Approved: No These cubes supply elevated levels of slow-release energy – for condition or performance – from a low-starch (8%), high-fibre (18%) formula. They are ideal for sensitive horses that require a low-starch diet, and are designed to support healthy gastric and digestive environments and muscle function. Ease & Excel is fully balanced with performance levels of vitamins and chelated minerals, plus grapeseed extract, an innovative concentrated source of natural antioxidants to support immunity and recovery. In the UK? View now at amazon.co.uk or ebay.co.uk TopSpec UlsaKind Bag weight: 20kg RRP: £19.50 Daily feeding rate: Up to 1.6kg Cost per day: Up to £1.56 BETA Approved: No TopSpec UlsaKind cubes are low in starch (7%) and formulated to provide calories for condition while being highly sympathetic to the digestive system. They contain very high levels of β-glucans, which form a gel and coat the stomach lining with a soothing film. This helps to prevent stomach acid splashing the less protected portion of the stomach. The gel also slows the rate of passage of feed through the stomach and intestines, reducing the time period that the stomach is empty. The absorption of sugar is also slowed and the glycaemic index of the feed is lowered, reducing the effect on blood sugar levels. UlsaKind is designed to be added to feed balancer or supplement and therefore, contain no added vitamins or trace-elements. In the UK? View now at amazon.co.uk or viovet.co.uk Dodson & Horrell Elite Sport Museli Bag weight: 20kg RRP: £20.80 Daily feeding rate: 2–5kg Cost per day: £2.08–5.02 BETA Approved: No This is the lowest starch (12.5%) muesli in Dodson & Horrell’s range. It provides performance level nutrition suitable for those that may be prone to gastric ulceration, as well as prebiotics, probiotics to support a healthy hindgut and nutrient uptake. In the UK? View now at amazon.co.uk Baileys Keep Calm Mash Bag weight: 20kg RRP: £16.50 Daily feeding rate: 2.5kg Cost per day: £2.06 BETA Approved: No This high fibre, non-heating, fully balanced mash is formulated to maintain condition, while helping encourage a calm temperament. It contains highly digestible super-fibres and is fortified with quality protein, vitamins and minerals, and a prebiotic, while also being low in starch (7%) and sugar (4.5%). It soaks into a mash in 10 minutes and is barley-free, with linseed for a shiny coat. It supplies slow-release energy and is suited for horses in up to medium work. In the UK? View now at ebay.co.uk Saracen Re-Leve Mix Bag weight: 20kg RRP: £22.50 Daily feeding rate: 2kg Cost per day: £2.25 BETA Approved: Yes This cereal-free, low-starch (8%), blackcurrant-flavoured mix has been specifically formulated to replace all cereal-based hard feed for working horses that react adversely to high-starch feeds or are prone to Equine Gastric Ulcer Syndrome. The use of alternative energy sources optimises power generation and recovery, providing controlled energy from highly digestible super-fibres and oils. It is fully fortified with vitamins and minerals along with elevated levels of antioxidants, such a vitamin E, to support normal muscle function and recovery. It also contains the recommended level of yeast to support the maintenance of the hindgut and stabilise the stomach pH level. In the UK? View now at amazon.co.uk or ebay.co.uk Dodson & Horrell Health Mash Bag weight: 15kg RRP: £20.63 Daily feeding rate: 500g–1kg Cost per day: £0.69–1.38 BETA Approved: No This herbal mash, which soaks in less than 10 minutes, is formulated to support immune and digestive function. It’s molasses free, low in starch and sugar, and non-heating, which makes it really versatile. It contains prebiotics, probiotics, yeast and psyllium for digestive support, antioxidants and echinacea for immune support, and mint, fennel and cinnamon. In the UK? View now at ebay.co.uk You might also be interested in: Horse & Hound magazine, out every Thursday, is packed with all the latest news and reports, as well as interviews, specials, nostalgia, vet and training advice. Find how you can enjoy the magazine delivered to your door every week, plus options to upgrade your subscription to access our online service that brings you breaking news and reports as well as other benefits.","filter_flag":1}
{"title":"Thailand Industry Outlook 2023-2025 | Bank of Ayudhya - krungsri.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmtydW5nc3JpLmNvbS9lbi9yZXNlYXJjaC9pbmR1c3RyeS9zdW1tYXJ5LW91dGxvb2svaW5kdXN0cnktb3V0bG9vay0yMDIzLTIwMjXSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmtydW5nc3JpLmNvbS9lbi9yZXNlYXJjaC9pbmR1c3RyeS9zdW1tYXJ5LW91dGxvb2svaW5kdXN0cnktb3V0bG9vay0yMDIzLTIwMjXSAQA?oc=5","id":"CBMiWGh0dHBzOi8vd3d3LmtydW5nc3JpLmNvbS9lbi9yZXNlYXJjaC9pbmR1c3RyeS9zdW1tYXJ5LW91dGxvb2svaW5kdXN0cnktb3V0bG9vay0yMDIzLTIwMjXSAQA","guidislink":false,"published":"Fri, 13 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=13, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmtydW5nc3JpLmNvbS9lbi9yZXNlYXJjaC9pbmR1c3RyeS9zdW1tYXJ5LW91dGxvb2svaW5kdXN0cnktb3V0bG9vay0yMDIzLTIwMjXSAQA?oc=5\" target=\"_blank\">Thailand Industry Outlook 2023-2025 | Bank of Ayudhya<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">krungsri.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Thailand Industry Outlook 2023-2025 | Bank of Ayudhya - krungsri.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmtydW5nc3JpLmNvbS9lbi9yZXNlYXJjaC9pbmR1c3RyeS9zdW1tYXJ5LW91dGxvb2svaW5kdXN0cnktb3V0bG9vay0yMDIzLTIwMjXSAQA?oc=5\" target=\"_blank\">Thailand Industry Outlook 2023-2025 | Bank of Ayudhya<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">krungsri.com<\/font>","source.href":"https:\/\/www.krungsri.com","source.title":"krungsri.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"2023-2025 THAILAND INDUSTRY OUTLOOK The Thailand Industry Outlook over the next 3 years (2023-2025) covers a range of factors that will have impacts on industries. Those factors include challenges and opportunities to represent the attractiveness of each industry that relies on the macroeconomic environment and sector-specific factors. The Macroeconomic environments The world economy, 2023-2025: The major economies will slow, while trends towards deglobalization are likely to gather strength.​ Economic growth is expected to slow over the next three years, dropping from 2022’s forecast of 3.2% to 2.7% in 2023 and then rebounding to around 3.0% in each of 2024 and 2025. Although the drag placed on global growth by the COVID-19 pandemic is now lifting, this has been replaced by a host of other factors, most notably the war in Ukraine and the subsequent imposition of sanctions on Russia and the accompanying energy crunch. The world economy is also battling against headwinds generated by the economic slowdown in China and the deepening and widening gulf separating China from the US. The polarization of global trade that the latter is driving is then having consequences for supply chains worldwide, and this may well accelerate trends towards deglobalization. Beyond this, this year’s spike in energy costs and the surge in inflation that the exit from the pandemic helped to usher in has pushed central banks into a dramatically more hawkish stance through 2022. In the absence of a central bank pivot, this will likely continue into 2023 and the extended pressure resulting from rapid rate hikes will multiply stresses in financial markets and add dramatically to the cost of borrowing, which will then feed through into a negative outlook for both private- and public-sector debt. Overall, the global economy is thus at risk of a severe slowdown in 2023, though the softening of demand would also help to dampen what are currently intense inflationary fires. This might then force policy makers to shift their stance as they look to head off a protracted slump, and thus a slowdown may help to open the way to a relaxation of monetary tightening in the major economies. The US economy is expected to remain sluggish over 2023-2025, with growth slowing from 1.6% in 2022 to just 1.0% in 2023 and then clawing its way back to 1.2% and 1.8% in 2024 and 2025, respectively. Alongside this, inflation has run north of 8.0% over the second and third quarters of 2022 and although it will soften, inflation will remain above the 2.0% target for the next 2 years. As such, the Fed will likely continue with its current aggressive rate rises. From a start of just 0-0.25% at the beginning of 2022, federal funds rate hit 4.25-4.5% range by the end of the 2022 and will continue on their upward track to 5.0-5.25% range by the end of 2023. This will necessarily have significant consequences for consumption and investment and, over 2023 and 2024, the employment figures. Through 2025, growth will remain somewhat underwhelming. The Fed currently sees rates dropping to 4.1% in 2024 and 3.1% in 2025 and this should help to breathe life back into the economy. Nevertheless, the policy rate will remain elevated relative to long-term rates of 2.5% and the maintenance of tight monetary policy will drag on growth. The US is thus now exposed to elevated levels of risk as a result of the scale and pace of these rate hikes, a situation that is then being worsened by intense geopolitical tensions and the polarization of the global economy. The Eurozone is entering a difficult and protracted energy crisis, and over 2023 to 2025, this will play a part in restraining average annual growth to just 1.4%, which would be a sharp turnaround on 2022’s expansion of 3.1%. This is a direct consequence of the Russia-Ukraine war, and in particular the critical shortfall in energy supplies and the need to hike rates to combat inflation. This is then holding back business investment and, as the cost of living has exploded and the burden of meeting debt repayments has worsened, household consumption has softened. Over the longer term, there is also a real risk that the energy crisis may significantly erode the competitiveness of Eurozone industries. The European Central Bank (ECB) is also expected to continue with its policy of rate hikes, with these likely reaching 2.25% by the end of 2023. Unfortunately, tightening monetary policy into the onset of an economic slowdown will pile on risk for the more fragile members of the Eurozone, most notably Greece, Italy, and Spain, although more positively, the existence of the Transmission Protection Instrument (TPI) will allow the ECB to support bond markets and this should help the continent avoid a rerun of the 2010 Eurozone crisis. Structural problems will continue to hold back the Japanese economy and following a 1.7% expansion in 2022, growth rates will slip to an average of just 1.3% over 2023-2025. Now that the country has (as of October 2022) fully reopened to overseas arrivals, a major driver of growth over the immediate future will be recovery in the tourism sector. However, overall exports will struggle in the face of the global slowdown, although the easing of supply bottlenecks in the automobile sector will help boost exports there. The recent slump in the value of the yen will also act as a stimulus in overseas markets. While the labor market has strengthened and a decision has recently been made that by the end of this year, the minimum wage will be hiked by 3.3%, the highest rate in history, the prevalence of a deflationary mindset means that consumers remain wary about their spending and as such, household consumption is depressed. Against this backdrop, officials continue to believe that recovery will remain weak and inflation will undershoot the central bank’s target. Given this, the Bank of Japan is expected to keep monetary policy loose. Thus, interest rates will remain negative and bond yield curve controls will stay in place until inflation is brought up to the long-term target of 2.0%. A broad constellation of factors will keep China’s rate of growth below its pre-COVID-19 level, and so although growth will accelerate from 2022’s 3.2% to an annual average of 4.5% over 2023-2025, this will still be significantly below the pre-pandemic average of 6-7%. Among these factors will be: the slowdown in global trade; earlier moves to suppress excessive profit taking and to weaken monopolies; the deep troubles that continue to rock the real estate sector; and longer-term demographic problems as China transitions to an aging society. Over the next 3 years, Chinese growth will largely be driven by the relaxation of pandemic controls, recovery in the labor market, government spending on infrastructure construction, government policy that aims to make China more self-sufficient by deepening and extending domestic supply chains and their connections across Chinese industry, and fiscal and monetary policy that will be targeted at the groups most affected by the pandemic and those singled out by the authorities for additional growth-related assistance. However, risks are rising rapidly from the worsening of China-Taiwan and China-US tensions, and this may lead to a much more clearly defined global polarization between the two camps. In addition to weakening global supply chains, especially those connected to technology, this would also add considerably to the risks faced both by the world economy and by financial markets. Structural changes to the world economy… long-term impacts for business and industry The world economy is increasingly dependent on the service sector, and this now has a major role to play globally in generating income and securing employment. Beyond this, services also amplify the efficiency of manufacturing industries, for example through those connected to finance, distribution, and transport. In developed economies such as the US and the UK, the service sector contributes an average of around 75% of gross domestic product (GDP) and provides over 70% of jobs. In these countries, modern services such as finance, IT, and intellectual property are major drivers heavily dependent on access to a highly skilled workforce and the application of modern technology, to generate considerable added-value to the overall service sector. By contrast and despite steadily increasing in importance, as of 2021, the service sector contributed 56.7% of Thai GDP (Figure 2) and provided 52% of jobs, leaving Thailand some distance behind the advanced economies. This is partly because the country is still dependent on traditional services such as tourism (the source of 17.8% of GDP in 2019), wholesale and retail trade, and hotels and restaurants. By contrast, high value-added modern services provide just 14.0% of Thai GDP (source: Bank of Thailand), and these are concentrated in finance and telecommunications. The COVID-19 pandemic cast a harsh and revealing light on the fragility of Thailand’s traditional services, and it is imperative that Thailand now makes a determined effort to transition to a greater reliance on modern services. This will entail a much more extended use of technology to invigorate the business ecosystem[1], and to channel growth into other services, such as medicine and healthcare, logistics, and the provision of digital content. In addition to generating greater added-value, this will also help to pave the way to the servicification of (and hence greater product differentiation within) industrial manufacturing (e.g., through the use of artificial intelligence and big data in design and consultancy), in the process helping businesses better respond to global demand. The necessity of moving in this direction is underlined by data from 2020 that show that global imports of services are concentrated heavily in the modern service segment; research and development, professional consultancy and management services, and technology and IT services accounted for 28.2% of all service imports globally. This was followed in importance by transportation (20.5%), tourism (11.6%), intellectual property (9.6%), telecommunications, computing, and information services (8.6%), finance (5.9%), insurance and pensions (4.1%), and personal, cultural and recreational services (1.7%). Moreover, broadening the range of service exports will help to reduce the economy’s exposure to the risk of over reliance on any one industry However, increasing the contribution of services to Thai GDP is likely to be a slow and drawn-out process because at present: (i) The Thai workforce is relatively unskilled with regard to technology and so there is only limited pressure to innovate, while the necessary ecosystem of research and development, incentives, qualitative data, and regulatory, technological, and financial infrastructure is largely absent; and (ii) The Thai regulatory environment is relatively restrictive with regard to foreign investment in the service sector, especially in comparison to the developed economies. Indeed, the OECD’s 2021 Services Trade Restrictiveness Index placed Thailand 49 out of the 50 countries assessed, indicating that the Thai service sector is operating with more restrictions relative to a large number of countries, and this is then adding to the barriers placed in the way of inflows of investment and technology. As such, domestic innovation and the development of new technology is restricted, and this represents a challenge for the government, businesses and industries to move forwards a service-based economy, an outcome that would help to set Thailand on the path to long-term sustainable growth. The global economy has been increasingly affected by the imposition of barriers to trade as national governments look to protect domestic markets. This process has been accelerated by the COVID-19 pandemic and at the start of the year, the outbreak of war in Ukraine, the prolongation of which is adding to the pressure to keep these barriers in place. However, trade tensions predate these more recent developments; for example, the worsening trade relations between the US and China that was seen over the years prior to the pandemic. The World Trade Organization (WTO) has said that at present, member states have in place 148 COVID-19-related barriers to trade. 82% of these restrict exports, and one result of this was a slowdown in the manufacture and global distribution of COVID vaccines and other medical supplies and equipment. In addition, 43 members of the WTO have placed a total of 71 sanctions on Russia, and 27 countries, including China, Hungary, Argentina, and Indonesia, have export restrictions in place that are targeted at maintaining domestic food security. Alongside this, environmental regulations are increasingly operating as barriers to trade, especially those that aim to reduce the release of greenhouse gases (i.e., carbon barriers to trade). One example of this is the EU’s ‘European Green Deal’. As part of this, the EU has introduced the Carbon Border Adjustment Mechanism (CBAM). When this is fully enforced in 2027, a carbon tax will be placed on specified imports to the EU, and this will affect Thai exports of steel, aluminum, and plastics. Likewise, the US Clean Competition Act (CCA) will place a carbon tax on carbon-intensive products such as fossil fuels, refined oil products, petrochemicals, fertilizers, iron and steel goods, and coal. The Thai public and private sectors will thus need to act quickly to develop technological solutions that will help to bring the carbon intensity of exports down to acceptable levels. Stakeholders should also use the BCG model to put the economy securely on the path to net zero emissions, which would then help to ensure that Thai industry travels in the same direction as its global peers. New technology is taking on an ever-more central place in the structural reform of industry as companies look to maintain and extend their competitiveness. Within the ‘new normal’, digital technology is thus becoming a core driver of the creation of added-value in the manufacturing and service sectors. This is then allowing for more sustainable growth that is built on secure global supply chains and that responds to growing interest in environmental protection, especially with regard to lowering energy consumption. Within this context, technology that will assume a particularly important role over the next three years will include the following. The Internet of Things (IoT): IoT will play a role gathering data from sensors in everything from everyday gadgets to smart factory machines, though this will be especially important in industries involved in the production of electronics, auto parts, electrical appliances, and medical equipment. In the service sector, IoT applications are being used in hotels, hospitals, and logistics operations. The increasing spread of 5G services and improved data transfer speeds is also helping IoT applications find a growing number of uses involving machine learning with a higher processing speed through sensor system. Robotics: The use of robots is increasingly widespread in the manufacturing and service sectors, in particular in the auto manufacturing, healthcare, and logistics industries, where robots’ ability to carry out precision work helps to increase safety. Fortune Business Insights estimates that the global market for robotic systems will enjoy annual growth of 10% over 2020-2028, although at present, the use of fully autonomous manufacturing robots carries a high price tag and so most industrial applications are of cobots (collaborative robots) that are deployed alongside human staff. Artificial intelligence (AI): When AI is used in industry, it is often combined with other technologies such as cloud computing and IoT for use in big data analytics in, for example, the auto and electronics industries, where AI helps to reduce waste. AI is also used in medicine to help track the spread of infections, in the real estate industry to help with the design of buildings, and in modern trade to predict trends in consumer demand. 5G technology: Commercial 5G use cases are multiplying rapidly, especially in manufacturing, agricultural, construction, and telemedicine contexts, where 5G helps with the remote control of drones and robots. Next Move Strategy Consulting estimates that the global market for 5G infrastructure will see annual growth of 66.0% over 2020-2030. Locally, the Thai government has pushed forward with the development of 5G digital infrastructure that will support cloud AI systems and metaverse platforms. This is part of the wider plan to promote investment in the new, high-tech S-curve manufacturing and service industries. Drone: Drones (remotely controlled pilotless aircraft) are reducing companies’ dependency on labor and cutting the time taken to survey land, especially in agriculture and construction, where they can be used in situations that would be dangerous for humans. Electric drones are also being used in logistics, where their ability to take off and land vertically makes deliveries easier. Currently, drone technology is being used to develop unmanned aerial vehicles in Japan, China, and Europe. Blockchain: Blockchains are a means of storing data on distributed ledgers that are accessible to those within a network and that allow for the secure and safe confirmation and recording of transactions. Blockchains are now finding uses in a wide range of industries beyond finance, especially in retail, transport, and manufacturing. National Digital Identity therefore predicts that the global blockchain industry will be worth USD 11.7 billion in 2022, increasing to USD 20.0 billion by 2024. 3D printing: Advances in 3D printing technology now allow for the rapid, low-cost design and production of a huge range of products. This is thus adding to companies’ competitiveness by providing them with the means for mass customization, which is then helping them to respond to diversifying consumer demand for attractively priced goods. 3D printing is also establishing a more central role in manufacturing supply chains in, for example, the production of auto parts, electronics equipment, medical devices, and construction materials, in the latter case for the printing of floors, walls, and roofs. Synthetic biology: The most common application of synthetic biology is in the production of new types of agricultural products that are designed to meet demand from the growing number of health-conscious consumers and elderly consumers. This includes cultured meet grown from stem cells from the target animal (e.g., from cows, chickens, pigs and tuna), and in the manufacture of plant-based meat, that is, plant products that have the taste and texture of real meat. These products reduce exposure to some of the health risks related to meat consumption and provide an alternative source of protein in the event of outbreaks of livestock disease. Global value chains are shortening as countries are moving to increase their self-reliance and to boost their capacity for domestic technological innovation. As part of this, participation in global value chains is dropping off as many developed economies try to increase the domestic production of technology-intensive intermediate goods at the expense of imports. Likewise, China is also turning away from global trade and in its place, the country is stepping up investments in developing much more comprehensive domestic manufacturing supply chains. These trends have been turbocharged by the COVID-19 pandemic and intensifying geopolitical tensions that include both the Ukraine-Russia war and the worsening relationship between the US and China over the fate of Taiwan. As a result, competition between the major powers over the development of new technology is worsening, with this particularly intense over the design and production of chips since in the digital era, these are an absolutely core upstream product. Thus, in 2022, countries have been rushing to support the development of indigenous chip industries, with the US, German and Japanese governments announcing that they would make available funding worth respectively USD 52 billion, EUR 10 billion and USD 6.8 billion to try to attract major chip manufacturers to their countries. In addition, the US has imposed restrictions on the export to China of electronic design automation (EDA) software that is used in the production of the most advanced chips. This intensifying competition between trading blocs is in turn forcing countries to become more reliant on the intra-regional sourcing of inputs, a process that became more evident in Europe and Asia over 2011-2016 (Figure 4). This is therefore another driver behind the shortening of global value chains, especially for products that depend on mid- and high-tech manufacturing processes (Figure 5). This includes electronic components, computers, and autos, but unfortunately, many developing and newly industrialized countries, including Thailand, depend on producing exactly these goods. It is therefore essential that Thai manufacturers act quickly to overhaul their operations and so ensure that they remain in a position within global supply chains that allows them to continue generating added value. Countries are moving towards regional trade agreements as globalization slows, though again, this has been accelerated significantly by the COVID-19 pandemic and the encouragement that this has given to businesses to reduce risk by sourcing inputs from manufacturers within the same region (The Future of Globalisation, the Bank of Thailand). This process has naturally increased the importance of integrating regional trade. In Thailand’s case, this includes membership of the ASEAN Free Trade Area (AFTA)[2] whose members account for 7% of the value of world trade and, more recently, membership of the Regional Comprehensive Economic Partnership (RCEP)[3], which as of 2021 includes economies that contributed a full 29% of global trade, making it the world’s biggest trading area (Figure 7), The agreement came into force on January 1, 2022, and member states are now committed to eliminating tariffs on around 90% of listed goods over the next 10-20 years, though individual timetables will vary according to each country’s readiness. Krungsri Research believes that for Thailand, participation in the RCEP agreement will be most beneficial for sales of fresh and processed fruits, sugar, fisheries products, rubber goods, tires and auto parts, plastics, chemicals, components for electrical appliances, and computers and computer parts. Over 8M22, exports from Thailand to RCEP member states had a total value of USD 103 billion (52.7% of the value of all exports over the period), which represented a rise of 7.9% YoY. Agricultural and agro-processing goods comprised the single largest share (up 10.7% YoY) followed by industrial goods and fuels (up 7.1% YoY), while Thailand’s most important RCEP export markets were South Korea, China, and Japan. At the same time, imports from RCEP countries had a total value of USD 122 billion (58.0% of all imports to Thailand by value), a rise of 13.4% YoY. Here, the most important product groups were capital goods, raw materials, and intermediate goods, for which imports rose by respectively 6.6% YoY and 13.4% YoY. China, Japan, and South Korea were the most important suppliers of these imports. However, the net impact of the tariff cuts required under the RCEP agreement may not be as dramatic as they initially appear, since Thailand has already signed free trade agreements that cover the RCEP members (Department of International Trade, August 2022). Nevertheless, over the long term, Krungsri Research believes that the RCEP agreement will help to secure Thailand’s position in regional manufacturing supply chains for industries where Thailand already has a strong market position. This will be most notable for autos and auto parts, petrochemicals and plastics, and agriculture and agro-processing.. The establishment of ESG goals is helping companies grow sustainably, though this may also put pressure on some heavy industries. Worldwide, businesses are rapidly becoming much more conscious of the need to plot a path to sustainable long-term growth, and this has then underpinned the development of the ESG movement. This covers matters relating to the environment, social issues and governance, and ESG is now being used as a tool to strategically manage risk, to assure partners and stakeholders of the security of the core business, and to guarantee safe long-term returns to investors. PwC’s 2021 Global Investor ESG Survey showed that of the 325 respondents, 79% believed that the ESG framework was an important factor influencing investment decisions. Likewise, research by Deloitte (April, 2022) based on data from the Australian stock market indicates that ESG-informed investing is positively correlated with total shareholder returns. Within this, environmental factors and especially reductions in carbon and greenhouse gases emission were the most closely correlated with investor returns, and so it is the ‘environment’ in ESG that is both the most urgent and that has the most impact on businesses. Currently, 137 countries have signed up to the UN Climate Convention and to achieving carbon neutrality as soon as they are able. Thailand is among this group, and the country has set a goal of achieving carbon neutrality by 2050 and of reaching net zero for all greenhouse gases by 2065. As part of this, Thailand has already put in place plans to encourage investment in renewables and electric vehicles. There are also plans to support businesses that will supply cost-cutting infrastructure, such as the establishment of smart industrial estates and smart logistics hubs, which will then help to underpin growth in these industries. Alongside this, though, carbon-intensive heavy industries may be adversely affected by these trends, and so businesses dealing with cement, metals (steel and aluminum), and chemical fertilizers will need to act rapidly to overhaul their operations, as they are at risk of being levied carbon tax most notably by the EU, which is introducing its carbon tax in 2023. The Thai economy, 2023-2025: The effects of the global slowdown will be countered by recovery in the tourism sector and a rebound in domestic economic activity. Over 2023-2025, Thailand is expected to enjoy growth averaging 3.5% per annum, which would represent an improvement on both 2022’s 3.2% growth (Figure 9) and the outlook for the major advanced economies. Four main factors will help to support this outlook. (i) Accelerating recovery in the tourism sector will have a positive effect on employment, although foreign arrivals are not expected to return to their pre-pandemic level until 2025. (ii) The economy will be buoyed by rising consumer confidence and the feed-through effect of this on private-sector consumption, recovery in the labor market, and stronger spending by upper-income consumers. However, spending by lower-income groups will come under pressure from a combination of the rising cost of living and the effect of interest rate rises on household debt. (iii) Private-sector investment will rebound, especially in services that will benefit from the gathering recovery in tourism and connected areas. In addition, investment will also step up in businesses working on raising their competitiveness and transitioning to the digital economy, a process that will be boosted further as the ‘bio-, circular and green’ (BCG) business model assumes a greater importance. Likewise, spending on infrastructure megaprojects will pick up, especially among those targeted at supporting the further development of the EEC, for which THB 2.2 trillion has been earmarked for spending over 2023-2027. (iv) Exports will continue to expand, although growth rates will slow from 2022 onwards as headwinds strengthen on the softening of global trade, the acceleration in deglobalization, and the worsening of international tensions. Nevertheless, a positive outlook for exports of some certain products or to specific markets will help to partially offset worsening prospects for exports elsewhere. Thus, sales into the ASEAN zone still show a healthy growth dynamic, while exports of food and agricultural products benefit from being both essential goods and of being able to fill the hole in the market generated by the Ukraine war. As for monetary policy and the fight against inflation, this is likely to remain more relaxed in Thailand than in other countries since overall growth remains weak. Given this, rate hikes will likely be only gradual and will reach just 1.75% in the first quarter of 2023. Inflation will thus remain elevated at the start of 2023 but this is now expected to drop back into the central bank’s target range during the middle of the year. External risk and the sharp tightening of monetary policy in the major economies are also likely to generate market turbulence for the baht, but foreign currency earnings in the tourism sector may help to sporadically strengthen the currency. Thailand will face a number of international challenges over the next 3 years, and factors that may drag on growth will include: stresses in global financial markets and the risk of the world economy slipping into recession; the possibility of the Chinese economy underperforming and so failing to reach its growth target; the prolongation of the Russia-Ukraine war, which may then have consequences for long-term rates of inflation; and worsening US-China relations over the fate of Taiwan. On the domestic front, the economy may be affected by political uncertainty, particularly over the 2023 election and the installation of a new government, which may then affect the continuity of economic policy. In addition, the COVID-19 pandemic has left long-term scars on the economy, most notably by worsening the financial fragility of SMEs and low-income groups. Infrastructure spending… laying the foundations for private-sector investment. In the recent past, government spending on megaprojects has helped to crowd in additional private-sector investment, but the outbreak of COVID-19 and the subsequent pandemic that disrupted the economy over 2020 and 2021 caused many public-sector projects to fall behind schedule, including work on the yellow and pink metro lines in Bangkok, which should have opened at the end of 2021 and the start of 2022 respectively. These delays were caused principally by the closure of labor camps and the severe labor shortage. In response, the government is now expected to accelerate work on major projects over 2023 to 2025, with efforts concentrated especially on phase 2 of the Eastern Economic Corridor (EEC) development (scheduled for 2023-2027). This involves a set of integrated projects that have already been included in the EEC development plans. THB 2.2 trillion has been allocated for these, which marks an increase on the THB 1.8 trillion assigned for phase 1 of the work on the EEC carried out over 2018-2022 (as of August 2022). Contracts have now been agreed for 4 megaprojects: the high-speed rail-link connecting the area’s 3 airports, redevelopment of U-Tapao Airport and development of the Eastern Aerotropolis, phase 3 of the Laem Chabang Port development, and phase 3 of the Map Ta Phut Port development. Ground should be broken on these by the end of 2022 and work will be completed from 2025 onwards. This will then help to open up new investment opportunities in the region, especially in the manufacture of electric vehicles, smart electronics and digital technology, and modern healthcare business. Beyond this, work on ongoing and new projects will be seen in other parts of the country as per the 2018 transport and communications action plan, itself part of Thailand’s 20-year transport infrastructure development strategy for 2018-2037. The majority of these projects cover the rail network, extensions to the metro system, and the national motorway system. The government now plans to speed up work on the most important of these, with attention focused on the land bridge connecting the Andaman Sea to the Gulf of Thailand. By connecting logistics networks in the EEC with the Southern Economic Corridor (SEC), the government hopes to establish the area as a marine logistics hub. Cabinet approval of the THB 1.2 trillion in funding for this is expected to be sought before the end of 2022. The business and manufacturing environment Structural problems undermining Thai competitiveness In 2022, Thailand’s position in the IMD World Competitiveness Ranking slipped sharply, with the country placed 33rd out of the 63 countries that were assessed. Thailand’s ranking worsened in all categories, though its decline was most marked with regard to ‘Economic Performance’. Here, Thailand dropped 13 places (Figure 10) as a result of the country’s having run a current account deficit for the first time in 16 years. A combination of the government’s fiscal deficit and the rising burden of public debt also pulled the country down 11 places in the ‘Government Efficiency’ category. The ‘Business Efficiency’ ranking worsened by 9 places due to Thailand’s reduced productivity and competitiveness, and the slowing growth of the workforce. Finally, Thailand dropped a single place with regard to ‘Infrastructure’ due to problems with public health and the environment. The highest ranked country overall was Denmark, which benefited from its progress on digital technology, while regional competitors improving their ranking included Singapore (up from 5th to 3rd) and the Philippines (up from 52nd to 48th). At just 1.3% of GDP, Thai investment in research and development is also somewhat low compared to competitors in Asia (Figure 11), and this remains substantially below the 2% target set for 2027. By comparison, data from UNESCO show that for upper-middle income countries like Thailand, average spending on R&D comes to 1.4% of GDP, while for developed economies, this runs to 2.4%. These figures reflect the changing economic environment and how research and innovation are assuming an ever-more central role in driving economic growth. Innovation and the adoption of new technology is thus a key factor in improving productivity and increasing added-value, and overcoming obstacles to expansion in R&D remains a major challenge to both the public and private sectors. However, successfully navigating these issues will allow the Thai economy to sustainably raise levels of competitiveness, even while the global economic environment becomes increasingly volatile and uncertain. Regulatory reforms that may have significant impacts on the economy Real estate Measures to stimulate demand from non-Thai buyers Creating new opportunities for non-Thais to own land: Foreign-owned companies that have successfully applied for a Thai investment promotion scheme and that have posted registered capital of at least THB 50 million are now able to hold the title to land for use as offices or for residential purposes, with the following conditions: (i) office sites should be no bigger than 5 rai (0.8 hectares); (ii) residential sites for executives should be no bigger than 10 rai (1.6 hectares); (iii) residential sites for workers should be no bigger than 20 rai (3.2 hectares); (iv) land used for residential and commercial purposes may also be the registered company address, though this is not necessary. These regulations came into effect on 13 June, 2022. Measures have been put in place to promote purchases of Thai properties by selected groups of non-Thais. With effect from September 1, 2022, ten-year long-term resident (LTR) visas are now available to four classes of applicants: high net worth individuals, retirees, expat workers, and designated experts. Holders of LTR visas need to report to immigration once a year but they may enter and leave the country without restriction. It is hoped that the introduction of this new category of visa will help to encourage greater activity in the housing market, especially in the condominium segment. Regulatory reform in the real estate sector The Bank of Thailand is reinstating the earlier loan-to-value (LTV) rules. The LTV rules were suspended over the period October 20, 2021, to December 31, 2022, as the authorities looked to give property sales a boost. However, the number of title deed transfers has now returned to approximately its pre-COVID level and so with recovery now largely complete, it is no longer necessary to provide additional stimulus to the market. Thus, from January 1, 2023, for properties valued at less than THB 10m bought as first homes, the minimum down payment is now 0-10% of the property’s value, with top-up loans limited to another 10% of this. For second homes, minimum down payments are 10% for loans when the initial loan is for a period of longer than 2 years and 20% when the initial loan is to be repaid over less than 2 years. For third homes, the minimum down payment is 30%. For houses priced at THB 10m and over, minimum down payments are 10%, 20%, and 30% for first, second, and third houses, respectively. The reduction of the land and building tax payment. The government will be giving discount of 15% of the total amount of land and building taxes owed in tax year 2023 (effective January 1, 2023). The reduction in property transfer and mortgage registration fees. (i) The fees for the registration of title deed transfers will be halved from 2% to 1% of the property’s value. (ii) Fees for mortgage registration will be cut from 1% of the property’s value to just 0.01%. These will be applied to properties costing less than 3 million baht, including detached houses, semi-detached houses, townhouses, commercial buildings, and condominiums (for both first and second home buyers) (with effect from January 1, 2023). Other legal reforms that are currently under review Amendments to the Condominium Act will allow foreigners to own more than 49% of the floorspace in any given condominium building, but non-Thai owners will not be permitted to vote in residents’ associations (under the 2008 Condominium Act (No. 4), non-Thai ownership of condominiums was limited to a maximum of 49% of the building’s floorspace). Manufacturing Large industrial sites (e.g., power stations with at least 10 MW of installed capacity, foundries and metal works, oil refineries, cement manufacturers, paper mills, chemical plants, incinerators, and glass manufacturers) will have to have continuous emission monitoring systems (CEMSes) installed on site from June 10, 2023, onwards. As such, all newly constructed sites will have to have these systems installed and operating before they come into service, while pre-existing sites will need to complete installation by June 9, 2024. It is expected that the real time monitoring of emissions that these provide will help to reduce air pollution. As part of its Circular Economy Action Plan, the EU has revised its regulations governing the sale of batteries, and from July 1, 2024, batteries sold in the EU that are used in EVs, laptops, tablets, smartphones, and industrial applications will need to accept standard chargers and to display their carbon footprint. Thai battery manufacturers will thus need to adapt their products to meet the new EU rules if they are to maintain their customer base. The sugar tax on non-alcoholic drinks: This has been instituted with the goal of raising awareness over the health impacts of excessive sugar consumption. The tax is being introduced in 4 stages. The first stage ran from September 16, 2017, to September 30, 2019, the second from October 1, 2019, to March 31, 2023, the third from April 1, 2023, to March 31, 2025, and the fourth from April 1, 2025 onwards. This will add to manufacturers’ costs, which may then be passed on to consumers. Auto industry Changes to excise duties on autos will help to reduce the release of greenhouse gases. The bands assigned to vehicles’ according to the quantity of carbon dioxide (CO2) that they release will be tightened, with the total number of bands increased from 4 to 5. The new bands are: CO2 released < 100 grams\/kilometer, 100-120 grams\/kilometer, 121-150 grams\/kilometer, 151-200 grams\/kilometer, and > 200 grams\/kilometer. These changes are part of a package to promote energy saving and a reduction in the release of CO2. Excise duties for HEVs (hybrid electric vehicles) and PHEVs (plug-in hybrid electric vehicles) will be set according to their CO2 emissions as follows. Excise duties for HEVs with an engine capacity not greater than 3,000 cc will be phased in over 3 periods: 1) From January 1, 2026, to December 31, 2027, rates will run from 6-24%, according to the vehicle’s emissions; 2) From January 1, 2028, to December 31, 2029, rates will be at 8-26%; and 3) From January 1, 2030, onwards, rates will be 10-28%. For HEVs with an engine capacity greater than 3,000 cc, excise duty will be fixed at 40% from January 1, 2026. For PHEVs with an engine capacity no larger than 3,000 cc, that can travel for at least 80 kilometers on a single charge, and that have a petrol tank that is no bigger than 45 liters, excise will be set at 5%, while for those that travel less than 80 kilometers per charge or that have a petrol tank larger than 45 liters, excise duties are set at 10%. All PHEVs with an engine bigger than 3,000 cc will face excise duties of 30%. This will be with effect from January 1, 2026. Excise duties will be levied on traditional internal combustion engine (ICE) powered vehicles according to their CO2 emissions. These will rise in stages, beginning in 2026. For autos with an engine capacity of not more than 3,000 cc, in phase 1 (January 1, 2026 - December 31, 2027) excise rates will be in the range of 13-34% as per vehicles’ CO2 emissions. Phase 2 will run from January 1, 2028, to December 31, 2029, when the rate will increase to 14-36%, and from January 1, 2030, onwards, excise duty will be set at 15-38%. For autos with engines larger than 3,000 cc, excise rates will be fixed at 50% from 1 January, 2026, onwards. It is hoped that this will encourage the development of more environmentally friendly technology. Excise duties on BEVs will be cut from 8% to 2% to encourage their manufacture and use, as per the resolution of the national committee on EV policy, which has set a target of 30% of cars coming off Thai production lines being zero emission vehicles (ZEVs) by 2030. To increase the competitiveness of Thai-made pickups and similar vehicles and to help Thailand maintain its position as a regional center of auto production, the authorities are supporting the use of alternative energy other than biodiesel, and promoting the production and use of BEVs and FCEVs (fuel cell electric vehicles). As part of this strategy, excise duties on these will be set at respectively 2% and 0%. As with autos, excise duties for motorcycles, both ICE-powered and HEV and PHEV models, will be set according to their CO2 emissions. The first stage of the new regime will run from January 1, 2026, to December 31, 2029, with excise rates set at: 4% (CO2 emissions < 50 g\/km), 6% (CO2 emissions 51-90 g\/km), 10% (CO2 emissions 91-130 g\/km), and 20% (CO2 emissions > 130 g\/km). In phase 2 (from January 1, 2030, onwards), rates will be raised to respectively 5%, 10%, 15%, and 25%. To encourage greater domestic production and use of BEV motorcycles, excise on these will be fixed at just 1%. To stimulate growth in the BEV segment, over 2022-2025, the government will give subsidies of THB 70,000-150,000 to individuals buying a BEV costing up to THB 2 million, and of THB 18,000 to those buying a BEV motorcycle that costs no more than THB 150,000. Road tax is being cut for BEVs registered between October 1, 2022, and September 30, 2025. Thus, to encourage the production and use of environmentally friendly vehicles while cutting emissions of CO2 and PM2.5 particulates, road tax on BEVs will be slashed by 80% for 1 year. Energy and the environment The roadmap for the transition to a neutral-carbon economy should come into effect in 2023. This is comprised of a variety of strands: (i) the 2022 Power Development Plan, (ii) the Gas Plan, (iii) the Alternative Energy Development Plan, (iv) the Energy Efficiency Plan, and (v) the Oil Plan. Taken together, these aim to help Thailand reach net-zero by 2050 and zero greenhouse gas emissions by 2065. This should then allow businesses to develop more secure plans for investments made in electricity generation, gas production platforms and importers, and oil refineries. The energy mix is being adjusted in the revised Power Development Plan (PDP Rev. 1) for 2021-2030 with a greater emphasis placed on renewables and a corresponding reduction in the importance of fossil fuels. This is therefore supporting the development of more renewables-based generation (solar, biomass, biogas, and waste-to-energy), liberalizing the market for rooftop solar installations, and promoting investment in power storage as a route to ensuring security of supply from alternative energy sources. In addition, the feed-in tariff is being adjusted for the period 2022-2030 for power sources that have no associated energy costs, including ground-mounted solar, ground-mounted solar that is coupled to battery energy storage systems, wind, and biogas (generated from waste or wastewater). This should then help to accelerate investment in power generation from 2023 onwards. Phase 4 of the investment support plan for the petrochemical industry (for the period 2022 to 2026) aims to increase the industry’s added value, prepare the industry for the transition to the circular economy, and establish a production base that will then supply inputs into the new S-curve industries (e.g., specialist petrochemicals, chemicals, bioplastics, and recyclable materials) as well as support an extension of research and development and the buildout of associated infrastructure. It is expected that this will encourage an expansion in investment, especially in biodegradable petrochemicals. This will help players better respond to market needs and increase the range of uses for inputs, and over the long term, this should increase operators’ competitiveness. The EU is introducing its new carbon border adjustment mechanism (CBAM), under which importers are required to report the greenhouse gas emissions associated with 9 categories of imports (iron and steel, aluminum, cement, fertilizer, electricity, organic chemicals, plastics, hydrogen, and polymers). A levy will be placed on these imports according to the amount of greenhouse gases that they release, including any indirect emissions such as from the electricity used in their production. A transition period during which the system will be tested will run from January 1, 2023, to December 31, 2026, but following this, the system will be fully enforced. Over the next few years, the need to adjust manufacturing processes to bring them into line with the CBAM requirements will therefore add to Thai manufacturers’ costs. The US is hoping to pass its Clean Competition Act (currently at the committee stage in the Senate), with the goal of reaching net zero by 2050. This includes a carbon pricing scheme for domestically produced goods (due to be introduced in 2024) and a carbon border adjustment mechanism (US-CBAM) that will cover imports of petroleum, petrochemicals, fertilizer, iron and steel, aluminum, glass, paper, and paper pulp (due to be introduced in 2026) to meet a target of greenhouse gases emission reduction (Net-zero) in 2050. As with the European legislation, this will force Thai manufacturers to invest in overhauling their production processes to bring these into line with the US requirements. The Thai Industrial Standards Institute (TISI) has adjusted exhaust emission standards for trucks, buses, pickups and eco cars to align these with the Euro 5 standards. These changes will come into force on 1 January, 2024, and it is hoped that this will reduce emissions of dangerous air pollution, including of PM 2.5 particulates. However, the need to develop parts that meet these new requirements will add to players’ manufacturing overheads. The Department of Industrial Works is preparing to ban the use of dichlorodifluoromethane (HCFC-141b), which is generally used in the manufacture of spray foam. The ban will come into force on January 1, 2024, and in place of this, manufacturers will need to use hydrofluoroolefins (HFOs), which do not damage the ozone layer. In addition to protecting the environment, the ban will also help to slow climate change and so this if forming part of Thailand’s plan to reduce the release of greenhouse gases by -40% by 2040. Finance The Bank of Thailand is revising the assistance it offers to individuals affected by the COVID-19 pandemic. The BOT has lifted the ban on financial institutions issuing dividends in excess of 50% of annual net profits , as the BOT believes that commercial banks now have sufficient capital and reserves to put them on a secure footing, and so they are well placed to meet future challenges. From 2023, banks’ required annual contributions to the Financial Institutions Development Fund (FIDF) are returning to the earlier level of 0.46% of their deposits (during the COVID-19 pandemic, contributions were cut to 0.23%). This adjustment is necessary given the improvement in the economic outlook, and it will also allow FIDF debts to be run down. The BOT has put in place targeted measures to help debtors that will take advantage of policies that are still bearing fruit (debt restructuring and providing new funds for businesses). The BOT has also added new measures to its toolkit that are helping at-risk small debtors. Long-term measures to address problematic debts: These changes provide a mechanism for debtors to make debt repayments that track their recovery in income. This allows for backloading of repayments so that although initial repayments are as small as possible, as time goes by, these increase in line with improvements in the debtor’s income. On the banks’ side, the BOT has relaxed the regulations covering debt classifications (valid until the end of 2023). The asset warehousing scheme allows debtors to transfer assets to banks as part of their repayments. Debtors are, however, able to rent these assets back from creditors so that they can stay in business. Debtors also have the option of buying their assets back in the future (this will run until the end of April, 2023). Credit lines are being extended to provide liquidity to SMEs and to help businesses develop their operations. This is being provided through THB 250 billion in financing that is available through soft loans, of which THB 190 billion had been released as of 5 September, 2022. It is hoped that this will both stimulate recovery and help businesses adapt to a rapidly changing commercial environment that is being disrupted by advances in digital technology, the need to adopt environmentally friendly business practices, and the push to innovate. Soft loans and business development loans (made available under the emergency decree providing assistance to businesses hit by COVID-19) will be available until April 2023. Minimum repayments on outstanding credit card balances will be held at 5% until the end of 2023 and then raised to 8% in 2024 before returning to the standard rate of 10% from 2025 onwards. Moreover, the repayment period for personal digital loans will be extended to 12 months until the end of 2023. This will help to reduce the burden of repayments and improve liquidity for cash-strapped households. Help for those refinancing and consolidating debts is available in the form of a ban on penalty fees for early repayment of personal loans. This will be in place until the end of 2023, and by allowing debtors to consolidate several smaller loans into one large package that includes a home loan, it should be easier to negotiate a lower interest rate. The criteria for participating in debt clinics have been changed to allow greater enrolment, and participants can now choose between three ways to pay off their debts: (i) payments can be made over not more than 4 years, with interest set at 3%, (ii) payments can be made over 4 to 7 years, with interest set at 4%, or (iii) payments can be made over 7 to 10 years, with interest set at 5%. Being able to choose between these options allows debtors to select the payment plan that best matches their financial situation. The Consumer Protection Board approved regulations governing the maximum annual interest rates that are allowed to be charged for auto and motorcycle hire-purchase agreement. The rates will be limited to 10% for sales of new cars, 15% for secondhand cars, and 23% for motorcycles. The new regulations were published in the Royal Gazette and will come into force from January 2023 onwards. It is possible that lenders will tighten their loan requirements following this change. Tourism Support for the hotel industry. The government is postponing from 2021 to 2024 the full enforcement of ministerial regulations on the designation of businesses offering short-term accommodation, and this will thus give hotels and other small businesses time to bring their accommodation into line with the law. In addition, hotel and related businesses are able to claim tax refunds worth double their spending on this, as well as now having the opportunity to participate in government-backed tourism promotion schemes. This is expected to make competition on price fairer, while statistics on occupancy rates will better reflect reality now that 20,000 of the roughly 40,000 falsely classified businesses have submitted requests for deferrals of the requirement to alter their premises. The suspension of the annual registration fee for hotels of THB 40\/room has been extended, helping to offset some of the problems caused by COVID-19. This extension will now run from July 1, 2022, to June 30, 2024 (originally, the suspension should have ended on July 30, 2022). Other industries The Ministry of Public Health has decriminalized possession of cannabis plants (any part) and extracts with THC or CBD content no greater than 0.2%, with effect from June 2022. This has occurred alongside the 2021 law on drug possession, which removed cannabis from the list of category 5 prohibited narcotics. This should now create greater added value in the cannabis products and related industries. A digital service tax (DST) is now levied on foreign companies offering a range of online services, including e-commerce platforms, search engines (e.g., Google), social media companies (e.g., Facebook and YouTube), hotel booking sites (e.g., Booking and Agoda) and food delivery apps. As such, companies that generate over THB 1.8 million annually now have to register and pay a 7% value-added tax, just as Thai companies already do. The tax was introduced on September 1, 2021, and this should help to increase Thai players’ competitiveness. In the view of Krungsri Research, in light of the changing macroeconomic environment sketched out above, the business and manufacturing sectors will see a rapid evolution in both opportunities and challenges. Players will thus need to accelerate the process of business transformation and to do so in a way that is congruent both with the changing regulatory regime and with transformations in international social and economic contexts. However, those that are able to accomplish this will be rewarded with deeper and renewed business foundations, and these players will then find themselves well placed to benefit from a flourishing business environment that will support long-term sustainable growth. 2023-2025 THAILAND INDUSTRY OUTLOOK AGRICULTURE Rice Situation in 2022 Production index of paddy jumped 21.2% YoY through 9M22 on favorable weather and rainfall conditions, and the effect of government price support measures and assistance for farmers. Paddy prices index were also up 2.8% YoY in the period, helped by increases of 14.2% YoY and 0.9% YoY in the price of jasmine and white rice, respectively, and these two factors then combined to boost rice farmers’ incomes index by 26.0% YoY. However, farmers also had to contend with the increasing costs of energy, fertilizer, and labor, and this is weighing on profits. Exports of rice totaled 5.4m tonnes in 9M22, up 39.1% YoY due to: (i) the outbreak of war in Ukraine, which has pushed up prices for wheat and maize and diverted demand to the rice market; and (ii) the temporary halt to exports by India[1] (the world’s most important supplier of rice) and disruption to Vietnamese rice supply caused by natural disasters. However, due to the high baseline set last year, prices for 25% broken white rice FOB slipped -8.7% YoY, and so the value of these exports rose at the slower rate of 23.6% YoY to USD 2.8bn. Despite damage from flooding to some rice-growing areas between August and October, outputs should rise in Q4 due to: (i) the incentive effect of high prices on expanding the number of plantings\/total area under cultivation; and (ii) government support for farmers. Total 2021 quantities of paddy should therefore expand by 7.0-8.0% to a total of 34.0-34.5m tonnes, which will translate into 22.1-22.3m tonnes of milled rice. At the same time, exports are expected to jump by 25.0-30.0% YoY to 7.7-8.0m tonnes of milled rice. Overseas sales will be lifted by: (i) concerns over food security that are pushing some countries to expand rice stocks; (ii) the capture of market share from India, which has banned the export of broken rice and imposed export duties on sales of many other types; and (iii) natural disasters in China and the Philippines (major rice export markets) that reduced domestic yields. Domestically, the return to normal levels of economic activity and recovery in the tourism sector are having beneficial effects for restaurants and the food processing industry. This will add to consumption of milled rice, which is forecast to strengthen by 3.5-4.5% YoY to 11.4-11.6m tonnes for all of 2022. 2023-2025 Outlook Over the next 3 years, outputs should remain flat or contract by 0.0% to -1.0% annually, which would imply a total harvest of 33.5-34.5m tonnes of paddy or 21.7-22.5m tonnes of milled rice. On the positive side, outputs will be boosted by: (i) sufficient rainfall and access to irrigation water (benefit from La Niña conditions which may continue to prevail over 2024 and 2025); and (ii) continuing government support. However, this will be risked by: (i) the switch by some farmers to bioenergy or other higher-value crops (e.g., cassava, sugarcane, or corn); and (ii) higher production costs, especially for fertilizer, which may then encourage some growers to cut back on use of the latter, with negative effects on yields. Domestic consumption will remain largely unchanged, possibly increasing by up to 1% to 11.0-11.8m tonnes annually. Sales will be lifted by the ending of the Covid-19 pandemic and the reopening of the country to foreign arrivals, which is increasing demand in restaurants and hotels, for food products, and for certain other goods made by downstream industries. Exports will climb by 11.0-12.0% to 8.0-11.0m tonnes per year on (i) an improving economic outlook in export markets over 2024-2025, and (ii) the continuing need to maintain food stocks in light of the extension of the Russia-Ukraine war. ​Rubber​ Situation in 2022 Over 9M22, production index of natural rubber dipped -1.6% YoY, and this was then reflected in falls in the output index of RSS and concentrated latex of respectively -12.9% YoY and -10.0% YoY as companies engaged in a process of destocking. In the period, exports strengthened by 4.5% YoY to 2.7m tonnes, with increases of 10.8% YoY to 1.3m tonnes recorded for TSR and of 0.8% YoY to 0.87m tonnes for concentrated latex. However, exports of RSS and compound rubber slipped by respectively -6.7% YoY (0.34m tonnes) and -4.8% YoY (0.09m tonnes). The market has been affected by the outbreak of war in Ukraine, which has pushed up oil prices and with this, the cost of synthetic rubber has risen. This has then boosted sales of more attractively priced natural rubber into markets in South Korea, Europe, and the US. However, China and Malaysia, which are normally important markets for Thai products, cut imports as they looked instead to run down stocks that had accumulated through 2021. In addition, the country’s continuing pursuit of its zero-Covid policy has meant that Chinese industry has been hit with periodic disruptions to supply chains, and this too has dragged on imports. At the same time, rubber export prices fell back by -1.7% YoY and so by value, exports edged up just 2.8% YoY to USD 4.4bn. Domestically, demand was boosted by greater consumption in the auto and auto parts industries. as companies engaged in a process of destocking. In the period, with increases of 10.8% YoY to 1.3m tonnes recorded for TSR and of 0.8% YoY to 0.87m tonnes for concentrated latex. However, exports of RSS and compound rubber slipped by respectively -6.7% YoY (0.34m tonnes) and -4.8% YoY (0.09m tonnes). The market has been affected by the outbreak of war in Ukraine, which has pushed up oil prices and with this, the cost of synthetic rubber has risen. This has then boosted sales of more attractively priced natural rubber into markets in South Korea, Europe, and the US. However, China and Malaysia, which are normally important markets for Thai products, cut imports as they looked instead to run down stocks that had accumulated through 2021. In addition, the country’s continuing pursuit of its zero-Covid policy has meant that Chinese industry has been hit with periodic disruptions to supply chains, and this too has dragged on imports. At the same time, by greater consumption in the auto and auto parts industries. Output will continue to strengthen through to the yearend and so for all of 2022, production of midstream rubber products is expected to rise by 3.0-4.0% to 5.3-5.4m tonnes, while exports will firm up at the slightly weaker rate of 2.0-3.0% to 3.6-3.7m tonnes. This will be a result of: (i) increased demand for natural rubber in place of synthetic alternatives; and (ii) problems with supply in Indonesia and Malaysia (competitors of Thailand) caused by natural disasters and labor shortages. However, weaker demand in China will translate into a drop in export prices of between -1.0% and -2.0%, and so total export value will inch up by just 0.0-1.0% to USD 5.9-6.0bn. 2022 domestic consumption is expected to jump to 1.3-1.4m tonnes (up 40.0-50.0%) on: (i) the switch to natural rubber by manufacturers; (ii) greater demand for use in the production of medical supplies, especially of latex gloves; and (iii) government policies that are stoking stronger domestic demand, e.g., the increase in purchases of rubber by government bodies and the efforts made to attract auto manufacturers (especially of EVs) to Thailand. 2023-2025 Outlook Rubber outputs are predicted to increase by 4.5-5.5% annually over the next three years, helped by: (i) the maturing of trees planted earlier and which are now entering their period of maximum production; (ii) likely favorable weather conditions; and (iii) government efforts to support the industry and to stabilize the rubber market. Sales will remain strong through the coming period, and domestic consumption is forecast to expand by 0.5-2.0% thanks to: (i) greater demand from industrial consumers including manufacturers of autos and auto parts, tires, medical devices, gloves, and EVs (the latter a beneficiary of government support); and (ii) increased work on government infrastructure projects. Exports will also strengthen, rising by some 3.5-4.5% annually thanks to growth in downstream industries and continuing problems with supply from competitor nations, where leaf fall disease will remain a challenge. The extension of the Russia-Ukraine war will also keep crude prices elevated, which will translate into high prices for synthetic rubber and because of this, demand for natural rubber alternatives will rise. RSS and TSR: Exports of RSS and TSR should expand by 3.5-4.5% and 5.0-6.0% respectively, helped by increased output from downstream industries, especially from auto assembly lines. ​ Concentrated latex: Exports will rise by 1.5-2.5% on stronger demand from industrial consumers, especially for use in the production of latex gloves, condoms, and rubber medical supplies, in particular those used in treatments given to the elderly. Compound rubber: Demand for new types of rubber for use in the electronics, construction, transport, petroleum, and chemicals industries will help to boost demand for compound rubber by 2.5-3.5% annually. Cassava Situation in 2022 Over 9M22, quantities of fresh cassava root contracted -3.1% YoY due to the impacts of flooding in parts of the country in September and October 2021. However, overall exports climbed 9.7% YoY to 8.7m tonnes. Exports of cassava chips (by volume, 54.1% of all cassava exports[1]) and cassava pellets (0.8% of exports) increased by respectively 15.1% and 329.8% YoY on greater demand from industrial consumers in China (e.g., for use in the production of ethanol, alcohol, and animal feed). Exports of native starch (32.3% of exports) and modified starch (9.9%) were also up by 3.9% YoY and 2.0% YoY, respectively. Overseas sales were lifted by stronger demand in the main export markets, especially in the ASEAN zone, for use in the production of food and drinks, paper, medicine, and cosmetics. In light of the war in Ukraine, countries also built stockpiles to secure against the supply shortage of food and energy. Demand for cassava is forecast to continue strengthening through the rest of 2022 on ongoing worries about food and health security. For all of 2022, exports should therefore total around 11.2-11.3m tonnes (up 7.0-8.0%), with increases seen in all product categories. However, due to the impact of flooding in 2021, quantities are expected to decline by -3.1% to 34.0m tonnes. Increased consumption in households and downstream industries (especially for the production of alcohol and ethanol) also means that for 2022, domestic demand for fresh cassava is forecast to climb by 14.0-16.0% to 14.2-14.4m tonnes. 2023-2025 Outlook Quantities should edge up by another 1.5-2.5% over the next few years, helped by: (i) elevated prices that will encourage farmers to increase the area under cultivation and maximize their harvests; (ii) stronger demand that will be driven by growth in downstream industries at home and abroad and by ongoing worries about food security that the prolonged Ukraine-Russia war has created; and (iii) likely favorable weather. Total exports are predicted to expand by 2.0-3.0% per year. Cassava chips: Annual exports should edge up 1.0-2.0% to 5.8-6.0m tonnes, helped by the continuing strength of Chinese demand (the main market) for cassava chip for use as an animal feed and in the production of disinfecting alcohol and ethanol, the latter for use as a power source and in the construction sector. Native starch: Exports are predicted to grow by 2.0-3.0% per year to 3.9-4.1m tonnes as demand strengthens from the food and drink and paper-manufacturing industries in particular. However, in recent years, Chinese investment in cassava production in the CLMV countries has increased, and this will amplify competitive pressures. Modified starch: Overseas sales are forecast to hit 1.2-1.3m tonnes (up 3.0-3.5% annually) on stronger global demand and expansion in downstream industries, including cosmetics, food, and pharmaceuticals. Cassava pellets: Exports will continue to hover at a level beneath 0.15m tonnes. The main demand for cassava pellets is for use as an animal feed and as a source of bioenergy, though generally only as a replacement for other crops when these are unavailable. Domestic demand will also improve in the coming period, rising by around 3.0-4.0% per year on: (i) post-Covid-19 growth in the food processing industry; (ii) use in the production of ethanol; and (iii) continuing health worries that will underpin greater demand for cassava chips for use in the production of disinfecting alcohol. Sugar and Molasses Situation in 2022 Over the 2021\/2022 growing season, outputs of sugarcane used for pressing jumped 38.1% to 92.1m tonnes, which then generated 10.2m tonnes of sugar (up 33.9% YoY). Quantities were buoyed by (i) heavier rainfall, and (ii) an increase in the area of sugarcane under cultivation due to higher prices (in particular, the minimum purchase price set by sugar refiners and the prices set for granulated sugar on global markets). For the 2022\/2023 season, outputs are expected to climb by another 16.2% to 107.0m tonnes, which would then provide manufacturers with 11.8m tonnes of sugar (up 15.9%). This outlook is supported by: (i) the favorable climate and the high levels of water in reservoirs nationwide; (ii) the high yields of the sugarcane planted in the previous season; and (iii) continuing expansion in the area planted with sugarcane, given the incentive effect of high prices. However, overheads are also rising, and growers are having to pay more for energy, fertilizer, pesticides, and harvesting costs (especially for fresh sugarcane), and this is eating into profits. Exports of sugar and molasses surged 108.1% YoY to 5.7m tonnes over 9M22, split between 3.4m tonnes of raw sugar (+168.0% YoY), 2.2m tonnes of white granulated sugar (+61.8% YoY), and 0.1m tonnes of molasses (-1.5% YoY). Exports benefited from: (i) ongoing 1.0-3.0% growth in global demand for sugar, coming from the food and drinks industry and from manufacturers of ethanol and alcohol; and (ii) a drop in supply from Brazil (the world’s leading producer and exporter of sugar) caused by flooding and frost damage, and from India, where exports of sugar were halted from June 1, 2022, to October 2023. This has then pushed up export prices by 15.7% YoY, with the result that the value of Thai sugar exports is up 139.7% YoY to USD 2.7bn. For all of 2022, exports of sugar and molasses are expected to swing sharply back to growth of 100.0-110.0% and 130.0-140.0% respectively. In addition to the factors mentioned above, this impressive expansion is in fact partly due to comparison with the low baseline set in 2020 and 2021, when exports contracted by -44.2% and -35.9%, respectively. Having shrunk by -0.4% in 2021, domestic demand will also return to growth, though at the lower rate of 2.1-4.3% (to 2.40-2.45m tonnes). Stronger sales will be driven by the economic recovery, especially for restaurants and in related parts of the economy. 2023-2025 Outlook Sugarcane outputs will continue to rise, lifted by the extension of La Niña conditions (which will ensure heavier rainfall and a plentiful supply of irrigation water), ongoing government and refineries support, and the incentive provided by high prices. Outputs are thus expected to average 107-117m tonnes\/year, which will be sufficient to produce 11.8-12.8m tonnes of sugar (growth of 7.0-9.0% annually). Exports of sugar and molasses will also grow strongly, expanding by 10.0-12.0% annually to a total of 9.0-11.0m tonnes. This will be helped by: (i) the easing of problems with the supply shortage of sugarcane, which will then allow a greater volume of sugar to be diverted overseas; and (ii) stronger demand from industrial consumers in export markets. Recovery in the tourism sector and in the economy more generally will also mean that domestic demand for sugar should rise by 2.0-4.0% per year to around 2.5-2.7m tonnes. Oil Palm Situation in 2022 Over 9M22, quantities of fresh palm used as an input into the manufacture of crude palm oil (CPO) increased 4.9% YoY to 13.7m tonnes on (i) the 38.8% YoY jump in prices to THB 8.5\/kilogram, which incentivized growers to maximize the harvest; and (ii) a favorable climate and access to sufficient water. Output of CPO thus totaled 2.4m tonnes (+4.9% YoY), though domestic demand slipped -13.2% YoY to 1.6m tonnes with the February cut in the diesel mix to B5. This and the impact of the Ukraine-Russia war on global prices for transport fuels then combined to reduce consumption of biodiesel (B100) to 0.66m tonnes (-23.5% YoY). Likewise, demand for refined palm oil also contracted -3.7% YoY to 0.9m tonnes on weaker economic conditions, especially in the restaurant industry. However, exports of oil palm products jumped 28.4% YoY to 0.79m tonnes, generating receipts of USD 1.2bn (+71.4% YoY). This was largely driven by stronger sales of CPO, especially by the 0.59m tonnes sold to India (+50.5% YoY). Supporting factors were: (i) fears over lack of food security amplified by the Ukraine war; (ii) an increase in stock holding in export markets as governments tried to control rising domestic prices for vegetable oils; (iii) the search for alternatives to exports from Indonesia (the world’s biggest supplier of CPO) following its temporary halt to exports in mid-2022; and (iv) Thai government measures to reduce the domestic glut of palm oil by promoting exports. For the rest of 2022, high prices will continue to keep quantities elevated, though these will be absorbed by strong export demand. Thus, for 2022 overall, quantity supply of oil palm will be up 3.0-3.5% to 17.4-17.5m tonnes, and although domestic demand for CPO will contract by between -8.0% and -9.0% on lower consumption of biodiesel and refined palm oil, high demand in India will support a 40.0-50.0% jump in exports of palm oil products. As such, year-end domestic stocks of CPO will shrink to 0.18-0.19m tonnes, below the target range of 0.20-0.25m tonnes, and this is pushing up prices. Thus, prices for fresh palm will be up from THB 6.7\/kilogram to around THB 7.0-8.0\/kilogram, while prices for CPO and exports of palm oil products are expected to rise by respectively 15.0-17.0% and 10.0-12.0%. 2023-2025 Outlook Fresh palm output will rise by some 3.0-4.0% annually thanks to: (i) an expansion in the area under cultivation; (ii) plantations reaching the period of peak productivity; and (iii) high prices that will continue to incentivize farmers to maximize yields. Domestic demand for CPO will strengthen by around 4.0-5.0% per year on recovery in downstream industries, especially in the food, oleochemical, and transport industries, and the increase in the diesel mix to B7 and B10 (i.e., regular diesel will contain 7% or 10% biodiesel). However, growth in exports will slow sharply to 3.5-4.5% annually, though this will continue to be supported by demand in the main export markets of India, Malaysia, and Myanmar, as well as by government export promotion schemes. For farmers, income will stay close to its 2022 level. However, prices for fresh palm may slip with rising domestic and overseas outputs yields, while costs (e.g., for energy, fertilizer, and harvesting) may rise, which would then affect profitability. CPO refiners can expect turnover to be largely unchanged due to efforts to stimulate consumption of palm oil (e.g., encouraging greater use of biodiesel and increased exports), though the market will be affected by excess production capacity. Chilled, frozen, and processed chicken​ Situation in 2022 Over 9M22, output of chilled, frozen, and processed chicken increased 8.0% to 2.1m tonnes on stronger exports, which expanded by 13.0% to 0.76m tonnes. Overseas sales benefited from: (i) increased concerns over food security due to the war in Ukraine; (ii) outbreaks of bird flu in many poultry-breeding European countries, including the Netherlands, France, and Germany, which then cut supply to world markets and drove an increase in imports from Thailand (40.0% of Thai chicken exports are for the European market); (iii) the depreciation of Thai baht; and (iv) increased consumer demand (especially in Japan) for ready-to-eat products. Stronger demand and constrained supply (chicken production index actually contracted by -8.8% YoY in 9M22) then helped to lift average export prices by 18.0% YoY, and so total value of exports through the period jumped 26.9% YoY to USD 3.1bn. Domestic consumption of chicken also benefited from the relaxation of pandemic controls that allowed normal life to resume, especially by permitting demand for restaurant services to rebound. Exports of chicken products will continue to strengthen through the last quarter of 2022 on concerns over food security and the confidence importing nations (e.g., South Korea and China) have in the health standards of Thai producers. Likewise, the ongoing economic recovery and the rapid rebound in tourism will add to domestic demand, and so overall output should increase by 3.5-4.5%, with the year’s exports and domestic consumption up by respectively 8.0-10% and 2.5-3.5%. Farmgate prices will also strengthen, rising from THB 34.9\/kilogram to THB 45.0-46.5\/kilogram on (i) the rising cost of feed, energy and labor, and (ii) the spread of African Swine Fever, which is limiting pork supply and through this, adding to demand for chicken. 2023-2025 Outlook Annual output of chicken products is forecast to increase by 3.0-4.0% over the next 3 years, a total output of 2.48-2.66m tonnes\/year. Exports will also be up, though at a somewhat slower rate, rising by 2.5-3.5% annually. Supporting factors include: (i) the effect of geopolitical tensions on food security, which will then add to demand in Thailand’s main export markets of Japan, the UK, and China; and (ii) new opportunities to expand into markets in the Middle East, especially in Saudi Arabia, where buyers now accept Thailand’s adherence to halal standards. However, the rising cost of living and the worsening outlook for the global economy will weigh on growth through 2023. Domestic economic recovery, and in particular the rebound in the tourism sector and the brightening outlook for hotels and restaurants, will also support annual growth of around 3.5-5.5% in the Thai market. Negative factors affecting the industry over the next 3 years will include the high cost of animal feed and rising non-tariff barriers to trade, especially those related to animal welfare, environmental protection, and good governance (ESG goals). In addition, overheads will likely rise with the need to improve production standards and increase Thai chicken products’ international competitiveness. Canned Fish Situation in 2022 The canned fish industry returned to growth over 9M22, helped by greater global access to container units that then eased the supply of frozen fish. Production thus rose 2.2% YoY (9M21 -25.9%YoY), split between growth of 14.4% for canned tuna (77% of industry output) and a drop of -2.0% YoY in output of canned sardines that was driven by a falloff in exports to the neighboring countries market. Overall distribution rose on the strength of exports (responsible for 85.0% of the output of canned fish), which rose 9.4% YoY to 410,000 tonnes (9M21 -23.4% YoY). Sales of canned tuna were up 12.6% to 360,000 tonnes on recovery in important markets including the US (+20.6% YoY), Egypt (+0.8% YoY), Australia (+28.9% YoY), Libya (+123.1% YoY), and Japan (+0.7% YoY), where demand was lifted by concerns over food security caused by the war in Ukraine. However, sales of sardines contracted -11.7% YoY to 40,000 tonnes on (i) the continuing effects of Covid-19 on purchasing power in neighboring countries; and (ii) increasing competition from low-cost Chinese exports. The markets most seriously affected by this were Cambodia (-57.7% YoY), Namibia (-4.4% YoY), Myanmar (-22.0% YoY), Panama (-25.0% YoY), and Lao PDR (-70.9% YoY). In the period, average export prices strengthened 8.5% YoY, with rises seen for both canned tuna (+8.0% YoY) and canned sardines (+9.3% YoY). These increases were driven by the higher production costs, particularly of fuel oil (+51.3% YoY), fish (+24.6% YoY), and metal for use in packaging (+29.3% YoY). This helped to push the value of exports up by 20.0% YoY to USD 1.7bn. However, the ending of Thailand’s pandemic controls reduced the need to stock food at home and so the domestic market contracted by -6.5% YoY. Despite the high production costs, strong exports will support continuing growth through the rest of 2022, and following a crash of -23.8% in 2021, total 2022 output is expected to be up 3.5-5.0%. Largely thanks to strong demand for canned tuna, overseas sales have performed particularly well and so by volume and value, 2022 exports are expected to climb by respectively 8.0-10.0% and 21.0-23.0%. 2023-2025 Outlook Growth in the market for canned fish will slow in the coming period, but output should still rise by 2.0%-4.0% per year, helped by: (i) stronger demand on regional export markets, which will be boosted by periodic concerns over food security; (ii) the development of new products by Thai manufacturers; and (iii) the advantages Thai players, which are medium- to large- manufacturers, have regarding their hygiene and biosecurity standards. Overall exports are predicted to expand by 2.5-4.5% annually, but the cost of inputs should trend downwards, and this will then pull down export prices. Given this, the value of exports will increase at the slower rate of 0.0-2.0%. Challenges facing the industry in the coming period will include: (i) persistently high prices for inputs of energy, fish, and metal for packaging; (ii) ongoing competition with countries that have lower production costs, including China, Indonesia, Vietnam, the Philippines, and the ACP (Africa, Caribbean and the Pacific) nations; (iii) post-Covid shortages of migrant workers; (iv) increasing barriers to trade; and (v) growing interest in health that is encouraging greater consumption of fresh food. These factors may then reduce Thai players’ profitability, especially of SMEs. ENERGY & UTILITIES Power Generation Situation in 2022 Demand for electricity rose 4.4% YoY over 9M22 on the easing of the pandemic and the subsequent return of economic life to close to normal and recovery in tourism-related industries (e.g., hotels, restaurants, apartments and guesthouses, department stores, and the retail sector). However, the rise in the global price of energy lifted unit electricity costs to THB 4.0, up from THB 3.6 in 2021. Demand rose 3.9% in the industrial sector (44.8% of the total), led by manufacturers of rubber and rubber products, cement, steel and basic metals, and textiles, and 11.6% in the business sector (23.2%), but fell -0.7% for households (27.6%). Peak demand hit a historic high of 32,254.5 MW in April, an increase of 7.0% from the 2021 maximum. Electricity charges are expected to average THB 4.7\/unit in Q4, and this will restrain demand, especially in households. Given this, 2022 demand is expected to increase 4.0-4.5% compared to 2021. Electricity generation strengthened 3.8% YoY in the period. Generation by EGAT (30.2% of the total supply) increased 1.9% YoY, while private sector, supply was up 11.7% for IPPs (23.9% of the total), down -3.6% YoY for SPPs (23.5%), and up 1.6% YoY for VSPPs (5.5%). The rest of supply came from imports (16.9%), which climbed 8.9% YoY on new supply from the Nam Theun station in Lao PDR (the power station became operational this year). In terms of energy sources, supply increased by 1.9% YoY from natural gas (used to produce 53.1% of total) and 0.6% YoY and renewables (10.1% of total). Data for 1H22 shows that the installed capacity of renewables selling into the grid edged up from the end of 2021 by 0.7%, to 12,463 MW[1]. Increases were strongest for biogas (+14.3% YoY) and waste-to-energy (+14.1% YoY). To date, actual capacity and distribution is 42% of the way towards meeting the AEDP target of 29,411 MW of installed capacity by 2037. Progress is greatest for biomass energy, which is 63% of the way towards the 2037 target of 5,790 MW of capacity. 2023-2025 Outlook Electricity generators can look forward to ongoing growth thanks to: (i) annual economic growth of 3.0-4.0% that will support a 4.0-5.0% annual expansion in electricity consumption; and (ii) support for the industry via the PDP plan and Net Zero policies, which will lead to greater investment in new power plants, especially for renewables. However, an expansion in investment by large players and growth in the renewables segment will fuel more intense competition. IPPs: Income should continue to expand on rising demand. In addition, investments in renewables will increase in response to government plans to open bidding to replace 8,300 MW of supply from natural gas-fired stations for which contracts will expire over 2025-2027. SPPs: Income will slowly improve as new supply comes online. New investment will generally go into renewables, specifically SPP hybrid firms as per government plans, and into new supply in the EEC, where demand is strengthening. VSPPs: Growth in investment and income will accelerate with the government’s Net Zero plans for increased purchases of clean energy, especially from solar, wind and biomass projects. VSPPs are also well placed to compete on cost and access to inputs Oil Refineries Situation in 2022 Refineries benefited over 9M22 from the 15% jump in domestic demand for refined products. Despite the effects of the high cost of crude on fuel prices, demand was boosted by recovery in the economy and the reopening of the country to foreign arrivals, which then increased activity in the transport sector. As such, average Thai gross refinery margins (GRMs) widened to USD 15\/bbl, significantly higher than the 2019 level of USD 3.7\/bbl. These compared to Singapore GRMs of USD 19.2\/bbl, up sharply from USD 0.9\/bbl a year earlier. Average capacity utilization also strengthened in the period, rising from 77.7% in 9M21 to 86.1% a year later. For the remainder of 2022, the slowdown in the global economy will undercut crude prices, and GRMs will thus trend downwards. However, production cuts by the OPEC+ group will pull in the opposite direction, and so average prices for Dubai crude for 2022 will be up 42% YoY to USD 98\/bbl. Domestic economic recovery and the rebound in the tourism sector will add to demand for refined products, and this will lift domestic sales by 2.5-3.5%. Thus, for 2022 overall, GRMs will average USD 12-13\/bbl, up substantially from 2021’s USD 3.8\/bbl, while capacity utilization will also climb from 78.4% to 84.5%. 2023-2025 Outlook Krungsri Research expects that the world economy will remain sluggish through 2023, but the extension of the war in Ukraine will keep supply tight and with this, prices for Dubai crude will average USD 82\/bbl through the year. However, on the assumption that the effect of war-related supply problems will ease, prices are expected to fall to USD 76\/bbl and USD 70\/bbl in 2024 and 2025, respectively. For refiners, the outlook is as follows. Domestic demand for refined products is forecast to expand by 3.0-4.0% annually, matching expected economic growth of 3.0-4.0%. Demand will be further lifted by strong recovery in the tourism sector that will bring foreign arrivals back to their pre-Covid level by 2025, and by the likely 3.5-4.5% growth in the size of the national vehicle fleet. Consumption will thus strengthen from increased activity in both the industrial and transport sectors, the latter including an expansion in air travel. Domestic prices for refined products will tend to slide from their 2022 level as the global cost of crude softens, though these will still remain somewhat elevated. Thus, pump prices for gasoline will average THB 39\/liter in 2023 before dropping to THB 37\/liter and THB 35\/liter in 2024 and 2025, respectively. Over 2023-2025, diesel prices are also expected to average THB 32\/liter, THB 30\/liter and THB 29\/liter. Rising demand will support a positive outlook for refineries, while high prices for crude will keep GRMs at around USD 5-6\/bbl\/year, close to the USD 6\/bbl seen prior to the outbreak of Covid-19. No significant addition to refining capacity is expected over the next 3 years, and so capacity utilization should stay in the range 80-85%. ​ Ethanol Situation in 2022 Demand for ethanol rose 8.2% YoY to average daily consumption of 3.89m liters over 9M22. Demand was boosted by the return of the economy to much more normal conditions and the lifting of travel restrictions, especially for foreign arrivals, and this then helped sales of gasohol to increase by 6.0% YoY. Persistently high crude oil prices have then added to demand. The resumption of normal economic life and the accelerating rebound in the tourism sector, especially in the overseas segment, will mean that demand will continue to strengthen through to the yearend and so for all of 2022, demand for ethanol is expected to be up 8.2% to an average of 4.0m liters daily, compared to 3.7m liters\/day in 2021. Ethanol production rose at a higher rate of 9.8% YoY to 4.16m liters\/day in 9M22. Output was split between 2.5m liters\/day from molasses (+12.3% YoY), 1.4m liters\/day from cassava (+6.0% YoY), and 0.2m liters\/day from sugarcane (+7.5% YoY). For 2022, output is expected to rise 11-12%, lifted by low prices relative to the cost of petrol. At the end of September, stocks stood at 86.95m liters, double the 44.6m liters held in January, though still down -14.43% YoY from the September 2021 level. 2022 capacity utilization is forecast to rise to 62.1%, from 55.4% in 2021. Ethanol manufacturers are having to contend with narrowing margins that are being squeezed by the higher cost of inputs. This is partly a result of the Russia-Ukraine war, and in particular of the 35.9% YoY jump in the price of molasses to THB 8.15\/kilogram that has added to production costs for producing ethanol from molasses to THB 41.52\/liter (+27.6% YoY). Prices for fresh cassava are also up 23.1% YoY to THB 2.5\/kilogram and so the cost of cassava-based ethanol production has risen 14.1% YoY to THB 23.7\/liter. Likewise, the 13.9% YoY increase in the cost of cassava chip to THB 6.8\/kilogram has pushed up the cost of using it to produce ethanol by 9.2% YoY to THB 25.96\/liter. The reference price for ethanol across 2022 is expected to average THB 26.7\/liter, compared to THB 25.47\/liter in 2021.. 2023-2025 Outlook Over the next 3 years, demand for ethanol is predicted to rise by an average of 3.5% per year to 4.0-4.5m liters\/day on: Demand for gasoline will increase with economic and transport sector growth. Domestic tourism should return to its pre-Covid level by 2024, while the number of international arrivals should return to more than 40 million persons by 2025. The government plans to designate E20 as the principal type of gasohol in 2023. Alongside this, officials intend to make E20 around THB 3 per liter cheaper than gasohol 95 and to stop distribution of E10 (91) and E85. The number of vehicles compatible with gasohol will rise by 1.5-2.5% annually as all new models are able to run on E20. In the coming period, demand for ethanol exports is likely to increase on: (i) the growing demand of biofuels in aircraft; (ii) its use as an input in bioplastic production; and (iii) the use in the tire production in place of synthetic rubber made from oil. Biodiesel​ Situation in 2022 Biodiesel production contracted -22.7% YoY over 9M22 to an average daily output of 3.56m liters on a government cut in the biodiesel mix from 10% (B10) to 7% (B7) and 5% (B5). The government was pushed to act by rising domestic prices for crude palm oil, in tandem with global markets that were affected by the war in Ukraine, the ban on exports of palm oil by Indonesia, and the labor shortages in the Malaysian palm oil industry. This then pushed the price of biodiesel, cutting consumption (for mixing with diesel) by -22.6% YoY to an average of 3.59m liters\/day. In Q4, demand for biodiesel will strengthen with the decision by the authorities to increase the biodiesel mix to B7, B10, and B20 (October-December 2022) now that CPO prices are weakening again. In addition, the start of the holiday season will add to demand, and so for 2022, total average daily output and consumption of biodiesel is expected to come to 3.97m liters (-12.6% YoY) and 4.01m liters (-12.6% YoY) respectively. Capacity utilization will also weaken from 48.4% in 2021 to 39.3% in 2022. Over 9M22, the reference price (the price at which producers sell to oil companies or distributors) jumped 28.6% YoY to an average of THB 50.3\/liter, or THB 58.2\/kilogram. Prices were lifted by: (i) higher prices for vegetable oils (including palm oil) and crude as a result of the Russia-Ukraine war, and (ii) shrinking domestic stocks of CPO due to the government’s push to raise exports to curb excess domestic supply. Average domestic prices for CPO and palm stearin thus jumped by respectively 32.0% and 33.2% YoY to THB 47.3\/kilogram and THB 48.1\/kilogram. This helped spreads between biodiesel and CPO rise to THB 10.9\/kilogram from THB 9.4\/kilogram a year earlier. 2023-2025 Outlook The biodiesel industry will see continuing growth over the next 3 years, and demand is predicted to rise by an annual average of 8.5-9.5% to 4.0-4.5m liters\/day. This positive outlook will be supported by the following factors. Use of diesel vehicles will tend to strengthen due to: (i) average annual domestic economic growth of 3.0-4.0%; (ii) ongoing expansion in the e-commerce sector, which will then support greater use of commercial vehicles (especially of pickups); and (iii) an expected average annual increase of 3.0-4.0% in the number of diesel-powered vehicles. The government will continue to pursue policies that aim to balance the palm oil market and promote consumption of biodiesel. This will include increasing the mix of biodiesel (B100) with the high-speed diesel, extending compensation payments to sellers of liquid fuels that contain biofuels to 24 September 2024, and managing stocks of palm oil. Auto manufacturers are developing diesel engines that can run on much higher biodiesel mixes in large commercial vehicles, pickups, SUVs, and trucks. PETROCHEMICALS Petrochemicals​ Situation in 2022 Following strong recovery in 2021, the Thai petrochemicals market slowed over 9M22, with domestic sales and exports down -5.1% YoY on: (i) the imposition of lockdowns in China, Thailand’s main export market; and (ii) rising global inflation, weighing on petrochemical demand in downstream industries. Given this environment, prices for many petrochemicals softened while feedstock cost remained elevated due to high crude prices and so spreads tightened for many products. For the rest of 2022, demand will continue to slow and so from growth of 10.1% YoY in 2021, 2022 domestic consumption of petrochemicals is expected to slip by between -9.0% and -10.0%, while exports would decline by -6.0% to -7.0%. Naphtha prices: These averaged USD 824.7\/tonne over 9M22, up 34.2% YoY on higher crude prices. For all of 2022, prices are expected to average USD 767\/tonne. Upstream petrochemicals: 9M22 spreads for ethylene averaged USD 290\/tonne, down from USD 373.1\/tonne in 9M21, while those for propylene slipped to USD 215.8\/tonne from USD 380.4\/tonne. For 2022, ethylene and propylene spreads are forecast to average USD 283\/tonne and USD 213.5\/tonne respectively. Downstream petrochemicals: Spreads for HDPE crashed to USD 35.9\/tonne in 9M22 from USD 121.2\/tonne in 9M21, while polystyrene spreads fell from USD 584.3\/tonne to USD 378.2\/tonne. For the year as a whole, these are expected to average USD 43\/tonne and USD 385\/tonne respectively. Turnover dropped across the industry in 2022 on the effects of weaker downstream industrial demand that then led to falls in both sales and prices. Profits were then further weakened by the persistently high cost of inputs. 2023-2025 Outlook Demand for petrochemicals will continue to soften through 2023 before rebounding in 2024 and 2025. IMF is expected global GDP growth to hit a historic low of 2.7% in 2023 (growth will be particularly weak in China and the developed economies) and then strengthen to 3.2% and 3.4% in the following 2 years. Consumer spending power will thus improve from 2024, adding to petrochemical demand in downstream industries. Domestic demand will step up with an improving economic outlook, although the market will be affected by policies to reduce consumption of single-use plastics (e.g., PE, PP and PET) and expanding production capacity, most notably in China. Given this, domestic and export demand for petrochemicals is predicted to increase annually by around 2.0-3.0% and 0.5-1.0% respectively. ​Players will tend to respond to stronger industry demand for high-value specialty products (e.g., for the production of EV auto parts, batteries, and medical equipment) by adjusting their production processes and switching to higher-end inputs such as ABS. Producers will also exploit new market opportunities by increasing their output of biodegradable and recycled plastics. This will be in line with phase 4 of the government’s plan for the development of the petrochemical industry (2022-2026), which promotes the production of these as a way of improving the industry’s competitiveness. CHEMICAL Pharmaceuticals Situation in 2022 Strengthening demand for medicines and medical goods supported ongoing growth for the pharmaceuticals industry. This was underpinned by: (i) the return of patients to hospitals for treatment now that Covid-19 has been downgraded to a ‘disease under surveillance’ (as of October 1, 2022); (ii) the reopening of the country and the rebound in tourism, including medical tourism (there will be 10.4m arrivals in 2022, compared to 0.43m in 2021); and (iii) increasing infections with Covid-19 and other communicable diseases and rising accident rates, driven by the rebound in the level of social and economic activities. The value of the domestic market for pharmaceuticals will thus increase by 4.5-5.0%, up from growth of 2.5% in 2021. Distribution through hospitals is benefiting from the decision to allow the public to buy favipiravir, molnupiravir, and paxlovid directly, while pharmacies are being helped by their ability to sell medications on prescription. For 9M22, the situation was as follows. Sales into the domestic market[1] rose on greater demand for treatments for seasonal and general illnesses. Sales rose 18.1% YoY for pills and tablets (49.5% of the market), 29.2% for solutions and liquids (22.9%), 5.2% for injectables (8.0%), 4.5% for capsules (7.6%), 13.0% for creams (6.8%), and 30.7% for powders (5.3%). Capacity utilization increased to 60.0%, up from 54.9% in 2021. Exports increased 13.2% YoY to a value of THB 12.3bn, split between a rise of 23.3% YoY for ‘medicines and others’ (95.6% of the total) and a drop of -59.3% YoY for vaccines (4.4% of the total). Sales to the CLMV market (55.7% of exports by value) increased 13.1% YoY, with those to Malaysia, the Philippines, and Japan (a combined 18.1% of the total) up 34.8% YoY. Strong increases were seen in sales of vaccines to Myanmar (+800% YoY) and Cambodia (+272% YoY). Imports also climbed, rising 7.0% YoY to THB 87.6bn, with those of medicines (including vaccines) from Germany, the US, India, and France (48.6% of the total) jumping 53.2% YoY. Considered alone, vaccine imports (31.6% of the total) climbed 25.0% YoY. Imports from Germany (29.4% of all vaccine imports) and the US surged by respectively 3,631% and 359% YoY on stronger purchases of Moderna and Pfizer products. However, imports of vaccines from China (1.1%) collapsed -98.1% YoY as last year’s surge in purchases failed to be repeated. 2023-2025 Outlook The domestic market should expand by 5.0-6.0% annually on: (i) rising rates of NCDs and newly emerging diseases[2]; (ii) the greater access to treatments provided for by the Universal Health Coverage scheme and with this, increasing government expenditure on healthcare; (iii) the rebound in medical tourism to levels close to pre-Covid-19 norms by 2025; (iv) increasing interest in preventative healthcare and stronger demand for immunity-boosting or preventative healthcare products; and (v) continuing technological advances and the development of online platforms, which will help to integrate pharmaceutical supply chains and improve consumer access to treatments. Challenges facing the industry will include: (i) Thailand’s inability to produce complicated\/advanced treatments, which leaves the country dependent on imports and adds to costs; (ii) intensifying competition, particularly from low-cost imports from India and China; (iii) the need to overhaul production lines to meet GMP-PIC\/S[3] standards; and (iv) the rising cost of imports of inputs and raw materials. Chemical Fertilizers Situation in 2022 Demand for fertilizer remained fairly strong through 9M22, especially for crops that typically benefit from heavy applications (e.g., rice, sugarcane, and oil palm), partly due to the higher prices for agricultural goods (up 11.2% YoY), which then encouraged farmers to expand the area under cultivation. However, flood damage to crops and the run up in fertilizer prices seen since the start of the year (caused by the halt to some fertilizer exports from Russia) will likely feed through into a softening of demand in the last quarter. In addition, energy prices have also been climbing through the year, and the net effect of these factors will be to push some farmers to use cheaper organic alternatives. For all of 2022, demand will therefore rise by just 1.9% to 5.4m tonnes. During the same period, imports of fertilizer (71.1% straight fertilizer and 28.9% mixed fertilizer) contracted -24.2% YoY to 3.6m tonnes, though the price of these imports jumped 59.3% YoY to THB 92bn; import costs have been pushed up by a combination of much higher global prices for fertilizer and the slide in the value of the baht relative to the US dollar. For the rest of 2022, imports will continue to fall and for the year in total, exports are now predicted to weaken by -23.0% YoY to 4.3m tonnes. Exports, which account for just 5% of output, slumped -34.6% to 0.37m tonnes, though receipts from these sales rose 22.0% YoY to THB 8.2m. Sales into the principal market of the CLMV nations (82.9% of exports by volume) crashed -32.1% YoY on high prices that undercut demand, and so for 2022 overall, exports are expected to contract -35.0% to 0.47m tonnes, down from 0.72m tonnes in 2021 (a 3-year high). Prices surged through 9M22, with the cost of imports of straight and mixed fertilizer jumping by respectively 124% YoY (to THB 24,076\/tonne) and 114% YoY (to THB 31,593\/tonne). Costs were pushed up by the outbreak of war in Ukraine and the impact of this on exports from Russia, the world’s largest supplier of fertilizer. However, to protect farmers, domestic prices are controlled by the government and so price hikes were limited to 91% YoY for straight fertilizer and 57% YoY for mixed fertilizer. This, though, meant that margins for producers and distributors came under pressure. 2023-2025 Outlook Demand for fertilizer will strengthen by an average of 3.0% annually over 2023-2025 to a total of 5.6-5.9m tonnes. This increase will be driven largely by the expansion in the area given over to the cultivation of the main crops -- rice (expected the volume of the output to be close to 2022-level), rubber (output to expand 4.5-5.5%), and oil palm (3.0-4.0%) -- , which combined these account for some 80% of all fertilizer use. The latter forecast is based on: (i) continuing high prices for agricultural goods that will incentivize farmers to expand production; and (ii) likely favorable weather. However, manufacturers will come under pressure from higher energy costs and the elevated price of imports. Fertilizer manufacturers are likely to move into the production of biological, organic, and bio-organic nano fertilizers to meet growing global interest in conservation and the environment. In addition, BOI investment support schemes targeted at the production of certain types of fertilizer will also help to cut imports of some more expensive products. AUTOMOTIVE & PARTS Automobiles Automakers Situation in 2022 For the first half of 2022, auto output edged up just 3.0% YoY (1H21 +39.3% YoY). Growth was held back by: (i) the lockdown in Shanghai between 28 March and 1 June that then added to global problems sourcing chips (Shanghai is one of the world’s leading centers of chip production); and (ii) the impacts of the outbreak of war in Ukraine at the end of February. By segment, domestic demand jumped 14.5% YoY (1H21 +13.6% YoY) but exports fell back -5.0% YoY (1H21 +35.1% YoY). However, Q3 output jumped 34.5% YoY (3Q21 +3.1% YoY) on: (i) the ending of the Shanghai lockdown in June; and (ii) greater access to some types of chip and other auto parts. Q3 growth in demand was split 30.0% YoY for the domestic market (3Q21 -23.0% YoY) and 25.9% YoY for exports (3Q21 +19.4% YoY), and so for 9M22, output increased 12.6% YoY to 1.36m vehicles, largely due to the 19.1% YoY expansion in the domestic market (to sales of 0.63m vehicles). The latter was helped by the 20.2% jump in sales of commercial vehicles and by government promotion of battery electric vehicles (BEVs) such that over the period new registrations of these surged 297.1% YoY to 6,059 vehicles. Exports did less well, growing 4.3% YoY to 0.71m vehicles on stronger sales into the ASEAN zone, Saudi Arabia, Mexico, and the UAE. Growth will likely slow through the rest of 2022 due to a softening of the domestic market caused by: (i) widespread flooding that has undercut demand; and (ii) the effects of rate hikes and rising inflation on the cost of living. Growth in overseas sales will also remain somewhat flat as economic conditions worsen in export markets. Thus, for 2022, total output will be up by 9.0-10.0% to 1.83-1.85m vehicles. Increased supply of chips and auto parts will mean that domestic distribution will rise 15-16% to 0.87-0.88m vehicles, while sales to export markets will grow 4.0-5.0%, thus totaling 1.00-1.01m vehicles. 2023-2025 Outlook Over the next 3 years, auto output is forecast to expand by an average of 3.5-4.5% per year, though growth will be held back by periodic disruptions to the supply of chips caused by rising US-China tensions playing out in the tech arena. During this period, the domestic market should grow by 4.5-5.5% annually, helped by: (i) ongoing growth in the Thai economy; (ii) continuing government support for the purchase and use of BEVs; and (iii) a better outlook for the construction, online retail, and logistics industries that will support much greater demand for commercial vehicles. Exports will grow at the slower rate of 3.5-4.5% annually. In 2023, weak consumer spending power will weigh on export markets, and although the situation will improve in 2024 and 2025, growth will continue to be held back by (i) barriers to trade with export markets (e.g., the ban by Myanmar on imports of autos from July 2022 onwards), and (ii) the move by many countries to phase out sales of vehicles powered by internal combustion engines (ICE) (by value, 97% of 9M22 exports were of ICE-powered vehicles). Dealerships of New Vehicles Situation in 2022 Distributors enjoyed strong income growth in 9M22 on the back of the 19.1% YoY jump in domestic sales (these totaled 0.63m vehicles). The market was boosted by an easing of supply difficulties for chips and auto parts, and this then allowed distributors to deliver vehicles that had been placed on order earlier. Income from services and the supply of spares is also growing thanks to the 1.5% YoY expansion in the number of vehicles under 5 years old on Thai roads (5.26m vehicles in total) and the continuing demand for repairs. Turnover should continue to strengthen through the rest of 2022. Income from sales of new vehicles will track the 15.0-16.0% rise in the number of vehicles distributed domestically (0.87-0.88m in total), while receipts from services and the sale of parts will edge up with the anticipated 1.0% increase in the size of the national vehicle fleet less than 5 years old. 2023-2025 Outlook Over the next 3 years, distributors will enjoy steadily growing income that will be lifted by the 4.5-5.5% expansion in domestic auto sales, which will occur despite likely intermittent problems with the supply of inputs caused by the playing out of US-China tensions. However, income from service centers and the sale of spares and parts is expected to fall with the decline in auto sales over 2020 and 2021, which will mean that the number of cars on the road aged less than 5 years old will likewise contract. Moreover, although services will still be required in line with age and mileage, there is a risk that while consumer spending power remains fragile and under pressure, rising numbers of owners may be tempted to switch from dealerships to general mechanics. Profits will also be impacted by the policies enforced by the major auto manufacturers, such as the need for distributors to invest in upgrades to showrooms and service centers, to spend more on staff training, and to install EV charging stations in showrooms in order to better meet the needs of EV buyers. ​Used-car Dealerships Situation in 2022 Demand for second-hand vehicles grew solidly over 9M22 due to: (i) interruptions to production lines during 1H22 caused by shortages of parts; and (ii) greater demand for vehicles to use for commercial purposes, and given this, prices for second-hand vehicles climbed 8.1% YoY. Sales have also been helped by dealers’ efforts to improve their services, for example by providing more thorough vehicle checks, and by offering guarantees and after-sales services to customers, which has then helped to improve the confidence of buyers on limited budgets. Sales will continue to track upwards through what is left of 2022, and thus for the year overall. The market has been buoyed through the year by production problems that have hindered the output of new autos, the continuing need among the public for commercial vehicles when personal budgets are limited. Nevertheless, the ending of lenders’ debt moratorium1\/ at the end of 2021 may increase the supply of repossessed vehicles, which would then depress prices. 2023-2025 Outlook Sales will tend to slide on weaker demand in the coming period and prices will likely fall as supply widens. The latter will be affected in particular by the rising cost of living, which could cause some car owners to default on payments, ultimately leading to some of these vehicles being repossessed and entering the second-hand market. The supply of new vehicles (an alternative to second-hand autos) will also widen as access to chips improves. Beyond this, consumers are increasingly turning to EVs, and this will naturally affect demand for second-hand vehicles, almost none of which are EVs. Competition is also expected to stiffen with the entry to the market of new players (including both the main auto manufacturers and overseas players) and growth in the use of online platforms to buy and sell second-hand vehicles. This will then put pressure on turnover for current dealers, most of which are SMEs. Motorcycles ​ Situation in 2022 Production of motorcycles dropped -7.1% YoY in 1H22 (1H21 +47.3% YoY) on (i) the imposition of a lockdown between March 28 and June 1 in Shanghai as authorities tried to control the spread of Covid-19; and (ii) the outbreak of war between Russia and Ukraine at the end of February. These factors then combined to further disrupt the supply of chips, which impacted motorcycle production lines, though this was especially a problem for the bigbike models that are generally exported (almost 80% of the value of all motorcycle exports). Exports thus contracted -17.6% YoY in the period (1H21 +43.7% YoY), while sales to the domestic market edged up 3.9% YoY (1H21 +19.2% YoY). However, the situation improved in Q3, and output jumped 97.1% YoY in the quarter (3Q21 -36.5% YoY) with the ending of the Shanghai lockdown in June and the subsequent easing of blockages in chip supply chains. Domestic sales thus surged 38.2% YoY (3Q21 -20.3 YoY), though exports fell back another -5.2% YoY (3Q21 +42.5% YoY) on a drop in purchasing power in overseas markets. For the first 9 months of the year, output was thus up 15.3% YoY to 1.47m vehicles, with this growth driven by the 13.3% YoY increase in domestic sales (to 1.36m vehicles). Through this period, the domestic market was lifted by: (i) higher prices for agricultural goods that then strengthened consumer spending power in the provinces (the principal domestic market for motorcycles); (ii) policies to promote the use of battery electric motorcycles, which helped to boost registrations by 135.0% YoY in the period (to a total of 6,043); and (iii) greater demand for motorcycles to use for work by food delivery drivers and couriers, industries that are continuing to see strong rates of growth. However, exports contracted -13.8% YoY by volume (to 0.29m vehicles) and -1.3% YoY by value (to USD 2.06bn) due to weakness across a broad range of markets; by value, sales were down -19.2% to the USA, -3.3% to Europe, and -2.2% to Japan (combined, these accounted for 60.9% of all 9M22 exports by value). On the other hand, exports to the ASEAN zone inched up 1.4% (6.4% of exports). Output will likely soften through the rest of the year as the effects are felt of weaker spending power. The latter is being caused by: (i) widespread flooding; and (ii) rising interest rates and higher inflation that are adding to the cost of living. However, the outlook for exports should improve as access to chips eases, and this will then boost the number of bigbike model coming off production lines and heading to overseas markets, although the effects of this will be limited by a worsening economic environment in major export markets including the US, the EU, and Japan. For all of 2022, total output should be up by 7.0-8.0%, compared to the 10.2% growth achieved in 2021. By segment, the domestic market should expand by 10.0-11.0% but exports will be down by between -8.0% and -7.0%, having risen by respectively 6.0% and 34.9% a year earlier. 2023-2025 Outlook Domestic motorcycle sales are forecast to expand by 2.0-3.0% per year over 2023-2025, helped by: (i) steady growth in the economy; (ii) continuing government support for the use of battery electric motorcycles; and (iii) the calling of an election in 2023, which will likely lead to an increase in community-level spending. However, on the downside, from January 10, 2023, the government will enforce new rules that dictate a maximum interest rate of 23% p.a. for motorcycle loans. This is substantially less than the current average of 30-32% and as such, operators will see income from loans drop. This may then force them to cut their exposure to risk by toughening their rules on the release of new credit. Exports are also forecast to return to growth on stronger demand from the US, the EU, and Japan, though only of 1.0-2.0% annually. In addition, the Italian manufacturer Ducati is also planning to expand its Thai production facilities and to boost exports from 12,000 motorcycles per year to 18,000 by 2024. Overall output will therefore increase by an annual average of 2.0-3.0%. Auto parts Situation in 2022 Over 9M22, output of auto parts continued to strengthen and this lifted the industry’s MPI 8.8% YoY in the period. Demand from the original equipment manufacturer (OEM) market rose on greater output of autos (up 12.6% YoY to 1.36m vehicles) and of motorcycles (up 15.3% YoY to 1.47m vehicles), while the replacement equipment manufacturer (REM) market also benefited from the ongoing rise in the number of vehicles on Thai roads (Table 1). Likewise, exports edged up 2.5% YoY to a value of USD 16.8bn, with growth seen in almost all markets, including the ASEAN zone (+11.1% YoY), the US (+10.0% YoY) and Europe (+7.3% YoY), which by value accounted for a combined 54.6% of all exports of auto parts. Through the rest of 2022, domestic demand for auto parts will slow somewhat on a drop off in demand for new vehicles but for the year overall, demand will still strengthen relative to 2021. The OEM market will be lifted by rises of respectively 9.0-10.0% and 7.0-8.0% in the output of autos and motorcycles, whereas REM sales will benefit from the effect of high inflation on weakening consumer spending power, which will encourage some consumers to extend the life of their current vehicle by making more extensive repairs. However, export growth will be held back by weak economies and a softening of purchasing power in export markets, and Euromonitor (October 2022) estimates that having risen 5.0% in 2021, global auto sales will contract by -4.3% in 2022. Total 2022 exports of auto parts are therefore expected to grow by 0.0-1.0%, while output is predicted to expand by 7.0-8.0% in the year. 2023-2025 Outlook Overall output of auto parts is predicted to expand by 6.0-7.0% annually over the next 3 years. Domestic demand will benefit from the strength of the OEM market, which will move in line with overall auto output, and of the REM market. The latter will be boosted by the almost 27m vehicles over 5 years old that are currently on Thai roads (as of September 2022) and that need ongoing repairs, especially of major (and more expensive) parts such as the engine and drivetrain. The outlook for exports is less positive, and so annual growth is forecast to run to 2.0-3.0%, in line with likely economic growth in export markets and expansion in global output of autos which is recovering according to demand resume. Euromonitor (October 2022) predicts an averaging 3.0-6.0% growth rate of sales over 2023-2025. The market is changing, though, and in its Global EV Outlook 2022, the International Energy Agency estimates that global EV sales will jump from 7m vehicles in 2021 to 18m by 2025. The Thai government is thus using policy tools to encourage greater domestic production of EVs but at present, Thai exports of auto parts are overwhelmingly for ICE-powered vehicles and this will not change dramatically over the next 3 years. However, players will need to accelerate the transformation of their production lines if they wish to maintain their place in domestic and export manufacturing supply chains. ELECTRONICS & ELECTRICAL APPLIANCES Electronics​​ Hard Disk Drives (HDD) Situation in 2022 The HDD manufacturing production index (MPI) slumped -27.0% YoY over 9M22 (9M21 +4.8% YoY), while exports also slipped -2.3% YoY to a value of USD 9.47bn (9M21 +20.2% YoY). Demand for PCs has contracted sharply following 2 years of strong sales, when purchases were driven by the need to adapt to working at home; PC sales were up 12.0% in 2020 and 15.2% in 2021, compared to an average annual decline of -2.4% over 2016-2019. Thus, global sales of PCs shrank -13.0% YoY in 9M22. As these PCs usually use HDDs for data storage, sales of HDDs have also fallen. In addition, the overall weakening of the global economy is also pushing both public- and private-sector bodies to look to alternative IT solutions, particularly those based on data center systems, though at the same time, this is helping to lift demand for high-capacity HDDs. Through the rest of the year, the number of HDDs produced and exported by Thai manufacturers will continue to slide. Intense inflation in many countries is eroding consumer spending power and dragging on economies, and one effect of this is to add to the -12.8% fall in sales of new PCs worldwide (IDC, September 2022). However, this will be somewhat offset by stronger demand for high-capacity HDDs for use in big data storage and analytics; the strength of this extra demand is reflected in the increase in investment in data center systems, which will grow by 10.4% in 2022, up from 6.1% in 2021 (Gartner, October 2022). For the year as a whole, output of HDD units will slide with a decline in the value of exports that is expected to run in the range of -5.0% to -4.0%, compared to a rise of 22. 1% a year earlier. 2023-2025 Outlook Over the next 3 years, HDD exports will return to growth, but the value of these will edge up by an annual average of just 1.0-2.0%. Indeed, IDC (September 2022) sees global PC sales dipping by -2.6% in 2023 on a weaker economic outlook, but sales should return to growth in 2024 and 2025 as the situation improves. Sales of high-capacity HDDs will remain firmer, given growing demand for big data-related uses in cloud computing and data center applications. However, lower-capacity HDDs will gradually be replaced by solid state drives (SSDs), especially in notebooks. Integrated Circuits (IC) Situation in 2022 The integrated circuit MPI rose 9.4% YoY over 9M22 (compared to +14.4% YoY in 9M21), moving in step with the 12.7% YoY increase in export value to USD 6.99bn (9M21 +19.2% YoY). In the period, global sales of semiconductors were up 11.8% YoY (9M21 +26.1% YoY), in large part thanks to demand for ICs for use in auto manufacturing, where earlier demand is continuing to support growth. However, purchases of electronic goods were pushed up during the pandemic by the need to work and study at home, and the dissipation of this demand, combined with a worsening of the economic outlook, means that growth rates are down from a year ago. Growth in output and exports of ICs will likely slow in Q4 on softening consumer spending power and weaker demand for electronics that Gartner predicts will see global sales of PCs and mobile phones contracting by -9.5% and -7.1% respectively. Demand will largely be driven by use in the production of EVs and IoT-enabled devices, and so for 2022 overall, the value of Thai IC exports will rise by 11.0-12.0%, down noticeably from 2021’s growth of 19.0%. 2023-2025 Outlook The value of IC exports will strengthen by 3.0-4.0% annually over the next 3 years. This view is supported by WSTS, which as of August 2022, sees global semiconductor sales rising 4.7% in 2023, down from an anticipated 13.9% growth in 2022. This decline will be driven by economic weakness that will undercut demand for electronic goods, but the situation should then improve again in 2024. Demand for ICs for use in automobile electronics will, however, remain strong, and Gartner (July 2022) predicts that due to the increase in sales of EVs and self-driving cars, the value of the semiconductors used in each vehicle will climb from USD 712\/vehicle in 2022 to USD 931\/vehicle in 2025. However, worsening US-China tensions are expected to impact chip production and so problems with chip shortages will continue to periodically affect the supply of ICs through 2023. Nevertheless, heavy investment by major manufacturers in Taiwan, the US, China and Japan should begin to bear fruit in 2023 and so by the end of the year, problems with supply should begin to be resolved. Electrical Appliances Situation in 2022 Output of electrical appliances edged up just 0.7% YoY to 40.12m units over 9M22. Production lines were held down by depressed sales (down -2.7% YoY to 11.19m units) that were themselves the victim of elevated oil prices and high inflation, which then eroded consumer spending power. This translated into weaker sales in almost all product categories, and so falls were seen for rice cookers (-20.5% YoY), washing machines (-10.3% YoY), refrigerators (-1.0% YoY) and air conditioners (-1.1% YoY). However, exports moved in the opposite direction and strengthened 7.1% YoY to then generate USD 22.5bn in receipts. Thus, overseas sales were up 24.6% YoY for fans, 19.6% YoY for microwaves, 11.3% YoY for air conditioners, 5.9% YoY for compressors, and 0.9% YoY for refrigerators. For the last quarter of 2022, output and distribution will be largely unchanged, though demand will get a boost from (i) higher agricultural prices that are supporting an increase in farm incomes; (ii) the need to replace electrical goods damaged in floods; and (iii) promotional campaigns run by manufacturers to add to end-of-year sales. Exports will also remain somewhat weak on depressed economic conditions in overseas markets, and so for 2022 overall, domestic distribution will be down by between -2.0% and -1.0%, while export value will strengthen by 5.0-6.0%. This compares to increases of respectively 0.8% and 20.3% in 2021. 2023-2025 Outlook Over the next 3 years, domestic demand for electrical appliances is likely to strengthen by 2.0-3.0% annually. Demand will be lifted by (i) the strengthening of the market for residential accommodation, especially given the construction of new housing projects; (ii) the development of new appliances that provide additional health benefits and\/or that are internet-enabled, which are especially attractive to younger consumers; (iii) greater use of online marketing channels that will provide consumers with more information and so facilitate purchasing decisions; and (iv) ongoing urbanization, which will add to demand for certain types of electrical appliances, e.g., the coin-operated washing machines and dryers used in laundromats, the numbers of which are steadily increasing. The worsening impacts of climate change will also add to demand for air conditioners, though as of 2021, only 8% of Thai households own one of these. Exports will expand by 2.0-3.0% per year, and although economic weakness in overseas markets in 2023 is expected to precipitate a drop in sales of electrical appliances, income should rebound in 2024. In addition, low levels of ownership of electrical appliances across Asia will support continuing growth in exports to the rest of the continent, in particular of air conditioners, for which ownership rates are currently less than 20% for households in India, Indonesia, the Philippines, Myanmar, Cambodia and Lao PDR. (source: The Japan Refrigeration and Air Conditioning Industry Association (JRAIA), July 2022). Sales in Asia will be further boosted by ongoing urbanization and the steady expansion in the size of the region’s middle class. OTHER INDUSTRIES Medical Devices Situation in 2022 The Thai medical devices industry is largely focused on export markets (these absorb around 70% of output) with most production being of medical consumables. Domestic sales are expected to rise by 3.5-4.0% by value for all of 2022, helped by the abating of the COVID-19 pandemic and the return of patients to clinics and hospitals, which has then lifted demand for medical equipment (e.g., beds, X-ray and MRI equipment). However, this year, exports have crashed by between -30.0% and -35.0% as demand for disposable PPE, especially for latex gloves, failed to maintain the highs of last year. For 9M22, business conditions were as follows: Exports slumped -36.5% YoY to a value of THB 88bn on a sharp contraction in demand in the main markets of the US, Japan, and the Netherlands. Export of single-use devices (85.5% of all exports value of medical devices were down -41.8% YoY, though purchases of latex\/surgical gloves were particularly badly affected, and with sales crashing -79.1% YoY, their share of exports of all medical devices went from 57.6% in 2021 to just 19.0% a year later. Nevertheless, exports of durables and of reagents & test kits performed better and rose by respectively 40.9% YoY and 21.2% YoY. The value of imports edged up 2.3% YoY to THB 7.3bn on a 15.8% YoY increase in purchases of reagents & test kits (34.1% of all imports of medical devices). However, imports of single-use devices (36.8% of imports) and durables (29.2% of the total) shrank by -2.6% YoY and -5.2% YoY respectively. Growth in production also slowed, dropping from 13.4% in 9M21 to 3.4% YoY in 9M22. Output rose for syringes (+28.3% YoY), blood transfusion sets and saline drips (+17.7% YoY), and ‘other’ goods (+8.3% YoY), though it fell for latex gloves (down -2.7% YoY). Capacity utilization also improved, rising from 60.7% in 2021 to 69.8%. 2023-2025 Outlook Sales of medical devices will continue to rise over the next 3 years, with annual growth in the domestic and international markets expected to run to averages of 7.0-8.0% and 9.0-10.0% respectively. This outlook will be supported by: (i) a return to normal uptake of services in hospitals and clinics; (ii) a rebound in the market for medical tourism; (iii) growing interest in personal health and wellness, which will then drive greater demand for PPE; (iv) the aging of society and rising rates of non-communicable diseases (especially for hypertension, diabetes, heart disease, and strokes); and (v) ongoing demand from other countries, e.g., from elderly consumers in China and Japan for blood pressure and blood glucose monitoring kits. CONSTRUCTION & CONSTRUCTION MATERIALS Construction Contractors Situation in 2022 Overall spending on construction dipped -1.5% YoY to THB 1,066.6bn over 9M22 under the impact of weak demand and the effects of higher prices for transport and construction materials. In the latter case, those for construction steel and cement rose by 6.7% YoY and 10.7% YoY respectively, this increase being largely explained by the higher cost of oil. Across-the-board budget delays meant that public-sector disbursements dropped -2.9% YoY, but private-sector spending edged up 0.6% YoY on rises on residential and commercial developments of respectively 5.6% YoY and 17.1% YoY. However, the hole in income left by the completion of work on the Yellow and Pink mass rapid transit lines in 2021 has yet to be filled by work on other megaprojects (NESDC). For the rest of 2022, combined spending on construction will slide slightly relative to a year ago due to: (i) slow progress on government megaprojects; (ii) widespread flooding that has delayed work on some projects; (iii) high energy costs that are keeping the price of construction materials elevated; and (iv) weak purchasing power. Total spending for the year is therefore forecast to shrink by -1.2% to THB 1,348.6bn, split between a fall of -2.7% in the public sector and an increase of 0-1.0% in the private sector. Unfortunately, with inflation running hot and spending power softening, operators contracting for private-sector work will only have limited space to pass on higher costs, and this will be a particular problem for smaller operations, some of which may become insolvent. 2023-2025 Outlook Over the next 3 years, spending on construction is expected to strengthen by 4.5-5.0% annually. Work on public-sector megaprojects should speed up, especially for those in or connected to the EEC, while a steady improvement in the economic outlook will lead to better prospects for the private sector and work on commercial and residential projects. Public-sector investment in construction is predicted to increase by an average of 5.0-5.5% per year, driven mostly by an acceleration of work on EEC-related projects that fall under phase 2 of the Action Plan on EEC Infrastructure and Public Utilities (2023-2027), which covers 77 projects and for which THB 337.8bn has been earmarked for construction work. Greater progress is also expected to be made on megaprojects in other parts of the country. Private-sector spending on construction should expand by 4.0-4.5% annually on: (i) an acceleration in work on public-sector infrastructure projects that will then attract greater private-sector investment, especially along or near new communication routes\/links; (ii) heavier spending in the EEC that will support an uptick in work on factories and industrial estates in the area; and (iii) a generally improving outlook for the residential housing market. Large contractors will continue to enjoy considerable advantages relative to smaller contractors since the former have a stronger negotiating position relative to suppliers, they are better placed to win contracts placed through competitive bidding, and they are able to expand their operations into neighboring countries. In contrast, SMEs tend to rely on sub-contracting for larger contractors, though this makes income uncertain. In addition, SMEs are more likely to be affected by periodic labor shortages and by the higher cost of construction materials. ​​Construction Materials Situation in 2022​ Production and domestic sales of construction materials contracted through 9M22 on the depressed state of the building industry. Declines were seen across almost all product categories, including cement (excluding clinker), construction steel, and ceramic tiles, for which sales dropped by respectively -2.6% YoY, -4.0% YoY and -1.2% YoY. Widespread flooding and the need to repair buildings may lift demand in Q4, but for 2022 in total, the volume of goods produced and domestic sales is expected to remain unchanged or to shrink slightly. Weakness in the global economy also undercut 9M22 exports of Thai construction materials, and so overseas sales of cement (not including clinker) slumped -42.6% YoY to 1.7m tonnes on softening purchasing power in the main markets of Myanmar and Cambodia. However, the imposition of lockdowns in China and the resulting supply chain disruptions meant that exports of construction steel jumped 57.6% YoY with stronger sales into markets in Canada and Malaysia. The weakness of the domestic construction sector also weighed on imports, and so for 9M22, imports of ceramic sanitaryware, ceramic tiles, and construction steel fell back -6.3% YoY, -5.6% YoY and -4.2% YoY respectively. For 2022 overall, declines in imports and exports are expected to continue. 9M22, construction materials price index (CMPI) rose 6.5% YoY. This was largely due to a 10.7% YoY jump in the price of construction steel that was caused by higher costs for energy and transportation (these contribute a significant share of production overheads). High energy prices will keep the cost of construction materials elevated through Q4, and for 2022 in total, CMPI should thus be up by 5.5-6.5% YoY 2023-2025 Outlook​ Domestic demand will firm up on what is expected to be 4.5-5.0% growth in spending on construction. The latter will come from progress on large-scale public-sector projects, especially those connected to the Eastern Economic Corridor (EEC), where work will be accelerated by the implementation of phase 2 of the Action Plan on EEC Infrastructure and Public Utilities (2023-2027). Government spending will also be directed at megaprojects elsewhere, which will then crowd-in additional private-sector investment, especially in residential projects in areas near metro lines and new transport routes and in industrial developments linked to these. Exports should enjoy strong growth on increased work on infrastructure projects in neighboring countries (Thailand’s major export market for construction materials), which will particularly benefit producers of cement and construction steel. In addition, Chinese investors are continuing to put money into residential, commercial, and industrial real estate developments across the region, and the former in particular will help sales into overseas markets of ceramic tiles and sanitaryware. Overall prices should edge up slightly on: (i) recovering demand in the construction sector; and (ii) the higher cost of global commodities, which will then lift import prices for inputs, including scrap and billet. Modern trade outlets will see steady growth that will be helped by the range of goods that they stock and the comprehensive range of services that they offer. In addition, to better align with the needs of modern consumers, operators have adjusted their operating and marketing strategies by: (i) reducing their branch sizes and so increasing their penetration of local communities; (ii) increasing the proportion of house branded goods that they stock and then price these at points that are attractive relative to non-house brands; (iii) deepening their online presence; and (iv) meeting rising regional demand by expanding their investments in branches across the ASEAN zone. Traditional outlets will likely experience conditions that remain flat or worsen. (i) For wholesalers, conditions will be unchanged, though these may improve slightly for players that are able to adapt by, for example, distributing directly to contractors. (ii) The many traditional retailers active across the country are generally small, independent operations that lack access to capital, and this limits the range of stock that they can hold. These shops also rely on purchasing power limited buyers and are at a further disadvantage relative to modern trade outlets with regard to their rate of expansion and the number of distribution channels that they can utilize. Steel​ HRC (Hot-rolled coil)​ Situation in 2022 Output of hot-rolled coil (HRC) (the primary input into the production of flat steel products) contracted -17.3% YoY to 1.8m tonnes over 9M22 as a result of: (i) the impacts of the Russia-Ukraine war on the cost of energy and raw materials; and (ii) weakening production and investment in downstream industries (e.g., auto assembly, and the production of electrical appliances and metal packaging), which were affected by supply chain disruptions and the general economic slowdown. Given this, domestic demand , which accounts for over 95% of output, slumped -17.6% YoY to 4.4m tonnes, and this is not likely to improve dramatically in the remainder of 2022. For the year as a whole, output and demand are therefore expected to contract by -14.0% and -16.0% respectively. Exports crashed -72.8% YoY through 9M22, and as the economic outlook worsened in the main markets of Spain (the destination for 49% of exports of HRC) and Cambodia (24% of overseas sales), exports to these dropped by respectively -24.9% YoY and -68.1% YoY. Imports also fell back, with those from Thailand’s main supplier of Japan (the source of 83% of imports of HRC) slipping -19.1% YoY. Prices for HRC remained strong in 9M22, buoyed by the high cost of inputs and the effect of high prices on global exchanges. Thus, despite softening somewhat in 1H22 on a fall in demand from China and an increase in low-cost exports from Russia to the ASEAN zone, average prices edged up 5.1% YoY to THB 32,844\/tonne. Average prices for 2022 overall are now expected to fall in the range THB 32,000-33,000\/tonne, largely unchanged from 2021’s THB 31,904\/tonne. 2023-2025 Outlook​ Output of HRC should increase over the next few years on an uptick in investment and an improving economic outlook . However, as Thailand lacks a domestic source of raw materials, this adds to costs and puts domestic producers at a competitive disadvantage relative to low-cost imports, especially those from China. In addition, exporters to the EU will have to contend with a change in regulations that is being driven by the bloc’s desire to reduce the carbon footprint of imports to the region (though which is also in step with the Thai government’s desire to transition the economy to the BCG model). Thus, from January 1, 2023, importers to the EU will have to meet the requirements of the Carbon Border Adjustment Mechanism (CBAM) and it is likely that the effect of this will be to force manufacturers to switch to the use of arc furnaces. Given this, growth in output of HRC over 2023-2025 is likely to average just 2.0-3.0%. Having remained depressed through 2022, demand for HRC is expected to rise in the coming period by 4.0-5.0% annually to reach a total of 6.1m tonnes\/year, helped by a rebound in investment and output in downstream industries. Purchases will be primarily for use in auto assembly and the manufacture of electrical appliances, which will themselves benefit from economic growth and a firming up of domestic spending power. An improving economic outlook in export markets will also boost overseas sales, and so prices for HRC are likely to remain high on what will be firmer demand, especially in 2024 and 2025. Steel Bar and Section​ Situation in 202 Output of steel bar and section (the major products in the long steel product category) edged up just 2.3% YoY in 9M22 . This weak growth is largely attributable to the depressed state of the domestic market, which with an over-80% share of sales is the segment’s main source of income. The principal driver of the domestic market is the construction sector, and over 9M22, total investment in building slipped -1.5% YoY, which then helped to pull down overall 9M22 domestic demand for steel bar and section by -4.0% YoY to 2.7m tonnes . In the last quarter of the year, demand is forecast to continue to soften on the ongoing drop off in spending on construction. The latter is being caused by: (i) high energy costs that are driving up prices overall; (ii) flooding in many areas in Q4; and (iii) weak consumer spending power. For 2022, output is therefore expected to increase by 2.0% but domestic demand will slip -3.0%. Exports leapt 57.6% YoY to 0.5m tonnes over 9M22 . Sales were boosted by strong demand in the main markets of Canada, Malaysia, and Myanmar, as well as by interruptions to Chinese supply caused by the periodic imposition of lockdowns. At the same time, weakness in the construction sector translated into a -4.2% YoY decline in imports to 0.3m tonnes. Over 9M22, average prices for bar and section rose 8.9% YoY, lifted by high global prices that have been impacted by the effects of the prolonged war in Ukraine on crude prices. These should stay elevated for the rest of 2022 and so for the year as a whole, prices should average THB 27,000-28,000\/tonne, almost unmoved from the THB 26,687\/tonne seen in 2021. 2023-2025 Outlook​ Output will strengthen by some 3.0-4.0% annually on greater demand for use in both government infrastructure projects and major developments undertaken by the private sector. Activity in the construction sector will benefit from a general improvement in the domestic economic outlook and from government measures to stimulate greater investment, which will then translate into increased work on the construction of factories and warehouses. Nevertheless, Thai producers will remain exposed to stiff competition from low-cost Chinese imports. Demand for bar and section should bounce back to growth of 5.5-6.0% per year on a step-up in spending on new infrastructure, for which work should move forward at an accelerating rate. Demand for construction steel will be especially strong during the first phases of work on these projects, e.g., the laying of foundations for elevated mass transit lines and the build out of new train tracks, and this will be most noticeable in the EEC since this is now moving into phase 2 of its development (2023-2027). Likewise, private-sector work on residential, industrial, and commercial real estate developments should also gradually pick up. Prices for bar and section will remain close to the high levels set in 2022 thanks to what are expected to be elevated global prices for both steel and inputs (e.g., scrap and billet). These will also be lifted by Chinese efforts to control the production of substandard steel that will limit growth in production capacity in China. REAL ESTATE Housing in BMR Situation in 2022 Through 10M22, the housing market[1] benefited from a steady improvement in consumer purchasing power, especially from real demand, and from the reopening of the country to foreign arrivals, which then lifted demand for property for renting out or as an investment. Given this, although the market was affected by the higher cost of energy and of construction materials, developers pressed on with new projects and so the new housing units coming to market jumped 102.1% YoY to 81,315 units . 56% of these were condominiums priced under THB 3m, 28% were townhouses, and 16% were higher priced detached houses. Sales of new units also jumped 91.2% YoY to 23,019 units , 78% of which were condominiums; sales of these were up 174.4% YoY, though most were buy-to-let purchases priced under THB 2m. Demand will likely soften through the rest of 2022, and although the market will benefit from continuing economic growth and the accelerating rebound in the tourism sector (which will primarily affect the market for condominiums), inflation is pushing up construction costs and this will feed through into an anticipated 5-10% rise in house prices. On top of this, the current cycle of interest rate hikes is dissuading some potential buyers from tying themselves to long-term debts at a time when the economic outlook is increasingly uncertain, and so for 2022 overall, the new housing units coming to market should be up 60.0% YoY, while combined sales of new and old units are expected to increase 27.0%. The housing price index[2] rose through 1H22, with prices for town and detached houses up by respectively 4.2% YoY and 4.0% YoY, and condominium prices rising at the slightly slower rate of 3.2% YoY. For the year, higher energy and construction material costs will keep housing prices on an upward track. 2023-2025 Outlook​ Over the next 3 years, the market for residential housing will continue to strengthen. Sales will increase by an average of 3.0-5.0% per year on: (i) the boost to the market given by in work government investment on megaprojects, especially on new metro lines that will ease travel between central and suburban parts of the BMR; (ii) accelerating recovery in the tourism market that will bring foreign arrivals back to their pre-COVID level by 2025; (iii) government stimulus measures targeted at the real estate sector, such as allowing non-Thais to purchase land for residential purposes3\/; and (iv) stronger demand for accommodation from the expatriate market. However, headwinds blowing against the market include: (i) the extended Russia-Ukraine war, which is preventing a softening in the cost of energy and of construction materials; (ii) the current cycle of rate hikes, which is adding to costs for consumers; and (iii) high levels of household debt. These factors are then eroding consumer spending power, to the detriment of the market. The new housing units coming to market each year should rise by some 5-8%. Developers will tend to focus more on low-rise projects that meet real demand who have the finances to complete purchases. Meanwhile, recovery in the condominium segment is likely to become steadily more evident, especially in areas where these meet the needs of tourists, near educational institutions and workplaces. (e.g., near industrial estates), and at the cheaper end of the market, where purchases will be either to let or for occupation by individuals with regular income. Large developers will generally enjoy an improving outlook through this period, but SMEs may encounter greater competition due to the higher cost of construction materials and\/or access to limited supplies of labor. Low-rise housing (detached housing and townhouses): The market will steadily strengthen, driven by greater demand from buyers looking for long-term accommodation that provides them with the space\/functionality to work from home. The housing in more suburban parts of the BMR will thus become more attractive since land in these areas is less expensive than in the center of Bangkok and extensions to the metro system are making the suburbs more accessible, i.e., via the Light Red Line (Bang Sue-Taling Chan), Pink Line (Khae Rai-Minburi), Yellow Line (Lat Phrao-Samrong), and Orange Line (Ramkhamhaeng-Lam Sali). Condominiums: The outlook for this segment will improve on stronger demand for buy-to-let purchases. This is because the high cost of oil, the rising cost of living, and the upward trend in interest rates are all dragging on consumer purchasing power, and this is adding to demand for rental units. Alongside this, the rebound in the tourism market (and especially in Chinese arrivals) will add to demand, especially in central parts of the BMR and along metro lines. However, in suburban areas, condominiums are less preferred than low-rise units in the same area, and in some locations there is a significant oversupply to the market (e.g., along the Blue Line (Hua Lamphong-Bang Khae) and the Green Line (Bang Na-Samut Prakan)). Given this, recovery in income in these areas will be slow and growth will lag behind other more preferred parts of the BMR. Potential challenges that will need to be kept under close observation will include the following. (i) Household debt tends to remain high, and this will push lenders to tighten conditions on the release of new credit. (ii) Development costs will tend to rise, specifically for construction materials, land, and interest payments; and (iii) The Bank of Thailand will reintroduce the LTV rules4\/ in 2023 after relaxing them during the pandemic, and this may cause some purchases to fall through, especially those made by investors and speculators. Housing in Upcountry (major six provinces) Situation in 2022​ The housing market in the 6 major provinces [1] bounced back to growth in 1H22, having contracted through 2021. This was reflected in the jump in the supply of new housing units, which leapt 52.0% YoY to 10,175 units. Growth in supply was led by condominiums, up 119.7% YoY, while the supply of new low-rise increased by 37.2% YoY. Actual sales lagged slightly behind these figures, averaging 73.7% YoY in total split between 79.2% YoY for condominiums and 71.5% YoY for low-rise units. The market was revived by a brighter economic outlook, the return of foreign tourists to Thailand, cuts to the fees charged for registering mortgages and changes of ownership, and the temporary relaxation of the LTV rules. For the first 8 months of the year, the transfers of ownership were therefore up 9.0% YoY by unit and 8.1% YoY by value. For 2H22, demand for housing market, and particularly for low-rise units, will continue to strengthen with the return of economic life to close to normal. In addition, the full reopening of the country will help to attract greater overseas spending power to the market, which will be further boosted by government investment plans and policies such as the introduction of long-term resident visas for high-potential visitors[2]. However, strong inflation and the erosion of spending power is dragging on sales, while the cost of construction materials is rising, work is being affected by periodic labor shortages, and interest rates are on an upward track. This will then mean that for all of 2022, supply of new units will increase 75.0% YoY, sales will rise 19.0% YoY, and the ownership transferred will be up 6.2% from 2021. 2023-2025 Outlook​ The housing market in these 6 provinces will continue to recover, as a result of the following (i) Demand from both domestic and international buyers will return rapidly given these provinces’ prominence as tourist attractions, industrial areas (especially the EEC), and regional centers. (ii) Investment by Government in infrastructure projects, and especially on the high-speed rail link connecting Bangkok’s 3 airports, will spur on economic growth and this will accelerate the rebound in demand for housing in Chonburi and Rayong ahead of other provinces. (iii) Demand for houses or second homes for use as hybrid workplace-homes will increase. (iv) Rising competition in Bangkok and nearby areas is pushing up land prices. However, headwinds will also blow against the market as a result of: (i) persistently high levels of household debt that will force lenders to tighten the release of new credit; (ii) higher prices for energy and materials that will add to the project development cost; and (iii) the reintroduction of the Bank of Thailand’s LTV rules[3], which were suspended during the pandemic but which may now discourage some purchases, in particular those made by investors in condominiums. Low-rise housing: The new housing units should rise by 8.0% annually on stronger demand from real demand group, most of whom are mid- to upper-income buyers. High-rise housing (condominiums): At 4.0%, annual growth will lag behind that of low-rise developments, though the market will remain strong in the EEC (on higher demand from investors), and in the tourist areas of Phuket and Chiang Mai. ​Commercial Buildings in BMR Office Buildings Situation in 2022 Weak domestic consumer purchasing power weighed on office rentals through 1H22 , while new supply edged up by just 32,600 sq.m. (down -76.5% YoY) and as such, by the end of June, total supply had expanded by a mere 1.0% YoY to 9.5m sq.m.. This undercuts some renters’ cash flow to become insolvent, as indicated by the registrations of business dissolution1\/ in 1H22 that business closures increased 21.9% YoY. This then meant that 1H22 net take-up came to only 6,100 sq.m. and so total occupied office rental space dropped -1.3% YoY to 8.2m sq.m., implying a fall in the occupancy rate to 86.7% from the 88.7% maintained over 1H21. Supply is expanding more rapidly through 2H22, while demand is being boosted by the easing of the COVID-19 pandemic and the return of staff to on-site work. However, although supply will increase by 2.1% YoY to 9.7m sq.m., demand is forecast to inch up by only 0.4% YoY to 8.3m sq.m., and the discrepancy between the two will pull the occupancy rate down from 2021’s 87% to 85% for 2022. Rents should stay flat, or perhaps only dip slightly for grade A office building since these remain in demand, especially from players in industries such as e-commerce and platform development that have grown strongly through the pandemic. Grade B office building, however, tend to be occupied by SMEs and so rents for these will fall more sharply. 2023-2025 Outlook​ Demand for rental office space should rise by an average of 2.0% per year over the next 3 years, down slightly from the 2.5% average growth seen over 2015-2019. The market will benefit from the normalization of economic life and by increased of public infrastructure investment projects, in particular on communications links since this will add to demand for office space in the city center, especially when this is in new developments. Supply will grow in line with developers’ plans, particularly in business centers settle in mixed-use project. These feature in a large number of current developments including The Unicorn, Park Silom, The EmSphere, and One Bangkok, though work on some projects may be delayed by intermittent labor shortages. Overall, the supply of rented office space is forecast to expand by an annual average of 2.8%, or by a total of 0.85m sq.m. The occupancy rate would then slip to around 84%, and this would shift bargaining power to renters and so rental rates may also dip. Income growth will depend on location. Office buildings in the CBD: Income will continue to rise, especially for owners of grade A office building. These benefit from their attractive design, their use of modern technology, and their professional management, and as such, demand and rents remain above those for other properties. Office buildings in non-CBD areas or in locations near Bangkok: Income will remain flat or contract slightly since there is a significant supply of what are mostly grade B office building. Competition is thus intense, and there is little room to raise rents. Competition will intensify on an increase in supply that will outpace only slow expansion in demand. The latter will be held back by the move by some organizations to switch to hybrid working patterns2\/ that will then eat into demand for office space. Retail Space[1] Situation in 2022​ ​Recovery slowed in 1H22 on the impacts of high inflation on consumer cost of living that then forced some renters to reduce their retail floorspace or to close their businesses altogether. However, because brand name products selling into the higher end of the market, for which purchasing power remains strong, tended to move against the trend by expanding their retail presence. In the period, overall demand for retail space thus crept up 0.7% YoY to 6.2m sq.m. and with growth of supply just 0.2% YoY to 6.5m sq.m., the occupancy rate stayed at 94.9%, close to its level in 1H21. Demand for retail space is strengthening somewhat through 2H22 with an improvement in domestic consumer purchasing power that is being driven by continuing economic growth and the accelerating rebound in foreign arrivals. In addition, the government has been adding life to the economy through phases 4 and 5 of the Half Each program and phase 4 of the We Travel Together scheme. Nevertheless, recovery in spending power is being affected by the escalating cost of living and the rising burden of household debt (88.2% of GDP as of 2Q22) as commercial banks pass through rate hikes to retail borrowers. For 2022 overall, demand for retail space is thus predicted to increase by just 1.0% YoY (or 62,000 sq.m.), while higher construction costs and labor shortages will delay work on current projects and so keep supply growth to 1.5% YoY (or 95,000 sq.m.). The occupancy rate will therefore remain at around 94%. 2023-2025 Outlook​ The market for retail space will improve over the next 3 years, i n part thanks to: (i) economic growth that will support higher levels of consumption; and (ii) the rapid increase in tourist arrivals, which will bring the sector back to its pre-COVID level by 2025, increasing footfall and spending in outlets in tourist areas. Demand will therefore around 3.0% per year. Developers will also likely move forward with expansion plans, adding to supply that will already be boosted by the completion of projects postponed from 2022, and overall, supply can be expected to expand by an average of 4.2% annually. The gap between these two sides of the market will then pull the occupancy rate down to around 92% and with this, rents will fall in some areas. Enclosed malls: Income will edge up slightly, with growth strongest in sites in the CBD favored by renter of international brands and in new mixed-use projects. However, sites in downtown locations are constrained by limited opportunities for expansion and so operators will instead focus on investing in the modernization of properties. Rental rates will thus tend to increase only marginally. Community malls: Income will be largely unchanged in this segment due to the ongoing expansion in supply; the full implementation of the Land and Building Tax Act may encourage some corporations to use empty land for the development of community malls since the costs involved in this are relatively low. Unfortunately, given the large supply of space on community malls fighting over limited attention from local consumers, demand will likely recover only slowly and rents will remain flat. Supporting malls: Income growth will be flat on the large expansion in supply in downtown areas coming from the completion of mixed-use projects. This will happen alongside an only slow rebound in demand, and so rents will remain flat or fall slightly. Industrial Estate​ Situation in 2022 In 1H22, new sales and leases of land on Thai industrial estates contracted -9.9% YoY to 594 rai. In the period, the extension of the war in Ukraine and the runup in oil prices weighed on investment and this then impacted demand for land on industrial estates. The eastern region (home to 78% of the land on Thai industrial estates) was particularly affected by this and as such, sales and leases dropped -26.1% YoY. Supply was boosted by the opening of two new industrial estates in 1H22. These were both in Chachoengsao and had a combined footprint of 3,372 rai; BlueTech City is 1,181 rai in size while Apex Green has an area of 2,191 rai. This increase was in line with approved BOI investment support, which in the eastern region rose 24.36% YoY to hit THB 114.5bn (52% of all approved BOI investment support), and this highlights the continuing appeal of land that is backed by pro-investment government policies. Nationwide, as of 1H22 there are now 67 industrial estates in 16 provinces and these cover a total of 170,000 rai, though 77.8% of this supply is concentrated in the eastern region. The current occupancy rate stands at 77.0%, or 131,000 rai. Demand is expected to strengthen in 2H22 relative to 1H22, and this improving outlook is reflected in the increase in applications submitted for investment support. The relaxation of COVID-19 restrictions will boost investment further, and so the total area for which sales and leases will be completed in 2022 is forecast to increase by 11.5% to 1,800 rai, keeping the occupancy rate at 77.0%. 2023-2025 Outlook​ Sales and leases of land on industrial estates are forecast to increase by 18.0-20.0% per year over the next three years to respectively 2,200 rai, 2,700 rai, and 3,000 rai. Strong growth will be underpinned by: (i) the easing of the COVID-19 pandemic and the reopening of the country, which will add to investor confidence overseas; (ii) the impact of worsening US-China tensions on encouraging companies to expand their production capacity in the ASEAN region (including in Thailand), which most recently has included the move by BYD to locate its first overseas EV production facility in Rayong; (iii) progress on government-backed infrastructure projects, especially in the EEC; and (iv) the continuation of government investment support schemes. In keeping with the government’s interest in moving the economy to a greater emphasis on the BCG model, operators will tend to focus their efforts on the development of smart parks in the form of eco factories and eco industrial towns. This will then help to attract greater investment inflows from domestic and overseas sources. Eastern region: Demand for space on industrial estates should strengthen rapidly in the coming period as spending on infrastructure made under phase 2 of the EEC development plan rises. Growth in income for operators in the eastern region will thus outpace that of players elsewhere, though rising land prices and a shortage of suitable sites will make it increasingly difficult to open up new industrial estates in the area. Central region: The area’s communications links will mean that industrial space in this region will continue to attract interest, and this will underpin rising incomes for operators, especially from rents and the provision of utilities. Other regions: Elsewhere in the country, demand for land on industrial estates will remain weak until the government steps up efforts to stimulate additional private-sector investment. Extra spending on communications infrastructure that links industrial estates to the rest of Thailand and on to the wider region will be especially important in this. HOSPITALITY​ Hotels Situation in 2022 Recovery accelerated over 9M22 with foreign tourist arrivals bouncing back to 5.7m in the period, compared to just 85,845 a year earlier. This turnaround is being caused by: (i) the reopening of the country to foreign arrivals from July 1; and (ii) the lifting of restrictions on outbound tourists in originating countries, one result of which was that over the period, Thailand welcomed 0.97m visitors from Malaysia (up from 1,474 visitors in 9M21) and with a 17.1% share of all foreign arrivals, this pushed the Malaysian market into first place. However, the Chinese and Russian markets remain depressed, and so these accounted for just 2.6% and 1.8% of arrivals respectively. Domestically, Thai tourists took 103m trips within the country in 9M22 (up 274.2% YoY), lifted by the relaxation of COVID-19 controls, which is then allowing economic activity to recover, and ongoing government efforts to stimulate the sector, most recently through the extension to phase 4 of the We Travel Together program (July-October, 2022). The twin effects of these trends have then been to lift the national occupancy rate to 42.0%, up from 9.9% in 9M21, and as such, average room rates are up 9.7% YoY, while RevPAR is at THB 417 compared to just THB 90 a year ago. The number of foreign arrivals will continue to expand through Q4 thanks to: (i) the easing of fears around COVID-19, which is supporting an increase in international travel; and (ii) the beginning of the tourism high season. Likewise, the domestic tourism market will also extend its recovery thanks to (i) the effects of government stimulus packages aimed at the tourism sector; and (ii) the abating of worries about infection with COVID-19. Nevertheless, high inflation is adding to the cost of living and eroding the purchasing power of consumers, most notably those who were already in a more fragile financial situation. For 2022 overall, 10.4m foreign arrivals are expected (up 2,318.6%), while Thais are forecast to make 125m trips (up 135.7%). The occupancy rate should also increase from 14.2% in 2021 to 45% this year. 2023-2025 Outlook​ For hoteliers, recovery will accelerate over the next three years and the overseas tourism market is expected to return to its pre-COVID level of 42m arrivals in 2025, though thanks to ongoing government stimulus measures, the domestic market will rebound even quicker, and so this is now expected to return to its pre-COVID total of 185m trips in 2024. Large operators are thus likely to implement existing expansion plans, though the pace at which these are rolled out may be slower than expected. In light of this, the national occupancy rate is forecast to improve to 64% in 2023, 68% in 2024, and 71% in 2025, close to its 2019 pre-COVID level. Hotels in major tourist destinations (Bangkok, Pattaya, and Phuket): Income will continue to strengthen and average occupancy rates may be as high as 75% by 2025. Hotels in regional centers and key tourist areas: Income will improve with greater demand from domestic tourists, the latter boosted by likely ongoing government stimulus packages. Hotels in other areas: Recovery in income will be slow and occupancy rates will remain low since most demand comes from individuals traveling to regional centers or tourist attractions elsewhere. For provincial hotels that have survived the pandemic, recovery will thus lag that seen in the major tourist areas. ​ Private Hospitals Situation in 2022​ Income rebounded rapidly over 9M22 thanks to: (i) an increase in the number of in- and outpatients seeking treatment in hospitals, now that the pandemic is easing; (ii) continuing income from the treatment of patients with COVID-19 (paid for by the government through 1H22) and for COVID-19-related services, such as testing and vaccinations; and (iii) the full reopening of the country to foreign arrivals, which will add to the number of overseas patients in Thai hospitals (both those traveling for medical treatment and those who postponed treatments during the pandemic). As such, income rose 56% YoY (for 1H22 for companies listed on the SET). Income from treating individuals with COVID-19 will weaken in the remainder of the year, but this will be offset by rising income from the treatment of other illnesses and conditions. (i) The economic outlook is improving, while the designation of COVID-19 as a ‘disease under observation’ (effective from 1 October) will encourage the public to be less strict about social distancing and generally to return to living their lives as normal, which will then likely increase accident rates and the number of people falling sick with seasonal illnesses. (ii) The number of non-Thais seeking treatment in Thai hospitals will continue to increase. For all of 2022, income should therefore be up by 18.0-20.0% relative to 2021. ​2023-2025 Outlook For private hospitals, income is expected to strengthen by an average of 13.0-15.0% annually. Demand will rise on the following: Thai society is aging, and the Office of the National Economic and Social Development Council estimates that Thailand will become a completely aged society (i.e., over 20% of the population will be over 60) in 2023. This will then add to demand for ongoing and more complicated treatments. Domestic and foreign patients will tend to rebound. Domestic economic and social life will return to normal, and international arrivals will rise rapidly (foreign tourist arrivals should return to their pre-COVID level of around 42m by 2025, and this total will include a large number of medical tourists). Income will increase from the treatment of COVID-19, which has now become an endemic disease much like other seasonal illnesses. Consumers are increasingly concerned about their health and about preventing illness, and this will allow hospitals to increase their income from wellness services. The industry is undergoing a process of transformation and hospitals are expanding the provision of digital healthcare services, such as telemedicine, as a way of delivering home services. This is thus one way in which hospitals are adapting to post-COVID changes in consumer behavior. Large hospitals: These hospitals are expanding their ability to meet patients’ needs and to offer highly specialized services in dedicated units. The large corporations behind these run extensive networks of hospitals and partner with other businesses to expand their reach and connect with much more targeted groups of patients and consumers. This allows them to broaden their income base, and as such, these players will continue to see solid rates of growth in the coming period. Small and mid-sized hospitals: These players are generally looking for partners to work with, and in particular they wish to join with large private hospital chains. Hospitals that treat patients under the government health insurance scheme will be better placed to reduce fluctuations in income, but intensifying competition will mean that independent hospitals that operate outside broader commercial networks will struggle. RETAIL TRADE​ Modern Trade Situation in 2022 Business conditions improved through 9M22 thanks to: (i) the abating of the Covid-19 pandemic, which is then allowing economic and social conditions to return to normal; (ii) increased retail spending attributable to the full reopening of the country to foreign arrivals on July 1 (9M22, 5.7m arrivals were recorded, an increase of 6,540% YoY); (iii) stronger income in the agricultural sector (+14.4% YoY in 9M22) that is underpinning a rise in purchasing power; and (iv) the effect of government stimulus packages, including phases 4 and 5 of the Half Each program (March-April and September-October) and phase 4 of the We Travel Together scheme (July-October). Nevertheless, ongoing high inflation is weighing on consumer spending, especially for shoppers at the mid to lower end of the market, and this is affecting the overall business outlook. Conditions will continue to improve in the last quarter with the accelerating rebound in tourism and the start of traditional end-of-year festivals. Thus, the industry can expect growth of 3.0-4.0% for 2022 overall, following -9.0% contraction in 2021. 2023-2025 Outlook​ Income is forecast to expand at an average annual rate of 4.0-5.0% thanks to: (i) Thailand’s economic growth of 3.0-4.0% per year that will then lift consumer spending power; (ii) accelerating rebound in the number of foreign tourists that is expected to return to the pre-Covid level of 42m arrivals annually in 2025; (iii) ongoing growth in online sales; and (iv) continuing expansion in the reach of branch networks. Nevertheless, businesses will encounter headwinds in the form of: (i) high levels of household debt and only slow recovery in spending power, especially for low income earners; (ii) the rising number of outlets and intensifying competition, especially from overseas players and from other segments; (iii) stronger competition from the many online retailers, in particular in the consumer to consumer (C2C) market; and (iv) higher investment costs in the technology needed to increase competitiveness (e.g., 5G and AR\/VR). Growth trends for income for each segment are given below. Department stores: Having grown by 3.5% in 2022, income growth should accelerate to 4.0-5.0% annually. Operators will benefit from their investments in developing omnichannel platforms and the use of 5G and AR technology, though they will also continue to invest in new branches in high-potential locations both at home and abroad, especially in neighboring countries. Discount stores: Gro should average 3.0-4.0% annually, close to 3.0% in 2022. Businesses will be helped by a change in player’s strategies increase their offerings of high-quality fresh foods and premium goods, and of upgrading their branches to offer a lifestyle and image that appeals to a wider range of consumers. Businesses are also increasingly penetrating local communities by expanding their partnerships to include traditional retailers while also extending their reach by developing online platforms. Supermarkets: Having enjoyed growth of 6.0% in 2022, supermarkets should see growth of 6.0-7.0% annually. Supermarkets are benefiting from the fastest growth in the retail sector since they have been best able to adjust their outlets and offerings to match changing consumer demand, especially in high-spending mid- to upper-income groups (e.g., by adding premium lines, health goods, and clean, safe and organic produce). Convenience stores: Growth should average 4.5-5.5% per year, close to 2022’s 4.5% rise in oncome, benefitting from their change of strategy, including the move to selling ready-to-eat and fresh produce, and the shift to online distribution. However, competition is intense since players in other segments are shrinking their branch sizes, close to convenience stores. FINANCIAL SERVICES​ Credit Card Situation in 2022 Over 9M22, spending on credit cards surged 32.1% YoY to a total of THB 1.61trn, while outstanding balances climbed at the only slightly less precipitous rate of 29.5% YoY. This explosion in spending was triggered by the ending of Covid-19 restrictions and the reopening of the country, which has then allowed economic activities to bounce back, especially with regard to domestic and international tourism. This then led to a dramatic increase in credit card spending on insurance, home decorations, home appliances, online shopping, and in petrol stations, supermarkets and hypermarkets. Spending has also been lifted by the Bank of Thailand’s relaxation until 2023 of minimum credit card payments to 5% of the outstanding balance. Over the period, the number of credit cards issued also increased 3.6% YoY. Spending on credit cards will continue to grow through Q4 in the run up to New Year celebrations, with this further boosted by the accelerating rebound in the tourism sector. However, the rising cost of living and high levels of household debt will limit how far credit card use can expand, and so for 2022 overall, total credit card spending should rise by 5.0-6.0%, having contracted -1.2% in 2021.​ 2023-2025 Outlook​ Over the next 3 years, total credit card spending is forecast to expand by 6.0-7.0% annually as the economy grows and this feeds into stronger consumption. In addition, recovery in both the domestic and international tourism markets will also lift spending, as will changes to consumer behavior that increasingly favor using electronic payment methods. Operators will be careful about signing up new customers and will tend to focus on high-income earners . At a time when household debt is remaining stubbornly high, this will help to reduce exposure to the risk of users running up unpayable debts. Because this will cut the need to reserve funds to set against these bad debts, being more careful about the release of credit will prevent any increase in operating expenses. Competition within the payments sector is stiffening with the increasing use of mobile banking, QR codes, and e-wallets, all of which can be easy and quick to use, as well as from the ‘buy now pay later’ schemes that are becoming increasingly popular on e-commerce platforms. To cut their costs and raise their competitiveness, players are also making greater use of AI applications across a broad front, including when making credit decisions and managing credit risk. OTHER SERVICES Mobile Communication​ Situation in 2022​ Income remained relatively unchanged over 9M22 compared to the same period a year earlier. Growth was suppressed by the rising cost of living and the weak economic recovery, which then encouraged consumers at the mid to lower income earners to be more careful about their spending and\/or to switch to cheaper packages. Operators also focused on marketing low-cost packages to maintain their current userbase and to tempt subscribers away from competitors. As such, average revenue per user (ARPU) per month slipped by between -5.0% and -8.0%. However, operators benefited from (i) greater uptake of data services by higher-income consumers, (ii) a recovery in the tourism sector and the return of migrant laborers to Thailand, generating income from roaming charges and international calls, and (iii) the continuation of mass working from home and expansion of online shopping services. Income should improve through the rest of 2022 with the advent of the end of the year festivities. In addition, the economy is continuing to strengthen, the number of foreign arrivals is rapidly rising which help to increase the number of prepaid users, and 5G networks now cover all 77 provinces. Having remained flat in 2021, income for all of 2022 should therefore grow by some 1.0-2.0%. 2023-2025 Outlook Operators should see the business environment improve in the coming period, but income growth will not be excessive and will likely average 2.0-3.0% annually Demand will tend to strengthen on the following factors: The economy and consumer spending power will recover, while the tourism sector will rebound rapidly to its pre-Covid-19 level of around 42m arrivals in 2025. This will then help to expand operators’ userbases, especially in the prepaid segment. Use of data services for consuming content, engaging with social media, completing financial transactions, and buying and selling goods and services will steadily rise. This will provide an opportunity to expand userbase and build additional income. The use of 5G technology will increase and will become a major contributor to industrial growth, service provision, and consumers’ day-to-day lives . 5G technology will find applications in automated production facilities, medical services, and smart electronics, all of which will communicate over mobile networks. Government policies (e.g., promotion of the digital economy, the smart city project, and development of the EEC) will help to expand the country’s telecoms infrastructure, and this will then create additional demand for telecoms services across a wider part of the country. Players tend to expand and upgrade networks, and develop new services, which will attract new users and build long-term income streams. This will include developing digital business platforms, expanding the services to corporate users, and offering specialized network services to commercial clients. Players will also look to develop business partnerships with other sectors. However, the competition on price will increase and the overheads involved in bidding for new broadcast frequencies and expanding networks will weigh on profits. Logistics​ Warehouse Space​ Situation in 2022 Overall, business conditions should gradually brighten on: (i) an improving outlook for Thai trade and commerce (2022 exports and imports are forecast to rise by 6.0% and 16.0%, respectively); (ii) recovery in consumption that is forecast to reach 5.7% and which will boost demand for consumer goods; (iii) better weather, which has then boosted agricultural outputs by 3.0-4.0%; and (iv) ongoing expansion in the e-commerce sector (Priceza sees 2022 growth hitting 30%). As a result, demand for warehouse space to rent is strengthening from both those looking to stock goods for production, distribution, or export, and from companies providing last-mile delivery services to online stores However, this year’s surge in inflation has undercut consumer spending power, and the resulting weakness in the latter means that demand growth of warehouse space will slow to 4.3% from 5.7% in 2021. This will then leave total demand at around 5.19m sq.m. Operators are slowing their investments in new space from the highs seen in previous years. At present, there is a significant supply of warehouse space, which is being further boosted as new projects come to market in the border regions, where these will serve the needs of cross-border operators (e.g., the Lao-China rail link). Most of 2022’s new warehousing space has in fact been of ‘built to suit’ projects for which completion dates have been postponed, and overall, growth in the supply of warehousing space is expected to reach 4.2% in 2022, down from 4.8% in 2021. This will then bring the total available space to 6.06m sq.m. Occupancy rates will be edging up a single percent to 85.7% from 84.7% in 2021, while rents will also remain largely flat. 2023-2025 Outlook Demand for warehouse space is forecast to expand by an average of 5.3% annually, driven by: (i) continuing economic growth that will lift manufacturing output and trade; (ii) an acceleration in government spending on megaprojects and ongoing expansion in private-sector investment that will support greater demand for space for storage and distribution; and (iii) the relentless growth in online businesses. The supply of new warehouse space is forecast to rise by an annual average of 5.5%, which will then match demand that is being boosted by an expansion in trade and investment, government plans for the development of Thailand’s ports and airports, encouraging expansion of warehouse business in surrounding areas. Players will increasingly partner with other providers of warehouse space to co-invest in space management, especially in the main business areas of the BMR, regional centers, the EEC, and the 4 regional economic corridors (SEC, NEC, NeEC, and CWEC)[1], as well as in border provinces that have strong communications links to neighboring countries and that are thus becoming trade gateways to the wider region. Given this, supply growth should keep pace with changes in demand, and this will keep the occupancy rate largely unchanged at around 85.8%. Mass Rapid Transit Operators​ Situation in 2022​ Demand for mass transit services recovered through 9M22 and the return to pre-COVID normality for social and economic life . This was a result of: (i) the return to on-site work and study, now that (as of September, 2022) 143.2m jabs have been administered; and (ii) the impact of government stimulus packages (e.g., the We Travel Together program) and the full reopening of the country to foreign tourists, which has added to use of the metro system. Details of the business situation are as follows. Travelers made 171.9m trips, up 72.8% YoY . Usage rates were up 72.1% YoY to 95.1m trips on the BTS (55.4% of all travelers on the metro system), 78.3% to 66.7m trips on the MRT (38.8% of the total), 22.8% YoY to 6.9m trips on the ARL (4.0%), and 159.0% YoY to 0.32m on the STRET Red Line (1.9%). Across the network, average daily usage rates were up 75.2% YoY to 0.64m trips\/day. By line, average daily usage rates were 0.35m on the BTS (up 70.3% YoY), 0.24m on the MRT (up 77.2% YoY), 0.04m on the ARL (up 84.9%), and 0.01m on the STRET (up 219.3%). Average daily income from fares (core lines only) increased 80.1% , split between a rise of 81.0% YoY on the BTS (Green Line) and 75.6% YoY on the MRT (Blue Line). Recovery will continue through the remainder of 2022. Demand is being boosted by the downgrading of COVID-19 to a ‘disease under observation’ from October 1, which is encouraging the public to return to living their lives as normal, an accelerating rebound in the tourism sector, and the extension of phase 4 of the We Travel Together program to October. The latter then increased demand for mass transit routes that connected to Don Muang and Suvarnabhumi airports. In addition, the continuing high price of oil is encouraging some consumers to use public transport in place of private vehicles. Nevertheless, usage rates are under pressure from the effects of inflation on the overall cost of living and the only weak and incomplete recovery. Thus, for 2022 in total, the mass transit system is forecast to record 263.6m trips (up 86.9% YoY), with average daily usage rates up 86.2% to 0.73m trips\/day. Income for the BTS and the MRT should therefore jump by 205.3% and 149.2%, respectively. 2023-2025 Outlook​ Ridership is forecast to increase by 16.0-18.0% annually over 2023-2025, helped by: (i) a combination of economic growth of 3.0-4.0% per year that will lift consumer purchasing power and the increasingly rapid recovery in the tourism sector, which should bring arrivals back to their pre-COVID level of 42m in 2025; (ii) the build out of new accommodation, especially in areas near or served by mass transit networks; and (iii) the opening of new lines that will connect to existing routes, thus increasing the number of stations within the network and its overall reach. Incomes will rise thanks to both the fare hikes mandated in operating concessions and the bringing into service of new lines. The latter will include the Pink Line (Khae Rai-Minburi), the Yellow Line (Lad Phrao-Samrong, opening in 2023), extensions to the Pink Line (Si rat-Muang Thong Thani, opening in 2025) and the eastern section of the Orange Line (Cultural Center-Minburi, for which testing should begin at the end of 2025). Income will also come from the rents charged to retail shopping stores and service providers and from advertising revenue in new and existing stations. Maritime Shipping​ Situation in 2022 ​Growth in the maritime transport industry slowed over 8M22 on the softening of world trade and of the global economy generally (the IMF sees these growing by 4.3% and 3.2% respectively in 2022, down from 10.1% and 6.0% in 2021), and the impacts of the Ukraine-Russia war on demand for commodity shipping services. In addition, port congestion has eased (the Global Supply Chain Pressure Index slipped to a 22-month low in August) and these factors triggered a -16.4% YoY drop in the Baltic Dry Index. At the same time, operators of container ships benefited from the partial lockdown due to the continuation of China’s zero-COVID policy causing to Chinese manufacturing, which is then pushing players to build stocks of consumer goods. As such, the China Containerized Freight Index jumped 43.9% YoY. Business will continue to slow through what is left of 2022 due to the rising cost of inputs and of energy and the effects of the subsequent inflation on global consumer demand. However, the start of the northern hemisphere winter and the onset of traditional year-end festivals will help build demand for shipping services, and in particular for the transport of coal (to replace deficit supplies of oil and natural gas), food, consumer goods, and other manufacturing inputs. Thus, for 2022 in total, income for operators of bulk and containerized cargo ships[1] will increase by 10.0% and 38.3% respectively, down from 2021’s jumps of 62% and 120%. 2023-2025 Outlook​ Shippers’ income will continue to strengthen but at a slower pace due to the softening of cargo rates from their 2021 highs. This will be a result of the following: (i) Global growth will average 3.1% per year, compared to 3.2% in 2022, while growth in world trade volume will fall from 2021’s 4.3% to an average of 3.3% (source: IMF). (ii) Bulk carriers will continue to feel the impacts of western sanctions on Russia that are cutting demand for the transport of coal and other commodities. (iii) Operators of containerized shipping will come under pressure from 2023’s expected 7% increase in the supply of containers (up from growth of 3% in 2022). The supply of container ships will also continue to increase, (4.2m TEUs of supply were new build ordered in 2021, and 1.7m TEUs in 2022), and these ships will come into service over 2023-2025. However, demand is forecast to strengthen by just 3% in 2023 (source: Hapag-Lloyd). Nevertheless, in many markets, demand for products to stockpile for production and consumption, and to ensure food security remains strong, while shippers are well placed to pass on their higher costs (e.g., for fuel and surcharges) to service users. Vessel management of operations to balance the supply and demand of shipping capacity will also help business earnings. This will include reducing shipping capacity, blank sailing (i.e., canceling routes to some ports or lines), skip calling (cancelling calls at some ports), and demolitioning older ships and ageing boxships. In addition, some players may raise freight charges on busy routes (e.g., in the Middle East, South Asia, Latin America and intra-Asia), and these factors should then help to lift overall income by 4.0-5.0% per year. Digital services and software​ Situation in 2022 Having risen 26.8% in 2021, income for players in the software and digital services industries is forecast to jump by another 24.0% in 2022, though competition is also intensifying as new entrants to the market develop an ever-widening range of platforms. Digital services: Income should increase by 30.0% (down from growth of 37.8% in 2021) on: (i) increasing consumer reliance on digital platforms for shopping, investing, and managing finances that has been amplified by the need to maintain social distancing rules and the increasing spread of 5G networks; and (ii) the development of new platforms to meet a wider range of consumer needs. Software and software services: Income will rise 12.0% (down fractionally from 2021’s 13.0%) as the business sector steps up investment in the development of software and IT system to meet post-COVID demand for the mass customization of products and services. Government bodies are also increasingly turning to the use of cloud-based data solutions to offer more flexible and targeted services to clients, while PwC Thailand estimates that this year, over half of all Thai companies will use cloud services to provide remote-working facilities for staff. Digital content: With growth of 12.0%. up from 6.9% in 2021, the outlook is for a significantly stronger performance this year. Income growth is principally driven by the health of the online games segment (around 80% of income in this group), which is benefiting from: (i) the linking of games to social media platforms; and (ii) the switch to a gaming as a service (GaaS) model that generates additional income from in-game purchases. However, weak purchasing power in export markets will mean that growth in income for animators and character developers will be at best anemic. 2023-2025 Outlook​ Over the next 3 years, annual growth in the industry should run as high as 19.0-20.0%, while the digital services segment will still be the main driver of this. Digital services: Income is forecast to expand by an average of 22.0-23.0% per year, helped by: (i) intense competition in the private sector to deliver customers services through online platforms; and (ii) the development of new technology, especially where this is connected to AI and the metaverse, which will then provide a way to develop a wider variety of platforms and to use these to deliver a broader range of services. e-Retail, e-Logistics, online media and fintech operations will all have strong growth potential. Software and software services: Income will likely rise by some 11.0-12.0% with the spread of cloud technology and the expansion of 5G networks, which is then supporting greater uptake of cloud-based software as a service (SaaS). This is also underpinning the accelerating digital transformation of private sector services and manufacturing supply chains and pushing both large corporations and SMEs to invest in software as part of their organizational development. Within this group, SaaS, and software integration and consultation will perform best. Digital content: Income will be up 12.0-13.0% on growth in the games segment, the latter coming from: (i) the development of games that exploit new technology, e.g., blockchain applications, to allow players to collect items and then to exchange these for digital tokens; and (ii) government support for e-Sports. Markets for animators and character developers will also tend to strengthen on greater uptake of entertainment services in export markets, especially for over-the-top streaming services. >> The Macroeconomic environments","filter_flag":1}
