{"title":"India approves viability gap funding scheme for battery storage development - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA5LzA3L2luZGlhLWFwcHJvdmVzLXZpYWJpbGl0eS1nYXAtZnVuZGluZy1zY2hlbWUtZm9yLWJhdHRlcnktc3RvcmFnZS1kZXZlbG9wbWVudC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA5LzA3L2luZGlhLWFwcHJvdmVzLXZpYWJpbGl0eS1nYXAtZnVuZGluZy1zY2hlbWUtZm9yLWJhdHRlcnktc3RvcmFnZS1kZXZlbG9wbWVudC_SAQA?oc=5","id":"CBMic2h0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA5LzA3L2luZGlhLWFwcHJvdmVzLXZpYWJpbGl0eS1nYXAtZnVuZGluZy1zY2hlbWUtZm9yLWJhdHRlcnktc3RvcmFnZS1kZXZlbG9wbWVudC_SAQA","guidislink":false,"published":"Thu, 07 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=250, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA5LzA3L2luZGlhLWFwcHJvdmVzLXZpYWJpbGl0eS1nYXAtZnVuZGluZy1zY2hlbWUtZm9yLWJhdHRlcnktc3RvcmFnZS1kZXZlbG9wbWVudC_SAQA?oc=5\" target=\"_blank\">India approves viability gap funding scheme for battery storage development<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"India approves viability gap funding scheme for battery storage development - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA5LzA3L2luZGlhLWFwcHJvdmVzLXZpYWJpbGl0eS1nYXAtZnVuZGluZy1zY2hlbWUtZm9yLWJhdHRlcnktc3RvcmFnZS1kZXZlbG9wbWVudC_SAQA?oc=5\" target=\"_blank\">India approves viability gap funding scheme for battery storage development<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy Integration\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"From pv magazine India India's Union Cabinet, chaired by Prime Minister Narendra Modi, has approved the VGF scheme for BESS development. The approved scheme envisages the development of 4 GWh of BESS projects by 2030-31, with financial support of up to 40% of the project’s capital cost in the form of VGF. The move is expected to bring down the cost of battery storage systems, increasing their viability. The VGF for the development of the BESS scheme has an initial outlay of around $1.13 billion. By offering VGF support, the scheme targets achieving a levelized cost of storage (LCoS) ranging from INR 5.50\/kWh to INR 6.60\/kWh, making stored renewable energy a viable option for managing peak power demand across the country. The VGF shall be disbursed in five tranches linked with the various stages of BESS project implementation. Popular content To guarantee consumer access to the scheme's advantages, BESS projects will allocate a minimum of 85% of their capacity to electricity distribution companies (discoms). This approach will bolster renewable energy integration into the electricity grid, curbing wastage and optimizing transmission network utilization. Consequently, it will diminish the necessity for expensive infrastructure upgrades. The selection of BESS developers for VGF grants will follow a transparent, competitive bidding process, fostering equitable opportunities for both public and private sector entities.","filter_flag":1}
{"title":"Empowering India's engineering talent - CXOToday.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vY3hvdG9kYXkuY29tL2N4by1ieXRlcy9lbXBvd2VyaW5nLWluZGlhcy1lbmdpbmVlcmluZy10YWxlbnQv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vY3hvdG9kYXkuY29tL2N4by1ieXRlcy9lbXBvd2VyaW5nLWluZGlhcy1lbmdpbmVlcmluZy10YWxlbnQv0gEA?oc=5","id":"CBMiRGh0dHBzOi8vY3hvdG9kYXkuY29tL2N4by1ieXRlcy9lbXBvd2VyaW5nLWluZGlhcy1lbmdpbmVlcmluZy10YWxlbnQv0gEA","guidislink":false,"published":"Thu, 14 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=257, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vY3hvdG9kYXkuY29tL2N4by1ieXRlcy9lbXBvd2VyaW5nLWluZGlhcy1lbmdpbmVlcmluZy10YWxlbnQv0gEA?oc=5\" target=\"_blank\">Empowering India's engineering talent<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CXOToday.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Empowering India's engineering talent - CXOToday.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vY3hvdG9kYXkuY29tL2N4by1ieXRlcy9lbXBvd2VyaW5nLWluZGlhcy1lbmdpbmVlcmluZy10YWxlbnQv0gEA?oc=5\" target=\"_blank\">Empowering India's engineering talent<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CXOToday.com<\/font>","source.href":"https:\/\/cxotoday.com","source.title":"CXOToday.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy Integration\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Once seen as the provider for back-end IT support, India has now evolved into a strategic hub for technology talent for homegrown and global MNCs alike. Today, India’s engineering workforce are using their advanced technical skills and deep domain knowledge to help clients reinvent their business. The mushrooming of GCCs is a testament to this shift, as both tech and non-tech companies aim to tap into this skilled talent to accelerate their digital transformation efforts. The demand is not just high for fresh engineering graduates, but these companies are also on the lookout for mid and senior-level professionals. On the occasion of Engineer’s Day on September 15, 2023, leaders from Accenture in India, Nutanix India, Wayfair, CtrlS Datacenters Ltd, Intuit India, STL, and Birlasoft share their perspectives on India’s growing engineering talent pool and the skilling imperative. Rinku Kaul, Lead – Human Resources, Advanced Technology Centers in India, Accenture “India has long since established itself as a global digital skills hub. With businesses, citizen services and organisations across all spheres of life undergoing compressed digital-led transformation, our country’s tech talent base needs to hone cloud, security and platform skills, and expertise across the data and AI continuum. In addition, skills for full stack development and technologies such as digital twins, extended reality, robotics and blockchain continue to gain momentum. Further, the emergence of generative AI and large language models are creating new role and skills requirements – such as prompt engineers and the expertise required to design and implement AI systems that are responsible by design. Lastly, enterprises are increasingly discovering just how disruptive the intersection of science and technology can be, and in the imminent future, advances in space technologies, biotech and next-generation (quantum) computing will drive progress in new material development, energy sources, supply chains, healthcare and climate change. These developments make continuous learning an imperative for engineers and technologists across levels. A periodically refreshed curriculum, robust collaboration between the industry and academia, and experiential learning are key to nurturing the next generation of engineering talent in India. At Accenture, we partner with premier universities and research institutions in India to jointly develop technology thought leadership, educational programs and research. Examples of these include the Accenture Centre for Advanced Computing set up in collaboration with the Indian Institute of Science (IISc) Bengaluru to undertake research and development in cloud continuum and neuromorphic computing, and our partnership with IIT Madras to research and jointly develop intellectual properties in digital engineering and manufacturing. In addition, we hope to inspire creativity and out-of-the-box thinking among college students through initiatives such as the Accenture Innovation Challenge.” Sankalp Saxena, Senior Vice President and Managing Director, Operations, Nutanix India “Technology’s integral role in shaping business success cannot be overstated. At the heart of this technological evolution are engineers—visionaries who conceive, design, and validate innovation that drive organizations forward. In addition, India, renowned for its vast and highly skilled engineering community, occupies a pivotal position in propelling this innovation and, as a result, elevating economic value. In fact, India’s engineering prowess is not just anecdotal; it’s substantiated by robust data. Recent EY findings highlight that India employs more than 5 million people through capability centers in the country. This formidable talent pool positions India as a global epicenter for Engineering Research and Development (ER&D). NASSCOM also projects an astounding CAGR of 12–13%, propelling India’s contribution to the global ER&D market to USD $63 billion by 2025. These statistics underscore the country’s rapid journey toward advanced digital transformation and unparalleled economic growth, all driven by our exceptional engineering talent. Furthermore, India’s corporate landscape continues to invest significantly in cutting-edge technologies. This investment has not only fostered innovation but has also ignited a surge in demand for engineers skilled in areas such as AI, data analytics, product design, system architecture, and programming languages. The rising prominence of global capability centers in India is a testament to our engineering prowess, as they increasingly drawn to India to tap into our exceptional engineering talent. As we look ahead, we must continue to focus on skilling and upskilling our engineering workforce by bridging the industry-academia gap effectively, in order to be future-ready. We offer a compendium of virtual training programs for all employees to upskill at their own pace through the Nutanix university This investment in talent will be pivotal in driving our companies and our nation forward in this era of technological transformation.” Rohit Kaila, Head of Technology and Site Leader Wayfair India TDC “India has emerged as a hub for IT firms globally, capitalising on the number of tech-savvy people and making it an ideal location for global tech companies. The engineering programs in the country stand among the most highly coveted degrees, offering specializations in diverse areas such as data analytics, software, IT, and manufacturing. Easier access to internet has made it easier for people to learn new skills, enabling them to prosper in a world dominated by technology. In the ever-evolving landscape of technology the integration of cutting-edge advancements with last-mile connectivity become paramount, forging a robust operational framework for retailers. This hyper-localization needs to be accompanied by training and skill-upgrading programmes for engineers. At Wayfair, we are committed to empowering our technical talent to define the future of technology and innovation, both in India and around the world. We are constantly evolving and developing appropriate infrastructure, technological advancements, and tool investments to help our employees work more efficiently and produce superior results. With our recently launched Tech Development Center in Bangalore, we are aiming to develop skill development programmes to enhance their knowledge in emerging technologies such as AI, ML, Data, Cloud, and more. This commitment underlines our faith in the limitless potential of India’s engineering expertise to strengthen India’s position as a tech hub.” Vipin Jain, President-Datacenter Operations, CtrlS Datacenters Ltd “India’s emergence as a global hub for technical excellence and innovation has been fuelled by its exceptional pool of engineering talent, attracting multinational corporations to establish a presence here. Yet, to maintain this leadership, Indian engineers must stay abreast of the ever-evolving technological landscape. In the IT sector, engineers must rapidly adapt and undergo training to remain competitive in the face of emerging and fast evolving technologies. It is imperative that our talented engineers not only adapt to fast-paced workplaces but also undergo training, retention, and upskilling to stay abreast of rapidly changing technologies. STEM education in schools, colleges, and universities have now become a priority in the sector. Collaborations between businesses and educational institutions needs to be accelerated to provide cutting-edge curricula with power of real technology know how and experience. Establishing STEM Centers, Maker Labs, and AR\/VR labs with employer support can nurture young engineers and foster entrepreneurship and learning. CtrlS Datacenters takes immense pride in leading the charge to empower India’s engineering talent, catalyzing the growth and transformation of this exceptional workforce. We acknowledge the critical importance of skill development and upskilling for Indian engineers, along with the essential task of bridging the industry-academia divide. We are making efforts to educate the future engineers on the opportunities that lie ahead and innovations they can drive in times to come. This commitment strengthens India’s position as a central talent hub for Global Competence Centers (GCCs) and underscores our belief in the boundless potential of India’s engineering prowess to shape the future.” Nidhi Gopal, Vice President of Engineering, Intuit India “Over the past decade, the tech industry in India has been focused on utilizing technology to solve problems in various industries, including ecommerce, fin-tech, ed-tech, transportation, manufacturing, and business SaaS solutions. India’s tech talent has been leading the way in this disruption and innovation, creating end-to-end products and solutions using technologies such as cloud, AI, ML, NLP, and GenAI. For engineers and developers, it is crucial to continuously improve their technical skills and master emerging technologies like AI, Prompt engineering, ML, and quantum computing. At Intuit, we provide opportunities for our technologists to hone their skills through events like Global Engineering Days (GED) where, twice a year, technologists at Intuit get an entire week of uninterrupted time to code and solve a problem that speaks to them. We also through the year run coding challenges which is run as mission team investments that not only enables technologists to quickly iterate but also take this opportunity to roll out capabilities to benefit customers faster. We also offer a MSc. in Data Science program in partnership with BITS Pilani. India has the potential to lead in areas like Web3 and AI, which will have a significant positive impact on the economy. As we move towards a period of rapid digital transformation, engineers that have high learnability, passion for deep customer understanding and innovation while being creative, with an ability to work in fast-moving teams are great qualities to have. To succeed in today’s fast-paced environment, aspiring technologists should possess strong technical skills and non-technical skills like business acumen, problem-solving capabilities, influencing skills, and a passion for innovation.” Anjali Byce, CHRO, STL “Engineering has been male-dominated due to societal gender roles. Women were nudged towards humanities and caregiving roles, while men were steered into STEM fields. Challenging these stereotypes starts in childhood, with parents, teachers, and caregivers offering equal opportunities for all genders to explore diverse interests, including STEM and humanities. While strides have been made in advancing equity, inclusion, and diversity in engineering, there remains significant ground to cover. Increasing the representation of women and underrepresented groups in STEM fields is critical. We should have STEM clubs, mentorship programs, support groups, etc to foster inclusivity and empower individuals from all backgrounds to build a career they want. I have great respect for individuals and organizations like STL that have been working on this for a long time. For instance, when India had just about begun its foray into 5G, we launched the 5G Empower program through our academy to train one million women in 5G technology for free. By prioritizing women’s empowerment throughout our value chain, we aim to build an inclusive and equitable ecosystem that benefits everyone. Engineers from diverse backgrounds bring unique insights, enhancing creativity, problem-solving, and economic development. ISRO has about 20-25% women in its 16,000-strong workforce. Chandrayan 3 involved over 100 women scientists and engineers, showcasing the power of collaboration between men and women. They created history! Look at Tessy Thomas who broke the stereotype early on as not only an accomplished Indian scientist but also was Director General of Aeronautical Systems. She etched her name in history as the very first woman scientist to helm a missile project in India, breaking barriers and proving that the sky is not the limit for determined individuals like her. The goal of promoting Diversity, Equity, and Inclusion at STL is to provide everyone with the opportunity to develop new strategies and approaches, creating a more inclusive and equitable environment throughout the entire engineering design process.” Ganesan Karuppanicker, Chief Technology Officer, Birlasoft “Empowering India’s engineering talent is the cornerstone of its digital journey. We have witnessed remarkable growth and evolution within India’s engineering talent pool, and it is imperative that we nurture a workforce capable of meeting today’s demands while planning the course for tomorrow’s innovations. Our commitment to skilling and upskilling is at the heart of this mission. We must recognize the urgency of equipping our engineering talents with the digital fluency demanded by the rapidly evolving technological landscape. By reinforcing their core competencies and introducing them to emerging technologies, we empower them to not only remain relevant but also adaptable in the face of advancing technologies. Our investments in skilling and upskilling initiatives extend beyond preparing our engineering talents for the challenges of today and tomorrow. At Birlasoft, we are deeply invested in skill-building initiatives and have partnered with Coursera to continuously enhance the capabilities of our talents across the globe, along with AI based learning path recommendation system. Besides, we recently set up a Generative AI Center of Excellence with Microsoft, in order to harness its full potential. We are training 500 consultants on Generative AI technologies, principles, and best practices to build over 50 use cases. To bridge the industry-academia gap, collaboration between educational institutes, industry, and government is imperative and will ensure that the talent we cultivate, is seamlessly aligned with the industry’s needs. This convergence of knowledge and practical application is critical to the industry’s continued success. India has indisputably risen as a pivotal talent hub on the global stage, a testament to the dedication and proficiency of its engineering professionals.” Anku Jain, Managing Director, MediaTek India “As we celebrate National Engineer’s Day, we are reminded of the incredible power of innovation that drives our industry forward. Engineers are the architects of the future, and their unwavering dedication to solving complex challenges has led to remarkable advancements in technology across industries. At MediaTek, we salute the brilliant minds behind the circuits and chips that power our world, while also applauding the ceaseless efforts of the entire engineering community. Their creativity, expertise, and tireless commitment continue to shape the future of electronics and enable progress across all sectors, as India strides into its Amrit Kaal. On this special day, we reaffirm our commitment to supporting their groundbreaking work in every way possible.” Rituparna Mandal, General Manager, MediaTek Bangalore “On this National Engineers Day, we celebrate all the engineers who, with their brilliant and intrepid spirits, weave together the threads of science and technology to create the framework of human advancement. At MediaTek, our engineers are the heart and soul of our company, and today, we applaud their creativity and ingenuity. As we commemorate this day, let us also recognize the need to foster the next generation of global engineers, with a special focus on bringing more women into the fold. We must reiterate our commitment to making their journeys more fulfilling, by nurturing their passion, and providing them with the right tools to flourish in a highly competitive environment. May the spirit of innovation guide our path toward a sustainable world powered by engineering genius!” Prof Bishnu Pal, Professor & Dean of School of Engineering and Academics “National Engineering Day is celebrated in India to honor and remember the pioneer Engineer Bharat Ratna Sir Mokshsagundam Visvesvaraya on his birthday anniversary and pay tribute to the relentless spirit of innovation and engineering excellence inculcated and propagated by him that drives our nation forward. In the Indian education industry, we recognize that nurturing the next generation of engineers is paramount. We need to empower our youth with knowledge, skills, and inspiration, for they are the architects for a brighter tomorrow, who will build the bridge to a future limited only by their imagination and determination. At Mahindra University, we are very proud to cultivate the future cadre of outstanding engineers by offering them a top-tier education, nurturing their creative spirit, and inspiring them to aspire and aim for engineering excellence. Our dedicated students and faculty members are pursuing pioneering research, which I strongly believe will indeed bestow significant benefits upon the society.” Rajeeva Lochan Sharma, MD, Barco India “India is continuously enhancing its presence in the global technology and innovation landscape. Chandrayaan Mission has successfully demonstrated to the world our engineering poweress with frugal innovation. On this National Engineer’s Day, I wish to express my heartfelt gratitude and admiration for the passion and determination of our engineers and our innovators. It presents a perfect opportunity to reinforce the technology industry’s dedication to cultivating an ideal environment for our engineers, emphasizing cost-effective strategies and a steadfast focus on continuous skills development. Ms Hemlata Bist, Software Engineering Group Director, Cadence Design Systems “In today’s world, diversity at the workplace isn’t just a goal; it’s a necessity. At Cadence, we take immense pride in all that we do to create gender equality and a culture that prioritizes DE&I. We empower and support women at every stage of their careers, from mentoring programs to leadership opportunities. On this National Engineers Day, we celebrate the incredible contributions of women engineers who continue to push boundaries and drive innovation. Together, let’s foster an environment where talent knows no gender, and ideas flow freely, ensuring a brighter, more inclusive future for all in engineering.” Mr. Atulya Kaushik Co-Founder & CEO PrepInsta “Innovation serves as the lifeblood of our nation, and our esteemed engineers stand as the unwavering guardians of this vital pulse. Here at PrepInsta, we take immense pride in our role as enablers, supporting these visionary engineers in their remarkable journey of turning dreams into reality. In the realm of technology and innovation, engineers possess the remarkable ability to translate abstract concepts into tangible, game-changing solutions. On this Engineers’ Day, I, alongside the entire PrepInsta team, extend our heartfelt appreciation to the engineering community. As an engineer myself, I hold a profound sense of pride in being a part of this extraordinary community, and I am genuinely humbled by the contributions of engineers in shaping a brighter and more innovative future.” Sivakumar Selva Ganapathy, Vice President, OpenBlue India Software Engineering and APAC Solutions, Johnson Controls India “As technology and digital solutions become increasingly intertwined in today’s world, it is time to take a step towards acknowledging the strides that engineers have made in making this a possibility. Engineer’s Day is not just a celebration of innovation and technical prowess; it’s a testament to the unwavering spirit of human curiosity and determination. On this day, we applaud the role that engineers have played as problem solvers, much like our team at Johnson Controls India who have utilised the power of technology, including OpenBlue and AI, to transform challenges into opportunities and architect progress that shapes the world as we know it. We believe that true progress lies in the synergy of digital technologies and sustainability. By harnessing innovation and environmental consciousness, we engineer solutions that not only enrich lives but also safeguard our planet. Through the unique intersection of data, AI, integration, and automation, engineers have become one of the driving forces behind sustainable transformation, leveraging smart engineering to pivot nations towards a greener and more resilient future. At Johnson Controls India, we go beyond the equations and blueprints – our engineers embody a relentless pursuit of excellence, and their work impacts every facet of our existence. From the smart and sustainable buildings that define our urban landscapes to the cutting-edge digital technologies that make our lives safer and more comfortable, they are the changemakers crafting sustainable solutions to safeguard our planet’s future.” Bijan Mohanty, Head of Engineering & Application Development, Digit General Insurance “Engineers are the true architects who draw the blueprint of growth and transformation for any nation. They truly are the catalyst in turning dreams into reality and it is no wonder that we have one of the largest engineer populations in the world. All sectors—from technology, communication, medicine, to infrastructure, energy, pharma and space—depend on innovative solutions of engineers to drive change. Creating good engineers is the easiest recipe for any country to fuel growth. On this occasion of Engineer’s Day, I’d like to salute the perseverance of every engineer and hail the role they play in building a brighter future for our nation.” Mr. Anji Maram, CEO and Co-founder of CriticalRiver “While After COVID-19, the role of engineers became more pivotal than ever. They steered the rapid digital transitions, ensuring that businesses, educational institutions, and essential services remained functional and efficient. Engineering teams play a key role in helping clients navigate challenges and seize new opportunities in a dramatically altered landscape. Through automation, artificial intelligence, and machine learning, IT engineers are streamlining business operations, driving efficiency, and reducing costs. By harnessing the power of big data, they’re enabling businesses to make more informed decisions, predict trends, and tailor experiences for their users. At CriticalRiver, our IT engineers are not just problem solvers; they’re visionaries paving the way for a more interconnected, efficient, and innovative future.” Mr. Karun Tadepalli, Founder and CEO of byteXL “Historically, students have pursued engineering solely as a means to securing high-quality jobs. What they do not understand is that being mere engineers in the current times may not be relevant unless students and freshers upgrade their skills and adopt new technologies. We live in the times of AI which will automate many facets of engineering. While domain knowledge is necessary to understand the details of the work at hand, one must be in the process of continuous learning and upgrading skills to keep up with market demand. A paradigm shift is occurring in specialized roles, and despite AI automation, human input is still crucial. A practical approach to complex problem-solving should be taught to students in order for them to be competitive in the age of Artificial Intelligence.” Mr. Suresh VP, COO and Co-Founder, Experion Technologies “In the post-COVID times, we’ve witnessed remarkable digital transformations and global business advancements, all thanks to the relentless efforts of engineers worldwide. They spearheaded cloud-based platforms that ensured business continuity when the world needed it most. IoT and AI played a pivotal role in healthcare during the pandemic, monitoring patient health and enabling remote care. Post-COVID, these technologies have continued to thrive, giving birth to contactless solutions that are now an integral part of our everyday lives. To add on, immersive AR\/VR experiences in healthcare enabled remote patient consultations, while virtual tours transformed the landscape of travel and education.” Sudhir Goel, Chief Business Officer, Acer India “Engineer’s Day is a celebration of innovation, dedication, and the relentless pursuit of progress. In India, our engineers are the architects of transformation, bridging dreams with reality. Today, we salute the unwavering spirit of our engineering community, whose brilliance shapes a brighter future for our nation and the world.” Bhuvaneswari Veerasamy, VP – MENA Services of Bahwan CyberTek ”India’s engineers are force enablers. Growing up as part of the ISRO family surrounded by scientists, I was introduced to the numerous possibilities of technology and engineering fueling the country’s growth. Today, as the VP – MENA Services of Bahwan CyberTek, I am witnessing business priorities shift towards sustainable technologies and ESG. As we step into a future of AI and sustainable growth, our engineers will play a critical role in innovating, developing, and deploying green technologies capable of building a better and safer future. In addition to delivering value, successful business outcomes, and better experiences, our engineers will play vital roles as sustainable growth architects. India is now THE start-up hub with over 90,000 start-ups and several unicorns – a testament to the quality of our engineers and their business acumen, which play a critical role in driving India’s economy. Our growing talent base, encouraging government policies, and our growth appetite will strengthen India’s position as the global engineering hub. The industry drive towards creating inclusive and diverse workplaces by enabling flexible work policies, increasing emphasis on creativity & innovation and providing continuous learning opportunities will drive holistic and sustainable growth.” Gomethieswari G M, Data Scientist, [24]7.ai: “World Engineers Day is a vivid reminder that dreams can be reality, no matter how many obstacles lie in your path. I come from a background where education for women was not the norm. I remember waking up at 3:00 AM every morning to commute 50 kilometers daily to a nearby city to attend college. The challenges were as vast as the distances I covered, but through it all, I learned that perseverance is the only fuel potent enough to keep us going. To all aspiring women engineers, remember that your dreams are valid, and your potential is limitless. Don’t be afraid to step out of your comfort zone and make your mark in this ever-evolving world of engineering . As women engineers, it is our collective responsibility to stand shoulder to shoulder, to uplift one another, and to inspire the generations that follow to shatter the glass ceilings that challenge our potential. Happy World Engineers Day!” Deepak Visweswaraiah, VP, platform engineering, and site managing director, Pegasystems, India “Today, technologies are emerging and evolving at lightning speed. We are witnessing technical strides in capabilities as companies are adopting disruptive technologies to create more value and achieve operational efficiencies across the enterprise. Generative AI has made a loud entrance this year and has shown its potential to bring a transformative business impact. Next-generation technologies and tools are enhancing developer productivity and non-developers could benefit soon as well. These technologies include artificial intelligence, machine learning, low-code and no-code platforms, automated integration, SaaS amongst others leading to a concept of autonomous enterprises. Behind all fast-approaching developments lies heavy engineering and tech-driven innovation of today’s engineers. They have proved to be the true harbingers of the tech revolution, facilitating the functioning of modern society. As the world becomes ever more digitally connected, the demand for engineers will only skyrocket. Businesses need to be on top of the talent market, ready to respond in a dynamic tech industry, and deliver value to the engineers they wish to retain.” Hema Sharma, Technology Director, Wells Fargo India & Philippines “These are exciting times for engineers. The amalgamation of revolutionary technologies has opened up possibilities that were hitherto unfathomable. With the next generation code being written by neural networks and machine learning software, engineers will be able to shift attention to more value-add activities and on resolving the pressing issues of today’s world. Few such initiatives could be focussing on preventing cybercrime via trust architectures such as Blockchain-powered distributed ledgers, making radical improvements in mobility, healthcare, manufacturing and retail by leveraging connectivity powered by 5G and Internet of Things (IOT) and propelling the Bio revolution through the use of AI and automation. From being individual contributors, engineers are now increasingly working in multi-disciplinary, cross-functional teams that focus on resilient and sustainable products that solve real-life problems. The ambit of software development too is expanding wherein engineers are not just developing bespoke software to solve a single problem for a customer or client, they are in parallel looking at environmental and social impact of the software. This has led to the trend of integrating clean tech trends in design and development approaches. With proliferation of digital data, coming years will continue to focus on leapfrogging computing power (think Quantum AI!) and reducing cost and size of storage through adoption of multi-cloud and memory disaggregation. In light of the industry’s emphasis on research and innovation that requires diverse and multi-pronged thinking, the tech industry now has a better appreciation of the need to have a diverse workforce, -this presents a golden opportunity for women to embark on engineering careers. A massive opportunity awaits engineers as they lead the path of technological progress that according to think tanks, can outdo in a decade, the progress of the preceding 100 years put together. All engineers, onward ahoy!” Kavitha Shivakumar, APJ, Human Resources Director, Commvault “As we celebrate Engineer’s Day today, it’s essential that we bring a glaring issue into focus—Women’s Equality in Engineering. While we have come a long way in dismantling the shackles of gender disparity, the engineering landscape has been, for far too long, an uneven playing field. Gender diversity isn’t just an HR statistic; it’s a business imperative and a catalyst for innovation. When we welcome women into engineering roles, we are enriching our teams with diverse perspectives that reflect the multifaceted world we operate in. It’s a proven fact that diverse teams are more creative, productive, and better at solving complex problems. Yet, despite accounting for more than half of the world’s talent, women remain underrepresented in the engineering profession. According to statistics from World Bank, India boasts one of the highest global percentages of female graduates in the STEM fields—science, technology, engineering, and mathematics—with nearly 43%. However, only 14% of professionals in research development institutions and universities who are scientists, engineers, or technologists are women. This gap isn’t just a talent gap; it’s a gap in possibilities, in solutions, and ultimately, in progress. The next gen leaders have the responsibility of supporting women through mentorship programmes, peer training, employee resource groups, induction, reskilling, and upskilling courses which in turn will help nurture their growth. The industry must nurture an ecosystem where innovation knows no gender for every individual to thrive in their careers and drive success.” Amiteshwar Dayal Seth, Managing Director, Technology (Data), Carelon Global Solutions India “We have observed a rise in demand for purpose-led innovation powered by data analytics and exponential technologies, such as AI. This innovation has the potential for positive impact on customer and employee experience, business success, and other organizational priorities such as sustainability. Engineers today have great opportunities to bring impactful transformation to lives. In healthcare, there are opportunities to leverage data, data-driven insights, and exponential technologies to address cost of care, enhance the consumer journey, improve patient care, and help people improve their health and wellbeing. At Carelon Global Solutions, we are reimagining healthcare to address some of healthcare’s complex challenges by leveraging technology to helping people lead healthier lives. We use AI to map and analyse the impact of social and behavioural factors on a person’s health along with physical symptoms. This helps inform care services as well as equips clinicians with deeper insights for their decision making. Our engineers are driving impact for millions in the US by leveraging digital technologies and analytics to digitize processes in health insurance, which helps improve the healthcare experience. India is at the forefront of global innovation primarily due to its startup ecosystem and young and abundant technology talent pool. Businesses with a presence in India should continue to invest in their talent pool with enhanced learning opportunities, collaborative environment, and opportunities to network with industry experts.” Manasvi Sharma, Vice President of Omnichannel Platforms at Lowe’s India “In the last decade, India has come to the forefront of technological prowess, carrying the baton of being the engineering hub for many global and homegrown organizations. At global capability centers such as Lowe’s India, engineers are playing a significant role in guiding how businesses can harness the power of data and how they choose to invest in cutting-edge technologies to fuel customer-centric and sustainable innovation. This scenario is going to be the mainstay for this ‘techade’ and it poses a unique opportunity for India’s engineers to redefine the global playing field. At a time when organizations are extensively exploring the business case of emerging technologies such as AI, ML, AR, VR, blockchain, etc., they are creating a steep dependency on engineering talent for strategic growth. This is a strong indication that the next generation of engineers needs to elevate their thinking and look beyond technology. Their role at organizations is no longer going to be of only problem solvers, but also as strategic partners who can translate technical brilliance into tangible business value. The demand for specialized skills will only magnify from here and I am excited to delve deeper into what I think is just the surface of an exciting future for engineers. At Lowe’s India, our engineering teams are a driving force in propelling Lowe’s journey to become the world’s most customer-centric, omni-channel retailer. From ‘search’ to ‘personalization’ to ‘supply chain’, they are building innovative products and platforms that are not only unlocking value proposition for the business but also shaping how customers shop omni-channel retail.” Rahul Sharma, Slack Country Manager, India, Salesforce “As we envision the future of engineering, several pivotal trends are set to transform the industry, fostering enhanced collaboration and productivity in the workplace: Artificial Intelligence (AI): AI’s integration into engineering processes will accelerate data analysis and optimise decision-making, enabling teams to work smarter. Augmented Reality (AR) and Virtual Reality (VR): These technologies will reshape remote collaboration by facilitating immersive design reviews and problem-solving sessions, transcending geographical barriers. Internet of Things (IoT): IoT’s integration will usher in real-time monitoring and data sharing, enabling swift issue resolution and data-driven insights. 5G Technology: The faster and more reliable communication enabled by 5G will revolutionise how engineers collaborate and share critical information. These trends reflect a dynamic landscape where innovation and collaboration are paramount. Embracing them will empower engineering teams to push the boundaries of what’s possible, ultimately shaping a more productive and interconnected industry.” Anita Christopher, Talent Development Head, Samsung Semiconductor India Research “Amid the current semiconductor revolution, women have a huge potential to stand at the forefront of creating ground-breaking innovation. As industry reports confirm, despite 43% of women entering STEM, fewer than 20% venture into electronics. These numbers make it imperative to create awareness, dispel myths, and inspire young girls through STEM education. Contributions of dedicated women in STEM organizations is essential to encourage young girls and budding talent to take up STEM roles. Within an organization, nurturing a culture of equal opportunities, work-life balance, and bias eradication remains paramount.” Ranga Kanapathy – Chief Transformation Officer, APAC Chief Delivery Officer’, Altimetrik “ A nation’s progress is intricately tied to its prowess in technology and innovation. India’s engineering landscape has significantly transformed, with engineers now serving as pivotal business enablers. In my journey, I have collaborated with outstanding engineering teams at the forefront of harnessing technology for positive change. The future of engineering lies in sustainable innovation. As we look ahead, I see remarkable trends shaping our industry, from integrating renewable energy sources and the rise of circular economy practices to the proliferation of AI-driven sustainability assessments. Engineers will be instrumental in integrating sustainable practices into digital business strategies. We can optimize resource utilization by harnessing data analytics, AI, Gen-AI, and IoT and implementing blockchain for transparent, sustainable supply chain management. Additionally, digital business enablement will see engineers creating frictionless CX, leveraging cloud-native technologies, and embracing DevOps practices for rapid innovation. The Indian engineering community is forging new paths through groundbreaking innovations, positioning themselves to excel in an increasingly competitive landscape while meeting industry demands. I urge all engineers to continue their pursuit of knowledge, embrace collaboration, and take pride in their role as architects of a more resilient and sustainable world. Together, we can engineer innovation and drive progress—one sustainable step at a time.” Madhusudhan Krishnapuram, VP, Product & Engineering & MD, GoTo. “India has a rich history of innovation and engineering excellence. Our journey as engineers is interwoven with the country’s rise as a global innovation hub. Our scientists and engineers have demonstrated immense creativity and value in building technologies for a world where adaptability and flexibility have become paramount. At GoTo, we celebrate our engineers who create transformative solutions that transcend geographic boundaries and enable people and businesses to navigate disruptions with agility and resilience. To empower the next generation of engineers and continue the nation’s tradition of driving cutting-edge innovation, skill development is crucial. Today, the technology landscape is highly dynamic and the skill sets required for engineers are constantly evolving. To ensure that our budding engineers are equipped with latest knowledge and best practices, we strive to provide comprehensive upskilling programs that include both technical training and leadership development. We must remember that the journey of engineering is a collective one, where everyone’s contribution adds to the tapestry of progress. This Engineer’s Day, together, let us continue to shape a brighter, more innovative and sustainable future that benefits the broader community we serve.” Ryan Cox, Senior Director, Co-Head of Artificial Intelligence, Synechron “Automation has been a fundamental component of technological advancement for decades, streamlining processes to enhance efficiency, minimize errors, and reduce costs. We are now entering a new era of intelligent automation, powered by artificial intelligence (AI), which takes these benefits to the next level. By incorporating natural language processing, AI-driven automation enables more intuitive interfaces and seamless integration across organizations. When combined with machine learning, these capabilities unlock immense potential for data-driven optimization, empowering teams to translate vast amounts of data into actionable insights that can transform operations. The applications for AI automation are extensive. Chatbots provide hyper-personalized interactions and access to knowledge repositories using natural language in customer service. In fraud prevention, AI analyses transactions to identify anomalies, while for employees, it eliminates repetitive administrative tasks such as scheduling and documentation through automated assistants. For developers, AI can boost productivity by automating coding, generating test cases, and identifying bugs. Analysts benefit from rapid summarization and insight generation, accelerating ideation and problem-solving. The impact of AI automation is that it enables skilled IT professionals to concentrate on higher-value strategic thinking, innovation, and better serving customers and the business. AI represents the next step in the evolution of intelligent automation and can help companies gain a competitive advantage by enhancing the efficiency of both people and processes.” Sameer Goyal, Director and Head of Engineering, Acuity Knowledge Partners “India has rapidly evolved into a global technology hub, with our engineers, developers, and innovators making groundbreaking contributions to various industries. On this National Engineering Day, I want to note some remarkable engineering innovations emerging from the tech landscape of India. India’s fintech sector has been at the forefront of innovation. From digital payments to lending platforms, Indian engineers have played a pivotal role in making financial services more accessible and efficient. The Unified Payments Interface (UPI) is a prime example. Developed by the National Payments Corporation of India (NPCI), UPI has transformed the way people transact, with millions now using their smartphones for seamless payments. Indian engineers have also been actively contributing to the fields of artificial intelligence (AI) and machine learning (ML) with many Indian startups and research institutions leveraging AI and ML to tackle complex problems, from personalized healthcare to predictive analytics in finance. Working with unstructured data has long been the hurdle for achieving complete automation of several key business processes. Leveraging advanced AI\/ML technologies to help in delivering automated extraction of information from unstructured financial documents, such as Cashflow statements, Balance sheets, and Annual reports, will help simplify the task of financial spreading for Investment Research and Lending Services customers. This National Engineering Day let’s recognize and celebrate these remarkable innovations that are shaping the future not only for India but for the entire world.” Krishnakumar Govindarajan, Global Chief Technology Officer, MiQ “On this National Engineering Day, we applaud the commitment of engineers across industries and sectors. Their creativity and perseverance drive innovation and progress in every aspect of our lives. In the ever-changing world of programmatic advertising, these creative minds are helping brands stay ahead of the curve. Engineers are bridging the gap between data and decision-making, between advertisers and their target audiences. They have designed algorithms that analyse vast and complex datasets and thereby tailor solutions for customers allowing advertisers to reach the right audience at the right time with the right message. Harnessing the potential of cutting-edge technologies such as GenAI and Large Language Models (LLMs) is imperative. These tools serve as invaluable aids in augmenting classifications and harmonising seemingly disconnected datasets. This synergy empowers our company to enrich, to extract richer and more profound insights from our data reserves and ultimately action on them. The industry of programmatic advertising stands tall on the foundation of engineers.” Sumana Kamath, Principal – Project Manager, Sabre “On Engineer’s Day, let’s honor the incredible innovations and unwavering commitment of Indian tech experts who are helping bring on the future, one byte at a time. In a nation where diversity flourishes, our engineers harness the power of unity in technology, creating solutions that bridge gaps, empower dreams, and redefine possibilities. We are the architects of progress, weaving code into the fabric of change and forging a future where innovation knows no bounds. As a woman tech leader, I proudly stand alongside the brilliant minds of India, where tradition meets innovation and where engineering is not just a profession but a promise to shape a brighter tomorrow. Among the countless innovations, one standout creation is Sabre Revenue Integrity. It’s not just a product; it’s the answer to a thorny problem. In the dynamic travel industry, we’ve engineered a platform that seamlessly optimizes an airline’s revenue streams, maintaining operational efficiency and customer satisfaction. These processes involve a range of strategies and technologies designed to identify and address potential revenue leakage, minimize fraud, and enhance pricing and inventory management.” Aveekshith Bushan, Vice president of the APAC region, Aerospike “In the dynamic realm of database management systems, engineers are the unsung heroes, constantly working behind the scenes to ensure that systems stay up and running 24\/7, whatever the circumstances, and developing new cutting edge applications that drive business success. As technology continues to evolve, it is data that fuels the machinery of transformation, but processing speed, predictable performance, accuracy and the cost of doing so, are just as important as the data itself. Engineers are behind the developments happening in this ‘techade’, playing a crucial role in shaping the modern digital economy where the development and deployment of real-time applications enable cutting-edge products and services. Engineers are the invisible force driving the seamless streaming of our favorite shows, the lightning-fast response of our cashless transactions, the great user experience in our favorite applications and the optimization of the services we rely on in our day-to-day lives. At Aerospike, our engineers are constantly innovating and building cutting-edge features that are helping companies in India and elsewhere build highly real-time applications that can ingest and lookup massive amounts of data to optimize speed and performance at an infinite scale while improving accuracy at the lowest cost. National Engineers Day is the perfect opportunity to celebrate the contributions of Aerospike engineers who play a crucial role in delivering outstanding products and services that continue to add value to customers across the globe.” Arun. K. Chittilappilly, MD, Wonderla Holidays “On National Engineer’s Day, I extend my heartfelt congratulations and appreciation to the engineers who bring the enchanting world of amusement parks to life. From designing roller coasters that defy gravity to creating immersive virtual reality experiences, engineers play a crucial role in pushing the boundaries of amusement park entertainment. Their attention to detail and problem-solving abilities ensure that every ride is not only exhilarating but also safe for millions of visitors each year. Thanks to their tireless efforts, amusement parks continue to be a place where dreams come true and unforgettable memories are made. As we celebrate National Engineer’s Day, Wonderla Holidays expresses its profound gratitude to our dedicated engineers. Their unwavering commitment to safety, innovation, and sustainability ensures that amusement parks continue to be a source of joy and cherished memories that last a lifetime”. Ajeya Motaganahalli, Vice President, Engineering and Managing Director, R&D, Pure Storage India “On this Engineers Day, we celebrate the spirit of human brilliance, creativity, and innovation that aspires to disproportionately impact our lives. From finding sustainable solutions to combating climate change, ensuring access to clean water, or developing technology to improve healthcare, engineers are at the forefront of addressing critical global issues. As the driving force behind progress, the impact of engineering craftsmanship is ubiquitous in every facet of our modern way of life. At Pure Storage, we too strive to push the boundaries of what’s possible, making technology more sustainable, reliable, efficient, and accessible to all” Vaishnavi Shukla, HR Head, Comviva “With the growing demand for skilled professionals in the ever-evolving tech landscape, Comviva has partnered with institutions, including prestigious colleges and universities. Our objective is to bridge the gap between demand and supply, especially in the field of engineering. To achieve this, we’ve established a dedicated “Finishing School” program aimed at equipping our new hires, particularly those from campuses, with the essential new-age skills required for their roles. We recognize the importance of cultivating talent with specialized skills in today’s dynamic environment. To further enhance our upskilling efforts and support our entry-level engineers in their career journeys, we’ve also partnered with universities in Bhubaneswar. By fostering a culture of continuous learning and providing cutting-edge resources, we empower our engineers to lead the way in shaping the future of technology through consistent breakthroughs.” Ashok Babu, Co-Founder and President, e-con Systems “Einstein once famously said, “Imagination is more powerful than knowledge”! When scientists discover the truths underpinning this universe, engineers bring imagination to life with whatever they create. With the combination of intuition and imagination along with sheer determination, the engineers create new things that never existed to make our lives easier, comfortable and push mankind ahead. At e-con Systems we celebrate engineers and engineering attitude, the bedrock on which we are building embedded vision solutions that will enable the machines to see and understand the world. With such autonomous machines, we envision the new world where these machines become true companions to mankind in every walk of our lives. As the Co-Founder and President of e-con Systems, I pay homage to the engineers responsible for transforming the wildest imaginations into reality, ultimately making the world a better place to live.” Vasan Sampath, CEO, Bounteous India “This Engineers day comes with the backdrop of Chandrayan’s moon landing and we need not look further for evidence of what good Engineers can accomplish if they set their minds to it. The goal of engineering is apply theory to practice to solve problems and make technological advances that help makes the world a better place. We are indebted to all the scientists for their theories and to the engineers for the application of theories in meaningful ways. But now we are in a world where on the one hand advances in science and technology are happening at breakneck speed and putting great power into the hands of scientists and engineers, but on the other we are experiencing the limitations of exploiting natural resources and the ever-increasing undesirable side effects of technological advancements that have intruded all aspects of our lives. Engineers today must take on the added responsibility of doing things keeping in mind the well-being of world we inhabit and future generations. I believe it has become imperative to weave ethics and systems thinking into the engineering curriculum and perhaps create the engineering equivalent of the Hippocratic oath.” Janani Lakshmanamurthy, Associate Director, Project Management, Bounteous “In today’s digital era of captivating AI & ML solutions, software companies must nurture an innovative cohort of socially responsible tech enthusiasts. Companies should carefully plan for the responsible use of AI by their workers, giving them autonomy to think differently than technology and algorithms while also working together with partners and customers to create innovative, valuable, and sustainable products and solutions. An organization should have development-oriented product managers and product-oriented software engineers to succeed in today’s competitive and complex data intelligent landscape.” Manish Bafna, SVP of Engineering at Responsive (formerly RFPIO) “National Engineer’s Day in India on September 15 celebrates the remarkable contributions of engineers shaping our world. This year’s theme, Engineering for a Sustainable Future, highlights the crucial role of engineers in creating a better and more environmentally friendly tomorrow. At Responsive (formerly RFPIO), we celebrate our talented software engineers for all the long hours and incredible progress they’ve made on our platform during the last year. We are fortunate enough to have environmentally aware professionals who are always trying to harness the power of software architectures to improve overall efficiency and reduce energy consumption. They play a vital role in building sustainable solutions that help our customers overcome their most frustrating response challenges. Responsive software engineers understand that every line of code has an impact. They strive to optimize software systems, making them more efficient and resource friendly. By employing techniques such as code optimization, caching and load balancing, they ensure that software applications run smoothly while minimizing energy consumption.” Moreover, Responsive software engineers embrace the principles of sustainable software development. They design software architectures that are modular, scalable and adaptable. This allows for easy maintenance, updates and integration with other systems, reducing the need for frequent replacements and minimizing electronic waste.” Sabarinath C Nair, Founder & CEO, Skillveri “Engineering is about a relentless pursuit for perfection balanced with optimization of valuable resources. Developing the right kind of skills is essential to minimize inefficiencies and prevent wasteful practices. Yet, the amount of training required itself results in significant materials wastage, especially in industrial activities like welding, painting, and blasting. At Skillveri, we have built transformative Extended Reality (XR) based solutions which deliver precise skill training while eliminating wastage and emissions. We take pride that we are driving innovation while engineering a sustainable future.” Michael P. Morris, CEO and Co-Founder of Torc “Software engineers that work effectively with teams across multiple geolocations are vital to developing solutions that quickly address global environmental and societal challenges, like energy management, waste reduction, and human and material resource optimization. They utilize hard and soft skills across various disciplines to create progressive technology and processes that fuel sustainable behaviors and have the expertise to leverage historical data and predictive analysis with AI to drive measurable change. Sustainability solutions are often complex in design and development, further making the qualities of successful software engineers key to empowering organizations, governments, and the community to find new ways of doing things that lead toward a more sustainable future.” Indra Prabha Sharma, Senior Director, Senior Director Quality Engineering, Publicis Sapient “GenAI is a game-changer for engineering, especially Quality Engineering (QE). Quality Engineering is the backbone of project delivery, and GenAI, along with its ready-to-use automation tools, injects a dose of creativity, efficiency, and valuable time for engineers to strategize end-to-end product quality. With GenAI, we’ve witnessed a remarkable transformation in QE. We have been able to streamline efforts significantly, while raising the bar for coverage and quality even higher than ever before. It’s not just about shifting from QA to QE; it’s a giant leap into the future, reshaping the landscape for quality engineering specialists. At Publicis Sapient, we’re committed to equipping our quality engineers with the skills they need to harness the power of AI and GenAI in their day-to-day testing. It’s about unleashing the potential of ready-to-use accelerators, giving our engineers the tools to propel us forward. Our focus is on fostering a learning mindset among our engineers, and encouraging them to stay up-to-date with the evolving technological landscape and provide relevant skill-building programs. We have also undertaken a strategic approach to transform our organization and our people on all things AI. We have a series of interventions lined up that are aimed at driving transformation of the organization and the way we enable impact through our work in the era of AI. That being said, it is important we acknowledge that GenAI tools serve as aids to primarily assist, these tools are not the be-all and end-all engineering. Human expertise will still have to play a pivotal role in refining AI-generated output.” Kuldeep Sengar, Group CTO – Netcore Cloud “In the ever-evolving world of engineering, our journey has been one of relentless innovation. As engineers, we are the architects of the future, constantly pushing the boundaries of what’s possible. Today, our skills encompass not only technical prowess but also adaptability, creativity, and a deep commitment to sustainability. The realm of MarTech has swiftly transformed the landscape of marketing, becoming an indispensable force driving businesses forward. Today’s MarTech engineers are the architects of digital transformation, wielding data-driven strategies as their tools of choice. In a world where competition is fierce and data reigns supreme, they craft personalized customer experiences, navigate the complex terrain of technology, and propel brands toward success. As we celebrate Engineer’s Day, let us inspire budding engineers to embrace innovation, adaptability, and a relentless pursuit of excellence, for they are the future leaders of a dynamic MarTech ecosystem, where every click, every insight, and every interaction holds the power to reshape the business world.” Ram Meenakshisundaram, Chief Technology Officer (CTO) of Virtusa Corporation “Technological advancements have significantly contributed to global progress, with engineers driving innovation and designing new solutions. Engineers are vital in pushing these changes, creating solutions, and driving impactful innovation. India is now a hub for tech innovation, fostering growth locally and abroad. At Virtusa, Engineer’s Day is special as we celebrate those shaping the future with their dedication to engineering excellence. Engineers drive innovation, progress, and vision. Aligned with our ‘Engineering First’ approach, this day signifies the essence powering our solutions, culture, and success. Engineering’s future is boundless; we lead with our engineers’ passion, turning challenges into opportunities.” Vipul Singh, CEO & co-founder, Aereo “One of the most important roles in society is of engineers. They are an extremely valuable resource in every organization. At Aereo, engineers are critical to developing innovative solutions that impact billions of lives. Whether it’s working on groundbreaking patents or taking our drone tech to greater heights, they are irreplaceable. As India transitions into a Global Drone Hub, engineers, especially in the drone industry will play a pivotal role. This Engineers Day let’s honour the timeless innovators who have helped us reach where we are and celebrate their accomplishments. Let us also do our part in upskilling the youth who will be the flagbearers of tomorrow and create a prosperous and sustainable world.” Sachin Alug, CEO, NLB Services “As a celebration of the field of engineering and its contributors, Engineer’s Day is observed on 15th September every year. An exciting yet volatile time for the STEM domains, the industry has seen it all of late. From rising demand for talent to mass layoffs in tech giants, the transformation of the engineering arena has been considerable. However, the rays of hope and promise continue to shine undeterred on the world of innovation and digital transformation. STEM fields have grown increasingly skill-centric. The focus has shifted significantly from experience-based or academic qualification hiring to purely skill-oriented talent acquisition. With this renewed emphasis on skills, the importance of upskilling and reskilling, too, has gained prominence across engineering fields. Today, emerging technologies like cybersecurity, cloud computing, big data, AI\/ML, etc. command the job market. Industries that have been essentially known as non-tech are going bullish on hiring a rising number of technology professionals across these areas. Sustainable innovation has emerged as one of the key focus areas for both businesses and governments. Amid the growing concerns around carbon footprint, climate change, and human-created ecological imbalances, the world of STEM is evolving rapidly towards environment-friendly policies, processes, and practices. The creation of green jobs across industries indicates the importance of ESG initiatives across organizations, allowing the scope to grow for environmental professionals in engineering. Diversity-oriented hiring is another critical facet of the evolutionary STEM industries. In order to bridge the gender gap in the STEM workforce where female participation is slightly over 30%, organizations are inclining toward extending equitable job and leadership opportunities to women. As per our recent study, about 4 million women have enrolled in online STEM courses over the past year. The proportion of women enrolled in STEM courses in India grew from 22% in 2019 to 32% in 2021. Although there is a long way to go before we achieve gender equity in STEM, the figures predict new and improvement times ahead for diversity and inclusion.” Prof. Rudra Pratap, Founding Vice Chancellor, Plaksha University. “In the new vision for engineers, traditional boundaries no longer apply. Engineers of the future must undergo interdisciplinary learning to address complex problems of the modern world. They should possess a strong foundation in digital technologies, understanding of the physical, natural, and economic world, teamwork skills and the ability to acquire new knowledge as required. Furthermore, a deep immersion in social sciences is vital for our engineers, so that they develop a broader social perspective and grow up as caring and compassionate citizens of the world.” Swayam Agrawal, Founder and CEO Aarika Innovations. Engineering is not just about building structures or machines; it’s about building a safer, more secure future for every individual. On this Engineer’s Day, I am reminded of my relentless pursuit to safeguard the invaluable assets of any organization – its employees. My journey has been guided by my unwavering commitment to human resource safety. Innovation and engineering are my tools, and compassion for every individual’s well-being is my driving force. I believe that every employee deserves to return home safely to their loved ones after a day’s work. As an engineer, I have a profound responsibility to create solutions that protect lives, uphold dignity, and ensure peace of mind. Together, let’s continue to engineer a world where safety is paramount, and every worker’s health and well-being are safeguarded. Happy Engineer’s Day to all the engineers who share this vision and work tirelessly to make it a reality!” Hari Krishnan Nair – Co Founder – Great Learning: “In the past two decades, the Indian IT sector has undeniably propelled us onto the global stage, harnessing the advantages of cost-efficiency and a vast pool of engineering talent. Yet, the evolving landscape of employer expectations and job dynamics is exerting a significant impact on the employability of our engineering graduates. As per think tank NITI Aayog, 48% of engineering students in 2022 were unemployed. Furthermore, the slump in fresher hiring within the IT sector has turned into a slope. According to data from leading staffing firm Xpheno, IT services giants are projected to reduce their hiring efforts by a staggering 40 percent in fiscal year 2024. What is even more disconcerting is the predominant lack of application-based knowledge of our engineering education. If we aspire to empower our graduates for a brighter future, it is imperative that the education sector undergoes a profound transformation to enrich the learning experience. The dearth of exposure to industry exposure and developments is a leading cause for poor employability rates among our graduates. As a result, graduates are increasingly turning to edtech companies to bridge the glaring industry-academia skills gap. In fact, more than 70 percent learners enrolled in Great Learning’s boot camp programs are freshers who hail from engineering background. This increase in demand can be attributed to the innovative methodologies utilized by edtech companies to bridge this skill gap through capstone projects that simulate real-world scenarios and application-oriented learning Furthermore, industry professionals serving as mentors ensure that students acquire relevant insights into the industry. In our quest for a brighter future for engineering graduates, it falls upon us to embrace innovative educational paradigms and cultivate robust industry partnerships. This is the path to enhancing their employability and equipping them with the skill set necessary to thrive in the perpetually evolving realm of engineering.” Ms. Prasanna Anireddy, VP, Engineering, Progress: “Many factors contribute to this gap, the biggest of which is the demand vs supply equation, which actually works against graduates. It is true that India has a very large population of engineering talent, but the quality of this talent needs a closer look. I feel that the current education system in India does not prioritize the development of practical skills, leaving graduates with a qualification that lacks hands-on knowledge. Take for example a computer science degree. Most graduates acquire theoretical knowledge of basic programming and algorithms but have not been able to transfer that knowledge to a real-world setting. Part of the problem is the college curriculum in most institutions, which has not been revised often enough to keep up with the rapidly evolving industry. The problem may also lie in professionals’ lack of genuine interest in engineering. Engineering is arguably the most commonly pursued career track in the country. However, the majority of the students pursue it as an outcome of groupthink. Very often, the perceived extensive industry opportunities and potential future pay scale push parents to encourage their child to pursue it while the child may not be truly interested in it. In this case, the student gets through the degree, meeting the bare minimum requirements which leads to subpar skills upon graduation. To address the demand-supply and skills gaps, a comprehensive approach is needed. Educational reforms, a cutback in intake in each graduating class, stronger requirements for institutions, and imparting of skills in the curriculum are needed in the education sector. For outside campus placements, graduates must be aware of the diverse opportunities and acquire the skills necessary in the job market. The reason behind unemployed engineers shifting to other sectors is two-fold. Firstly, lack of demand as compared to supply pushes graduates to explore broader career options in areas such as management, finance or entrepreneurship. This shift is an effect of the dearth of career opportunities. Secondly, changing societal expectations encourage graduates with passions outside of their degree to pursue fields of their identified talent and passion. This is a positive outcome and will hopefully result in a smaller but higher skilled graduate class in the years to come. Companies value experienced professionals, but they also recognize the potential in fresh engineering graduates. While they typically expect subject knowledge, they also value an individual’s ability to learn, and grasp new concepts. Organizations are more inclined to hire and invest in engineers who demonstrate a proactive attitude towards learning, adaptability and staying current with industry trends. While experience is valuable, a strong foundation and eagerness to learn are equally important for young engineers to secure great job opportunities.” Harmeet Chauhan, Global Head – Engineering Edge, Wipro Limited. “The future of engineering talent in India is bright, driven by a young workforce, sustained economic momentum, and disruptive technologies. New challenges across product development, operations, business, and technology — and the new Generative AI tools to address them — are why this is perhaps the most exciting time for engineers since the dawn of the computer age. To succeed in this fast-changing landscape, employers and engineers must prioritize upskilling, building trust, embrace failure as an opportunity for growth, and using AI responsibly. By fostering a learning and collaborative culture, we can create better opportunities for everyone, ensuring sustainable growth and success.” Anand Mahurkar, Founder and CEO, Findability Sciences “Engineers are the architects of our future, turning the impossible into the achievable. Software Engineers are the unsung heroes behind the digital revolution. They’re not just coding for today; they’re envisioning a future where technology serves as a force for good. Whether it’s creating apps that connect communities, algorithms that make sense of big data, or systems that protect our online identities, their work is the backbone of our digital existence. As we grapple with complex issues like data privacy and ethical AI, Software Engineers hold a unique position to ensure technology aligns with human values. In an era where every industry is becoming a tech industry, their role transcends the keyboard and impacts lives on a global scale. On this National Engineers Day, we celebrate these digital architects, knowing their innovations are shaping a future that is not just smart, but also just and equitable for all.” Vishnu Dusad, Co-Founder & Managing Director at Nucleus Software “On this National Engineers Day, we not only celebrate the innovation of our engineers but also their unwavering commitment to remaining at the forefront in this fiercely competitive fintech landscape. In the ever-evolving realm of fintech, where technology advances, regulations shift, and customer expectations morph, maintaining a leading position is absolutely vital. Continuous learning isn’t just a choice; it’s an imperative. At Nucleus Software, we foster a culture of learning through iLearn, an empowering platform that allows our team to pursue courses at their own pace and convenience. The aim of our program is to cultivate a culture of continuous learning within the organization. Particularly for fintech engineers, it’s crucial to embrace the latest tools, bolster cybersecurity, adopt UX\/UI trends, and master data analysis techniques. Achieving regulatory compliance, safeguarding financial data, and meeting the ever-changing demands of fintech customers serve as the litmus tests for success.” Shailesh Nalawadi – Head of Product – Sendbird “Engineers play an indispensable role as the architects of innovation in software technology. When it comes to communications technology, the importance of continuous upskilling cannot be overstated. Think about the shift towards the digital era in the early 2000s, to the social era with Facebook, Twitter, and Instagram in the 2010s, to now the virtual and AI era in the 2020s; all were driven by significant engineering breakthroughs. At Sendbird, a unicorn startup founded by four engineers, we understand that every line of code we write and every feature we build has the potential to impact millions of lives. It’s a responsibility we take seriously as part of our mission to build relationships in a digital world. It is also why we continue to invest heavily in R&D and engaging in the software engineering community.” Gaurav Mathur – Head of Engineering, HealthPlix Technologies. “With the ongoing digital transformation in healthcare, the role of engineers has become crucial. Our team of engineers is dedicated to developing solutions that bridge the gap between data and decision-making, ultimately empowering healthcare providers, such as doctors, with the necessary tools at the point of care. As leaders in a health-tech sector, we have actively collaborated with doctors to gain a deep understanding of the domain. We have engineered foundational and proprietary digital tools like Electronic Medical Records (EMRs), that not only improve doctors’ efficiency but also enhance patient care. Today, with the integration of frontier technologies like AI\/ML in Electronic Medical Records, we have played a central role in the manifestation of healthcare innovations. By leveraging AI, we are able to unlock the full potential of EMRs, enabling doctors to make more informed decisions and provide personalized care to their patients. In general, engineers are at the forefront of driving positive change, where technology empowers us in every facet of life”, said Gaurav Mathur – Head of Engineering, HealthPlix Technologies” Umang sangal Founder and CEO of Uplifters “The transition from engineer to educator wasn’t a shift but a natural progression. Armed with the expertise acquired during my engineering days, I embarked on a mission to upskill and empower others. This transformation was driven by a passion for continuous learning and a desire to equip the next generation with the tools they need to thrive. Today, on Engineer’s Day, I stand not only as an engineer but also as a mentor, guiding aspiring minds toward excellence. I firmly believe that knowledge is the most potent force for progress. Through upskilling programs, we empower individuals to dream bigger, reach higher, and engineer their own success stories. Engineer’s Day serves as a reminder that engineering is not confined to physical structures; it extends to the realm of ideas, innovation, and education. It’s a celebration of those who build both the foundations of our world and the minds that will shape its future. So, let’s continue engineering a brighter tomorrow, one filled with limitless possibilities and endless learning. Happy Engineer’s Day!” Sekaran Letchumanan, Vice President- Operations, Flex India. “It is clear that the engineering landscape is undergoing a profound transformation, with a significant boost to the manufacturing industry. Traditional disciplines are merging with technologies like robotics, AI, cloud computing, and IoT, necessitating an overhaul in the curriculum . Education institutes should also encourage students to explore different engineering streams to cultivate diverse skill sets. In this era of Engineering 4.0 reshaping the global economy, collaboration among educators, entrepreneurs, and governments is crucial to prepare the future workforce for a dynamic and interdisciplinary future”. Rafiq Somani, Area Vice President, INDIA and South Asia Pacific at ANSYS Inc. “Engineers are the architects of tomorrow’s reality – where innovation meets precision. On this National Engineers’ Day, as we celebrate the brilliant minds that shape our future, I am honoured to represent Ansys, a leader in engineering simulation. Ansys is not just a company; it’s a hub of innovation powered by a diverse community of engineers driven by a shared passion for pushing boundaries. As we embrace the challenges of our ever-evolving world, we recognise that our role is to adapt to change and drive it. Engineering is the bedrock upon which progress is built. Our cutting-edge simulation technology empowers engineers across industries to bring their boldest ideas to life. It is the very essence of what we do – providing tools enabling engineers to simulate, optimise, and innovate. Our commitment to engineering excellence is reflected in the products we create and the brilliant engineers who call Ansys home. Our engineers tackle the world’s most complex problems, whether improving the efficiency of electric vehicles, optimising the aerodynamics of aircraft, or enhancing the safety of medical devices. Engineers are not just problem solvers; we are the creators of a sustainable future, engineering solutions that transcend the ordinary and drive progress. Together, with Ansys as a guiding force, we will continue to shape a world where innovation knows no bounds. Happy Engineers’ Day to all the engineers around the globe. Our journey is relentless, our potential limitless, and our impact immeasurable!” Mohammed Atif, Director, Business Development India, Park Place Technologies. “At the core of the digital revolution, engineers, particularly those in data center management, ensure the seamless flow of data that powers our interconnected world. As society’s data demands surge, the role of engineers grows increasingly critical. This era witnesses the convergence of technologies, creating new job roles and altering skill requirements. To meet this demand, industry and academia must collaborate, crafting targeted curriculum for the necessary skillsets. These skills extend beyond technical expertise and should include essential human qualities such as curiosity, creativity, empathy, and soft skills. Engineers remain the architects of reliability and efficiency in our connectivity-driven age, driving innovation for a secure, connected, data-driven world.” Ajil Antony – Head of Microsoft Practice at Marlabs LLC “India has a huge and diverse pool of engineering talent that drives its IT sector, which is expected to touch $245 billion in revenue by FY23. With over 1.5 million engineers graduating every year, India has the potential to become a global hub for innovation and technology development. However, to realize this potential, India’s engineering workforce needs to be equipped with the skills and competencies that are relevant for the rapidly changing industry demands. One of the key challenges facing India’s engineering talent is the need for continuous skilling and upskilling in emerging technologies such as artificial intelligence, machine learning, cloud computing, internet of things, big data analytics, blockchain and devops. NASSCOM estimates that these domains will require reskilling of over 40% of India’s total workforce in the next five years. In order to stay relevant in the era of AI, engineers need to also cultivate new abilities such as creativity, critical thinking, problem-solving and collaboration. These abilities are essential for engineers to adapt to the changing nature of work, where they will have to interact with intelligent machines, work in cross-functional teams, and solve complex and novel problems. Engineers who can combine technical skills with human skills will have a competitive edge in the IT industry and will be able to create value for themselves and their organizations. One of the challenges is to narrow the gap between industry and academia for engineering talent. There is often a discrepancy between the curriculum taught in engineering colleges and the skills needed by employers. This results in a low employability rate of engineering graduates, which is estimated to be around 20%. To tackle this gap, there is a need for more cooperation between industry and academia to design and deliver relevant and quality education that matches the current and future needs of the industry. India’s rise as a key talent location for global capability centers (GCCs) shows the strength and potential of its engineering talent. GCCs are offshore centers of multinational companies that provide strategic services such as research and development, innovation, analytics and digital transformation. India hosts more than 1300 GCCs across various sectors, employing over one million people. These GCCs offer opportunities for India’s engineering talent to work on cutting-edge projects and solutions that have a global impact. Software exports, which are a major part of India’s service exports, is expected to drive the growth of the domestic GCC market from the current $45b to $110b by 2030. By nurturing and enabling India’s engineering talent, we can enable them to create solutions that enhance prosperity and welfare for our customers and communities worldwide.” Pankaj Sachdeva, Vice President, Data Science & Analytics and Managing Director, India Innovation, Pitney Bowes “India’s engineering talent base has experienced phenomenal growth and evolution over the years, positioning the country as a global powerhouse of innovation and technical expertise. This transformation is a testament to India’s commitment to fostering a culture of excellence in engineering. In today’s dynamic landscape, the need for skilling and upskilling India’s engineering workforce is critical. Technology evolves rapidly, and engineers must continuously adapt to stay relevant. To navigate the current business landscape, there should be an emphasis on domain understanding and business acumen alongside technical expertise. At Pitney Bowes, we recognize this and have invested in robust learning and development programs that empower our engineers to not only embrace new technologies but also gain business understanding to build customer centric mindset. Bridging the industry-academia gap is pivotal in nurturing engineering talent to ensure that engineering education aligns with real-world industry needs. Pitney Bowes actively engages with educational institutions to co-create curricula, offer internships, and provide mentorship, enhancing the employability of graduates. India’s emergence as a critical talent location for Global Capability Centers (GCCs) has been a game-changer. These centres leverage India’s rich talent pool to drive global operations. Pitney Bowes, for example, has a prominent GCC in India, where our engineering teams contribute significantly to our global initiatives. This showcases the nation’s prowess in engineering and innovation. Pitney Bowes is deeply committed to nurturing and empowering India’s engineering talent. On Engineer’s Day, we celebrate the dedication and potential of these professionals. Together with India’s engineering community, we continue to shape a brighter, innovative future.” Gopikrishna Balijepally, Senior Vice President, Hitachi Vantara India “On the global platform, Indian engineers are at the forefront of driving revolutionary transformations across a wide spectrum of domains, including social, business, and scientific arenas, thanks to their remarkable ingenuity and technical expertise. They tackle critical societal issues, from clean water to healthcare, offering innovative sustainable solutions that enhance millions of lives. Leading the charge in developing cutting-edge tech, enabling businesses to embark on their digital transformation journeys, streamlining operations, enhancing productivity, redefining industries with AI, Data analytics, automation, Indian engineers are instrumental in fostering economic growth and competitiveness across the business world. They also make significant contributions in the fields of renewable energy, biotechnology, and space exploration. Today, their dedication, skills, and vision are instrumental in shaping a brighter future for society, revolutionizing business practices, and pushing the boundaries of scientific discovery.” Ashish Saraf, VP and Country Director for India, Thales “At the heart of Thales, we have a community of engineers who are the foundation of everything we do. National Engineers Day gives us a perfect opportunity to celebrate their invaluable contributions. Combining a unique diversity of expertise, talents and cultures, thousands of engineers at our Engineering Centres in Bangalore and Noida work on extraordinary high-technology solutions across defence, aerospace and digital identity & security sectors for Indian as well as global projects.” Mr. Sandeep Agarwal, EVP, Digital Business Services, Visionet Systems Inc. “On this Engineer’s Day, as we celebrate the spirit of innovation and the incredible strides made in the world of Engineering, under the theme of ‘Engineering for a Sustainable Future,’ it is crucial to recognise that it is our collective efforts that hold the key to a sustainable future. At Visionet Systems, we understand that sustainability is not just a theme but a responsibility we all share as engineers and technologists. We’re not only dedicated to celebrating the brilliance of engineers but also nurturing the next generation of tech enthusiasts. Together, we’re building a world of possibilities, one engineering marvel at a time. In line with this vision, we proudly present our groundbreaking platform, VisionTechFest2023, a pioneering multi-track event designed to bridge the gap between students and the engineering industry, comprising startups and industry experts. For students, it’s an immersion into the industry, and for professionals, it’s a continuous journey of innovation. We’re thrilled to host the second edition of this technology festival, bringing together expertise and enthusiasm to build a more sustainable and tech-driven future. Let us, as a community of engineers and technologists, rededicate ourselves to innovation, sustainability, and the relentless pursuit of engineering excellence.” K.V. Sudha, Head – Talent Acquisition, Dell Technologies India. “At Dell Technologies, our team of industry’s finest engineers with cutting edge technical skills , work relentlessly with an unwavering commitment to innovation, incubating and delivering new products and regularly filing patents. They play a pivotal role in helping us achieve our growth objectives consistently. On this Engineers Day, we extend our heartfelt appreciation to all the engineers who serve as a cornerstone of our innovative efforts, not only enabling us to provide cutting-edge solutions but also equipping our partners with the latest enterprise solutions across various IT domains.” Amit Kumar, CEO and Co-founder of RAMP Global “Engineer’s Day reminds us of the transformative power of engineering in our lives. Having an engineering background, I am reminded of the significant impact education has on determining the future because of my engineering background. It instills technical knowledge and a mindset of relentless curiosity, problem-solving, and innovation. Engineers are the architects of progress. We bridge the gap between imagination and reality, designing solutions that make the world a better place. Our work extends far beyond the drawing board, encompassing a commitment to sustainability, safety, and the betterment of society. On this day, let us not only honor the engineers who have paved the way but also inspire the engineers of tomorrow. Each day, we face new challenges, and each challenge is an opportunity to apply our skills, creativity, and dedication to create a brighter future. Together, let us continue to innovate, build, and engineer a world that thrives on knowledge, compassion, and progress.” Sathesh Murthy, Managing Director and Engineering Head (India), RingCentral “Engineering is the driving force behind our nation’s innovation, progress, and growth. Through their vision and dedication engineers have molded the world we live in today and hold the key to a brighter and more sustainable future. It is critical to address the persisting skill gap that faces our engineering landscape on this Engineering Day in India. To address this issue and fully utilize our skills, we must take a comprehensive approach that includes collaboration, skills development, and empowerment. Engineering education must be modernized by embracing cutting-edge technologies and real-world applications. Practical learning, internships, and exposure to industry projects should be incorporated into our curriculum to provide students with the skills that the industry requires. As a result, we must transition toward project-based learning, internships, and cultivating an innovative culture. To minimize issues in engaging people, companies should invest in employee development, recognize and reward creativity, and encourage diversity and inclusion. Together, we can take India’s engineering potential to new heights, fostering innovation and moving our country into a brighter future.” Karthikeyan Sridossan, Executive Vice President – Strategy & Growth, Indium Software. “Engineering plays a critical role in creating a sustainable future. It entails to developing solutions that meet current demands while also preserving resources for future generations. This encompasses various aspects such as environmental responsibility, renewable energy, optimized resource utilization, and ethical implementation of IT. Engineers use life cycle assessments to guide architecture choices, foster innovation through research, and advocate for sustainable policies. Engineering for sustainability is enduring dedication to tackle global challenges like climate change and resources scarcity, while fostering a resilient and equitable society. Indium supports this commitment by offering solutions that reduce energy consumption, enhance resource efficiency, and enable responsible data management. This includes data analytics for ESG insights for the financial sector, a carbon calculator for measuring enterprise carbon footprints, and an E2E data governance framework for the energy sector to facilitate renewable energy integration and a greener future. Engineers serve as pillars in the pursuit of sustainability, playing an indispensable role in its realization.” Aalok Kumar, Corporate Officer & Sr VP-Head of Global Smart City Business, NEC Corporation & President and CEO, NEC Corporation India “In the contemporary world, technology has seamlessly woven itself into the fabric of our lives, serving as the foundational blueprint upon which diverse aspirations for a robust and inclusive future are being constructed. Engineer’s Day provides us with an opportunity to acknowledge and commend the pivotal role that engineers play in shaping societies, fortifying infrastructure, and cultivating a safer, more efficient world. Engineers are the bedrock of a thriving society and economy. At NEC, we harness the transformative potential of cutting-edge technologies such as AI, ML, blockchain, and biometrics. These tools have swiftly evolved from mere buzzwords to essential assets in governance and public service. They empower our engineers to make informed decisions, optimize resource allocation, and enhance security, creating a transparent and efficient society where citizens actively engage in governance. This Engineer’s Day, we celebrate our government’s unwavering commitment to bolstering research and development, exemplified by initiatives like the Centers of Excellence for AI. These centers serve as crucibles where innovation transforms into reality, benefiting not only our nation but also the global community. Through these endeavours, we pave the way for a resilient, technology-driven future for India and the interconnected world. Engineering isn’t just a profession; it’s a covenant between human ingenuity and challenges. As we engineer solutions for a more resilient world, let our innovations serve as the cornerstones of a brighter tomorrow. On this day, let us rekindle our dedication to innovation, sustainability, and inclusivity, crafting a flourishing world for generations to come.” Sekaran Letchumanan, Vice President- Operations, Flex India. “It is clear that the engineering landscape is undergoing a profound transformation, with a significant boost to the manufacturing industry. Traditional disciplines are merging with technologies like robotics, AI, cloud computing, and IoT, necessitating an overhaul in the curriculum . Education institutes should also encourage students to explore different engineering streams to cultivate diverse skill sets. In this era of Engineering 4.0 reshaping the global economy, collaboration among educators, entrepreneurs, and governments is crucial to prepare the future workforce for a dynamic and interdisciplinary future”. Pradeep Narayanan, President, NIIT Digital and Growth Initiatives, NIIT Limited. “Engineering stands as the cornerstone of progress for any nation. At NIIT, we deeply value the immense contributions of engineers to our country’s development and advancement. Our mission has always been to empower, support, and enable the brilliant talent of our nation to fully realize their potential as engineers, capable of crafting innovative solutions for tomorrow. Throughout the years, we have nurtured young graduates by equipping them with essential skills in high-demand fields like computer science and information technology, thereby playing our part in building a skilled workforce for our nation’s future.” Pamela Kundu, Senior Director, Sales Engineering at UiPath “Engineers today are the architects of innovation who continually seek to enhance the quality of products and services. Consider smartphones, the daily metro systems we rely on, and even the indispensable laptops we use for work – these remarkable creations stand as shining examples of engineering marvels. And soon, these products and services will be further enhanced as engineers leverage AI-driven automation and Computer Vision. Engineers would be able to harness these technologies to elevate the standards of what is possible. They can champion operational excellence by proactively monitoring industrial processes and swiftly addressing challenges with software robots. Real-time insights will empower them to maintain peak performance and ensure the seamless flow of production. Today, engineers drive efficiency improvements by automating critical tasks and integrating AI for informed decision-making. In doing so, they pave the way for a future where engineering is synonymous with excellence. On this day, we celebrate these visionaries who engineer a world of limitless possibilities, efficiency, and quality.” Amit Gautam, Co-Founder & CEO of Innover. “Engineers worldwide have helped push the boundaries of what is possible in the world of technology. They stand as the visionary architects who are meticulously shaping the future of innovation and progress. At Innover, right from infusing intelligence into business ecosystems through data engineering, to developing cutting-edge applications and software at pace, our engineers have been the driving force behind transforming our customers’ businesses. They have helped us bring the immersive Metaverse powered contact centers to life, engineered Blockchain solutions that provide real-time visibility to make supply chains resilient, and spearheaded numerous other ground-breaking digital initiatives thus powering productivity and ROI-driven outcomes for Fortune 1000 customers. Now by embracing the potential of Generative AI, we are not just stepping into the future – we are architecting it. It’s our endeavour to help enterprises enhance the value and impact of their Gen AI models by fine-tuning them basis business contexts and seamlessly integrating them into their core business functions. This pioneering approach will usher in a paradigm shift, fundamentally transforming the way they operate. With their unwavering dedication and unparalleled expertise, our engineers have not only conquered complex business challenges with remarkable speed and scale but have also achieved industry-leading customer satisfaction scores, setting a benchmark for excellence. As we celebrate National Engineering Day, we want to express our deepest gratitude to our engineers, who have made all of this possible. Together, we are building a brighter future where innovation knows no bounds, and the possibilities are truly limitless.” Sanket Atal, Managing Director, Operations & Site Lead-Technology, Salesforce “Engineers today are one of the key driving forces behind innovation and technological advancement, playing a pivotal role in shaping our nation’s digital future. As we are now embracing emerging technologies like Generative AI, data analytics, and cloud computing, we find ourselves at a crucial turning point where the need to accelerate skilling engineers is paramount. Looking ahead, we envision a future where technology transformation and talent continues to be the cornerstone of India’s growth story. With Trailhead, our free online learning platform we are focused on nurturing talent across different phases ensuring individuals are ready for jobs of tomorrow through strategic partnerships across academia and industry bodies, recognizing this as a vital element for the evolving economy’s success.” Sukesh Choubey – Technology Consulting Leader, EY Global Delivery Services “In an era defined by technological advancements, engineers stand out as architects of the modern society, shaping the world from iconic constructions to space exploration. Their unwavering dedication to problem-solving and adaptability in an ever-changing landscape is instrumental in building a future where communities, economies, and ecosystems are better equipped to withstand and recover from adversity. At EY, we celebrate our engineers and their successes, and we believe in a ‘culture of innovation’ – promoting a common currency for our out-of-the-box thinkers, for those ‘crazy’ yet confident mavericks. The ones who believe in driving disruptive and or non-conformist ideas to create a better working world. Our engineers are reimagining the future of business by putting technology and people at the heart of everything we create. As we look ahead, it is evident that engineering will continue to be a cornerstone in constructing a more resilient and sustainable world for future generations. Their contributions remind us that in the face of challenges, engineering is not merely a profession; it is a beacon of hope and progress.” Sachin Panicker, Chief AI Officer, Fulcrum Digital “On Engineer’s Day, we celebrate India’s ascendancy as a global technology leader, a nation whose engineering acumen has not only steered our country’s own growth trajectory but is also a model for the world. At Fulcrum Digital, we pursue engineering excellence, consistently charting new horizons in cutting-edge technology and artificial intelligence. Our engineering talents, based out of the Pune Global Delivery Centre, craft digital solutions that embody India’s ‘Make in India, Made for the World’ ethos, where every innovation represents a testament to our commitment to global progress. We take immense pride in taking the ingenuity, precision, and determined spirit of Indian engineering to the global stage. On this Engineer’s Day, we honour the relentless innovators who continually elevate India’s standing in the digital era. Together, we script a narrative where our engineering prowess not only inspires but also defines the frontline of global technological advancement.” Lakshmi Mittra, Senior Vice President and Head, Clover Academy “In today’s highly digitized world, engineers play a critical role in developing and deploying new technologies that shape our lives. Hence, on Engineer’s Day, we celebrate the architects of our digital future. From the software that powers our smartphones to the infrastructure that keeps our cities running, engineers have been pivotal to the progress of our society. The ever-advancing technology landscape demands engineers to keep their skillsets relevant and industry-ready. So, let us embrace reskilling and upskilling as a priority to propel us towards a brighter and more advanced tomorrow.” Dr. Mukesh Gandhi, Founder and CEO, Creative Synergies Group “In a world increasingly dependent on technology, engineers play a pivotal role in shaping the future. They drive the development of cutting-edge solutions that revolutionize industries and address critical global challenges. In India, the engineering sector is one of the largest of the industrial sectors, accounting for 63% of global collaborations. That being said, this industry is not devoid of its challenges. Technology is changing much faster today than ever before, and it calls for engineering professionals who can match their skill levels accordingly. While 61% of businesses in India have adopted agile skill-building solutions in their learning and development programmes, it is equally important to provide opportunities for employees to gain hands-on experience. At Creative Synergies Group, we are committed to ensuring that our engineering talent gets to upskill and apply their knowledge across business units. We have robust learning and development programs that provide our tech talent with the opportunity to learn from experienced resources internally and through external resources. Creative Synergies Group relies on deep tech expertise and we will continue to value and cater to our engineering talent, valuing their contributions to our next-generation digital engineering solutions.” Pradeep Seshadri, Head of Solutions Consulting, India, New Relic “Home to a large number of engineers, India’s tech industry has been at the forefront of innovation and its revenue is estimated to cross $245 Bn this year. From launching renowned SaaS platforms to accomplishing moon landings, engineers in India have pulled off some incredible feats. Their contributions play a pivotal role in driving the nation’s growth by regularly offering innovative solutions to the complex challenges encountered by businesses and governments. As IT infrastructures become more complex with the migration to the cloud and processes automation, engineers are at the heart of ensuring everything runs smoothly, so everyone experiences seamless digital transformation. But they are also under immense pressure to innovate and create new solutions while ensuring existing systems are running like clockwork. In a complex and distributed environment that can be quite a challenge. “As a leader in observability, New Relic empowers engineers to take a data-driven approach to planning, building, deploying, and running great software. Our all-in-one platform enables engineers to spend less time troubleshooting, and more time building innovative solutions and creating incredible customer experiences.” Sandeep Agarwal, EVP, Digital Business Services, Visionet “On this Engineer’s Day, as we celebrate the spirit of innovation and the incredible strides made in the world of Engineering, under the theme of ‘Engineering for a Sustainable Future,’ it is crucial to recognise that it is our collective efforts that hold the key to a sustainable future. At Visionet Systems, we understand that sustainability is not just a theme but a responsibility we all share as engineers and technologists. We’re not only dedicated to celebrating the brilliance of engineers but also nurturing the next generation of tech enthusiasts. Together, we’re building a world of possibilities, one engineering marvel at a time. In line with this vision, we proudly present our groundbreaking platform, VisionTechFest2023, a pioneering multi-track event designed to bridge the gap between students and the engineering industry, comprising startups and industry experts. For students, it’s an immersion into the industry, and for professionals, it’s a continuous journey of innovation. We’re thrilled to host the second edition of this technology festival, bringing together expertise and enthusiasm to build a more sustainable and tech-driven future. Let us, as a community of engineers and technologists, rededicate ourselves to innovation, sustainability, and the relentless pursuit of engineering excellence.” Vinod T Varghese, Human Resources Director, Alstom India. “Engineers Day is a celebration of innovation, alternate thinking and nation building. At Alstom these are elements that make us thrive in today’s competitive landscape. As the leading sustainable mobility provider worldwide, we are committed to enabling and nurturing our diverse talent for the uniqueness they bring to work each day. Aligned with the theme of 2023 i.e. Engineering Innovation for a more resilient world, our focus is on promoting diversity of gender, culture, background, thoughts and much more to spark innovation in the world of mobility. By bringing together people from diverse backgrounds and giving everyone the opportunity to contribute with their knowledge, skills, experiences and perspectives, we build on Alstom’s rich global legacy. Closer home, in India, our HR strategy is build incorporating key D&I elements and it is reflective from a gender perspective with the recruitment of young engineers under the YEG program, 58% of which are women. Regional diversity under the YEGP or infact our general hiring philosophy in India is also a key element to blend the diverse cultures of India in Alstom’s workspace. Further our focus on leveraging technical skills of retired defence veterans in rail space is already seeing success in terms of our operations and deliveries. While these are some examples, we firmly believe in the power of D&I as it has the ability to transform not just businesses but also the planet for a better tomorrow.” Pramod Sharda, CEO of IceWarp India and the Middle East “It is a universal fact that science and technology are the spine of any country to scale up its growth development. Similarly, for any country’s economy, investment in skilling and reskilling our engineers is a necessity to enhance their knowledge of both technical and vocational skills along with transferable and digital skills to make them job-ready. We have to train our young and aspiring engineers who are committed to driving development by adopting the best practices of Industry 4.0 to transform the industry. For this, the major area where we at IceWarp believe that the Industry and academia have to come together and take a step forward in building and filling the Industry-academia gap by incorporating skills-based courses in their curriculum of engineering degree.” Stanton Thomas, Senior Vice President of Sustainability Solutions at o9 solutions “At o9 Solutions, we embrace the profound responsibility of shaping a brighter, more sustainable future. Sustainability is not merely a choice; it is a moral imperative. We engineer hope and innovation for a world where technology and conscience unite to forge a sustainable legacy. o9’s cutting-edge planning technology provides businesses with invaluable insights, guiding them towards data-driven, sustainable decisions. Our innovative Digital Brain platform serves as a catalyst for transformative change, orchestrating supply chain optimization, waste reduction, and environmental stewardship. Also, o9 recently launched a broad set of full-spectrum sustainability solutions, including product and enterprise environmental footprint measurement, full traceability, ESG risk management, ESG-enabled business planning, sustainable sourcing, and supply chain circularity. The company’s commitment goes beyond providing solutions; together, we are constructing a world where every decision is grounded in the principles of environmental responsibility, ushering in a future where the seamless integration of technology and conscience paves the way for a brighter, greener tomorrow.” Mr. Raja Poladi, Head of India Development Center, Egen (formerly known as SpringML,Inc.) “As we celebrate Engineer’s Day, I am reminded of the incredible power of engineering to shape a sustainable future. At Egen formerly known as SpringML, Inc., we are committed to harnessing the ingenuity of our team to drive positive change. Our recent project exemplifies this commitment, as we collaborated with forward-thinking companies to combat climate change head-on. In a world where environmental concerns are at the forefront, engineering for a sustainable future is not just a choice but a responsibility. Our solution is a testament to the transformative potential of technology. By tracking, analyzing, and reporting on environmental data, we empower businesses to make informed decisions that not only reduce their carbon footprint but also contribute to a healthier planet. One of the key features of our solution is its ability to set aggressive targets and continuously monitor net-zero plans. This real-time monitoring allows companies to adapt and evolve their strategies, ensuring they stay on course towards a greener future. Additionally, our scenario situational analysis for emission reduction provides invaluable insights, enabling companies to optimize their resources effectively. The impact of our solution goes beyond environmental benefits; it also results in substantial cost savings. Reduced travel, lower building energy consumption, and optimized electricity usage all contribute to a healthier bottom line for businesses. On this Engineer’s Day, let us celebrate the role of engineering in creating a sustainable and prosperous future for all. Together, we can engineer a world where innovation and environmental responsibility go hand in hand, leaving a lasting legacy for generations to come.” Hitesh Mehta, General Manager, Advanced Materials, Honeywell India “As an engineer, the ability to solve problems is a fundamental and indispensable skill that permeates our daily existence. Throughout my journey, I’ve undergone a personal transformation in my approach to recognizing and resolving the issues that cross my path. I’ve developed hunger to learn more and harnessed my technical expertise and skills to grapple with intricate challenges. Cultivating robust problem-solving abilities is paramount, as they serve as a catalyst for innovation, enabling us to make a meaningful impact. Innovation, can happen in multiple ways. It’s a mindset that empowers us to see the intricacies and obstacles as opportunities & navigate them with confidence and creativity. By pushing the boundaries of convention and thinking creatively, we can cultivate a mindset entirely dedicated to achieving breakthroughs and success. Personally, I place great importance on financial acumen both at work & in my personal life, as it empowers me to make well-informed decisions. Planning for the long term is important to safeguard both myself and my family against unforeseen challenges, and establishing a robust financial foundation. Effective communication is paramount to build and nurture relationships. This belief has proven invaluable in fostering harmonious connections with my team and those around me, benefiting both my professional and personal life.” Ms Krishna Vij, Business Head – IT Staffing, TeamLease Digital ‘India stands out as the world leader in producing engineering graduates, with approximately 1.5 million graduates annually. This impressive achievement reflects a dedicated effort to align educational programs with the ever-changing needs of industries, resulting in a larger pool of engineering graduates prepared for the dynamic job market. In 2023, the employability rate among Indian engineering graduates reached 57%, a significant improvement from the 46% reported in the previous year, 2022. This increase in employability reflects the shifting demands of the industry. India’s growing technology sector is driving a strong demand for skilled engineers, especially in emerging fields like Artificial Intelligence, Machine Learning, Data Science, IoT, and Cybersecurity. Alongside technical expertise, employers are increasingly recognizing the importance of soft skills like communication, teamwork, and adaptability in engineers. Moreover, India’s technology industry, characterized by its customer-centric approach and constant evolution, presents a promising job market for the next generation of engineers. Engineering hubs are gradually shifting from major cities to smaller towns. This transition is prompted by major global companies recognizing the untapped talent potential and cost-effective infrastructure in India’s tier-two and tier-three cities. Even in more traditional sectors such as Civil and Mechanical Engineering, there is renewed interest due to increased government investment in infrastructure development and manufacturing. Overall, the future of engineering in India is bright. Engineers who are proficient in the latest technologies and have a strong understanding of sustainability will be in high demand.”","filter_flag":1}
