{"title":"ESG exclusive 'club' puts pressure on agriculture - AgUpdate","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL2FndXBkYXRlLmNvbS9taWR3ZXN0bWVzc2VuZ2Vya3MvbmV3cy9zdGF0ZS1hbmQtcmVnaW9uYWwvZXNnLWV4Y2x1c2l2ZS1jbHViLXB1dHMtcHJlc3N1cmUtb24tYWdyaWN1bHR1cmUvYXJ0aWNsZV85OGFkN2E3NC1hNzFiLTExZWQtYmE2MC0xNzg0MGFmNmVmMWQuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL2FndXBkYXRlLmNvbS9taWR3ZXN0bWVzc2VuZ2Vya3MvbmV3cy9zdGF0ZS1hbmQtcmVnaW9uYWwvZXNnLWV4Y2x1c2l2ZS1jbHViLXB1dHMtcHJlc3N1cmUtb24tYWdyaWN1bHR1cmUvYXJ0aWNsZV85OGFkN2E3NC1hNzFiLTExZWQtYmE2MC0xNzg0MGFmNmVmMWQuaHRtbNIBAA?oc=5","id":"CBMioQFodHRwczovL2FndXBkYXRlLmNvbS9taWR3ZXN0bWVzc2VuZ2Vya3MvbmV3cy9zdGF0ZS1hbmQtcmVnaW9uYWwvZXNnLWV4Y2x1c2l2ZS1jbHViLXB1dHMtcHJlc3N1cmUtb24tYWdyaWN1bHR1cmUvYXJ0aWNsZV85OGFkN2E3NC1hNzFiLTExZWQtYmE2MC0xNzg0MGFmNmVmMWQuaHRtbNIBAA","guidislink":false,"published":"Fri, 10 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=41, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL2FndXBkYXRlLmNvbS9taWR3ZXN0bWVzc2VuZ2Vya3MvbmV3cy9zdGF0ZS1hbmQtcmVnaW9uYWwvZXNnLWV4Y2x1c2l2ZS1jbHViLXB1dHMtcHJlc3N1cmUtb24tYWdyaWN1bHR1cmUvYXJ0aWNsZV85OGFkN2E3NC1hNzFiLTExZWQtYmE2MC0xNzg0MGFmNmVmMWQuaHRtbNIBAA?oc=5\" target=\"_blank\">ESG exclusive 'club' puts pressure on agriculture<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AgUpdate<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ESG exclusive 'club' puts pressure on agriculture - AgUpdate","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL2FndXBkYXRlLmNvbS9taWR3ZXN0bWVzc2VuZ2Vya3MvbmV3cy9zdGF0ZS1hbmQtcmVnaW9uYWwvZXNnLWV4Y2x1c2l2ZS1jbHViLXB1dHMtcHJlc3N1cmUtb24tYWdyaWN1bHR1cmUvYXJ0aWNsZV85OGFkN2E3NC1hNzFiLTExZWQtYmE2MC0xNzg0MGFmNmVmMWQuaHRtbNIBAA?oc=5\" target=\"_blank\">ESG exclusive 'club' puts pressure on agriculture<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AgUpdate<\/font>","source.href":"https:\/\/agupdate.com","source.title":"AgUpdate","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Stewardship\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Most farmers don’t like to be told what to do or how to do it. As an agricultural producer, you may think your greatest threat is Mother Nature or the next wave of pestilence to infect your crop or livestock. However according to some, the greatest danger to your livelihood involves your freedom to farm: Environmental, Social and Governance (ESG). “ESG is one of the most important issues facing us today, if not the most important,” said Jack McPherrin. McPherrin is the research editor and a research fellow with The Heartland Institute, a nonprofit, Chicago-based research and education organization. He has done extensive research into ESG and has published multiple articles outlining the basics of ESG, as well as its relation to free market. He described ESG as “a social credit score.” ESG is a new method to assess risk of an entity, whether a country, state, company or individual. It involves the interest of investors and stakeholders. “The capitalist system historically in America evaluated companies based on traditional financial metrics—profit, loss, producing what consumers want,” said McPherrin. “Now ESG rates a company based on climate mitigation and social justice.” What is ESG? Harvard Law School breaks down ESG into its three categories: • Environmental: energy efficiencies, carbon footprints, greenhouse gas emissions, deforestation, biodiversity, climate change and pollution mitigation, waste management and water usage. • Social: labor standards, wages and benefits, workplace and board diversity, racial justice, pay equity, human rights, talent management, community relations, privacy and data protection, health and safety, supply-chain management and other human capital and social justice issues. • Governance: corporate board composition and structure, strategic sustainability oversight and compliance, executive compensation, political contributions and lobbying, bribery and corruption. How are ESG scores compiled? ESG scores are determined by a group of international organization asset managers, executives and regulatory authorities, said McPherrin. Essentially, those who are invested in companies with a lot of purchasing power dictate ESG standards and scores. “ESG standards are very subjective. There’s no objective global standard for ESG,” said Mark McHargue, president of Nebraska Farm Bureau (NEFB). Agriculture metrics revolve largely around the “environment” component of ESG. Agricultural industries and individual farms could be scored based on land use or ecological sensitivity. McPherrin also noted impacts can be scored, such as impacts of pollution, impacts of solid waste disposal and impacts of fresh water consumption and withdrawal. Nutrient or chemical application can influence ESG ratings, as well. “Farmers do use pesticides and herbicides, and if people don’t understand how we do that—in a judicious manner of keeping all labeling requirements—you could potentially, arbitrarily, be denied a loan because of a standard that doesn’t have anything to do with your financial health,” McHargue said. Some regulatory authorities utilize assessment tools such as Aladdin Climate, which translates risks and opportunities associated with climate change into terms investors can understand when analyzing portfolios. Another tool is implied temperature rise (ITR), a temperature-alignment metric to infer potential climate change. What do ESG scores represent? Each assessment tool compares a factor against a standard, which is set by the regulating authority. The metrics used to score ESG are extremely subjective and cannot be qualitatively measured, said McPherrin. However, some in the corporate sector view ESG differently. Katherine Collins is head of sustainable investing at Putnam Investments, a global company with $170 billion in assets under its management at the end of December 2022. She said that ESG ratings can be as simple as a checklist. For example, putting a woman on the board of directors or planting carbon offset trees can boost ESG scores. “There is a part of the ESG practice that is very report-cardy, based on scores and rankings and ratings, and there’s some utility in that, but it’s not important in and of itself,” Collins told Wailin Wong during an interview on a Planet Money podcast titled “Two Indicators: The fight over ESG investing” aired Dec. 21, 2022. In addition, there are discrepancies based on what is scored. For example, a company that owned its fleet of trucks had a skewed environmental ESG score as compared to a similar company that did not. Companies with practices ranking lower against ESG standards will be scored poorly, as in the truck example, resulting in reduced or terminated access to capital and credit. Conversely, higher scoring companies will greatly benefit from ESG ratings. Another name for ESG is the “impact investing movement.” Many companies are no longer concerned with only quarterly profit or loss statements; now their portfolios reflect their social purpose. This has been ongoing for over a decade but is gaining publicity in the past three to four years, McPherrin said. “If it has a good ESG score, investments flow to it—loans, preferential contracting, tax breaks. It’s an exclusive club companies get to belong to if they are deemed successful in their ESG efforts,” said McPherrin. Moreover, ESG regulations extend beyond financial decisions. ESG could control what type of herbicide is used by row crop producers or ban the use of chemicals completely for a producer who enters a contract with a stakeholder company. How does ESG influence company decisions? To better understand the rationale behind ESG, you must first enter the corporate world of BlackRock, one of the leading corporations in the ESG movement. As a global investment fiduciary, BlackRock oversees $8 trillion, as of December 2022. It “owns basically a part of every publicly traded company,” said Wong during the aforementioned podcast. Wong interviewed Tariq Fancy, BlackRock’s first global chief investment officer for sustainable investing who was hired in 2017. Two years later, he left the company. Fancy perceived that the private sector could not control the markets as he wished. He alluded that only government control can fix the problems, can “regulate away the undesirable.” BlackRock CEO Larry Fink does not share his former sustainability chief officer’s skepticism. He said BlackRock’s focus is sustainability not because they are environmentalists, but because they are capitalists and fiduciaries to their clients. In his 2021 annual letter to CEO’s, Fink urged companies to set targets for short-, medium-, and long-term greenhouse gas reductions for net zero emissions. “We believe the companies leading the transition present a vital investment opportunity for our clients, and driving capital toward these phoenixes will be essential to achieving a net zero world,” Fink wrote. Net zero goes beyond compensating carbon emissions to eliminate greenhouse gas emissions. “Net zero” may also mean net zero profits for any entity or individual that does not conform to the pressure of ESG standards. Thousands of global companies have either committed to or set a target date for adopting net zero emissions. Amongst those who have made net zero pledges are Ford Motor Co. and American Airlines. Nebraska Public Power District also announced its goal of achieving net zero carbon emissions by 2050. Why should agriculture producers care about ESG? Many farmers may consider themselves environmentally conscience already. However, the agriculture sector is under greatest scrutiny of ESG ideologies. “Most farmers and most agricultural industries affect the climate in some way,” McPherrin said. The estimated global cost to feed humans is $3 trillion; this figure factors in emissions from methane, as well as usage of pesticides, fertilizers and fresh water, as published June 2, 2022, in an article titled “The overlooked giant in ESG conversation? Agriculture” by Michael Gilbert. Gilbert also states that 17% of greenhouse gas emissions have come from the agriculture sector in recent years. He gives producers the benefit of the doubt that “the growth of populations and corresponding scale of food demand have weighed heavily on the environment” but that farmers can tap into technology to increase productivity and reduce environmental impact. Those actually scoring ESG will likely not be as gracious to farmers as Gilbert. Who is involved in the ESG movement? ESG is driven by governmental entities, primarily international bodies, said McPherrin. Amongst those he mentioned were the United Nations, World Economic Forum, World Monetary Fund and World Bank. Multinational companies are emphasizing the perceived need for ESG, including BlackRock, Bank of America and JP Morgan. Moreover, McPherrin said the Biden Administration is a “proponent to promote ESG in the terms of some of the actions they have taken and some of their agencies,” including the Securities and Exchange Commission (SEC) and Office of the Comptroller of the Currency (OCC). “If they can all ally together in a global system that they are in control of, the opportunities for power and wealth accumulation are endless,” McPherrin said. Should ESG be viewed as a political or corporate issue? ESG is being portrayed as a partisan issue, further dividing the right and the left. The Planet Money podcast begins by criticizing Republican leaders for “increasingly pushing back against what they often call ‘woke investing.’” States such as Florida, West Virginia and Louisiana have recalled millions of dollars invested in BlackRock against the premise of ideological investing. To McPherrin, ESG is not a political issue. “It’s about freedom versus slavery to these big corporate regulatory authorities,” he said. Recently, a new policy for ESG was passed at the American Farm Bureau meetings held in January at Puerto Rico. McHargue said the policy reads: “The use of nonfinancial factors to evaluate investment opportunities and creditworthiness has proliferated in the recent years, the most recent form being environmental, social and governance (ESG) factors.” NEFB has been involved in conversations about ESG in Washington, D.C., and is working to prevent ESG from becoming governmental. Without clear objective standards, ESG regulations within the looming 2023 farm bill or federal financial regulations could be of concern. “As we look at farm bill payments and crop insurance payments, there is a real risk of onerous subjective ESG standards being put into that language,” McHargue said. Farmers and ranchers had a sneak peek on what a potential ESG regulation within the federal government would look like when the SEC introduced regulations to require companies to submit supply chain greenhouse gas emissions reports within their typical financial disclosure paperwork. “The SEC rule requiring publicly traded companies submit the greenhouse gas emissions totals of their supply chains, including agricultural products, would have made farmers and ranchers subject to new and complex reporting requirements and potential new liabilities,” said McHargue. How could markets be influenced by ESG? Because of its subjective and sometimes arbitrary nature, ESG adds uncertainty to the market. Nearly all sectors within agriculture utilize forward contracts, and McHargue is concerned about the implications of ESG within these contracts. “We want to ensure that those contracts are not dictated by subjective ESG standards that don’t have any domestic or global standards,” he said. In essence, the governing bodies who complete the scoring will dictate supply and demand. This is why the ESG movement could reshape global capitalism; it has the potential to control markets and consumer preference. “If you can force a company to stop producing products with negative impact on climate, you also impact demand for those products because people will naturally be forced to buy different things because of limited availability,” said McPherrin. Collins disagrees. She compares investing and consumer shopping selections to a potluck supper, where you can choose a different dish if you do not like another offered. “Like any market where there’s a lot of new products in a short period of time, it’s true that you need to read the label to see what you’re buying,” Collins said. She added that new products have sprung up as a result of ESG regulations. While Collins paints a picture of a free market with consumer choices, McPherrin relates a contrasting view of ESG for individuals. He explained that on an individual level, someone who buys steak at the grocery store would incur a “ding” on his or her personal ESG score, whereas purchasing an item rated at lower environmental impact would boost the score. A higher ESG score equals more purchasing power, even for individuals. But everything impacts the environment somehow, said McPherrin. Corn yields would be greatly impaired without nitrogen fertilizer, yet nitrogen levels in groundwater are a concern. Weeds would overtake fields without intervention, yet opponents demean herbicide use and carbon emissions from mechanical control. How could agriculture be affected by ESG regulations? If you are skeptic about the realities of ESG, observe the current Netherlands farm crisis. Agriculture producers across Germany, Italy and Poland are mandated to reduce carbon emissions by 30%. Kenneth Rapoza illustrates what could happen in the United States if the ESG movement continues in his article “The SEC’s climate proposal sets table for Netherlands-style farm crisis in the U.S.” published in Forbes on Aug. 1, 2022: If enacted, the rule would require big food companies like Tyson and Smithfield Foods, owned by China, and JBS and Marfrig, both Brazilian, to report to the SEC how their farmers are impacting the environment. In other words: didn’t reduce fertilizer by 30 percent, for example? Sorry, can’t buy your beef. Too many bovines releasing methane into the air? Need a smaller herd. No loans from Bank of America for you. And sorry, your beef is a climate risk according to ESG adherent Rabobank. That means Rabobank might not provide the big agriculture exporters with trade finance as punishment for not being ESG enough. With multiple industries under its umbrella, agriculture could become “one of the most powerful ESG investments in the world,” Rapoza stated. The regulating authorities have different targets within agriculture. The meat industry would likely be hurt the most, said McPherrin. The livestock industry would also fall victim to ESG ratings. Stories circulate about how feedlot producers are not being loaned money because of environmentally related ideologies. If you think this is only in other countries, McHargue has news for you. “My understanding is this is actually happening at some financial institutions that don’t understand agriculture,” he said. Small to mid-sized farms will also suffer greatly. As Rapoza wrote, family farms will be affected much more than “corporate-controlled industrial farms that many environmentalists have long opposed.” Part of the problem derives from the solution. In an effort to decrease inputs of water, fertilizers, pesticides and carbon emissions, farming methods are becoming more “sustainable” and, therefore, more reliant on technology. “Indeed, some of the most significant ESG-related gains are coming from integration of new technology—better data—into large-scale commercial farming,” Rapoza stated. This intensive use of technology will reveal areas where a farm or operation may be lacking in environmental sustainability. Sensors and record-keeping platforms will “definitively quantify” the ESG impact and report back to the regulating authorities. Small farms may not be able to stay afloat and will likely lose funding sources. What happens if an entity does not comply with ESG practices? One theme resonates throughout all the ESG articles, podcasts and interviews: pressure. Companies will be pressured into compliance. Wong mentioned “peer pressuring companies” in the Planet Money podcast. If a company resists pressure to the metric system, its score will be downgraded and capital or credit lost. How can companies—or farms or individuals—deflate this pressure? McPherrin said that there are very few options for businesses without risking loss of capital, but legal action can be taken. Foremost, farmers must speak to their representatives, he said. “Work at the local and state level to apply pressure against ESG,” recommends McPherrin. McHargue advises producers to be vigilant when entering any contract. “Be very careful when reading your contracts and financial disclosures,” said McHargue. “Look at the statements. If the language is in there, know at that point it may limit your operation from doing things, primarily in the livestock sector.” He added that you may want to reevaluate your financial institution. Will ESG overtake the agriculture industry? Agriculture is not immune to ESG and is more likely a target. All agricultural producers must be aware of ESG and its potential consequences for farming practices, marketing and technology integration. Fink himself said, “There is no company whose business model won’t be profoundly affected by the transition to a net zero company…companies that are not quickly preparing themselves will see their businesses and valuations suffer.” Be prepared for the imminent pressure from ESG on the agricultural industry. Instead of worrying about corporate America’s coercion, follow Fink’s other advice regarding ESG: “Every company and every industry will be transformed by the transition to a net zero world. The question is, will you lead, or will you be led?” Additional Resources: NEFB ESG Sustainability Policy Guide: https:\/\/www.nefb.org\/08\/10\/2022\/esg-sustainability-policy-guide\/ American Farm Bureau: https:\/\/www.fb.org\/market-intel\/overreach-of-sec-proposed-climate-rule-could-hurt-agriculture","filter_flag":1}
{"title":"Koch Engineered Solutions and Percepto Join Forces To Bring - CSRwire.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc2NTgxNi1rb2NoLWVuZ2luZWVyZWQtc29sdXRpb25zLWFuZC1wZXJjZXB0by1qb2luLWZvcmNlcy1icmluZy1jdXR0aW5nLWVkZ2UtYWktYW5k0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc2NTgxNi1rb2NoLWVuZ2luZWVyZWQtc29sdXRpb25zLWFuZC1wZXJjZXB0by1qb2luLWZvcmNlcy1icmluZy1jdXR0aW5nLWVkZ2UtYWktYW5k0gEA?oc=5","id":"CBMiemh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc2NTgxNi1rb2NoLWVuZ2luZWVyZWQtc29sdXRpb25zLWFuZC1wZXJjZXB0by1qb2luLWZvcmNlcy1icmluZy1jdXR0aW5nLWVkZ2UtYWktYW5k0gEA","guidislink":false,"published":"Wed, 08 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=39, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc2NTgxNi1rb2NoLWVuZ2luZWVyZWQtc29sdXRpb25zLWFuZC1wZXJjZXB0by1qb2luLWZvcmNlcy1icmluZy1jdXR0aW5nLWVkZ2UtYWktYW5k0gEA?oc=5\" target=\"_blank\">Koch Engineered Solutions and Percepto Join Forces To Bring<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CSRwire.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Koch Engineered Solutions and Percepto Join Forces To Bring - CSRwire.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc2NTgxNi1rb2NoLWVuZ2luZWVyZWQtc29sdXRpb25zLWFuZC1wZXJjZXB0by1qb2luLWZvcmNlcy1icmluZy1jdXR0aW5nLWVkZ2UtYWktYW5k0gEA?oc=5\" target=\"_blank\">Koch Engineered Solutions and Percepto Join Forces To Bring<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CSRwire.com<\/font>","source.href":"https:\/\/www.csrwire.com","source.title":"CSRwire.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Stewardship\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"With an assist from the Koch Labs® capability, Koch Engineered Solutions and Percepto partner to bring cutting-edge AI and autonomous drone technology to help industrial customers monitor and reduce emissions. Published 02-08-23 Submitted by Koch Industries Innovate or get left in the dust. That’s the kind of thinking that brought together Percepto, the leading autonomous inspection and monitoring solution provider, and Koch Engineered Solutions into a new collaborative venture. “This is an example of rapid transformation where there was a virtuous cycle to be had with Percepto and KES and our future customers,” says Ryley Clem, director of commercial development Equipment, Technology and Services for KES. The partnership will allow Koch Specialty Plant Services, a KES subsidiary, to offer Percepto’s cutting-edge artificial intelligence software and autonomous drone-in-a-box solutions to its range of industrial customers. The partnership will benefit both Percepto and KES as they work to better meet the needs of their customers. It is the direct result of the kinds of connections and conversations that are facilitated by Koch’s culture of knowledge sharing and principled entrepreneurship. As a director of commercial development, one of Ryley’s responsibilities is to seek out ways that KES can add to the services it offers to better meet the needs of industrial customers and create more value for them. Deeply understanding your customer’s challenges while staying on top of the latest innovations is a key part of that. One way Ryley stays connected to the latest ideas is by meeting with Bill Bender, Koch Labs® capability director. Koch Labs is a capability of Koch Disruptive Technologies and looks to connect the companies it invests into the diverse ecosystem of subject matter experts, businesses and capabilities across Koch and its network of partners. During one of those meetings, Bill and Ryley discussed Percepto, one of the companies KDT has invested in. Percepto uses autonomous drone technologies, such as its Percepto Air Max™ and Percepto Air Max OGI™ platforms, to do remote, high-frequency, high-quality visual and thermal inspections of a wide range of industrial facilities. Then, Percepto’s Autonomous Inspection & Monitoring software creates AI-powered reports of anomalies and trends to key asset owners. Ryley says it didn’t take long for him to recognize the opportunity that had just been presented to him. “I thought, ‘Wow, that fits with what we’re trying to build in our new service offerings,’” he says. “We have to continue to innovate and transform and bring new products and services that create value for our customers. Percepto is bringing that.” Bill Bender and Ryley Clem occasionally meet to share ideas and information. Shortly after speaking with Bill, Ryley set up a meeting with Ariel Avitan, one of the original founders of Percepto. The two quickly realized how valuable a partnership could be and how it would allow them to better serve their customers. “The win-win here is that Percepto has the ability to be visible to a lot of very big clients that usually would take years to build relationships with,” Ariel says. “Now, we can take advantage of the reputation and ongoing relationships Koch Engineered Solutions has with these clients.” And KES benefits by getting to offer a new cutting-edge service to its customers that can minimize downtime, streamline compliance, reduce operational costs, improve safety and help find ways to reduce emissions. “We’re going to create value for our customers in ways neither of us could do by ourselves,” Ryley says. Ariel credits being connected with the Koch Labs capability as crucial to the company’s success. “KDT is the most added value investment we’ve ever had,” Ariel says. “It’s not just about the money, it’s about the relationships we have with Koch Labs and other Koch companies.” He says Percepto is only just scratching the surface of potential use cases for its technology and software, and the partnership with KES and KSPS will only deepen their understanding of real-world uses and benefits. “We’re excited to lead the revolution of unmanned inspections that helps industrial facilities optimize their operations and reach their environmental and safety goals,” Ariel says. “And this partnership with KES is a tremendous next step.”","filter_flag":1}
{"title":"ADM invests over $30m in new facility in Spain to meet growing demand for probiotics - FeedNavigator.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5mZWVkbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDIvMDcvQURNLWludmVzdHMtb3Zlci0zMG0taW4tbmV3LWZhY2lsaXR5LWluLVNwYWluLXRvLW1lZXQtZ3Jvd2luZy1kZW1hbmQtZm9yLXByb2Jpb3RpY3PSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5mZWVkbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDIvMDcvQURNLWludmVzdHMtb3Zlci0zMG0taW4tbmV3LWZhY2lsaXR5LWluLVNwYWluLXRvLW1lZXQtZ3Jvd2luZy1kZW1hbmQtZm9yLXByb2Jpb3RpY3PSAQA?oc=5","id":"CBMihAFodHRwczovL3d3dy5mZWVkbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDIvMDcvQURNLWludmVzdHMtb3Zlci0zMG0taW4tbmV3LWZhY2lsaXR5LWluLVNwYWluLXRvLW1lZXQtZ3Jvd2luZy1kZW1hbmQtZm9yLXByb2Jpb3RpY3PSAQA","guidislink":false,"published":"Tue, 07 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=38, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5mZWVkbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDIvMDcvQURNLWludmVzdHMtb3Zlci0zMG0taW4tbmV3LWZhY2lsaXR5LWluLVNwYWluLXRvLW1lZXQtZ3Jvd2luZy1kZW1hbmQtZm9yLXByb2Jpb3RpY3PSAQA?oc=5\" target=\"_blank\">ADM invests over $30m in new facility in Spain to meet growing demand for probiotics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FeedNavigator.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ADM invests over $30m in new facility in Spain to meet growing demand for probiotics - FeedNavigator.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5mZWVkbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDIvMDcvQURNLWludmVzdHMtb3Zlci0zMG0taW4tbmV3LWZhY2lsaXR5LWluLVNwYWluLXRvLW1lZXQtZ3Jvd2luZy1kZW1hbmQtZm9yLXByb2Jpb3RpY3PSAQA?oc=5\" target=\"_blank\">ADM invests over $30m in new facility in Spain to meet growing demand for probiotics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FeedNavigator.com<\/font>","source.href":"https:\/\/www.feednavigator.com","source.title":"FeedNavigator.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Stewardship\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"The production site represents an investment north of $30m and a more than five-fold increase in ADM’s production capacity, increasing it to 50 metric tons annually. The first facililty, globally, to produce both probiotics and postbiotics, at the same site, it will allow the US company to supply growing markets for probiotics and postbiotics in the US, Asia-Pacific, and Europe. ADM said the capacity expansion enabled by this build will help it realize its ambition to increase health and wellness revenue from over $500m in 2022 to $2bn within 10 years. A Euromonitor report estimates that the probiotic supplements retail market could surge to $10.4bn by 2027 from about $8.3bn in 2022. That growth is being driven by rising demand for science-based probiotic formulas that are used in dietary supplements, and also dairy products, food, healthy snacks, and beverages, as well as pet and animal feed. The new facility is located close to ADM’s R&D center in the University of Valencia Scientific Park, where its scientists undertake activity including next-generation genome sequencing and early-stage testing of new bacterial strains. Building resilience Last September, ADM outlined ​​how animal nutrition has an important role to play in positively influencing animal resilience. Resilience describes an animal’s ability to respond to and reduce the impact of stressors. A variety of external pressures have elevated the need for more resilient farm animals, including consumer focus on how animals are raised, the environmental impacts of animal production, less reliance on antibiotics and a business’s profit margins, according to a report from the US company. And a lack of resilience can mean higher production losses and added costs for veterinary services, health treatments and labor costs, it noted. The gut microbiome is emerging as a central component to overall health and well-being, with the microbiota ensuring nutrient absorption while also defending against pathogens, said the company, with it outlining how increased exposure to bacteria and viruses can heighten the risk of disease and negatively impact an animal’s health and growth performance. ADM scientists and others are exploring the physiological and metabolic changes that accompany an animal’s exposure to stressors to learn more about the mechanisms the animal uses for necessary functions. The company said this approach can also help find new ways to support efficiencies by using nutrition to accelerate recovery and minimize the impact of negative stressors on performance.","filter_flag":1}
{"title":"Here's what won’t be included in Nassimi’s performance fabrics - Home Accents Today","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmhvbWVhY2NlbnRzdG9kYXkuY29tL3RleHRpbGVzL2hlcmVzLXdoYXQtd29udC1iZS1pbmNsdWRlZC1pbi1uYXNzaW1pcy1wZXJmb3JtYW5jZS1mYWJyaWNzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmhvbWVhY2NlbnRzdG9kYXkuY29tL3RleHRpbGVzL2hlcmVzLXdoYXQtd29udC1iZS1pbmNsdWRlZC1pbi1uYXNzaW1pcy1wZXJmb3JtYW5jZS1mYWJyaWNzL9IBAA?oc=5","id":"CBMiZmh0dHBzOi8vd3d3LmhvbWVhY2NlbnRzdG9kYXkuY29tL3RleHRpbGVzL2hlcmVzLXdoYXQtd29udC1iZS1pbmNsdWRlZC1pbi1uYXNzaW1pcy1wZXJmb3JtYW5jZS1mYWJyaWNzL9IBAA","guidislink":false,"published":"Wed, 15 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=15, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=46, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmhvbWVhY2NlbnRzdG9kYXkuY29tL3RleHRpbGVzL2hlcmVzLXdoYXQtd29udC1iZS1pbmNsdWRlZC1pbi1uYXNzaW1pcy1wZXJmb3JtYW5jZS1mYWJyaWNzL9IBAA?oc=5\" target=\"_blank\">Here's what won’t be included in Nassimi’s performance fabrics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Home Accents Today<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Here's what won’t be included in Nassimi’s performance fabrics - Home Accents Today","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmhvbWVhY2NlbnRzdG9kYXkuY29tL3RleHRpbGVzL2hlcmVzLXdoYXQtd29udC1iZS1pbmNsdWRlZC1pbi1uYXNzaW1pcy1wZXJmb3JtYW5jZS1mYWJyaWNzL9IBAA?oc=5\" target=\"_blank\">Here's what won’t be included in Nassimi’s performance fabrics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Home Accents Today<\/font>","source.href":"https:\/\/www.homeaccentstoday.com","source.title":"Home Accents Today","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Stewardship\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"NEW YORK – Textile manufacturer Nassimi has eradicated all PFAS chemicals from its new production. PFAS, often referred to as fluorocarbons, are a large, complex group of manufactured chemicals present in a variety of consumer products, including performance fabrics, that do not degrade easily in the environment and may be linked to harmful health effects in humans and animals. “Human health and environmental stewardship have always been of great importance to us at Nassimi,” said Iwan Nassimi, executive vice president. “For many years now, we’ve been on the path to ending the use of potentially harmful chemicals in our fabrics, and we are proud to eliminate PFAS from all products. Given our prior experience developing PFAS-free alternatives, I’m confident that our customers and end-users will still find that the performance capabilities of our fabrics exceed expectations.” While many companies are just now beginning to develop PFAS-free alternatives as a response to current legislation in some states, Nassimi said his company has always been at the forefront of sustainable manufacturing, engineering its fabrics to be PFAS-free from the beginning. The majority of Nassimi products, including performance upholstery fabric Supreen, have always been PFAS-free, while offering the same level of high stain and liquid resistance, the company said. Nassimi recently reformulated the last of its textile lines containing PFAS, called Resilience TX, to create a fully sustainable product portfolio that still delivers on performance. While some PFAS-free alternatives can be less effective in repelling stains, Nassimi said his company’s technology in the finishing process offers highly effective stain protection. As an example, Nassimi’s Supreen liquid barrier fabrics use a silicone-based stain repellent that is applied following a patented fabric-purification process. This allows for the silicone to fully embed itself into the textiles’ fiber to create an invisible layer of stain protection. Likewise, the surface treatments of the company’s Writer’s Block polyurethanes, SiO silicones and Resilience faux leathers provide stain resistance without the use of any harmful chemicals. See also:","filter_flag":1}
{"title":"Krill diet fulfills choline requirements and supports better intestinal and liver health in salmon - Aquafeed.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMilAFodHRwczovL3d3dy5hcXVhZmVlZC5jb20vcHJvZHVjdHMvc3VwcGxpZXJzLW5ld3Mva3JpbGwtZGlldC1mdWxmaWxscy1jaG9saW5lLXJlcXVpcmVtZW50cy1hbmQtc3VwcG9ydHMtYmV0dGVyLWludGVzdGluYWwtYW5kLWxpdmVyLWhlYWx0aC1pbi1zYWxtb24v0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMilAFodHRwczovL3d3dy5hcXVhZmVlZC5jb20vcHJvZHVjdHMvc3VwcGxpZXJzLW5ld3Mva3JpbGwtZGlldC1mdWxmaWxscy1jaG9saW5lLXJlcXVpcmVtZW50cy1hbmQtc3VwcG9ydHMtYmV0dGVyLWludGVzdGluYWwtYW5kLWxpdmVyLWhlYWx0aC1pbi1zYWxtb24v0gEA?oc=5","id":"CBMilAFodHRwczovL3d3dy5hcXVhZmVlZC5jb20vcHJvZHVjdHMvc3VwcGxpZXJzLW5ld3Mva3JpbGwtZGlldC1mdWxmaWxscy1jaG9saW5lLXJlcXVpcmVtZW50cy1hbmQtc3VwcG9ydHMtYmV0dGVyLWludGVzdGluYWwtYW5kLWxpdmVyLWhlYWx0aC1pbi1zYWxtb24v0gEA","guidislink":false,"published":"Wed, 22 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=53, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilAFodHRwczovL3d3dy5hcXVhZmVlZC5jb20vcHJvZHVjdHMvc3VwcGxpZXJzLW5ld3Mva3JpbGwtZGlldC1mdWxmaWxscy1jaG9saW5lLXJlcXVpcmVtZW50cy1hbmQtc3VwcG9ydHMtYmV0dGVyLWludGVzdGluYWwtYW5kLWxpdmVyLWhlYWx0aC1pbi1zYWxtb24v0gEA?oc=5\" target=\"_blank\">Krill diet fulfills choline requirements and supports better intestinal and liver health in salmon<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Aquafeed.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Krill diet fulfills choline requirements and supports better intestinal and liver health in salmon - Aquafeed.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilAFodHRwczovL3d3dy5hcXVhZmVlZC5jb20vcHJvZHVjdHMvc3VwcGxpZXJzLW5ld3Mva3JpbGwtZGlldC1mdWxmaWxscy1jaG9saW5lLXJlcXVpcmVtZW50cy1hbmQtc3VwcG9ydHMtYmV0dGVyLWludGVzdGluYWwtYW5kLWxpdmVyLWhlYWx0aC1pbi1zYWxtb24v0gEA?oc=5\" target=\"_blank\">Krill diet fulfills choline requirements and supports better intestinal and liver health in salmon<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Aquafeed.com<\/font>","source.href":"https:\/\/www.aquafeed.com","source.title":"Aquafeed.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Stewardship\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"This is the first time that the phosphatidylcholine found in krill was evaluated for its effect on reducing intestinal steatosis in salmon. A new study, conducted in collaboration with professor Åshild Krogdahl and associate professor Trond Kortner at the Faculty of Veterinary Medicine at the Norwegian University of Life Sciences and Aker BioMarine, concluded that krill meal and krill oil fulfill the dietary choline needed for growth in farmed Atlantic salmon. The researchers behind this study set out to evaluate whether choline from krill meal or krill oil as part of the dietary feed could help alleviate intestinal steatosis, called lipid malabsorption syndrome (LMS) in severe cases. “Choline is an important nutrient that is necessary for health and growth in fish. It also influences intestinal health. In our research with the Norwegian University of Life Sciences, we, tested whether choline from krill could reduce the buildup of excessive lipids in the intestine, causing LMS, which is detrimental to fish health and growth,” said Kiranpreet Kaur, director R&D Fish Health and Nutrition, Aker BioMarine, and a corresponding author of this study. The 56-day feeding trial was conducted on-site at the Center for Fish Research at the Norwegian University of Life Sciences campus in Ås, Norway. This study marks the first time the unique choline type found in krill, called phosphatidylcholine, was evaluated for its effect on reducing intestinal steatosis in salmon. The krill ingredients for the study were provided by Aker BioMarine, from the QRILL™ Aqua product line. During the trial, a total of six different diets were formulated, including a reference diet with no choline supplement, two diets with krill oil and another two with krill meal, each at varying levels. The sixth diet was supplemented with an inorganic form of choline, choline chloride, at a high level. Key findings The study showed the high and similar ability of both krill meal and krill oil to reduce lipid (fat) accumulation in the salmon intestine, thus reducing the likelihood of intestinal steatosis and\/or lipid malabsorption syndrome. In a similar way, choline at lower inclusion levels from both krill meal and krill oil reduced lipid (fat) accumulation in the salmon liver to the same extent as the positive control group. The krill meal and krill oil diets showed a growth-stimulating effect in comparison to highly choline-deficient diets. Salmon growth was significantly higher in the krill meal and krill oil groups consuming 2.6g\/kg of choline, in comparison to the positive control group, indicating that even sub-optimal levels of choline can satisfy choline needs for growth. “What we learned from this study is that choline from krill meal and krill oil is equally effective, even at lower inclusion levels, in stimulating growth in fish and in supporting better intestinal and liver health,” said Sigve Nordrum, EVP Animal Health and Nutrition, Aker BioMarine. “Our findings prove that krill is a functional ingredient that can significantly improve the nutritional quality of the dietary feed, leading to better quality products.” Check out the study here.","filter_flag":1}
{"title":"MSD Animal Health set to launch revamped platform to predict poultry health, prevent disease and improve performance - FeedNavigator.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL3d3dy5mZWVkbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDIvMTcvTVNELUFuaW1hbC1IZWFsdGgtc2V0LXRvLWxhdW5jaC1yZXZhbXBlZC1wbGF0Zm9ybS10by1wcmVkaWN0LXBvdWx0cnktaGVhbHRoLXByZXZlbnQtZGlzZWFzZS1hbmQtaW1wcm92ZS1wZXJmb3JtYW5jZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL3d3dy5mZWVkbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDIvMTcvTVNELUFuaW1hbC1IZWFsdGgtc2V0LXRvLWxhdW5jaC1yZXZhbXBlZC1wbGF0Zm9ybS10by1wcmVkaWN0LXBvdWx0cnktaGVhbHRoLXByZXZlbnQtZGlzZWFzZS1hbmQtaW1wcm92ZS1wZXJmb3JtYW5jZdIBAA?oc=5","id":"CBMipAFodHRwczovL3d3dy5mZWVkbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDIvMTcvTVNELUFuaW1hbC1IZWFsdGgtc2V0LXRvLWxhdW5jaC1yZXZhbXBlZC1wbGF0Zm9ybS10by1wcmVkaWN0LXBvdWx0cnktaGVhbHRoLXByZXZlbnQtZGlzZWFzZS1hbmQtaW1wcm92ZS1wZXJmb3JtYW5jZdIBAA","guidislink":false,"published":"Fri, 17 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=17, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=48, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL3d3dy5mZWVkbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDIvMTcvTVNELUFuaW1hbC1IZWFsdGgtc2V0LXRvLWxhdW5jaC1yZXZhbXBlZC1wbGF0Zm9ybS10by1wcmVkaWN0LXBvdWx0cnktaGVhbHRoLXByZXZlbnQtZGlzZWFzZS1hbmQtaW1wcm92ZS1wZXJmb3JtYW5jZdIBAA?oc=5\" target=\"_blank\">MSD Animal Health set to launch revamped platform to predict poultry health, prevent disease and improve performance<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FeedNavigator.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"MSD Animal Health set to launch revamped platform to predict poultry health, prevent disease and improve performance - FeedNavigator.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL3d3dy5mZWVkbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDIvMTcvTVNELUFuaW1hbC1IZWFsdGgtc2V0LXRvLWxhdW5jaC1yZXZhbXBlZC1wbGF0Zm9ybS10by1wcmVkaWN0LXBvdWx0cnktaGVhbHRoLXByZXZlbnQtZGlzZWFzZS1hbmQtaW1wcm92ZS1wZXJmb3JtYW5jZdIBAA?oc=5\" target=\"_blank\">MSD Animal Health set to launch revamped platform to predict poultry health, prevent disease and improve performance<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FeedNavigator.com<\/font>","source.href":"https:\/\/www.feednavigator.com","source.title":"FeedNavigator.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Stewardship\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Following the conclusion of the pilot phase, the platform will be rolled out in the UK, Brazilian, and US poultry markets in Q3 2023. “We have a big opportunity today with SenseHub Poultry,” Henrique Casagrande, global poultry lead, MSD Animal Health, told us on a recent call. Formerly known as Poultry Sense, the US business acquired the monitoring technology from a privately held company located in Exeter, UK in February 2021. MSD Animal Health has one of the largest poultry vaccine portfolios, including products against most major pathogens and a focus on diseases affecting broilers, breeders, and layers; nevertheless, it had been looking to broaden out its portfolio with complementary products and technologies to advance animal well-being and outcomes for its customers. Identifying patterns SenseHub Poultry, just one of many recent MSD Animal Health acquisitions in this space, provides enhanced technology for poultry farmers to continuously track and analyze overall health performance for the life of the flock; it provides users the capability to measure, compare and record key health and environmental indicators captured by battery-powered, wireless sensors in the poultry barn, as well as to identify patterns and trends to predict health and well-being. “The sensors allow farmers to monitor and assess vital parameters by measuring weight, water usage, humidity, light, temperature, and carbon dioxide. Farmers can therefore gain insight into the housing environment, as well as bird health and performance,” explained Casagrande. Sensor-scales can feed live, accurate weight recordings into the analytics platform. This means any variation or a shift in growth rates can be recognized and acted upon immediately, he told us. Ultimately, through leveraging this platform, MSD Animal Health can now combine biopharma and technological solutions to help customers detect disease early in their flocks, act on it, thereby boosting bird health and bringing greater efficiency to their operations, commented Casagrande. Development phase​ The MSD Animal Health team has spent the past years evolving the technology, so that it can generate simple and pragmatic insights to support any intervention inside the broiler house, he said. Feedback from MSD Animal Health poultry experts in different regions of the globe has informed that platform development work, ensuring that the data and the interface reflects the needs of poultry customers no matter where they are located, and that it generates precise information. The platform is connected to the cloud, providing farmers with access to real-time data 24\/7.","filter_flag":1}
{"title":"Top 20 Most Promising Biotechnology Companies In India 2023 - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLWJpb3RlY2hub2xvZ3ktY29tcGFuaWVzLWluZGlhLTIwMjMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLWJpb3RlY2hub2xvZ3ktY29tcGFuaWVzLWluZGlhLTIwMjMv0gEA?oc=5","id":"CBMiSmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLWJpb3RlY2hub2xvZ3ktY29tcGFuaWVzLWluZGlhLTIwMjMv0gEA","guidislink":false,"published":"Wed, 15 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=15, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=46, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLWJpb3RlY2hub2xvZ3ktY29tcGFuaWVzLWluZGlhLTIwMjMv0gEA?oc=5\" target=\"_blank\">Top 20 Most Promising Biotechnology Companies In India 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 20 Most Promising Biotechnology Companies In India 2023 - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLWJpb3RlY2hub2xvZ3ktY29tcGFuaWVzLWluZGlhLTIwMjMv0gEA?oc=5\" target=\"_blank\">Top 20 Most Promising Biotechnology Companies In India 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Stewardship\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Top 20 Most Promising Biotechnology Companies In India 2023. In this article today, we will take a look at the Top 20 Biotechnology Companies In India in 2023. India is one of the fastest-growing biotechnology markets in the world and is home to some of the leading biotechnology companies. These companies are involved in a range of activities including research and development, production, and commercialization of biotechnology products and services. In 2023, the top 20 biotechnology companies in India have continued to maintain their dominance and are at the forefront of the country’s biotechnology sector. These companies are involved in various areas such as vaccines, biopharmaceuticals, medical devices, and more. They are not only serving the domestic market but also have a significant global presence. The biotechnology industry in India is growing at a rapid pace, and these companies are contributing to this growth by investing in research, innovation, and commercialization. These companies are playing a crucial role in transforming the healthcare landscape in India and around the world. 1. Serum Institute Of India The Serum Institute of India (SII) is one of the largest vaccine manufacturers in the world. It was founded in 1966 by Dr Cyrus Poonawalla and is headquartered in Pune, India. The company specializes in the production of life-saving vaccines and biological products, including vaccines for polio, diphtheria, tetanus, hepatitis B, and Haemophilus influenzae type B (Hib). In recent years, SII has gained international recognition for its role in the COVID-19 pandemic. The company has been at the forefront of the global effort to develop and distribute vaccines against the virus and has partnered with several pharmaceutical companies, including AstraZeneca and Novavax, to manufacture and supply their vaccines to countries around the world. In addition to its vaccine manufacturing activities, SII is also involved in research and development, as well as the production and distribution of a range of life-saving drugs and other medical products. The company is committed to providing affordable healthcare solutions to people around the world and has a strong reputation for quality and reliability in the pharmaceutical industry. 2. Panacea Biotech Ltd Panacea Biotec is a leading pharmaceutical and biotechnology company based in India. It was founded in 1984 and has its headquarters in New Delhi. The company specializes in the development, manufacturing, and marketing of a wide range of pharmaceutical products, including vaccines, antibiotics, and anti-retroviral drugs. Panacea Biotec has a strong presence in the Indian market and is also well-established in international markets, including the United States, Europe, and Africa. The company has a state-of-the-art research and development facility and is committed to investing in new technology and innovative product development to meet the changing needs of the pharmaceutical industry. In addition to its pharmaceutical business, Panacea Biotec is also involved in the development and production of biotech-based products, including biotech crop protection products, diagnostic kits, and animal health products. The company has a strong commitment to quality and is accredited by several international regulatory agencies, including the US Food and Drug Administration (FDA) and the European Medicines Agency (EMA). 3. Bharat Serums and Vaccines Limited Bharat Biotech is an Indian biotechnology company based in Hyderabad, India. It was founded in 1996 by Dr Krishna Ella. The company specializes in the development, production and distribution of vaccines and biotherapeutics for various diseases, such as rotavirus, rabies, Japanese encephalitis, and others. They are known for developing India’s first indigenous rabies vaccine, as well as for their work in the COVID-19 pandemic, developing the Covaxin vaccine. Bharat Biotech is a research-driven biotechnology company focused on developing innovative vaccine solutions. In addition to its work in developing vaccines for various diseases, the company is also involved in the research and development of new technologies, such as oral vaccines and needle-free delivery systems. It has partnerships with various organizations, such as the Indian Council of Medical Research (ICMR) and the World Health Organization (WHO) , to help in the development and distribution of vaccines. The company has a strong commitment to improving public health and has been recognized for its contributions to the field of biotechnology. Covaxin is produced using a proprietary technology known as “bro methylation”, which is claimed to provide better immune response and protection compared to other inactivated vaccines. In 2021, Bharat Biotech received Emergency Use Listing from the World Health Organization for its COVID-19 vaccine Covaxin 4. Baxter International Baxter India is a subsidiary of Baxter International Inc., a global medical products and services company that was founded in 1931 and is headquartered in Deerfield, Illinois, USA. The company provides a wide range of products and services to healthcare providers and patients around the world, with a focus on increasing access to healthcare and improving patient outcomes. Baxter India is based in Mumbai, Ahmedabad, and Gurgaon India, and provides a range of products and services to healthcare providers and patients in the region, including medical devices, pharmaceuticals, and renal care products. The company’s product portfolio includes a range of innovative solutions for a variety of medical applications, including intravenous (IV) solutions, infusion pumps, dialysis products, and other products for the treatment of various medical conditions. In addition to its commercial activities, Baxter India is also involved in a range of initiatives aimed at improving access to healthcare and promoting medical education and research. The company has a strong commitment to sustainability and corporate responsibility and is involved in some initiatives to reduce its environmental impact and promote social responsibility. 5. Biocon Ltd. Biocon Limited is an Indian biopharmaceutical company based in Bangalore. Founded in 1978, the company has established itself as one of the leading biotechnology companies in India and is recognized globally for its expertise in the development and production of innovative biopharmaceutical products. Biocon’s portfolio includes a range of biologic drugs and therapies, including biosimilars, insulins, and immunotherapy products, as well as a range of research-based contract research and manufacturing services. The company has a strong research and development focus and has made significant investments in its research and development capabilities to drive innovation and growth in its core businesses. In recent years, Biocon has gained recognition for its role in the global fight against COVID-19 and has partnered with several international pharmaceutical companies to develop and manufacture vaccines and therapies for the disease. The company is also involved in several initiatives aimed at improving access to affordable healthcare in developing countries and has a strong commitment to social and environmental sustainability. 6. SIRO Clinpharm SIRO Clinpharm is a leading clinical research organization (CRO) based in India. The company provides a range of clinical trial services, including clinical trial management, data management, biostatistics, and regulatory support, to pharmaceutical and biotechnology companies worldwide. Founded in 2002, SIRO Clinpharm has established a reputation as a reliable and efficient provider of high-quality clinical research services and has extensive experience in conducting clinical trials across a range of therapeutic areas, including oncology, infectious diseases, and cardiovascular diseases. The company has a strong commitment to ethical clinical research practices and is fully compliant with international regulatory standards, including those set by the US Food and Drug Administration (FDA) and the European Medicines Agency (EMA). SIRO Clinpharm has a large network of experienced clinical research professionals and state-of-the-art technology and infrastructure to support its clinical trial activities. 7. Syngene International Ltd. Syngene International is a leading global contract research organization (CRO) based in India. The company provides a range of research and development services, including custom synthesis, process research and development, analytical development, and clinical trial support, to pharmaceutical, biotech, and agribiotech companies worldwide. . Founded in 1993, Syngene has a strong reputation for delivering high-quality research services and has extensive experience in the development of small molecule and biological drugs. The company has a large network of experienced scientists and state-of-the-art research facilities and technology to support its research and development activities. In addition to its research services, Syngene also provides a range of laboratory services, including analytical testing and custom synthesis, and is fully compliant with international regulatory standards, including those set by the US Food and Drug Administration (FDA) and the European Medicines Agency (EMA). With a focus on innovation and quality, Syngene has established itself as a leading contract research organization in India and is well-positioned to continue its growth and expansion in the global market for research and development services. 8. Shantha Biotech Shantha Biotechnics is a leading Indian biopharmaceutical company based in Hyderabad. The company was established in 1993 and is focused on the development, production, and marketing of biopharmaceutical products, including vaccines, immunoglobulins, and other biologics. Shantha Biotechnics has a strong presence in the Indian market and is well-established in international markets, including Asia, Africa, and the Middle East. The company has a state-of-the-art research and development facility and is committed to investing in new technology and innovative product development to meet the changing needs of the biopharmaceutical industry. One of the key strengths of Shantha Biotechnics is its expertise in the development and production of vaccines, and the company has been involved in several large-scale vaccine development and manufacturing initiatives in India and internationally. With a strong commitment to quality and social responsibility, Shantha Biotechnics is well-positioned to continue its growth and expansion as a leading biopharmaceutical company, both in India and globally. 9. Novo Nordisk Novo Nordisk is a Danish multinational pharmaceutical company specializing in the research, development, and production of drugs for the treatment of chronic diseases, including diabetes, obesity, and haemophilia. The company was founded in 1923 and is headquartered in Bagsvaerd, Denmark. Novo Nordisk is one of the world’s largest producers of insulin and is recognized as a leader in the development and production of innovative treatments for diabetes. The company’s product portfolio also includes drugs for the treatment of obesity, growth hormone deficiency, and haemophilia. In addition to its pharmaceutical products, Novo Nordisk is also involved in a range of initiatives aimed at improving access to healthcare for people with chronic diseases, particularly in developing countries. The company has a strong commitment to sustainability and corporate responsibility and is involved in several initiatives to reduce its environmental impact and promote social responsibility. With a strong presence in Europe, North America, and Asia, Novo Nordisk is well-positioned to continue its growth and expansion as a leading pharmaceutical company and a key player in the global fight against chronic diseases. 10. Novozymes South Asia Novozymes South Asia is a subsidiary of Novozymes, a Danish biotechnology company that specializes in the development and production of enzymes and microorganisms for a wide range of industries, including agriculture, food and beverage, textiles, and bioenergy. Novozymes South Asia is based in India and serves as the company’s regional hub for the South Asian market. The company offers a range of innovative biotechnology solutions for a variety of industries and applications, including enzymes for improving the efficiency of bioenergy production, enzymes for the food and beverage industry, and biopesticides for agriculture. In addition to its commercial activities, Novozymes South Asia is also involved in a range of sustainability initiatives aimed at promoting the responsible use of natural resources and reducing the environmental impact of its operations. The company is committed to sustainability and works closely with its customers to develop innovative biotechnology solutions that support a more sustainable future. 11. Wockhardt Ltd. Wockhardt Limited is an Indian multinational pharmaceutical and biotechnology company based in Mumbai, India. The company was founded in the 1960s and is engaged in the research, development, production, and marketing of a wide range of pharmaceutical products and biopharmaceuticals. Wockhardt’s product portfolio includes a wide range of prescription and over-the-counter drugs, as well as biopharmaceuticals, including vaccines, enzymes, and other biological products. The company is also involved in the production of active pharmaceutical ingredients (APIs) and has a strong presence in the international market, with a particular focus on emerging markets in Asia, Africa, and South America. In addition to its pharmaceutical and biopharmaceutical activities, Wockhardt is also involved in a range of initiatives aimed at promoting healthcare and improving access to essential medicines, particularly in developing countries. The company has a strong commitment to sustainability and corporate responsibility and is involved in many initiatives to reduce its environmental impact and promote social responsibility. 12. Ajanta Pharma and Biotech Ajanta Biotech is a leading Indian pharmaceutical and biotechnology company that specializes in the research, development, and production of generic and biosimilar drugs. The company is based in Mumbai and was established in 2006. Ajanta Biotech is focused on delivering high-quality, affordable medicines to patients and healthcare providers in India and around the world. The company’s product portfolio includes a range of generic drugs and biosimilars, including treatments for cancer, autoimmune diseases, and other chronic conditions. In addition to its pharmaceutical activities, Ajanta Biotech is also involved in a range of initiatives aimed at improving access to healthcare and promoting medical education and research. The company has a strong commitment to sustainability and corporate responsibility and is involved in some initiatives to reduce its environmental impact and promote social responsibility. 13. Bioclinica Bioclinica is a global provider of clinical trial services to the pharmaceutical, biotechnology, and medical device industries. The company was founded in 1989 and is headquartered in Princeton, New Jersey, with additional offices and locations around the world. Bioclinica offers a range of clinical trial services, including clinical trial management, imaging services, electronic data capture, clinical trial supplies, and site management services. The company’s services are designed to help its clients bring their products to market more efficiently and effectively while ensuring the highest standards of patient safety and data quality. Bioclinica is committed to advancing the science of clinical trials and is involved in a range of initiatives aimed at improving the efficiency and effectiveness of clinical trials, while also promoting patient safety and data quality. The company is also committed to sustainability and corporate responsibility and is involved in several initiatives to reduce its environmental impact and promote social responsibility. 14. Indian Immunologicals Indian Immunologicals Limited (IIL) is an Indian biotechnology company that specializes in the research, development, production, and marketing of a wide range of biological products, including vaccines, immunoglobulins, and other biologicals. The company was established in 1982 and is based in Hyderabad, India. IIL’s product portfolio includes a range of vaccines and immunoglobulins for the prevention and treatment of a variety of medical conditions, including bacterial and viral infections, autoimmune diseases, and other conditions. The company is also involved in the research and development of new biological products, with a focus on innovative and sustainable solutions for global healthcare challenges. In addition to its commercial activities, IIL is also involved in a range of initiatives aimed at improving access to healthcare and promoting medical education and research. The company has a strong commitment to sustainability and corporate responsibility and is involved in many initiatives to reduce its environmental impact and promote social responsibility. 15. Windlas Biotech Private Limited Dehradun Windlas Biotech Private Limited is a pharmaceutical company based in Dehradun, Uttarakhand, India. The company focuses on the research, development, production, and marketing of pharmaceutical and herbal products. The company’s product portfolio includes a range of pharmaceutical products, herbal supplements, and other health-related products, aimed at improving the health and well-being of patients and consumers. Windlas Biotech is known for its focus on quality and sustainability, with a strong commitment to responsible manufacturing and environmental stewardship. The company is involved in some initiatives to promote medical education and research and to support the local communities in which it operates. As a growing company, Windlas Biotech is well-positioned to continue its expansion and growth, serving the needs of patients and consumers around the world. However, specific details about the company’s operations, financial performance, or product portfolio may not be readily available, as Windlas Biotech is a private company. For more information, it is best to contact the company directly. 16. Virchow Biotech Virchow Biotech is a biotechnology company based in India. Virchow Biotech’s product portfolio includes a range of vaccines and immunoglobulins for the prevention and treatment of a variety of medical conditions, including bacterial and viral infections, autoimmune diseases, and other conditions. The company is also involved in the research and development of new biological products, with a focus on innovative and sustainable solutions for global healthcare challenges. In addition to its commercial activities, Virchow Biotech is also involved in a range of initiatives aimed at improving access to healthcare and promoting medical education and research. The company has a strong commitment to sustainability and corporate responsibility and is involved in several initiatives to reduce its environmental impact and promote social responsibility. With a strong presence in India and a growing international presence, Virchow Biotech is well-positioned to continue its growth and expansion as a leading provider of biological products, serving the needs of patients and healthcare providers around the world. However, specific details about the company’s operations, financial performance, or product portfolio may not be readily available, as information about the company may be limited. 17. Cryoviva Biotech and Life Sciences Cryoviva Biotech and Life Sciences is an Indian biotechnology company specializing in the field of regenerative medicine and life sciences. The company provides a range of products and services related to the preservation of umbilical cord blood and tissue, including cord blood banking, tissue banking, and cellular therapy. Cryoviva Biotech and Life Sciences are focused on improving access to regenerative medicine and life sciences, with a mission to make the benefits of these technologies available to people around the world. The company is committed to the highest standards of quality and safety in all of its products and services and is continuously working to advance the science of regenerative medicine and life sciences through research and development. With a strong presence in India and a growing international presence, Cryoviva Biotech and Life Sciences are well-positioned to continue its growth and expansion as a leading provider of regenerative medicine and life sciences products and services. However, specific details about the company’s operations, financial performance, or product portfolio may not be readily available, as information about the company may be limited. 18. British Biologicals Bengaluru, Karnataka British Biologicals is a biotechnology company based in Bengaluru, Karnataka, India. The company specializes in the research, development, production, and marketing of a range of nutritional and health supplements, including vitamins, minerals, and other nutrients. British Biologicals is committed to improving the health and well-being of people around the world through its range of high-quality, science-based products. The company uses cutting-edge research and advanced technology to develop innovative and effective products that meet the diverse needs of its customers. With a strong presence in India and a growing international presence, British Biologicals is well-positioned to continue its growth and expansion as a leading provider of nutritional and health supplements. However, specific details about the company’s operations, financial performance, or product portfolio may not be readily available, as information about the company may be limited. 19. The Council of Scientific & Industrial Research (CSIR) The Council of Scientific & Industrial Research (CSIR) is an autonomous research organization in India. It was established in 1942 and is one of the largest and oldest publicly funded research and development organizations in the country. CSIR is headquartered in Delhi and has a network of 39 national laboratories and research institutes across India. CSIR conducts research in a wide range of scientific and industrial fields, including biotechnology, chemical sciences, engineering, earth sciences, environmental sciences, food and agriculture, health sciences, information technology, materials sciences, and mathematical sciences. The organization is involved in basic and applied research, and its scientists work to develop new technologies and products that address important national and global challenges. CSIR plays an important role in promoting scientific and industrial research in India and is recognized as a leading research organization in the country. The organization has a long history of scientific excellence and innovation and continues to make significant contributions to the advancement of science and technology in India and around the world. 20. Lee Pharma Hyderabad Lee Pharma is a pharmaceutical company based in Hyderabad, India. The company was founded in 1993 and specializes in the manufacturing and marketing of a range of pharmaceutical products, including prescription drugs, generic medicines, and over-the-counter products. Lee Pharma has a wide product portfolio that covers various therapeutic areas, including the cardiovascular, central nervous system, gastrointestinal, and respiratory disorders, among others. The company also offers a range of contract manufacturing services, including the production of active pharmaceutical ingredients (APIs), intermediates, and finished formulations. Lee Pharma has a strong focus on quality and is committed to meeting the highest standards of product quality and safety. The company is accredited with several certifications, including ISO 9001:2015 and WHO-GMP, and is committed to continuous improvement and innovation in its manufacturing processes and product offerings. India has a thriving biotechnology sector, with a large number of companies operating in the field of life sciences and biomedicine. These companies are involved in a wide range of activities, including research and development, production and marketing of pharmaceuticals, vaccines, and nutritional supplements. These companies are playing a critical role in addressing some of the most pressing challenges in human health and well-being, including infectious diseases, cancer, and malnutrition. They are also contributing to the development of the biotechnology sector in India, by investing in research, promoting innovation, and creating new products and technologies. With a supportive policy environment and a growing pool of skilled professionals, the biotechnology sector in India is poised for continued growth and success in the years to come.","filter_flag":1}
