{"title":"Driving the Future: SiC Market for Electric Vehicles Witnessing Exponential Growth with Superior Semiconductors and ... - GlobeNewswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi3wFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xNC8yNzQzNDM4LzI4MTI0L2VuL0RyaXZpbmctdGhlLUZ1dHVyZS1TaUMtTWFya2V0LWZvci1FbGVjdHJpYy1WZWhpY2xlcy1XaXRuZXNzaW5nLUV4cG9uZW50aWFsLUdyb3d0aC13aXRoLVN1cGVyaW9yLVNlbWljb25kdWN0b3JzLWFuZC1FeHBhbmRlZC1DaGFyZ2luZy1JbmZyYXN0cnVjdHVyZS5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi3wFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xNC8yNzQzNDM4LzI4MTI0L2VuL0RyaXZpbmctdGhlLUZ1dHVyZS1TaUMtTWFya2V0LWZvci1FbGVjdHJpYy1WZWhpY2xlcy1XaXRuZXNzaW5nLUV4cG9uZW50aWFsLUdyb3d0aC13aXRoLVN1cGVyaW9yLVNlbWljb25kdWN0b3JzLWFuZC1FeHBhbmRlZC1DaGFyZ2luZy1JbmZyYXN0cnVjdHVyZS5odG1s0gEA?oc=5","id":"CBMi3wFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xNC8yNzQzNDM4LzI4MTI0L2VuL0RyaXZpbmctdGhlLUZ1dHVyZS1TaUMtTWFya2V0LWZvci1FbGVjdHJpYy1WZWhpY2xlcy1XaXRuZXNzaW5nLUV4cG9uZW50aWFsLUdyb3d0aC13aXRoLVN1cGVyaW9yLVNlbWljb25kdWN0b3JzLWFuZC1FeHBhbmRlZC1DaGFyZ2luZy1JbmZyYXN0cnVjdHVyZS5odG1s0gEA","guidislink":false,"published":"Thu, 14 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=257, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi3wFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xNC8yNzQzNDM4LzI4MTI0L2VuL0RyaXZpbmctdGhlLUZ1dHVyZS1TaUMtTWFya2V0LWZvci1FbGVjdHJpYy1WZWhpY2xlcy1XaXRuZXNzaW5nLUV4cG9uZW50aWFsLUdyb3d0aC13aXRoLVN1cGVyaW9yLVNlbWljb25kdWN0b3JzLWFuZC1FeHBhbmRlZC1DaGFyZ2luZy1JbmZyYXN0cnVjdHVyZS5odG1s0gEA?oc=5\" target=\"_blank\">Driving the Future: SiC Market for Electric Vehicles Witnessing Exponential Growth with Superior Semiconductors and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Driving the Future: SiC Market for Electric Vehicles Witnessing Exponential Growth with Superior Semiconductors and ... - GlobeNewswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi3wFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xNC8yNzQzNDM4LzI4MTI0L2VuL0RyaXZpbmctdGhlLUZ1dHVyZS1TaUMtTWFya2V0LWZvci1FbGVjdHJpYy1WZWhpY2xlcy1XaXRuZXNzaW5nLUV4cG9uZW50aWFsLUdyb3d0aC13aXRoLVN1cGVyaW9yLVNlbWljb25kdWN0b3JzLWFuZC1FeHBhbmRlZC1DaGFyZ2luZy1JbmZyYXN0cnVjdHVyZS5odG1s0gEA?oc=5\" target=\"_blank\">Driving the Future: SiC Market for Electric Vehicles Witnessing Exponential Growth with Superior Semiconductors and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","source.href":"https:\/\/www.globenewswire.com","source.title":"GlobeNewswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Improved energy efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Dublin, Sept. 14, 2023 (GLOBE NEWSWIRE) -- The \"Silicon Carbide (SiC) Market for Electric Vehicles - A Global and Regional Analysis: Focus on Propulsion Type, Vehicle Type, Application Type, Product Type, Voltage Type, and Country-Level Analysis - Analysis and Forecast, 2023-2032\" report has been added to ResearchAndMarkets.com's offering. The global silicon carbide (SiC) market for electric vehicles (EVs) is poised for exponential growth, with a projected value of $9,031.2 million by 2032, marking a remarkable Compound Annual Growth Rate (CAGR) of 33.02% during the forecast period from 2023 to 2032. This dynamic growth can be attributed to several key factors, including the exceptional properties of SiC material compared to traditional silicon, the surge in demand for electric vehicles, and substantial investments aimed at expanding SiC manufacturing capacity. Market Lifecycle Stage The silicon carbide (SiC) market for electric vehicles (EVs) is currently in a phase of rapid expansion and transformation. This growth is primarily driven by the compelling advantages that SiC technology offers to the electric mobility sector. SiC, as a semiconductor material, boasts superior properties when compared to traditional silicon, revolutionizing power electronics in EVs. The integration of SiC technology into EV power electronics results in enhanced vehicle performance, enabling faster acceleration, extended driving range, and more efficient energy utilization, ultimately enhancing the overall EV driving experience. SiC's high-frequency capabilities are instrumental in high-power, fast-charging stations, accelerating the expansion of charging infrastructure and reducing EV charging times. Collaborations among electric vehicle manufacturers, semiconductor companies, and research institutions are propelling innovation in SiC technology, leading to continuous advancements and cost reductions. Nevertheless, SiC currently comes at a higher cost than traditional silicon-based components, impacting its widespread adoption. Addressing cost challenges and scaling up SiC production are key imperatives to unlock SiC's full potential in reshaping the electric vehicle landscape. Impact Several factors contribute to the growth of the silicon carbide (SiC) market for electric vehicles (EVs). These factors include the inherent benefits of SiC over silicon, the rising sales of electric vehicles, and substantial investments by SiC manufacturers in expanding their manufacturing capacity. Key players in the SiC market are forging partnerships and making significant investments to develop improved SiC materials with enhanced properties, addressing the growing demand for advanced power electronics in electric vehicles. As electric vehicle original equipment manufacturers (OEMs) strive to enhance their EV offerings, the SiC market for electric vehicles is expected to witness substantial growth in the coming years. Market Segmentation Segmentation 1: by Application Traction Inverter On-Board Charger (OBC) DC-DC Converter The traction inverter application segment is expected to assert its dominance in the SiC market for electric vehicles. As the automotive industry increasingly focuses on sustainability and efficiency, the traction inverter emerges as a pivotal area for innovation. SiC-equipped traction inverters promise improved energy efficiency, extended driving ranges, and optimized battery utilization, addressing crucial concerns in the EV ecosystem. Segmentation 2: by Vehicle Type Passenger Vehicles Commercial Vehicles In 2022, the passenger vehicle segment accounted for a majority share of the silicon carbide (SiC) market for electric vehicles (EVs). This trend is expected to continue as passenger electric vehicles outpace commercial vehicles in production and sales. Growing consumer adoption of EVs, driven by cost-efficiency and government incentives, contributes to the dominance of passenger EVs in the market. Segmentation 3: by Propulsion Type Battery Electric Vehicles (BEVs) Hybrid Electric Vehicles (HEVs) and Plug-in Hybrid Electric Vehicles (PHEVs) Of the two propulsion categories, battery electric vehicles (BEVs) led the SiC market for electric vehicles in 2022. SiC's advantages over traditional silicon in terms of reduced power losses drive its use in BEVs. Ongoing developments in EV components integrating SiC and their incorporation into new BEV models support market growth. Segmentation 4: by Product SiC MOSFETs SiC Diodes SiC MOSFETs dominated the global SiC market for electric vehicles in 2022. These products excel in high-power, high-temperature environments due to SiC's unique characteristics, including high breakdown voltage, low on-resistance, and superior thermal conductivity, making them ideal for the rigorous demands of EV power electronics. Segmentation 5: by Voltage Up to 800V More than 800V The up to 800V voltage segment provides a balanced solution suitable for modern electric vehicles. This voltage range allows EV manufacturers to design compact and lightweight power electronics systems, enhancing vehicle range and performance. Additionally, it facilitates effective integration of SiC components, reducing switching losses and increasing overall efficiency. Segmentation 6: by Region North America Europe U.K. China Asia-Pacific and Japan (AP&J) Rest-of-the-World (RoW) China is expected to dominate the global SiC market for electric vehicles due to significant growth in the electric vehicle industry, supported by government policies, environmental concerns, and technological advancements. Government support, research investments, and partnerships with SiC manufacturers have accelerated SiC technology's development and implementation within the Chinese electric vehicle ecosystem. China's well-established supply chain infrastructure and robust manufacturing capabilities provide a competitive advantage in SiC production, contributing to cost-efficiency and scalability. Recent Developments In June 2023, Infineon Technologies launched 1200 V CoolSiC MOSFETs in TO263-7 for automotive applications, enhancing power density and efficiency in on-board charging (OBC) and DC-DC applications. In April 2023, Wolfspeed, Inc. announced the provision of SiC devices to power future Mercedes-Benz electric vehicle platforms, enabling higher powertrain efficiency. In March 2023, Mitsubishi Electric unveiled a $1.87 billion investment plan to increase SiC power semiconductor production capacity. In February 2023, Microchip Technology Inc. announced an $880 million investment to expand SiC and silicon production capacity. In January 2023, Wolfspeed, Inc. and ZF established a strategic alliance to advance SiC systems and devices for mobility, industry, and energy applications, including the development of a state-of-the-art 200mm SiC device fab. Key Market Players and Competition Synopsis The SiC market for electric vehicles is highly consolidated, with the top two manufacturers accounting for approximately 70% of the market share in 2022. The remaining companies operating in the market collectively captured around 30% of the market share. Key Companies Profiled: Wolfspeed, Inc. Infineon Technologies Onsemi Coherent Corp. (formerly II-VI Incorporated) STMicroelectronics Robert Bosch GmbH ROHM CO., LTD. Microchip Technology Inc. Mitsubishi Electric Alpha and Omega Semiconductor Toshiba Corporation Littelfuse, Inc GeneSiC Semiconductor Fuji Electric Co. Ltd. WeEn Semiconductors Solitron Devices, Inc. Demand - Drivers and Limitations The following are the demand drivers for the silicon carbide (SiC) market for electric vehicles (EVs): Superior Properties of Silicon Carbide Compared to Silicon Growth in the Demand for Electric Vehicles Increasing Investment toward Enhancing SiC Manufacturing Capacity The following are the challenges for the silicon carbide (SiC) market for electric vehicles (EVs): Higher Manufacturing Cost Associated with SiC Semiconductors Limitation of Producing Large-Diameter SiC Wafers Key Attributes: Report Attribute Details No. of Pages 240 Forecast Period 2023 - 2032 Estimated Market Value (USD) in 2023 $692.6 Million Forecasted Market Value (USD) by 2032 $9031.2 Million Compound Annual Growth Rate 33.0% Regions Covered Global For more information about this report visit https:\/\/www.researchandmarkets.com\/r\/8ohzph About ResearchAndMarkets.com ResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends. Attachment","filter_flag":1}
{"title":"LIVE: Apple iPhone launch event 2023 date and IST time in India, direct ONLINE link to Watch FREE LIVE Streaming - Expected India prices, specs | iPhone 15, iPhone 15 Plus, iPhone 15 Pro, and iPhone 15 Pro Max Features, Display, Battery life, Charger Po - ET Now","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiuQFodHRwczovL3d3dy5ldG5vd25ld3MuY29tL3RlY2hub2xvZ3kvbGl2ZS1hcHBsZS1pcGhvbmUtbGF1bmNoLWV2ZW50LTIwMjMtZGF0ZS1hbmQtaXN0LXRpbWUtaW4taW5kaWEtZnJlZS1saXZlLXN0cmVhbWluZy1vbmxpbmUtZGlyZWN0LWxpbmstZXhwZWN0ZWQtaW5kaWEtcHJpY2VzLXNwZWNzLWxpdmVibG9nLTEwMzYwMzA5MNIBvQFodHRwczovL3d3dy5ldG5vd25ld3MuY29tL3RlY2hub2xvZ3kvbGl2ZS1hcHBsZS1pcGhvbmUtbGF1bmNoLWV2ZW50LTIwMjMtZGF0ZS1hbmQtaXN0LXRpbWUtaW4taW5kaWEtZnJlZS1saXZlLXN0cmVhbWluZy1vbmxpbmUtZGlyZWN0LWxpbmstZXhwZWN0ZWQtaW5kaWEtcHJpY2VzLXNwZWNzLWxpdmVibG9nLTEwMzYwMzA5MC9hbXA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiuQFodHRwczovL3d3dy5ldG5vd25ld3MuY29tL3RlY2hub2xvZ3kvbGl2ZS1hcHBsZS1pcGhvbmUtbGF1bmNoLWV2ZW50LTIwMjMtZGF0ZS1hbmQtaXN0LXRpbWUtaW4taW5kaWEtZnJlZS1saXZlLXN0cmVhbWluZy1vbmxpbmUtZGlyZWN0LWxpbmstZXhwZWN0ZWQtaW5kaWEtcHJpY2VzLXNwZWNzLWxpdmVibG9nLTEwMzYwMzA5MNIBvQFodHRwczovL3d3dy5ldG5vd25ld3MuY29tL3RlY2hub2xvZ3kvbGl2ZS1hcHBsZS1pcGhvbmUtbGF1bmNoLWV2ZW50LTIwMjMtZGF0ZS1hbmQtaXN0LXRpbWUtaW4taW5kaWEtZnJlZS1saXZlLXN0cmVhbWluZy1vbmxpbmUtZGlyZWN0LWxpbmstZXhwZWN0ZWQtaW5kaWEtcHJpY2VzLXNwZWNzLWxpdmVibG9nLTEwMzYwMzA5MC9hbXA?oc=5","id":"CBMiuQFodHRwczovL3d3dy5ldG5vd25ld3MuY29tL3RlY2hub2xvZ3kvbGl2ZS1hcHBsZS1pcGhvbmUtbGF1bmNoLWV2ZW50LTIwMjMtZGF0ZS1hbmQtaXN0LXRpbWUtaW4taW5kaWEtZnJlZS1saXZlLXN0cmVhbWluZy1vbmxpbmUtZGlyZWN0LWxpbmstZXhwZWN0ZWQtaW5kaWEtcHJpY2VzLXNwZWNzLWxpdmVibG9nLTEwMzYwMzA5MNIBvQFodHRwczovL3d3dy5ldG5vd25ld3MuY29tL3RlY2hub2xvZ3kvbGl2ZS1hcHBsZS1pcGhvbmUtbGF1bmNoLWV2ZW50LTIwMjMtZGF0ZS1hbmQtaXN0LXRpbWUtaW4taW5kaWEtZnJlZS1saXZlLXN0cmVhbWluZy1vbmxpbmUtZGlyZWN0LWxpbmstZXhwZWN0ZWQtaW5kaWEtcHJpY2VzLXNwZWNzLWxpdmVibG9nLTEwMzYwMzA5MC9hbXA","guidislink":false,"published":"Tue, 12 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=255, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiuQFodHRwczovL3d3dy5ldG5vd25ld3MuY29tL3RlY2hub2xvZ3kvbGl2ZS1hcHBsZS1pcGhvbmUtbGF1bmNoLWV2ZW50LTIwMjMtZGF0ZS1hbmQtaXN0LXRpbWUtaW4taW5kaWEtZnJlZS1saXZlLXN0cmVhbWluZy1vbmxpbmUtZGlyZWN0LWxpbmstZXhwZWN0ZWQtaW5kaWEtcHJpY2VzLXNwZWNzLWxpdmVibG9nLTEwMzYwMzA5MNIBvQFodHRwczovL3d3dy5ldG5vd25ld3MuY29tL3RlY2hub2xvZ3kvbGl2ZS1hcHBsZS1pcGhvbmUtbGF1bmNoLWV2ZW50LTIwMjMtZGF0ZS1hbmQtaXN0LXRpbWUtaW4taW5kaWEtZnJlZS1saXZlLXN0cmVhbWluZy1vbmxpbmUtZGlyZWN0LWxpbmstZXhwZWN0ZWQtaW5kaWEtcHJpY2VzLXNwZWNzLWxpdmVibG9nLTEwMzYwMzA5MC9hbXA?oc=5\" target=\"_blank\">LIVE: Apple iPhone launch event 2023 date and IST time in India, direct ONLINE link to Watch FREE LIVE Streaming - Expected India prices, specs | iPhone 15, iPhone 15 Plus, iPhone 15 Pro, and iPhone 15 Pro Max Features, Display, Battery life, Charger Po<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ET Now<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"LIVE: Apple iPhone launch event 2023 date and IST time in India, direct ONLINE link to Watch FREE LIVE Streaming - Expected India prices, specs | iPhone 15, iPhone 15 Plus, iPhone 15 Pro, and iPhone 15 Pro Max Features, Display, Battery life, Charger Po - ET Now","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiuQFodHRwczovL3d3dy5ldG5vd25ld3MuY29tL3RlY2hub2xvZ3kvbGl2ZS1hcHBsZS1pcGhvbmUtbGF1bmNoLWV2ZW50LTIwMjMtZGF0ZS1hbmQtaXN0LXRpbWUtaW4taW5kaWEtZnJlZS1saXZlLXN0cmVhbWluZy1vbmxpbmUtZGlyZWN0LWxpbmstZXhwZWN0ZWQtaW5kaWEtcHJpY2VzLXNwZWNzLWxpdmVibG9nLTEwMzYwMzA5MNIBvQFodHRwczovL3d3dy5ldG5vd25ld3MuY29tL3RlY2hub2xvZ3kvbGl2ZS1hcHBsZS1pcGhvbmUtbGF1bmNoLWV2ZW50LTIwMjMtZGF0ZS1hbmQtaXN0LXRpbWUtaW4taW5kaWEtZnJlZS1saXZlLXN0cmVhbWluZy1vbmxpbmUtZGlyZWN0LWxpbmstZXhwZWN0ZWQtaW5kaWEtcHJpY2VzLXNwZWNzLWxpdmVibG9nLTEwMzYwMzA5MC9hbXA?oc=5\" target=\"_blank\">LIVE: Apple iPhone launch event 2023 date and IST time in India, direct ONLINE link to Watch FREE LIVE Streaming - Expected India prices, specs | iPhone 15, iPhone 15 Plus, iPhone 15 Pro, and iPhone 15 Pro Max Features, Display, Battery life, Charger Po<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ET Now<\/font>","source.href":"https:\/\/www.etnownews.com","source.title":"ET Now","query":"https:\/\/news.google.com\/rss\/search?q=\"Improved energy efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Foxconn ramps up hiring in China as Apple launches next-gen iPhones Foxconn ramped up hiring in China as Apple geared up to launch its next-generation of iPhones on Tuesday amid geopolitical tensions between Washington and Beijing and the rise of Huawei despite US sanctions, a media report said on Tuesday. Foxconn’s major plant in Zhengzhou, capital of central Henan province, is offering $880 as bonuses per person at the company’s Product Enclosure Business Group, responsible for producing mechanical parts for the iPhone, reports South China Morning Post. The world’s largest iPhone factory is “continuing to expand its workforce ahead of the release of the iPhone 15, with Apple hoping to avoid last year’s supply chain woes at the plant in China,” the report said. The new workers are expected to help the factory meet demand for Apple’s new products, including iPhone 15. “The iPhone 15 from Apple is expected to keep sales strong throughout the year and maintain its dominance in the above $600 price range in China,” Counterpoint Research senior analyst Ivan Lam was quoted as saying. Foxconn offered larger bonuses to returning workers in June this year following a worker exodus and production disruptions. ","filter_flag":1}
