{"title":"Advancing Post-Consumer Textile Recycling: Emerging Technologies Shaping Sustainable Fashion - Fibre2fashion.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijwFodHRwczovL3d3dy5maWJyZTJmYXNoaW9uLmNvbS9pbmR1c3RyeS1hcnRpY2xlLzk4NDgvYWR2YW5jaW5nLXBvc3QtY29uc3VtZXItdGV4dGlsZS1yZWN5Y2xpbmctZW1lcmdpbmctdGVjaG5vbG9naWVzLXNoYXBpbmctc3VzdGFpbmFibGUtZmFzaGlvbtIBmAFodHRwczovL3d3dy5maWJyZTJmYXNoaW9uLmNvbS9pbmR1c3RyeS1hcnRpY2xlLzk4NDgvYWR2YW5jaW5nLXBvc3QtY29uc3VtZXItdGV4dGlsZS1yZWN5Y2xpbmctZW1lcmdpbmctdGVjaG5vbG9naWVzLXNoYXBpbmctc3VzdGFpbmFibGUtZmFzaGlvbj9hbXA9dHJ1ZQ?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijwFodHRwczovL3d3dy5maWJyZTJmYXNoaW9uLmNvbS9pbmR1c3RyeS1hcnRpY2xlLzk4NDgvYWR2YW5jaW5nLXBvc3QtY29uc3VtZXItdGV4dGlsZS1yZWN5Y2xpbmctZW1lcmdpbmctdGVjaG5vbG9naWVzLXNoYXBpbmctc3VzdGFpbmFibGUtZmFzaGlvbtIBmAFodHRwczovL3d3dy5maWJyZTJmYXNoaW9uLmNvbS9pbmR1c3RyeS1hcnRpY2xlLzk4NDgvYWR2YW5jaW5nLXBvc3QtY29uc3VtZXItdGV4dGlsZS1yZWN5Y2xpbmctZW1lcmdpbmctdGVjaG5vbG9naWVzLXNoYXBpbmctc3VzdGFpbmFibGUtZmFzaGlvbj9hbXA9dHJ1ZQ?oc=5","id":"CBMijwFodHRwczovL3d3dy5maWJyZTJmYXNoaW9uLmNvbS9pbmR1c3RyeS1hcnRpY2xlLzk4NDgvYWR2YW5jaW5nLXBvc3QtY29uc3VtZXItdGV4dGlsZS1yZWN5Y2xpbmctZW1lcmdpbmctdGVjaG5vbG9naWVzLXNoYXBpbmctc3VzdGFpbmFibGUtZmFzaGlvbtIBmAFodHRwczovL3d3dy5maWJyZTJmYXNoaW9uLmNvbS9pbmR1c3RyeS1hcnRpY2xlLzk4NDgvYWR2YW5jaW5nLXBvc3QtY29uc3VtZXItdGV4dGlsZS1yZWN5Y2xpbmctZW1lcmdpbmctdGVjaG5vbG9naWVzLXNoYXBpbmctc3VzdGFpbmFibGUtZmFzaGlvbj9hbXA9dHJ1ZQ","guidislink":false,"published":"Tue, 21 Nov 2023 08:36:55 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=21, tm_hour=8, tm_min=36, tm_sec=55, tm_wday=1, tm_yday=325, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijwFodHRwczovL3d3dy5maWJyZTJmYXNoaW9uLmNvbS9pbmR1c3RyeS1hcnRpY2xlLzk4NDgvYWR2YW5jaW5nLXBvc3QtY29uc3VtZXItdGV4dGlsZS1yZWN5Y2xpbmctZW1lcmdpbmctdGVjaG5vbG9naWVzLXNoYXBpbmctc3VzdGFpbmFibGUtZmFzaGlvbtIBmAFodHRwczovL3d3dy5maWJyZTJmYXNoaW9uLmNvbS9pbmR1c3RyeS1hcnRpY2xlLzk4NDgvYWR2YW5jaW5nLXBvc3QtY29uc3VtZXItdGV4dGlsZS1yZWN5Y2xpbmctZW1lcmdpbmctdGVjaG5vbG9naWVzLXNoYXBpbmctc3VzdGFpbmFibGUtZmFzaGlvbj9hbXA9dHJ1ZQ?oc=5\" target=\"_blank\">Advancing Post-Consumer Textile Recycling: Emerging Technologies Shaping Sustainable Fashion<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2fashion.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Advancing Post-Consumer Textile Recycling: Emerging Technologies Shaping Sustainable Fashion - Fibre2fashion.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijwFodHRwczovL3d3dy5maWJyZTJmYXNoaW9uLmNvbS9pbmR1c3RyeS1hcnRpY2xlLzk4NDgvYWR2YW5jaW5nLXBvc3QtY29uc3VtZXItdGV4dGlsZS1yZWN5Y2xpbmctZW1lcmdpbmctdGVjaG5vbG9naWVzLXNoYXBpbmctc3VzdGFpbmFibGUtZmFzaGlvbtIBmAFodHRwczovL3d3dy5maWJyZTJmYXNoaW9uLmNvbS9pbmR1c3RyeS1hcnRpY2xlLzk4NDgvYWR2YW5jaW5nLXBvc3QtY29uc3VtZXItdGV4dGlsZS1yZWN5Y2xpbmctZW1lcmdpbmctdGVjaG5vbG9naWVzLXNoYXBpbmctc3VzdGFpbmFibGUtZmFzaGlvbj9hbXA9dHJ1ZQ?oc=5\" target=\"_blank\">Advancing Post-Consumer Textile Recycling: Emerging Technologies Shaping Sustainable Fashion<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2fashion.com<\/font>","source.href":"https:\/\/www.fibre2fashion.com","source.title":"Fibre2fashion.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Post-consumer recycling\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The textile industry is facing an urgent call for sustainable technologies as it confronts its significant environmental impact. This has spurred a new generation of companies that are innovating chemical recycling techniques to tackle waste from major fibres such as cellulosics like cotton, and synthetics like polyester and nylon. For years, some of the largest clothing brands in the world have maintained the exclusivity of their products through a costly process—not in terms of financial expense, but environmental toll—incinerating unsold stock. Yet, the tide is turning, partly due to stricter EU waste legislation and a growing public awareness of recycling and sustainability issues. Such legislation is pushing manufacturers away from burning unsold garments towards an eco-friendlier obligation of recycling—mirroring the recycling responsibilities for packaging materials. A staggering 92 million tonnes1 of textile waste are generated globally every year, and with 80 to 100 billion new items of clothing produced annually, a vast majority—87 per cent—of the fibres and materials used in manufacturing clothes are destined for incinerators or landfills. It is reported that only a mere 20 per cent of textile waste is actually collected for recycling, and an even smaller fraction, just one per cent, is repurposed into new clothing. One of the central hurdles in recycling post-consumer textile waste and fostering a circular economy is the poor quality of the recycled materials. Post-Consumer Recycled (PCR) content is often identified by sustainability professionals as a critical area for improvement, essential for reducing the volume of waste. As such, enhancing the technologies for recycling and processing fibres is a crucial step in elevating the quality of these post-consumer goods. The distinction between pre-consumer and post-consumer waste is significant. Pre-consumer waste, consisting of scraps and trimmings, arises during the manufacturing process. On the other hand, post-consumer waste is made up of clothing that consumers have discarded, whether because it is damaged, out of style, or no longer wanted. As fashion trends and consumer demands continue to evolve rapidly, the issue of textile waste intensifies, threatening the well-being of future generations. Landfills are increasingly burdened with mounds of abandoned garments, a testament to the pressing need for advanced recycling solutions in the textile industry. What are the Technologies That Can be Used for Post-Consumer Recycling for Textiles? Post-consumer textile waste poses a unique challenge as newly produced textiles frequently approach their end of life shortly after entering the market. China and the United States are the largest producers of textile waste, generating 20 million tonnes and 17 million tonnes respectively2. Globally, only about 20 per cent of textiles3 are selected for recycling or reuse. The second-hand clothing market, though sizeable, is oversaturated, leading to a scenario where only a fraction of collected textiles are sold. The remainder, deemed non-rewearable, is either downcycled, incinerated, or relegated to landfills. Despite obstacles such as inefficient waste collection and sorting systems or the low cost of virgin materials, new recycling technologies are making headway. Two primary methods for recycling fibres have been developed: mechanical and chemical recycling. We explore these methods below, including the technological advancements that have propelled them. Mechanical Recycling involves breaking down the material to create a fibrous substance that can be respun. This process, however, tends to shorten and weaken the fibres, compromising their quality. Consequently, mechanically recycled fibres often exhibit limited circularity and typically require blending with virgin fibres to compensate. Innovations in technology now enable companies to produce mechanically recycled natural fibres of comparable quality to virgin materials without the need to mix in new fibres. Resilk4, for example, is a novel fibre crafted entirely from recycled silk. Resilk aims to honour the intrinsic value of silk fabrics and the extensive labour involved in their creation, from the cultivation of mulberries and silkworms to the weaving of yarns and fabrics. Chemical Recycling involves depolymerization, a process that breaks down materials to their raw constituents, facilitating the creation of new filaments which are subsequently transformed into threads. Chemically recycled fibres can endure multiple recycling rounds without quality degradation, matching the quality of virgin fibres. Techniques for the chemical recycling of synthetics have expanded in recent years. Depolymerisation, which reduces plastic polymers to monomer units for the manufacture of new plastic products, is one such process. Additionally, technologies like pyrolysis and gasification have gained traction. Processes such as hydrolysis, alcoholysis, and aminolysis are employed to chemically recycle PET textiles. Synthetic fibres like polyesters, polyamides, and polyolefins, present in cotton-polyester blends, can be chemically separated and transformed into new fibres. Numerous companies have initiated the separation and recovery of mixed fibres like polyester and cotton from old garments, producing virgin-equivalent raw materials fit for ongoing recycling. Technological advancements now allow the chemical recycling of natural fibres beyond experimental lab stages. The transformation of cotton into viscose is a prominent example of this recycling process, utilising a method similar to that used for converting wood pulp into viscose, breaking down pure cotton fabric into a pulp that can be reformed. Technologies That Can be Used for Post-Consumer Recycling for Textiles The recycling of textile materials, much like plastics, presents considerable challenges. The diversity of materials, constructions, and dyes used complicates the recycling process post-production. Moreover, as fashion-related items, they frequently undergo changes in style and design and come equipped with a variety of accessories, further complicating their automatic recycling. Below is an overview of some technologies that facilitate Post-Consumer Recycling for textiles: Cutting, Shredding, and Carding: Mechanical processes such as cutting, shredding, and carding are used to recycle post-consumer textile waste. These methods break down fabric into fibres that can be reused to create new products. The resulting fibres can be spun into yarns suitable for knitting, nonwoven fabrics, and woven textiles. This approach is primarily applied in the recycling of home insulation and carpet padding. Flocking: Flocking involves applying numerous small fibre particles, known as flock, onto a surface. This term can also refer to the materials mainly used for their flocked surface, or to the texture produced by the flocking process. An item might be flocked to increase its value or to impart a particular tactile quality. Mechanical Recycling: Ongoing technological advancements have enabled mills to produce textiles from natural fibres with a quality nearly indistinguishable from virgin materials through mechanical recycling, without the need to add virgin content. Mechanical recycling transforms waste into a secondary raw material without changing its chemical structure. Key mechanical recycling techniques for textiles include shredding fabrics and melting and extruding synthetic fibres like polyester. Fibersort: Fibersort is a technology that automatically sorts large volumes of mixed post-consumer textiles based on their material composition. The aim is to enable these used textiles to be recycled back into raw materials for new clothing production. Fibersort categorises non-rewearable, discarded garments by material and colour. It classifies non-wearable textile items into grades of materials ready for recycling. High-value recycling processes play an integral role in the circular economy, converting low-value waste into new, high-value textiles. Fibersort stands as a pivotal technology in enabling textile resources to cyclically re-enter the supply chain. Ending Note While there are challenges that hinder the recycling process, such as inefficient waste collection and sorting systems, along with a dampened demand for recycled materials owing to the competitive market price of virgin materials, new recycling innovations are nonetheless making headway. Furthermore, financial barriers are being overcome, facilitating the commercial expansion of these technologies. It should be noted, however, that not all textiles can be recycled through enzymatic hydrolysis, but significant yields have been achieved at low temperatures. The incorporation of current technologies, such as the Internet of Things (IoT), to facilitate effective sorting and identification of textile waste, is also gaining prominence. Perhaps the time has come to take meaningful steps towards achieving sustainability in fashion, thereby moving closer to a truly circular economy.","filter_flag":1}
