{"title":"Making Energy More Affordable With Solar Power: An interview with Deep Chakraborty of Enact Solar - Renewable Energy Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LnJlbmV3YWJsZWVuZXJneW1hZ2F6aW5lLmNvbS9pbnRlcnZpZXdzL21ha2luZy1lbmVyZ3ktbW9yZS1hZmZvcmRhYmxlLXdpdGgtc29sYXItcG93ZXItMjAyMzEyMTnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LnJlbmV3YWJsZWVuZXJneW1hZ2F6aW5lLmNvbS9pbnRlcnZpZXdzL21ha2luZy1lbmVyZ3ktbW9yZS1hZmZvcmRhYmxlLXdpdGgtc29sYXItcG93ZXItMjAyMzEyMTnSAQA?oc=5","id":"CBMiamh0dHBzOi8vd3d3LnJlbmV3YWJsZWVuZXJneW1hZ2F6aW5lLmNvbS9pbnRlcnZpZXdzL21ha2luZy1lbmVyZ3ktbW9yZS1hZmZvcmRhYmxlLXdpdGgtc29sYXItcG93ZXItMjAyMzEyMTnSAQA","guidislink":false,"published":"Tue, 19 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=19, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=353, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LnJlbmV3YWJsZWVuZXJneW1hZ2F6aW5lLmNvbS9pbnRlcnZpZXdzL21ha2luZy1lbmVyZ3ktbW9yZS1hZmZvcmRhYmxlLXdpdGgtc29sYXItcG93ZXItMjAyMzEyMTnSAQA?oc=5\" target=\"_blank\">Making Energy More Affordable With Solar Power: An interview with Deep Chakraborty of Enact Solar<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Renewable Energy Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Making Energy More Affordable With Solar Power: An interview with Deep Chakraborty of Enact Solar - Renewable Energy Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LnJlbmV3YWJsZWVuZXJneW1hZ2F6aW5lLmNvbS9pbnRlcnZpZXdzL21ha2luZy1lbmVyZ3ktbW9yZS1hZmZvcmRhYmxlLXdpdGgtc29sYXItcG93ZXItMjAyMzEyMTnSAQA?oc=5\" target=\"_blank\">Making Energy More Affordable With Solar Power: An interview with Deep Chakraborty of Enact Solar<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Renewable Energy Magazine<\/font>","source.href":"https:\/\/www.renewableenergymagazine.com","source.title":"Renewable Energy Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Tuesday, 19 December 2023 Pacific Gas and Electric (PG&E), the utility that provides gas and electricity to residential and business customers in central and northern California is pushing the state’s regulators to approve another rise in energy rates, that is after the California Public Utilities Commission (CPUC) already agreed that the utility could levy an increase of around $33 per month beginning in 2024. This could make electricity and gas bills even more unaffordable, but PG&E says it is essential in order to help pay for damage by winter storms and to mitigate wildfires. REM talked to Enact Solar CEO Deep Chakraborty to find out how solar power could help to provide a monetary lifeline to Californians, the potential benefits of installing solar systems in the wake of the PG&E rate hike and how the company has played a key part in driving forward solar installation in the state. Can you introduce yourself and give a brief background to Enact Solar After beginning my career in the automotive industry, developing new products and leading manufacturing launches for Chrysler, I moved to Roland Berger. Based in Germany, I led strategy on new energy technologies for large firms and startups. Much of the division’s focus was on electric vehicle (EV) transportation, charging, and battery storage startups. It was here I experienced first-hand the transformational impact renewable energy can have on lowering carbon emissions. After that, I joined one of Europe’s leading suppliers of solar energy systems, where I was offered the opportunity to co-found a subsidiary for the North American market. In less than four years, I led the company from ground zero to annual sales of $30M in more than 25 US states. This opportunity and its success was a turning point for me and gave me confidence that I could find similar success in building a company of my own. In 2014, I quit my job to start Enact. Upon founding Enact, our primary and enduring goal has been to simplify the journey from solar power design to cost savings. We launched Enact to simplify this customer experience and accelerate the clean energy revolution. The Enact founding team has decades of solar industry experience across three continents, helping us to focus and understand the industry gaps. Our award-winning platform now allows customers, both homeowners and businesses, to simplify their entire solar and energy storage purchase, designed through Enact and delivered by local solar professionals. Enact also enables thousands of solar professionals to design, deliver projects, and manage assets for long-term performance. What kind of presence do you have in California, and where else do you operate outside the state? As of early 2023, California already has over 1 million buildings installed with Solar, 50,000 new customers a month and batteries now get paired with 30 percent of new solar installations every month. This market provided the initial launchpad for the growth of the Enact platform, spreading to a dozen additional US states. Enact’s success story in the U.S. was quickly replicated in several new markets, such as the UAE, South Africa, and South Asia and Europe, and now cater to thousands of consumers and installers in over 25 countries worldwide, processing $1.5 billion in projects annually. Apparently, California leads the way in the US when it comes to solar panel installation, but how diverse is this installation? Is it mainly the wealthier folks in the state who install solar panels or are there programs to expand installation in poorer areas as well? Rooftop solar has, until recently, largely been limited to customers who own their homes, have higher-than-average incomes and credit scores. However in the past few years, solar adoption has started to spread to more moderate-income households, driven by falling solar prices, better financing options and, in many states, incentives aimed at expanding access in lower-income communities. Nevertheless, the accessibility of a rooftop solar system is still largely dependent on how much it can earn for the household installing it. For many homeowners, a cash payment for a solar energy system is unrealistic and flexible financing options need to be made available to make solar energy more accessible. Enact has partnered with many financing providers that enable most customers’ budgets to afford our systems. Customers can finance their installations through solar loans or leases, which is outlined step-by-step in our financial proposals and reviewed before the process begins. What is the average cost for the installation of a solar panel system in California and what does that include in terms of components etc? There is no one-size-fits-all answer for the price of solar panel installation. The market average for a 5kW system is $14,896 in California. Multiple factors affect the price, including the system size, the equipment, and the installer fee. Luckily, California has multiple financing options so that any homeowner or business can afford solar power installation, including paying in cash, solar loans, and power purchase agreements (PPA). Unsurprisingly, the bigger the system, the more expensive the upfront cost. But the more expensive a system costs, the more credit the owner gets back on their federal tax bill, and also higher the savings from solar due to higher generation. Consumers can use their renewable energy credits (RECs) as an alternative source of income, as their excess solar-generated energy is sold and they earn cash-back to reinvest in their solar systems, their household goods, or however they see fit. Enact helps users design their solar system to optimize their roof space, helping them save by preventing situations such as purchasing too many or not enough solar panels. What is the average payback time for someone currently investing in a solar panel installation? While the upfront costs may discourage some prospective buyers, investing in solar in California is always a smart long-term investment. On average, systems pay for themselves anywhere between four to ten years. Users will have lower-cost electricity bills, are entitled to federal tax credits, and could be eligible for various state incentives that will help their solar systems pay for themselves. A custom solar design can provide greater utility savings. Enact designs solar systems that optimally provide energy for a user's needs and reduces their dependence on the power grid, lowering utility bills. Solar panels are usually warranted for a period of 25 years, and in that time, can save homeowners anywhere between $20,000 and $75,000. What grants, loans or other financial assistance schemes are available in the state to help people with the cost of installation? Along with multiple financing options, California has over 150 incentives to encourage its residents to install solar energy. With the cost of living crisis and raised interest rates, these incentives are able to help families and businesses install solar and save money on their energy bills, even during a period when people are feeling economic pressure. The main incentive, which applies to the entire United States, is the Federal Solar Tax Credit. It is a dollar-for-dollar reduction on the amount of income tax a homeowner would otherwise pay to the Internal Revenue Service (IRS). Homeowners who are eligible are able to deduct 30 per cent of the installation cost of their solar systems. This means they can use the credit to fund the cost of the solar panels, solar equipment, installation labor, storage batteries, or sales tax that is paid. With the cost of living crisis and raised interest rates, these incentives are able to help families and businesses install solar and save money on their energy bills, even during a period when people are feeling economic pressures. How has the California Solar Mandate helped to expand solar panel installation in the region? The California Solar Mandate has required new homes that are built in the state to have a solar photovoltaic (PV) system - the device that turns sunlight into energy - as its energy source. Along with generous tax incentives that encourage Californians to go green, this new regulation has caused a boom in the installation industry. Often, the process of installing for the customer is costly and lacks transparency. Enact helps with this by being present in every step of the process, with an optimized design that is explained to homeowners on expert consultations, a solar monitoring app, and your feedback considered throughout. As building and development continues in California, solar energy usage will grow in the state. What are the main challenges facing solar panel installation in California and how are they being overcome? The main challenge for most homeowners and small businesses is the upfront cost of solar. Because of the hefty price tag attached to installation, solar energy has disproportionately benefited high-income areas. However, multiple government incentives are becoming available that help low-income families reap the benefits of renewable energy. Another challenge now is the new NEM3.0 policy change that is designed to have energy storage paired with Solar to improve saving. This makes the design and ROI estimation more complex, and Enact’s software really simplifies this not just for homeowners but also for solar professionals who need better tools. Additional challengers can be physical issues such as roof space, shade, and inclement weather. Enact helps with this problem by mapping out the best solar system design for users' homes, which accounts for spatial issues and blocked areas. What part has Enact Solar played in driving forward installation in the state, particularly for poorer communities? Enact has partnered with financing providers, including local credit unions, which provide multiple options to customers. Customers are provided with detailed walkthroughs on each financing option, including external options. Estimated upfront costs are transparent without hidden fees and contracts are flexible. In addition to homeowners, Enact has also helped community non-profits and businesses adopt solar. Non-profits this year include temples and places of worship, who also face the same challenge of high electricity bills. Solar installations are also unbiased, meaning the best option is chosen for the customer’s home and price point. The PG&E justification for raising the rate was undergrounding power lines to make the power system more resilient in the face of increasingly ferocious wildfires. Just how dangerous have these wildfires become and what is the extent of the danger to California’s power systems? Undergrounding power-lines is indeed necessary in high-density urban areas that face the risk of wildfires triggered by faulty power lines. In recent years, climate change has had noticeable effects on our lives, such as Tropical Storm Hilary this past August. Wildfire season is starting earlier and earlier in California, impacting wildlife and communities. Unfortunately, the smoke from these fires does have an impact on solar power generation. In 2020, wildfire smoke cut solar power generation in California by 30 percent. However, solar panels are still resilient, and despite cloudy or smoggy skies, they are able to generate energy via sunlight that filters through. That’s one of the reasons why battery storage is becoming more important, as they store the excess energy on sunny days to use during the evening, or for back-up power needs when the grid is out. But the ultimate answer to the grid’s failing infrastructure is more solar (not less). The huge benefit of solar is that it is decentralized power, making communities more resilient. So even if the grid goes down, the consumer can stay unaffected. In addition to improving grid resiliency, and decreasing home and business owners’ energy bills, Solar is also helping countries reach their net zero emissions targets outlined in The Paris Agreement. That is why it is so important incentives are put in place and financing options for all incomes are available - as more and more people switch to clean energy, climate change can be slowed down. It seems the CPUC approved a 13 percent rate hike. What will that mean for low-income citizens and who will be most affected? With over $30 being tagged onto people’s energy bills each month, low-income citizens will struggle to keep their lights, heating, and cooling systems on. To keep bills low, switching to solar is a viable option for many homes, including low-income ones. California has incentives for disadvantaged communities (DAC-SASH program) that allows them to install solar at no cost. For additional information: Enact Solar","filter_flag":1}
{"title":"Details emerge about DOE 'super‑grid' renewable study - E&E News by POLITICO","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LmVlbmV3cy5uZXQvYXJ0aWNsZXMvZGV0YWlscy1lbWVyZ2UtYWJvdXQtZG9lLXN1cGVyJUUyJTgwJTkxZ3JpZC1yZW5ld2FibGUtc3R1ZHkv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LmVlbmV3cy5uZXQvYXJ0aWNsZXMvZGV0YWlscy1lbWVyZ2UtYWJvdXQtZG9lLXN1cGVyJUUyJTgwJTkxZ3JpZC1yZW5ld2FibGUtc3R1ZHkv0gEA?oc=5","id":"CBMiXGh0dHBzOi8vd3d3LmVlbmV3cy5uZXQvYXJ0aWNsZXMvZGV0YWlscy1lbWVyZ2UtYWJvdXQtZG9lLXN1cGVyJUUyJTgwJTkxZ3JpZC1yZW5ld2FibGUtc3R1ZHkv0gEA","guidislink":false,"published":"Tue, 19 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=19, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=353, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LmVlbmV3cy5uZXQvYXJ0aWNsZXMvZGV0YWlscy1lbWVyZ2UtYWJvdXQtZG9lLXN1cGVyJUUyJTgwJTkxZ3JpZC1yZW5ld2FibGUtc3R1ZHkv0gEA?oc=5\" target=\"_blank\">Details emerge about DOE 'super‑grid' renewable study<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">E&amp;E News by POLITICO<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Details emerge about DOE 'super‑grid' renewable study - E&E News by POLITICO","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LmVlbmV3cy5uZXQvYXJ0aWNsZXMvZGV0YWlscy1lbWVyZ2UtYWJvdXQtZG9lLXN1cGVyJUUyJTgwJTkxZ3JpZC1yZW5ld2FibGUtc3R1ZHkv0gEA?oc=5\" target=\"_blank\">Details emerge about DOE 'super‑grid' renewable study<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">E&amp;E News by POLITICO<\/font>","source.href":"https:\/\/www.eenews.net","source.title":"E&E News by POLITICO","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Correction appended. A coast-to-coast transmission \"super-grid\" could be built across the United States for $80 billion and deliver economic gains of more than twice that amount, moving surplus renewable energy to major urban centers, according to an Energy Department national laboratory study that was pulled back by DOE headquarters, which called for more work on the findings. James McCalley, a senior Iowa State University engineering professor and a principal author of the National Renewable Energy Laboratory study, said yesterday he is doing new analysis requested by DOE and expects to be done next year. DOE said the final report may not be released until 2022. Advertisement \"My expectation is that [the additional analysis] probably will not change the basic thrust of our conclusions: High-capacity interregional transmission lines, particularly connecting the eastern and western grid compounds, have significant benefits,\" McCalley said in an interview with E&E News. The fate of the $1.5 million, two-year study has concerned researchers and at least one member of Congress, after parts of it were released over the past three years. It used computer models to investigate future scenarios for the U.S. grid out to 2038. The most significant analysis considered linking the two primary high-voltage grid networks, now divided by the Rocky Mountains. \"The study has been finished for a while,\" grid analyst Christopher Clack told a transmission conference last week. Clack, CEO of Vibrant Clean Energy LLC, a Boulder, Colo., power grid modeling firm, added, \"I feel like it makes uncomfortable reading\" for some at DOE, with its scenario for moving renewable power across the four U.S. time zones to take advantage of peak output (Energywire, Oct. 25). McCalley said anyone interested in the study can listen to Aaron Bloom, the project’s lead architect, describing it on video at the TransGrid-X 2030 Symposium in Ames, Iowa, in July 2018. \"He gave a stellar presentation,\" McCalley said. The symposium site has online details, as well, he said. Bloom left NREL to become director of new products research and development at NextEra Analytics in Minneapolis. Asked about the study’s status last week, DOE said in a statement: \"DOE officials reviewed preliminary results from the study and decided to expand the project to model and analyze additional scenarios. This includes refining methods and data parameters for improved modeling of transmission congestion within capacity planning tools and grid operations models. The improved characterization of congestion will model how this transmission expansion can contribute to reliability and resilience in the future grid.\" McCalley said his assignment was to do the additional analysis on one part of the report. Another piece has been completed and is going through final review. He said he isn’t surprised if people read political consequences into the work but added that that’s not his department. \"I am an engineering professor, not a political scientist,\" he said. \"We all have opinions. Sure, there’s politics involved. I’m sure there’s [something] political in everything that’s significant.\" A high-voltage direct-current overlay grid would make cheaper power more available in Georgia and Massachusetts, for example, he said. \"The jobs that come with that stay in Oklahoma\" or other wind power states, he said. \"That’s a political issue. I’m just recognizing it.\" The study wasn’t commissioned as a hatchet job on coal-fired power generation, he said, although its key focus is on expanding access to renewable power resources that are forcing older coal plants into retirement. \"Are we ‘killing’ coal? Maybe we are, but that’s not the purpose over the overlay,\" he said. Its purpose is to move energy and grid reliability services across the country in the most economical way. \"If you [were] to build coal like crazy, it will facilitate that, too.\" Correction: Aaron Bloom left NREL to become director of new products research and development at NextEra Analytics. An earlier version of this story incorrectly identified the company. This story also misidentified the ERGIS study as a part of the Seams analysis.","filter_flag":1}
{"title":"2024 oil and gas industry outlook - Deloitte","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvb2lsLWFuZC1nYXMtaW5kdXN0cnktb3V0bG9vay5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvb2lsLWFuZC1nYXMtaW5kdXN0cnktb3V0bG9vay5odG1s0gEA?oc=5","id":"CBMiX2h0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvb2lsLWFuZC1nYXMtaW5kdXN0cnktb3V0bG9vay5odG1s0gEA","guidislink":false,"published":"Fri, 01 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=1, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=335, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvb2lsLWFuZC1nYXMtaW5kdXN0cnktb3V0bG9vay5odG1s0gEA?oc=5\" target=\"_blank\">2024 oil and gas industry outlook<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deloitte<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"2024 oil and gas industry outlook - Deloitte","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvb2lsLWFuZC1nYXMtaW5kdXN0cnktb3V0bG9vay5odG1s0gEA?oc=5\" target=\"_blank\">2024 oil and gas industry outlook<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deloitte<\/font>","source.href":"https:\/\/www2.deloitte.com","source.title":"Deloitte","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"5. Downstream industry: Revamping the refining industry in alignment with evolving demand patterns The four disruptors shaping the energy landscape (geopolitics, economics, regulatory, and technology) have also impacted the global downstream petroleum sector. This situation is likely further exacerbated by the decline in global refinery capacity, which shrunk by 4.5 mbpd since 2019, with the United States’ refining capacity falling by 1 mbpd since the COVID-19 pandemic due to numerous factors, including the pandemic’s impacts, hurricane damages, weaker future demand forecasts, high operations costs, the inability to complete sales, or conversions to produce more renewable fuels.42 The refining industry now faces a pivotal moment, as the industry is producing and bringing to market new products to offset expected longer-term decline in transport demand for fossil fuels and, thus, adopting even more of a customer-centric or end market–oriented approach. Therefore, a blend of low-carbon fuel alternatives, from biofuels and hydrogen to chemicals, alongside a redesigned forecourt experience catering to evolving fuel mix and customer base is becoming important to the success of the downstream industry. Global oil demand is projected to slow down in the long term, rising annually by only 0.4 mbpd until 2027, compared to 1.6 mbpd until 2023. Meanwhile global biofuels demand is projected to rise by 44% between 2022 and 2027 as it increasingly substitutes for petroleum-based products.43 In addition, the share of EVs in global car sales is expected to range between 62% and 86% by 2030.44 In response, many global automakers are reorienting to electrify large portions of their product portfolios. Crafting niche capabilities The gap between rising low-carbon fuel alternatives and slowing but still positive oil demand expansion can offer a window for refiners to plan their transition without risking the disruption of financial stability. Therefore, refiners could play a transformative role by crafting strategic pathways and cultivating new capabilities within the following distinctive realms: Biofuels : O&G refiners already operate nearly 80% of the current global renewable diesel capacity. 45 However, they may grapple with the task of effectively leveraging subsidies and grants for strengthening the biofuel supply chain. Therefore, considering strategic steps such as securing a consistent feedstock supply, handling grade fluctuations, and optimizing transportation expenses and emissions can facilitate the efficient expansion of biofuels and set refiner performance apart. A case in point is Marathon Petroleum Corporation’s joint venture with ADM, which involves a specialized soybean processing facility to yield refined vegetable oil feedstock for renewable diesel production. 46 : O&G refiners already operate nearly 80% of the current global renewable diesel capacity. However, they may grapple with the task of effectively leveraging subsidies and grants for strengthening the biofuel supply chain. Therefore, considering strategic steps such as securing a consistent feedstock supply, handling grade fluctuations, and optimizing transportation expenses and emissions can facilitate the efficient expansion of biofuels and set refiner performance apart. A case in point is Marathon Petroleum Corporation’s joint venture with ADM, which involves a specialized soybean processing facility to yield refined vegetable oil feedstock for renewable diesel production. Hydrogen and ammonia : Green hydrogen and ammonia could present refiners with a compelling opportunity to not only curtail emissions but also decrease heating expenses, while broadening their product portfolio for industrial clientele. In fact, BP is reportedly mulling green hydrogen production at its Cherry Point facility, which could help reduce emissions by around 460,000 tons carbon dioxide equivalent per year. 47 : Green hydrogen and ammonia could present refiners with a compelling opportunity to not only curtail emissions but also decrease heating expenses, while broadening their product portfolio for industrial clientele. In fact, BP is reportedly mulling green hydrogen production at its Cherry Point facility, which could help reduce emissions by around 460,000 tons carbon dioxide equivalent per year. Electric vehicles : In addition to deploying EV charging stations and offering new mobility services at their retail outlets, leading refiners have a unique opportunity to explore various applications within the EV sector. For example, Phillips 66 is leveraging specialty coke to craft high-performance anode materials for the production of lithium-ion batteries. 48 : In addition to deploying EV charging stations and offering new mobility services at their retail outlets, leading refiners have a unique opportunity to explore various applications within the EV sector. For example, Phillips 66 is leveraging specialty coke to craft high-performance anode materials for the production of lithium-ion batteries. Chemicals : Amid increasing electrification, leading refiners could reconfigure their product portfolios, prioritizing items such as chemicals that have fewer readily available low-carbon alternatives. For instance, ExxonMobil plans to boost distillate and chemicals production at its Singapore and UK refineries, while reducing fuel oil and high-sulfur petroleum production. 49 : Amid increasing electrification, leading refiners could reconfigure their product portfolios, prioritizing items such as chemicals that have fewer readily available low-carbon alternatives. For instance, ExxonMobil plans to boost distillate and chemicals production at its Singapore and UK refineries, while reducing fuel oil and high-sulfur petroleum production. Carbon capture, usage, and storage (CCUS): Refinery and chemical organizations can leverage carbon capture for mitigating emissions from units such as steam methane reformers, catalytic crackers, and combined heat and power systems. For instance, Air Liquide, Air Products, ExxonMobil, and Shell are targeting to capture 2.5 million tonnes\/year at Porthos CCUS in Rotterdam.50 In conclusion, downstream players that adapt their strategies in alignment with evolving demand trends and prioritize the security of the supply chain could achieve success in the energy transition.","filter_flag":1}
{"title":"Finding solutions to instability in renewables' grid - Cosmos","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vY29zbW9zbWFnYXppbmUuY29tL3RlY2hub2xvZ3kvZW5lcmd5L3NvbHV0aW9ucy10by1pbnN0YWJpbGl0eS1pbi1yZW5ld2FibGVzLWdyaWQv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vY29zbW9zbWFnYXppbmUuY29tL3RlY2hub2xvZ3kvZW5lcmd5L3NvbHV0aW9ucy10by1pbnN0YWJpbGl0eS1pbi1yZW5ld2FibGVzLWdyaWQv0gEA?oc=5","id":"CBMiWWh0dHBzOi8vY29zbW9zbWFnYXppbmUuY29tL3RlY2hub2xvZ3kvZW5lcmd5L3NvbHV0aW9ucy10by1pbnN0YWJpbGl0eS1pbi1yZW5ld2FibGVzLWdyaWQv0gEA","guidislink":false,"published":"Fri, 08 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=342, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vY29zbW9zbWFnYXppbmUuY29tL3RlY2hub2xvZ3kvZW5lcmd5L3NvbHV0aW9ucy10by1pbnN0YWJpbGl0eS1pbi1yZW5ld2FibGVzLWdyaWQv0gEA?oc=5\" target=\"_blank\">Finding solutions to instability in renewables' grid<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cosmos<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Finding solutions to instability in renewables' grid - Cosmos","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vY29zbW9zbWFnYXppbmUuY29tL3RlY2hub2xvZ3kvZW5lcmd5L3NvbHV0aW9ucy10by1pbnN0YWJpbGl0eS1pbi1yZW5ld2FibGVzLWdyaWQv0gEA?oc=5\" target=\"_blank\">Finding solutions to instability in renewables' grid<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cosmos<\/font>","source.href":"https:\/\/cosmosmagazine.com","source.title":"Cosmos","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"The central Australian town of Alice Springs – bathed in fierce desert sunlight – is on track to achieve 50% renewable power generation by 2030. But the good news is tempered by – of all things – the hugely successful uptake of rooftop solar in the town. In Alice, distributed (or uncontrolled) rooftop solar now accounts for 9% of the power generated for the town up from zero in 2008, a terrific success story, though one not unique to Alice. Uptake of rooftop solar is high across the nation. Unsurprisingly then, consumer demand for solar in Alice Springs is forecast to keep rising, even as gas continues to generate about 87% of the town’s power. And there’s the snag: grid managers say more solar for Alice Springs will cause “instability” in the grid, where the amount of electricity produced is not matched to the amount being used. This comes on top of regulatory barriers and as part of a set of complex social “drivers” around power generation. These problems are faced across Australia and much of the world – the electricity grid isn’t built for renewable energy. Lyndon Frearson is Project Director of Alice Springs Future Grid (ASFG), a $12.5M collaborative effort to find a way for Alice Springs to reach 50 per cent renewable energy by 2030. Lyndon Frearson An joint initiative of the Intyalheme Centre for Future Energy and Desert Knowledge Australia (DKA), ASFG has support from ARENA and from the federal and Northern Territory governments. In 2018, Frearson and the Future Grid team started asking: How is Alice Springs powered? How is that changing and why? What might a future power system look like? And what risks and opportunities might arise from changing the town’s electricity supply? In November ASFG launched its final report: Alice Springs Roadmap to 2030 at Desert Knowledge Australia, a research hub on the outskirts of the town. “As far as large OECD economies,” says Frearson, “[Australia has] more solar per capita than anywhere else in the world. “If you look at the issue [of instability in Alice] purely from a technical perspective… we’ve reached a threshold where the amount of solar in the middle of the day cannot be absorbed any further without there being substantive storage.” One of a raft of ideas considered was to aggregate some of the town’s many smaller rooftop and other discrete power sources into one bigger source. In a first for the Northern Territory, a Virtual Power Plant (VPP) was set up. Other ideas examined were: “battery clusters” in places where many households have rooftop solar; the viability of wind to complement solar; a commercial microgrid, say, for a hospital or school; better ways to integrate solar energy from places like schools into the grid; and better forecasting of solar outputs and loads. Frearson envisages electricity generation as part of a broader system, one embracing communities, governments and regulatory requirements, as well as technical knowhow and complex machinery. He says many Australian regional energy markets are similar to Alice Springs, with centralised system operation, competitive generation and retail markets or frameworks, and separate and regulated network access with an open access regime (where service providers may offer consumers new products and services). “All of those markets deal with the issues that we’re dealing with in Alice,” says Frearson. The Alice Springs Roadmap to 2030 poses four possible scenarios for any future grid, all with high levels of solar energy from either distributed or centralised sources. Two of the scenarios involve intermittently turning off Alice Springs’ main power plant, a long-standing challenge for operators of gas-fired generators. Frearson is confident that the town will reach 50% renewables by 2030, but admits it’s a case of “tight, but achievable”. “What our work highlights is that the margin for further delay is decreasing,” he says.","filter_flag":1}
{"title":"Holcim US' 2023 Sustainability Achievements Accelerate Decarbonization - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvaG9sY2ltLXVzLTIwMjMtc3VzdGFpbmFiaWxpdHktYWNoaWV2ZW1lbnRzLWFjY2VsZXJhdGUtZGVjYXJib25pemF0aW9uLTMwMjAxNTI4My5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvaG9sY2ltLXVzLTIwMjMtc3VzdGFpbmFiaWxpdHktYWNoaWV2ZW1lbnRzLWFjY2VsZXJhdGUtZGVjYXJib25pemF0aW9uLTMwMjAxNTI4My5odG1s0gEA?oc=5","id":"CBMifWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvaG9sY2ltLXVzLTIwMjMtc3VzdGFpbmFiaWxpdHktYWNoaWV2ZW1lbnRzLWFjY2VsZXJhdGUtZGVjYXJib25pemF0aW9uLTMwMjAxNTI4My5odG1s0gEA","guidislink":false,"published":"Thu, 14 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=348, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvaG9sY2ltLXVzLTIwMjMtc3VzdGFpbmFiaWxpdHktYWNoaWV2ZW1lbnRzLWFjY2VsZXJhdGUtZGVjYXJib25pemF0aW9uLTMwMjAxNTI4My5odG1s0gEA?oc=5\" target=\"_blank\">Holcim US' 2023 Sustainability Achievements Accelerate Decarbonization<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Holcim US' 2023 Sustainability Achievements Accelerate Decarbonization - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvaG9sY2ltLXVzLTIwMjMtc3VzdGFpbmFiaWxpdHktYWNoaWV2ZW1lbnRzLWFjY2VsZXJhdGUtZGVjYXJib25pemF0aW9uLTMwMjAxNTI4My5odG1s0gEA?oc=5\" target=\"_blank\">Holcim US' 2023 Sustainability Achievements Accelerate Decarbonization<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"With renewable energy initiatives implemented or on the way, Holcim will power 45 percent of operations with renewable energy Volume of sustainable cement and concrete products hits record highs CHICAGO, Dec. 14, 2023 \/PRNewswire\/ -- News from the COP28 climate summit brought into focus the need to make faster progress cutting the world's carbon emissions, with heavy industry playing a role in implementing reductions. With the Global Cement & Concrete Association reporting momentum in the cement sector reaching net zero, building solutions leader Holcim is doing its part to work towards ambitious, verified global sustainability goals across its entire value chain. In the US, Holcim hit significant sustainability milestones in 2023 with initiatives across the country and even more planned for 2024. \"A realistic approach to a net-zero, fully sustainable future requires us to consider all facets of our operations and products,\" said Michael LeMonds, Holcim US' chief sustainability officer and vice president of ESG. \"We're committed to decarbonizing without compromise, transitioning to renewable energy, developing new carbon capture technology, and more as we drive the circular economy in leading by example.\" In one significant sign of its commitment, in 2023 Holcim became the first company in the cement sector to sign the U.S. Department of Energy's Better Climate Challenge, pledging to reduce net greenhouse gas emissions by at least 25 percent across a 10-year period. Other major sustainability milestones from this year include: Producing and selling record levels of sustainable products OneCem (PLC) volumes increased to 83 percent in 2023 compared to 57 percent in 2022, reducing approximately 1.5 million metric tons of CO 2 emissions emissions ECOPact low-carbon concrete represented nearly 27 percent of Holcim US' ready-mix volumes, tripling the volume in 2022 and reducing 123,000 metric tons of CO 2 emissions emissions Investing $100 million project at its Ste. Genevieve ( Missouri ) Cement Plant—the largest single-kiln line in the world—that will reduce net CO2 emissions by 400,000 tons per year Accelerating use of renewable energy Implemented and announced initiatives to power 45 percent of operations with renewable energy (a significant increase from 10 percent in 2022) Holcim's largest solar array in the Midwest broke ground at the Alpena ( Michigan ) cement plant ( ) cement plant Joined the New York Value of Distributed Energy Resources (VDER) program to generate green energy with solar arrays on Holcim's non-mineable aggregate sites and with offsite arrays within the agreement Combination solar power and battery energy storage system underway at the Portland ( Colorado ) cement plant Replacing fossil fuels with alternative fuel Co-processed 400,000 metric tons of industrial byproducts into alternative fuels to power operations and 1.5 million metric tons of industrial byproducts into alternative raw materials to produce low-carbon cement New tire-derived fuel (TDF) facility went online at the Alpena cement plant, supported with grants from the State of Michigan These efforts are only part of Holcim's work toward the transition to net zero. From offering low-carbon cements and concretes to incorporating renewable energy to innovative carbon capture research, the company continues to put sustainability first. \"Holcim is leading the way in transforming its operations and products to enable strong, sustainable and resilient infrastructure and building development across the US,\" said Zach Friedman, director of federal policy for nonprofit sustainability advocacy organization Ceres. \"The company's actions demonstrate a deep commitment to tackling the climate crisis with innovative solutions and with vital policy advocacy that aligns with the goals of the Paris Agreement.\" Market demand for sustainable building solutions is expected to grow, fueled by the Buy Clean initiative, which prioritizes the use of US-made, low-carbon construction materials, and climate actions in the Bipartisan Infrastructure Bill and the Inflation Reduction Act. Project owners, architects, engineers and others will continue to call for innovative, sustainable solutions and products that Holcim is uniquely poised to provide. Learn more here: https:\/\/www.holcim.us\/sustainability. About Holcim US Holcim is a global leader in innovative and sustainable building solutions. Driven by its purpose to build progress for people and the planet, its 60,000 employees are on a mission to decarbonize building, while improving living standards for all. The company empowers its customers across all regions to build better with less, with its broad range of low-carbon and circular solutions, from ECOPact to ECOPlanet . With its innovative systems, from Elevate's roofing to PRB's insulation, Holcim makes buildings more sustainable in use, driving energy efficiency and green retrofitting. With sustainability at the core of its strategy, Holcim is becoming a net-zero company with 1.5°C targets validated by SBTi. In the United States, Holcim US includes nearly 350 sites in 43 states and employs 7,000 people. Our customers rely on us to help them design and build better communities with innovative solutions that deliver structural integrity and eco-efficiency. To learn more, visit holcim.us Contact Lynn Safranek Holcim US [email protected] Lauren Blalock Pierpont Communications [email protected] SOURCE Holcim","filter_flag":1}
{"title":"Weekend Read: Famine to feast – China's solar market in 2023 - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzE2L3dlZWtlbmQtcmVhZC1mYW1pbmUtdG8tZmVhc3QtY2hpbmFzLXNvbGFyLW1hcmtldC1pbi0yMDIzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzE2L3dlZWtlbmQtcmVhZC1mYW1pbmUtdG8tZmVhc3QtY2hpbmFzLXNvbGFyLW1hcmtldC1pbi0yMDIzL9IBAA?oc=5","id":"CBMiYGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzE2L3dlZWtlbmQtcmVhZC1mYW1pbmUtdG8tZmVhc3QtY2hpbmFzLXNvbGFyLW1hcmtldC1pbi0yMDIzL9IBAA","guidislink":false,"published":"Sat, 16 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=16, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=350, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzE2L3dlZWtlbmQtcmVhZC1mYW1pbmUtdG8tZmVhc3QtY2hpbmFzLXNvbGFyLW1hcmtldC1pbi0yMDIzL9IBAA?oc=5\" target=\"_blank\">Weekend Read: Famine to feast – China's solar market in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Weekend Read: Famine to feast – China's solar market in 2023 - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzE2L3dlZWtlbmQtcmVhZC1mYW1pbmUtdG8tZmVhc3QtY2hpbmFzLXNvbGFyLW1hcmtldC1pbi0yMDIzL9IBAA?oc=5\" target=\"_blank\">Weekend Read: Famine to feast – China's solar market in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"China plans to use big PV projects, like the Dalat array in the Kubuqi Desert, to control sand and wind, limiting desertification in various regions. From pv magazine 12\/23-01\/24 National Energy Administration (NEA) data indicate China is likely to have added more than 180 GW of solar generation capacity in 2023 and could top 200 GW, as it hit almost 143 GW of solar at the end of October 2023. Those numbers would represent year-on-year growth of 106% to 129% on 2022 and would eclipse all the solar added from 2020 to 2022. When Wang Bohua, honorary secretary of trade body the China PV Industry Association (CPIA), addressed a PV conference in early 2023, he projected installations of 95 GW to 120 GW for 2023. Downstream solar investment exploded, however, driving a surge in utility-scale, residential, and commercial and industrial (C&I) installations. At the SNEC PV exhibition in Shanghai in May, executives from tier one and tier two module manufacturers told pv magazine their annual installation estimates had risen to 160 GW-plus. The CPIA revised its number to 120 GW to 140 GW in July. S&P Global and the China Electricity Council, a government agency, raised their estimates to 170 GW in October. In November, market research firm Trend Force projected 194 GW to 210 GW of new solar in China in 2023. Emboldened by China’s “30-60” goal of reaching peak emissions by 2030 and net zero by 2060, the nation’s energy-related state-owned enterprises (SOEs) have pledged 350 GW of solar generation capacity. In the first half of 2023, companies signed more than 80 GW of utility scale solar investment deals. Some 61.8 GW was connected by the end of September 2023. The pandemic disrupted the installation of smaller, “distributed” solar arrays until late 2022 but China rebounded to install 34.1 GW of distributed commercial and industrial (C&I) systems by the end of September 2023. Residential-solar policy, cheaper new products, and rising demand drove 33 GW of home solar capacity by the end of September 2023, a 30.5% rise on the total figure for 2022, as more than 1.5 million new customers chose to “go solar.” Panel prices These numbers have risen on the back of two years of falling panel prices that have supercharged solar plant development. A polysilicon price surge in 2022, from CNY 80 ($11.24)\/kg to CNY 300\/kg ramped panel prices to CNY 2\/W of generation capacity, with solar glass costs having also surged in 2021 and 2022. Vast expansion in solar production capacity since late 2022, however, has seen panel prices come to around CNY 1.9\/W in January 2023, less than CNY 1.7\/W in March 2023, and CNY 1.3\/W in offers submitted for project tenders by tier one module makers in July 2023. A price of CNY 1.18\/W was bid for one SOE-led procurement exercise in July 2023. A November 2023 procurement by State Power Investment Corp. and state utility China Huadian Corp. attracted a CNY 1.01\/W bid for JinkoSolar’s negatively-doped, “n-type” panels and some passivated emitter rear contact (PERC) products bid at CNY 1\/W, for a more-than-45% price fall during 2023. Analysts estimate a CNY 1\/W to CNY 1.1\/W cost threshold for tier one module manufacturers. Liu Yuxi, president of Longi Green Energy’s China regional department, recently told a conference that “if the PV panel price falls below CNY 1\/W, it signifies a complete dip below the cost threshold.” Overcapacity The current overcapacity in Chinese solar production is down to the government’s 30-60 carbon commitments, with big players expanding in anticipation of future market growth. An estimated CNY 2.5 trillion worth of solar production expansion plans have been announced since 2020, with CNY 700 billion of commitments in 2021 and CNY 900 billion in 2022. While the investment boom cooled considerably in 2023, eight leading PV companies recently announced CNY 300 billion of production investment. Polysilicon production secured more than CNY 700 billion of investment from 2020 to 2022 and solar ingot and wafer manufacturing snagged more than CNY 290 billion. Cell and panel production investment topped CNY 820 billion during that period while solar glass attracted CNY 110 billion; ethylene vinyl acetate and polyolefin film production CNY 18.5 billion; diamond wire cutting equipment CNY 14 billion; and backsheet production CNY 20 billion. Data from the CPIA and the silicon branch of the China Nonferrous Metals Industry Association indicate China will reach three million tons of annual polysilicon production capacity during 2023, plus 800 GW of solar wafer lines, 700 GW of cell capacity, and 800 GW of module fabs. Oversupply means factory utilization rates are likely to be lower than for 2022, however. A divergence in opinion between corporations and the government is evident regarding overcapacity. Longi’s Liu believes the current overcapacity has started to impede the innovation capability of Chinese PV enterprises. That is primarily due to the lower selling prices resulting from overcapacity, which in turn hamper profitability and the corporate funds available for research and development. On the other hand, Liu Yiyang, deputy secretary general of the CPIA, holds the belief that overcapacity is an inevitable occurrence in a market economy. He said that the issue lies in the structural aspect of overcapacity and argued that it is crucial to acknowledge that a market economy inherently experiences overcapacity, due to competition. An official from China’s Ministry of Industry and Information Technology said that the Chinese PV industry is operating within a normal scale. The official said that overcapacity is a regular phenomenon in market competition. The stock market has provided a stern response to both viewpoints. China’s PV stock prices have consistently declined during 2023, with many leading solar companies experiencing share price falls of 50% or more. That decline indicates that investors have deep concerns about the industry’s profitability. New technology Enormous investment has been allocated not only to expand production capacity but also to fuel research and development efforts and promote new technology. Throughout 2023, a plethora of new technology has been integrated into production processes. Polysilicon manufacturer GCL, for instance, has made substantial investment in the expansion of its granular silicon production capacity, hailing its product as second-generation polysilicon, with superior cost-effectiveness and consistency. Lan Tianshi, joint chief executive officer of GCL Technology, told the media that the cost of granular polysilicon produced at GCL’s Leshan factory is below CNY 36\/kg. That significant cost advantage positions GCL as an unrivaled contender in the polysilicon price war. Exorbitant polysilicon prices in 2022 prompted wafer companies to explore various methods of wafer thinning and material-cost reduction. Companies such as Longi, TCL Zhonghuan, and Gaoce have achieved remarkable success in thinning silicon wafers to less than 150 micrometers for tunnel oxide passivated contact (TOPCon) solar cells, with even thinner wafers, with a thickness of 90 micrometers to 100 micrometers for heterojunction (HJT) devices. Those advancements have significantly diminished polysilicon input costs. Cell savings The most notable strides in technological advancement have been witnessed in the field of solar cells. As the efficiency of PERC cells nears its theoretical limit, manufacturers have shifted their focus toward the next generation of cell technology. Differing perceptions about technology and the market have led to divergent choices among manufacturers. Leading panel makers such as JinkoSolar have gravitated toward TOPCon technology, which allows for seamless upgrades from their extensive PERC production lines. Jinko recently said that its TOPCon production capacity had reached an impressive 55 GW by the end of June 2023, with expectations that its n-type TOPCon production capacity will account for more than 75% of its total 110 GW module capacity by the close of 2023. This rapid upgrading of production lines is contingent upon the market’s swift acceptance of n-type TOPCon products. In the first half of the year, Jinko’s n-type products already constituted more than half of its total 30.8 GW of module shipments and it is projected that n-type products will make up over 60% of its annual shipments for 2023. Popular content HJT technology is also experiencing rapid market penetration. Huasun, a new player in the panel industry, anticipates reaching 15 GW of both HJT cell and module capacity by the end of 2023, with plans for an additional 20 GW of new capacity. Leading panel manufacturer Risen is also placing its bets on HJT, aiming for 15 GW of cell and module capacity by the end of 2023. When combined with other companies investing in HJT, a cumulative panel production capacity of almost 70 GW could be put into production by the close of 2023. This suggests that a substantial quantity of HJT modules will be delivered to the market in 2024. Longi and Aiko Solar are actively promoting different types of back-contact (xBC) cell technology, with Longi presenting its hybrid passivated back contact solution and Aiko focused on an all-back-contact approach. Given the industry prominence of both companies, xBC cell technology is poised to evolve significantly in 2024. The combination of TOPCon, HJT, and xBC cells is driving the replacement of PERC technology, accelerating its exit from the market. In a significant development, the majority of prominent Chinese panel manufacturers convened in June to establish a standardized dimension for medium-format PV panels, ending the practice of individualized sizes. Unified panel dimensions not only streamline transportation and warehousing processes but also contribute to cost reduction within the industry. New scenarios In China, utility-scale PV is primarily led by state-owned energy companies. Limited land availability in eastern and southern China ensures large-scale power plants are predominantly located in highland desert areas in northern and northwestern regions. Sites face power consumption challenges, however. To address this, the Chinese government plans to construct ultra-high-voltage transmission lines to transport the power generated to economically developed regions in the middle and east of the country. As part of its 14th national five-year plan, China aims to establish large renewable energy bases in nine regions across its western, northern, and northwestern regions by 2030. The target is to install a minimum of 450 GW of renewable energy generation capacity, primarily consisting of solar and wind sites. In 2021, state-owned energy companies initiated the first batch of projects, with a total generation capacity of 97 GW. The second batch, expected to exceed 400 GW, will commence construction after 2023. It is anticipated that around 100 GW of projects will be completed within the 14th five-year plan period, which closes in 2025. These large-scale energy bases, guided by the National Development and Reform Commission and the NEA, have multiple roles. Apart from accommodating high-capacity renewable energy installations for clean power generation, they also serve as testing grounds for new module products. The approach resembles the government’s previous Top Runner Program but the new utility-scale energy bases could also test generation measurement and energy storage approaches for grid power peak shaving, green hydrogen production, desertification control, agrivoltaics, “PV pastures,” and even “advanced coal power facilities” to enhance power quality. In addition to the development of the energy bases, state-owned energy companies have discovered new applications for solar technology, namely highway and offshore PV. Novel applications The implementation of highway PV involves installing distributed PV power farms on the roofs of buildings within highway service areas, parking lots, and along the roadbeds adjacent to service areas. These power generation systems can supply clean electricity to serve passengers and vehicles. Some state bodies have even explored installing PV systems in the middle of the highway isolation zone and on both sides of soundproofing walls. Technical and cost challenges remain, however. Several local governments have initiated studies and the formulation of technical specifications and supportive policy. The future of highway solar holds great potential and is expected to gain traction. Offshore floating PV is also on the rise. According to data from the China Ministry of Natural Resources, the nation boasts a vast expanse of approximately 710,000 km2 that is designated for offshore PV installation and could accommodate more than 70 GW of floating PV capacity. Coastal provinces such as Shandong, Jiangsu, and Zhejiang have unveiled ambitious offshore PV development blueprints with construction of almost 60 GW of generation capacity planned. Despite the current cost of floating solar being 5% to 12% higher than onshore PV, the plummeting price of modules has propelled offshore PV nearer a positive return-on-investment. In November 2023, the Haiyang HG34 power plant, boasting an impressive installed generation capacity of 2.7 GW, commenced operation off the coast of Shandong province. The growth of offshore PV still faces hurdles such as a dearth of supportive policy and heightened climate-change related risk, however. Prospects for 2024 Looking ahead to 2024, there are several key areas of focus for the Chinese PV industry. Firstly, the sector is concerned about PV module prices. Facing the dual pressures of production capacity increases and falling demand, there is speculation module prices may fall further. There have been unconfirmed reports since November 2023 suggesting that tier one wafer, cell, and module producers are facing more frequent factory shutdowns and opting for limited production to maintain prices and margins. It remains to be seen whether limited production can stabilize or drive module prices up. Secondly, China’s PV supply chain is grappling with overcapacity across all its nodes. New production capacity is expected in 2023 and 2024. Overcapacity could cause substantial losses, bankruptcies, and the restructuring of numerous enterprises. It remains to be seen whether any of the large solar manufacturers will suffer the same difficulties as big-name predecessors Suntech, Yingli, and LDK. China’s economy is experiencing a downturn, with manufacturing output stagnating or declining and electricity demand expected to remain flat, or to fall. Given the challenges related to consumption and low returns, power plant investors could see their appetites significantly reduced. A decline in installed capacity may drive an industry-wide recession. The primary concern for 2024 is the volume of new solar generation capacity that can be expected. Increasing reliance on renewable energy has raised concerns about grid stability. Since October 2023, several Chinese provincial governments have temporarily suspended approval for ground-mounted or distributed PV projects. Those decisions stem from fears that grids will not be able to accommodate additional intermittent energy sources. Will the situation improve in 2024? If not, it will undoubtedly have a significant impact on new solar capacity. In fact, annual new PV capacity may actually decline in 2024. What is certain is that TOPCon is on track to become a mainstream product. The market space for HJT and xBC cells remains uncertain, however, and the possibility of a commercial breakthrough with perovskites still hangs in the background. Regardless of the global landscape, China’s 30-60 carbon targets safeguard the long-term trajectory of the PV industry. While short-term setbacks may occur, the industry will inevitably experience a resurgence.","filter_flag":1}
{"title":"How circular strategies can be used to decarbonize Scope 3 GHG emissions - EY","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy5leS5jb20vZW5fdXMvaW5zaWdodHMvY2xpbWF0ZS1jaGFuZ2Utc3VzdGFpbmFiaWxpdHktc2VydmljZXMvaG93LWNpcmN1bGFyLXN0cmF0ZWdpZXMtY2FuLWJlLXVzZWQtdG8tZGVjYXJib25pemUtc2NvcGUtMy1naGctZW1pc3Npb25z0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy5leS5jb20vZW5fdXMvaW5zaWdodHMvY2xpbWF0ZS1jaGFuZ2Utc3VzdGFpbmFiaWxpdHktc2VydmljZXMvaG93LWNpcmN1bGFyLXN0cmF0ZWdpZXMtY2FuLWJlLXVzZWQtdG8tZGVjYXJib25pemUtc2NvcGUtMy1naGctZW1pc3Npb25z0gEA?oc=5","id":"CBMikQFodHRwczovL3d3dy5leS5jb20vZW5fdXMvaW5zaWdodHMvY2xpbWF0ZS1jaGFuZ2Utc3VzdGFpbmFiaWxpdHktc2VydmljZXMvaG93LWNpcmN1bGFyLXN0cmF0ZWdpZXMtY2FuLWJlLXVzZWQtdG8tZGVjYXJib25pemUtc2NvcGUtMy1naGctZW1pc3Npb25z0gEA","guidislink":false,"published":"Fri, 01 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=1, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=335, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy5leS5jb20vZW5fdXMvaW5zaWdodHMvY2xpbWF0ZS1jaGFuZ2Utc3VzdGFpbmFiaWxpdHktc2VydmljZXMvaG93LWNpcmN1bGFyLXN0cmF0ZWdpZXMtY2FuLWJlLXVzZWQtdG8tZGVjYXJib25pemUtc2NvcGUtMy1naGctZW1pc3Npb25z0gEA?oc=5\" target=\"_blank\">How circular strategies can be used to decarbonize Scope 3 GHG emissions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EY<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How circular strategies can be used to decarbonize Scope 3 GHG emissions - EY","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy5leS5jb20vZW5fdXMvaW5zaWdodHMvY2xpbWF0ZS1jaGFuZ2Utc3VzdGFpbmFiaWxpdHktc2VydmljZXMvaG93LWNpcmN1bGFyLXN0cmF0ZWdpZXMtY2FuLWJlLXVzZWQtdG8tZGVjYXJib25pemUtc2NvcGUtMy1naGctZW1pc3Npb25z0gEA?oc=5\" target=\"_blank\">How circular strategies can be used to decarbonize Scope 3 GHG emissions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EY<\/font>","source.href":"https:\/\/www.ey.com","source.title":"EY","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Despite these challenges, pressure for companies to accurately calculate, disclose and reduce Scope 3 emissions has only accelerated in recent years. Key drivers for this increased pressure include recent regulations (e.g., Corporate Sustainability Reporting Directive (CSRD), International Sustainability Standards Board (ISSB), California bills SB-253, SB-261 and AB-1305 and the proposed US Securities and Exchange Commission (SEC) March 2022 climate-related rule). The pressure to submit and validate science-based reduction targets and increasing requests for credible climate transition plans are also driving companies to direct more focus toward Scope 3 emissions. The Greenhouse Gas Protocol² defines 15 categories of Scope 3 emissions, though not every category is relevant to all organizations. This article focuses on category 1 (purchased goods and services), category 11 (use of sold products) and category 12 (end-of-life treatment of sold products), due to the opportunities available to reduce GHG emissions within these categories via circular economy initiatives. CE is a transformative process to reimagine and redesign social and business interactions. The circular model creates long-term value by simultaneously enabling economic growth and positive ecological impacts. In addition to significant benefits, circular strategies hold tremendous decarbonization potential, with some models estimating circularity leading to a 56% reduction compared to a baseline scenario.³ Furthermore, the circular economy has the potential to unlock $4.5 trillion worth of economic opportunities between 2015 and 2030.⁴ Despite these promising opportunities, the circular economy’s decarbonization potential is far from realized, especially in relation to Scope 3 value chain emissions. This article examines the benefits and opportunities for leveraging circular strategies to decarbonize select categories of Scope 3 emissions and unlock business opportunities in a low-carbon economy. Category 1: Purchased goods and services The GHG Protocol2 defines category 1 emissions as “all upstream (i.e., cradle-to-gate) emissions from the production of products purchased or acquired by the reporting company in the reporting year. Products include both goods (tangible products) and services (intangible products).” A key challenge and opportunity for category 1 emissions management is access to and quality of supplier-specific data. For companies using the spend-based or average-data calculation methodologies, which estimate emissions based on spend or mass purchases with each supplier and secondary emission factors, the primary decarbonization lever available is to reduce spend with high-emitting suppliers. Companies that have access to supplier-specific calculation methods are able to engage suppliers directly and reflect emissions reductions across the value chain in their calculations. Across the category 1 calculation methodologies, circular strategies can offer meaningful decarbonization opportunities.","filter_flag":1}
{"title":"16 tech projects from 2023 that could change the world - Livescience.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmxpdmVzY2llbmNlLmNvbS90ZWNobm9sb2d5LzE2LXRlY2gtcHJvamVjdHMtZnJvbS0yMDIzLXRoYXQtY291bGQtY2hhbmdlLXRoZS13b3JsZNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmxpdmVzY2llbmNlLmNvbS90ZWNobm9sb2d5LzE2LXRlY2gtcHJvamVjdHMtZnJvbS0yMDIzLXRoYXQtY291bGQtY2hhbmdlLXRoZS13b3JsZNIBAA?oc=5","id":"CBMiXWh0dHBzOi8vd3d3LmxpdmVzY2llbmNlLmNvbS90ZWNobm9sb2d5LzE2LXRlY2gtcHJvamVjdHMtZnJvbS0yMDIzLXRoYXQtY291bGQtY2hhbmdlLXRoZS13b3JsZNIBAA","guidislink":false,"published":"Fri, 29 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=29, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=363, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmxpdmVzY2llbmNlLmNvbS90ZWNobm9sb2d5LzE2LXRlY2gtcHJvamVjdHMtZnJvbS0yMDIzLXRoYXQtY291bGQtY2hhbmdlLXRoZS13b3JsZNIBAA?oc=5\" target=\"_blank\">16 tech projects from 2023 that could change the world<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Livescience.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"16 tech projects from 2023 that could change the world - Livescience.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmxpdmVzY2llbmNlLmNvbS90ZWNobm9sb2d5LzE2LXRlY2gtcHJvamVjdHMtZnJvbS0yMDIzLXRoYXQtY291bGQtY2hhbmdlLXRoZS13b3JsZNIBAA?oc=5\" target=\"_blank\">16 tech projects from 2023 that could change the world<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Livescience.com<\/font>","source.href":"https:\/\/www.livescience.com","source.title":"Livescience.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Challenges like climate change and dwindling natural resources and can make the future seem uncertain and even scary. But our fate isn't sealed so long as scientists around the world have a say. They're busy dreaming up technologies, from the practical to the zany, that could make the future a little brighter. Prototypes for Humanity , a Dubai-based organization that runs a contest to spur innovation, has highlighted 100 projects in 2023 that they believe could change the world — from electrical skin to devices that predict air pollution without any air sensors. Here are some of our favorites. Real-time monitoring to predict natural disasters (Image credit: Najah Pokkiri\/NatCat) NatCat aims to use satellite imagery, remote sensing and machine learning to assess the risk of natural hazards in different locations, which could help to reduce the risk of harm for those living there. The tool generates risk assessments for any location in the world, regardless of the availability of local data. It can also use climate change data to project the frequency and intensity of some natural hazards in the future. Converting air humidity to electricity Electric Skin — Converting air humidity to electricity with innovative biomaterials (Image credit: Nada Raafat Elkharashi, Paige Perillat Piratoine, Sequoia Fischer & Catherine Euale) This project, called Electric Skin, creates a self-powering biomaterial for electronic devices that harnesses the electrically conductive properties of the mud-dwelling bacteria known as Geobacter sulfurrenducens. Specifically, the bacteria's protein nanowires can generate electricity from the air's ambient humidity. The scientists have extracted the bacteria's DNA and embedded this into E. coli for production. To create the power source, the team placed the nanowires harvested from E. coli into compostable biomaterials to create a flexible and textured membrane that can power electronic devices from the air and water. Recycled tiles that regulate heat and humidity Wastly Roof Tiles (Image credit: Angela Piazza) Spurred by the excessive production of non-recyclable plastics alongside the effects of climate change in south India, Wastly Roof Tiles aims to replace conventional roof tiles with tiles made of a recycled material that can reduce indoor temperatures. These tiles, which are created by shredding and melting multi-layered plastics, are lightweight and waterproof and can reflect heat. This project is inspired by the cryosphere — icy parts of Earth that regulate the planet's temperature — and the finished product incorporates a blend of the blue and white that many might associate with these regions. Phytoplankton-based carbon capture PhytoMat — Nature-based solution for carbon capture using phytoplankton (Image credit: Gabriele Troisi & Alberto Perro) Phytoplankton transfers 40% of the carbon dioxide in the atmosphere to the ocean using photosynthesis . With PhytoMat, scientists now want to harness this natural process on an industrial scale. PhytoMat is a flexible, carpet-like technology that is installed horizontally and vertically on surfaces and contains recycled materials embedded with live phytoplankton. As they grow, they absorb carbon dioxide from their surroundings and convert that into biomass — organic material that can be repurposed — before it's harvested and delivered to recycling plants. This material can then be transformed into new products, like bioplastics. Electricity-free medical injection in disaster recovery Golden Capsule — Medicine-injection device optimised for emergency disaster scenarios (Image credit: Yujin Chae) Using only air pressure and the elasticity of balloons, Golden Capsule is a device that can administer intravenous drugs without the need for another human to hold a medicinal pack. This project stands apart from other devices because no electricity is needed — making it ideal for use in disaster recovery scenarios. Golden Capsule uses elastic force and air pressure differences to deliver medicine, rather than gravity, which is used in other non-powered or low-powered systems. The biodegradable polystyrene replacement Carbon Cell — Replacing harmful polystyrene with a new biodegradable foam (Image credit: Eden Harrison) Carbon Cell is a biodegradable expanding foam made from biochar — a secret combination of biological ingredients derived from food waste — that's mixed and expanded using a patented manufacturing process. The process is similar to injection molding and enables many different shapes and sizes to be formed quickly when, say, packaging items. The scientists behind this technology ultimately want to replace polystyrene, which they said is toxic and harmful to the environment. A graphics card that can slash AI's carbon emissions Tasawwur D310 — A new GPU to drastically reduce carbon emissions for AI training (Image credit: Saravanan Yuvaraja) Generative AI models need to be trained in massive data centers, normally using the power of specialized graphics cards (GPUs). This means generative AI has a huge carbon footprint. But Tasawwur D310 is a GPU that its creators say is vastly more energy efficient than today's leading GPUs. The chip is super dense — with electronic components fitted much closer together and stacked on 10 layers (versus two layers in one of the leading competitors, Nvidia's, chips) — meaning data is exchanged much faster, saving energy and speeding up the training process. Programmable soft robotics FlowIO Platform — Advanced platform for soft robotics, streamlining prototyping with integrated tools. (Image credit: Ali Shtarbanov & Hye Jun Youn) FlowIO Platform claims to be the world's first general-purpose way to make prototypes of soft robotic parts. This tiny device includes integrated pumps and batteries, and it features five programmable ports, which users can manipulate through a web browser via a Bluetooth connection. Each port can inflate, vacuum, release, hold, sense pressure and alter flow rates. This device also features onboard batteries and 10 different sensors. Its creators say it'll enable robotics experts to bring their ideas from conception to reality much faster than before. Mixed-reality building inspection with drones FlyVision — Drone-based inspection systems for monitoring building safety (Image credit: Peisen Xu) FlyVision combines mixed reality with drone flight to help drone users inspect buildings and other spaces more effectively. Using Microsoft's HoloLens 2 augmented reality (AR) headset, the system gives drone pilots the tools to scan immediate surroundings and create a 3D digital twin within the system. They could then plan a path inside the space and use the planned path to guide a drone through its environment. AI-augmented renewable energy Streamlining renewable energy evaluation using AI, saving time and money. (Image credit: Sarah Sausan & Arkanu Andaru) This software platform, called \"Renescout\", uses data mining, remote sensing and AI to better assess whether renewable energy projects are worth pursuing — a process that normally takes 18 months. \"Go\" or \"no\" decisions can effectively be made without investing additional time and resources into exploring the viability of unearthing prospective renewable energy sources, the company claims. Detecting microplastics with high-tech imagery Imaging technology for accurate microplastic detection (Image credit: Yanmin Zhu, Timothy Ju Kin, Yuxing Li & Jianqing Huang) SPLASH is a system that uses an advanced form of imaging to detect microplastics in water and the air. The imaging, called intelligent polarization holographic probing, works using light-based scanning and 3D modeling to establish the presence of microplastics that can't be seen by the naked eye. Sustainable solid-state batteries Ferroelectric Electrolyte Batteries — Solid-state batteries maximizing safety and sustainability in energy storage (Image credit: Mafalda Valente, Maria Helena Sousa & Maria Helena Sousa Soares de Oliveira Braga) These batteries are made from copper, aluminum and a sodium-based solid-state electrolyte. These novel materials work as both current collectors and electrodes. The battery's coaxial architecture and beam-like structure enable it to retain energy while reducing wasted space and material. The makers of the batteries, dubbed Ferroelectric Electrolyte Batteries, say they are non-flammable and sustainable alternatives to today's lithium-ion batteries. The researchers imagine they could serve in a variety of uses in the automotive and aerospace industries. AI feedback to improve surgery outcomes Surgical AI Trainer — AI feedback system to improve outcomes in surgery (Image credit: Dani Kiyasseh & Andrew Hung) This AI system, called Surgical AI Trainer, assesses the performance of surgeons and offers feedback on how they can improve their technique. When looking at video recordings of procedures, the system analyzes various components of the operation, such as the intricate movements the surgeon performs. It offers precise and quantified feedback — citing particular segments of the video alongside a rationale for picking it out — on how a surgeon performs in the operating theater. This reduces the need for subjective feedback from an expert peer, which can be laborious. 3D scanning with advanced laser-based radar Manifold Tech — Advanced laser radar technology for 3D scanning (Image credit: Rocky SHU Junyuan) The MindPalace-360 is a machine that uses advanced algorithms and 3D reconstruction tools to generate a photorealistic digital render of a real-world environment. Built primarily for those in architecture, construction or engineering, this system essentially creates digital twins that are incredibly close to the real thing. It lets users capture, process and visualize spatial data much more accurately, which feeds into better design and planning. Extending lithium-ion battery life BetterE — A system to extend lithium battery life and reduce e-waste (Image credit: Inse van Houts) Lithium-ion batteries in products like laptops or even electric cars tend to have charge limits to extend the batteries' longevity. But many e-mobility systems, like e-scooters, lack these controls, which could lead to more e-waste generation as batteries degrade quickly and need to be thrown out much sooner than they should have been. BetterE implements charge limits on the AC side of a charger for electric vehicle lithium-ion batteries. For drivers, this would reduce the operating costs of their electric vehicles while also reducing e-waste on a broader level. Real-time air pollution monitoring Data2Action — IoT solution to monitor and predict air pollution-related diseases (Image credit: Shahan Salim, Arlene Oetomo & Irfhana Zakir Hussain) Data2Action uses AI algorithms to monitor air pollution in real time — even if the area has no air sensors. The system takes monitoring data from areas that have sensors installed, and then uses this to extrapolate information and determine predicted air pollution readings in places that don't have sensors installed. The machine learning models also predict potential health outcomes based on air pollution exposure levels, its makers say.","filter_flag":1}
{"title":"Uniting Europe's resources to put greener aircraft into service by 2035 - POLITICO Europe","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LnBvbGl0aWNvLmV1L3Nwb25zb3JlZC1jb250ZW50L3VuaXRpbmctZXVyb3Blcy1yZXNvdXJjZXMtdG8tcHV0LWdyZWVuZXItYWlyY3JhZnQtaW50by1zZXJ2aWNlLWJ5LTIwMzUv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LnBvbGl0aWNvLmV1L3Nwb25zb3JlZC1jb250ZW50L3VuaXRpbmctZXVyb3Blcy1yZXNvdXJjZXMtdG8tcHV0LWdyZWVuZXItYWlyY3JhZnQtaW50by1zZXJ2aWNlLWJ5LTIwMzUv0gEA?oc=5","id":"CBMicWh0dHBzOi8vd3d3LnBvbGl0aWNvLmV1L3Nwb25zb3JlZC1jb250ZW50L3VuaXRpbmctZXVyb3Blcy1yZXNvdXJjZXMtdG8tcHV0LWdyZWVuZXItYWlyY3JhZnQtaW50by1zZXJ2aWNlLWJ5LTIwMzUv0gEA","guidislink":false,"published":"Tue, 19 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=19, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=353, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LnBvbGl0aWNvLmV1L3Nwb25zb3JlZC1jb250ZW50L3VuaXRpbmctZXVyb3Blcy1yZXNvdXJjZXMtdG8tcHV0LWdyZWVuZXItYWlyY3JhZnQtaW50by1zZXJ2aWNlLWJ5LTIwMzUv0gEA?oc=5\" target=\"_blank\">Uniting Europe's resources to put greener aircraft into service by 2035<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">POLITICO Europe<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Uniting Europe's resources to put greener aircraft into service by 2035 - POLITICO Europe","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LnBvbGl0aWNvLmV1L3Nwb25zb3JlZC1jb250ZW50L3VuaXRpbmctZXVyb3Blcy1yZXNvdXJjZXMtdG8tcHV0LWdyZWVuZXItYWlyY3JhZnQtaW50by1zZXJ2aWNlLWJ5LTIwMzUv0gEA?oc=5\" target=\"_blank\">Uniting Europe's resources to put greener aircraft into service by 2035<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">POLITICO Europe<\/font>","source.href":"https:\/\/www.politico.eu","source.title":"POLITICO Europe","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Europe is striving to bring cleaner aircraft into service by 2035 to maintain its global industrial leadership and to be on track for climate-neutrality in aviation by 2050. The strategic importance of Europe’s aviation sector is clear — it generates more than 3.5 million jobs across Europe and in 2022 it contributed €258 billion to European GDP. The sector is committed to addressing aviation’s environmental footprint, which currently accounts for approximately 2.5 percent of global CO2 emissions and is expected to rise, given that global air transport is projected to grow by around 3-4 percent annually until 2050. Clean Aviation, co-funded by the European Union through Horizon Europe and the major European private aviation stakeholders, will deliver key disruptive technological innovations by 2030. These innovations will support the entry-into-service of pioneering greener aircraft by 2035. Yet, the journey toward sustainable aviation is not a solo mission that a single country or an organization can accomplish. Significant investments are required to develop critical research and innovation (R&I) and bridge the ‘valley of death’ between R&I results and the launch of new products. To succeed in this mission, all resources (private and public), competencies, and capabilities made available at European, member state and regional levels need to be strategically aligned within a European roadmap to secure the entry-into-service of new cleaner aircraft by 2035. Strategic investments The commitment to reduce aviation’s environmental impact comes at a substantial cost. The aviation sector estimates an investment of at least €12 billion in research and innovation funding in the Horizon Europe timeframe to be on track toward climate-neutrality objectives. To put this in perspective, the Clean Aviation program has allocated a total budget of €4.1 billion, comprised of €1.7 billion in EU funding and at least €2.4 billion in private contributions. To date, this budget supports 28 large projects engaged in developing disruptive technologies for hybrid-electric aircraft, ultra-efficient aircraft architectures and hydrogen-powered aircraft. These technologies are impact-driven and focus on the regional, short and short-medium range segments (routes up to 4,000km) which account for about 55 percent of CO2 emissions of the aviation fleet globally. Herein lie the greatest opportunities to make air travel more environmentally friendly. In a nutshell, Clean Aviation’s technologies aim to cut greenhouse gas emissions for commercial air travel by at least 30 percent, surpassing the capabilities of today’s best aircraft models. Together with the use of synthetic fuels or hydrogen as an energy carrier, greenhouse gases will be reduced by approximately 90 percent. Beyond R&I, it is evident that investments in the sector will need to be even more substantial to reach net-zero aviation by 2050, as more support is required for eco-sustainable industrialization, market update of clean products, infrastructures and renewable energy production. Acting now for impact in 2035 To help bridge the gap from research outcome to market, Clean Aviation is fostering collaborations and aligning financing sources from regions, member states and associated countries to Horizon Europe — such as the U.K., which is a crucial partner — as well as looking at mobilizing additional resources from the EU’s Multiannual Financial Framework. The ultimate goal? Uniting Europe’s research and industrial resources on a joint European roadmap for Net-Zero Aviation, thereby achieving an entry into service of new, highly-efficient aircraft by 2035 with Clean Aviation’s technologies onboard. More support is required for eco-sustainable industrialization, market update of clean products, infrastructures and renewable energy production We are acting now to make impact in 2035 through cooperation between industry, research organizations, universities and SMEs along with their best researchers and engineering teams to ensure European leadership on sustainable aviation. Clean Aviation is also actively fostering synergies with fellow European partnerships, such as the Clean Hydrogen Partnership, and engaging with relevant EU funding instruments including the EU Innovation Fund to seek support to accelerate market uptake of our disruptive technologies. Additionally, we participate as a founding member in the Alliance for Zero Emission Aviation (AZEA) and closely cooperate with the European Union Aviation Safety Agency (EASA) to ensure a viable path toward market adoption of Clean Aviation innovations, while at the same time reducing the current aircraft ‘lead time’ through more efficient certification processes. The ultimate goal? Uniting Europe’s research and industrial resources on a joint European roadmap for Net-Zero Aviation All of these efforts are bolstered by the sustainability commitment of the European aviation sector, encompassing initiatives such as (but not limited to) Airbus’s ZEROe, the CFM International RISE Open Rotor concept (by Safran and GE Aerospace), Rolls-Royce’s UltraFan engine and MTU Aero Engines’ water-enhanced turbofan architecture. Advancing through national and regional partnerships Strategic collaborations are being formed with national and regional innovation programs, building upon the success of Clean Aviation’s predecessor program, Clean Sky 2. This includes regional strategies (for example, Smart Specialization Strategies) aligned to Clean Aviation and joint roadmaps on net-zero aviation supported by a larger volume of technical and financial resources, mainly from the Cohesion Policy Funds\/European Regional Development Fund (ERDF). Over the past six months, Clean Aviation has joined forces with the Occitanie region in France, as well as the Campania and Piedmont regions in Italy, renowned for their considerable initiatives in sustainable aviation. Unified in purpose, this collaborative approach promises not only to enhance innovation capabilities and employment opportunities but also to foster skills development, crucial for the transition to sustainable aviation, and ultimately boosting the regions’ competitiveness. Looking ahead, more collaborations are on the horizon to bring together the key aeronautics countries and regions of Europe. Mark your calendars for March 4 2024 Join the High-Level Workshop on Synergies between European and national\/regional R&I programs in the aviation sector. This workshop, organized in partnership with the European Commission and in cooperation with the European Committee of the Regions, will shed light on forthcoming developments and opportunities. It strategically aligns with our Clean Aviation Annual Forum 2024 taking place on March 5-6 2024 in Brussels. More collaborations are on the horizon to bring together the key aeronautics countries and regions of Europe Unifying efforts Ultimately, the joint effort of numerous stakeholders will lead to the creation of a synergistic and comprehensive European framework. This will seamlessly integrate public and private resources at EU, national and regional levels, spanning the entire spectrum from innovation to market uptake, to create a unified European innovation architecture which supports the entry-into-service of cleaner commercial aircraft by 2035. Let’s grasp the opportunities that lie ahead in the coming years to not only achieve this target, but to ensure that aviation remains a crucial part of the solution for achieving climate neutrality, while also enabling Europe to maintain and foster its global competitiveness and industrial leadership.","filter_flag":1}
{"title":"Advanced Semiconductors and Contribution to a More Sustainable Future - Renesas","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnJlbmVzYXMuY29tL3VzL2VuL2Jsb2dzL2FkdmFuY2VkLXNlbWljb25kdWN0b3JzLWFuZC1jb250cmlidXRpb24tbW9yZS1zdXN0YWluYWJsZS1mdXR1cmXSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnJlbmVzYXMuY29tL3VzL2VuL2Jsb2dzL2FkdmFuY2VkLXNlbWljb25kdWN0b3JzLWFuZC1jb250cmlidXRpb24tbW9yZS1zdXN0YWluYWJsZS1mdXR1cmXSAQA?oc=5","id":"CBMiZGh0dHBzOi8vd3d3LnJlbmVzYXMuY29tL3VzL2VuL2Jsb2dzL2FkdmFuY2VkLXNlbWljb25kdWN0b3JzLWFuZC1jb250cmlidXRpb24tbW9yZS1zdXN0YWluYWJsZS1mdXR1cmXSAQA","guidislink":false,"published":"Sat, 16 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=16, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=350, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnJlbmVzYXMuY29tL3VzL2VuL2Jsb2dzL2FkdmFuY2VkLXNlbWljb25kdWN0b3JzLWFuZC1jb250cmlidXRpb24tbW9yZS1zdXN0YWluYWJsZS1mdXR1cmXSAQA?oc=5\" target=\"_blank\">Advanced Semiconductors and Contribution to a More Sustainable Future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Renesas<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Advanced Semiconductors and Contribution to a More Sustainable Future - Renesas","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnJlbmVzYXMuY29tL3VzL2VuL2Jsb2dzL2FkdmFuY2VkLXNlbWljb25kdWN0b3JzLWFuZC1jb250cmlidXRpb24tbW9yZS1zdXN0YWluYWJsZS1mdXR1cmXSAQA?oc=5\" target=\"_blank\">Advanced Semiconductors and Contribution to a More Sustainable Future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Renesas<\/font>","source.href":"https:\/\/www.renesas.com","source.title":"Renesas","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Semiconductor technology is at the heart of the digital revolution that has transformed the modern world. From smartphones and industrial devices to self-driving cars and advanced medical devices, semiconductors are a critical component in a wide range of electronic devices. As technology continues to advance, the demand for faster, more powerful, and more energy-efficient semiconductors is only going to increase. However, developing and bringing advanced semiconductors to the market is a complex and time-consuming process. It requires significant investment in research and development, as well as the expertise to design and manufacture these highly sophisticated products. In this article, we will explore recent advancements in semiconductor process technologies in reducing the time to manufacture this wonderful device. Emerging fabrication technologies enabling high-tech development and lower manufacturing time Image Comparison between planar FET and GAA FET shows how complex a structure of transistors nowadays thus increasing the time to manufacture advanced semiconductors. Emerging fabrication technologies are playing an increasingly important role in enabling high-tech development and reducing manufacturing time. These technologies are focused on improving the efficiency and cost-effectiveness of the manufacturing process, while also enabling the development of new products with advanced capabilities. Advanced analytics and AI analytics are playing an important role in the manufacturing industry. These technologies enable manufacturers to collect and analyze vast amounts of data in real time, providing valuable insights into the manufacturing process and improving efficiency. Predictive analytics: Predictive analytics uses data, statistical algorithms, and machine learning techniques to identify the likelihood of future outcomes based on historical data. In the manufacturing industry, predictive analytics can be used to predict equipment failure, detect quality issues, and optimize production processes. By identifying potential issues before they occur, manufacturers can reduce downtime, improve product quality, and increase efficiency. Prescriptive analytics: Prescriptive analytics takes predictive analytics a step further, providing recommendations on what actions to take based on the predictions generated by the model. For example, if a predictive analytics model identifies a potential equipment failure, prescriptive analytics can recommend the best course of action to prevent the failure from occurring, such as performing maintenance or replacing the equipment. AI-powered robotics: AI-powered robotics are becoming increasingly prevalent in the manufacturing industry, enabling manufacturers to automate repetitive tasks and increase efficiency. These robots use AI algorithms to learn from human operators and adjust their behavior accordingly. This technology can reduce manufacturing time and improve product quality, as robots can perform tasks with a high degree of precision and consistency. Emerging fabrication technologies, including advanced analytics and AI analytics, are transforming the manufacturing industry. Predictive and prescriptive analytics and AI-powered robotics are just a few examples of technologies that are improving efficiency and reducing manufacturing time. By adopting these technologies, manufacturers can increase competitiveness and bring new and innovative products to market faster and more efficiently. Sustainable semiconductors are better for the environment Semiconductors have become an essential component of our modern world, powering everything from industrial automation and smartphones to electric vehicles. However, the production of semiconductors has traditionally been associated with significant environmental impacts, including the use of toxic chemicals, high energy consumption, and large amounts of waste. As a result, there has been a growing interest in developing sustainable semiconductor technologies that are better for the environment. At Renesas, we are driven by our mission to develop products and solutions that directly contribute to building a more sustainable future. Here are some ways in which sustainable semiconductor technologies are making a positive impact: Energy-efficient production: The production of semiconductors requires a significant amount of energy. Sustainable semiconductor technologies are focused on reducing the amount of energy required to manufacture semiconductors, while also increasing their efficiency. For example, the use of renewable energy sources such as solar and wind power can significantly reduce the environmental impact of semiconductor production. Reduced use of toxic chemicals: Traditional semiconductor manufacturing processes involve the use of toxic chemicals, which can be harmful to both human health and the environment. Sustainable semiconductor technologies aim to reduce the use of these chemicals, replacing them with less toxic alternatives. For example, the use of water-based cleaning processes instead of solvents can significantly reduce the environmental impact of semiconductor production. Recycling and waste reduction: Sustainable semiconductor technologies are also focused on reducing waste and increasing the recycling of materials. This can be achieved through the use of more efficient manufacturing processes, as well as the development of new materials that are more easily recyclable. By reducing waste and increasing recycling, the environmental impact of semiconductor production can be significantly reduced. Green packaging: Sustainable semiconductor technologies are also focused on developing packaging materials that are environmentally friendly. This includes the use of biodegradable and compostable materials, as well as the development of packaging materials that are made from renewable resources. Product lifecycle management: Sustainable semiconductor technologies are focused on managing the entire product lifecycle, from design to end-of-life. This includes designing products that are more easily repairable, upgrading components rather than replacing them, and designing for disassembly and recycling. Sustainable semiconductor technologies are making a significant positive impact on the environment. By reducing energy consumption, reducing the use of toxic chemicals, increasing recycling and waste reduction, developing green packaging, and focusing on product lifecycle management, sustainable semiconductor technologies are creating a more environmentally friendly industry. As the demand for semiconductors continues to grow, it is essential that the industry continues to focus on developing sustainable technologies that can meet this demand while minimizing their environmental impact. Renesas: Driving advanced device development and environment-friendly semiconductor products Renesas Electronics Corporation is a leading semiconductor company that is driving advanced device development with accelerated time and sustainable advanced semiconductor solutions. At Renesas, we strive to foster a sustainable society that can last decades, by providing environmentally friendly semiconductor products and solutions throughout their entire life cycle, from research and development, design, procurement, production, sales, distribution, and use, to disposal. We are committed to reducing our environmental impact and preventing environmental pollution in all areas of our business. At the same time, we will comply with environmental laws and regulations and continue to improve our global environmental management system. Response to Climate Change We strive to reduce energy consumption throughout the value chain, use energy efficiently and minimize greenhouse gas emissions, to support the goal of becoming carbon neutral. Effective Use of Resources We make efficient use of all resources required for our businesses. In particular, we will strive to use water resources appropriately, minimize waste, and promote recycling. Biodiversity Conservation We contribute to biodiversity conservation through our business activities and promote the concept of biodiversity which is critical in supporting a rich and healthy society. We help build a better society by proactively disclosing environmental information with our stakeholders to establish mutual understanding and by actively communicating with them. In addition, Renesas' sustainable semiconductor solutions include its Green Electronics Program, which focuses on reducing the environmental impact of its products throughout their lifecycle. The program covers everything from design and manufacturing to end-of-life disposal and includes initiatives such as the development of energy-efficient semiconductors and the use of environmentally friendly packaging materials. Renesas' focus on energy efficiency, sustainability, and innovation makes it a leader in the semiconductor industry and well-positioned to create sustainable and environmentally friendly solutions for the future.","filter_flag":1}
{"title":"Cotton has a waste problem: This startup says it can solve it - GreenBiz","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2NvdHRvbi1oYXMtd2FzdGUtcHJvYmxlbS1zdGFydHVwLXNheXMtaXQtY2FuLXNvbHZlLWl00gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2NvdHRvbi1oYXMtd2FzdGUtcHJvYmxlbS1zdGFydHVwLXNheXMtaXQtY2FuLXNvbHZlLWl00gEA?oc=5","id":"CBMiVmh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2NvdHRvbi1oYXMtd2FzdGUtcHJvYmxlbS1zdGFydHVwLXNheXMtaXQtY2FuLXNvbHZlLWl00gEA","guidislink":false,"published":"Thu, 28 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=362, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2NvdHRvbi1oYXMtd2FzdGUtcHJvYmxlbS1zdGFydHVwLXNheXMtaXQtY2FuLXNvbHZlLWl00gEA?oc=5\" target=\"_blank\">Cotton has a waste problem: This startup says it can solve it<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GreenBiz<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Cotton has a waste problem: This startup says it can solve it - GreenBiz","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2NvdHRvbi1oYXMtd2FzdGUtcHJvYmxlbS1zdGFydHVwLXNheXMtaXQtY2FuLXNvbHZlLWl00gEA?oc=5\" target=\"_blank\">Cotton has a waste problem: This startup says it can solve it<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GreenBiz<\/font>","source.href":"https:\/\/www.greenbiz.com","source.title":"GreenBiz","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"The emerging textile recycling industry will take another step forward in 2024 when Seattle-based startup Evrnu breaks ground on a cotton recycling facility in South Carolina. The facility, which will run primarily on renewable energy and have the capacity to create the equivalent of 80,000 T-shirts every year from recycled cotton clothing, is scheduled to come online in its first phase in 2024 and be fully operational by 2025. Evrnu’s technology addresses a key hurdle in the apparel industry’s journey towards sustainability: Textile recycling today is basically nonexistent. Ninety-two million tons of textiles are thrown away each year. About 87 percent of all that material ends up in landfill. Less than 1 percent of the collected material becomes new garments in fiber-to-fiber recycling; most of the rest is downcycled — cut up to be used in rugs, insulation and other lesser-quality products. Evrnu is partnering with U.K. fashion and textile innovator Pangaia to create recycled clothing made of denim — among the hardest-to-recycle versions of cotton. Taking responsibility Creating a viable, commercial-scale circular economy for cotton would drastically reduce the impact the cotton industry has on the planet. Over 25 million tons of cotton are produced globally each year. Cotton processing and production requires large amounts of water: about 10,000 liters of water for 1 kilogram of cotton. The crop also degrades soil quality, and increases pollution and carbon emissions from the production of and use of fertilizers and pesticides. The top cotton producers are India (6.2 million tons), China (6.2 million tons) and the U.S. (3.6 million tons). The European Commission has proposed rules for extended producer responsibility (EPR), where the producer has to take responsibility (pay for) the entire life cycle of their products, including the waste they generate. EPR fees will go toward funding collection and recycling. Five states in the U.S. have passed EPR laws, primarily focused on packaging. Creating a viable, commercial-scale circular economy for cotton would drastically reduce the impact the cotton industry has on the planet. \"In the United States, we landfill and incinerate somewhere around 14 million tons of textiles a year,\" said Karla Magruder, founder of the nonprofit Accelerating Circularity. \"We're making a lot of new materials — putting energy, chemicals and water into them and … just throwing them away.\" \"If we want to move to circular, textile-to-textile recycling systems, we need the whole system in place,\" Magruder said. Solid to liquid, and back Stacy Flynn, founder and CEO of Evrnu, started researching the cotton recycling process in 2011 after a trip to China opened her eyes to the environmental damage produced by the textile industry. While studying for an MBA in sustainable systems at Pinchot University, in Washington state, Flynn shredded an old college T-shirt, dissolved it in a chemical solution and then, using a syringe, squirted the solution into a bath of sulfuric acid, which resolidified the liquified cotton into new \"threads.\" That was the first prototype of the process now called NuCycle. The patented system mechanically and chemically reduces a solid cotton to a pulp and then reconstitutes it into fibers for new clothes. The garments are first separated by a grading machine to select the clothes that are the closest to 100 percent cotton — the rest are discarded for traditional downcycling. The end result, says Evrnu, is a premium fabric made from completely recycled cotton that performs like virgin cotton — and itself is 100 percent recyclable. \"By linking the existing waste supply chain to the existing apparel supply chain, we can start essentially creating a closed circuit supply chain as we create new products,\" said Flynn. Denim dilemma Evrnu, which raised a $15 million Series B investment from its funders two years ago, works with garment collectors such as charities and distribution centers to get the initial clothing. Most of these garments would end up in rugs or insulation otherwise. Evrnu is partnering with Pangaia on a denim jacket made entirely from recycled cotton. Pangaia sells hoodies, jackets, shoes and T-shirts made with its own sustainable alternatives including seaweed, eucalyptus and grapes, as well as collaborating and investing in other textile startups similar to Evrnu. Pangaia wanted a product that was created from 100 percent recycled material and could be 100 percent recyclable. Designers chose denim, one of the most complicated and hardest to recycle textiles, largely because of the dying process. \"One of the beauties of denim is those dye molecules that chip off so you can see the white core,\" Flynn said. \"That's what makes denim so cool.\" Evrnu’s fiber dyes more easily than traditional cotton, so it had to develop a method that would allow some of the color to fleck off while maintaining the integrity of the fabric. The collaboration created 20 Renu denim jackets that were sold for $400 each on Panagia’s website — a price Flynn that acknowledges is high. The clothing industry, she said, has been underpricing fashion for decades. \"Cheap product is way too expensive on the earth,\" she said. \"We as citizens have to pay for the fact that we're not calculating in the cost of the damage to natural resources or people.\" The company also has a capsule collection with fashion retailer Zara using its NuCycle technology. Flynn said Evrnu has half a billion dollars in volume commitments from brands and retailers (none of which are public yet). With scale, she said, the price of the recycled fabric will start to come down. \"We're starting to really train everyday consumers around the value of the things they put against their skin and to make better choices. Because if we're doing damage to the environment or humans, it's not worth it.\" CORRECTION: This article has been updated to clarify when the Evrnu facility will be fully operational and to correct the quoted amount of textiles incinerated each year.","filter_flag":1}
{"title":"Telcos' Modest Emission Reduction Progress | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvdGVsY29zLW1vZGVzdC1lbWlzc2lvbi1yZWR1Y3Rpb24tcHJvZ3Jlc3PSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvdGVsY29zLW1vZGVzdC1lbWlzc2lvbi1yZWR1Y3Rpb24tcHJvZ3Jlc3PSAQA?oc=5","id":"CBMiT2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvdGVsY29zLW1vZGVzdC1lbWlzc2lvbi1yZWR1Y3Rpb24tcHJvZ3Jlc3PSAQA","guidislink":false,"published":"Mon, 18 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=18, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=352, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvdGVsY29zLW1vZGVzdC1lbWlzc2lvbi1yZWR1Y3Rpb24tcHJvZ3Jlc3PSAQA?oc=5\" target=\"_blank\">Telcos' Modest Emission Reduction Progress | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Telcos' Modest Emission Reduction Progress | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvdGVsY29zLW1vZGVzdC1lbWlzc2lvbi1yZWR1Y3Rpb24tcHJvZ3Jlc3PSAQA?oc=5\" target=\"_blank\">Telcos' Modest Emission Reduction Progress | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"The telecommunications industry has a dual role to play in the global effort to reduce greenhouse gas emissions: to lower its own emissions and to support its customers in reducing theirs. This year’s BCG Telco Sustainability Index offers a comprehensive portrait of the progress the industry is making on both fronts. Compared with the data for 2021, the new data—collected from published reports on a wide range of environmental metrics covering operations in 2022 from 29 major telecom operators around the world—demonstrates that, overall, the industry has made progress in three of the four dimensions we track. Telcos’ commitment to sustainability and to the circular economy and waste management have shown some improvement, though individual companies have achieved mixed progress. The customer enablement dimension still lags the other three, but progress there has been impressive, which bodes well for operators’ revenues and for other companies’ efforts to decarbonize. In the fourth dimension, which focuses on reducing CO 2 emissions and energy intensity, results are somewhat poorer than last year’s, for two main reasons. First, most operators have already begun their decarbonization and energy efficiency journeys and gained quick wins in areas such as switching to 100% renewable energy, where available. These initiatives have led to significant reductions in Scope 1 and Scope 2 emissions, but they have also fed a countervailing effect. The considerable increase in demand for telecom services and data traffic across their networks is complicating operators’ efforts to reduce their carbon emissions and energy usage further. A deeper look at the results reveals where telcos are making gains, where they need to improve, and what challenges and opportunities they face in doing so. The Overall Picture Data traffic over the world’s telecom networks is increasing rapidly, as is pressure from both business and retail customers for progress on key sustainability metrics. As a result, telecom operators are actively seeking ways to meet their sustainability goals, to future-proof their business against the rising costs of energy and of carbon abatement, and to reduce the risks associated with climate change. Progress, however, has been mixed. The telecom industry’s overall median score improved by 9 points in 2022 over the previous year. (See Exhibit 1.) But scores on three of the four main dimensions of the index did not show equivalent gains. (See “How We Create the Index.”) Median scores for commitments to sustainability and for circularity and waste management improved by 5 points, while efforts to reduce emissions and emissions intensity actually worsened by 3 points. In fact, the advance in overall score is largely due to a very substantial 24-point gain in customer enablement—and despite this achievement, the industry as a whole still needs to improve in this dimension.","filter_flag":1}
{"title":"The top 20 agtech deals of 2023 - AgFunderNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS90aGUtdG9wLTIwLWFndGVjaC1kZWFscy1vZi0yMDIz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS90aGUtdG9wLTIwLWFndGVjaC1kZWFscy1vZi0yMDIz0gEA?oc=5","id":"CBMiOGh0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS90aGUtdG9wLTIwLWFndGVjaC1kZWFscy1vZi0yMDIz0gEA","guidislink":false,"published":"Thu, 28 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=362, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS90aGUtdG9wLTIwLWFndGVjaC1kZWFscy1vZi0yMDIz0gEA?oc=5\" target=\"_blank\">The top 20 agtech deals of 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AgFunderNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The top 20 agtech deals of 2023 - AgFunderNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS90aGUtdG9wLTIwLWFndGVjaC1kZWFscy1vZi0yMDIz0gEA?oc=5\" target=\"_blank\">The top 20 agtech deals of 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AgFunderNews<\/font>","source.href":"https:\/\/agfundernews.com","source.title":"AgFunderNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Disclosure: AgFunderNews’ parent company is AgFunder. Agtech deals of 2023 followed much the same trajectory as other tech sectors, with lower valuations and far fewer mega-rounds than seen in the VC heyday of 2021 and early 2022. This year also saw a shift towards more investment in climate-focused solutions, hence the multiple waste-to-energy startups and carbon-related companies on the list below. Ag biotechnology, which includes the biologicals sector, was another strong category this year. As you read this, the AgFunderNews team is taking a bit of holiday R&R time before we start sifting through the mountains of data involved in the creation of AgFunder’s Global AgriFoodTech Investment report, coming in early 2024. In the meantime, here’s a sneak peek at the top 20 agtech deals of 2023, based on preliminary data from AgFunder. 1. EcoCeres (United States) – Bain Capital invested $400 million into US-based biorefinery platform EcoCeres, which converts low-value waste (e.g., agricultural biomass) into high-value biofuels and biopolymers. 2. Atlas Agro (Switzerland) – Renewable fertilizer company Atlas Agro raised $325 million in a late-stage round from Australia-based Macquarie Group‘s asset management arm. 3. Xpansiv (United States) – The carbon and environmental commodities marketplace raised $125 million from Blackstone Energy Partners, Bank of America and Goldman Sachs. 4. eFishery (Indonesia) – Aquaculture management platform Fishery reached “unicorn” status with $200 million in Series D funding from UAE-based G42 Global Expansion Fund (42xFund), SoftBank Vision Fund II and others. 5. Charm Industrial (United States) – Charm Industrial raised a $100 million Series B led by General Catalyst to expand across the US. Charm converts agricultural biomass into a carbon-rich liquid it then pumps underground to permanently remove carbon from the atmosphere. 6. Silo (United States) – The supply chain tech startup raised $100 million in new capital from First Citizens Bank. Funding went towards developing new products for Silo’s workflow automation and fintech tool for food retailers. 7. GoodLeaf Farms (Canada) – This indoor ag grower had one of the few high-profile raises for a vertical farming company in 2023, securing $78 million from CIBC and Farm Credit Canada. The debt-financing round went towards GoodLeaf Farms’ expansion across Canada. 8. Aphea.Bio (Belgium) – Ag biotech startup Aphea.Bio scored €70 million ($78 million) from Innovation Industries, Gates Foundation and others. The funding round supported the growth of Aphea.Bio’s biologicals business. 9. Loam Bio (Australia) – Soil carbon startup Loam raised A$105 million ($73 million) in a Series B round co-led by Chris Sacca fund Lowercarbon Capital and Wollemi Capital. 10. SAEL (India) – SAEL, which converts agri-waste to renewable energy, landed $60 million from Norfund‘s Norwegian Climate Investment Fund. SAEL noted the funding helped reduce more than 2.8 million tons of CO2 emissions by reducing stubble burning in fields. 11. Bluepha (China) – Biomaterials firm Bluepha snapped up $58 million in an extended Series B round led by Zhong Ping Capital. The company is developing a range of naturally occurring biopolymers to assist downstream companies. 12. Halter (New Zealand) – Halter, best known for its solar-powered smart cow collars and other livestock management tech, raised NZD 85 million $53.3 million. Bessemer Venture Partners led the Series C round with participation from Blackbird Ventures and others. 13. Ecorobotix (Switzerland) – The ag robotics startup raised $52 million in Series B funding for its automated precision spraying robots for row crops and pastures. Aqton PE and Cibus Capital co-led the round. 14. Agreena (Denmark) – scooped up a €46 million ($50 million) Series B for its soil carbon program that financially incentivizes farmers to transition to regenerative agriculture practices. Germany’s HV Capital led the round 15. Aemetis Biogas (United States) – The company, a subsidiary of biofuels company Aemetis, bagged $50 million in a debt financing round. Funding went towards construction of a dairy digester based on USDA Renewable Energy for America Program (REAP) loan guarantee commitments. 16. Green Genius (Lithuania) – The renewable energy company secured $50 million from Poland’s mBank to build 69MW of solar plants in Poland. To date this is the largest deal for Green Genius in Poland, where the startup already has other solar projects in the works. 17. Bio-Engine (China) – Bio-Engine, which makes serum-free media for human and animal cells, raised “over 300 million RMB” ($41 million) in May of this year. Newerli Capital led the Series C financing. 18. Greenlabs (S. Korea) – The precision ag company raised $38.4 million in debt financing from existing investors BRV Capital Management and SkyLake Incuvest. 19. Bestzyme Bioengineering (China) – The company, which does enzyme manufacturing for products like animal feed and bio-ethanol, raised $35.2 million in private equity. 20. Victory Farms (Kenya) – Tilapia producer Victory Farms completed a $35 million Series B round to expand operations in Kenya and Rwanda, as well as potential entry into Ethiopia, Uganda and Tanzania.","filter_flag":1}
{"title":"German researchers claim record-breaking 14.46% efficiency for organic PV module - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzE5L2dlcm1hbi1yZXNlYXJjaGVycy1jbGFpbS1yZWNvcmQtYnJlYWtpbmctMTQtNDYtZWZmaWNpZW5jeS1mb3Itb3JnYW5pYy1wdi1tb2R1bGUv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzE5L2dlcm1hbi1yZXNlYXJjaGVycy1jbGFpbS1yZWNvcmQtYnJlYWtpbmctMTQtNDYtZWZmaWNpZW5jeS1mb3Itb3JnYW5pYy1wdi1tb2R1bGUv0gEA?oc=5","id":"CBMid2h0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzE5L2dlcm1hbi1yZXNlYXJjaGVycy1jbGFpbS1yZWNvcmQtYnJlYWtpbmctMTQtNDYtZWZmaWNpZW5jeS1mb3Itb3JnYW5pYy1wdi1tb2R1bGUv0gEA","guidislink":false,"published":"Tue, 19 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=19, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=353, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzE5L2dlcm1hbi1yZXNlYXJjaGVycy1jbGFpbS1yZWNvcmQtYnJlYWtpbmctMTQtNDYtZWZmaWNpZW5jeS1mb3Itb3JnYW5pYy1wdi1tb2R1bGUv0gEA?oc=5\" target=\"_blank\">German researchers claim record-breaking 14.46% efficiency for organic PV module<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"German researchers claim record-breaking 14.46% efficiency for organic PV module - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzE5L2dlcm1hbi1yZXNlYXJjaGVycy1jbGFpbS1yZWNvcmQtYnJlYWtpbmctMTQtNDYtZWZmaWNpZW5jeS1mb3Itb3JnYW5pYy1wdi1tb2R1bGUv0gEA?oc=5\" target=\"_blank\">German researchers claim record-breaking 14.46% efficiency for organic PV module<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Researchers at the Friedrich-Alexander-Universität Erlangen-Nürnberg (FAU) in Germany claim to have achieved a power conversion efficiency of 14.46% for an organic PV module. “The size of the new record OPV module is 204 cm². The number of cells connected in series is 38,” Andreas Distler, Group Leader OPV Modules at FAU, told pv magazine, adding that he expects the results to appear soon in the US Department of Energy’s National Renewable Energy Laboratory (NREL) champion PV module efficiency chart. The new result is a jump up from the current record of 13.1 % recorded for a 57-cell encapsulated module by Taiwan-based OPV specialist, Ways Technical Corporation (Waystech) and Nanobit. In a press release, the team noted that the module is a solution-processed OPV, attributing the efficiency improvement to three aspects of the research project: the active materials used; the laser processing, which reduced inactive areas on the surface, and improved interconnects; and third, the use of simulations to establish a more homogeneous coating, which was done in partnership with a team from Georg Simon Ohm University of Applied Sciences in Nuremberg. Popular content The research team included researchers from Helmholtz Institute Erlangen-Nürnberg for Renewable Energy (HI ERN), which is part of Forschungszentrum Jülich. “We are currently preparing a paper on the development of this new record module, which will disclose all the technical details,” said Distler. In 2020, the same FAU team achieved 12.6% efficiency record on a module area of 26 cm2 and 11.7% on a module area of 204 cm2.","filter_flag":1}
{"title":"EU Council extends emergency renewable energy measures – pv magazine International - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzIwL2V1LWNvdW5jaWwtZXh0ZW5kcy1lbWVyZ2VuY3ktcmVuZXdhYmxlLWVuZXJneS1tZWFzdXJlcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzIwL2V1LWNvdW5jaWwtZXh0ZW5kcy1lbWVyZ2VuY3ktcmVuZXdhYmxlLWVuZXJneS1tZWFzdXJlcy_SAQA?oc=5","id":"CBMiXmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzIwL2V1LWNvdW5jaWwtZXh0ZW5kcy1lbWVyZ2VuY3ktcmVuZXdhYmxlLWVuZXJneS1tZWFzdXJlcy_SAQA","guidislink":false,"published":"Wed, 20 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=20, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=354, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzIwL2V1LWNvdW5jaWwtZXh0ZW5kcy1lbWVyZ2VuY3ktcmVuZXdhYmxlLWVuZXJneS1tZWFzdXJlcy_SAQA?oc=5\" target=\"_blank\">EU Council extends emergency renewable energy measures – pv magazine International<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"EU Council extends emergency renewable energy measures – pv magazine International - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzIwL2V1LWNvdW5jaWwtZXh0ZW5kcy1lbWVyZ2VuY3ktcmVuZXdhYmxlLWVuZXJneS1tZWFzdXJlcy_SAQA?oc=5\" target=\"_blank\">EU Council extends emergency renewable energy measures – pv magazine International<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"European Council energy ministers have agreed to extend a slate of emergency measures – including “accelerating the deployment of renewable energy” – introduced late last year to combat rising energy prices until June 2024, according to a European Council announcement from yesterday. Solar panel permit wait times not exceeding three months; solar panel rooftop installations and projects under 50 kW not requiring environmental impact assessments; and heat pump permit-granting processes not exceeding one month for installations below 50 MW and three months for ground-source heat pumps are among the renewable energy-relevant directives. “It is appropriate to promote and accelerate the deployment of small-scale solar installations, including for renewables self-consumers and collective self-consumers, such as local energy communities, since those are the options that cost least, are most accessible and have the least environmental or other type of impact for a fast roll-out of new renewable installations,” the legislation states. European Council Ecological Transition and the Demographic Challenge Minister Teresa Ribera said extending the raft of emergency measures was necessary to address the “still-fragile” situation in the EU following Russia’s invasion of Ukraine. “This will allow us to ensure the stabilization of the energy markets, alleviate the effect of the crisis and protect EU citizens from excessive high energy prices,” she said. Regulation (EU) 2022\/2577 was first introduced in Dec. 2022 to tackle rising energy prices, reduce the EU’s dependence on Russian fossil fuels and advance climate emergency initiatives, according to the document. Its levers are designed to target technologies that can be implemented in the short term and have “large” potential for reducing gas consumption and energy bills. Popular content Other energy instruments in the recent announcement include extending the monitoring of European gas prices and issuing notices when price breaches occur, as well as “enhancing solidarity through better coordination of gas purchases” through revised legislative language. Meanwhile, the European Heat Pump Association (EHPA) has come out today slamming the European Commission for delaying the publication of its hotly-anticipated Heat Pump Action Plan. According to the EHPA press release, it will now be released after the European Union elections in June next year. “Postponing the finalisation of this plan to after the election can only be called a mistake,” EHPA Secretary General Thomas Nowak said. “We urge President von der Leyen, Commissioner for Energy Simson and all Commissioners to review and revert it urgently.”","filter_flag":1}
{"title":"Singaporean startup unveils high intensity illumination tech that 'rejuvenates' solar panels - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5wdi1tYWdhemluZS5jb20vMjAyMy8xMi8yMS9zaW5nYXBvcmVhbi1zdGFydHVwLXVudmVpbHMtaGlnaC1pbnRlbnNpdHktaWxsdW1pbmF0aW9uLXRlY2gtdGhhdC1yZWp1dmVuYXRlcy1zb2xhci1wYW5lbHMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5wdi1tYWdhemluZS5jb20vMjAyMy8xMi8yMS9zaW5nYXBvcmVhbi1zdGFydHVwLXVudmVpbHMtaGlnaC1pbnRlbnNpdHktaWxsdW1pbmF0aW9uLXRlY2gtdGhhdC1yZWp1dmVuYXRlcy1zb2xhci1wYW5lbHMv0gEA?oc=5","id":"CBMiggFodHRwczovL3d3dy5wdi1tYWdhemluZS5jb20vMjAyMy8xMi8yMS9zaW5nYXBvcmVhbi1zdGFydHVwLXVudmVpbHMtaGlnaC1pbnRlbnNpdHktaWxsdW1pbmF0aW9uLXRlY2gtdGhhdC1yZWp1dmVuYXRlcy1zb2xhci1wYW5lbHMv0gEA","guidislink":false,"published":"Thu, 21 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=355, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5wdi1tYWdhemluZS5jb20vMjAyMy8xMi8yMS9zaW5nYXBvcmVhbi1zdGFydHVwLXVudmVpbHMtaGlnaC1pbnRlbnNpdHktaWxsdW1pbmF0aW9uLXRlY2gtdGhhdC1yZWp1dmVuYXRlcy1zb2xhci1wYW5lbHMv0gEA?oc=5\" target=\"_blank\">Singaporean startup unveils high intensity illumination tech that 'rejuvenates' solar panels<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Singaporean startup unveils high intensity illumination tech that 'rejuvenates' solar panels - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5wdi1tYWdhemluZS5jb20vMjAyMy8xMi8yMS9zaW5nYXBvcmVhbi1zdGFydHVwLXVudmVpbHMtaGlnaC1pbnRlbnNpdHktaWxsdW1pbmF0aW9uLXRlY2gtdGhhdC1yZWp1dmVuYXRlcy1zb2xhci1wYW5lbHMv0gEA?oc=5\" target=\"_blank\">Singaporean startup unveils high intensity illumination tech that 'rejuvenates' solar panels<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Researchers from the Nanyang Technological University Singapore (NTU Singapore) and startup EtaVolt have developed a high intensity illumination device that can reportedly “rejuvenate” solar panels and reduce their degradation. Called Advanced Regeneration Technology, the new technique consists of applying intense light and controlled temperature on the solar cells to excite the polysilicon molecules and make them move quickly. This reportedly changed their arrangement and “patches up” the holes caused by light, heat and humidity. “The process is akin to patching holes in a bucket; it repairs solar panels to prevent energy leakage, ensuring optimal light energy collection,” the scientists said, noting that the process is implemented via a high intensity illumination device that can roll itself over the photovoltaic modules. “The process takes less than five minutes and can help treated solar panels recover up to 5% of their lost field performance.” The research group claims that this process may reduce module degradation by up to 5 years, depending on the cell technology. The device may also be used on-site in either rooftop PV systems or ground-mounted PV plants and may be applied to around 90% of the solar modules available in the market. Popular content According to EtaVolt's website, the new regeneration technology is based on a proprietary combination of illumination, temperature, and regeneration time. It can also reportedly provide light-induced degradation (LID) mitigation and recovery. “Our solar rejuvenation method has not only been rigorously tested and validated but has shown field-proven results in various commercial applications. The technology has been successfully implemented in projects with major partners in the solar industry, such as renewable energy solutions firm Vector Green, demonstrating its effectiveness and potential for widespread adoption,” said NTU Singapore researcher Stanley Wang. The research team did not reveal more technical details about the device. “These technologies developed at NTU have been patented through NTUitive, the University’s innovation and enterprise company and are licensed to EtaVolt,” it stated.","filter_flag":1}
{"title":"The UNIQA Group has invested over 300 milion € worth of financing for sustainable infrastructure projects and ... - Bloomberg Adria","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMizAFodHRwczovL3JzLmJsb29tYmVyZ2FkcmlhLmNvbS95ZWFyLWFoZWFkLTIwMjQvdmVzdGkvNDY1NjcvdGhlLXVuaXFhLWdyb3VwLWhhcy1pbnZlc3RlZC1vdmVyLTMwMC1taWxpb24tZXVyLXdvcnRoLW9mLWZpbmFuY2luZy1mb3Itc3VzdGFpbmFibGUtaW5mcmFzdHJ1Y3R1cmUtcHJvamVjdHMtYW5kLXJlbmV3YWJsZS1lbmVyZ3ktdGVjaG5vbG9naWVzL25ld3PSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMizAFodHRwczovL3JzLmJsb29tYmVyZ2FkcmlhLmNvbS95ZWFyLWFoZWFkLTIwMjQvdmVzdGkvNDY1NjcvdGhlLXVuaXFhLWdyb3VwLWhhcy1pbnZlc3RlZC1vdmVyLTMwMC1taWxpb24tZXVyLXdvcnRoLW9mLWZpbmFuY2luZy1mb3Itc3VzdGFpbmFibGUtaW5mcmFzdHJ1Y3R1cmUtcHJvamVjdHMtYW5kLXJlbmV3YWJsZS1lbmVyZ3ktdGVjaG5vbG9naWVzL25ld3PSAQA?oc=5","id":"CBMizAFodHRwczovL3JzLmJsb29tYmVyZ2FkcmlhLmNvbS95ZWFyLWFoZWFkLTIwMjQvdmVzdGkvNDY1NjcvdGhlLXVuaXFhLWdyb3VwLWhhcy1pbnZlc3RlZC1vdmVyLTMwMC1taWxpb24tZXVyLXdvcnRoLW9mLWZpbmFuY2luZy1mb3Itc3VzdGFpbmFibGUtaW5mcmFzdHJ1Y3R1cmUtcHJvamVjdHMtYW5kLXJlbmV3YWJsZS1lbmVyZ3ktdGVjaG5vbG9naWVzL25ld3PSAQA","guidislink":false,"published":"Sat, 23 Dec 2023 16:59:22 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=23, tm_hour=16, tm_min=59, tm_sec=22, tm_wday=5, tm_yday=357, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMizAFodHRwczovL3JzLmJsb29tYmVyZ2FkcmlhLmNvbS95ZWFyLWFoZWFkLTIwMjQvdmVzdGkvNDY1NjcvdGhlLXVuaXFhLWdyb3VwLWhhcy1pbnZlc3RlZC1vdmVyLTMwMC1taWxpb24tZXVyLXdvcnRoLW9mLWZpbmFuY2luZy1mb3Itc3VzdGFpbmFibGUtaW5mcmFzdHJ1Y3R1cmUtcHJvamVjdHMtYW5kLXJlbmV3YWJsZS1lbmVyZ3ktdGVjaG5vbG9naWVzL25ld3PSAQA?oc=5\" target=\"_blank\">The UNIQA Group has invested over 300 milion € worth of financing for sustainable infrastructure projects and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bloomberg Adria<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The UNIQA Group has invested over 300 milion € worth of financing for sustainable infrastructure projects and ... - Bloomberg Adria","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMizAFodHRwczovL3JzLmJsb29tYmVyZ2FkcmlhLmNvbS95ZWFyLWFoZWFkLTIwMjQvdmVzdGkvNDY1NjcvdGhlLXVuaXFhLWdyb3VwLWhhcy1pbnZlc3RlZC1vdmVyLTMwMC1taWxpb24tZXVyLXdvcnRoLW9mLWZpbmFuY2luZy1mb3Itc3VzdGFpbmFibGUtaW5mcmFzdHJ1Y3R1cmUtcHJvamVjdHMtYW5kLXJlbmV3YWJsZS1lbmVyZ3ktdGVjaG5vbG9naWVzL25ld3PSAQA?oc=5\" target=\"_blank\">The UNIQA Group has invested over 300 milion € worth of financing for sustainable infrastructure projects and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bloomberg Adria<\/font>","source.href":"https:\/\/rs.bloombergadria.com","source.title":"Bloomberg Adria","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"What are UNIQA Insurance's plans for 2024 concerning new products or services you plan to launch in the market? 2024 will be an exciting year for UNIQA in the SEE region as we take the next step in our business and technology transformation. In the past year, we all worked hard to lay strong foundations for our new digital tools, which will help our colleagues to be faster and more efficient, but at the same time provide our clients an individual approach for their insurance needs. Our goal is to bring insurance to a new level in the next couple of years and become trendsetters in the insurance sector in the region. We are also working on the development of new standardized regional products, focusing on SME, Motor, Life, and Health. Our clients are our biggest inspiration, so we took their suggestions to heart and included them in our product development process to provide them exactly what they need. We are all looking forward to the next year. It truly will be full of innovation. How do you foresee the business opportunities in the insurance market in the coming year, particularly regarding emerging trends and changes in client needs? The insurance sector proved to be very resilient in the past, growing constantly even during a global pandemic and other economic challenges. The circumstances in which we operate are changing constantly, which also means that the needs of our clients change. Besides classical Motor and property insurance lines we see two segments that offer the most significant opportunity for development and growth, one of them being SME insurance. Small and medium enterprises are the most vulnerable business model in this high paced economy. Many SME owners have dedicated their personal assets to their businesses, thereby amplifying the financial risk to their overall well-being. With the right insurance, those risks can be minimised and allow more space for growth and development. The second opportunity we have to seize is the health insurance segment. People are paying increasing attention to a healthier lifestyle and seeking medical advice and second opinions more frequently. Offering clients the possibility to create their individual insurance coverage will provide them and us with a significant advantage in the future. Besides an individual approach, one of the biggest opportunities is to be flexible, fast, and innovative using technology. Using a omnichannel strategy allowed us to be more present, which means that our clients can reach us whenever they need. How does UNIQA Insurance plan to invest in ESG (Environmental, Social, and Governance) strategies in the upcoming fiscal year? Our ESG strategy is something we are already extremely proud of. In each field, we are trying to be as active as possible. For the upcoming year, we have already plans to surpass this year's goals when it comes to sustainability, biodiversity, and energy efficiency. The UNIQA Group is already a member of the Net-Zero Asset Owner Alliance and is a founding member of the Green Finance Alliance, and we are also dedicated to making a big impact in the region regarding those topics. Our overall goal is to achieve climate neutrality by the end of 2050. To achieve this, we have focused our ESG strategy on four areas – asset management, products, operations and reporting. The UNIQA Group has invested over 300 milion € worth of financing for sustainable infrastructure projects and renewable energy technologies, such as wind and solar energy and waste-to-energy processing. We will continue with sustainable investments in the region as well, helping our communites and local economies at the same time. Our products play also a crucial part in our strategy. We want to offer our clients the right support which will encourage them to switch to more sustaibable solutions as well (e.g. insurance of solar panels). UNIQA is also very engaged when it comes to various initiatives in this field. Our offices in the whole region are using recycled paper and we use sustainable energy sources wherever it is possible. We planted over 4.500 trees, supported local beekeepers, and our procurement team is working hard to provide us with sustainable sources to lower our carbon footprint as much as possible. To stay on track to achieve our climate neutrality goal we are conducting regular detailed analysis and reporting measures, making sure our governance politics are clear and transparent. Do you see priorities in innovation or technological advancements that will be pivotal for UNIQA's development in 2024? UNIQA in the SEE region is currently going through a significant digital transformation. The decision to go along this path did not come overnight. We have all done a lot of research and all results pointed to this move. The technological advancements we are acquiring from this strategy will form our future and make a big impact on the insurance market in our region. Since the insurance industry is based on people and their needs, our goal with this digital transformation is not to replace human interaction but to create tools that will help us to offer our clients an easier and faster solution to their needs. A large regional team of our IT experts is working tirelessly on developing new features that will be implemented very shortly into our unique and unified regional IT system. Most of the features aim to help our clients be more independent and efficient when it comes to insurance. We are creating a user-friendly and efficient self service oriented interface that will not only speed up all our processes but also simplify them while offering a wider range of options for our clients. How does UNIQA Insurance plan to support social initiatives and the communities where you operate during the next year? UNIQA is strongly committed to all communities in which we operate. Our overall goal is to be a strong and dependable partner to all people and businesses, and that means not only our clients. We have partnered with a lot of local and regional organizations in various fields with the main goal to give back to the community. Our first regional activity is our exclusive sponsorship of the Sarajevo Film Festival, which helped us explore our options when it comes to cultural investments in the region. We are also very proud of our cooperation with Goran Ivanisević, our first regional brand ambassador. We will work closely with both of our partners to create new opportunities for young talents and support them in their first career steps. Our guiding principle is based on strengthening our community, and young people are our top priority. What is very special for UNIQA is our unique approach to social initiatives. Our UNIQA SEE community is very eager to truly be part of every initiative, offering a helping hand and volunteering in many activities in addition to our donations and sponsorships. Our focus for the next year will be aimed towards culture, green initiatives, and sports, as we try to build a future in which we all live better together.","filter_flag":1}
{"title":"“Our Future Is Electric,” But GM’s Chief Sustainability Officer Wants More EV Infrastructure Support - CleanTechnica","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihgFodHRwczovL2NsZWFudGVjaG5pY2EuY29tLzIwMjMvMTIvMDUvb3VyLWZ1dHVyZS1pcy1lbGVjdHJpYy1idXQtZ21zLWNoaWVmLXN1c3RhaW5hYmlsaXR5LW9mZmljZXItd2FudHMtbW9yZS1ldi1pbmZyYXN0cnVjdHVyZS1zdXBwb3J0L9IBigFodHRwczovL2NsZWFudGVjaG5pY2EuY29tLzIwMjMvMTIvMDUvb3VyLWZ1dHVyZS1pcy1lbGVjdHJpYy1idXQtZ21zLWNoaWVmLXN1c3RhaW5hYmlsaXR5LW9mZmljZXItd2FudHMtbW9yZS1ldi1pbmZyYXN0cnVjdHVyZS1zdXBwb3J0L2FtcC8?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihgFodHRwczovL2NsZWFudGVjaG5pY2EuY29tLzIwMjMvMTIvMDUvb3VyLWZ1dHVyZS1pcy1lbGVjdHJpYy1idXQtZ21zLWNoaWVmLXN1c3RhaW5hYmlsaXR5LW9mZmljZXItd2FudHMtbW9yZS1ldi1pbmZyYXN0cnVjdHVyZS1zdXBwb3J0L9IBigFodHRwczovL2NsZWFudGVjaG5pY2EuY29tLzIwMjMvMTIvMDUvb3VyLWZ1dHVyZS1pcy1lbGVjdHJpYy1idXQtZ21zLWNoaWVmLXN1c3RhaW5hYmlsaXR5LW9mZmljZXItd2FudHMtbW9yZS1ldi1pbmZyYXN0cnVjdHVyZS1zdXBwb3J0L2FtcC8?oc=5","id":"CBMihgFodHRwczovL2NsZWFudGVjaG5pY2EuY29tLzIwMjMvMTIvMDUvb3VyLWZ1dHVyZS1pcy1lbGVjdHJpYy1idXQtZ21zLWNoaWVmLXN1c3RhaW5hYmlsaXR5LW9mZmljZXItd2FudHMtbW9yZS1ldi1pbmZyYXN0cnVjdHVyZS1zdXBwb3J0L9IBigFodHRwczovL2NsZWFudGVjaG5pY2EuY29tLzIwMjMvMTIvMDUvb3VyLWZ1dHVyZS1pcy1lbGVjdHJpYy1idXQtZ21zLWNoaWVmLXN1c3RhaW5hYmlsaXR5LW9mZmljZXItd2FudHMtbW9yZS1ldi1pbmZyYXN0cnVjdHVyZS1zdXBwb3J0L2FtcC8","guidislink":false,"published":"Tue, 05 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=5, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=339, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihgFodHRwczovL2NsZWFudGVjaG5pY2EuY29tLzIwMjMvMTIvMDUvb3VyLWZ1dHVyZS1pcy1lbGVjdHJpYy1idXQtZ21zLWNoaWVmLXN1c3RhaW5hYmlsaXR5LW9mZmljZXItd2FudHMtbW9yZS1ldi1pbmZyYXN0cnVjdHVyZS1zdXBwb3J0L9IBigFodHRwczovL2NsZWFudGVjaG5pY2EuY29tLzIwMjMvMTIvMDUvb3VyLWZ1dHVyZS1pcy1lbGVjdHJpYy1idXQtZ21zLWNoaWVmLXN1c3RhaW5hYmlsaXR5LW9mZmljZXItd2FudHMtbW9yZS1ldi1pbmZyYXN0cnVjdHVyZS1zdXBwb3J0L2FtcC8?oc=5\" target=\"_blank\">“Our Future Is Electric,” But GM’s Chief Sustainability Officer Wants More EV Infrastructure Support<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CleanTechnica<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"“Our Future Is Electric,” But GM’s Chief Sustainability Officer Wants More EV Infrastructure Support - CleanTechnica","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihgFodHRwczovL2NsZWFudGVjaG5pY2EuY29tLzIwMjMvMTIvMDUvb3VyLWZ1dHVyZS1pcy1lbGVjdHJpYy1idXQtZ21zLWNoaWVmLXN1c3RhaW5hYmlsaXR5LW9mZmljZXItd2FudHMtbW9yZS1ldi1pbmZyYXN0cnVjdHVyZS1zdXBwb3J0L9IBigFodHRwczovL2NsZWFudGVjaG5pY2EuY29tLzIwMjMvMTIvMDUvb3VyLWZ1dHVyZS1pcy1lbGVjdHJpYy1idXQtZ21zLWNoaWVmLXN1c3RhaW5hYmlsaXR5LW9mZmljZXItd2FudHMtbW9yZS1ldi1pbmZyYXN0cnVjdHVyZS1zdXBwb3J0L2FtcC8?oc=5\" target=\"_blank\">“Our Future Is Electric,” But GM’s Chief Sustainability Officer Wants More EV Infrastructure Support<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CleanTechnica<\/font>","source.href":"https:\/\/cleantechnica.com","source.title":"CleanTechnica","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Sign up for daily news updates from CleanTechnica on email. Or follow us on Google News For all the media frenzy lately about how EV demand is falling, the data definitely doesn’t underpin such claims. Automakers are keenly aware of the contradiction, yet the EV ennui and discourse around the “we’re not ready” firestorm offers a methodical opportunity for automakers to ramp up their EV infrastructure. Kristen Siemen, chief sustainability officer (CSO) at General Motors (GM), appeared this week at COP28 for EV infrastructure and policy support to help make an all-electric transportation future a reality. Sure, the IRA has helped spark $100 billion of investment in EV and battery manufacturing, but those and other EV infrastructure projects will take time, with more acceleration expected in 2024 and into 2025. A robust EV infrastructure is necessary to create lines of profitable plug-in passenger vehicles, she explained. Sales of passenger EVs are on pace to hit 14 million this year, up 36% from 2022. In the US, where most of the concerns about demand have been raised, sales are growing even faster and will be up 50% this year. Like many legacy automakers, GM has launched EV products that are not yet fully competitive on price, range, or features with all-electric manufacturers like Tesla, BYD, and Li Auto. Those automakers are on track to capture 7% of the global vehicle market this year. Chip in a few dollars a month to help support independent cleantech coverage that helps to accelerate the cleantech revolution! CSO Siemen spoke at the Future Mobility Hub at COP28 in Dubai on December 4, 2023. The Future Mobility Hub serves as a complementary business venue to the policy focused COP28. On an all-electric future at GM: “We’ve been very clear at General Motors that our future is electric,” Siemen reflected, even as the GM Q3 2023 letter to shareholders described the shifting GM plans for EVs. Moderating the acceleration of EV production in North America, the shareholder letter said, would serve “to protect our pricing, adjust to slower near-term growth in demand, and implement engineering efficiency and other improvements that will make our vehicles less expensive to produce, and more profitable.” New GM EVs are on their way: “We have plans to turn over our portfolio and have been introducing a number of new EV vehicles. That transition is going to take some time,” Siemen noted. Among its EV commitments, GM has been ramping up production of the Cadillac Lyriq while continuing sales of the GMC Hummer EV. With a starting price of around $30,000 for the 1LT, the Equinox EV plugs Chevrolet into the critical compact SUV segment and may be the most affordable EV in its class. The 2024 Chevrolet Equinox EV 2RS limited availability could be starting early 2024, according to the company’s website. The 2023 Bolt EV and Bolt EUV are available now, while the 2024 Blazer EV SS and 2024 Silverado EV RST are targeted for 2024 deliveries. Implementation of all these new GM product lines, of course, takes time. Issues related to infrastructure expansion: “I mean, so we continue to look at the market and understand some of those issues and where (sic) we’ve talked about,” Siemen explained. GM is investing nearly $750 million in charging infrastructure so their customers can have a better charging experience at home and work. They’re also pursuing the development of a coast-to-coast public charging network. Then again, the UAW pitched a carefully coordinated campaign that targeted the most profitable factories at GM, Ford, and Stellantis simultaneously, so that the union won historic wage increases coupled with strong gains in job security and benefits. On policies to support an electric future: “We really need partnership again from an infrastructure standpoint, from a policy standpoint,” Siemen argued. “The transition is happening. It may happen faster in some segments than others, but it is a reality that the future is an electric future.” In November, GM launched a strategic partnership with the US startup Niron Magnetics, aimed at bringing new, rare earth-free automotive technology to market. GM’s plants are known as Ultium Cells LLC as a joint venture between GM and LG Energy Solution. GM has two Ultium Cells plants operational (Lordstown and Shanghai) and two more are under construction (Spring Hill and Lansing). Not all partnerships are always sweet, however, as the GM and LG Energy Solution joint venture battery plant in Ohio was censured for safety and health violations in October. “We also can’t make that transition on our own,” Siemen continued. “So we need support from an infrastructure standpoint, policies, etc. to make that all-electric future a reality… One of the great things about being here at COP is the collaborations. We all have products we can compete on, products we need to collaborate on solutions. And, so, whatever that is and whatever we can do to accelerate a better future for all of us is great for everyone.” Sustainability space achievements: “As a company, General Motors, I’m extremely proud of what we’re doing in the sustainability space,” Siemen discussed. “Everything from our pursuit of renewable energy, we have a goal to be 100% renewable globally by 2035, and we’ve actually achieved that by 2025 in the US. So continuing to do everything we can to be part of the solution.” With their Ultium technology, GM is in the process of introducing a network of charging stations, dedicated back-up home power, and a suite of new products to help create a more resilient grid. The Ultium Home and Ultium Commercial product lines, for example, will provide cohesive energy management at the home, commercial, and community level. Responsibility for the planet and the next generation: “And just so, climate change is a huge problem. It’s the biggest problem that our generation has to address, and that affects everybody” Seimen stated. Her statement was consistent with November’s Fifth National Climate Assessment, which showed a decline in US greenhouse gas (GHG) emissions even as the population, a growing GDP, and the realization that every US region is experiencing climate threats and impacts at the same time that ambitious climate action is underway. “As a mom, I have children that I worry about what their future looks like and their children. And so I think we have to continue to work together and think about that future so we have a planet that we can all live in and be successful in.” Have a tip for CleanTechnica? Want to advertise? Want to suggest a guest for our CleanTech Talk podcast? Latest CleanTechnica.TV Videos Advertisement CleanTechnica uses affiliate links. See our policy here Have a tip for CleanTechnica? Want to advertise? Want to suggest a guest for our CleanTech Talk podcast? Contact us here","filter_flag":1}
{"title":"Johnson Controls unveils water-to-water heat pump for commercial buildings - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzIyL2pvaG5zb24tY29udHJvbHMtdW52ZWlscy13YXRlci10by13YXRlci1oZWF0LXB1bXAtZm9yLWNvbW1lcmNpYWwtYnVpbGRpbmdzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzIyL2pvaG5zb24tY29udHJvbHMtdW52ZWlscy13YXRlci10by13YXRlci1oZWF0LXB1bXAtZm9yLWNvbW1lcmNpYWwtYnVpbGRpbmdzL9IBAA?oc=5","id":"CBMicmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzIyL2pvaG5zb24tY29udHJvbHMtdW52ZWlscy13YXRlci10by13YXRlci1oZWF0LXB1bXAtZm9yLWNvbW1lcmNpYWwtYnVpbGRpbmdzL9IBAA","guidislink":false,"published":"Fri, 22 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=356, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzIyL2pvaG5zb24tY29udHJvbHMtdW52ZWlscy13YXRlci10by13YXRlci1oZWF0LXB1bXAtZm9yLWNvbW1lcmNpYWwtYnVpbGRpbmdzL9IBAA?oc=5\" target=\"_blank\">Johnson Controls unveils water-to-water heat pump for commercial buildings<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Johnson Controls unveils water-to-water heat pump for commercial buildings - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzIyL2pvaG5zb24tY29udHJvbHMtdW52ZWlscy13YXRlci10by13YXRlci1oZWF0LXB1bXAtZm9yLWNvbW1lcmNpYWwtYnVpbGRpbmdzL9IBAA?oc=5\" target=\"_blank\">Johnson Controls unveils water-to-water heat pump for commercial buildings<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"US-based industrial conglomerate Johnson Controls has introduced a water-to-water compound centrifugal heat pump intended for use in commercial buildings. The York Cyk heat pump is designed for high-head conditions and can reportedly deliver high-temperature hot water as high as 77 C. “The York Cyk can reduce water and operational costs by as much as 50% when compared to traditional boiler and chiller applications,” the manufacturer said in a statement. The new product is currently available in a small version with a 400-ton cooling capacity. It offers 1,406 kW if output for cooling and 2,051 kW for heating. The company said the system has a combined coefficient of performance of 4.9. It may use either the R-1234ze or the R-515b refrigerants, which Johnson Controls said have ultra-low global warming potential (GWP). Popular content The heat pump also features two electric motor-driven centrifugal compressors arranged in series and double bundle condenser technology that can cope with unbalanced load conditions, according to the company. “The innovative design is compatible with existing high-temperature hot water heating systems, eliminating the need to replace air handlers and terminal heating devices, which is often required to accommodate the lower water temperatures associated with other heat pump products,” said the company. Johnson Controls plans to launch a second version of the heat pump with a 2,000-ton cooling capacity and an output of 7,033 kW at an unspecified later stage. “The York Cyk heat pump is ideal for medium to large commercial buildings, university campuses, hospitals, industrial processes and district energy applications and can be used in new building or retrofit applications,” it said.","filter_flag":1}
{"title":"Harmonizing Horizons: Huawei's Threefold Influence Unleashing Digital to Propel Asia-Pacific's Energy Transition - Huawei Enterprise","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vZS5odWF3ZWkuY29tL215L2Jsb2dzL2luZHVzdHJpZXMvaW5zaWdodHMvMjAyMy91bmxlYXNoaW5nLWRpZ2l0YWwtcHJvcGVsLWFzaWEtcGFjaWZpYy1lbmVyZ3ktdHJhbnNpdGlvbtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vZS5odWF3ZWkuY29tL215L2Jsb2dzL2luZHVzdHJpZXMvaW5zaWdodHMvMjAyMy91bmxlYXNoaW5nLWRpZ2l0YWwtcHJvcGVsLWFzaWEtcGFjaWZpYy1lbmVyZ3ktdHJhbnNpdGlvbtIBAA?oc=5","id":"CBMib2h0dHBzOi8vZS5odWF3ZWkuY29tL215L2Jsb2dzL2luZHVzdHJpZXMvaW5zaWdodHMvMjAyMy91bmxlYXNoaW5nLWRpZ2l0YWwtcHJvcGVsLWFzaWEtcGFjaWZpYy1lbmVyZ3ktdHJhbnNpdGlvbtIBAA","guidislink":false,"published":"Mon, 18 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=18, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=352, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vZS5odWF3ZWkuY29tL215L2Jsb2dzL2luZHVzdHJpZXMvaW5zaWdodHMvMjAyMy91bmxlYXNoaW5nLWRpZ2l0YWwtcHJvcGVsLWFzaWEtcGFjaWZpYy1lbmVyZ3ktdHJhbnNpdGlvbtIBAA?oc=5\" target=\"_blank\">Harmonizing Horizons: Huawei's Threefold Influence Unleashing Digital to Propel Asia-Pacific's Energy Transition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Huawei Enterprise<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Harmonizing Horizons: Huawei's Threefold Influence Unleashing Digital to Propel Asia-Pacific's Energy Transition - Huawei Enterprise","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vZS5odWF3ZWkuY29tL215L2Jsb2dzL2luZHVzdHJpZXMvaW5zaWdodHMvMjAyMy91bmxlYXNoaW5nLWRpZ2l0YWwtcHJvcGVsLWFzaWEtcGFjaWZpYy1lbmVyZ3ktdHJhbnNpdGlvbtIBAA?oc=5\" target=\"_blank\">Harmonizing Horizons: Huawei's Threefold Influence Unleashing Digital to Propel Asia-Pacific's Energy Transition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Huawei Enterprise<\/font>","source.href":"https:\/\/e.huawei.com","source.title":"Huawei Enterprise","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Harmonizing Horizons: Huawei’s Threefold Influence Unleashing Digital to Propel Asia-Pacific’s Energy Transition 2023-12-18 446 0 To address the pervasive worldwide dilemmas of balancing economic growth with environmental conservation, the strategy of green and digital dual transformation presents sustainable solutions. Globally, over 170 governments have formulated their digital strategies, and 130 countries have pledged to net-zero emissions, signifying a widespread global consensus towards transitioning to green and digital energy. The transformation involves a shift from fossil-based energy systems to renewable sources in production, transmission, consumption, and storage. The Huawei Global Industry Vision Report anticipates that over 50% of global power will be generated from renewable energy by 2030; and the accumulated global energy storage capacity is expected to reach 358 GW, increase more than 20 times within 10 years. As renewable energy gains prominence in the energy system, the electric power industry becomes a critical battlefield in the ongoing transition. Unstable energies like solar PV replace fossil energy at the generation end, while the integration of new power loads like electric vehicles poses a significant threat to system balance at the consumption end. Realizing the ambitious transformation demands collaborative efforts, co-organized with Masyarakat Ketenagalistrikan Indonesia (MKI, also known as the Indonesian Electrical Power Society), Enlit Asia 2023, the leading regional annual conference took place from November 14 to 16 in Jakarta, Indonesia. The event brought the regional power and energy value chain together on one platform, to address the industry’s latest trends, products, and technologies. During the event, Huawei showcased innovative electric power solutions and exchanged crucial insights on ASEAN energy transition with opinion leaders and experts from over 200 enterprises. As a chartered member of MKI, Huawei is committed to harnessing digital technologies to accelerate the energy transition across the Asia-Pacific region. Driving Green and Digital Transformation in Asia-Pacific through Collaborative Endeavors Home to 61% of the world's population, APAC countries are speeding up on the dual transformation journey. National strategies like Digital Indonesia, My Digital in Malaysia, and Digital Hub in Thailand are building strong digital foundations, accompanied by commitments such as Thailand's aim for carbon neutrality by 2050 and Indonesia's target of Net-Zero Emissions by 2060. Although APAC countries are at different phases of energy transition, green and digital must be the driving force behind ASEAN’s economic momentum. This ambitious pathway will require close collaborations across all sectors. Governments and public entities play a crucial role in establishing a conducive environment through policies, while financiers, investors, and businesses of all sizes contribute through green finance and carbon trading markets. Furthermore, technological innovations in digital and energy sectors will serve as key enablers throughout the process. Numerous communities and platforms arise within the energy industry, bringing together stakeholders to enhance discussions about energy transition. One notable entity in this landscape is MKI, who aims to create a communication and consultation forum that strengthens synergy in enhancing the efficiency of environmentally friendly national electrical power since 1998. Through initiatives like The Indonesia National Electricity Day, MKI shapes opinions to develop the electrical power industry. Huawei consistently participates in MKI events and forums, working collaboratively with stakeholders in the region to bolster ASEAN's energy transition. Empowering Asia Pacific Energy Transition in Three Dimensions Dedicated to accelerating the green and digital energy transition, Huawei commits to contribute in the electric power industry in three significant ways. I. Innovating in Cutting-edge Electric Power Solutions According to Wood Mackenzie, the Asia-Pacific region is set to embark on a decade of renewable energy transformation (2021-2030) with a projected investment of $1.3 trillion in wind and solar generation. To tackle challenges from the introduction of new energy, the industry requires robust digital capabilities, including widespread connectivity, a dependable communication network, and formidable computing power. In response, Huawei is committed to bring innovative technologies for the smart power system, viewing digitalization as the remedy for these pressing issues. As a global ICT provider, we offer three types of electric power solutions. Firstly, we provide scenario-based industry digitalization solutions, including intelligent power plant, intelligent power transmission line inspection, and power distribution IoT to enhance operational and maintenance (O&M) efficiency. Our digital space security solutions ensure reliability through anti-interruption measures, anti-attack mechanisms, and anti-ransomware measures, serving as a robust last line of defense for data security. Lastly, we contribute to green and low-carbon development through innovations in digital power solutions, such as smart microgrid and battery energy storage systems. Our intelligent electric power solutions have proven to be beneficial to various energy companies across Asia-Pacific. In Macao SAR, China, we collaborated with Companhia de Electricidade de Macao (CEM), to enhance its communication network reliability and reduce the learning and maintenance costs. In Indonesia, we assisted Perusahaan Listrik Negara (PLN) in establishing a secure storage environment to bolster its smart meter workflows. In Thailand, our smart grid solution helped Provincial Electricity Authority (PEA) upgrade their wireless communication infrastructure for lower latency and increased connectivity. II. Cultivating Digital Talent for the Electric Power Industry To propel the energy transition progress, it is imperative to have experts well-versed in both electric power industry knowledge and digitalization skills. First, our experts will collaborate with enterprises, companies, and eco-system partners to facilitate a professional growth with practical electric power scenarios. As the first wave of seed talents identifies essential digital capabilities, we implement a certification system linked to their career development. With the belief that wisdom resides among the people, we reduce the threshold for digitalization. Our Seeds for the Future, ASEAN Academy, and ICT Academy have trained over 200,000 digital talents in Asia-Pacific, encouraging widespread participation and creativity. Meanwhile, we aim to empower partners to precisely meet customer requirements, efficiently resolve issues, and agilely deliver solutions. This year, Huawei unveiled a $200 million incentive for Asia-Pacific partners, allocating $55 million for partner capability development. Two joint innovation OpenLab were inaugurated in the region (OpenLab Asia-Pacific in Singapore and OpenLab Bangkok in Thailand). Both OpenLab aim to facilitate customer and partner enablement, uniting local partners to conduct proof-of-concept testing and develop scenario-based electric power solutions according to APAC business scenarios and customer requirements. III. Accelerating Digital Transformation of the Electric Power Sector with Top Industry Players We aim to continuously accelerate the digital transformation of the electric power sector through strategic collaboration with top industry players and set up the good reference in the region. Since 2013, Huawei and PLN have collaborated hand in hand, striving together to forge a green and digital Asia-Pacific. The launch of the Joint Innovation Center (JIC) program at Enlit Asia marks a significant milestone of the 10-year partnership, signifying a stronger readiness for APAC energy transition. Bringing together experts from research and development, sales, marketing, service, consulting, and key partners in the electric power industry, JIC is envisioned as an outstanding eco-platform. Here, both parties can collaboratively develop new products, solutions, and drive the digitalization of electric power and FTTH (Fiber to the Home) businesses. Beyond its role in innovation incubation, JIC will serve as a hub for exhibitions and capability development. This dual-purpose approach aims to assist PLN in enhancing its digital capabilities while showcasing the collective achievements of both parties. Uniting for Green and Digital Prosperity in Asia-Pacific Collaborating with more than 20 leading electric power companies across 12 countries in the region, we are deeply rooted in Asia-Pacific. United at the crossroads of a transformative era, let's jointly strengthen the energy landscape, catalyzing digital empowerment across the power industry for enhanced efficiency, resilience, and sustainability. This collective mission shapes a fully connected and intelligent APAC—a beacon of progress for generations.","filter_flag":1}
{"title":"The world is changing: 2024 technology predictions - Innovation News Network","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3Lmlubm92YXRpb25uZXdzbmV0d29yay5jb20vdGhlLXdvcmxkLWlzLWNoYW5naW5nLTIwMjQtdGVjaG5vbG9neS1wcmVkaWN0aW9ucy80MTI5OC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3Lmlubm92YXRpb25uZXdzbmV0d29yay5jb20vdGhlLXdvcmxkLWlzLWNoYW5naW5nLTIwMjQtdGVjaG5vbG9neS1wcmVkaWN0aW9ucy80MTI5OC_SAQA?oc=5","id":"CBMiXmh0dHBzOi8vd3d3Lmlubm92YXRpb25uZXdzbmV0d29yay5jb20vdGhlLXdvcmxkLWlzLWNoYW5naW5nLTIwMjQtdGVjaG5vbG9neS1wcmVkaWN0aW9ucy80MTI5OC_SAQA","guidislink":false,"published":"Fri, 29 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=29, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=363, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3Lmlubm92YXRpb25uZXdzbmV0d29yay5jb20vdGhlLXdvcmxkLWlzLWNoYW5naW5nLTIwMjQtdGVjaG5vbG9neS1wcmVkaWN0aW9ucy80MTI5OC_SAQA?oc=5\" target=\"_blank\">The world is changing: 2024 technology predictions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Innovation News Network<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The world is changing: 2024 technology predictions - Innovation News Network","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3Lmlubm92YXRpb25uZXdzbmV0d29yay5jb20vdGhlLXdvcmxkLWlzLWNoYW5naW5nLTIwMjQtdGVjaG5vbG9neS1wcmVkaWN0aW9ucy80MTI5OC_SAQA?oc=5\" target=\"_blank\">The world is changing: 2024 technology predictions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Innovation News Network<\/font>","source.href":"https:\/\/www.innovationnewsnetwork.com","source.title":"Innovation News Network","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"With technological advancements making headlines more than ever this year, 2024 technology predictions are gearing up to be fascinating. In this article, a range of technology experts give their predictions for the year ahead. From the widespread use of generative AI tools, such as ChatGPT, to ransomware gangs attacking with more ferocity than ever before, organisations are now working overtime to ensure that IT teams are equipped with appropriate tools, training and defences to not only fend off new cyber threats but also make the most of these advancements in 2024. So, with so much change in the air, what will the world of 2024 look like? The year of cyber One thing’s for sure as we enter the new year – cyber will be as prevalent as it’s ever been. Now, with the widespread proliferation of AI for both threat actors and IT teams, the world of cybersecurity is set to get more complex. Moshe Weis, CISO at Aqua, explained: “In 2023, we saw the increasing adoption of AI in offensive and defensive cybersecurity strategies. This trend is intensifying in 2024, with AI-driven threat actors becoming more sophisticated and organisations deploying advanced AI-driven security measures. The industry recognises the importance of staying ahead of these evolving threats through behavioural analytics, anomaly detection, and ethical AI practices.” AI and Machine Learning are also expected to significantly impact how we share and process information in the coming months, positively integrating their way into threat intelligence. This integration will enhance threat prediction and response capabilities,” stated Avkash Kathiriya, Senior VP of Research and Innovation at Cyware. “The trend of cross-industry collaboration in sharing internal and external threat intelligence will also become more commonplace, underlining its role in building robust and adaptable cybersecurity strategies. It will drive change within the industry and make trusted community intelligence more valuable than commodity intelligence.” AI…But make it generative Despite the explosion of AI in the mainstream media this year, there is much debate over how ‘innovative’ the technology is at the moment. However, generative AI is one aspect that most can agree has genuinely started to change the game. Russell Gammon, Chief Solutions Officer at Tax Systems, commented: “Everyone has played around with the new technology, and all the big tech firms are investing heavily in it. But it’s still in its infancy, and 2024 will be the year that we start to utilise it properly and reap the full benefits. “ChatGPT will go from being a fun toy to play around with to being the foundation of business applications and products. We have already seen businesses enhance existing products with AI, but over the next 12 months, we will see it add real commercial value as whole new products are built upon the technology.” “Naturally, as we see this new technology more integrated into business models, it will be important that organisations have the right infrastructure to support it, notably the right skills and training. Gen AI training has focused on building literacy and awareness so that employees have a basic understanding of how the technology works, including its limitations and ethical considerations,” said Apratim Purakayastha, Chief Product Officer and Chief Technology Officer at Skillsoft. “We will see Gen AI training become much more specialised and varied across different roles and departments. Expect to see more courses on ‘using generative AI for X’ – whether for marketers, project managers, HR professionals, customer support representatives, etc. “By providing relevant, hands-on learning experiences that connect directly to an employee’s job, organisations will unlock the next phase of AI enablement within their workforce.” It’s all about compliance Compliance is a steady priority for all businesses, which will remain the same in 2024. However, the nuances within governance and compliance will continue evolving, and organisations must keep up. Jay Sanderson, Senior Product Marketing Manager, Digital Experience at Progress, stated: “As global data privacy regulations intensify, the adoption of Customer Data Platforms (CDPs) will surge, with a premium placed on solutions that offer built-in, robust compliance frameworks—turning regulatory adherence into a competitive advantage.” Of course, the biggest buzzword on everyone’s lips for next year is DORA. Richard Gadd, Senior VP of EMEA & India at Commvault, commented: “This year, IDC research revealed that only 33% of senior executives are involved in cyber preparedness initiatives, but 61% of those leaders believe an attack could severely impact their business in the next 12 months. “With that in mind, there needs to be a fresh focus on data protection and data security, building a well-grounded structure of cyber resilience. This is even more important when we consider that the Digital Operations Resilience Act (DORA) is coming into effect in January 2025, giving industry leaders only 12 months to ensure they meet the security requirements of this act. This move towards cyber preparedness must come from the top-down as a matter of urgency, with C-suite members showing more dedication to building a more reliable and holistic security posture.” Finally, the biggest challenge to regulation and compliance in 2024 will be AI, but it will be essential to get it right. Gary Lynam, Managing Director, EMEA, Protecht, explained: “While many organisations will find implementing AI-powered risk and compliance management daunting, there’s never been a better time to start exploring it. And for those that don’t, they will surely get left behind. “The FCA has recently reinforced that the Senior Managers & Certification Regime also gives us a clear framework to respond to innovations in AI. This clarifies that senior managers are ultimately accountable for the firm’s activities. This, combined with the likely revisiting of UK SOX if the UK has a change in government in 2024, means a busy, demanding year ahead for accountable managers.” Shifting priorities in 2024? Business priorities are constantly in flux to tackle the onslaught of social, technological, and political changes that may affect day-to-day operations. In addition to some of the ‘bigger’ topics promising to define 2024, like AI, we will undoubtedly see countless more focus areas creating waves in the technology landscape: Sustainability Sustainability is a huge topic on the minds of almost all businesses as we move into 2024. Regulations and customer demand force organisations to consider tangible, meaningful ways to impact the environment positively. One of the biggest industries that will be affected by this in the coming years is the data centre industry. As a sector, few naturally lend themselves to an environmental model less than data centres. However, it’s for this reason that it’s so vital. Terry Storrar, Managing Director, Leaseweb UK, commented: “Sustainability will stay firmly in the hotspot next year. And rightly so, as it’s a serious issue. It is very positive that customers are challenging data centre operators and service providers on their green agenda, along with more government regulations coming into play. “Rather than huge steps, it is more a pattern that data centre businesses are taking sure, small steps towards environmental goals, such as achieving 100% renewable energy use.” Labour shortages Unfortunately, one thing that is unlikely to change in 2024 is the UK’s intense labour shortage. As of October 2023, approximately 9.7% of businesses were still reported to be suffering from a shortage of workers. Speaking to the contact centre industry, Dave Hoekstra, Product Evangelist, Calabrio, explains that a main priority next year needs to be addressing labour shortages head-on. “Contact centres will significantly increase investments in training programs, with 35% of managers ranking it as their top tactic for attracting and retaining new hires,” he said. “Faced with a current 35% skill gap among agents, there will be a concentrated effort to address specific training challenges, particularly in emotional intelligence (33%), job aptitude (37%), and onboarding. This increased focus on comprehensive training underscores the industry-wide dedication to equipping agents with the technical and soft skills to navigate the demands of the hybrid, AI-driven contact centre environment.” A decline in the public cloud Lastly, with the ‘cloud gold rush’ finally dying, many businesses are beginning to realise that putting everything in a public cloud may not have been the promised silver bullet. “Cloud-also is a new topic in the industry, and while it’s currently more vibrant in the US as they have put more data in the cloud already, I expect we’ll see a growing trend in organisations moving data away from the public cloud globally in the next 12 months,” predicted Guillaume Crapart, Senior Director of Channel Sales at Quantum. “It’s also something that will drive budget decisions, as IT leaders determine whether to apportion budget from the cloud to use instead for on-premises storage for specific data types. And thirdly, the semi-private cloud is another storage option. “I believe we’ll see a rise in popularity in 2024 as organisations seek to have their cloud-based data closer to home and subjected to stronger security measures than the public cloud allows. In combination with the cloud-also trend, organisations will gain more privacy and control over their data – a must in today’s digital world.” As technology evolves rapidly in 2024, we will undoubtedly see a momentous amount of change in how organisations and end-users operate. It’ll be essential to ensure businesses carefully assess their unique needs and what their customers seek.","filter_flag":1}
{"title":"AI Redefined Gains Momentum with New Investment, Expands to Europe, and Appoints Industry Veterans to Key ... - Silicon Canals","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3NpbGljb25jYW5hbHMuY29tL2FpLXJlZGVmaW5lZC1nYWlucy1tb21lbnR1bS13aXRoLW5ldy1pbnZlc3RtZW50LWV4cGFuZHMtdG8tZXVyb3BlLWFuZC1hcHBvaW50cy1pbmR1c3RyeS12ZXRlcmFucy10by1rZXktbGVhZGVyc2hpcC1yb2xlcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3NpbGljb25jYW5hbHMuY29tL2FpLXJlZGVmaW5lZC1nYWlucy1tb21lbnR1bS13aXRoLW5ldy1pbnZlc3RtZW50LWV4cGFuZHMtdG8tZXVyb3BlLWFuZC1hcHBvaW50cy1pbmR1c3RyeS12ZXRlcmFucy10by1rZXktbGVhZGVyc2hpcC1yb2xlcy_SAQA?oc=5","id":"CBMikwFodHRwczovL3NpbGljb25jYW5hbHMuY29tL2FpLXJlZGVmaW5lZC1nYWlucy1tb21lbnR1bS13aXRoLW5ldy1pbnZlc3RtZW50LWV4cGFuZHMtdG8tZXVyb3BlLWFuZC1hcHBvaW50cy1pbmR1c3RyeS12ZXRlcmFucy10by1rZXktbGVhZGVyc2hpcC1yb2xlcy_SAQA","guidislink":false,"published":"Wed, 27 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=361, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3NpbGljb25jYW5hbHMuY29tL2FpLXJlZGVmaW5lZC1nYWlucy1tb21lbnR1bS13aXRoLW5ldy1pbnZlc3RtZW50LWV4cGFuZHMtdG8tZXVyb3BlLWFuZC1hcHBvaW50cy1pbmR1c3RyeS12ZXRlcmFucy10by1rZXktbGVhZGVyc2hpcC1yb2xlcy_SAQA?oc=5\" target=\"_blank\">AI Redefined Gains Momentum with New Investment, Expands to Europe, and Appoints Industry Veterans to Key ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Silicon Canals<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"AI Redefined Gains Momentum with New Investment, Expands to Europe, and Appoints Industry Veterans to Key ... - Silicon Canals","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3NpbGljb25jYW5hbHMuY29tL2FpLXJlZGVmaW5lZC1nYWlucy1tb21lbnR1bS13aXRoLW5ldy1pbnZlc3RtZW50LWV4cGFuZHMtdG8tZXVyb3BlLWFuZC1hcHBvaW50cy1pbmR1c3RyeS12ZXRlcmFucy10by1rZXktbGVhZGVyc2hpcC1yb2xlcy_SAQA?oc=5\" target=\"_blank\">AI Redefined Gains Momentum with New Investment, Expands to Europe, and Appoints Industry Veterans to Key ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Silicon Canals<\/font>","source.href":"https:\/\/siliconcanals.com","source.title":"Silicon Canals","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"MONTREAL–(BUSINESS WIRE)–#LLM–AI Redefined, a pioneering force in human-AI collaboration technology, unveils key milestones showcasing exceptional growth and momentum. Following a successful Silicon Valley fundraising round, the Canadian company is set for success in the coming year. This is fueled by a new R&D facility in Paris, the cornerstone of its European operations, and the appointment of industry leaders Dr. Yves Lostanlen as General Manager and Bernard Slede as Senior Vice President of Business Development. The expansion aligns with the growing adoption of its award-winning Cogment™ technology. Situated at Station F in the heart of the Paris AI technopole, the new studio serves as a strategic move to establish a presence in the European AI landscape. Beyond an office, this location aims to be an innovation and collaboration hub for developing new products and partnerships. The expansion includes a dedicated Paris-based R&D team, supporting AI Redefined’s commitment to a pivotal role in the dynamic European AI ecosystem. Leading AI Redefined in Europe is General Manager Dr. Yves Lostanlen, a seasoned industry veteran known for transformative leadership roles in major organizations such as Engie, Siemens, Element AI, government institutions, and academia. With deep and extensive knowledge in AI technologies, Dr. Lostanlen’s strategic insights are evidenced through numerous keynote engagements and over 1200 citations for his articles. As a former board member of IEEE Communication Society and an Expert Advisor to prestigious entities like the European Commission and Council of Europe, his appointment reinforces AI Redefined’s commitment to attracting top talent to drive further innovation and growth. About his new role, Dr. Lostanlen states: “Joining AI Redefined and the Cogment team at this exciting time, when human interaction is recognized as essential to AI advancements, is a tremendous opportunity. With Cogment’s proven human-in-the-loop AI products, we offer a unique value proposition for deep-expertise industries historically challenged by AI-Human alignment. I am confident AI Redefined has what it takes to lead in today’s rapidly evolving AI landscape.” In another strategic move, Bernard Slede joins AI Redefined as Senior Vice President of Business Development, bringing a proven track record from Intel, Dolby, and Vonage. Excited about joining AIR’s team, Slede notes, “Key markets such as aviation, defense, renewable energy, manufacturing and healthcare view AIR’s human-AI solutions as the missing piece to leverage their data. They’re eager to safely adopt and deploy AI through our trusted Cogment suite of Human-AI collaboration products.” - A message from our partner - As AI Redefined gains momentum and prepares to announce key contracts, 2024 is anticipated as a year of exponential growth. The European expansion, coupled with the appointments of industry leaders and ongoing advancements by Cogment, reaffirms AI Redefined’s commitment to shaping the future of human-AI collaboration. For more information about AI Redefined, visit www.ai-r.com. About AI Redefined: AI Redefined is a multinational, award-winning, applied artificial intelligence research firm dedicated to better human-AI alignment. Founded in Montreal in 2018, the company focuses on developing Human-AI (RLHF) solutions that push the boundaries of what humans and AI can achieve in various industries, including aeronautics, renewable energy, manufacturing, and autonomous (e.g. human-machine teaming) systems. Contacts For media inquiries: Craig Vachon, AI Redefined (AIR), [email protected]","filter_flag":1}
{"title":"New Pulsar corporate presentation can be viewed by shareholders at Emerging Growth Conference - Innovation News Network","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3Lmlubm92YXRpb25uZXdzbmV0d29yay5jb20vbmV3LXB1bHNhci1jb3Jwb3JhdGUtcHJlc2VudGF0aW9uLXZpZXdlZC1zaGFyZWhvbGRlcnMtZW1lcmdpbmctZ3Jvd3RoLWNvbmZlcmVuY2UvNDA5MjEv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3Lmlubm92YXRpb25uZXdzbmV0d29yay5jb20vbmV3LXB1bHNhci1jb3Jwb3JhdGUtcHJlc2VudGF0aW9uLXZpZXdlZC1zaGFyZWhvbGRlcnMtZW1lcmdpbmctZ3Jvd3RoLWNvbmZlcmVuY2UvNDA5MjEv0gEA?oc=5","id":"CBMifWh0dHBzOi8vd3d3Lmlubm92YXRpb25uZXdzbmV0d29yay5jb20vbmV3LXB1bHNhci1jb3Jwb3JhdGUtcHJlc2VudGF0aW9uLXZpZXdlZC1zaGFyZWhvbGRlcnMtZW1lcmdpbmctZ3Jvd3RoLWNvbmZlcmVuY2UvNDA5MjEv0gEA","guidislink":false,"published":"Thu, 07 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=341, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3Lmlubm92YXRpb25uZXdzbmV0d29yay5jb20vbmV3LXB1bHNhci1jb3Jwb3JhdGUtcHJlc2VudGF0aW9uLXZpZXdlZC1zaGFyZWhvbGRlcnMtZW1lcmdpbmctZ3Jvd3RoLWNvbmZlcmVuY2UvNDA5MjEv0gEA?oc=5\" target=\"_blank\">New Pulsar corporate presentation can be viewed by shareholders at Emerging Growth Conference<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Innovation News Network<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New Pulsar corporate presentation can be viewed by shareholders at Emerging Growth Conference - Innovation News Network","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3Lmlubm92YXRpb25uZXdzbmV0d29yay5jb20vbmV3LXB1bHNhci1jb3Jwb3JhdGUtcHJlc2VudGF0aW9uLXZpZXdlZC1zaGFyZWhvbGRlcnMtZW1lcmdpbmctZ3Jvd3RoLWNvbmZlcmVuY2UvNDA5MjEv0gEA?oc=5\" target=\"_blank\">New Pulsar corporate presentation can be viewed by shareholders at Emerging Growth Conference<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Innovation News Network<\/font>","source.href":"https:\/\/www.innovationnewsnetwork.com","source.title":"Innovation News Network","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Pulsar Helium Inc. has announced the release of its new corporate presentation, which will be showcased at the Emerging Growth Conference on 7 December 2023. Pulsar’s new corporate presentation will include new images on pages 17 and 18 for the passive seismic survey at the company’s Topaz helium project in Minnesota. Pulsar will be presenting at 11:25 am Eastern Time for 30 minutes. Thomas Abraham-James, Pulsar President and CEO, will give a presentation and open the floor for questions. Questions should be submitted in advance to Questions@EmergingGrowth.com and can also be asked during the event. To attend the conference and receive any updates that are released, please register here. If attendees are unable to join the event live, an archived webcast will also be made available on EmergingGrowth.com and on the Emerging Growth YouTube Channel, http:\/\/www.YouTube.com\/EmergingGrowthConference. The link will be released after the event. About the Emerging Growth Conference The Emerging Growth Conference allows companies to present and communicate their new products, services, and other major announcements to the investment community in a time-efficient and convenient manner. The conference coverage includes companies in a wide range of growth sectors with strong management teams, innovative products, focused strategy, and potential for long-term growth. Its audience includes individual and institutional investors as well as investment advisors and analysts. Sessions will be conducted through video webcasts and take place in the Eastern time zone. About Pulsar Helium Pulsar Helium Inc. is a publicly-traded company listed on the TSX Venture Exchange with the ticker PLSR. Pulsar’s portfolio consists of the Topaz helium project in Minnesota, US and the Tunu helium project in Greenland. Pulsar is the first mover in both locations, with primary helium occurrences not associated with the production of hydrocarbons identified at each. For further information, visit https:\/\/pulsarhelium.com, and follow the company on X (formerly known as Twitter) and LinkedIn.","filter_flag":1}
{"title":"Green Mountain to start data centre expansion in London - Data Centre Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vZGF0YWNlbnRyZW1hZ2F6aW5lLmNvbS9hcnRpY2xlcy9ncmVlbi1tb3VudGFpbi10by1zdGFydC1kYXRhLWNlbnRyZS1leHBhbnNpb24taW4tbG9uZG9u0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vZGF0YWNlbnRyZW1hZ2F6aW5lLmNvbS9hcnRpY2xlcy9ncmVlbi1tb3VudGFpbi10by1zdGFydC1kYXRhLWNlbnRyZS1leHBhbnNpb24taW4tbG9uZG9u0gEA?oc=5","id":"CBMiX2h0dHBzOi8vZGF0YWNlbnRyZW1hZ2F6aW5lLmNvbS9hcnRpY2xlcy9ncmVlbi1tb3VudGFpbi10by1zdGFydC1kYXRhLWNlbnRyZS1leHBhbnNpb24taW4tbG9uZG9u0gEA","guidislink":false,"published":"Thu, 14 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=348, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vZGF0YWNlbnRyZW1hZ2F6aW5lLmNvbS9hcnRpY2xlcy9ncmVlbi1tb3VudGFpbi10by1zdGFydC1kYXRhLWNlbnRyZS1leHBhbnNpb24taW4tbG9uZG9u0gEA?oc=5\" target=\"_blank\">Green Mountain to start data centre expansion in London<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Data Centre Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Green Mountain to start data centre expansion in London - Data Centre Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vZGF0YWNlbnRyZW1hZ2F6aW5lLmNvbS9hcnRpY2xlcy9ncmVlbi1tb3VudGFpbi10by1zdGFydC1kYXRhLWNlbnRyZS1leHBhbnNpb24taW4tbG9uZG9u0gEA?oc=5\" target=\"_blank\">Green Mountain to start data centre expansion in London<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Data Centre Magazine<\/font>","source.href":"https:\/\/datacentremagazine.com","source.title":"Data Centre Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Data centres are crucial infrastructure, storing and processing the data that makes our digital lives possible. Without them, our ability to connect with others, access information, and conduct business would be severely limited. Data centres are also essential for driving innovation. They are the backbone of cloud computing, which allows businesses and individuals to access computing power and storage on demand, and of artificial intelligence (AI), which is being used to develop new products and services. Expansion in the UK market Norwegian data centre company, Green Mountain, has started construction on a new 14MW expansion at its LON1-East campus in Romford, near London. The expansion is part of the company's plans to increase its capacity in the UK market. The first phase of the expansion is expected to be completed by the first quarter of 2025. The campus has the potential to be expanded with an additional 16MW in the future. The project will involve the construction of three new data halls, each capable of supporting 7MW of IT load, within an existing building at the site. In addition to this initial phase, Green Mountain has secured planning permission for the development of an additional 16MW of data centre capacity on an adjacent plot of land. This build-to-suit facility will provide customers with the flexibility to customise their data centre space to meet their specific needs. The expansion at LON1-East underscores Green Mountain's commitment to providing its customers with high-quality, low-carbon data centre solutions. The campus is strategically located to serve the growing demand for data centre capacity in the London region and beyond. The rapid growth of the UK data centre market Simon Blackburn, Managing Director of Green Mountain says: “We are delighted to begin expanding the existing operational site to bring additional capacity to market. “The unique location coupled with a strong team experienced in both building and operating highly secure data centres with 100% availability, makes this a fantastic site for customers looking for low latency connectivity, and easy access to London and with an opportunity to expand to 30MW including build to suit options in a single campus.” London is a major hub for data centres due to its strong economy, well-developed infrastructure, and access to a large pool of skilled labour. The UK data centre market is expected to grow rapidly in the coming years as more and more businesses rely on cloud computing and other digital services. “This is a true milestone in our international expansion. London is an extremely important data centre hub and a must-have location for many international companies,” says Svein Atle Hagaseth, CEO of Green Mountain. “Our aim is to gradually expand our footprint in several international markets, and London is an ideal location to continue executing this strategy.” Powered entirely by renewable energy The expansion is powered entirely by certified renewable energy, ensuring that the electricity used to operate the data centres comes from sources such as solar, wind, or hydropower. This commitment to renewable energy eliminates the reliance on fossil fuels and minimises the carbon footprint of the data centres. Green Mountain is aiming for a Power Usage Effectiveness (PUE) of 1.2 for the new data halls, which represents a significant improvement over the industry average of 1.5. A lower PUE indicates a more efficient use of energy, implying that the data centres consume less power for a given amount of IT processing. For backup power generation, Green Mountain is replacing diesel with hydrotreated vegetable oil (HVO) fuel. HVO is derived from renewable sources like vegetable oil and has similar properties to diesel, but it produces up to 90% fewer CO2 emissions. This switch to HVO further reduces the carbon footprint of the data centres. ****** For more insights into the world of Data Centre - check out the latest edition of Data Centre Magazine and be sure to follow us on LinkedIn & Twitter. Other magazines that may be of interest - Mobile Magazine. Please also check out our upcoming event - Sustainability LIVE Net Zero on 6 and 7 March 2024. ****** BizClik is a global provider of B2B digital media platforms that cover Executive Communities for CEOs, CFOs, CMOs, Sustainability leaders, Procurement & Supply Chain leaders, Technology & AI leaders, Cyber leaders, FinTech & InsurTech leaders as well as covering industries such as Manufacturing, Mining, Energy, EV, Construction, Healthcare and Food. BizClik – based in London, Dubai, and New York – offers services such as content creation, advertising & sponsorship solutions, webinars & events.","filter_flag":1}
{"title":"University of Nottingham research partnership results in groundbreaking new industry tech - The Manufacturer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy50aGVtYW51ZmFjdHVyZXIuY29tL2FydGljbGVzL3VuaXZlcnNpdHktb2Ytbm90dGluZ2hhbS1yZXNlYXJjaC1wYXJ0bmVyc2hpcC1yZXN1bHRzLWluLWdyb3VuZGJyZWFraW5nLW5ldy1pbmR1c3RyeS10ZWNoL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy50aGVtYW51ZmFjdHVyZXIuY29tL2FydGljbGVzL3VuaXZlcnNpdHktb2Ytbm90dGluZ2hhbS1yZXNlYXJjaC1wYXJ0bmVyc2hpcC1yZXN1bHRzLWluLWdyb3VuZGJyZWFraW5nLW5ldy1pbmR1c3RyeS10ZWNoL9IBAA?oc=5","id":"CBMigwFodHRwczovL3d3dy50aGVtYW51ZmFjdHVyZXIuY29tL2FydGljbGVzL3VuaXZlcnNpdHktb2Ytbm90dGluZ2hhbS1yZXNlYXJjaC1wYXJ0bmVyc2hpcC1yZXN1bHRzLWluLWdyb3VuZGJyZWFraW5nLW5ldy1pbmR1c3RyeS10ZWNoL9IBAA","guidislink":false,"published":"Wed, 06 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=340, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy50aGVtYW51ZmFjdHVyZXIuY29tL2FydGljbGVzL3VuaXZlcnNpdHktb2Ytbm90dGluZ2hhbS1yZXNlYXJjaC1wYXJ0bmVyc2hpcC1yZXN1bHRzLWluLWdyb3VuZGJyZWFraW5nLW5ldy1pbmR1c3RyeS10ZWNoL9IBAA?oc=5\" target=\"_blank\">University of Nottingham research partnership results in groundbreaking new industry tech<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Manufacturer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"University of Nottingham research partnership results in groundbreaking new industry tech - The Manufacturer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy50aGVtYW51ZmFjdHVyZXIuY29tL2FydGljbGVzL3VuaXZlcnNpdHktb2Ytbm90dGluZ2hhbS1yZXNlYXJjaC1wYXJ0bmVyc2hpcC1yZXN1bHRzLWluLWdyb3VuZGJyZWFraW5nLW5ldy1pbmR1c3RyeS10ZWNoL9IBAA?oc=5\" target=\"_blank\">University of Nottingham research partnership results in groundbreaking new industry tech<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Manufacturer<\/font>","source.href":"https:\/\/www.themanufacturer.com","source.title":"The Manufacturer","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"A partnership, which paired researchers from the University of Nottingham with a UK tech company, has produced a highly advanced power converter to drive an electric motor that could revolutionise the manufacturing and renewable energy industries. For the past five years, researchers from the university have worked closely with digital motor control solutions company, Sprint Electric, to develop and prototype the Generis AC regen drive – set to be the next generation in AC drive technology. Launched at the Smart Production Solutions (SPS) exhibition in Nuremberg, one of the most highly regarded international trade fairs in the field of smart and digital automation solutions; this leap in innovation has been made possible thanks to two Knowledge Transfer Partnerships (KTPs) between researchers at the University of Nottingham’s Power, Electronics and Machines Centre (PEMC), and Sprint Electric. The aim of a KTP is to connect businesses that have an innovation idea with the academic expertise to develop new products or services, expand markets, and improve efficiency and productivity. In Sprint Electric’s case, it fully embraced the collaborative opportunity, establishing a base at the PEMC at Nottingham’s Jubilee Campus. Dr Azlia Abdul Rahman, a PhD graduate recruited to lead the KTP, said: “I was based at these premises for the duration of the second KTP, which meant I was right there in the thick of it and involved at every stage of the research and development lifecycle. I worked closely with Associate Professor Liliana de Lillo as the main academic supervisor, while Professor Pat Wheeler, Head of the PEMC Research Group, oversaw the project. Liliana was part of a wider team of researchers supporting me in transferring the theoretical knowledge the company needed to develop the technology. Training Sprint Electric’s staff, documenting everything we did, and writing technical reports was just a fraction of my work – to all intents and purposes I ‘joined’ the company for two years to help make this happen.” Sprint Electric has been manufacturing variable speed controllers since 1987, traditionally specialising in the control of DC motors. With the help of the University of Nottingham it has removed the need for a DC link in the AC drive, offering several advantages over conventional converters, such as higher efficiency, faster response, and two-way power flow. One of the main applications of matrix converters is in renewable energy systems, such as wind turbines, solar panels, and fuel cells. Mark Gardiner, Director of Sprint Electric, said: “Our experience with KTPs has been a wholly positive one. Not only has it quickly and effectively embedded understanding of a complex technology in our business but it has also established a relationship with the PEMC group that I am confident will continue to deliver benefits to both parties in years to come.” While KTPs may initially seem like consultancies, where a company hires an expert to advise and guide them through a project or period of transformation, there is more to them. Andrea McCluskey, Business Development Officer for KTP at the University of Nottingham said: “KTPs meld the theory from the academic side with specialist knowledge and expertise from within a business. What they have achieved will absolutely transform Sprint Electric as a company, and part of the electronic motor industry as a whole. Not only will it give them a significant competitive advantage, but it could also completely change the landscape for other businesses now and in the future.” However, it isn’t just Sprint Electric who has benefited from the partnership’s achievements. Apart from the potential seismic impact on industry, the intensive efforts of the PEMC will act as a case study for the Research Excellence Framework (REF), which evaluates and recognises the contribution made by university research. As well as international recognition and prestige, this could lead to increased research funding for the University in the future and pave the way for further technological improvements and societal change. Andrea continued: “It is a win-win situation for all parties. Knowledge Transfer Partnerships are an invaluable opportunity to establish long lasting professional relationships which have the potential to turn into very valuable strategic relationships between academia and industry. Transferring research into real world applications is the ultimate dream of academics who want to generate real global impact, and this is only possible by working with an industrial partner. “You also get to see graduates develop, increasing their knowledge and expertise; the company obviously benefits through increased profits; and the Associates benefit through career development and exposure to industry, sowing the seeds for the next generation of business leaders. KTPs also aim to train future business leaders, in that businesses hope the Associates will stay in industry rather than academia.” Sprint Electric unveiled its new AC regeneration drive at the at the Smart Production Solutions (SPS) exhibition in Nuremberg between 14 – 16 November. Meanwhile the University of Nottingham, through its Knowledge Transfer Partnerships arrangement will continue to support with the commercialisation of the product once it has launched.","filter_flag":1}
{"title":"Daikin unveils series of residential air-to-air heat pumps - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzA0L2RhaWtpbi11bnZlaWxzLXNlcmllcy1vZi1yZXNpZGVudGlhbC1haXItdG8tYWlyLWhlYXQtcHVtcHMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzA0L2RhaWtpbi11bnZlaWxzLXNlcmllcy1vZi1yZXNpZGVudGlhbC1haXItdG8tYWlyLWhlYXQtcHVtcHMv0gEA?oc=5","id":"CBMiYmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzA0L2RhaWtpbi11bnZlaWxzLXNlcmllcy1vZi1yZXNpZGVudGlhbC1haXItdG8tYWlyLWhlYXQtcHVtcHMv0gEA","guidislink":false,"published":"Mon, 04 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=4, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=338, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzA0L2RhaWtpbi11bnZlaWxzLXNlcmllcy1vZi1yZXNpZGVudGlhbC1haXItdG8tYWlyLWhlYXQtcHVtcHMv0gEA?oc=5\" target=\"_blank\">Daikin unveils series of residential air-to-air heat pumps<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Daikin unveils series of residential air-to-air heat pumps - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzA0L2RhaWtpbi11bnZlaWxzLXNlcmllcy1vZi1yZXNpZGVudGlhbC1haXItdG8tYWlyLWhlYXQtcHVtcHMv0gEA?oc=5\" target=\"_blank\">Daikin unveils series of residential air-to-air heat pumps<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Daikin Europe NV, a subsidiary of Japanese heating system manufacturer Daikin, has introduced a new residential air-to-air heat pump line as part of a strategy to develop products tailored to cold climates. The company said the new Nepura series is a replacement of its Optimised Heating 4 series, which was launched in 2017. “Nepura is engineered to operate down to -30 C and ensures high heating capacity at low ambient temperatures,” the manufacturer said. “The improved outdoor unit structure with full bottom plate equipped with a standard heater avoids ice build-up.” The systems use difluoromethane (R32) as the refrigerant and have outdoor unit dimensions of 662 mm x 442 mm x 1022 mm. Their output ranges from 2.5 kW to 3.5 kW and their seasonal coefficient of performance (SCOP) is between 4.85 and 5.17. The new products also feature what the manufacturer calls “weather compensation” and “fireplace logic,” which considers secondary heat sources in dwellings. Popular content “As soon as the room reaches the set temperature, the fireplace logic function starts automatically, switching off the indoor unit heating while keeping the fan rotating to distribute warm air across the room,” the manufacturer explained. The Nepura line can be combined with Daikin's indoor series Emura, Stylish, Perfera, and Comfora. “Nepura’s indoor units feature a specially designed fan that optimizes airflow for high-performance at low sound levels down to 19 dBA,” the company stated. The new heat pump systems went on sale in November.","filter_flag":1}
{"title":"Interview with R.P. Gupta: “SECI looks forward to setting up its own renewable energy projects” - Renewable Watch","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3JlbmV3YWJsZXdhdGNoLmluLzIwMjMvMTIvMDUvaW50ZXJ2aWV3LXdpdGgtci1wLWd1cHRhLXNlY2ktbG9va3MtZm9yd2FyZC10by1zZXR0aW5nLXVwLWl0cy1vd24tcmVuZXdhYmxlLWVuZXJneS1wcm9qZWN0cy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3JlbmV3YWJsZXdhdGNoLmluLzIwMjMvMTIvMDUvaW50ZXJ2aWV3LXdpdGgtci1wLWd1cHRhLXNlY2ktbG9va3MtZm9yd2FyZC10by1zZXR0aW5nLXVwLWl0cy1vd24tcmVuZXdhYmxlLWVuZXJneS1wcm9qZWN0cy_SAQA?oc=5","id":"CBMigQFodHRwczovL3JlbmV3YWJsZXdhdGNoLmluLzIwMjMvMTIvMDUvaW50ZXJ2aWV3LXdpdGgtci1wLWd1cHRhLXNlY2ktbG9va3MtZm9yd2FyZC10by1zZXR0aW5nLXVwLWl0cy1vd24tcmVuZXdhYmxlLWVuZXJneS1wcm9qZWN0cy_SAQA","guidislink":false,"published":"Tue, 05 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=5, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=339, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3JlbmV3YWJsZXdhdGNoLmluLzIwMjMvMTIvMDUvaW50ZXJ2aWV3LXdpdGgtci1wLWd1cHRhLXNlY2ktbG9va3MtZm9yd2FyZC10by1zZXR0aW5nLXVwLWl0cy1vd24tcmVuZXdhYmxlLWVuZXJneS1wcm9qZWN0cy_SAQA?oc=5\" target=\"_blank\">Interview with R.P. Gupta: “SECI looks forward to setting up its own renewable energy projects”<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Renewable Watch<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Interview with R.P. Gupta: “SECI looks forward to setting up its own renewable energy projects” - Renewable Watch","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3JlbmV3YWJsZXdhdGNoLmluLzIwMjMvMTIvMDUvaW50ZXJ2aWV3LXdpdGgtci1wLWd1cHRhLXNlY2ktbG9va3MtZm9yd2FyZC10by1zZXR0aW5nLXVwLWl0cy1vd24tcmVuZXdhYmxlLWVuZXJneS1wcm9qZWN0cy_SAQA?oc=5\" target=\"_blank\">Interview with R.P. Gupta: “SECI looks forward to setting up its own renewable energy projects”<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Renewable Watch<\/font>","source.href":"https:\/\/renewablewatch.in","source.title":"Renewable Watch","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Solar Energy Corporation of India Limited (SECI) has played a pivotal role in driving the uptake of renewable energy projects by proactively floating tenders. It has also adapted well to the changing times, transitioning from standalone solar and wind tenders to storage and hybrid tenders. Going forward, SECI plans to become an active player in the green hydrogen and pumped hydro storage space, and also venture into the commercial and industrial (C&I) segment. In an interview with Renewable Watch, R.P. Gupta, chairman and managing director, SECI, talks about the key achievements of SECI, its experience with innovative tenders and the targets for the future. Edited excerpts… What have been SECI’s key achievements over the past one year? Last year, in 2022-23, we awarded an aggregate capacity of around 3.3 GW, which consists of 1.7 GW of wind, 1.17 GW of hybrid and 500 MW of battery energy storage system capacity. In add­ition, we commissioned around 4.7 GW of pro­jects, with 2.5 GW of solar, 1 GW of wind and 1.2 GW of hybrid capacity, which we had previously awarded. Our trading volumes in 2022-23 increased by about 60 per cent over the previous year. We sold 35,000 MUs of electricity to discoms. In addition, we came out with an innovative tender of 500 MW\/1,000 MWh of standalone battery energy storage capacity. We also awarded over 39,000 MW of solar PV manufacturing capacity under the production-linked incentive (PLI) scheme of about Rs 130.37 billion. Overall, we have awarded about 60 GW of re­newable energy capacity, which roughly translates into Rs 2,700 billion of investment. Of this, around 20 GW has been commissio­ned. We are also pre­paring to venture into the hydrogen space, and have floated two tenders with a bid submission deadline of November 30, 2023. These are for ab­out 450,000 metric tonnes of hydrogen production capacity and 1.5 GW of electrolyser ma­nufacturing capacity. Further­more, we are tra­n­sitioning from standalone solar, wind and storage projects to hybrid, round-the-clock (RTC) and firm end despatchable renewable en­ergy projects. Going forward, renewable energy will be supplied as per the demand of discoms. With this, we will try to bridge the gap between th­ermal and renewable energy projects. What has been the recent experience with RTC and hybrid tenders? Our experience in the RTC space has been quite positive and the tariffs discovered have been reasonable. In view of the environmental costs associated with thermal energy, the rates of renewable RTC energy are very reasonable. This is important to bridge the gap between thermal and renewable energy as gradually the protections and support to renewable energy are expected to be reduced as the sector matures. The effort to bridge the gap between thermal and renewable energy also extends to des­pat­chability. We are hoping that emerging storage technologies and solar thermal technology will be promoted further. What are your views on the initial challenges faced by developers regarding tariff approvals and delays in signing of PSAs? What is the current status? Out of the 60 GW for which SECI has conducted bids, PSAs have been signed for about 50 GW capacity. As far as the remaining 10 GW is concerned, some of the capacity has been dropped for various reasons while efforts are being made to sell 5-6 GW of capacity. Earlier, renewable energy projects operated under the feed-in-tariff regime. The sector then transitioned to competitive bidding and now it is progressively moving towards the higher value chain. At every stage, the­re will be different challenges. These inclu­de challenges associated with the products and their implementation, challenges faced by discoms and developers, and re­gulatory issues. SECI addresses these ch­a­llenges proactively by coming up with innovative solutions. What is your outlook on tariffs discovered for solar and wind projects? Solar and wind tariffs depend on demand and supply trends, particularly solar module and turbine costs. As demand goes up, prices are likely to go up, and when supply goes up, prices tend to decline. It is a dynamic mix of various factors, particularly supply and demand. The other key factors include price fluctuations in China and domestic taxes. We need to ensure that tariffs do not go very high as this could pose problems for discoms. This further increases the gap between thermal and renewable energy costs. Thus, measures must be taken to address this. Do you think India will be able to meet its 2030 renewable energy targets? What can the industry stakeholders do to help achieve the targets? I believe that India will not only meet its targets but also surpass them. Fortu­na­te­ly, developers, solar PV manufacturers and other stakeholders are keen to contribute to India’s ambitious renewable energy targets. We will be able to meet the targets with their cooperation. We have previously achieved our Nationally Determined Contri­butions (NDCs) ahead of schedule and thus were able to set even more ambitious targets for 2030. The NDC targets are only up to 2030. We must look beyond this target because our ultimate aim is to achieve net-zero emissions by 2070. Overall, I am confident that India will be able to achieve its climate targets. What should the government do to address the issues prevalent in the renewable energy sector? The government has already done a lot in the renewable energy sector. It recently introduced the modified renewable purchase obligations (RPOs) with a significant change. Earlier, the state electricity regulatory commissions (SERCs) used to determine the targets, but now the RPOs will be determined by the centre. This is a positive step according to me as some of the SERCs were setting low targets. Now, there will be uniform targets for all states, and of course there will be a provision for them to purchase renewable energy certificates from other states that have ac­hieved their targets and exceeded them. This will promote flexibility. These are the market instruments that need to be further promoted. Going forward, tenders need to be floated as per the discom requirements to facilitate their gradual transition away from th­ermal energy. Moreover, now we have four renewable energy implementing agencies instead of just SECI. The government is also promoting hydrogen, pumped storage and other kinds of energy storage technologies. What is your take on the domestic manufacturing environment for solar components in India? India has already introduced two PLIs in this space. In fact, there are capacities coming up beyond PLI, with players confident that their products will be able to compete in the market without any financial support. What are SECI’s plans and targets for the near future? SECI has been introducing new products and will continue to do so. We are planning to introduce a new product next year that will be include solar thermal and storage. SECI looks forward to setting up its own renewable energy projects. It will set up pilot projects for technologies that are relatively new and have not yet gained market traction. Apart from solar and battery storage tenders, SECI will also float tenders for pumped hydro storage projects and other new storage technologies to test their viability. This includes exploring the use of green hydrogen as a storage solution and using surplus energy to convert it into hydrogen. Moreover, we are planning to venture into the commercial and industrial segment and trading on the power exchanges. In the C&I space, we do not aim to become a dominant player. Our main role will still be more of a developer and facilitator. We are committed to maintaining our role as a facilitator in the renewable energy market. Our other major activities of providing project management consultancy services to those interested in setting up their own projects would be strengthened further.","filter_flag":1}
{"title":"Ineos Inovyn Broadens PVC Product Portfolio with Expansion Initiative - ChemAnalyst","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5jaGVtYW5hbHlzdC5jb20vTmV3c0FuZERlYWxzL05ld3NEZXRhaWxzL2luZW9zLWlub3Z5bi1icm9hZGVucy1wdmMtcHJvZHVjdC1wb3J0Zm9saW8td2l0aC1leHBhbnNpb24taW5pdGlhdGl2ZS0yNDA2M9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5jaGVtYW5hbHlzdC5jb20vTmV3c0FuZERlYWxzL05ld3NEZXRhaWxzL2luZW9zLWlub3Z5bi1icm9hZGVucy1wdmMtcHJvZHVjdC1wb3J0Zm9saW8td2l0aC1leHBhbnNpb24taW5pdGlhdGl2ZS0yNDA2M9IBAA?oc=5","id":"CBMigAFodHRwczovL3d3dy5jaGVtYW5hbHlzdC5jb20vTmV3c0FuZERlYWxzL05ld3NEZXRhaWxzL2luZW9zLWlub3Z5bi1icm9hZGVucy1wdmMtcHJvZHVjdC1wb3J0Zm9saW8td2l0aC1leHBhbnNpb24taW5pdGlhdGl2ZS0yNDA2M9IBAA","guidislink":false,"published":"Thu, 21 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=355, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5jaGVtYW5hbHlzdC5jb20vTmV3c0FuZERlYWxzL05ld3NEZXRhaWxzL2luZW9zLWlub3Z5bi1icm9hZGVucy1wdmMtcHJvZHVjdC1wb3J0Zm9saW8td2l0aC1leHBhbnNpb24taW5pdGlhdGl2ZS0yNDA2M9IBAA?oc=5\" target=\"_blank\">Ineos Inovyn Broadens PVC Product Portfolio with Expansion Initiative<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ChemAnalyst<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Ineos Inovyn Broadens PVC Product Portfolio with Expansion Initiative - ChemAnalyst","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5jaGVtYW5hbHlzdC5jb20vTmV3c0FuZERlYWxzL05ld3NEZXRhaWxzL2luZW9zLWlub3Z5bi1icm9hZGVucy1wdmMtcHJvZHVjdC1wb3J0Zm9saW8td2l0aC1leHBhbnNpb24taW5pdGlhdGl2ZS0yNDA2M9IBAA?oc=5\" target=\"_blank\">Ineos Inovyn Broadens PVC Product Portfolio with Expansion Initiative<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ChemAnalyst<\/font>","source.href":"https:\/\/www.chemanalyst.com","source.title":"ChemAnalyst","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Ineos Inovyn Broadens PVC Product Portfolio with Expansion Initiative Ineos Inovyn, a prominent vinyl producer headquartered in the UK, has recently embarked on a significant expansion of its polyvinyl chloride (PVC) range, introducing new products characterized by substantially reduced carbon footprints and heightened recycled content. This strategic move underlines the company's unwavering commitment to environmental sustainability and aligns with the broader industry shift towards eco-friendly practices. A cornerstone of Ineos Inovyn's ambitious journey towards carbon neutrality is Biovyn, an innovative bio-attributed PVC that made its debut in the market in 2019. Positioned as a pivotal element in the company's sustainability initiatives, Biovyn holds the potential to evolve into a carbon-neutral and net-zero solution. Its versatility is evident in diverse applications across various sectors, ranging from automotive and construction to medical and fashion. In response to the imperative for reducing greenhouse gas (GHG) emissions by 2030, Ineos Inovyn introduces Neovyn, a novel PVC range distinguished by a substantially reduced carbon footprint. According to the company, Neovyn achieves an impressive 37% reduction compared to the European industry average for suspension PVC, translating to a lower carbon footprint of 1.3 kilograms CO2 per kilogram PVC. The production of Neovyn will draw on sustainable initiatives implemented by Ineos Inovyn, including improved access to renewable energy, process electrification, and the production and utilization of renewable hydrogen. Positioned as the new standard for low carbon footprints, Neovyn aims to empower converters to advance their carbon roadmaps by reducing scope 3 emissions and offering products with smaller carbon footprints. Running in parallel with Neovyn, Ineos Inovyn introduces Recovyn, a product line meticulously designed to enhance recycling and circularity while minimizing non-mechanically recycled plastic waste. Comprising 100% recycled carbon feedstock, Recovyn caters to customers seeking to augment their recycled content while meeting stringent technical, quality, and regulatory requirements. The adaptability and versatility of Recovyn, Biovyn, and Neovyn are underscored by Ineos Inovyn, emphasizing their potential as drop-in solutions. These products undergo rigorous certification processes by independent third-party organizations such as the Roundtable on Sustainable Biomaterials (RSB) and the International Sustainability and Carbon Certification Plus (ISCC Plus), providing assurance of their sustainability credentials. Arnaud Valenduc, Business Director at Ineos Inovyn, articulates the company's commitment to maintaining industry leadership by continually introducing innovative products that respond to the urgent need for emission reduction and circularity. This commitment aligns seamlessly with the broader industry trajectory towards a sustainable and net-zero economy, showcasing Ineos Inovyn's proactive role in driving positive change on a global scale. The company's dedication to environmental stewardship and forward-thinking solutions positions it as a trailblazer in the pursuit of a more sustainable and eco-conscious future.","filter_flag":1}
{"title":"How did the top smartphone makers fare in sustainability in 2023? - Rappler","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnJhcHBsZXIuY29tL3RlY2hub2xvZ3kvZmVhdHVyZXMvc21hcnRwaG9uZS1icmFuZHMtbWFrZXJzLXN1c3RhaW5hYmlsaXR5LXJlcG9ydHMtMjAyMy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnJhcHBsZXIuY29tL3RlY2hub2xvZ3kvZmVhdHVyZXMvc21hcnRwaG9uZS1icmFuZHMtbWFrZXJzLXN1c3RhaW5hYmlsaXR5LXJlcG9ydHMtMjAyMy_SAQA?oc=5","id":"CBMiYWh0dHBzOi8vd3d3LnJhcHBsZXIuY29tL3RlY2hub2xvZ3kvZmVhdHVyZXMvc21hcnRwaG9uZS1icmFuZHMtbWFrZXJzLXN1c3RhaW5hYmlsaXR5LXJlcG9ydHMtMjAyMy_SAQA","guidislink":false,"published":"Fri, 22 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=356, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnJhcHBsZXIuY29tL3RlY2hub2xvZ3kvZmVhdHVyZXMvc21hcnRwaG9uZS1icmFuZHMtbWFrZXJzLXN1c3RhaW5hYmlsaXR5LXJlcG9ydHMtMjAyMy_SAQA?oc=5\" target=\"_blank\">How did the top smartphone makers fare in sustainability in 2023?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Rappler<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How did the top smartphone makers fare in sustainability in 2023? - Rappler","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnJhcHBsZXIuY29tL3RlY2hub2xvZ3kvZmVhdHVyZXMvc21hcnRwaG9uZS1icmFuZHMtbWFrZXJzLXN1c3RhaW5hYmlsaXR5LXJlcG9ydHMtMjAyMy_SAQA?oc=5\" target=\"_blank\">How did the top smartphone makers fare in sustainability in 2023?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Rappler<\/font>","source.href":"https:\/\/www.rappler.com","source.title":"Rappler","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"This is AI generated summarization, which may have errors. For context, always refer to the full article. According to an Alibaba study, in the Philippines, up to 89% of consumers desire sustainable lifestyles, making tech brands' green efforts more important than ever MANILA, Philippines – Smartphones are the most common and ubiquitous consumer electronics device today, estimated to have more than 4.5 billion users in 2022. These devices consume a lot of energy and resources to make, generating over 146 million tons of carbon dioxide or equivalent emissions, according to financial advisory group Deloitte’s estimates in 2022. It’s actually a tiny fraction of the 36.8 gigatons of emissions produced in 2022, but as Deloitte notes, “it is still worth trying to reduce.” Where is the carbon or equivalent emission produced in the life of a phone? In 2022 estimates, about 83% is said to come from the manufacture, shipping, first-year usage of new smartphones, while about 11% comes from the usage of existing phones, 4% comes from refurbishing old phones, and another 1% is from recycling processes. What does this tell us? A new smartphone purchase has a bigger carbon cost than extending one’s usage of an existing phone. As it stands, the standard practice among almost, if not all, smartphone manufacturers is to release new models on an annual basis. That’s the current pace of this business, which is designed to push you to upgrade sooner rather than later. There have been some evidence, however, that people are holding on to their phones longer, partly due to seemingly more minor annual improvements. Apple, earlier this year, was also investigated by France over accusations of planned obsolescence. The EU is legislating for replaceable batteries in phones, while the Biden administration in the US has pushed for more robust right-to-repair laws. All of these actions may potentially lengthen phone ownership. But even amid shifting buyer trends spurred partly by the lack of significant improvements, and government-led initiatives to extend smartphone usefulness, smartphone manufacturers aren’t likely to shift release cycles anytime soon. New products, at least for the foreseeable future, will continue to come out annually. As informed consumers, we can choose to not immediately latch on to the shiny new thing, especially if the year-to-year improvement isn’t that striking. But if it’s really time to upgrade, let’s take a look at which brand has the greenest processes, based on the latest versions of their sustainability reports, and other press-issued statements. Apple Apple has long been viewed as a leader in environmental standards, and the tech giant has never been shy to incorporate its progress in these initiatives to its product marketing. At its annual September launch event, the iPhone-maker aired a five-minute sketch, where CEO Tim Cook, among other employees, held a meeting with a personified Mother Nature, played by Hollywood actor Octavia Spencer. In that meeting, Cook and company try to win over Mother Nature’s heart by sharing with her a report of the progress the company has made on its sustainability objectives. The video is, of course, meant to tout how this year’s Watch models reportedly carry the carbon neutral branding, with the company aiming to do the same for all of its products by 2030. The sketch drew mixed reactions from the public. Some called it out for how it used climate initiatives to sell products, while others simply didn’t find it entertaining at all. For this list, however, the focus will be on the iPhone. As mentioned previously, manufacturing smartphones is energy- and resource-intensive, creating a lot of emissions that impact the environment. Last year’s iPhone 14 Pro, for instance, emits 65 kg of carbon dioxide into the atmosphere during its lifecycle, according to Apple. No less than 81% of those emissions occur during the manufacturing process, which covers the extraction of raw materials, the manufacturing of the device itself and transport, to name a few steps. This year’s iPhone 15 Pro, in comparison, emits 66 kg of carbon dioxide, one kilogram higher than the iPhone 14 Pro’s emissions. Apple, however, notes that the 15 Pro’s emissions would have been 26 kg higher if not for the use of more recycled materials and clean energy solutions. Still, it’s not a move towards a lower number, so it’s tough to argue that the iPhone moved the needle this year in terms of green efforts. What might be worth mentioning is that Apple debuted USB-C connectivity on this year’s iPhone generation, the iPhone 15. While it can be argued that the European Union’s common charger legislation forced the company’s hand, the change still marks a significant contribution towards lessening e-waste. With iPhones now sporting a USB-C port, you’ll be able to use the cables and adapters you might already have to charge your device. Making the USB-C as standard across all devices is estimated to save at least 11,000 tons of e-waste annually. Xiaomi Xiaomi is similarly taking action to reduce its carbon emissions, adopting what it calls its Zero-Carbon Philosophy to reach its goals. This plan was reportedly rolled out in phases, and spans different aspects of the Chinese electronics giant’s operations. The first phase, which was set in 2021, involved Xiaomi lowering carbon emissions of its main headquarters, targeting a 4.5% decrease by 2026 versus its 2020 figure. But in just two years, the company says it has already managed to surpass its target, recording a 21.12% reduction in per capita carbon emissions compared to the 2021 baseline. The company has also touted new, more energy-efficient technologies in its products. In the past year, for example, it said it has developed a more energy-efficient 5G and signal transmission solution, reducing the power consumption of the company’s smartphones by up to 30% compared with the previous generation. Another notable effort is the development of a new, more energy-efficient display technology, which reduces the energy consumption of devices by up to 70% in specific applications. Xiaomi also promotes a circular economy, anchored by a refurbishing system that renews discarded devices. The company claims that within the past year, it has refurbished about 94,000 smartphones, all of which were later sold again as certified refurbished products. Other green initiatives include the use of wear-resistant ceramic materials and synthetic silicone in smartphones, the adoption of eco-friendly packaging with less paper and plastic, and the development of a recycling system that finds new use for e-waste. Honor HONOR 90 5G Honor in 2023 published its first-ever Environmental, Social and Governance Report, where it outlined its goal to reduce its carbon emissions by 88%, achieve 100% use of renewable energy, and reach carbon neutral operations by 2045. As part of that sustainability commitment, the former Huawei sub-brand is overhauling its product development lifecycle. For example, it has reportedly reduced its use of hazardous substances and materials by 3,861 tons and recycled more than 1,785 tons of e-waste. Additionally, 98% of the materials used in the packaging of the Magic V foldable smartphone are non-plastic. On the production side, automated technology is reportedly employed to reduce energy and resource consumption. These efforts, according to Honor, puts it on track to reach its goal to reach carbon neutral operations by 2045. realme Realme in 2023 reaffirmed its commitment to its “Sustainability Vision” initiative, which involves cutting 50% of its carbon emissions from its popular GT smartphone series within five years. The initiative, which was announced in 2022, has the Chinese brand try to minimize its carbon footprint as much as it can throughout the whole smartphone cycle, from design to manufacturing to recycling. In its sustainability report, Realme highlighted three important approaches it’s taking as part of the initiative. First, it’s extending the lifespan of its products by adopting a more modular design and improving after-sales services. Second, it’s adopting stricter standards around hazardous substance control to reduce the environmental impact of the disposal of its smartphones. Last, it has set up a recycling system and a trade-in business to take in discarded smartphones, preventing them from ending up in a landfill. Realme also touted that its 2022 flagship, the Realme GT2 Pro, is the world’s first TCO 9.0 certified smartphone. TCO 9.0 is a certification given to IT products that fulfill a certain criteria for sustainability. The GT2 Pro features a biopolymer rear panel, which supposedly decreases carbon emissions from its manufacturing by 35.5%. The material also creates up to two kilograms less carbon emissions for every kilogram made versus petroleum. OPPO Similar to the other companies on this list, OPPO also has its own commitment to sustainability that covers the optimization of smartphones’ lifecycles and the use of eco-friendly materials in manufacturing, among others. What’s a bit different with the company’s approach, however, is it’s also getting like-minded individuals involved in its low-carbon development roadmap. In 2022, OPPO launched the Inspiration Challenge, which called on tech professionals and entrepreneurs to submit their ideas for tech innovations. Winning ideas were awarded a grant and technical support from the company. This year, OPPO brought back the challenge, featuring two categories: “Inspiration for People” and “Inspiration for the Planet”. The latter, of course, focuses on solutions that promote green technology as applied to consumer electronics. Among the winners was Estonia-based startup Woola’s packaging solution for the OPPO Watch, made from recycled wool. Each of the five winners received a grant of $50,000 as well as opportunities to collaborate with OPPO and its partners to further develop their ideas. OPPO was also recognized by Time in 2023 for its Zero-Power Tag, a tracking device that sends out temperature or location data without using a battery. The lightweight prototype uses ambient energy sources like radio waves and heat to power it, negating the need for a lithium ion battery, which are harmful to the environment and eventually end up in landfills. The company said it’s refining the tracker to expand its feature set and perhaps apply it to other smaller devices. Samsung Samsung claims that 2023’s S23 models are its “most sustainable phones yet.” The South Korean electronics giant touted the devices’ are UL ECOLOGO-certified for reduced environmental and health impact. Furthermore, the Galaxy S23 Ultra is said to be made up of 12 internal and external components of recycled material, up from the Galaxy S22 Ultra’s six. The materials include recycled aluminum and glass as well as recycled plastics sourced from discarded fishing nets and water barrels. All the materials for the packaging are also sustainably sourced. While it’s nice to hear about an uptick in usage of recycled materials, the overall impact is not clear at the moment. In addition, Samsung promised to deliver up to four generations of OS updates and five years of security updates for the S23 series. This promise should help prolong the life of your device and let you use it longer without it feeling outdated. Samsung said it’s also made strides towards its New Environmental Strategy, which is the company’s roadmap to reach net zero at the Device eXperience (DX) Division by 2030 and at the company level including the Device Solutions (DS) Division by 2050. The DX division covers the company’s smartphone and home appliance businesses. Among those strides is the increase in use of renewable energy by 65% compared to the previous year, reaching 8,704 gigawatt hours. In line with this, all of DX division’s offices in Korea as well as manufacturing plants in Vietnam, India, and Brazil have reportedly transitioned to 100% renewable energy, following the same transition in the company’s US, Europe, and China offices in 2020. In its annual sustainability report, the company said its efforts in 2022 produced a total sustainability value equivalent to about $88.9 billion. However, in 2023, it’s expecting that value to decline, citing “global economic recession and industry stagnation” as major factors. It said, though, that this decline won’t stop it from investing in environmental management initiatives in semiconductor process gas reduction and water resource preservation, among others. Samsung in 2023 also launched its Sustainability Website, showing key data on its progress towards its net zero goals and details on its sustainability-related initiatives. The website, which covers a range of topics, helps the company disclose the relevant information in a transparent and easy-to-digest fashion. Fairphone Play Video It’s not a household name but when it comes to sustainability, there’s arguably no other brand that has stronger credentials than the Fairphone. This is why the Dutch cooperative has found itself on this list. In 2023, it released the Fairphone 4, a modern smartphone designed in such a way that you can repair yourself from the comfort of your home. A lot of that repairability comes from the device’s modular design. Its rear panel can, for instance, be unclipped without any tools, while the battery can easily be replaced using your standard screwdriver. Fairphone also said that the device is manufactured from fair trade gold and silver and ethically sourced aluminum and tungsten as well as recycled metals and plastic. The brand has also committed to recycling the equivalent volume of electronics per device sold. While some of the aforementioned smartphone manufacturers above also have recycling practices and promote repairability, none of them have gone to the lengths Fairphone has. So in this regard, it deserves some form of recognition, despite the fact that it’s not as readily available as most other phone brands here. Huawei Huawei has its “Tech for a Better Planet” planet pledge that focuses on “advancing energy conservation and emissions reduction, promoting renewable energy, and contributing to a circular economy.” The company said that the average energy efficiency of their main products in 2022, when its last green report was published, has increased 2.1 times compared with 2019. For their manufacturing processes, Huawei said their use of a digital energy monitoring system that manages power consumption on production lines, and upgrades towards more efficient machines have led to energy savings of 19.67 million kWh throughout 2022, or the equivalent of 11,218 tons of emissions. Like many brands, they tout the use of lightweight packaging, minimize plastic use, and promote reuse of packaging materials. Huawei said in its sustainability report, “The longer a product’s lifecycle, the smaller its impact on the environment.” To that end, they promised “easy” upgrades for their Harmony OS “over the long term.” They touted a smooth user experience across all devices, even providing upgrade services down to their older phones such as the Mate 9 series released way back in 2016. “The OS makes it possible for users to revive old models from many years ago,” Huawei said. The company also said it has a global recycling system wherein they work with scrap providers to reuse raw materials for use in refurbishing devices. The program has so far led to 600,000 sold refurbished devices, including phones. vivo In its sustainability report, Vivo touts the thinness of their products as a way to reduce materials use. For examples, their S series phones’ components have become thinner by 15 to 30%, resulting in not just a lighter product for the user, but slightly for the environment as well. The company also said that they’ve made their packaging lighter over the years, citing a reduction of about 18 grams for some models. “For every 10 million mobile phones, the reduction is equivalent to saving the use of 180 tons of paper,” vivo said. In their Y series phones, 50% of the fibers in their packaging materials come from recycling, with the company saying they’re aiming for a higher percentage gradually. They’ve lowered the use of plastics in earphone and data cable cases too by 17.5% and 6.7% respectively. For everyday use, the company highlighted how they make their phones more energy efficient for it to last longer. “To the best of our ability, we use electronic components with higher energy efficiency, and use intelligent algorithms to intelligently adjust device performance according to users’ usage scenarios and application needs,” it said. Making their devices tougher will extend product life too, said vivo, explaining how the rate of display modules cracking has been reduced by 70%. Assessing sustainability It’s worth assessing the sustainability efforts of these smartphone giants each year as there’s reportedly a growing number of consumers who are seeking eco-friendly products to support sustainable lifestyles. In the Philippines, up to 89% of consumers desire sustainable lifestyles but find it difficult due to inconvenience and high costs, according to an Alibaba Group study. Those are the two major factors that are stopping them from changing their shopping behaviors in this aspect. With regards to the smartphone industry, there are steps being taken to address both inconvenience and costs in support of sustainability, led by the EU with its new rules on USB-C standardization, battery replaceability, and right-to-repair laws. Such regulations can help solve the two aforementioned challenges stopping consumers leading sustainable lifestyles, allowing them to hold onto their devices for longer, which saves them from repair fees or the cost of a new device. Would these changes offset the smartphone industry’s impact on the environment? Alone, perhaps not. However, when factored in with the other initiatives that companies like Apple, Samsung, and Xioami, to name a few, are rolling out behind the scenes as well as the EU’s other regulatory efforts, there’s a strong potential to turn the smartphone value chain green. – Rappler.com","filter_flag":1}
{"title":"SolaX Power & LUBI Electronics Signed Strategic Partnership Agreement for India Market - SolarQuarter","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzEyLzA1L3NvbGF4LXBvd2VyLWx1YmktZWxlY3Ryb25pY3Mtc2lnbmVkLXN0cmF0ZWdpYy1wYXJ0bmVyc2hpcC1hZ3JlZW1lbnQtZm9yLWluZGlhLW1hcmtldC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzEyLzA1L3NvbGF4LXBvd2VyLWx1YmktZWxlY3Ryb25pY3Mtc2lnbmVkLXN0cmF0ZWdpYy1wYXJ0bmVyc2hpcC1hZ3JlZW1lbnQtZm9yLWluZGlhLW1hcmtldC_SAQA?oc=5","id":"CBMieWh0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzEyLzA1L3NvbGF4LXBvd2VyLWx1YmktZWxlY3Ryb25pY3Mtc2lnbmVkLXN0cmF0ZWdpYy1wYXJ0bmVyc2hpcC1hZ3JlZW1lbnQtZm9yLWluZGlhLW1hcmtldC_SAQA","guidislink":false,"published":"Tue, 05 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=5, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=339, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzEyLzA1L3NvbGF4LXBvd2VyLWx1YmktZWxlY3Ryb25pY3Mtc2lnbmVkLXN0cmF0ZWdpYy1wYXJ0bmVyc2hpcC1hZ3JlZW1lbnQtZm9yLWluZGlhLW1hcmtldC_SAQA?oc=5\" target=\"_blank\">SolaX Power & LUBI Electronics Signed Strategic Partnership Agreement for India Market<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SolarQuarter<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"SolaX Power & LUBI Electronics Signed Strategic Partnership Agreement for India Market - SolarQuarter","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzEyLzA1L3NvbGF4LXBvd2VyLWx1YmktZWxlY3Ryb25pY3Mtc2lnbmVkLXN0cmF0ZWdpYy1wYXJ0bmVyc2hpcC1hZ3JlZW1lbnQtZm9yLWluZGlhLW1hcmtldC_SAQA?oc=5\" target=\"_blank\">SolaX Power & LUBI Electronics Signed Strategic Partnership Agreement for India Market<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SolarQuarter<\/font>","source.href":"https:\/\/solarquarter.com","source.title":"SolarQuarter","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"SolaX, a global supplier of solar inverters and energy storage solutions, is pleased to announce a strategic partnership with LUBI Electronics, a prominent name in the Indian electronics industry. This groundbreaking collaboration positions LUBI Electronics as a new distributor for SolaX products across PAN India, fortifying both companies’ commitment to advancing renewable energy initiatives in the region. The partnership with LUBI Electronics marks a strategic move to expand SolaX’s footprint in one of the world’s most promising solar markets. Renowned for its innovative solar solutions, SolaX has earned global acclaim for delivering high-performance, reliable, and cost-effective products. LUBI Electronics, with its decades-long legacy and extensive market presence, is poised to leverage its distribution prowess to make SolaX’s advanced solar technology accessible to a broader consumer base across India. Speaking on the occasion, Mr. Vipin Bhardwaj, the Country Manager of SolaX Power India, expressed his enthusiasm about the collaboration, stating, “We are delighted to partner with LUBI Electronics, a company with a strong presence and reputation in the Indian market. This collaboration aligns with our vision of making clean and renewable energy accessible to all. Together with LUBI Electronics, we aim to contribute significantly to India’s solar revolution.” As India looks towards a future powered by renewable energy, the partnership between SolaX Power and LUBI Electronics stands as a beacon of innovation, bringing efficient and reliable solar solutions to the doorstep of millions across the country. Like this: Like Loading...","filter_flag":1}
{"title":"Rab updates to Gore-Tex ePE membrane - Innovation in Textiles","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3Lmlubm92YXRpb25pbnRleHRpbGVzLmNvbS9yYWItdXBkYXRlcy10by1nb3JldGV4LWVwZS1tZW1icmFuZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3Lmlubm92YXRpb25pbnRleHRpbGVzLmNvbS9yYWItdXBkYXRlcy10by1nb3JldGV4LWVwZS1tZW1icmFuZS_SAQA?oc=5","id":"CBMiSWh0dHBzOi8vd3d3Lmlubm92YXRpb25pbnRleHRpbGVzLmNvbS9yYWItdXBkYXRlcy10by1nb3JldGV4LWVwZS1tZW1icmFuZS_SAQA","guidislink":false,"published":"Mon, 18 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=18, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=352, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3Lmlubm92YXRpb25pbnRleHRpbGVzLmNvbS9yYWItdXBkYXRlcy10by1nb3JldGV4LWVwZS1tZW1icmFuZS_SAQA?oc=5\" target=\"_blank\">Rab updates to Gore-Tex ePE membrane<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Innovation in Textiles<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Rab updates to Gore-Tex ePE membrane - Innovation in Textiles","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3Lmlubm92YXRpb25pbnRleHRpbGVzLmNvbS9yYWItdXBkYXRlcy10by1nb3JldGV4LWVwZS1tZW1icmFuZS_SAQA?oc=5\" target=\"_blank\">Rab updates to Gore-Tex ePE membrane<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Innovation in Textiles<\/font>","source.href":"https:\/\/www.innovationintextiles.com","source.title":"Innovation in Textiles","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"British outdoor brand Rab has updated its Autumn\/Winter 2023 waterproof Gore-Tex glove collection, replacing the former membrane with Gore’s new ePE membrane, which is free of fluorocarbons of environmental concern (PFC-free). The new membrane is used both in Rab’s existing Gore-Tex gloves as well as in its new Khroma Tour GTX gloves. Khroma Tour GTX offer warmth and dexterity and are built with recycled PrimaLoft Gold insulation. Also featuring Gore-Tex Active, they’re windproof and breathable and their soft, grippy Pittards Armor-Tan leather is exceptionally durable, abrasion-resistant and externally seamed on the palm to provide dexterity where needed. Data shows that Gore-Tex ePE membranes have a lower carbon impact than their predecessors, while offering comparable performance. At the same time, the membrane is lighter and softer, enhancing overall comfort. Fluorocarbons, often referred to as PFAS, are a category of synthetic chemicals that are used to make man-made products waterproof. The most frequently referred to are PFCs which have commonly been used in DWR finishes. When it comes to clothing, adding PFCs to a fabric means water beads on its surface and rolls off, rather than being absorbed. However, although these substances do not occur naturally in nature, they can now be detected everywhere on earth. This has a negative impact on the environment, especially since the substances do not degrade on their own. Research has shown that the substances accumulate not only in nature, but also in the human body. Rab’s Material Facts tables, launched in Autumn\/Winter 2023 for all Rab apparel and sleeping bags, transparently indicate where fluorocarbons are still in use. For Autumn\/Winter 2024, these tables will also be available for equipment, packs and accessories, and will include detailed information on the percentage of renewable energy used in the production process. Apart from incorporating the new Gore-Tex ePE membrane in its waterproof glove collection, Rab also utilises it in its Namche GTX Jacket. For Autumn\/Winter 2024, the membrane will additionally be featured in Rab’s new Khroma Converge jackets and pants designed for skiing. To ensure optimal performance, waterproofing and resistance to dirt, Rab encourages consumers to regularly maintain and wash their waterproof items, particularly as these are updated to fluorocarbon-free membrane alternatives. The Rab Service Centre provides professional wash services as well as care and repair tutorials aimed at prolonging garment lifespan and maximizing performance longevity. www.gore-tex.com","filter_flag":1}
{"title":"First PHL offshore wind project cleared for green lane treatment - BusinessWorld Online","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LmJ3b3JsZG9ubGluZS5jb20vZWNvbm9teS8yMDIzLzEyLzIxLzU2NTIwNy9maXJzdC1waGwtb2Zmc2hvcmUtd2luZC1wcm9qZWN0LWNsZWFyZWQtZm9yLWdyZWVuLWxhbmUtdHJlYXRtZW50L9IBfGh0dHBzOi8vd3d3LmJ3b3JsZG9ubGluZS5jb20vZWNvbm9teS8yMDIzLzEyLzIxLzU2NTIwNy9maXJzdC1waGwtb2Zmc2hvcmUtd2luZC1wcm9qZWN0LWNsZWFyZWQtZm9yLWdyZWVuLWxhbmUtdHJlYXRtZW50Lz9hbXA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LmJ3b3JsZG9ubGluZS5jb20vZWNvbm9teS8yMDIzLzEyLzIxLzU2NTIwNy9maXJzdC1waGwtb2Zmc2hvcmUtd2luZC1wcm9qZWN0LWNsZWFyZWQtZm9yLWdyZWVuLWxhbmUtdHJlYXRtZW50L9IBfGh0dHBzOi8vd3d3LmJ3b3JsZG9ubGluZS5jb20vZWNvbm9teS8yMDIzLzEyLzIxLzU2NTIwNy9maXJzdC1waGwtb2Zmc2hvcmUtd2luZC1wcm9qZWN0LWNsZWFyZWQtZm9yLWdyZWVuLWxhbmUtdHJlYXRtZW50Lz9hbXA?oc=5","id":"CBMieGh0dHBzOi8vd3d3LmJ3b3JsZG9ubGluZS5jb20vZWNvbm9teS8yMDIzLzEyLzIxLzU2NTIwNy9maXJzdC1waGwtb2Zmc2hvcmUtd2luZC1wcm9qZWN0LWNsZWFyZWQtZm9yLWdyZWVuLWxhbmUtdHJlYXRtZW50L9IBfGh0dHBzOi8vd3d3LmJ3b3JsZG9ubGluZS5jb20vZWNvbm9teS8yMDIzLzEyLzIxLzU2NTIwNy9maXJzdC1waGwtb2Zmc2hvcmUtd2luZC1wcm9qZWN0LWNsZWFyZWQtZm9yLWdyZWVuLWxhbmUtdHJlYXRtZW50Lz9hbXA","guidislink":false,"published":"Thu, 21 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=355, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LmJ3b3JsZG9ubGluZS5jb20vZWNvbm9teS8yMDIzLzEyLzIxLzU2NTIwNy9maXJzdC1waGwtb2Zmc2hvcmUtd2luZC1wcm9qZWN0LWNsZWFyZWQtZm9yLWdyZWVuLWxhbmUtdHJlYXRtZW50L9IBfGh0dHBzOi8vd3d3LmJ3b3JsZG9ubGluZS5jb20vZWNvbm9teS8yMDIzLzEyLzIxLzU2NTIwNy9maXJzdC1waGwtb2Zmc2hvcmUtd2luZC1wcm9qZWN0LWNsZWFyZWQtZm9yLWdyZWVuLWxhbmUtdHJlYXRtZW50Lz9hbXA?oc=5\" target=\"_blank\">First PHL offshore wind project cleared for green lane treatment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BusinessWorld Online<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"First PHL offshore wind project cleared for green lane treatment - BusinessWorld Online","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LmJ3b3JsZG9ubGluZS5jb20vZWNvbm9teS8yMDIzLzEyLzIxLzU2NTIwNy9maXJzdC1waGwtb2Zmc2hvcmUtd2luZC1wcm9qZWN0LWNsZWFyZWQtZm9yLWdyZWVuLWxhbmUtdHJlYXRtZW50L9IBfGh0dHBzOi8vd3d3LmJ3b3JsZG9ubGluZS5jb20vZWNvbm9teS8yMDIzLzEyLzIxLzU2NTIwNy9maXJzdC1waGwtb2Zmc2hvcmUtd2luZC1wcm9qZWN0LWNsZWFyZWQtZm9yLWdyZWVuLWxhbmUtdHJlYXRtZW50Lz9hbXA?oc=5\" target=\"_blank\">First PHL offshore wind project cleared for green lane treatment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BusinessWorld Online<\/font>","source.href":"https:\/\/www.bworldonline.com","source.title":"BusinessWorld Online","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"THE Board of Investments (BoI) has endorsed the Philippines’ first offshore wind project, which is estimated to cost P81.68 billion, for green lane services, which will entitle the project to expedited processing of permits and licenses. In a statement, BoI said it issued a certificate of endorsement to Ivisan Windkraft Corp. for its 450-megawatt Frontera Bay Wind Power Project off Cavite. “We endeavor to develop the offshore wind industry value chain in the Philippines and invite global offshore wind industry players to choose the Philippines as their hub in Southeast Asia,” Trade Undersecretary and BoI Managing Head Ceferino S. Rodolfo said. The BoI said that the project will help the country achieving its target of producing 15.3 gigawatts of clean energy by 2030 under the Philippine Development Plan. “These offshore wind turbines can also become a new tourist attraction especially when the proposed bridge linking Cavite and Bataan is finished,” it said. “The project is fully aligned with the administration’s goal of operating offshore wind turbines by 2028,” it added. The project is expected to create 2,700 local jobs in its pre-development, development, and operational phases. It will also provide training and development to neighboring communities. “What we want to show is that the offshore wind industry has Filipinos around the world working as engineers, mariners, etc. Developing the ecosystem in the country aligns with our goals of bringing overseas Filipino workers home and investing in the capabilities of the Filipinos,” said Theo Sunico, vice-president of Ivisan Windkraft. The Philippines has potential offshore wind resources of 178 gigawatts, with large parts of the coast having wind that can power turbines, the BoI said. The Ivisan wind project is one of 22 projects endorsed by BoI for green lane processing, which projects deemed strategic are eligible for. Of the total projects endorsed, 15 are in the renewable energy sector. The remaining projects involve food security (2), manufacturing of new products or new technology (2), and digital infrastructure (3). — Justine Irish D. Tabile","filter_flag":1}
