{"title":"Standardised packaging could save up to 0.8 million tonnes of plastic waste","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce16673463eb761cb20aec5a5a8&url=https%3a%2f%2ffinance.yahoo.com%2fnews%2fstandardised-packaging-could-save-0-121738357.html&c=18171147940906423423&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce16673463eb761cb20aec5a5a8&url=https%3a%2f%2ffinance.yahoo.com%2fnews%2fstandardised-packaging-could-save-0-121738357.html&c=18171147940906423423&mkt=en-us","summary":"Extending the existing Plastic Packaging Tax (PPT), which mandates a minimum recycled content percentage in plastic packaging, could significantly boost recycling rates. Biffa suggests increasing the ...","published":"Mon, 24 Jun 2024 05:17:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=24, tm_hour=5, tm_min=17, tm_sec=0, tm_wday=0, tm_yday=176, tm_isdst=0)","news_source":"YAHOO!Finance","news_image":"http:\/\/www.bing.com\/th?id=OVFT.aV9_VlB_J4rMYR_Bwmz75S&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700,"news_imagemaxheight":393,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Standardised packaging could save up to 0.8 million tonnes of plastic waste","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Extending the existing Plastic Packaging Tax (PPT), which mandates a minimum recycled content percentage in plastic packaging, could significantly boost recycling rates. Biffa suggests increasing the ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Sustainable waste management\" \"new products\"&format=rss","text":"A new report by sustainable waste management company Biffa highlights significant opportunities to reduce plastic packaging waste in the UK. The report, titled 'The UK Journey to Circularity', outlines a nine-point plan with achievable timelines for businesses, consumers, and the government. Standardisation of packaging materials across the country emerges as the largest potential contributor, with Biffa estimating that via adopting this, up to 0.8 million tonnes of plastic waste could be diverted from landfills by 2029. This process would involve designing products for easier recycling by using consistent materials throughout. Specifically, clear caps reduce contamination in recycled high-density polyethylene plastic, allowing bottles and caps to be recycled together into new products. The report acknowledges the role of government legislation in achieving the targets. Extending the existing Plastic Packaging Tax (PPT), which mandates a minimum recycled content percentage in plastic packaging, could significantly boost recycling rates. Biffa suggests increasing the mandated recycled content from the current estimated 40% to 75%, potentially saving an additional 0.5 to 0.75 million tonnes of plastic waste. Beyond standardisation and legislation, Biffa's plan explores other interventions: Shift towards reusable packaging: This could divert an estimated 0.13 million tonnes of waste from landfills. 'Consumer pays' schemes: Consumers paying for disposal services could incentivise responsible waste management, potentially recovering 0.35 million tonnes of waste. Investment in non-mechanical recycling technologies: New technologies could handle complex plastics that are currently unrecyclable, potentially saving another 0.35 million tonnes. Achieving these ambitious goals requires a multipronged approach, according to Carla Brian, head of Biffa Project Partnerships. “Requirements for new infrastructure are necessary but hinge on when, and to what extent, changes in the supply chain are made. Efforts to make plastic packaging more circular could simplify (with standardisation, for example) or lessen the burden on existing waste management infrastructure,” said Brian. Legislation plays a crucial role. Upcoming initiatives such as Simpler Recycling will lay the groundwork for a more circular economy while future legislation can further accelerate this progress. Overlapping policies, including deposit return schemes and extended producer responsibility, can achieve similar goals if implemented effectively. Educating businesses and consumers is also paramount. Story continues Highlighting the environmental, financial, and societal benefits of a circular economy can help drive behavioural change. Businesses already responsive to consumer demand for sustainable products and services will likely adapt faster to these changes. Finally, investment beyond infrastructure is essential. Funding research, development, and demonstration projects will help identify and validate best practices in circularity, paving the way for a more sustainable future. \"Standardised packaging could save up to 0.8 million tonnes of plastic waste \" was originally created and published by Packaging Gateway, a GlobalData owned brand. The information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.","filter_flag":1}
{"title":"How Tata Steel is leading sustainability in the steel sector","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce16673463eb761cb20aec5a5a8&url=https%3a%2f%2favenuemail.in%2fhow-tata-steel-is-leading-sustainability-in-the-steel-sector%2f&c=5405140777589256373&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce16673463eb761cb20aec5a5a8&url=https%3a%2f%2favenuemail.in%2fhow-tata-steel-is-leading-sustainability-in-the-steel-sector%2f&c=5405140777589256373&mkt=en-us","summary":"As a responsible and trusted corporate citizen with a brand name that is recognised and respected within and beyond India’s border, Tata Steel has for the last more than a decade successfully embarked ...","published":"Sun, 23 Jun 2024 05:59:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=23, tm_hour=5, tm_min=59, tm_sec=0, tm_wday=6, tm_yday=175, tm_isdst=0)","news_source":"avenuemail.in","news_image":"http:\/\/www.bing.com\/th?id=OVFT.zK9k7ZygrjX593YfuPbYJC&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700,"news_imagemaxheight":365,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How Tata Steel is leading sustainability in the steel sector","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"As a responsible and trusted corporate citizen with a brand name that is recognised and respected within and beyond India’s border, Tata Steel has for the last more than a decade successfully embarked ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Sustainable waste management\" \"new products\"&format=rss","text":"Advertisements June is being observed as Sustainability Month across locations of Tata Steel Steel sector today, both globally and in India is being closely watched by sustainability advocates for its role in building an environmentally responsible ecosystem that not only continues to produce the world’s favourite alloy but one that does not leave behind any unwanted residue that could pollute the air, water, or earth. As an energy and other resources intensive sector, the sustainability challenge faced by the steel sector is no ordinary one and demands a fundamental shift in how it has been operating for decades now. It is in this context that Tata Steel, India’s oldest steel maker and one with a global footprint is fast emerging as a leader in sustainability too. As a responsible and trusted corporate citizen with a brand name that is recognised and respected within and beyond India’s border, Tata Steel has for the last more than a decade successfully embarked on a remarkable sustainability journey that is setting new benchmarks on a wide range of environmental parameters not only for its own operations but also for others to emulate too. In an effort to minimise its carbon footprint and pivot towards sustainable practices, Tata Steel is committed to the Tata Group’s stated objective of achieving Net Zero emissions by 2045 as part of the group-wide Project Aalingana. As we celebrate the Sustainability Month (in June every year) flagged by the World Environment Day (on June 5) let us look at the some of the key initiatives and achievements of Tata Steel in these two vital and interconnected challenges. Water Water is one of the critical resources for producing steel. Over the last 5 years, Tata Steel has reduced the specific freshwater consumption (m3\/tcs) for its crude steel manufacturing sites in the country by 33%. It has managed to do this by implementing various water conservation projects at its steelmaking and mining sites. These include deploying dry processes for reduction, pumping infrastructure for water recovery, and a central effluent treatment plant with reverse osmosis to treat and recycle effluent in steelmaking processes. The treated effluents are being reused for low-end applications like coke quenching, blast furnace slag granulation, steel slag quenching, sinter and pellet mixing, gas cleaning plant, horticulture, dust suppression, etc. Air Reduction of dust emission is one of the thrust areas to improve air quality across the Tata Steel’s operating sites. This has been achieved through upgraded pollution control equipment, implementation of new technologies, consistent internal efforts and maintenance strategies. These measures have helped Tata Steel to significantly reduce its stack dust emissions in the country. From 1994-95 to 2023-24, stack dust emissions were reduced by 97.8% and 67% at the Jamshedpur and Kalinganagar steelworks respectively. Similarly, since its acquisition in 2018-19, the Meramandali plant’s (India’s largest flat steel production plant) stack dust emissions have also been reduced by 54% by 61% at Gamharia (Tata Steel Long Products). Solid Waste Management Committed to its ‘Zero Waste to Landfill’ target, Tata Steel handles around 16 million tonnes of by-products per annum (MTPA), spanning 25+ product categories with 250+ stock keeping units or SKUs. As a one of its kind in the industry , a dedicated Industrial By-Products Management Division handles the by-products generated in the value chain of the steel making process. Most of the by-products generated forms a key raw materials source for various industries like cement, chemicals, construction, railways and power. In FY 2023-24, Tata Steel achieved 100% solid waste utilisation at Jamshedpur, Kalinganagar, Meramandali, and Gamharia. Steel making (LD) slag , a by-product during steel making process , has had been a challenge for the entire steel industry owing to its propoeties and limited applicates and traditionally had been posing an environmental challenge as it would largely go into landfills, in the past. Tata Steel became the first plant in India to implement the in-house developed technology of accelerated weathering (steam aging facility) of steel slag on an industrial scale. This has enabled manufacturing of superior quality aggregates which are used as replacement of natural aggregates in road construction. In a first of its kind initiative in the country, Tata Steel launched two new products – Tata Aggreto and Tata Nirman, for application in road, fly ash brick and cement manufacturing. Apart from extensive utilization in National Highways, State Highways, city roads and rural roads (under Pradhan Mantri Gram Sadak Yojna, PMGSY), these products have been successfully used to construct over 1 kilometre stretch of road connecting the Sino-Indian border in Arunachal Pradesh by Border Roads Organisation (BRO). Tata Aggreto and Tata Nirman has been tested to be a superior product over natural aggregates in road construction industry helping in conservation of natural biodiversity. Tata Steel has also developed a patented sustainable waste management technology for utilising Basic Oxygen Furnace slag to manufacture a sulphur-rich nutrient supplement branded ‘Dhurvi Gold’. Blast Furnace slag is another voluminous solid waste or by-product generated from integrated steel plants. Based on this material, Tata Steel has introduced a new brand – Tata Dureco, which is Ground Granulated Blast Furnace Slag (GGBS). It is a GreenPro certified sustainable product which can be used as partial replacement of cement in concrete production and is extensively used in construction industry. Tata Dureco has been used in developing some of the iconic nation building projects in the country and has gathered interest for may key projects both in domestic as well as international markets. Other key initiatives include a one-of-a-kind endeavour to convert the hazardous sludge of steel plant into value-added pellets, replacement of coal tar usage in blast furnace by low-sulphur furnace oil which is a greener alternative. Tata Steel has also developed eco-friendly light construction products such as green paver blocks and interlocking blocks, which are manufactured using iron and steel slags. Cutting Carbon footprint As part of its efforts to reduce carbon footprint from its manufacturing processes, Tata Steel has adopted the ‘circular economy’ route, a key element of which is recycling of steel scrap. The company is implementing innovative strategies to enhance steel scrap utilisation in steelmaking, including establishing an Electric Arc Furnace (EAF) based long products steel plant in Ludhiana. This plant will have a minimal carbon footprint and a capacity of 0.75 MnTPA, maximising the use of steel scrap. Clean energy transition India is currently undergoing one of the world’s largest clean energy transitions that is impacting every industrial sector. Given that steel making is an energy-intensive sector, Tata Steel too is increasing its clean energy portfolio by partnering with Tata Power Renewable Energy Ltd to establish approximately ~966 MW of solar and wind hybrid renewable power capacity under a captive arrangement. This initiative will address 379 MW of the Company’s power requirement in India and facilitate an annual reduction of over 2 million tonnes of CO2 emissions. Biodiversity Conservation Tata Steel has persistently made efforts to improve its performance in biodiversity conservation and reduce its impact on the ecosystem. It endeavours to avoid, minimise, regenerate, restore and transform its biodiversity impact. The Company’s operations are not located in any of the identified biodiversity hotspots or protected areas. In consultation with stakeholders and experts, the Company has developed Biodiversity Management Plans (BMPs) for 17 sites and plans to cover the remaining ones. In Jharia, Tata Steel has championed bamboo plantation in the leasehold and barren community land, aggregating to about 110 acres. A strong collaboration with farmers in the plantation areas generates new livelihood opportunities, reducing their vulnerability to climate change. In Gamharia, a 30-acre barren ash mound within the plant premises was stabilised by developing a rich biodiversity park, Kailash Top, with around 25,000 plants and shrubs. The water requirement is managed through treated wastewater from the captive effluent treatment plant, realising the principle of circularity. In Jamshedpur, Tata Steel has created a new 1-acre water body in the Sidhgora area, with a capacity of 10 million litres. In Meramandali, a 9.5-acre pond was renovated. With a 25 million litres capacity, the water body touches the lives of 600 people. In recent past, nature trails, biodiversity parks and urban forests have been set up in Kadma, CH area, Sonari, Sidhgora among other places of Jamshedpur besides rejuvenation of water bodies in CRM Bara and other strategically important locations of Jamshedpur. Recognitions Tata Steel’s efforts have been receiving global recognition in some of the most important sustainability forums. The company has been recognised as a Steel Sustainability Champion 2024 by worldsteel for the seventh consecutive year for its commitment and action to sustainable development and adherence to world-class standards. Earlier this year, the company’s plants in Kalinganagar and Meramandali received ResponsibleSteelTM Certification, while the same status was conferred on its Jamshedpur plant in 2022, making it the first one in India to receive this prestigious status.","filter_flag":1}
{"title":"Food Cycle Science Secures Strategic Investment from Power Sustainable Lios to Accelerate Growth","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce16673463eb761cb20aec5a5a8&url=https%3a%2f%2fuk.finance.yahoo.com%2fnews%2ffood-cycle-science-secures-strategic-120000032.html&c=16993315771077925461&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce16673463eb761cb20aec5a5a8&url=https%3a%2f%2fuk.finance.yahoo.com%2fnews%2ffood-cycle-science-secures-strategic-120000032.html&c=16993315771077925461&mkt=en-us","summary":"Aiming to eliminate the world's food waste, FCS continues to lead in sustainable waste management. \"We are thrilled to partner ... entering new channels and geographies with groundbreaking new ...","published":"Mon, 10 Jun 2024 17:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=10, tm_hour=17, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=162, tm_isdst=0)","news_source":"Yahoo Finance","news_image":"http:\/\/www.bing.com\/th?id=OVFT.sSxMG3tcUqyv4FjveBYAyS&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":400,"news_imagemaxheight":148,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Food Cycle Science Secures Strategic Investment from Power Sustainable Lios to Accelerate Growth","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Aiming to eliminate the world's food waste, FCS continues to lead in sustainable waste management. \"We are thrilled to partner ... entering new channels and geographies with groundbreaking new ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Sustainable waste management\" \"new products\"&format=rss","text":"TORONTO and OTTAWA, ON, June 11, 2024 \/PRNewswire\/ -- Power Sustainable Lios Inc. (\"PSL\"), the sustainable agrifood investment group of Power Sustainable (\"PS\"), announced today it has invested in Food Cycle Science Corporation (\"Food Cycle Science\", or \"FCS\"), providing FCS with strong institutional backing in direct support of their continued growth in Canada and internationally. FCS's FoodCycler® is an award-winning electric food waste recycler that transforms food scraps into a dry, odour-free by-product, avoiding methane emissions that result from food waste breaking down in landfills. The flagship FoodCycler Eco 5 model in grey and white (left) and the soon-to-be-released compact FoodCycler Eco 3 model in grey and white (right) FCS designs and delivers waste solutions that enable individuals, businesses, and communities to manage their food waste conveniently and sustainably. To date, FCS has delivered over 250,000 units that are in use in over 20 countries. These solutions are both cost-effective and user-friendly, using energy-efficient technology to process food waste in homes in a manner that eliminates odours and reduces volume by up to 90%. This essential infrastructure can decrease food waste emissions by more than 75% while complementing existing systems like municipal composting and anaerobic digestion programs. Founded in 2011, FCS sells its innovative devices to consumers in North America, Asia, and beyond. FCS launched its first household unit in North America in 2017 and now works closely with global distributors, US waste haulers, and food service operators. FCS also partners with municipalities to offer its cutting-edge solutions, winning multiple awards and recognitions for its breakthrough technology and achieving high consumer ratings. Aiming to eliminate the world's food waste, FCS continues to lead in sustainable waste management. ADVERTISEMENT \"We are thrilled to partner with Food Cycle Science to support their continued growth as the leader in this emerging sector,\" said Jonathan Belair, Managing Partner of Power Sustainable Lios. \"Food Cycle Science's proprietary technology not only drastically improves the experience of managing food waste at home and within businesses, but also addresses over-capacity at landfills. Their innovative solutions represent an important tool in addressing the environmental impact of the food waste crisis, setting new standards in the industry. We are excited to help them expand their market presence.\" Story continues \"This is a transformative partnership for our business,\" said Bradley Crepeau, Chief Executive Officer of Food Cycle Science. \"Over the past number of years, we've developed innovative, patented technology and demonstrated its value in the market. By partnering with Power Sustainable Lios, we can access the capabilities, networks, and capital we need to embark on our next phase of growth, entering new channels and geographies with groundbreaking new products.\" \"The impact of food waste is one of the most pressing challenges facing the food sector globally. PSL's extensive experience investing, operating, and advising across the food value chain makes us the ideal partner for FCS,\" said Craig Hanna, Partner of Power Sustainable Lios. \"We have followed FCS for several years, and our research shows that their technology and business model position it as a clear leader in this growing market. Wherever food waste exists, FCS likely has the solution. We look forward to leveraging our experience and resources to help realize the full potential and impact of this innovative company.\" About Power Sustainable Lios: Power Sustainable Lios is a specialized agri-food private equity platform, supporting the sustainability transformation occurring within the food system. They invest in profitable and high-growth mid-market companies in North America operating across the food value chain, well positioned to prioritize and accelerate this change. They invest $25 million to $50 million per opportunity. Power Sustainable Lios is a subsidiary of Power Sustainable. Learn more at www.powersustainablelios.com. About Power Sustainable: Power Sustainable is a climate-focused investment manager which finances companies and projects that aim for both competitive returns and positive sustainability outcomes. The firm offers institutional investors exposure to alternative assets, which aim to accelerate and scale sustainable solutions across multiple industries. Power Sustainable is a subsidiary of Power Corporation of Canada (TSX: POW), an international management and holding company that focuses on financial services in North America, Europe, and Asia. With CAD$3.8 billion in assets under management (as of March 31, 2024), Power Sustainable's mission is to catalyze capital towards clean global solutions. Learn more at www.powersustainable.com. About Food Cycle Science Food Cycle Science Corporation designs, sells, and distributes food waste management solutions that aim to tackle the ever-growing problem of food waste. They are revolutionizing food waste management by offering unique products and innovative solutions that create sustainable practices and convert everyday food scraps into nutrient-rich, garden-ready fertilizers for households, businesses, and municipalities. Food Cycle Science promotes an environmentally sustainable life cycle, reduces landfill GHG emissions, and lowers the exorbitant cost of food waste management. Learn more at www.foodcycler.com. For more information, contact: Ian Cameron Director of Communications, Power Sustainable 438-308-7697 cameron@powersustainable.com Cision View original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/food-cycle-science-secures-strategic-investment-from-power-sustainable-lios-to-accelerate-growth-302168804.html SOURCE Power Sustainable","filter_flag":1}
