{"title":"Your trash deserves better. These three cases show what’s possible. - Rocky Mountain Institute","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vcm1pLm9yZy95b3VyLXRyYXNoLWRlc2VydmVzLWJldHRlci10aGVzZS10aHJlZS1jYXNlcy1zaG93LXdoYXRzLXBvc3NpYmxlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vcm1pLm9yZy95b3VyLXRyYXNoLWRlc2VydmVzLWJldHRlci10aGVzZS10aHJlZS1jYXNlcy1zaG93LXdoYXRzLXBvc3NpYmxlL9IBAA?oc=5","id":"CBMiUWh0dHBzOi8vcm1pLm9yZy95b3VyLXRyYXNoLWRlc2VydmVzLWJldHRlci10aGVzZS10aHJlZS1jYXNlcy1zaG93LXdoYXRzLXBvc3NpYmxlL9IBAA","guidislink":false,"published":"Fri, 17 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=17, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=321, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vcm1pLm9yZy95b3VyLXRyYXNoLWRlc2VydmVzLWJldHRlci10aGVzZS10aHJlZS1jYXNlcy1zaG93LXdoYXRzLXBvc3NpYmxlL9IBAA?oc=5\" target=\"_blank\">Your trash deserves better. These three cases show what’s possible.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Rocky Mountain Institute<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Your trash deserves better. These three cases show what’s possible. - Rocky Mountain Institute","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vcm1pLm9yZy95b3VyLXRyYXNoLWRlc2VydmVzLWJldHRlci10aGVzZS10aHJlZS1jYXNlcy1zaG93LXdoYXRzLXBvc3NpYmxlL9IBAA?oc=5\" target=\"_blank\">Your trash deserves better. These three cases show what’s possible.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Rocky Mountain Institute<\/font>","source.href":"https:\/\/rmi.org","source.title":"Rocky Mountain Institute","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Recovery\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Shares Your trash deserves better. These three cases show what’s possible. How an ‘All-In’ approach can slash planet-warming methane emissions from the waste sector Landfills are the third largest source of methane in the United States with annual emissions equivalent to driving 66 million cars or operating 79 coal-fired power plants. Methane is generated when organic materials — such as food waste, yard waste, and paper — decompose in landfills without oxygen. In the United States, we send more than 145 million tons of waste to municipal landfills each year. Food waste is the single most landfilled material, causing nearly 60 percent of landfill methane emissions, according to recent EPA analysis. Cutting methane is the strongest lever we have to slow the rate of near-term warming and limit the risk of dangerous climate tipping points. In the waste sector, strategies to cut methane emissions fall into two broad categories: upstream prevention and downstream mitigation. Upstream strategies center around the Environmental Protection Agency’s (EPA) Wasted Food Scale and prioritize waste prevention, food donation, and recycling to turn residual organics into animal feed, compost, or biogas. Downstream strategies focus on improving landfill design, operations, and monitoring practices to increase methane capture and reduce methane leaks. Upstream strategies avoid locking in future landfill methane emissions and ensure organic materials are put to their highest and best use, while downstream strategies are critical to cut methane quickly from all the organic waste already sitting in our landfills today. The Center for Global Sustainability (CGS) at the University of Maryland estimates an “All-In” approach that combines upstream and downstream efforts could slash waste methane emissions by 15 percent by 2030. These emission reductions would help the United States deliver on the North American Leaders’ Summit commitments, the Global Methane Pledge, and its broader nationally determined contribution (NDCs). Beyond the climate benefits, cutting methane emissions from the waste sector can help to address food insecurity, reduce health risks, improve quality of life for landfill-adjacent communities, create circular economy jobs, and produce value-added products, like compost. Three success stories in waste methane mitigation State of Maryland Landfills are the largest source of methane emissions in Maryland, making up about 40 percent of the state’s methane emissions and about 6 percent of total greenhouse gas emissions. Exhibit 1: Maryland’s greenhouse gas emissions in 2020. Source: COMAR 26.11.42 –Control of Methane Emissions from Municipal Solid Waste (MSW) Landfills Maryland has successfully implemented upstream and downstream waste management policies to address these harmful emissions. Maryland’s organics recycling law requires businesses, organizations, and schools that generate at least two tons of food residuals per week (one ton per week beginning in 2024) and are located within 30 miles of an organics recycling facility, to separate and divert food residuals from landfills or incinerators. Acceptable alternatives include source reduction, donation, conversion to animal feed, composting, or anaerobic digestion. Maryland is now home to one of the largest municipal composting facilities on the East Coast (Prince George’s County), and the Baltimore Compost Collective in South Baltimore is working to recycle food waste, improve soil health, and develop youth leaders in a community that was once slated to host the country’s largest toxic trash-burning incinerator. Downstream, Maryland recently finalized a new rule to guard against methane pollution. The rule makes several improvements to landfill design and operations that will meaningfully increase methane capture and reduce the risk of large leaks. When fully implemented, the Maryland rule will reduce greenhouse gas emissions from landfills by an estimated 25-50 percent. Maryland is now the third state after California and Oregon to set stronger landfill standards than the EPA’s. UMD’s CGS estimates that these policies can deliver 39 percent gross emission reductions in Maryland’s Climate Pathways scenario by 2031, or roughly 4 percent of the state’s 60 percent reduction target, while delivering co-benefits to Marylanders through improved environmental health. City of Austin, Texas Austin is a national leader in sustainable resource recovery with an ambitious goal to reduce the amount of trash sent to landfills by 90 percent by 2040. The city has made significant progress on its zero-waste goals, achieving a 42 percent diversion rate in 2021. Austin Resource Recovery (ARR), the city’s solid waste utility, has implemented several programs over the past decade to reduce organic waste disposal in landfills and promote sustainable materials management throughout the city. ARR provides weekly curbside composting collection to more than 220,000 residential customers, converting food scraps, yard trimmings, food-soiled paper, and natural fibers into nutrient-rich compost. Austin offers free composting guides and zero-waste classes for K-12 students to expand uptake and awareness. Private haulers manage the waste streams of commercial and multi-family properties, but the city of Austin has enacted policies and programs to increase organics diversion among these generators. For example, Austin passed a universal recycling ordinance (URO) that requires food-permitted businesses to ensure convenient access to diversion methods that keep organic materials out of landfills, encouraging waste prevention, edible food recovery, and composting. Austin City Council recently approved an amendment to the URO that will expand composting services to multi-family properties. Austin also provides incentives and resources to advance organic waste reduction, donation, and recycling efforts. The city offers a Zero Waste Business Rebate to encourage and support food rescue infrastructure, with up to $3,000 available to businesses for expenses related to improving food storage or equipment for the transport of recovered food. In 2015, the city launched the ReVerse Pitch Program an annual competition with a $10,000 prize and small business support for start-up circular businesses that aim to turn waste into new products. ARR’s Assistant Director, Gena McKinley, cited several benefits to the city’s waste management strategy, beyond emissions reductions. For one, the curbside composting program is beneficial to ratepayers, as the cost to compost organic materials is lower than the cost to landfill them, and the city passes along these savings to residents. Second, the incentives and programs focused on increasing edible food recovery can help to address food insecurity, which impacts about 15 percent of residents (see the Austin Climate Equity Plan and Austin’s State of Food Systems Report). Finally, circular economy programs can create new workforce training and job opportunities, and ARR has partnered with the city’s economic development department to help grow the local circular economy. Sierra Nevada Brewing Company Sierra Nevada Brewing Company is the third largest craft brewery in America and the first TRUE Platinum Zero Waste certified business with an over 99 percent diversion rate of solid waste from the landfill. Spent grain and spent yeast are the largest volume of waste generated by breweries. Sierra Nevada generates about 250,000 pounds per day of spent grain across its operations. Through farm partnerships, the spent grain is then used as cattle feed for dairy cows and is a revenue stream for the company. The company sends part of its spent yeast (~40,000 lbs\/day at its California facility) to farms as animal feed for dairy cows, and the remainder (~30,000 lbs\/day at its North Carolina facility) is anaerobically digested at an on-site wastewater treatment plant along with the brewing effluent. The biogas produced at Sierra Nevada’s North Carolina digester is used in boilers and microturbines, covering about 8 percent of total electricity needs. At its California restaurant and taproom, Sierra Nevada has installed an industrial on-site composter to process food waste, landscaping debris, and small amounts of hops and spent grain. The in-vessel composter can process over 2 tons of organic material per day, and Sierra Nevada estimates it has prevented over 6 million pounds of organic material from reaching landfills, which in turn has avoided almost 2,000 metric tons of CO 2 e over its lifetime. Sierra Nevada utilizes much of the compost for agricultural purposes on-site, growing produce, herbs, hops, and barley. At the North Carolina taproom, Sierra Nevada diverts food waste to a regional composting facility. Sierra Nevada also prevents waste at its California location by donating edible food from its taproom and estate garden to shelters, food banks, and youth organizations. To help facilitate the donations, the brewery has partnered with 530 Food Rescue, a non-profit organization that connects food-rescue volunteers to retailers using a mobile app. Opportunities to Scale Impact These three case studies illustrate some of the many policies and programs that can reduce methane emissions while delivering powerful co-benefits. Historic funding from the Bipartisan Infrastructure Law (BIL) and the Inflation Reduction Act (IRA) can help support and scale subnational efforts to cut waste methane. For example, the Solid Waste Infrastructure for Recycling (SWIFR) Grant Program from the BIL recently invested more than $100 million in local waste infrastructure, including support for organics collection and composting facilities. The IRA’s Climate Pollution Reduction Grant Program (CPRG) provides $5 billion in climate planning and implementation grants to states, local governments, tribes, and territories to develop strong, local greenhouse gas reduction strategies. Applicants must submit a priority climate action plan (PCAP) by March-April 2024 to compete for implementation funding, and we encourage entities to include food waste reduction, organics diversion, and landfill mitigation programs in their PCAPs. The EPA can also help scale efforts to reduce landfill emissions by strengthening the Clean Air Act regulations for landfills to slash planet-warming methane, protect landfill-adjacent communities across the country, and make progress on broader climate and environmental justice goals. The 2023 United Nations Climate Change Conference (COP28) at the end of this year is an exciting opportunity for the United States to highlight subnational progress and announce action to further cut landfill methane. RMI’s Waste Methane Resource List compiles additional funding opportunities, sector-specific toolkits, and model programs and policies to help states, local governments, and organizations take action to reduce food waste and landfill methane emissions. Our trash is a major contributor to climate change, but with an ‘All-In’ approach, we can change that. This article highlights success stories discussed in Tackling Food Waste & Landfill Methane Emissions an event hosted by the America Is All In Coalition and RMI to explain the link between trash and climate change and present solutions for subnational actors. America is All In is an expansive coalition of over 5,000 state, tribal, and local governments, higher ed institutions, businesses, health care organizations, faith groups, and cultural institutions in support of US climate action at the federal and subnational level.","filter_flag":1}
{"title":"GT Recycling expands plastic recycling plant - Waste Management Review","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9ndC1yZWN5Y2xpbmctZXhwYW5kcy1wbGFzdGljLXJlY3ljbGluZy1wbGFudC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9ndC1yZWN5Y2xpbmctZXhwYW5kcy1wbGFzdGljLXJlY3ljbGluZy1wbGFudC_SAQA?oc=5","id":"CBMiUmh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9ndC1yZWN5Y2xpbmctZXhwYW5kcy1wbGFzdGljLXJlY3ljbGluZy1wbGFudC_SAQA","guidislink":false,"published":"Tue, 21 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=325, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9ndC1yZWN5Y2xpbmctZXhwYW5kcy1wbGFzdGljLXJlY3ljbGluZy1wbGFudC_SAQA?oc=5\" target=\"_blank\">GT Recycling expands plastic recycling plant<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Waste Management Review<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"GT Recycling expands plastic recycling plant - Waste Management Review","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9ndC1yZWN5Y2xpbmctZXhwYW5kcy1wbGFzdGljLXJlY3ljbGluZy1wbGFudC_SAQA?oc=5\" target=\"_blank\">GT Recycling expands plastic recycling plant<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Waste Management Review<\/font>","source.href":"https:\/\/wastemanagementreview.com.au","source.title":"Waste Management Review","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Recovery\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"GT Recycling’s Tim McLean, Operation Manager; Doug McLean, Business Manager; and Andrew McLean, Production Manager, in front of the new INTAREMA TVEplus 1714 processing line. GT Recycling in Geelong has pressed the button on a new flexible plastics recycling line that has been years in the making. The upgraded plant recycles polypropylene and low-density polyethylene into a pellet suitable for use in manufacturing a range of plastic products within Australia. Doug McLean, GT Recycling Business Manager, says it aligns well with Victoria’s move toward a circular economy. “We’ve worked with researchers, including those at Deakin University, to develop and establish new products that can use high-quality, recycled raw plastic material,” Doug says. “A lot of it is designed to replace virgin plastics. “Establishing end markets in Australia has been a focus the past couple of years. We’re confident we’ll be able to market all our product into the domestic market.” GT Recycling is a family-owned and operated recycling company, drawing on the experience of a team with a combined four decades in the industry. Doug says when the Federal Government announced plastic export bans, which came into effect in July 2022, GT Recycling could see a gap in the infrastructure that would be required onshore. The company secured funding from the state and federal government’s Recycling Modernisation Fund for expansion. “We were exporting flexible plastic at that time,” he says. “It was a natural progression to move into adding value to this product to complement our existing recycling operations in Geelong.” GT Recycling’s management team had clear goals on the type of material to be recycled and the quality of the end-product to meet customer requirements. Queue CEMAC Technologies, distributors of EREMA recycling and resource recovery equipment. GT Recycling worked with CEMAC and EREMA in 2015 when it installed an INTAREMA TVEplus 1108 for a new plastics pelletising line. For its latest expansion, GT Recycling installed an INTAREMA TVEplus 1714. Eric Paulsen, CEMAC Managing Director, says EREMA has one of the best technologies available to convert contaminated post-consumer plastic waste into a quality end-product, efficiently and economically. EREMA’s patented preconditioning unit cuts, homogenises, heats, dries, compacts, buffers, and doses the material – all in one step – before it enters the extruder, so the extruder is continuously filled with hot and pre-compacted material. Eric says the principle of TVEPlus is that by putting the melt filtration before extruder degassing there is minimal shear influence during the melting process. This prevents further reduction of the impurities, increases the filtration efficiency and results in greater homogenisation of the melt. He says the INTAREMA is newly developed technology aimed at absorbing more material in a shorter time. “The material in the preconditioning unit rotates in the opposite direction to the transport direction of the extruder, which means that the temperature range for optimal extrusion is considerably wider, and the output performance can be significantly increased,” Eric says. “The INTAREMA TVEplus 1714 is a larger machine and equipped with the continuous Laserfilter, instead of conventional back-flush filter. The continuous screen cleaning of the Laserfilter ensures that high levels of contamination, such as paper labels, aluminium or foreign polymers, can effectively be removed. The ecoSAVE execution reduces energy consumption.” Doug says GT Recycling is focused on installing technology that delivers optimum benefits for environmental and occupational health and safety compliance, while economically producing quality raw material. In his opinion, EREMA sets the benchmark in extrusion technology, and he’s confident the latest equipment will provide the results the company is looking for. Previous support from CEMAC, from the planning stage to equipment selection, through to setting up on site and commissioning, is also key to GT Recycling returning to CEMAC. “CEMAC has the experience and understanding of what is required by recyclers,” Doug says. “In addition to the EREMA equipment, we’ve got strong backup for spare parts and technology support. It’s comforting to know that we have that support at the end of the phone or at the end of the road.” The new extruder was commissioned in June 2023 and is capable of processing more than one tonne per hour. Doug plans for the new plant to wind up to three shifts, five days a week and there are further plans for expansion. “There’s significant demand for recycling services for these particular wastes at the moment and a shortage of infrastructure,” Doug says. “The quicker we can be running at full capacity the better we minimise the chances of this plastic going to landfill.” For more information, visit: www.cemactech.com","filter_flag":1}
{"title":"Cash for containers program launches - Ocean Grove Voice","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vb2NlYW5ncm92ZXZvaWNlLmNvbS5hdS9uZXdzLzAxLTExLTIwMjMvY2FzaC1mb3ItY29udGFpbmVycy1wcm9ncmFtLWxhdW5jaGVzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vb2NlYW5ncm92ZXZvaWNlLmNvbS5hdS9uZXdzLzAxLTExLTIwMjMvY2FzaC1mb3ItY29udGFpbmVycy1wcm9ncmFtLWxhdW5jaGVzL9IBAA?oc=5","id":"CBMiVGh0dHBzOi8vb2NlYW5ncm92ZXZvaWNlLmNvbS5hdS9uZXdzLzAxLTExLTIwMjMvY2FzaC1mb3ItY29udGFpbmVycy1wcm9ncmFtLWxhdW5jaGVzL9IBAA","guidislink":false,"published":"Wed, 01 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=305, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vb2NlYW5ncm92ZXZvaWNlLmNvbS5hdS9uZXdzLzAxLTExLTIwMjMvY2FzaC1mb3ItY29udGFpbmVycy1wcm9ncmFtLWxhdW5jaGVzL9IBAA?oc=5\" target=\"_blank\">Cash for containers program launches<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Ocean Grove Voice<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Cash for containers program launches - Ocean Grove Voice","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vb2NlYW5ncm92ZXZvaWNlLmNvbS5hdS9uZXdzLzAxLTExLTIwMjMvY2FzaC1mb3ItY29udGFpbmVycy1wcm9ncmFtLWxhdW5jaGVzL9IBAA?oc=5\" target=\"_blank\">Cash for containers program launches<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Ocean Grove Voice<\/font>","source.href":"https:\/\/oceangrovevoice.com.au","source.title":"Ocean Grove Voice","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Recovery\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Despite last-minute concerns around funding, the state’s new recycling program kicked off this week, giving residents across Geelong, the Bellarine and the Surf Coast the chance to cash in their cans and bottles. Victoria’s Container Deposit Scheme (CDS) launched on Wednesday, November 1, with 21 locations across the region providing 10 cents per item for eligible containers. Most of the refund points are reverse vending machines, which scan and verify containers as they are deposited and provide retail cash vouchers, direct funds transfers to bank accounts or donations to a nominated charity or community group. In addition to the vending machines, five over the counter refund points are located in Belmont, East Geelong, Moolap and Portarlington, with a further two automated depots as Bell Park and Breakwater. TOMRA Cleanaway, a partnership between global collection and sorting provider TOMRA and Australian waste and resource recovery company Cleanaway, will provide the service delivery in the western third of the state. TOMRA Cleanaway chief executive James Dorney said his organisation was excited to launch the program in western Victoria. “Our machines are quick, convenient, accurate and automated, and are able to be seamlessly integrated into retail and community locations,” Mr Dorney said. “In addition to the 128 container refund points across western Melbourne and western regional Victoria that go live on 1 November, we will continue to add more refund points in the West Zone for many months to come. So the scheme will continue to get more and more convenient and rewarding.” Victorian Minister for Environment Steve Dimopoulos said Victoria’s CDS will be the most accessible and convenient in the country, making it easier than ever to recycle in the Geelong region and across the state. “CDS Vic will maximise the number of cans, bottles and cartons being recycled into new products, while reducing the amount of litter in Victoria by up to half,” he said. Visit cdsvic.org.au\/locations for a full list of locations.","filter_flag":1}
{"title":"A win-win for communities and the environment - The Age","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LnRoZWFnZS5jb20uYXUvZW52aXJvbm1lbnQvc3VzdGFpbmFiaWxpdHkvYS13aW4td2luLWZvci1jb21tdW5pdGllcy1hbmQtdGhlLWVudmlyb25tZW50LTIwMjMxMTE0LXA1ZWp0Yy5odG1s0gF3aHR0cHM6Ly9hbXAudGhlYWdlLmNvbS5hdS9lbnZpcm9ubWVudC9zdXN0YWluYWJpbGl0eS9hLXdpbi13aW4tZm9yLWNvbW11bml0aWVzLWFuZC10aGUtZW52aXJvbm1lbnQtMjAyMzExMTQtcDVlanRjLmh0bWw?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LnRoZWFnZS5jb20uYXUvZW52aXJvbm1lbnQvc3VzdGFpbmFiaWxpdHkvYS13aW4td2luLWZvci1jb21tdW5pdGllcy1hbmQtdGhlLWVudmlyb25tZW50LTIwMjMxMTE0LXA1ZWp0Yy5odG1s0gF3aHR0cHM6Ly9hbXAudGhlYWdlLmNvbS5hdS9lbnZpcm9ubWVudC9zdXN0YWluYWJpbGl0eS9hLXdpbi13aW4tZm9yLWNvbW11bml0aWVzLWFuZC10aGUtZW52aXJvbm1lbnQtMjAyMzExMTQtcDVlanRjLmh0bWw?oc=5","id":"CBMid2h0dHBzOi8vd3d3LnRoZWFnZS5jb20uYXUvZW52aXJvbm1lbnQvc3VzdGFpbmFiaWxpdHkvYS13aW4td2luLWZvci1jb21tdW5pdGllcy1hbmQtdGhlLWVudmlyb25tZW50LTIwMjMxMTE0LXA1ZWp0Yy5odG1s0gF3aHR0cHM6Ly9hbXAudGhlYWdlLmNvbS5hdS9lbnZpcm9ubWVudC9zdXN0YWluYWJpbGl0eS9hLXdpbi13aW4tZm9yLWNvbW11bml0aWVzLWFuZC10aGUtZW52aXJvbm1lbnQtMjAyMzExMTQtcDVlanRjLmh0bWw","guidislink":false,"published":"Fri, 17 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=17, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=321, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LnRoZWFnZS5jb20uYXUvZW52aXJvbm1lbnQvc3VzdGFpbmFiaWxpdHkvYS13aW4td2luLWZvci1jb21tdW5pdGllcy1hbmQtdGhlLWVudmlyb25tZW50LTIwMjMxMTE0LXA1ZWp0Yy5odG1s0gF3aHR0cHM6Ly9hbXAudGhlYWdlLmNvbS5hdS9lbnZpcm9ubWVudC9zdXN0YWluYWJpbGl0eS9hLXdpbi13aW4tZm9yLWNvbW11bml0aWVzLWFuZC10aGUtZW52aXJvbm1lbnQtMjAyMzExMTQtcDVlanRjLmh0bWw?oc=5\" target=\"_blank\">A win-win for communities and the environment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Age<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"A win-win for communities and the environment - The Age","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LnRoZWFnZS5jb20uYXUvZW52aXJvbm1lbnQvc3VzdGFpbmFiaWxpdHkvYS13aW4td2luLWZvci1jb21tdW5pdGllcy1hbmQtdGhlLWVudmlyb25tZW50LTIwMjMxMTE0LXA1ZWp0Yy5odG1s0gF3aHR0cHM6Ly9hbXAudGhlYWdlLmNvbS5hdS9lbnZpcm9ubWVudC9zdXN0YWluYWJpbGl0eS9hLXdpbi13aW4tZm9yLWNvbW11bml0aWVzLWFuZC10aGUtZW52aXJvbm1lbnQtMjAyMzExMTQtcDVlanRjLmh0bWw?oc=5\" target=\"_blank\">A win-win for communities and the environment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Age<\/font>","source.href":"https:\/\/www.theage.com.au","source.title":"The Age","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Recovery\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"A partnership between TOMRA, a global leader in sorting technology, and Cleanaway, Australia’s largest waste and resource recovery company, TOMRA Cleanaway is playing a key role in the resource recovery revolution. A reverse vending machine installed by TOMRA Cleanaway in Altona. TOMRA Cleanaway has invested heavily in infrastructure that provides a convenient and accessible network for residents across the zone. Its quick, accurate and automated machines make returning eligible containers and bottles as easy as doing the supermarket shopping. By day three of the scheme, which was introduced at the start of November, TOMRA Cleanaway had collected 2 million containers at its 140-plus collection sites, paving the way for the recycling scheme to become a part of life for all Victorians. “Residents have embraced the scheme with great enthusiasm,” says TOMRA Cleanaway CEO James Dorney of day one, which alone saw collection systems, refund systems and data systems managing more than 700,000 deposits. Refunds come in three forms: cash, electronic payments to your bank or PayPal, and via redeemable vouchers, either electronic or paper. There are three types of refund points: Depots (either walk-in or drive-in), which can pay in cash or electronically for small or commercial quantities of containers. Reverse vending machines, where containers are placed in the machine in return for an electronic payment via an app or paper voucher to redeem at a nominated retail partner. Over the counter, usually in smaller locations, where a person is handed their refund or can receive digital payment via the CDS Vic West Zone app. Reverse vending machines at supermarkets can also provide a refund voucher – paper or electronic – which can be cashed at the counter. Once collected, TOMRA Cleanaway recovers the material and sells it to be recycled into new containers, with new containers being returned to supermarket shelves within as little as four weeks, helping to create a circular economy. “CDS will maximise the number of cans, bottles and cartons being recycled into new products and keep them out of landfill.” Steve Dimopoulos, the Minister for Environment It’s a big win for the environment, but also for charities, not-for-profit organisations and social enterprises which can access new revenue streams to support the people who depend on them. By using the app, residents have the option of donating some or all of their refund to registered charities. But to further leverage the opportunities provide by CDS Vic, TOMRA Cleanaway has formed partnerships with several not-for-profit organisations to operate collection points, creating dozens of new jobs. “We have specifically built partnerships to establish our bulk refund points – our depots, which can take commercial volumes,” says Dorney. “These partners are operating 10 depots to start with, employing dozens of people. “There’s McCallum in Ballarat, a disability provider. Then there’s Fruit2Work, which has set up a new business called Recycle4Change, in Geelong. Other partners include, Are-Able in Warrnambool, Outlook, the Brotherhood of St Laurence and GreenCollect, which has established refund points in the west zone. “Additional partner sites will likely launch in December. These operations will make a huge difference to these organisations.” “We have specifically built partnerships to establish our bulk refund points – our depots, which can take commercial volumes. These partners are operating 10 depots to start with, employing dozens of people.” TOMRA Cleanaway CEO James Dorney Matt Vallance, from McCallum, which helps provide work, support, and housing to people with disability, has already employed 20 people to work at its two depots. “This is huge for us,” he says. CDS Vic is expected to create 600 jobs across the state, with 200 in the CDS Vic West Zone serviced by TOMRA Cleanaway. TOMRA Cleanaway offers simple pointers to people wishing to return their containers: scan the barcode on your app before you put cans into the machines to check eligibility for a refund. Don’t crush cans – the machines need to read the barcode. And leave the lids on; they can be recycled, too. These reverse vending machines can be found in car parks of major shopping centres and other central points. A list of locations in the West Zone can be found through the CDS Vic West Zone app. To learn more, visit tomracleanaway.com.au\/victoria.","filter_flag":1}
{"title":"$1.26M boost to Tasmania's plastic recycling capacity - Waste Management Review","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS8xLTI2bS1ib29zdC10by10YXNtYW5pYXMtcGxhc3RpYy1yZWN5Y2xpbmctY2FwYWNpdHkv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS8xLTI2bS1ib29zdC10by10YXNtYW5pYXMtcGxhc3RpYy1yZWN5Y2xpbmctY2FwYWNpdHkv0gEA?oc=5","id":"CBMiWWh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS8xLTI2bS1ib29zdC10by10YXNtYW5pYXMtcGxhc3RpYy1yZWN5Y2xpbmctY2FwYWNpdHkv0gEA","guidislink":false,"published":"Wed, 22 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=326, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS8xLTI2bS1ib29zdC10by10YXNtYW5pYXMtcGxhc3RpYy1yZWN5Y2xpbmctY2FwYWNpdHkv0gEA?oc=5\" target=\"_blank\">$1.26M boost to Tasmania's plastic recycling capacity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Waste Management Review<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"$1.26M boost to Tasmania's plastic recycling capacity - Waste Management Review","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS8xLTI2bS1ib29zdC10by10YXNtYW5pYXMtcGxhc3RpYy1yZWN5Y2xpbmctY2FwYWNpdHkv0gEA?oc=5\" target=\"_blank\">$1.26M boost to Tasmania's plastic recycling capacity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Waste Management Review<\/font>","source.href":"https:\/\/wastemanagementreview.com.au","source.title":"Waste Management Review","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Recovery\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"An extra 1700 tonnes of plastic waste in Tasmania will be diverted from landfill each year thanks to a $1.26m federal and state government boost to plastic recycling. The funding will support the expansion of the I M Holdings (Tas) rigid recycling facility in Brighton. The upgraded facility will recycle soft and flexible plastic waste including polypropylene and polyethylene, turning them into new products used in agricultural and industrial sectors. In a boost for the economy, the upgrade will support six ongoing jobs. Minister for the Environment and Water, Tanya Plibersek said the Australian Government is committed to working with states and territories to better manage waste and increase recycling capability. “Boosting recycling isn’t just good for the environment, it’s good for jobs – for every job in landfill there are three jobs in recycling. “We also know people want to do the right thing and recycle their waste and lighten their load on the planet. This funding is supporting upgraded recycling infrastructure to assist Tasmanians recycle more of their waste. “This is a win for the environment, a win for jobs and a win for Tassie.” The joint investment will support Tasmania’s transition to a circular economy, where as much valuable material as possible is diverted from landfill through reuse, recycling and remanufacturing, according to Roger Jaensch, Tasmanian Minister for Environment and Climate Change. The I M Holdings funding follows on from the successful grant application by Timberlink for a wood plastic composite plant to upcycle plastic waste and plantation timber mill residues in Tasmania. “Supporting resource recovery initiatives like these are crucial to sustaining the future of Tasmania’s environment,” Jaensch said. The Australian Government’s Recycling Modernisation Fund is accelerating Australia’s circular economy so that when a product is no longer useful or required for its initial purpose, it is either reused, recycled or remanufactured. Projects already announced under the Recycling Modernisation Fund will add an extra 1.3 million tonnes of processing capacity. That’s equivalent to the weight of more than 25 Sydney Harbour Bridges being kept out of landfill every year while creating more than 3000 jobs. For more information about Resource Recovery and Investments in the Sector in Tasmania, visit: https:\/\/nre.tas.gov.au\/environment\/waste-and-resource-recovery Related stories:","filter_flag":1}
{"title":"Vic Container Deposit Scheme launches - Waste Management Review","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS92aWMtY29udGFpbmVyLWRlcG9zaXQtc2NoZW1lLWxhdW5jaGVkL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS92aWMtY29udGFpbmVyLWRlcG9zaXQtc2NoZW1lLWxhdW5jaGVkL9IBAA?oc=5","id":"CBMiS2h0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS92aWMtY29udGFpbmVyLWRlcG9zaXQtc2NoZW1lLWxhdW5jaGVkL9IBAA","guidislink":false,"published":"Wed, 01 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=305, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS92aWMtY29udGFpbmVyLWRlcG9zaXQtc2NoZW1lLWxhdW5jaGVkL9IBAA?oc=5\" target=\"_blank\">Vic Container Deposit Scheme launches<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Waste Management Review<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Vic Container Deposit Scheme launches - Waste Management Review","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS92aWMtY29udGFpbmVyLWRlcG9zaXQtc2NoZW1lLWxhdW5jaGVkL9IBAA?oc=5\" target=\"_blank\">Vic Container Deposit Scheme launches<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Waste Management Review<\/font>","source.href":"https:\/\/wastemanagementreview.com.au","source.title":"Waste Management Review","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Recovery\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Ten-year-old Makaylah and London, 9, test out refund points at a Coles store. The long-awaited Victorian Container Deposit Scheme, CDS Vic, launches today. Minister for Environment Steve Dimopoulos opened the scheme, where people can now return their eligible drink cans, bottles and cartons for a 10-cent refund at refund points across Victoria. The scheme will generate more than 600 jobs statewide and turn used drink containers into new, recycled products. Reverse vending machines, depots, over-the-counter sites, and pop-up refund points will be the four ways people can return their eligible containers – and depending on the type of refund point, people can choose whether they want to receive the refund in the form of cash, a retail voucher, or an electronic refund. Victorians can also choose to donate their refund to a charity or community organisation registered with the scheme. The network of refund points to recycle containers will continue to grow in 2024 – making the scheme even more accessible to Victorians. VicReturn is the Scheme Co-ordinator, while Zone Operators Return-It, TOMRA Cleanaway, and Visy will establish and oversee the refund points and refunds to customers, as well as ensuring proper recycling of the containers. The operators are each responsible for the refund point network in their allocated scheme zones: north, east and west. Within nine months of the scheme starting, the Zone Operators will be required to have a minimum of one collection point per 14,500 people in metropolitan areas, at least one per town of 750 people in regional areas, and at least one per town of 350 people in remote areas. CDS Vic is part of the Labor Government’s $515 million investment to transform the state’s waste and recycling system. This includes the new standardised four-stream waste and recycling system, supporting our target of diverting 80 per cent of all material away from landfill by 2030. Retailers, associations and community groups have welcomed the rollout of the scheme with retail giant Coles today rolling out 47 Reverse Vending Machines across its Victorian stores. Coles General Manager Grocery Leanne White says the CDS is an excellent way for customers to be rewarded for recycling and allows used cans, bottles and other eligible containers to be recycled into new products. “We’re proud to be adding Reverse Vending Machines to 47 stores across the state in the coming months, from Bendigo to Blackburn, Berwick and Braybrook, we want to help make recycling as easy as possible for our customers,” White said. “Now Victorian customers can be rewarded for returning their used cans, bottles and cartons, with the option to put the funds towards their next shop at Coles, redeem for cash, give to a charity, or add it straight into their bank account.” Victoria’s Environment Minister Steve Dimopoulos said he was confident that by having refund points in such convenient locations the state will be able to significantly reduce litter and give Victorians the option of putting cash back in their pockets. TOMRA Cleanaway Chief Executive Officr James Dorney said he was proud to partner with Coles to set up refund points at several stores across the state. “Our machines can hold up to 10,000 cartons, cans or bottles, use state-of the art sorting technology and are very quick and easy to use,” Dorney said. “Our aim is that using Reverse Vending Machines becomes part of everyday life. Every time you go and do your shopping you return your drink containers.” At the completion of Coles’ Victorian rollout, the retailer will have a total of 139 container collection points at or near its stores across the country, with Tasmania the remaining state to introduce a container deposit scheme. Last financial year, more than 200 million drink containers, cans, cartons and bottles were returned to Coles-linked sites. Since the retailer started supporting the various state-based schemes in 2018, more than a billion containers have been returned to Coles-linked sites. The introduction of CDS in Victoria was described as the missing piece on the mainland by the Waste Management and Resource Recovery Association of Australia (WMRR). “WMRR is fully supportive of extended producer responsibility schemes like CDS as it rightly places the onus on the producer of the material to design for reuse and recycling, as well as placing incentives on them to manage the products’ lifecycle,” said WMRR Chief Executive Officer Gayle Sloan. “It has been another sprint to the start line for the three network operators that will deliver this important scheme in Victoria. WMRR recognises it is a phenomenal financial, legislative and logistical effort to design and implement such a change to how we manage and value materials in a scheme such as CDS. We congratulate all involved in launching this important initiative.,” For more information, visit the Coles Container Deposit Scheme website here. For refund location points, visit: cdsvic.org.au Related stories: Wine and spirit bottles accepted at QLD CDS tomorrow NSW CDS closes in on 10 billion returns","filter_flag":1}
{"title":"Top 10 Best Waste Management Companies In India 2024 - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvd2FzdGUtbWFuYWdlbWVudC1jb21wYW5pZXMtMjAyNC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvd2FzdGUtbWFuYWdlbWVudC1jb21wYW5pZXMtMjAyNC_SAQA?oc=5","id":"CBMiQ2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvd2FzdGUtbWFuYWdlbWVudC1jb21wYW5pZXMtMjAyNC_SAQA","guidislink":false,"published":"Thu, 09 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=9, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=313, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvd2FzdGUtbWFuYWdlbWVudC1jb21wYW5pZXMtMjAyNC_SAQA?oc=5\" target=\"_blank\">Top 10 Best Waste Management Companies In India 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 10 Best Waste Management Companies In India 2024 - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvd2FzdGUtbWFuYWdlbWVudC1jb21wYW5pZXMtMjAyNC_SAQA?oc=5\" target=\"_blank\">Top 10 Best Waste Management Companies In India 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Recovery\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Introduction In this context, waste management companies play a crucial role in developing sustainable solutions to mitigate the environmental impact of waste. As of 2024, several waste management companies in India have risen to prominence due to their innovative approaches, advanced technologies, and commitment to environmental preservation. Waste management companies play a vital role in society, providing numerous benefits that contribute to environmental sustainability, public health, and economic growth. Here are five key benefits of waste management companies: Environmental Conservation Waste management companies are essential in mitigating the negative environmental impact of improper waste disposal. These companies ensure that waste is collected, sorted, treated, and disposed of in environmentally responsible ways. By reducing the amount of waste sent to landfills, promoting recycling, and utilizing innovative technologies like waste-to-energy conversion, waste management companies help minimize pollution, conserve natural resources, and decrease the carbon footprint. Public Health Improvement Proper waste management is closely linked to public health. Accumulation of untreated waste can lead to the spread of diseases, contamination of water sources, and attraction of pests. Waste management companies ensure that hazardous and non-hazardous waste is handled and treated appropriately to prevent health risks. By managing waste in a controlled and sanitary manner, these companies contribute to maintaining a healthy living environment for communities. Resource Recovery and Recycling Waste management companies are crucial in promoting resource recovery and recycling initiatives. They play a pivotal role in collecting recyclable materials like paper, plastic, glass, and metal, diverting them from landfills. Through efficient sorting and processing, waste management companies help conserve valuable raw materials and energy that would otherwise be used to produce new products. This contributes to circular economy principles, reduces the demand for virgin resources, and minimizes the environmental impact of extraction and manufacturing. Energy Generation Many waste management companies are adopting innovative technologies such as waste-to-energy conversion. This involves using waste as a fuel source to generate electricity or heat through processes like incineration or anaerobic digestion. By converting waste into energy, these companies contribute to reducing the reliance on fossil fuels and decreasing greenhouse gas emissions. Waste-to-energy facilities help manage non-recyclable waste while simultaneously producing clean energy, making a positive contribution to the energy sector. Job Creation and Economic Growth The waste management industry creates employment opportunities at various levels, from waste collection and sorting to skilled positions in waste treatment facilities and management. By generating jobs and fostering economic growth, waste management companies contribute to local economies. Additionally, the development and implementation of advanced waste management technologies can drive innovation and attract investments, further stimulating economic development in the sector. They play a critical role in safeguarding the environment, improving public health, promoting recycling, generating energy, and contributing to economic prosperity. As the world continues to prioritize sustainability and responsible resource management, the importance of waste management companies in creating a cleaner and more sustainable future becomes increasingly evident. This article delves into the top 10 waste management companies in India in 2024, exploring their services, contributions, and the positive changes they are bringing to the nation. Waste Ventures India Waste Ventures India has established itself as a pioneer in the waste management industry by focusing on both urban and rural waste challenges. The company’s approach centers on community engagement and waste segregation at the source, thereby promoting responsible waste disposal practices. By involving communities, Waste Ventures India educates citizens about the importance of segregating waste and facilitating the recycling process. This not only reduces the burden on landfills but also contributes to the creation of employment opportunities in the waste collection and recycling sectors. The company’s emphasis on recycling and upcycling has significantly aided in managing waste sustainably. Waste Ventures India is a social enterprise focused on creating sustainable waste management solutions. Here are the potential benefits associated with their work: Environmental Impact: Waste Ventures India contributes to reducing environmental pollution by implementing efficient waste management practices. This includes proper waste segregation, recycling, and responsible disposal methods. By diverting waste from landfills and promoting recycling, they help minimize the negative environmental effects of improper waste management. Job Creation and Livelihoods: The organization’s initiatives often involve creating job opportunities for marginalized communities and individuals. Waste collection, sorting, recycling, and other related activities can employ people who might otherwise face limited job prospects. Resource Recovery: Through their focus on recycling and resource recovery, Waste Ventures India helps conserve valuable resources such as metals, plastics, and paper. This reduces the pressure on raw material extraction, promotes a circular economy, and contributes to sustainable resource management. Community Health and Hygiene: Proper waste management practices significantly improve community health and hygiene. By reducing open dumping and littering, the organization helps prevent the spread of diseases, odors, and pests associated with improper waste disposal. Awareness and Education: Waste Ventures India often conducts awareness and educational programs in the communities they serve. These initiatives can lead to better waste segregation at the source, increased understanding of the importance of recycling, and overall improved waste management behaviors among residents. Sembcorp Environmental Management Sembcorp Environmental Management is a key player in waste management services, offering a holistic approach to waste management that encompasses collection, transportation, treatment, and disposal. The company’s use of advanced technologies like waste-to-energy conversion and bio methanation has propelled it to the forefront of sustainable waste management. By transforming waste into valuable resources such as energy, Sembcorp contributes to both waste reduction and the generation of clean energy, making a positive impact on the environment and energy sector simultaneously. Sembcorp Environmental Management is a leading environmental services provider with a focus on sustainable waste management and resource recovery. Here are five potential benefits associated with their work: Integrated Waste Management Solutions: Sembcorp Environmental Management offers integrated waste management solutions that encompass waste collection, sorting, recycling, treatment, and disposal. This comprehensive approach helps reduce the environmental impact of waste by maximizing resource recovery and minimizing the volume of waste sent to landfills. Resource Recovery and Recycling: One of the key benefits of Sembcorp Environmental Management’s services is their emphasis on resource recovery and recycling. By extracting valuable materials from waste streams and diverting them from landfills, they contribute to the conservation of finite resources and the reduction of greenhouse gas emissions associated with resource extraction. Reduced Environmental Pollution: Through responsible waste management practices, Sembcorp Environmental Management helps prevent pollution of air, soil, and water. Proper waste treatment and disposal methods mitigate the release of harmful substances into the environment, thereby safeguarding ecosystems and human health. Circular Economy Promotion: Sembcorp Environmental Management’s focus on resource recovery aligns with the principles of the circular economy. By promoting the reuse, recycling, and repurposing of materials, they contribute to a more sustainable economic model that minimizes waste generation and optimizes resource use. Community Engagement and Education: Many waste management companies, including Sembcorp Environmental Management, engage in community outreach and education programs. These initiatives raise awareness about the importance of proper waste disposal, recycling practices, and environmental stewardship. By empowering communities with knowledge, the company helps drive positive behavioral changes. Ramky Enviro Engineers Ramky Enviro Engineers has gained recognition for its involvement in large-scale waste management projects. With a focus on integrated solid waste management, hazardous waste treatment, and biomedical waste management, the company addresses diverse waste challenges. By maintaining state-of-the-art facilities and adhering to sustainable practices, Ramky Enviro Engineers significantly contributes to India’s waste management efforts. Ramky Enviro Engineers is a company that provides environmental management and waste management solutions. Here are five potential benefits associated with their work: Comprehensive Waste Management Solutions: Ramky Enviro Engineers offers a range of waste management solutions that encompass collection, segregation, treatment, recycling, and safe disposal of various types of waste. This comprehensive approach helps minimize the environmental impact of waste and contributes to sustainable waste management practices. Resource Recovery and Recycling: The company’s emphasis on resource recovery and recycling helps to extract valuable materials from waste streams, reducing the need for new raw material extraction. This approach supports the conservation of resources and promotes a more circular economy. Environmental Conservation: Ramky Enviro Engineers’ services contribute to environmental conservation by preventing pollution of air, water, and soil. Through proper waste treatment and disposal methods, they help reduce the release of harmful pollutants into the environment. Renewable Energy Generation: Some waste management processes, such as anaerobic digestion and waste-to-energy technologies, can generate renewable energy from organic waste. Ramky Enviro Engineers may be involved in such initiatives, helping to produce clean energy while managing waste. Community Engagement and Awareness: Many waste management companies, including Ramky Enviro Engineers, engage in community outreach and educational programs. These initiatives help raise awareness about the importance of responsible waste disposal, recycling, and environmental protection. By educating communities, the company contributes to positive behavioral changes and better waste management practices. Nepra Resource Management Nepra Resource Management distinguishes itself by offering decentralized waste management solutions. Their approach involves providing tailor-made waste management services to cities and industries, with a strong emphasis on waste reduction, resource recovery, and efficient waste disposal methods. The company’s customized solutions contribute to effective waste management practices while accommodating the unique needs of different regions and industries. Effective Waste Management: Nepra Resource Management might provide solutions for efficient waste collection, segregation, recycling, and disposal. This contributes to a cleaner environment and minimizes the negative impact of improper waste handling. Resource Recovery: Similar to other waste management companies, Nepra Resource Management could focus on extracting valuable resources from waste streams. This helps conserve natural resources and reduces the need for virgin materials. Environmental Protection: By adopting proper waste management practices, Nepra Resource Management could play a role in protecting ecosystems, air quality, water bodies, and soil from pollution caused by improper waste disposal. Circular Economy Promotion: If Nepra Resource Management emphasizes recycling and reusing materials, it could contribute to promoting the principles of a circular economy. This approach helps close the loop between resource consumption and waste generation. Community Engagement and Education: Like many waste management organizations, Nepra Resource Management might engage in community awareness programs to educate the public about responsible waste disposal, recycling, and environmental stewardship. Attero Recycling In an era driven by technology, the responsible disposal of electronic waste (e-waste) is paramount. Attero Recycling specializes in e-waste recycling, salvaging valuable materials from discarded electronics. By recycling e-waste, the company reduces the environmental impact of hazardous materials while also decreasing the demand for raw materials in electronic manufacturing. Attero Recycling is an Indian company that focuses on electronic waste (e-waste) recycling and management. Here are five potential benefits associated with their work: E-Waste Diversion from Landfills: Attero Recycling helps divert electronic waste from ending up in landfills, which can be harmful to the environment due to the presence of hazardous materials in electronic devices. By recycling e-waste, the company reduces the potential for soil and water contamination. Resource Recovery: Attero Recycling’s primary focus is on extracting valuable materials from discarded electronics, such as metals, plastics, and rare earth elements. Recovering these materials not only conserves natural resources but also reduces the need for mining and manufacturing new materials. Hazardous Material Management: Electronic devices can contain hazardous substances like lead, mercury, and cadmium. Attero Recycling follows safe and responsible methods for the handling, removal, and proper disposal of these hazardous materials, minimizing their potential harm to the environment and human health. Energy Conservation: Recycling e-waste requires less energy than mining and refining raw materials. By recovering materials from discarded electronics, Attero Recycling contributes to energy savings and reduces the carbon footprint associated with resource extraction and manufacturing. Job Creation and Socio-Economic Impact: The e-waste recycling industry can create job opportunities in areas such as the collection, sorting, dismantling, and processing of electronic devices. Attero Recycling’s operations could lead to the creation of employment opportunities and skill development within local communities. Saahas Zero Waste Saahas Zero Waste stands as a prominent advocate for zero-waste lifestyles and circular economy principles. The company offers a range of services, including consulting, waste audits, and training programs. Their focus is on minimizing waste generation at the source and encouraging responsible consumption patterns. By promoting a holistic approach to waste management, Saahas Zero Waste contributes to a sustainable future. Saahas Zero Waste is an organization based in India that focuses on sustainable waste management solutions, including waste collection, segregation, recycling, and composting. Here are some key benefits: Waste Reduction and Diversion: Saahas Zero Waste’s initiatives aim to reduce the amount of waste sent to landfills by promoting source segregation, recycling, and composting. By diverting waste from landfills, they help minimize the environmental impact of improper waste disposal. Resource Recovery and Recycling: The organization emphasizes the recovery of valuable resources from waste streams, such as plastics, paper, and metals. This approach contributes to resource conservation, reduces the need for raw material extraction, and supports a more circular economy. Composting and Soil Enrichment: Saahas Zero Waste often promotes composting of organic waste. This not only reduces the volume of waste going to landfills but also produces nutrient-rich compost that can be used to enrich the soil and support sustainable agriculture. Community Engagement and Education: The organization conducts awareness campaigns and educational programs to engage communities in responsible waste management practices. By empowering individuals with knowledge about waste segregation, recycling, and composting, they contribute to positive behavioral changes. Job Creation and Livelihoods: Saahas Zero Waste’s operations can create employment opportunities in waste collection, sorting, processing, and related activities. This is especially beneficial for marginalized communities and individuals who may gain access to sustainable livelihoods. Anthropocene Solutions Anthropocene Solutions has gained acclaim for its waste-to-energy solutions, leveraging advanced technologies like plasma gasification to convert waste into clean energy sources. By reducing greenhouse gas emissions and generating energy from waste, the company addresses two critical environmental concerns simultaneously, making it a frontrunner in sustainable waste management. Here are five potential benefits that could be associated with such efforts: Environmental Stewardship: Initiatives under the banner of “Anthropocene Solutions” could focus on promoting environmental stewardship and responsible management of natural resources. This could involve efforts to reduce pollution, conserve biodiversity, and mitigate the impacts of human activities on ecosystems. Climate Change Mitigation: Addressing the Anthropocene challenges often involves tackling climate change, which is a defining feature of this epoch. Solutions could include promoting renewable energy, advocating for sustainable land use practices, and implementing strategies to reduce greenhouse gas emissions. Sustainable Development: “Anthropocene Solutions” could emphasize sustainable development that balances economic growth with social equity and environmental protection. This might involve supporting projects and policies that foster long-term well-being while minimizing negative impacts on the planet. Education and Awareness: An organization or initiative with this name could contribute to raising awareness and educating the public about the Anthropocene epoch, its challenges, and potential solutions. This could lead to informed decision-making and individual actions that support a more sustainable future. Cross-Disciplinary Collaboration: Addressing the complex challenges of the Anthropocene requires collaboration across various disciplines, including science, policy, economics, and social sciences. “Anthropocene Solutions” could serve as a platform to foster collaboration and the exchange of ideas among experts from different fields. Hanjer Biotech Energies Hanjer Biotech Energies focuses on processing organic waste and generating energy through anaerobic digestion and composting technologies. This approach not only helps manage organic waste but also produces biogas and organic fertilizers. By utilizing organic waste to create valuable resources, the company contributes to waste reduction and renewable energy generation. Here are five potential benefits associated with their work: Waste-to-Energy Conversion: Hanjer Biotech Energies may have been involved in converting organic waste into energy through technologies like anaerobic digestion and biogas production. This process helps generate renewable energy while diverting organic waste from landfills. Reduction in Landfilling: By utilizing waste-to-energy technologies, the company could have contributed to reducing the volume of waste that goes to landfills. This minimizes the environmental impacts associated with landfilling, such as methane emissions and soil contamination. Renewable Energy Generation: If Hanjer Biotech Energies was focused on biogas production from organic waste, they could have contributed to renewable energy generation. Biogas can be used for electricity generation, heating, and cooking, reducing the reliance on fossil fuels. Organic Waste Recycling: The company may have promoted the recycling of organic waste into valuable resources like compost. This contributes to enriching soils, improving agricultural productivity, and closing the nutrient loop. Community Benefits: Hanjer Biotech Energies’ operations could have generated employment opportunities in waste collection, processing, and energy production. Additionally, their waste management and renewable energy initiatives might have had positive impacts on local communities health and environment. Clean India Ventures Clean India Ventures operates with a unique approach, empowering local entrepreneurs through its Swachhpreneur initiative. By enabling individuals to establish decentralized waste management businesses, the company promotes job creation and effective waste handling at the grassroots level. This approach aligns with India’s efforts to involve communities in waste management practices. Here are five potential benefits associated with their work: Improved Sanitation and Hygiene: Clean India Ventures may have been involved in providing sanitation solutions that improve public health and hygiene. By promoting proper waste disposal and access to clean facilities, they contribute to reducing the spread of diseases. Waste Reduction and Recycling: The company may have implemented waste reduction and recycling initiatives, which help divert waste from landfills. This contributes to environmental sustainability by conserving resources and reducing the pollution associated with improper waste disposal. Circular Economy Promotion: If Clean India Ventures emphasized recycling and resource recovery, they could have contributed to the promotion of a circular economy. This approach minimizes waste generation and encourages the reuse of materials, contributing to sustainable resource management. Job Creation: Waste management and sanitation services often create employment opportunities, especially in waste collection, sorting, and processing. Clean India Ventures could have helped generate jobs, particularly in communities that face economic challenges. Community Engagement and Education: The company may have engaged in community outreach and educational programs to raise awareness about proper waste management practices, sanitation, and environmental conservation. These initiatives empower communities to adopt responsible behaviors. Antony Waste Handling Cell Antony Waste Handling Cell is a prominent player in waste collection, transportation, and disposal services. With a significant presence across various states, the company provides integrated waste management solutions that contribute to cleaner and healthier environments. Antony Waste Handling Cell is an Indian company that specializes in integrated solid waste management and collection services, here are five potential benefits associated with their work: Efficient Waste Management: Antony Waste Handling Cell’s services may contribute to efficient waste management by providing organized collection, segregation, transportation, and disposal of solid waste. This helps minimize the negative impacts of improper waste disposal, such as pollution and public health hazards. Waste Diversion from Landfills: The company’s focus on waste segregation and recycling could lead to a reduction in the amount of waste sent to landfills. This helps extend the lifespan of existing landfill sites and reduces the environmental burden associated with landfilling. Resource Recovery and Recycling: Antony Waste Handling Cell’s emphasis on recycling may lead to the recovery of valuable materials from waste streams. This conserves resources, reduces the need for raw material extraction, and supports sustainable resource management. Community Health and Hygiene: Proper waste management practices can improve community health and hygiene by preventing the spread of diseases and minimizing exposure to hazardous waste. By providing systematic waste collection and disposal services, the company contributes to a healthier living environment. Job Creation: Waste management operations often generate employment opportunities in various stages of the waste management process, such as waste collection, sorting, transportation, and processing. Antony Waste Handling Cell’s activities could contribute to job creation and livelihood opportunities, particularly in local communities. Conclusion In 2024, waste management in India has evolved beyond traditional practices, with these top 10 companies spearheading innovative solutions. Their efforts encompass waste reduction, resource recovery, clean energy generation, and community engagement. As India navigates its waste management challenges, these companies exemplify the potential of responsible waste management practices, fostering a more sustainable and eco-friendly future for the nation. Through their collective contributions, these waste management companies pave the way for a cleaner, greener, and more responsible India.","filter_flag":1}
