{"title":"How to make climate finance work for everyone - World Economic Forum","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzA2L2NsaW1hdGUtZGVjYXJib25pemF0aW9uLWZpbmFuY2UtZXF1aXRhYmxlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzA2L2NsaW1hdGUtZGVjYXJib25pemF0aW9uLWZpbmFuY2UtZXF1aXRhYmxlL9IBAA?oc=5","id":"CBMiUWh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzA2L2NsaW1hdGUtZGVjYXJib25pemF0aW9uLWZpbmFuY2UtZXF1aXRhYmxlL9IBAA","guidislink":false,"published":"Mon, 19 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=170, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzA2L2NsaW1hdGUtZGVjYXJib25pemF0aW9uLWZpbmFuY2UtZXF1aXRhYmxlL9IBAA?oc=5\" target=\"_blank\">How to make climate finance work for everyone<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">World Economic Forum<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How to make climate finance work for everyone - World Economic Forum","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzA2L2NsaW1hdGUtZGVjYXJib25pemF0aW9uLWZpbmFuY2UtZXF1aXRhYmxlL9IBAA?oc=5\" target=\"_blank\">How to make climate finance work for everyone<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">World Economic Forum<\/font>","source.href":"https:\/\/www.weforum.org","source.title":"World Economic Forum","query":"https:\/\/news.google.com\/rss\/search?q=\"Low Carbon Technologies\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Climate finance needs to be scaled up and redesigned so that governments, investors and businesses prioritize green solutions. Around $5 trillion will be needed every year by 2050 to meet climate and biodiversity goals, and scale new low-carbon technologies. Recent legislation such as the US Inflation Reduction Act shows how the public sector can steer markets in a new direction. The transition to a decarbonized economy offers the chance to eradicate poverty, reduce inequality and decent employment for all. Every day, governments, financial institutions and corporations have a choice to make: invest in physical assets that emit greenhouse gases and harm nature or prioritize the development of green solutions that foster a stable, resilient and equitable economy. As communities face the harsh impacts of climate change, the choice to build a sustainable future is becoming clearer. Estimates suggest around $5 trillion of capital will be needed every year by 2050 to meet climate and biodiversity goals. These investments are essential to research and scale new low-carbon technologies, to substitute the existing capital stock with sustainable alternatives, to shift business models away from harmful practices and to enable rich countries to support vulnerable ones in their climate resilience and biodiversity protection, all while ensuring that historically marginalized communities share in the broad prosperity created. Systems Change Lab is tracking six major shifts in the finance sector that can drastically transform how investments are scaled and allocated for a sustainable future. If these transformations are achieved together, it will enable the fundamental changes needed for the planet and people to thrive: Discover Accelerating Climate Action Show more A 2018 report by the Intergovernmental Panel on Climate Change found we have until 2030 – just 11 more years – to avert climate change. The run-up to 2020 is a crucial period for delivering sufficient climate action to limit global warming to 1.5°C, as countries move to expand their climate commitments. To help meet this global challenge, the World Economic Forum's 2019 Sustainable Development Impact summit has made Accelerating Climate Action one of four focus areas. Following the UN Secretary-General’s Climate Action Summit this month, this meeting will bring together stakeholders to cap global warming at 1.5°C through innovative partnerships and smart technologies. The action areas include heavy industries and transport, energy innovation, nature-based climate solutions, restoring ocean health and the role cities, among others. 1) Measure, disclose and manage climate- and nature-related financial risks The transition to a decarbonized and nature-positive future will disrupt products and services, especially those that have high emission outputs and are harmful to ecosystems. Not only are there risks to physical facilities, including factories and operations, but also to existing business models. Corporations, financial institutions and regulators must have access to information and a clear understanding of the risks and opportunities to target investments that advance sustainable transformations of their businesses. Accurate disclosures are needed to allow financial institutions and governments to deploy capital efficiently and monitor and manage risks at a portfolio and systemic level. An increasing number of corporations disclose their climate risks under standards created by the Sustainability Accounting Standards Board, which follows recommendations from the Taskforce for Climate-related Financial Disclosures. Analysis from the Systems Change Lab shows that 36% of the largest global companies have set climate risk disclosures (up from about 32% in 2021). By 2030, all of these businesses need to provide disclosures. There is also positive momentum regarding nature-related disclosures. The Taskforce for Nature-related Financial Disclosures framework is in the process of being finalized and has also received substantial support from the private sector. 36% of the world's largest global companies have set climate risk disclosures, expected to reach 100% before 2030. Image: Systems Change Lab Despite progress in adoption, disclosures have been on a voluntary basis with inconsistent quality and gaps in coverage. Governments must play a crucial role in mandating high-quality disclosures to ensure there is universal coverage and uniformity in reporting. Regulators are stepping up. The world’s largest economies and capital markets are considering mandating such disclosures and incorporating them into the supervision of their economies. In 2022, 36 countries planned or set mandatory climate-related disclosures aligned with the Taskforce for Climate-related Financial Disclosures. The countries include Brazil, India, Japan, the United Kingdom, countries in the European Union and the United States. 2) Scale up public finance for climate and nature The public sector can play a significant role in the protection of climate and nature by investing directly in climate initiatives and steering private markets, all while formulating policies that promote an equitable transition toward a green economy. Governments are the biggest allocators of capital in most economies, and their investment is crucial in areas where private finance is unable or unwilling to take a leading role such as development of new, high-risk technologies, public infrastructure and supporting underserved and marginalized communities. Recent climate legislation such as the U.S. Inflation Reduction Act is a concrete example of how the public sector can steer markets in new directions that favor decarbonization, allocate public finance to invest and develop new low-carbon solutions, and address inequities in disadvantaged communities. For example, policies like the Inflation Reduction Act are expected to significantly grow the amount of government investments in research and development of low-carbon technologies, currently estimated to be around $24 billion per year globally. Reactions from the business community, especially the finance sector, have been positive, recognizing that the legislation is expected to dramatically increase the scale of business opportunities and investments in both mature and nascent climate solutions. Climate finance needs to increase more than 10x faster than current trends to stay on track with climate goals. Image: Systems Change Lab To prevent some of the worst impacts of climate change, estimates suggest that public climate finance of at least $1.3 trillion will be needed every year by 2030. In 2020, it totaled $333 billion, significantly below the levels required to meet that target. To bridge the gap, financing needs to grow by more than eight times the historical rate. Fortunately, the Inflation Reduction Act and similar climate-focused legislation being planned in Europe and other major economies will help. Some estimates suggest that the Inflation Reduction Act will result in $1.2 trillion over 10 years in public incentives on clean technologies, with potential to go further depending on uptake. Finally, public finance from developed countries can play a key role in meeting their annual $100 billion commitment to support developing countries on climate mitigation and adaptation. In 2020, the amount totaled $83 billion, falling short of the target. The quality of financing also needs to improve as multilateral development banks, one of the main providers of climate finance, can increase share of grants and concessional loans to give developing countries greater financial flexibility in addressing their climate needs. New initiatives such as the Bridgetown Initiative that aim to help developing countries meet their climate goals by reforming the global financial architecture are gaining momentum and garnering attention. 3) Scale up private finance for climate and nature Meeting climate and nature goals also depends on the participation of the private sector. Some projections suggest that three-quarters of the estimated $5 trillion needed per year by 2030 will come from private sources while historically there has been an even split between public and private climate finance. The corporate sector can help scale the climate solutions needed to decarbonize our economies, but investments need to accelerate more than 10 times to reach the estimated $2.6 trillion to $3.9 trillion per year from the private sector by 2030. There are some signs of progress. Innovative firms have identified which new risks and business opportunities are developing out of the economic transition. An increasing number of firms are adapting their strategies and business models to reduce their exposure to such risks, setting net-zero targets to cut their emissions and investing in new products and services to grow in this new economic reality. The number of corporations with science-based targets that have been independently validated by the Science Based Targets initiative to align with the goals of the Paris Agreement grew 20% in 2022 and continues to increase. Such emissions-reduction targets are expected to influence their business strategies and investments, both on their own operations as well as capital allocated to other firms. But such corporate targets will require further scrutiny, improvement, robust oversight and implementation monitoring. The number of firms with validated science-based targets grew more than 15-fold in the last five years. Image: Systems Change Lab Investors are also aligning their investment allocation — about $7.5 trillion in assets — to net-zero targets by pushing high-emitting companies to change their businesses and shifting capital toward firms developing low-carbon solutions. Investor initiatives like Climate Action 100+ have engaged with the largest corporate emitters of greenhouse gases via joint shareholder proposals and escalation actions to reduce their emissions and adapt their businesses. The pool of capital aligned with net-zero targets is expected to expand as investors increasingly realize that sustainable business practices not only result in more competitive and resilient firms but also align with profitable financial returns. Finally, getting private finance involved in supporting developing countries in their decarbonization and adaptation efforts has long been a goal. While the record of de-risking private finance is mixed, recent initiatives like the Energy Transition Accelerator and the Just Energy Transition Partnerships are novel attempts to harness private finance to decarbonize middle- and low-income countries. 4) Extend economic and financial inclusion to underserved and marginalized groups Our current economic and financial systems have failed to be inclusive in sharing economic prosperity, resulting in historical inequities that have been perpetuated and sometimes worsened, further marginalizing already underserved groups. The transition to a decarbonized and sustainable economy provides an opportunity for historically underserved communities to share in new prosperity which will contribute to a more inclusive, fair and democratic society. Success in implementing a just transition will enable the world to meet the UN Sustainable Development Goals of eradicating poverty, reducing inequality and promoting full employment. Such progress is not only morally right but will also gain popular support and provide the political legitimacy and social stability that allow the transition to be accomplished. To do this, governments can coordinate with the private sector to create high-quality employment in green industries that will enable communities to work and participate in building a decarbonized future. Additionally, access to well-regulated financial resources, such as bank accounts and well-regulated lending, can help them build the financial security needed to become resilient and adapt to a changing environment. In 2021, 76% of the world's adult population had access to a bank account, indicating that the remaining 1.4 billion adults were still considered “unbanked.” The public sector can establish the infrastructure that facilitates access to financial services for all while also providing direct assistance to vulnerable communities with cash transfers, which serve as an entry point into the formal financial system and are an important aspect of social safety nets. Connecting green finance and financial inclusion. Image: Systems Change Lab 5) Price greenhouse gas emissions and other environmental externalities One of the largest challenges to shifting investments to a more sustainable future is the lack of accounting for the negative external costs generated by the fossil-fuel industry and other high polluters that get passed into society. These indirect costs, often referred to as “externalities,” are not adequately captured by prices despite the negative effects attributed to them such as lower quality of life, economic disruption and environmental degradation. As a result, polluters profit from their harmful activities and are not held accountable for these externalities while distorted prices can discourage changes in consumption patterns and efforts to reduce pollution. Applying a direct carbon price via carbon markets or a carbon tax on polluters can ensure that these external costs are properly accounted for in planning and decision-making that reduces environmental harm. While carbon pricing is not a silver bullet to solve climate change, it can complement a broader toolkit of approaches such as industrial policy and incentives for research and development of new low-carbon technologies. Similarly, taxing other environmentally harmful activities such as air pollution, natural resource use and waste can internalize their externalities which are estimated to reach $7.8 trillion annually by 2050. Currently only about 23% of global greenhouse gas emissions are covered by a direct carbon pricing regime. Pricing levels globally average about $23 per ton of carbon dioxide equivalent, which are well below the minimum of $170 required to prevent the most harmful impacts of climate change. To reach complete coverage by 2030 with at least some level of carbon pricing, coverage will need to grow nearly three times the historical rate. The share of GHG emissions covered by direct carbon pricing needs to accelerate 3x faster than historical rates. Image: Systems Change Lab 6) Eliminate harmful subsidies and financing Public and private investments continue to support activities that are incompatible with a sustainable future such as the development of new fossil fuel exploration and land degradation. Shifting investments toward a decarbonized future means stopping such harmful practices and redirecting capital to build a sustainable economy. The public sector continues to provide significant financing and investment to the fossil fuel industry via subsidies, financing from development finance institutions and fossil fuel investments from state-owned companies. Public financing for fossil fuels totaled $687 billion in 2020 — still very far from the phaseout needed by 2030 which requires a decreased pace of almost five times the historical rate. Public financing for fossil fuels needs to decrease 5x faster to achieve a phase-out by 2030. Image: Systems Change Lab Similarly, governments persist in granting detrimental agricultural subsidies that incentivize the overuse of land and excessive use of fertilizers and pesticide, which contribute to environmental degradation. For example, total agricultural support reached $530 billion in 2021 for the countries in the Organization for Economic Co-operation and Development plus 11 major developing economies and it is estimated that 87% of such support is “price-distorting or harmful to nature and health.” Agricultural and fisheries subsidies should be structured to reduce their environmental harm and encourage sustainable practices. Finance for a sustainable future Across these six shifts, we have already seen some positive developments from both public and private finance in channeling financial flows toward creating a green and sustainable economy. Although these signs are encouraging, current levels of investment are still far behind what is required.","filter_flag":1}
{"title":"Why CPG Leaders Must Reimagine Business Models | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LWNwZy1sZWFkZXJzLW11c3QtcmVpbWFnaW5lLWJ1c2luZXNzLW1vZGVsc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LWNwZy1sZWFkZXJzLW11c3QtcmVpbWFnaW5lLWJ1c2luZXNzLW1vZGVsc9IBAA?oc=5","id":"CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LWNwZy1sZWFkZXJzLW11c3QtcmVpbWFnaW5lLWJ1c2luZXNzLW1vZGVsc9IBAA","guidislink":false,"published":"Thu, 08 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=159, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LWNwZy1sZWFkZXJzLW11c3QtcmVpbWFnaW5lLWJ1c2luZXNzLW1vZGVsc9IBAA?oc=5\" target=\"_blank\">Why CPG Leaders Must Reimagine Business Models | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why CPG Leaders Must Reimagine Business Models | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LWNwZy1sZWFkZXJzLW11c3QtcmVpbWFnaW5lLWJ1c2luZXNzLW1vZGVsc9IBAA?oc=5\" target=\"_blank\">Why CPG Leaders Must Reimagine Business Models | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Low Carbon Technologies\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Scores of consumer-packaged goods (CPG) companies have set net-zero commitments. The problem? Extensive interviews with executives across the CPG industry and a BCG survey of their downstream customers in the retail sector indicate that most companies are not on track to meet their pledges to nearly halve their greenhouse gas (GHG) emissions by 2030. Although companies are deploying decarbonization technologies to reengineer their existing products, services, and business models, they are not yet reimagining their business. They have not yet pushed the boundaries of what is possible by further innovating their business models, even within the existing technology landscape. Undoubtedly, technological advances that create significant new opportunities will emerge. But companies can scale existing solutions on the basis of existing technologies over the next eight years by embracing new sustainable business models and building new markets, thereby meeting their 2030 net-zero goals. This article explores the broad principles that CPG companies must embrace to achieve their 2030 goals. Companies can accelerate their journey toward net zero and create advantage by taking a transformation lens to sustainability, by looking holistically at the system they are trying to change in order to focus on what matters, and by collaborating across the value chain. Although it may seem counterintuitive, partnering, even with competitors, is critical to driving change at scale and achieving advantage. In an environment characterized by disrupted supply chains, high inflation, and major geopolitical uncertainty related to the war in Ukraine, companies may find it very tempting to focus primarily on addressing near-term challenges. But inaction on the climate front carries a steep price. Companies that do not move aggressively now may have trouble accessing critical green resources later. They will also cede the lead in burgeoning markets to others and will miss out on capturing significant efficiencies. In contrast, those that seize the lead will establish meaningful competitive advantage. The Risk of Delay GHG emissions have continued to rise over the past two decades, and global CO2 emissions rebounded in 2021 first to match and then to surpass their highest previously recorded level. To limit global warming to an increase of 1.5°C above preindustrial levels, global emissions must peak during the next three years and then fall by 45% by 2030. The CPG industry will play a central role in the ultimate success or failure of that effort because the agri-food supply chain—in which CPG is a prominent player—currently accounts for an estimated 31% of annual global GHG emissions. Despite the urgency of the situation—and some promising initial steps that industry leaders have taken—most CPG companies are not yet moving aggressively to deliver on their climate ambitions. For example, a BCG survey of nearly 1,300 large companies in nine industries (including CPG) conducted in 2021 found that while 96% had set a goal of reducing emissions, only 11% had successfully cut emissions in line with those targets over the previous five years. For CPG companies, decarbonization must be part of a true sustainability transformation. Those that move slowly on this front face increasing risks. For one thing, companies that fail to secure the green resources needed for a sustainability transformation will likely find that those assets are in short supply in the near future. For example, according to BCG estimates , 45% of demand for recycled PET is likely to go unmet in 2025 as a result of supply shortages. In addition, companies that lag on sustainability will miss out on a major value creation opportunity and the chance to generate significant efficiencies. In six industries, including fast-moving consumer goods, BCG research found that the compound annual growth rate was 4 to 25 percentage points higher for green products than for nongreen products. And companies that fail to deliver on their net-zero promises will undermine their credibility with consumers and investors. Reimagining the Business for Sustainability A sustainability transformation starts with a clearly defined ambition, strategy, and roadmap. Building from that foundation, companies must integrate sustainability throughout the existing business, including by establishing sustainability KPIs and embedding them in business reviews. In our work in the industry, we see many companies with a focus on sustainability that have set their strategy and begun to integrate sustainability into the core of the business. But progress is still too slow. The problem is particularly evident in decarbonization work. Efforts to decarbonize can be understood as a matrix based on technology and business model or market. (See the exhibit.)","filter_flag":1}
{"title":"HYZON MOTORS, PERFORMANCE FOOD GROUP SIGN AGREEMENT FOR FUEL CELL TRUCKS - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvaHl6b24tbW90b3JzLXBlcmZvcm1hbmNlLWZvb2QtZ3JvdXAtc2lnbi1hZ3JlZW1lbnQtZm9yLWZ1ZWwtY2VsbC10cnVja3MtMzAxODQ0NTg5Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvaHl6b24tbW90b3JzLXBlcmZvcm1hbmNlLWZvb2QtZ3JvdXAtc2lnbi1hZ3JlZW1lbnQtZm9yLWZ1ZWwtY2VsbC10cnVja3MtMzAxODQ0NTg5Lmh0bWzSAQA?oc=5","id":"CBMif2h0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvaHl6b24tbW90b3JzLXBlcmZvcm1hbmNlLWZvb2QtZ3JvdXAtc2lnbi1hZ3JlZW1lbnQtZm9yLWZ1ZWwtY2VsbC10cnVja3MtMzAxODQ0NTg5Lmh0bWzSAQA","guidislink":false,"published":"Wed, 07 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=158, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvaHl6b24tbW90b3JzLXBlcmZvcm1hbmNlLWZvb2QtZ3JvdXAtc2lnbi1hZ3JlZW1lbnQtZm9yLWZ1ZWwtY2VsbC10cnVja3MtMzAxODQ0NTg5Lmh0bWzSAQA?oc=5\" target=\"_blank\">HYZON MOTORS, PERFORMANCE FOOD GROUP SIGN AGREEMENT FOR FUEL CELL TRUCKS<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"HYZON MOTORS, PERFORMANCE FOOD GROUP SIGN AGREEMENT FOR FUEL CELL TRUCKS - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvaHl6b24tbW90b3JzLXBlcmZvcm1hbmNlLWZvb2QtZ3JvdXAtc2lnbi1hZ3JlZW1lbnQtZm9yLWZ1ZWwtY2VsbC10cnVja3MtMzAxODQ0NTg5Lmh0bWzSAQA?oc=5\" target=\"_blank\">HYZON MOTORS, PERFORMANCE FOOD GROUP SIGN AGREEMENT FOR FUEL CELL TRUCKS<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Low Carbon Technologies\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"The first five vehicles will be upfitted with Hyzon Class 8 110kW fuel cell systems, and an additional 15 FCEVs will be upfitted with Hyzon's next-generation single 200kW fuel cell system, which is conditional on a successful 200kW vehicle trial. Following the initial deliveries, PFG and Hyzon also have agreed to work together regarding a mutually agreeable option for 30 additional FCEVs. \"PFG remains committed to implementing new technologies that help reduce our greenhouse gas emissions and carbon footprint,\" said Jeff Williamson, senior vice president, Operations, PFG. \"As we increase our exploration into alternative fuels and low-carbon technologies, partnering with companies like Hyzon provides us access to advanced products and services that will help us improve our transportation infrastructure.\" The FCEVs will be powered by Hyzon's proprietary fuel-cell system, developed and designed specifically for heavy-duty freight transport. The technology allows customers to transition their fleets to zero-emissions, while maintaining similar operating characteristics. Fueled by energy-dense hydrogen, FCEVs have the power, range, payload, and refueling time more typical of a diesel vehicle. PFG's agreement follows a successful third quarter 2022 vehicle trial, during which PFG deployed a Hyzon 110kW FCEV in their commercial operations in Southern California. PFG currently runs a fleet of more than 7,000 heavy-duty trucks across North America. The first five trucks, powered by Hyzon's 110kW fuel cell system, are expected to be delivered in 2023 and 2024, with the first truck scheduled to arrive in Q4 2023. These trucks are expected to be deployed in PFG's regional, commercial delivery operations in Southern California. Launching with the 110kW vehicles allows PFG to begin the crucial work of decarbonization starting this year, while building driver familiarity with new vehicle technology and delivering operational data to Hyzon. Currently in development, Hyzon's 200kW FCEV brings the power to tackle steep grades and highway speeds over long distances. Instead of the common approach of linking two 110kW fuel cell systems to generate 200kW, Hyzon will provide a single 200kW fuel cell module, reducing cost, weight, and complexity. All vehicles will be delivered through, and contingent upon, California's Hybrid and Zero-Emission Truck and Bus Incentive Program (HVIP), which provides up to $240,000 in price subsidies. \"Hyzon's proprietary fuel cell technology is specifically suited for applications such as food and beverage, characterized by heavier loads and long usage cycles,\" said Parker Meeks, Hyzon's chief executive officer. \"This agreement for up to 50 hydrogen-powered trucks demonstrates how Hyzon intends to build customer familiarity with a new technology as the hydrogen infrastructure accelerates. Working with forward-thinking customers such as PFG, who share Hyzon's mission of decarbonizing operations, allows us to accumulate real operational experience in fuel cell electric trucks, while we simultaneously develop and work to deploy our next-generation 200 kW fuel cell system.\" About Hyzon Hyzon is a global supplier of fuel cell electric mobility, with US operations in the Rochester, Chicago and Detroit areas, and international operations in the Netherlands, Australia, and China. Hyzon is an energy transition accelerator and technology innovator, providing solutions in the transport sector with a focus on commercial vehicles and hydrogen supply infrastructure. Utilizing its proprietary hydrogen fuel cell technology, Hyzon's mission is to supply zero-emission heavy duty trucks to customers in North America, Europe and around the world to mitigate emissions from diesel transportation - one of the single largest sources of carbon emissions globally. The Company is contributing to the adoption of fuel cell electric vehicles through its demonstrated technology advantage, fuel cell performance and history of rapid innovation. Visit www.hyzonmotors.com. About Performance Food Group Company Performance Food Group is an industry leader and one of the largest food and foodservice distribution companies in North America with more than 150 locations. Founded and headquartered in Richmond, Virginia, PFG, and our family of companies, market and deliver quality food and related products to over 300,000 locations including independent and chain restaurants; businesses, schools and healthcare facilities; vending and office coffee service distributors; and big box retailers, theaters and convenience stores. PFG's success as a Fortune 200 company is achieved through our more than 35,000 dedicated associates committed to building strong relationships with the valued customers, suppliers and communities we serve. To learn more about PFG, including how you can join our team, visit pfgc.com. Forward-Looking Statements This press release includes \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. All statements, other than statements of present or historical fact included in this press release, are forward-looking statements. When used in this press release, the words \"aims\", \"could,\" \"should,\" \"will,\" \"may,\" \"believe,\" \"anticipate,\" \"intend,\" \"estimate,\" \"expect,\" \"project,\" the negative of such terms and other similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain such identifying words. These forward-looking statements are based on management's current expectations and assumptions about future events and are based on currently available information as to the outcome and timing of future events. Except as otherwise required by applicable law, Hyzon disclaims any duty to update any forward-looking statements, all of which are expressly qualified by the statements in this section, to reflect events or circumstances after the date of this press release. Hyzon cautions you that these forward-looking statements are subject to numerous risks and uncertainties, most of which are difficult to predict and many of which are beyond the control of Hyzon, including the timing of deliveries under the agreement with PFG, the unavailability, suspension or termination of the HVIP program, the unsuccessful trial of the 200kW FCEV, and the risks and uncertainties described in the \"Risk Factors\" section of Hyzon's Annual Report on Form 10-K for the year ended December 31, 2022 filed with the U.S. Securities and Exchange Commission (the \"SEC\") on May 31, 2023, and other documents filed by Hyzon from time to time with the SEC. These filings identify and address other important risks and uncertainties that could cause actual events and results to differ materially from those contained in the forward-looking statements. Hyzon gives no assurances that Hyzon will achieve its expectations. SOURCE Hyzon Motors Inc.","filter_flag":1}
{"title":"Tesla Of The Sea? How EV Tech Is Revolutionizing Boating - Markets Insider","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3Mvc3RvY2tzL3Rlc2xhLW9mLXRoZS1zZWEtaG93LWV2LXRlY2gtaXMtcmV2b2x1dGlvbml6aW5nLWJvYXRpbmctMTAzMjM2MjcwMdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3Mvc3RvY2tzL3Rlc2xhLW9mLXRoZS1zZWEtaG93LWV2LXRlY2gtaXMtcmV2b2x1dGlvbml6aW5nLWJvYXRpbmctMTAzMjM2MjcwMdIBAA?oc=5","id":"CBMicmh0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3Mvc3RvY2tzL3Rlc2xhLW9mLXRoZS1zZWEtaG93LWV2LXRlY2gtaXMtcmV2b2x1dGlvbml6aW5nLWJvYXRpbmctMTAzMjM2MjcwMdIBAA","guidislink":false,"published":"Thu, 01 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=152, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3Mvc3RvY2tzL3Rlc2xhLW9mLXRoZS1zZWEtaG93LWV2LXRlY2gtaXMtcmV2b2x1dGlvbml6aW5nLWJvYXRpbmctMTAzMjM2MjcwMdIBAA?oc=5\" target=\"_blank\">Tesla Of The Sea? How EV Tech Is Revolutionizing Boating<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Markets Insider<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Tesla Of The Sea? How EV Tech Is Revolutionizing Boating - Markets Insider","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3Mvc3RvY2tzL3Rlc2xhLW9mLXRoZS1zZWEtaG93LWV2LXRlY2gtaXMtcmV2b2x1dGlvbml6aW5nLWJvYXRpbmctMTAzMjM2MjcwMdIBAA?oc=5\" target=\"_blank\">Tesla Of The Sea? How EV Tech Is Revolutionizing Boating<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Markets Insider<\/font>","source.href":"https:\/\/markets.businessinsider.com","source.title":"Markets Insider","query":"https:\/\/news.google.com\/rss\/search?q=\"Low Carbon Technologies\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"The electric vehicle boom isn’t just about passenger cars and trucks, it’s also about the millions of speedboats and other recreational boats whose pollution has, at times, caused more damage than the Exxon Valdez oil spill. And it’s all about the battery, just as it has been with the EV market, and Vision Marine Technologies Inc (NASDAQ:VMAR) is a company investors should keep an eye on as their proprietary technology looks to turn the boating market upside down. It has successfully developed the world’s most powerful marine electric motor, with proprietary technology. And in my opinion is poised to send waves through the industry. This is the year the $12-billion boat battery market joins the green revolution. This is the year the transition to electric begins in earnest. And the first mover advantage is going to Vision Marine, which unveiled its E-Motion 180 HP electric outboard motor, with its proprietary PowerTrain technology, at the Paris Boat Show in December. And has since launched the new H2 Bowrider in partnership with Four Winns. Powered by Vision Marine’s E-Motion, the H2 Bowrider is the first all-electric series production bowrider on the market. The H2e’s top speed is 35 knots (40mph), and while its official debut was in February, deliveries are set to start this summer. The E-Motion is the first fully electric, production-ready, high performance 180 HP, which makes it the key market disruptor. With its one-of-a-kind tech advantage, which includes the batteries, the engine and the software, Vision Marine’s E-Motion is now the only turn-key solution for boat manufacturers in its class. That’s a strong first-mover position to be in at the critical junction of a high-dollar energy transition. On Trend in the Trillion-Dollar Energy Transition Climate Vision Marine isn’t just on trend, it’s helping to set the trend. It was already out of the gates before anyone else even heard the whistle. Its proprietary tech aims to transform the boating industry. In 2022, global investment in the low-carbon energy transition hit a record $1.1 trillion, buoyed by an energy crisis and government policy action around the world. In fact, as noted by BloombergNEF: “In another first, investment in low-carbon technologies appears to have reached parity with capital deployed in support of fossil fuel supply.” While renewable energy was the largest sector in investment terms, topping a record $495 billion in 2022, electrified transport was a close second, with $466 billion spent, up an astounding 54% year-on-year. This is exactly what Vision Marine (NASDAQ:VMAR) is looking to capitalize on with the launch of its game-changing marine-grade battery and boat engines. Vision Marine’s business plan is to market its E-Motion Powertrain to Original Equipment Manufacturers (OEMs) rather than the public, and they have already received dozens of advance orders. And investors are poised to see the company collect its first revenues from the PowerTrain battery technology this year. But there is a second level in this revenue chain, as well: The $5-billion+ boat rental market. Vision Marine’s flagship Newport electric boat rental setup has launched with 35 boats and over 300,000 clients in the first three years, annualizing $4 million in revenues with a 35% profit margin. That’s just the beginning. There are 8,000 marinas in the world, and 10,000 waterfront resorts and marinas, and Vision Marine is eyeing this huge playfield for rapid expansion of its electric rental segment–at a time when going electric has become a must for the environment. This year, they’ll be rolling out two more fully-owned electric boat rental locations and launching their franchise model. By 2024, it’s full speed ahead with scaling. By the end of 2024, Vision Marine expects to be cash-flow positive, and by 2025, it expects to have two profitable and growing divisions, after which the scaling will pick up the pace even faster. And there are some legendary names behind it lending confidence to its targeted goals, not to mention a string of design, engineering and manufacturing partnerships that bode well for production and marketing. The Next Challenge for Speedboats Vision Marine’s E-Motion fully charges overnight with no additional infrastructure, has the highest horsepower in its class on the market, offers the first-ever custom design marine battery packs, and it all comes in at a lower cost than any competitors: E-Motion combines an advanced battery pack, inverter, and high-efficiency motor with proprietary union assembly between the transmission and the electric motor design and extensive control software. E-Motion technology used in this powertrain system is designed to improve the efficiency of the outboard powertrain and, as a result, increase both range and performance. Legend and First-Mover Advantage Designed by boating legend Ian Bruce, the father of the Laser, the world’s most popular sailing boat, Vision’s first motorboat Bruce 22e set a record for the electric boat competition in the famed Lake of the Ozarks Shootout races in August last year after hitting a speed of 49 mph. CEO Mongeon took Vision Marine (NASDAQ:VMAR) from a private company to a NASDAQ listing, successfully raising capital to develop the company’s proprietary technology and commercialize it, earning VMAR the moniker “Tesla of the Sea”. Together, Vision Marine’s team has positioned the company to have a clear first-mover advantage, with the most powerful electric solution on the market. The company boasts zero debt, a highly profitable and growing rental division, first Powertrain revenue this year and expects cash-flow positive standing in 2024. There is comfort in both first-movers and legends from an investors’ standpoint. And Vision Marine is confident enough to have declared after winning the Ozarks Shootout electric-powered boat race and breaking a new record that it would race anyone, anywhere, to prove its propulsion tech is the most powerful in its class in the world. Here are a number of other companies investors should be looking at as the green technology boom continues: Tesla (NASDAQ:TSLA): After a difficult 2022, things are looking up for Tesla. The Model Y emerged as the best-selling vehicle worldwide in the first quarter of 2023 and the company’s stock price has begun to rebound. Tesla's CEO, Elon Musk, recently hinted at exciting developments on the horizon for the company. While he did not unveil specific new products during the annual shareholder meeting, Musk confirmed that two exciting projects are in the pipeline, generating anticipation among investors and enthusiasts alike. Musk also made an unexpected announcement regarding Tesla's advertising strategy recently, expressing openness to exploring paid advertising, a departure from his previous stance against advertising. As Tesla gears up for the highly anticipated Cybertruck delivery event later this year, and with the promise of new products on the horizon, the company remains at the forefront of the electric vehicle revolution. With its visionary leadership, groundbreaking technology, and unwavering commitment to excellence, Tesla continues to shape the future of transportation and solidify its position as a global leader in the automotive industry. Ford (NYSE:F): Despite facing challenges in recent years, Ford is now making significant strides in the electric vehicle market. The company's electric vehicle unit reported losses in 2022 and projected potential losses in 2023. However, Ford remains optimistic about the future, aiming to turn its EV business into a profitable venture by the end of 2026. The company plans to increase EV production capacity to 2 million units per year by 2026, leading to improved profitability. Ford also expects to benefit from selling software and services to EV owners, cost improvements in raw materials, and other incremental gains. With a strong commitment to building an industry-leading portfolio of highly differentiated EVs, Ford aims to capitalize on its strengths in pickup trucks, vans, and SUVs. By embracing innovation, scaling production, and optimizing efficiency, Ford is positioning itself as a significant player in the electric vehicle revolution, poised to shape the future of transportation and solidify its position as a key player in the automotive industry. Rivian Automotive (NASDAQ:RIVN): In a competitive market, Rivian is demonstrating resilience and solid demand for its vehicles, even in the face of increasing vehicle pricing. While competitors have been lowering prices to stimulate demand, Rivian stands out with an average selling price (ASP) increase in the first quarter of 2023 compared to the previous year. With an ASP exceeding $83,000 per vehicle, Rivian's pricing power indicates strong demand, further reinforced by the company's growing backlog of reservations, which reached 114,000 in late 2022. Rivian's ability to maintain an increasing ASP is crucial as it continues to innovate and develop new technologies for its upcoming R2 models. The R2 platform, set to launch in 2024 as Rivian's first high-volume, mass-market vehicle, will come at a lower price point, making it even more appealing to a broader customer base. The company's solid liquidity position, highlighted by recent capital raises and credit facility expansions, sets it apart from many of its competitors, allowing Rivian to make substantial investments, including a new manufacturing plant in Georgia. While Rivian's stock has experienced volatility and a 25% drop this year, the company's enviable balance sheet, strong product adoption, and focus on improving efficiency could provide a compelling case for investors with an appetite for risk. General Motors (NYSE:GM): General Motors has emerged as a formidable competitor in the electric vehicle (EV) market, surpassing Ford in the first quarter of 2023. With a focus on scaling production and boosting its EV lineup, GM aims to solidify its position as a key player in the race to catch up with Tesla. In the first quarter, GM's EV sales soared to 20,670 units in the U.S., surpassing Ford's sales by nearly two to one. GM is scaling the production of its Ultium Platform and expects margin gains as a result. GM's strong performance in the first quarter can be attributed to record sales of the Chevy Bolt EV and EUV, along with upcoming launches of highly anticipated models like the Chevrolet Silverado EV, Cadillac LYRIQ, Chevrolet Blazer EV, and Equinox EV. The company plans to produce 50,000 EVs in the second quarter and double that production rate in the second half of the year, signaling its commitment to meeting growing demand. GM's impressive cash flow and earnings, along with the potential for increased dividend payouts, make it an interesting choice for investors seeking exposure to the EV market. Albemarle Corporation (NYSE: ALB): Few companies have benefited from the electrification of transport as much as Albemarle, the world’s largest lithium producer, has. Despite facing headwinds from elevated raw material costs and demand weakness in specialties, Albemarle is strategically positioned to capitalize on the long-term growth of the battery-grade lithium market. In the first quarter of 2023, Albemarle saw higher volumes, supported by the La Negra III\/IV expansion in Chile and an increase in tolling volumes. Additionally, the company's cost-saving and productivity initiatives are expected to support its margins throughout 2023. To meet the increasing demand for electric vehicles and lithium-ion batteries, Albemarle recently announced the site for its lithium mega-flex facility in South Carolina. With an initial investment of $1.3 billion or more, the facility aims to produce approximately 50,000 metric tons of battery-grade lithium hydroxide annually, which can be increased to 100,000 metric tons. This capacity can support the production of about 2.4 million electric vehicles per year. The facility aligns with the Inflation Reduction Act and contributes to the localization of crucial minerals in North America. The company is also actively investing in projects in Western Australia and China to enhance its global lithium conversion capacity. Fisker (NYSE: FSR): After a long decline, Fisker’s stock price recently jumped as the company launched a financing website for its customers following the successful delivery of its first Fisker Ocean EV SUV. The fiskerfinance.com platform aims to provide a convenient and streamlined financing process for customers, covering all aspects from car loan applications to payment tracking. By facilitating the buying process, Fisker hopes to benefit from increased customer accessibility and convenience. With Fisker's vehicles hitting the roads, the introduction of the financing website is a logical step to support customers in purchasing their EVs. In a competitive market in which Tesla is currently cutting prices aggressively, Fisker’s ability to facilitate the purchase of its Fisker Ocean SUV, which has a commendable range of up to 440 miles on a full charge, could be a game-changer for the company. ChargePoint (NYSE: CHPT): A prominent player in the EV charging industry, ChargePoint operates across multiple countries and enjoys a strong position in the U.S. market. As the adoption of EVs continues to grow, ChargePoint is well-positioned to benefit from this trend. While ChargePoint has experienced declining profits, it has consistently demonstrated strong revenue growth, ranging between 90% and 100% over the past five quarters. Analysts predict that the company will begin to reduce its losses by next year, presenting potential growth opportunities for investors. ChargePoint currently serves 80% of Fortune 50 companies, and as these businesses incorporate more EVs into their fleets, ChargePoint's revenue and profits are expected to increase and the company hopes to break into profitability within the next three years. The company’s Q1 financial results are set to be announced on June 1, 2023. Blink Charging (NASDAQ: BLNK): Another EV charging giant, Blink Charging has experienced a significant decline in share price, down approximately 70% from its previous highs, despite its unchanged long-term prospects. However, the company has secured new contracts for EV charging station deployments and is addressing overspending and executive compensation issues. Notably, Blink Charging has won a contract with the federal government through the GSA to provide EV charging stations, which could potentially result in an annual revenue boost of $20 million. Additionally, the company has obtained an IDIQ contract from the United States Postal Service to sell up to 14,500 charging stations, potentially generating around $20 million annually. Blink Charging has been focusing on improving its margins and reducing expenses. The company has been successful in raising prices while lowering the cost of generating revenues. Over the past four years, Blink Charging has been able to increase its gross margins, reaching approximately 33% in the most recent quarters. With a combination of price increases and cost reductions, the company aims to achieve a 35% gross margin in the long run, leading to a smoother path to profitability. Nvidia (NASDAQ:NVDA): While most companies in the EV space are suffering from intense competition, Nvidia is taking advantage of it. The U.S. chip giant has become a key player in China's electric vehicle (EV) market as several Chinese automakers choose its technology to power their semi-autonomous driving systems. Start-ups Xpeng and Nio, as well as Baidu's auto unit Jidu and Geely's Polestar brand, have adopted Nvidia's Drive Orin chip for their latest vehicles. Nvidia's chipset and software platform offer the capabilities for fully autonomous driving, making it a highly attractive choice for Chinese EV companies. In China's fiercely competitive EV market, Nvidia is benefiting from the intensifying competition among automakers. Despite Tesla's strong brand presence and record sales in China, the American electric vehicle manufacturer designs its own semiconductors for its ADAS, called the Full Self-Driving (FSD) chip. This has opened up an opportunity for Nvidia, as Chinese EV players seek to close the perceived technology gap with Tesla by partnering with the chip giant. Nvidia's strong presence in the Chinese market and its strategic focus on expanding its auto chip business around FSD position it well to meet the demands of Chinese EV makers and capitalize on the growing market. QuantumScape (NYSE:QS): Focused on developing solid-state lithium-metal batteries for electric vehicles (EVs), QuantumScape presents an intriguing opportunity, albeit one with significant risk. The company's innovative battery technology has the potential to revolutionize the EV industry by enabling lighter, safer, and faster-charging batteries with longer life cycles. QuantumScape has made notable progress, with promising testing results for its 24-layer cell prototype, demonstrating high-level fast charging and minimal capacity loss. The company has received investments from major players like Volkswagen and has garnered interest from other auto companies. If QuantumScape successfully brings its products to market, it could witness explosive sales and earnings growth, leading to substantial returns for investors. The company is still in the pre-revenue stage, relying on prototype technologies, and faces challenges in terms of reliability and commercialization. Its substantial operating expenses and the need for significant capital expenditures highlight the financial uncertainties it faces. Additionally, QuantumScape is not the only player in the potentially revolutionary battery technologies space, as competitors like CATL, Toyota, Samsung, and others pose potential challenges. Scaling up manufacturing could prove costly and encounter unforeseen obstacles. Undoubtedly an exciting company in the space, but with plenty of risk associated. By. James Stafford IMPORTANT NOTICE AND DISCLAIMER The owner of Oilprice.com owns shares of Vision Marine Technologies Inc (NASDAQ:VMAR) and therefore has an incentive to see the stock perform well. The owner of Oilprice.com has no present intention to sell any shares in the near future but does not undertake any obligation to notify the market when it decides to buy or sell shares of the issuer in the market. This share ownership should be viewed as a major conflict with our ability to be unbiased. This is why we stress that you conduct extensive due diligence as well as seek the advice of your financial advisor or a registered broker-dealer before investing in any securities. Readers should beware that third parties, profiled companies, and\/or their affiliates may liquidate shares of the profiled companies at any time, including at or near the time you receive this communication, which has the potential to hurt share prices. Frequently companies profiled in our articles experience a large increase in volume and share price during the course of investor awareness marketing, which often ends as soon as the investor awareness marketing ceases. The investor awareness marketing may be as brief as one day, after which a large decrease in volume and share price may likely occur. This communication is not, and should not be construed to be, an offer to sell or a solicitation of an offer to buy any security. Neither this communication nor the Publisher purport to provide a complete analysis of any company or its financial position. The Publisher is not, and does not purport to be, a broker-dealer or registered investment adviser. This communication is not, and should not be construed to be, personalized investment advice directed to or appropriate for any particular investor. Any investment should be made only after consulting a professional investment advisor and only after reviewing the financial statements and other pertinent corporate information about the company. Further, readers are advised to read and carefully consider the Risk Factors identified and discussed in the advertised company’s SEC, SEDAR and\/or other government filings. Investing in securities, particularly microcap securities, is speculative and carries a high degree of risk. Past performance does not guarantee future results. This communication is based on information generally available to the public and on interviews with management and does not contain any material, non-public information. The information on which it is based is believed to be reliable. Nevertheless, the Publisher cannot guarantee the accuracy or completeness of the information. FORWARD LOOKING STATEMENTS. This publication contains forward-looking statements, including statements regarding expected continual growth of the featured company and\/or industry. The Publisher notes that statements contained herein that look forward in time, which include everything other than historical information, involve risks and uncertainties that may affect the companies’ actual results of operations. Factors that could cause actual results to differ include, but are not limited to, the size and growth of the market for the companies’ products and services, the companies’ ability to fund its capital requirements in the near term and long term, pricing pressures, etc. INDEMNIFICATION\/RELEASE OF LIABILITY. By reading this communication, you acknowledge that you have read and understand this disclaimer, and further that to the greatest extent permitted under law, you release the Publisher, its affiliates, assigns and successors from any and all liability, damages, and injury from this communication. You further warrant that you are solely responsible for any financial outcome that may come from your investment decisions. TERMS OF USE. By reading this communication you agree that you have reviewed and fully agree to the Terms of Use found here https:\/\/oilprice.com\/terms-and-conditions. If you do not agree to the Terms of Use https:\/\/oilprice.com\/terms-and-conditions, please contact Oilprice.com to discontinue receiving future communications. INTELLECTUAL PROPERTY. Oilprice.com is the Publisher’s trademark. All other trademarks used in this communication are the property of their respective trademark holders. The Publisher is not affiliated, connected, or associated with, and is not sponsored, approved, or originated by, the trademark holders unless otherwise stated. No claim is made by the Publisher to any rights in any third-party trademarks. Read this article on OilPrice.com This story originally appeared on Oilprice.com","filter_flag":1}
{"title":"The Subduing Love for Coal! - TimesTech","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMGh0dHBzOi8vdGltZXN0ZWNoLmluL3RoZS1zdWJkdWluZy1sb3ZlLWZvci1jb2FsL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMGh0dHBzOi8vdGltZXN0ZWNoLmluL3RoZS1zdWJkdWluZy1sb3ZlLWZvci1jb2FsL9IBAA?oc=5","id":"CBMiMGh0dHBzOi8vdGltZXN0ZWNoLmluL3RoZS1zdWJkdWluZy1sb3ZlLWZvci1jb2FsL9IBAA","guidislink":false,"published":"Tue, 20 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=171, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMGh0dHBzOi8vdGltZXN0ZWNoLmluL3RoZS1zdWJkdWluZy1sb3ZlLWZvci1jb2FsL9IBAA?oc=5\" target=\"_blank\">The Subduing Love for Coal!<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TimesTech<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Subduing Love for Coal! - TimesTech","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMGh0dHBzOi8vdGltZXN0ZWNoLmluL3RoZS1zdWJkdWluZy1sb3ZlLWZvci1jb2FsL9IBAA?oc=5\" target=\"_blank\">The Subduing Love for Coal!<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TimesTech<\/font>","source.href":"https:\/\/timestech.in","source.title":"TimesTech","query":"https:\/\/news.google.com\/rss\/search?q=\"Low Carbon Technologies\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"The IEA forecasts that global electricity demand is expected to rise by 3% per year over the 2023-2025 period, compared with the 2022 growth rate. Therefore, a way towards a greener world has taken the storm across the globe. Every country today is taking stiff action to cut down carbon emissions by amending renewable and alternate energy goals. It is reported that by 2024, approx. 33 percent of the world’s electricity will be produced by renewables which accounts a significant step toward the global goal of net zero by 2050. In this green revolution, solar photovoltaic (PV) is said to flaunt a handsome 60 percent (or at least 697 gigawatts) of growth, Onshore wind (309 GW), hydropower (121 GW), offshore wind (43 GW) and bioenergy follow (41 GW) according to Renewables 2019, a report from the International Energy Agency published in November 2019. Another report from Electricity Market Report 2023 predicts that renewable energy sources such as solar and wind power, together with nuclear, will on average meet more than 90% of the increase in global demand by 2025. More than 70% of this is expected to come from China, Southeast Asia and India, the report says. However, advanced economies are looking to generate more electricity, as well as reduce reliance on fossil fuels in sectors like heating and transportation. Asia will account for half the world’s electricity consumption by 2025. Image: IEA. On the other hand the key reasons for the growth of alternative energy have been the plunging production costs, growing concern around climate change, evolving global energy policies and increased pressure from investors on companies to adopt environmental social governance (ESG) policies are pushing renewables into the mainstream. Reports Eyes Growth Towards the Renewable Sector Today it is reported that the worldwide renewable power generation mix is set to witness another leap accounting for a rise from 29% to 35% by 2025. In the coming time the boom in renewables will bring the usage of conventional form of energy, i.e. coal and gas-fired generation. And so will global power-sector CO2 emissions which will stall to 2025, despite reaching an all-time high in 2022 of about 13.2Gt CO2. China will account for close to half of the additional renewable generation, followed by the European Union with 15%, the IEA says. This growth is being fuelled by increased government spending on renewables as part of economic recovery plans, the report explains. In the US, alone, the Inflation Reduction Act will provide $370 billion in clean energy investments. Nuclear output is expected to grow on average by around 3.6% a year. This will come from the anticipated recovery in nuclear generation in France, as scheduled maintenance is completed. New plants will also come online, mainly in Asia, the report says. Renewable energy growth will reduce fossil fuel electricity generation. Image: IEA. Carbon Pricing Mechanism Status and trends of carbon pricing mechanisms in 2022 Carbon pricing is a key instrument to mitigate emissions, incentivise investments in low-carbon technologies and reduce demand for greenhouse gas (GHG)-intensive activities. Such policy instruments usually take the form of a carbon tax, an Emission Trading System (ETS) or a hybrid of the two. Due to the ongoing energy crisis, carbon pricing policies have entered uncharted territory, and are facing new challenges hindering their effectiveness. While the EU’s carbon price influences the variable generation cost, and hence the merit-order of the power plants, carbon pricing is currently unable to perform its traditional role of incentivising a coal-to-gas switch in electricity production given exceptionally high gas prices. Nevertheless, carbon pricing still has a crucial role to play in maintaining a long-term investment signal and making carbon-intensive fossil generation such as coal-fired electricity an economically unattractive solution. In addition, it can be a useful instrument to generate additional revenue for governments to support faster clean energy transitions, and mitigate social and competitiveness impacts. As of April 2022, 68 carbon pricing initiatives were in place worldwide, covering over 23% of GHG emissions, with the majority in the form of an ETS. Many of them saw carbon price increases compared to 2021. The price of allowances in the EU ETS, the most established ETS globally, rose from an average of USD 50\/t CO2-eq to more than USD 90\/t CO2-eq for January to April 2022. Prices in the UK ETS rose to more than USD 100\/t CO2-eq, and doubled in the New Zealand ETS (USD 50\/t CO2-eq) and in state-level systems in the United States. Allowance prices in Korea (USD 19\/t CO2-eq) and China’s national ETS (USD 9\/t CO2-eq) increased only slightly. Despite these increases, less than 10% of global emissions are covered by a carbon price that is higher than USD 10\/t CO2-eq. In some jurisdictions in 2022, carbon pricing instruments have had difficulty incentivising a fuel switch to lower-carbon sources due to high natural gas prices. For example, EU coal-fired generation rose by 6% in 2022. Will Asia Pacific’s Major Generation Will Remain Coal Economic realities in the Asia-Pacific region mean that any significant reduction of coal consumption will prove challenging. Large Asian economies are experiencing a strong rise in electricity demand, which is set to continue over the coming decades to sustain economic growth. When it comes to meeting new demand, coal is still seen as the most affordable option for base-load power. At the 26th U.N. Climate Change Conference (COP26) in November 2021, China and India were the two major hold-outs on coal, agreeing only to phase down rather than phase out this fossil fuel. In China for instance, coal-fired generation will remain relatively flat and elevated this decade, although its share is set to reduce to 51% of power generation by 2030 from two-thirds today, with faster growth in renewables. In India, coal-fired generation will still expand substantially this decade to meet soaring demand. This is despite over 40 countries pledging to phase out coal at COP 26. Electricity demand grew by an estimated 3.3% in 2022 in the Asia Pacific region, led by a strong rise in India (8.4%) that was partially offset by subdued growth in China (2.6%) due to the slowdown in the economy stemming from its zero-Covid policy. Demand in the two countries represented about 70% of the region’s total electricity use of 13 500 TWh, which accounts for approximately 50% of global consumption. More than half of the increase in 2022 was met by renewables, of this renewable output almost 60% was from China. The majority (57%) of the region’s electricity was generated by coal in 2022, with low-carbon sources, such as nuclear and renewables, contributing to 32% of the mix. As a result of its strong reliance on coal for power, Asia Pacific has the highest electricity generation CO2 intensity of our analysed regions, at 590 g CO2\/kWh in 2022, compared to a global average of 460 g CO2\/kWh. Power systems in several countries came under severe pressure during 2022, due to both sharply elevated global energy prices and extreme weather events, highlighting the critical need for electricity security. China experienced its longest heatwave in decades, worsening drought conditions that left the Yangtze River at record-low water levels. South Asia was similarly affected, with heatwaves in India starting exceptionally early in the spring and the worst recorded in 122 years. These extreme weather events led to record-breaking electricity demand for cooling, which was compounded by a fall in hydropower generation and coal supply shortages. In Japan, the government issued a power shortage warning for the first time ever, calling for reduced electricity consumption as very low temperatures and a 7.4 magnitude earthquake in March 2022 put the power system at risk of not being able to meet demand. Similar calls to reduce power use amid tight supply were made in Thailand, a gas dependent country sensitive to high prices. The convergence of weather events and record-breaking gas prices led to higher coal use in electricity generation for the Asia Pacific region in 2022 (+2.5% on 2021 levels), but going forward its share in the mix will decline. Coal power is expected to fall to 52% in the electricity mix in 2025, with the share of low-carbon sources rising to 38%, driven mainly by strong y-o-y growth of almost 12% annually in renewable electricity generation, which will raise its share in the mix from 26% in 2022 to 32% in 2025. The share of gas-fired generation will decrease slightly from 10% in 2022 to reach 9% in 2025. Steady growth in electricity consumption on an average of 4.6% every year is forecast in the next three years, with renewables meeting almost two thirds of that additional demand. The higher share of renewables in the mix will help reduce the average CO2 intensity in the region to 535 g CO2\/kWh in 2025. However, CO2 emissions from power generation will continue to rise by an average 1.2% per year to 2025, as coal-fired generation, despite having a diminishing share in the generation mix, remains the main fuel in the region and grows on average 1.3% per year. In 2025, the CO2 intensity of the Asia Pacific region remains the highest globally. China And India’s Policies to Counter Carbon Emission China has pledged to achieve peak carbon emissions by 2030 and may well meet this target earlier, given its track record of overdelivering on its five-year renewables targets. Carbon emission growth in the country has started slowing since 2012, when larger rollouts of wind and solar capacity began. The lingering impact of COVID-19, which is still leading to lockdowns in Asia, could help make targets more attainable, since energy demand is currently somewhat lower than anticipated, although coal use has also rebounded faster than expected. S&P Global Ratings believes that India, on the other hand, will likely miss its 2022 renewable energy capacity targets, and its ambitious 2030 targets would be even harder to achieve with the country set to continue increasing coal use until 2050. China’s policy approach is multi-faceted, serving to discourage coal-fired generation while encouraging renewables. With the launch of China’s carbon market in the summer of 2021, coal-fired power plants will need to comply with emissions targets. By contrast, India’s policies are aimed at making renewables and other alternatives more attractive rather than penalizing coal use. In our view, India still lacks comprehensive energy transition policies and a clear commitment to phase out coal.","filter_flag":1}
