{"title":"Insurance Product Life Cycle Management for Life & Annuity","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ceaeb1b458b9719e8385f620591&url=https%3a%2f%2fsmallbusiness.chron.com%2finsurance-product-life-cycle-management-life-annuity-81631.html&c=13982660618711608153&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ceaeb1b458b9719e8385f620591&url=https%3a%2f%2fsmallbusiness.chron.com%2finsurance-product-life-cycle-management-life-annuity-81631.html&c=13982660618711608153&mkt=en-us","summary":"Performing these tasks requires the innovation to create new products and services that ... Like other products and services, insurance product life-cycle management begins when a company comes ...","published":"Tue, 24 Jul 2018 12:58:00 GMT","published_parsed":"time.struct_time(tm_year=2018, tm_mon=7, tm_mday=24, tm_hour=12, tm_min=58, tm_sec=0, tm_wday=1, tm_yday=205, tm_isdst=0)","news_source":"Houston Chronicle","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Insurance Product Life Cycle Management for Life & Annuity","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Performing these tasks requires the innovation to create new products and services that ... Like other products and services, insurance product life-cycle management begins when a company comes ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Product life cycle management\" \"new products\"&format=rss","text":"Both life and annuity needs change over time, and an insurance agency must be conscious of remaining on top of the differing needs of its customers to ensure that their business relationship doesn’t end when the clients’ need for that particular policy does. A young couple with two young children, for example, has different life insurance needs than a couple pondering retirement whose children are grown. The former likely will be more concerned with the affordability and the amount of coverage, making sure that the family is protected if something happens to either part of the couple. The latter may instead be focused on tax advantages, ease of passing the money down to heirs or accessing some of the funds to help maintain their lifestyle.","filter_flag":1}
{"title":"The Importance of Income Elasticity in Decision Making","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ceaeb1b458b9719e8385f620591&url=https%3a%2f%2fsmallbusiness.chron.com%2fimportance-income-elasticity-decision-making-33994.html&c=12410039720587215308&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ceaeb1b458b9719e8385f620591&url=https%3a%2f%2fsmallbusiness.chron.com%2fimportance-income-elasticity-decision-making-33994.html&c=12410039720587215308&mkt=en-us","summary":"\"Innovators\" are the consumers who are first to buy new products. They typically ... Income elasticity also comes into play with product life-cycle management. Overall demand for products are ...","published":"Wed, 18 Jul 2018 03:33:00 GMT","published_parsed":"time.struct_time(tm_year=2018, tm_mon=7, tm_mday=18, tm_hour=3, tm_min=33, tm_sec=0, tm_wday=2, tm_yday=199, tm_isdst=0)","news_source":"Houston Chronicle","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Importance of Income Elasticity in Decision Making","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"\"Innovators\" are the consumers who are first to buy new products. They typically ... Income elasticity also comes into play with product life-cycle management. Overall demand for products are ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Product life cycle management\" \"new products\"&format=rss","text":"Income elasticity also comes into play with product life-cycle management. Overall demand for products are usually higher during their introduction and growth stages. The challenge comes as a product ages and more substitutes become available. This usually happens in the maturity or decline stages of the product life cycle. A small company may need to diversify its product line to attract consumers with less disposable income. One way to accomplish this is to provide new features, flavors or fragrances for the products while keeping prices the same. A small company may also need to find new uses for their products to attract customers with more disposable income. For example, a consumer soap manufacturer may find that its products also sell well among workers in plants and factories. The plants and factories would be the new market -- one that may be less sensitive to price changes. And these entities would foot the bill for the products instead of the consumers.","filter_flag":1}
{"title":"Managing the product and the process record: Benefits of using product life cycle","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ceaeb1b458b9719e8385f620591&url=https%3a%2f%2fwww.isa.org%2fintech-home%2f2017%2fjanuary-february%2ffeatures%2fmanaging-the-product-and-the-process-record-benefi&c=15607788477569663833&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ceaeb1b458b9719e8385f620591&url=https%3a%2f%2fwww.isa.org%2fintech-home%2f2017%2fjanuary-february%2ffeatures%2fmanaging-the-product-and-the-process-record-benefi&c=15607788477569663833&mkt=en-us","summary":"This information is typically stored in a product life-cycle management (PLM) system. PLM facilitates the secure sharing of product information among internal and external team members, streamlines ...","published":"Sat, 29 Jan 2022 00:01:00 GMT","published_parsed":"time.struct_time(tm_year=2022, tm_mon=1, tm_mday=29, tm_hour=0, tm_min=1, tm_sec=0, tm_wday=5, tm_yday=29, tm_isdst=0)","news_source":"ISA","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Managing the product and the process record: Benefits of using product life cycle","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"This information is typically stored in a product life-cycle management (PLM) system. PLM facilitates the secure sharing of product information among internal and external team members, streamlines ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Product life cycle management\" \"new products\"&format=rss","text":"By Chuck Cimalore InTech Summary Creating efficiencies within test and assembly processes decreases manufacturing costs. There are benefits to tying manufacturing process management to the product record. Integrating product life-cycle management with manufacturing systems synchronizes bill of material and routing information. Management technology to control downstream processes By Chuck Cimalore It is well known that getting a product to market quickly is critical to a company’s success. There are many steps involved in this process, and manufacturers need to continuously find areas to improve in order to meet product goals. In the ongoing challenge to continually decrease time to market, manufacturers must examine every segment of the product development process for potential improvement. One area that manufacturers often overlook is product test and assembly. Even automated test and assembly processes can take considerable time and effort to prepare, document, and describe all the required steps and procedures. Because many manufacturers also rely on outsourced partners for test and assembly, inherent problems—such as lack of access to product data, time zone or availability issues, and language barriers—often cause delays in product release schedules. Without centralized access to information, an event like a product change that was not communicated to a test and assembly partner due to one of the challenges listed above can result in costly scrap and rework. Describing and documenting the procedures involved in a product’s test and assembly process are often referred to as manufacturing process management (MPM)\/bill of material (BOM) routing. Manufacturing process management defines how a product is to be manufactured and usually involves the process of segmenting a product BOM into a series of operations and sequences. These sequences\/routings describe how a particular assembly process or step is to be performed and the materials each step consumes. Some refer to such descriptions as recipes, because there are many parallels to the culinary world. Today, many manufacturers create and manage routing information in enterprise resource planning (ERP) or material requirement planning (MRP) systems, while others use custom applications or spreadsheets. The majority of these legacy systems cannot link the routing data to engineering information, such as computer-aided design (CAD) drawings, behavioral parameters, and vendor specifications and datasheets. This information is typically stored in a product life-cycle management (PLM) system. PLM facilitates the secure sharing of product information among internal and external team members, streamlines the communication of information (i.e., new products, changes, revisions, and configurations), and provides automated alerting and approval tracking processes. PLM is also a central source to access and share information with engineering design environments and manufacturing systems. Therefore, routing information managed within the PLM system can be easily linked to engineering data. With a PLM system, accurate product information is available in real time for all necessary parties, and outsource partners can truly function as a seamless extension of the product development team. Tying BOM routing to the product record PLM systems have traditionally focused on engineering and product data management processes. PLM automates processes. It also provides a central location to manage all the information associated with a product and tracking capabilities to easily capture and resolve issues. As PLM has evolved and its functionality has grown to encompass more information management across organizations, there is an obvious fit for PLM to support downstream processes, such as manufacturing process management\/BOM routing, to further streamline information synchronization and reduce manufacturing costs. Shop floor personnel access routing information in PLM software through terminals at their job site. Typically, the PLM system is where BOMs are created and revisions to the BOMs are managed. The natural evolution is for the PLM system to provide the BOM routing functionality to define test and assembly operations and sequences to link these processes back to the engineering data. This lets test and assembly personnel easily view documents, drawings, and pictures directly from the PLM vault. Using PLM as the source for BOM routing also allows them to validate all engineering change orders (ECOs) and new BOM revisions with the routings\/work instructions. Because the PLM system manages the BOM\\, it can provide instantaneous feedback on required and consumed material quantities to eliminate waste and shortages. Moreover, manufacturers use graphical depictions (photos, images, and drawings) to further describe complex test and assembly procedures and assist with language barrier and translation issues. PLM allows manufacturers to associate documents and images with manufacturing procedures. Being able to view a picture of a particular procedure along with (or in lieu of) written instructions—a capability not commonly available in legacy systems—can help eliminate mistakes and ensure a higher level of quality. Because PLM manages information electronically, paper-based, error-prone processes can be eliminated and help to reduce manufacturing costs. Integrating PLM with ERP\/MRP Even with PLM managing BOM routing, integration between PLM and ERP\/MRP is still important to effectively manage routings, because cost and timeline information is driven from the ERP\/MRP systems. Most companies with both PLM and ERP\/MRP systems have established an integration process that passes new and updated BOMs and revisions from PLM to ERP\/MRP. Passing routing information is a simple extension of that integration. Doing so allows both systems to contain synchronized BOM and routing information. The result is a PLM system that gives the manufacturing group all the necessary data to successfully build and test products and an ERP\/MRP system that contains automatically generated, up-to-date, and more accurate routing information to track costs and delivery dates. Sharing data between PLM and ERP\/MRP through an automated process avoids errors introduced from manually entering BOMs and ensures manufacturing groups have correct and current information within the ERP\/MRP system. A great example of this process and its benefits comes from a supplier of high-power amplifiers for satellite communications. The company uses a PLM system to automate paper processes for faster, more accurate product development. Because the master record for all product data includes BOMs, specifications, ECOs, and quality processes, managing BOM routing within its PLM environment was a natural extension of the BOM management processes. Managing routings within the PLM system let the company easily connect the engineering BOM with the manufacturing BOM and eliminated the prior disconnect it experienced whenever there was a change. This also let the company link the 2D and 3D CAD drawings and captured images of assembly steps (via a digital camera) with the routing data. Personnel on the shop floor can display the routing information on touch-screen terminals loaded only with a browser and 3D CAD viewer and view all assembly and test information, a graphical depiction (digital images), and a 3D model of the products. Because the PLM system also provides quality and corrective-action, preventative-action tracking, assembly and test issues can be raised automatically along with the associated offending product or material from these same terminals. Due to the enhanced routing data and streamlined information, the company has had radically fewer manufacturing (assembly and test) issues and reduced overall manufacturing time. Key benefits of managing MPM\/BOM routing with PLM technology Routing information linked directly to engineering data and product record: Ensure data accuracy with revision and ECO\/change-controlled routing. Graphical depictions for accurate assembly: Using images instead of text-based assembly sequences helps avoid issues commonly associated with language barriers. Revision-based routing to maintain revision history: Access the complete history of changes and revisions to know who, what, when, and why a change was made. Automated change or ECO process to verify and update routing information: Validate engineering change orders and new BOM revisions with the BOM routings\/work instructions to ensure routing information is up to date and accurate. Electronic workflow approval process: Improves collaboration among all constituents and offers parallel sign-off processing to reduce cycle times. Dynamic BOM validation to identify inventory issues: Provides instantaneous feedback on required and consumed material quantities to eliminate waste and shortages. Corrective actions created dynamically from routing operations: Automatically raise assembly, test, and defective material actions with integrated quality management. Eliminate paper printouts: All documentation contained within the PLM system can be accessed from a web browser to eliminate the cost and time of printing lengthy assembly documentation. Reduce manufacturing costs: Eliminate inefficiencies related to paper-based, error-prone processes and provide visibility into engineering change, BOM, and quality information. Evolution As enterprise applications evolve, it is important to take a step back and evaluate what processes can be improved upon and where certain data should or could be managed to most effectively support the manufacturer’s needs. In this case, recognize the functionality offered by PLM. It can create a better environment and improve overall processes for managing the BOM routing process. It also has the benefits of creating and maintaining an integrated environment with the systems that traditionally manage this process, giving manufacturers an opportunity to enhance their product design and manufacturing practices even further to help eliminate inefficiencies, drive down manufacturing costs, and maintain a competitive advantage in the marketplace.","filter_flag":1}
