{"title":"BASF works to achieve net zero carbon emissions by 2050 - CosmeticsDesign.com USA","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi5jb20vQXJ0aWNsZS8yMDIzLzA1LzIzL2Jhc2Ytd29ya3MtdG8tYWNoaWV2ZS1uZXQtemVyby1jYXJib24tZW1pc3Npb25zLWJ5LTIwNTDSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi5jb20vQXJ0aWNsZS8yMDIzLzA1LzIzL2Jhc2Ytd29ya3MtdG8tYWNoaWV2ZS1uZXQtemVyby1jYXJib24tZW1pc3Npb25zLWJ5LTIwNTDSAQA?oc=5","id":"CBMiamh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi5jb20vQXJ0aWNsZS8yMDIzLzA1LzIzL2Jhc2Ytd29ya3MtdG8tYWNoaWV2ZS1uZXQtemVyby1jYXJib24tZW1pc3Npb25zLWJ5LTIwNTDSAQA","guidislink":false,"published":"Tue, 23 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=143, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi5jb20vQXJ0aWNsZS8yMDIzLzA1LzIzL2Jhc2Ytd29ya3MtdG8tYWNoaWV2ZS1uZXQtemVyby1jYXJib24tZW1pc3Npb25zLWJ5LTIwNTDSAQA?oc=5\" target=\"_blank\">BASF works to achieve net zero carbon emissions by 2050<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign.com USA<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"BASF works to achieve net zero carbon emissions by 2050 - CosmeticsDesign.com USA","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi5jb20vQXJ0aWNsZS8yMDIzLzA1LzIzL2Jhc2Ytd29ya3MtdG8tYWNoaWV2ZS1uZXQtemVyby1jYXJib24tZW1pc3Npb25zLWJ5LTIwNTDSAQA?oc=5\" target=\"_blank\">BASF works to achieve net zero carbon emissions by 2050<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign.com USA<\/font>","source.href":"https:\/\/www.cosmeticsdesign.com","source.title":"CosmeticsDesign.com USA","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Footprint Reduction\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Carbon management is a pillar of most ingredient manufacturers strategies towards more environmentally sustainable production processes. Chemical manufacturer BASF has taken a leading role in managing carbon emissions throughout the company and is diligently working to better adhere to the principles of environmental sustainability. To learn more about how BASF is working to implement carbon management and procedures within its own supply chain and throughout ingredient production processes, including the launch of a digital application tool to calculate Product Carbon Footprints for its 45,000 sales products, CosmeticsDesign spoke with Prerna Chatterjee, Senior Sustainability Manager at BASF for her insights. The importance of carbon management Within the cosmetics and personal care industries, carbon management in support of environmentally sustainable practice implementation is essential, Chatterjee asserted. The practice can “have a significant impact on the environment, as a large portion of the manufacturer’s carbon footprint is attributed to Scope 3 emissions, which are not produced by the company itself, but by those that it's indirectly responsible for, up and down its value chain​,” she said. This underscores the imperative relevance of carbon management to industry stakeholders, because “as suppliers to the beauty industry we engage in strategies & implementation techniques that reduce the overall carbon footprint of our activities & products​,” she shared. Further, carbon management matters a great deal to the consumer or product’s end-user. It is well understood that “with transparency and traceability on the rise, consumers are seeking more information about ‘how’ their product is being produced​,” she explained. Now more than ever, consumers understand their role in supporting environmentally sustainable practices through their purchasing power by “driving demand for more sustainable products and influencing industry.” This influence can be exerted “by choosing to purchase products that use sustainable sourced ingredients to help reduce the carbon footprint of the cosmetic and beauty industry, which can also encourage manufacturers to prioritize sustainability and work towards reducing the footprint​,” she added. Ultimately, “consumers have an important role to play in driving sustainability in the beauty and cosmetics industry, and being aware about companies’ carbon management practices is one aspect of this​,” she continued. Challenges to carbon management implementation Unfortunately, the implementation process of carbon management practices is necessarily simple, and there are many challenges that ingredients manufacturers and suppliers face when approaching this process. First and foremost, “the personal care industry has a complex and global supply chain, which can make it difficult to trace and calculate the exact carbon footprint of products​,” Chatterjee explained. Additionally, “some sustainable materials\/feedstocks are often not widely available, which can impact on our ability to make big impacts​” and add to the potential challenges, she shared. Further impacting the feasibility of some carbon management solutions is that “communicating about sustainability initiatives and progress can be challenging, requiring a high level of accountability and transparency​,” she explained. As a solution to directly address these issues, “companies must be able to clearly communicate the sustainability benefits of their products and ingredients, as well as their overall carbon management strategies to consumers and stakeholders​,” she offered. Ultimately, overcoming these challenges to carbon management implementation requires a “collaborative effort from companies, suppliers, regulators, and consumers to develop more sustainable and transparent practices in the personal care industry​” with successful outcomes. Carbon management at BASF Despite these challenges, as a global entity BASF recognizes its responsibility for climate protection and has committed to further reducing emissions from its production processes. To achieve its goals, the company has set some ambitious quantitative objectives to measure progress. “At the heart of the long-term transition towards our net zero CO2 emissions goal by 2050 is the use of new technologies, which will replace fossil fuels such as natural gas with electricity from renewable sources​,” Chatterjee shared. While “most of these technologies are being pioneered by BASF in collaboration with partners and are currently in a pilot stage​,” the company “continues to systematically implement continuous improvement processes for existing production plants​” to accelerate the timeline for successful implementation of its carbon management practices, she explained. Further, “BASF has developed a digital application tool to calculate the cradle-to-gate PCFs (Product Carbon Footprints) for its 45,000 sales products, which enables the company to provide PCFs for its global portfolio​,” she added. This affords BASF customers the ability to “receive valuable information about the extent to which BASF materials contribute to the carbon footprint of their business activities and their own final products​.” Based on GHG emissions from BASF plant, coupled with “high-quality average data for purchased raw materials as well as purchased energy​,” BASF’s PCF calculations “comprise all product-related greenhouse gas emissions that occur until the BASF product leaves the factory gate for the customer: from the purchased raw material to the use of energy in production processes​,” she said. Through the combination of technological innovation and PCF data, BASF is well on its way to achieving its goal of net zero CO2 emissions by 2050. As BASF is setting an industry example through its practices, it will be interesting to see if other global leaders in chemical production will follow suit with their own carbon management programs in the coming months.","filter_flag":1}
{"title":"Where Is Oregon's Seafood? – Oregon Business - Oregon Business","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vb3JlZ29uYnVzaW5lc3MuY29tL3doZXJlLWlzLW9yZWdvbnMtc2VhZm9vZC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vb3JlZ29uYnVzaW5lc3MuY29tL3doZXJlLWlzLW9yZWdvbnMtc2VhZm9vZC_SAQA?oc=5","id":"CBMiNGh0dHBzOi8vb3JlZ29uYnVzaW5lc3MuY29tL3doZXJlLWlzLW9yZWdvbnMtc2VhZm9vZC_SAQA","guidislink":false,"published":"Wed, 03 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=123, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vb3JlZ29uYnVzaW5lc3MuY29tL3doZXJlLWlzLW9yZWdvbnMtc2VhZm9vZC_SAQA?oc=5\" target=\"_blank\">Where Is Oregon's Seafood? – Oregon Business<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Oregon Business<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Where Is Oregon's Seafood? – Oregon Business - Oregon Business","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vb3JlZ29uYnVzaW5lc3MuY29tL3doZXJlLWlzLW9yZWdvbnMtc2VhZm9vZC_SAQA?oc=5\" target=\"_blank\">Where Is Oregon's Seafood? – Oregon Business<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Oregon Business<\/font>","source.href":"https:\/\/oregonbusiness.com","source.title":"Oregon Business","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Footprint Reduction\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Brand Story – Inside OCVA’s Mission to Keep Local Seafood Local Share this article! The Oregon Coast boasts all the natural resources a local seafood industry could want, but a lack of infrastructure prevents them from reaching Oregonians. Over the past year, the Oregon Coast Visitors Association (OCVA) celebrated massive strides on its mission to keep more local seafood local. Oregon’s oceans sustain over 150 commercially landed fish species (Source: ODFW) and a rich mariculture, raising the question: If seafood is so abundant, why exactly is it so difficult for visitors, locals and businesses to acquire? “Currently, our seafood is primarily exported to commodity wholesale markets, providing little opportunity for smaller processors to get in the game and sell our local product locally,” explains Marcus Hinz, Executive Director, OCVA. “A friend of mine once said, ‘Back in my village, we feed ourselves first, then we sell the rest of our fish.’ I hope Oregon can get to a place like that. We’re not against export markets, but today we are just a seafood extraction economy.” A staggering 90 percent of the seafood sold and consumed along the coast is not from Oregon. An OCVA-funded study revealed that if Oregon could retain just 10 percent more seafood to sell locally, it would translate into $90 million a year for coastal communities. An estimated $252 million of economic leakage annually occurs along the Oregon Coast due to the sale of food that is not local (Source: OCVA). “We need a multiplicity of small- and medium-scale buyers to be successful,” adds Laura Anderson, Founder and CFO, Local Ocean, a locally sourced seafood restaurant and market. “This provides healthy competition in the marketplace, forces innovation in product development and ultimately is better for fishers and seafood lovers.” Laura Anderson from the Yaquina Lab project speaking about OCI at Oregon Sea Grant conference called “State of the Coast.” OCVA has dozens of campaigns and initiatives centered on boosting access to Oregon Coast seafood through new infrastructure, coordinated distribution, innovation and awareness. “In the long term, it’s the smartest thing we could possibly do because no other type of investment is going to contribute to local food security, enhanced community nutrition, emergency preparedness, economic development and carbon footprint reduction,” Hinz notes. To overcome a lack of local seafood, OCVA prioritizes the immediate need for small-scale hyperlocal processing, storage and distribution infrastructure. Hyperlocal Seafood Infrastructure Seafood demands immediate attention once pulled from the ocean, meaning that every port involved with “landing” seafood requires some degree of infrastructure to keep fish fresh. The 2,500-square-foot Yaquina Lab in Newport, OR—supported in part by OCVA—was launched last year to address the needs of small-scale seafood producers. A shared-use space, the Lab gives its tenants the ability to process, store and distribute their catch. These services, can give fishers more options to sell direct and local. Commercial Fisher Brian Trotter showing off his catch of Oregon Black Rockfish The facility features two 40-foot Conex coolers for cold storage, a filet room for processing and rentable coworking space for the industry’s small businesses, who are already reaping the benefits “In the first year, Local Ocean was able to double its direct from boat purchases of local rockfish, lingcod, black cod and halibut,” recalls Anderson, who also runs Yaquina Lab’s programming. “The restaurant building simply did not have the space for us to receive, fillet and freeze as much fish as we can sell.” Given Yaquina Lab’s popularity, OCVA hopes to see the pilot model rolled out along the coast. As it enters year two, its expanding to add seaweed culture and live crab facilities, a blast freezer and cooler, and more fillet space. For fresh-caught seafood, live holding tanks present another critical piece of the puzzle, providing an alternative to immediate processing. When rough seas prevent small fishers from deploying, live tanks let them continue supplying fresh product to local restaurants. “If we install dozens of live tanks, someone will need to be trained to keep the product alive,” Hinz explains. “So, we wrote a grant for Oregon Coast Community College Aquarium Science Program to see if they could build out a commercial live tank training and certification program.” Coordinated Logistics & Distribution Infrastructure comprises half of the availability equation. The other half boils down to distribution: getting seafood products to buyers and consumer markets in a cost-effective way. To coordinate regional distribution, reduce transportation costs and create shared marketing and infrastructure opportunities, OCVA works with the Oregon Food Hub Network, which helps develop regional food systems. North Coast Commons in Wheeler, Oregon, is another key distribution partner. Along with Yaquina Lab, it functions as a distribution hub from which the Visitors Association helps coordinate transportation routes into larger markets. North Coast Commons, a food aggregation hub OCVA is helping to connect with other regional distribution routes In 2022, OCVA subsidized and supported three new delivery routes that link coastal communities to Portland, paving the way for further regional collaboration with Hood River and Bend. According to Hinz, the success of local food systems depends on local partners, such as Port Orford Sustainable Seafood, which bridges connections between traceable hook and line caught seafood with Oregon consumers via pickup locations around the state. “Our CSF asks members to pay a minimum of $200 upfront for a ‘share’ of Port Orford caught seafood that they get to choose over the course of a year,” explains Michael Baran, Co-owner, Port Orford Sustainable Seafood. “However, paying upfront isn’t always possible, and a partnership with OCVA has allowed for us to develop the infrastructure necessary to transform the front of our processing facility into an open-air type storefront.” This allows anyone to easily purchase the catch of the day or a prepared seafood meal. To map the industry’s distribution and infrastructure needs, OCVA launched the Oregon Seafood Prospector, a geographic information systems tool that lets stakeholders visualize the coast’s fishery data, activities and impact. It illustrates the fish landing in each port and the processing options along the coast. Endless Room for Seafood Innovation With the necessary infrastructure to keep local seafood local, a new market for innovation arises: “When we immediately ship fish out of the state, entrepreneurs don’t have the opportunity to try to create a value-added product,” Hinz explains. By keeping local seafood local, OCVA expects to see a rise in innovative new products. It wrote $50,000 into its USDA grant for Oregon State University’s Food Innovation Center so that small businesses wanting to create a seafood product could get support in the science of processing, packaging, experimentation and testing. A seafood business is currently working with them to create food products from a waste byproduct. “Oregon has a massive opportunity to innovate because, unlike other states, we have just begun to think about it,” Hinz adds. “We have millions of miles to go in fully using our seafood resources, and people are itching to make this happen.” Raising Awareness & Celebrating Local Seafood In the meantime, OCVA’s awareness campaigns correct myths surrounding the industry, particularly the visitor’s assumption that seafood eaten along the coast is local. Instead, Oregon’s high-quality, nutrient dense seafood gets exported elsewhere, while imported products, of which only one percent undergo inspection (Source: US Government Accountability Office), arrive from markets driven by seafood slavery (Source: WalkFree.org) and illegal harvesting practices. “Quite a few of our fisheries are third party sustainability-certified. It’s the best on the planet and we’re sending it away,” Hinz says. “Visitors to the Oregon Coast and residents of Oregon all want access to locally caught seafood. The demand is there. We just have to replace the product on the menu.” Taste of Oregon event at the Governor’s Inaugural Ball held in January at the Oregon Convention Center. To shed light on this reality, and help consumers access the local products they crave, OCVA created a video series highlighting the best of the local seafood and aquaculture industry. Its online content helps citizens and legislators understand the dangers of the current situation and the immediate benefits to people and planet that come with shorter supply chains, such as food security and decreased carbon footprint. “Oregon boasts some of the most ecologically sustainable fisheries in the world. But true sustainability also needs to balance economics and equity,” Anderson explains. “When we are not feeding our communities, is that sustainable? That’s what this work is about.” COVID-19 caused the preventable collapse of the coastal seafood industry, and OCVA wants to ensure that whatever crisis hits next, whether an earthquake or a geopolitical disaster, this never happens again. Through House Bill 2909, which will largely support installation of the needed hyperlocal infrastructure and GIS prospectors, the team would gain funding to continue increasing the availability of Oregon seafood and aquaculture products for both visitors and residents, and strength the capacity of its food system partners. To make its vision a reality, OCVA seeks more allies—funders, policymakers, private investors, elected officials, businesses and stakeholders—ready to learn more and establish partnership. Get Involved The Oregon Coast Visitors Association firmly believes that Oregon has the potential supply and voracious demand to make the local industry a true seafood utopia that fuels the health and wealth of the entire state. Join their efforts: www.oregonseafare.com\/get-involved Brand stories are paid content articles that allow Oregon Business advertisers to share news about their organizations and engage with readers on business and public policy issues. The stories are produced in house by the Oregon Business marketing department. For more information, contact associate publisher Courtney Kutzman.","filter_flag":1}
