{"title":"Building a Sustainable Single-Use Coffee Cup - Advertising Specialty Institute","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vbWVtYmVycy5hc2ljZW50cmFsLmNvbS9uZXdzL25ld3NsZXR0ZXJzL3Byb21vZ3JhbS9qdW5lLTIwMjMvYnVpbGRpbmctYS1zdXN0YWluYWJsZS1zaW5nbGUtdXNlLWNvZmZlZS1jdXAv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vbWVtYmVycy5hc2ljZW50cmFsLmNvbS9uZXdzL25ld3NsZXR0ZXJzL3Byb21vZ3JhbS9qdW5lLTIwMjMvYnVpbGRpbmctYS1zdXN0YWluYWJsZS1zaW5nbGUtdXNlLWNvZmZlZS1jdXAv0gEA?oc=5","id":"CBMicWh0dHBzOi8vbWVtYmVycy5hc2ljZW50cmFsLmNvbS9uZXdzL25ld3NsZXR0ZXJzL3Byb21vZ3JhbS9qdW5lLTIwMjMvYnVpbGRpbmctYS1zdXN0YWluYWJsZS1zaW5nbGUtdXNlLWNvZmZlZS1jdXAv0gEA","guidislink":false,"published":"Wed, 28 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=179, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vbWVtYmVycy5hc2ljZW50cmFsLmNvbS9uZXdzL25ld3NsZXR0ZXJzL3Byb21vZ3JhbS9qdW5lLTIwMjMvYnVpbGRpbmctYS1zdXN0YWluYWJsZS1zaW5nbGUtdXNlLWNvZmZlZS1jdXAv0gEA?oc=5\" target=\"_blank\">Building a Sustainable Single-Use Coffee Cup<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Advertising Specialty Institute<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Building a Sustainable Single-Use Coffee Cup - Advertising Specialty Institute","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vbWVtYmVycy5hc2ljZW50cmFsLmNvbS9uZXdzL25ld3NsZXR0ZXJzL3Byb21vZ3JhbS9qdW5lLTIwMjMvYnVpbGRpbmctYS1zdXN0YWluYWJsZS1zaW5nbGUtdXNlLWNvZmZlZS1jdXAv0gEA?oc=5\" target=\"_blank\">Building a Sustainable Single-Use Coffee Cup<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Advertising Specialty Institute<\/font>","source.href":"https:\/\/members.asicentral.com","source.title":"Advertising Specialty Institute","query":"https:\/\/news.google.com\/rss\/search?q=\"Material Recycling\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"The Good Cup is a recyclable plastic-free container that has an origami-style fold-and-snap lid integrated into the design. It’s no secret that Americans love their coffee. In New York City alone, there are 241 Starbucks locations. In fact, a 2023 report by the National Coffee Association found that 65% of American say they had consumed a cup of joe the day before. But our caffeine addiction comes with an environmental cost: 50 billion single-use cups are trashed in the U.S. each year, by some estimates. Cyril Drouet and Paul Wong, co-founders of The Good Cup, wanted to create a solution to this pressing problem. The Good Cup features an integrated lid that folds and snaps in place, eliminating the need for a separate plastic lid. Designed in an origami style with the lid built into the cup itself, The Good Cup is made of FSC-certified paper with an aqueous coating, rather than the plastic lining that many single-use paper coffee cups have. The integrated lid folds and snaps into place. It’s fully recyclable and home compostable, according to the company, and can be used for hot or cold drinks. “It eliminates the need for an extra lid,” says Wong, who is also the company’s vice president of manufacturing. “The top part of the paper cup can be folded to protect the beverage that’s inside.” This video demonstrates how The Good Cup’s integrated folding lid works. Drouet was inspired to create The Good Cup last year after attending a concert and witnessing the amount of plastic cup lids being thrown away. Disposal of single-use coffee cups is indeed a problem. Many are lined with a plastic coating that’s difficult to recycle. And while plastic cups for iced coffees are meant to be recyclable, many still end up in landfills. In 2022, only 9% of U.S. material-recycling facilities accepted plastic cups, according to a report from Greenpeace. What’s more, only 2% of those facilities accepted plastic lids and caps. In 2018, the U.S. generated 35.6 million tons of plastic waste overall, but only about 3 million tons were recycled, according to the most recent figures available from the Environmental Protection Agency (EPA). The vast majority, about 75%, of plastic waste was landfilled. “Plastic will stay on earth for hundreds of years,” Wong says. “Recycling is a great way of protecting the environment, but the problem is that not everything is being recycled.” Plastic lids for single-use coffee cups are made from a plastic that’s difficult and costly to recycle. Paper and pulp lid alternatives are “valid choices” to remove plastic from coffee cups, according to Wong, “but these choices are very expensive to make.” The Good Cup’s integrated lid is a more cost-efficient alternative since it doesn’t require extra material to make a separate lid, Wong says. The product has received several accolades for this innovation, including a 2023 German Design Award. Fully customizable with printed logos and designs, The Good Cup is already in use in Europe, Australia and Japan – and is starting to receive interest in the U.S., as well. During the Eurovision Song Contest, held earlier this year in Liverpool, England, drinks were served in a limited-edition version of The Good Cup to raise money to help support people displaced by the war in Ukraine. During the 2023 Eurovision Song Contest, drinks were served in a limited-edition version of The Good Cup to raise money for those displaced by the war in Ukraine. Confronting the issue of single-use plastic requires a multi-pronged approach. Some coffee shops, for instance, encourage the use of ceramic mugs for drinks consumed in-house. Still, Wong says, there are some downsides: They’re breakable and require a lot of water – a scarce resource – to clean. “Making a ceramic mug actually takes a lot more energy, raw material and all that compared to a paper cup,” he adds. Commuters can also use their own double-walled travel tumbler (which abound in the promo products industry) for a fill-up. But there are plenty of times a person forgets to bring their reusable tumbler with them – and some event venues might not allow outside items – so there are plenty of instances where a sustainable single-use option would come in handy. Drouet and Wong believe The Good Cup could fill that need.","filter_flag":1}
{"title":"Waste Reduction and Recycling | Saskatchewan State of the Environment – 2023 - Government of Saskatchewan","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5zYXNrYXRjaGV3YW4uY2EvcmVzaWRlbnRzL2Vudmlyb25tZW50LXB1YmxpYy1oZWFsdGgtYW5kLXNhZmV0eS9zYXNrYXRjaGV3YW4tc3RhdGUtb2YtdGhlLWVudmlyb25tZW50LTIwMjMvd2FzdGUtcmVkdWN0aW9uLWFuZC1yZWN5Y2xpbmfSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5zYXNrYXRjaGV3YW4uY2EvcmVzaWRlbnRzL2Vudmlyb25tZW50LXB1YmxpYy1oZWFsdGgtYW5kLXNhZmV0eS9zYXNrYXRjaGV3YW4tc3RhdGUtb2YtdGhlLWVudmlyb25tZW50LTIwMjMvd2FzdGUtcmVkdWN0aW9uLWFuZC1yZWN5Y2xpbmfSAQA?oc=5","id":"CBMikwFodHRwczovL3d3dy5zYXNrYXRjaGV3YW4uY2EvcmVzaWRlbnRzL2Vudmlyb25tZW50LXB1YmxpYy1oZWFsdGgtYW5kLXNhZmV0eS9zYXNrYXRjaGV3YW4tc3RhdGUtb2YtdGhlLWVudmlyb25tZW50LTIwMjMvd2FzdGUtcmVkdWN0aW9uLWFuZC1yZWN5Y2xpbmfSAQA","guidislink":false,"published":"Thu, 29 Jun 2023 19:06:46 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=29, tm_hour=19, tm_min=6, tm_sec=46, tm_wday=3, tm_yday=180, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5zYXNrYXRjaGV3YW4uY2EvcmVzaWRlbnRzL2Vudmlyb25tZW50LXB1YmxpYy1oZWFsdGgtYW5kLXNhZmV0eS9zYXNrYXRjaGV3YW4tc3RhdGUtb2YtdGhlLWVudmlyb25tZW50LTIwMjMvd2FzdGUtcmVkdWN0aW9uLWFuZC1yZWN5Y2xpbmfSAQA?oc=5\" target=\"_blank\">Waste Reduction and Recycling | Saskatchewan State of the Environment – 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Government of Saskatchewan<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Waste Reduction and Recycling | Saskatchewan State of the Environment – 2023 - Government of Saskatchewan","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5zYXNrYXRjaGV3YW4uY2EvcmVzaWRlbnRzL2Vudmlyb25tZW50LXB1YmxpYy1oZWFsdGgtYW5kLXNhZmV0eS9zYXNrYXRjaGV3YW4tc3RhdGUtb2YtdGhlLWVudmlyb25tZW50LTIwMjMvd2FzdGUtcmVkdWN0aW9uLWFuZC1yZWN5Y2xpbmfSAQA?oc=5\" target=\"_blank\">Waste Reduction and Recycling | Saskatchewan State of the Environment – 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Government of Saskatchewan<\/font>","source.href":"https:\/\/www.saskatchewan.ca","source.title":"Government of Saskatchewan","query":"https:\/\/news.google.com\/rss\/search?q=\"Material Recycling\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Why we measure this Saskatchewan has committed to reducing the amount of waste generated per person by 30 per cent by 2030 and 50 per cent by 2040, based on 2014 baseline levels. Finding ways to enhance and expand waste diversion across Saskatchewan will be key in meeting our goals. Waste management includes reducing, reusing and recycling our waste to prevent it from ending up in Saskatchewan's landfills. Waste reduction or prevention is the preferred approach to managing waste, as it avoids creating additional waste through product design and consumer purchasing habits. Reusing or repurposing an item can give products a second life before they become waste, while recycling is one of the final options available to responsibly manage waste before disposal. Recycling uses time, energy and resources to reprocess waste materials into new products or materials. Saskatchewan has several regulations and programs that use the extended producer responsibility (EPR) model to encourage reducing, reusing and recycling products and materials. EPR is a policy in which responsibility for the end-of-life management of products and materials shifts to the producers of these materials (i.e. brand owners, first importers or manufacturers) and away from municipalities and general taxpayers. The Ministry of Environment maintains regulations for EPR programs in Saskatchewan for used oil and antifreeze, scrap tires, waste paint, electronic equipment, printed paper and packaging, agricultural plastics, batteries and household hazardous waste. The ministry also works with SARCAN Recycling through a contract to manage the province-wide depot system for the collection and recycling of beverage containers. One way to reduce pressure on the environment and sustain scarce resources is to divert waste before it gets to landfills. Much of what we describe as trash or waste is a valuable resource. Less waste means better landfill management and less pressure on natural resources. It also means lower carbon emissions. Recycling is an indicator of public commitment to share in the responsibility for environmental stewardship. What is happening Since 2014, the amount of waste going to landfills in Saskatchewan has decreased from 845 kilograms per capita in 2014 to 791 kilograms per capita in 2015 and 744 kilograms per capita in 2018. A significant and decreasing trend has been observed since 2010. Reducing the amount of waste going to landfill increases their longevity and reduces some of the negative impacts on the environment. In 2021, Saskatchewan citizens recycled 82 per cent of all deposit-paid, ready-to-serve beverage containers sold in the province, for a total of more than 498 million beverage containers collected. Since 2015-16, the average number of containers recycled and recovery rate has been trending upward, but saw a decline in 2019-20. The Saskatchewan Paint Stewardship Program collected 375,000 litres of waste paint and 135.5 tonnes of paint cans and containers in 2021. Leftover household paint is also collected at all 73 SARCAN locations for customers to take free of charge and reuse. The Paint Share Program was put on hold in March 2020 due to the pandemic and was restarted in 2022. Saskatchewan established the first industry-led electronics recycling stewardship program in North America. In 2018, the program was expanded to incorporate additional products, including net-top computers, external disk drives, desktop scanners, e-book readers, floor-standing printers and countertop microwaves. The Multi-Material Recycling Program is a cost-sharing program between businesses and municipalities to help pay for the collection and recycling of household packaging and paper materials. In 2021, more than 40,146 tonnes of printed paper and packaging materials were recycled and the program now includes more than 500 municipalities, representing 84 per cent of the population. In 2021, 941,010 tires (more than 24,500 tonnes) were collected through the province-wide tire recycling program. In 2021, the used oil recycling program collected and recycled more than 16 million litres of used oil, over 271,000 litres of used antifreeze, more than 1,000 tonnes of oil filters and almost 410 tonnes of plastic containers. Saskatchewan launched an agricultural plastics recycling program under The Agricultural Packaging Product Waste Stewardship Regulations in 2018. The program is the first of its kind in Canada and provides a responsible option for producers to return plastic grain bags for recycling. In 2021, the program collected more than 2,450 tonnes of grain bags. In 2019, The Household Hazardous Waste Product Stewardship Regulations came into effect, requiring sellers of household hazardous waste products to manage the collection and safe disposal of the products. The program for household batteries was launched in January 2021 and collected over 103 tonnes of single use and rechargeable batteries that year. The program for flammable, corrosive and toxic materials, aerosols and physically hazardous products launched in April 2021, with more than 11,800 litres of flammables, corrosives and over 28,000 units of aerosols and physically hazardous products collected during the year. What we are doing Plastic waste management has emerged as a significant and rapidly evolving public issue that is putting pressure on municipal recycling programs in Saskatchewan and throughout Canada. In November 2018, through the Canadian Council of Ministers of the Environment (CCME), federal, provincial and territorial governments approved the Canada-wide Strategy on Zero Plastic Waste. Building on the Ocean Plastics Charter, the CCME strategy takes a circular economy approach to plastics and provides a framework for action. The key areas in the strategy include product design, single-use plastics, collection systems, markets, recycling capacity, consumer awareness, aquatic activities, research and monitoring, clean up and global action. Saskatchewan supports the strategy, which complements other waste reduction efforts in the province, such as the development of the Solid Waste Management Strategy. The Government of Saskatchewan continues to work with partners and stakeholders to implement the actions in the Solid Waste Management Strategy, which was released in January 2020. The strategy strives for a practical, sustainable and integrated solid waste management system in Saskatchewan, and serves as a roadmap for waste reduction and management. It outlines six goals and several commitments to raise public awareness, encourage regional collaboration, modernize rules and regulations, enhance waste diversion, foster innovation and demonstrate government leadership. Saskatchewan's strategy adopts and supports the targets set in the CCME's Strategy on Zero Plastic Waste – to reduce the amount of waste generated per person by 30 per cent by 2030 and 50 per cent by 2040. The Solid Waste Management Strategy supports the Saskatchewan Growth Plan, ensuring economic growth is balanced with responsible management of our waste and protection of our environment. Most of the waste we generate is actually a resource that can be used more than once. A thriving Saskatchewan economy is a circular economy, where the value of materials is recaptured by reuse and recycling programs.","filter_flag":1}
