{"title":"2023 VAPORESSO CARE ECO GO GREEN - Global Carbon Neutral Program Kicked Off - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzLzIwMjMtdmFwb3Jlc3NvLWNhcmUtZWNvLWdvLWdyZWVuLS0tZ2xvYmFsLWNhcmJvbi1uZXV0cmFsLXByb2dyYW0ta2lja2VkLW9mZi0zMDIwMTAwOTkuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzLzIwMjMtdmFwb3Jlc3NvLWNhcmUtZWNvLWdvLWdyZWVuLS0tZ2xvYmFsLWNhcmJvbi1uZXV0cmFsLXByb2dyYW0ta2lja2VkLW9mZi0zMDIwMTAwOTkuaHRtbNIBAA?oc=5","id":"CBMigwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzLzIwMjMtdmFwb3Jlc3NvLWNhcmUtZWNvLWdvLWdyZWVuLS0tZ2xvYmFsLWNhcmJvbi1uZXV0cmFsLXByb2dyYW0ta2lja2VkLW9mZi0zMDIwMTAwOTkuaHRtbNIBAA","guidislink":false,"published":"Sun, 10 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=344, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzLzIwMjMtdmFwb3Jlc3NvLWNhcmUtZWNvLWdvLWdyZWVuLS0tZ2xvYmFsLWNhcmJvbi1uZXV0cmFsLXByb2dyYW0ta2lja2VkLW9mZi0zMDIwMTAwOTkuaHRtbNIBAA?oc=5\" target=\"_blank\">2023 VAPORESSO CARE ECO GO GREEN - Global Carbon Neutral Program Kicked Off<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"2023 VAPORESSO CARE ECO GO GREEN - Global Carbon Neutral Program Kicked Off - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzLzIwMjMtdmFwb3Jlc3NvLWNhcmUtZWNvLWdvLWdyZWVuLS0tZ2xvYmFsLWNhcmJvbi1uZXV0cmFsLXByb2dyYW0ta2lja2VkLW9mZi0zMDIwMTAwOTkuaHRtbNIBAA?oc=5\" target=\"_blank\">2023 VAPORESSO CARE ECO GO GREEN - Global Carbon Neutral Program Kicked Off<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Practices\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"SHENZHEN, China, Dec. 10, 2023 \/PRNewswire\/ -- On December 10, VAPORESSO, a leading brand in the vaping industry, has officially launched its new initiative, the 2023 VAPORESSO CARE ECO GO GREEN - Global Carbon Neutral Program (\"the Program\"). This Program, slated to continue until July 2024, is the first carbon-neutral green practice in the vaping industry, aiming to demonstrate VAPORESSO's innovative efforts towards sustainable development in the age of carbon neutrality and underscore its pivotal role in the industry as a trailblazer for sustainable practices. Innovative Concept ECO NANO to be Low-Carbon Pioneer VAPORESSO has been consistently pushing the boundaries of innovation, leveraging its robust technological capabilities. Working alongside industry experts and researchers, the brand has assessed the potential of various innovative, low-carbon and environmentally-friendly materials. As a result, VAPORESSO has successfully developed four groundbreaking concept ECO NANO products. These products take a step further based on VAPORESSO's ECO NANO that can be refilled and recharged, which lowers users' cost and minimizes the environmental impact. Moreover, they use more eco-friendly materials for production, further reducing carbon emissions, making these products genuine trailblazers and pioneers of sustainable practices in the industry. Among these four conceptual innovative products, \"OceanGLINT\" ECO NANO is the first ocean-friendly product in the vaping industry. It uses PCR (Post-Consumer Recycled) material, a leading low-carbon option derived from recyclable marine plastic waste, and can protect the marine environment and reduce carbon emissions by over 40%. Three other concept products use innovative materials for the first time, including biodegradable PLA (Polylactic Acid) materials, PBAT (Polybutylene adipate terephthalate) sugarcane fiber composite, inorganic substances and thermoplastic resins, setting a new industry standard by reducing carbon emissions and contributing to the Earth's sustainable development. Initiatives to Engage More People Worldwide and Promote Environmental Sustainability Through this Program, VAPORESSO is committed to brand responsibility and strives to achieve a balance between industry growth and environmental sustainability. By encouraging its users, clients, and stores to participate in carbon-neutral, eco-friendly practices, VAPORESSO is set to promote green and low-carbon development as a leading brand in the vaping industry. UNITE TO PLANT VAPORESSO has set up an engaging online platform where conceptual innovative products are showcased, and users can learn about and contribute to low-carbon environmental protection through interactive quizzes. By providing users with insights into environmental protection, VAPORESSO aims to increase users' environmental awareness through this interactive experience. From December 10-31, each day, users who correctly answer three questions related to low-carbon environmental protection will be contributing to VAPORESSO's tree-planting initiatives. Participants also stand a chance to win a variety of exciting prizes, such as a DJI AVATA, GoPro, and eco-friendly sets. COLLABORATION WITH GLOBALLY RENOWNED ORGANIZATION FOR TREE PLANTING Partnering with ONETREEPLANTED and China Green Foundation, from December 10-25, VAPORESSO invites more than 140 of its key clients to become its Global Green Partners. By linking clients and users, VAPORESSO will plant 6,000 more trees in the coming months to reduce carbon dioxide emissions while contributing 66 tons of carbon to the Earth's carbon sink annually. With VAPORESSO as a leading force, they are working closely to build a low-carbon and environmentally friendly ecosystem for the vaping industry. VAPE STORE ACTIVITIES – STEP COUNT CHALLENGE VAPORESSO has also garnered positive responses from over 500 stores globally, aiming to create a mutually beneficial industrial ecosystem. This initiative leads consumers towards adopting a green and healthy lifestyle. Additionally, they are preparing incentive prizes for participants, fostering a positive interaction among stores, consumers, and the brand itself. Through these initiatives, VAPORESSO is determined to be a pioneering leader in the carbon-neutral era, and is striving to create an eco-friendly, sustainable, and healthy ecosystem for the vaping industry in the era of carbon neutrality. The brand is dedicated to driving positive change and setting an example for sustainable practices within the vaping industry. For more information, please visit: https:\/\/www.vaporesso.com\/activity\/eco-go-green SOURCE VAPORESSO","filter_flag":1}
{"title":"Review: Boie USA's sustainable exfoliating body scrubber - New York Post","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vbnlwb3N0LmNvbS8yMDIzLzEyLzA4L3Nob3BwaW5nL3doeS13ZS1sb3ZlLWJvaWVzLXN1c3RhaW5hYmxlLWV4Zm9saWF0aW5nLWJvZHktc2NydWJiZXIv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vbnlwb3N0LmNvbS8yMDIzLzEyLzA4L3Nob3BwaW5nL3doeS13ZS1sb3ZlLWJvaWVzLXN1c3RhaW5hYmxlLWV4Zm9saWF0aW5nLWJvZHktc2NydWJiZXIv0gEA?oc=5","id":"CBMiX2h0dHBzOi8vbnlwb3N0LmNvbS8yMDIzLzEyLzA4L3Nob3BwaW5nL3doeS13ZS1sb3ZlLWJvaWVzLXN1c3RhaW5hYmxlLWV4Zm9saWF0aW5nLWJvZHktc2NydWJiZXIv0gEA","guidislink":false,"published":"Fri, 08 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=342, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vbnlwb3N0LmNvbS8yMDIzLzEyLzA4L3Nob3BwaW5nL3doeS13ZS1sb3ZlLWJvaWVzLXN1c3RhaW5hYmxlLWV4Zm9saWF0aW5nLWJvZHktc2NydWJiZXIv0gEA?oc=5\" target=\"_blank\">Review: Boie USA's sustainable exfoliating body scrubber<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">New York Post <\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Review: Boie USA's sustainable exfoliating body scrubber - New York Post","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vbnlwb3N0LmNvbS8yMDIzLzEyLzA4L3Nob3BwaW5nL3doeS13ZS1sb3ZlLWJvaWVzLXN1c3RhaW5hYmxlLWV4Zm9saWF0aW5nLWJvZHktc2NydWJiZXIv0gEA?oc=5\" target=\"_blank\">Review: Boie USA's sustainable exfoliating body scrubber<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">New York Post <\/font>","source.href":"https:\/\/nypost.com","source.title":"New York Post","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Practices\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"New York Post may receive revenue from affiliate and advertising partnerships for sharing this content and\/or when you make a purchase. I’ve been on the lookout for innovative and sustainable personal care products for most of my adult life, and I may have finally found what I’ve been looking for in Boie USA‘s range of bath essentials. From face and body scrubbers to toothbrushes, Boie has created a line of products that deliver functionality and contribute to a more eco-friendly approach to hygiene and product consumption. However, for me, the shining star has to be the Body Scrubber. The best part? New York Post readers get a discount! From March 15, 2024 to March 18, 2024, you can enjoy 15% off your order as part of Boie’s USA‘s Saint Patrick’s Day sale! As someone who struggles with dry skin, especially in the winter, I often turn to loofahs or washcloths for a good scrub down. They always feel too rough and irritating or too soft and ineffective — not to mention how much bacteria they hold on to, even if they’ve been cleaned. The Boie Body Scrubber is made from a BPA-free material embedded with medical-grade silver, making it antimicrobial and clean every time I go for it. From my first encounter, the scrubber’s unique texture spoke volumes. Its flexible, soft-touch feels like a gentle caress, but the results are supremely smooth and thoroughly clean skin (all without the bells and whistles of elaborate skincare gadgets). The Body Scrubber constantly showcases its durability. With its hook, which easily sticks to your shower wall, it’s accustomed to regular wear and tear — except it doesn’t wear or tear. Of course, like anything that lives in a humid place, the brand recommends replacing it every six months. When that time comes around, just stick it in a shipping envelope and send it back to Boie, where they’ll recycle it with their proprietary process, keeping the scrub party going. Its robust design has seamlessly integrated into my routine, requiring minimal effort for maximum skin-clearing impact. Sustainable choices, it seems, can coexist with convenience and function, debunking the myth I believed that being eco-friendly meant compromising efficacy. Boie USA In the ever-evolving landscape of personal care, where new products promise revolutionary experiences, Boie’s Body Scrubber, Facial Scrubber, and Toothbrush emerge as beacons of simplicity and sustainability. They’re not merely tools for cleanliness; they’re conscious steps toward a more responsible and eco-friendly shower routine. Real smooth operators for your skin and oral health, they’re gentle, effective, and more recyclable than a soda can. The brand completely bypasses municipal recycling programs (which only end up recycling about 9%) by doing their own thing. And the best part? Boie’s sustainability isn’t a compromise on quality. Boie doesn’t just talk the talk; they walk the walk when it comes to eco-friendly practices. The brand’s devotion to the environment extends to every corner of its ethos. Picture this: a shower routine where every element, from scrubber to packaging, your facial exfoliator to your toothbrush, is not only designed well enough to show off but is fully recyclable via the brand’s own provided compostable mailers. Boie USA In a world flooded with skincare tools and options, Boie stands tall as the embodiment of responsible luxury (without the price tag!). The Body Scrubber is not just a purchase; it’s a pledge – a promise to indulge in self-care while being a steward of the environment. Boie is your ticket to a sustainable skincare love affair. Pros Sticks to shower wall for easy placement mid-scrub down It comes with a hook for easy storage and drying Cons Finger\/hook holes take some time to get the hang of using when scrubbing Boie USA The Face Scrubber, and the rest of the Boie suite of products, is more than a beauty tool; it’s a small revolution in personal care, urging us to rethink our daily rituals. Pros Softer bristles than the Body Scrubber Ergonomically curved to suit the crevices of the face Ring on the back for easy handling and maximum control Cons Because of the ring backing, it’s harder to store in between uses. I recommend using the hook for the Facial Scrubber, too. Boie USA The toothbrush is no exception to Boie’s performance meets aesthetics. With its replaceable heads and equally as recyclable parts (just mail into Boie using the brand’s compostable mailers), it’s the perfect dental hygiene solution for the whole family. Pros Extremely easy to clean after each use, thanks to the slippery material Available in 6 colors, making it perfect for the whole family Ergonomic shape is easy to hold and handle and keeps bristle end away from countertops — why aren’t all toothbrushes shaped this way? Cons No specific storage is included other than your usual toothbrush holder Check out the New York Post Shopping section for more content.","filter_flag":1}
{"title":"Taiwan’s Trailblazing Innovations Set A New Standard In Eco-Friendly Urban Casual Wear And Sportswear, According ... - Textile World Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi3AFodHRwczovL3d3dy50ZXh0aWxld29ybGQuY29tL3RleHRpbGUtd29ybGQvbm9ud292ZW5zLXRlY2huaWNhbC10ZXh0aWxlcy8yMDIzLzEyL3RhaXdhbnMtdHJhaWxibGF6aW5nLWlubm92YXRpb25zLXNldC1hLW5ldy1zdGFuZGFyZC1pbi1lY28tZnJpZW5kbHktdXJiYW4tY2FzdWFsLXdlYXItYW5kLXNwb3J0c3dlYXItYWNjb3JkaW5nLXRvLXRhaXdhbi10ZXh0aWxlLWZlZGVyYXRpb24v0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi3AFodHRwczovL3d3dy50ZXh0aWxld29ybGQuY29tL3RleHRpbGUtd29ybGQvbm9ud292ZW5zLXRlY2huaWNhbC10ZXh0aWxlcy8yMDIzLzEyL3RhaXdhbnMtdHJhaWxibGF6aW5nLWlubm92YXRpb25zLXNldC1hLW5ldy1zdGFuZGFyZC1pbi1lY28tZnJpZW5kbHktdXJiYW4tY2FzdWFsLXdlYXItYW5kLXNwb3J0c3dlYXItYWNjb3JkaW5nLXRvLXRhaXdhbi10ZXh0aWxlLWZlZGVyYXRpb24v0gEA?oc=5","id":"CBMi3AFodHRwczovL3d3dy50ZXh0aWxld29ybGQuY29tL3RleHRpbGUtd29ybGQvbm9ud292ZW5zLXRlY2huaWNhbC10ZXh0aWxlcy8yMDIzLzEyL3RhaXdhbnMtdHJhaWxibGF6aW5nLWlubm92YXRpb25zLXNldC1hLW5ldy1zdGFuZGFyZC1pbi1lY28tZnJpZW5kbHktdXJiYW4tY2FzdWFsLXdlYXItYW5kLXNwb3J0c3dlYXItYWNjb3JkaW5nLXRvLXRhaXdhbi10ZXh0aWxlLWZlZGVyYXRpb24v0gEA","guidislink":false,"published":"Mon, 11 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=11, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=345, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi3AFodHRwczovL3d3dy50ZXh0aWxld29ybGQuY29tL3RleHRpbGUtd29ybGQvbm9ud292ZW5zLXRlY2huaWNhbC10ZXh0aWxlcy8yMDIzLzEyL3RhaXdhbnMtdHJhaWxibGF6aW5nLWlubm92YXRpb25zLXNldC1hLW5ldy1zdGFuZGFyZC1pbi1lY28tZnJpZW5kbHktdXJiYW4tY2FzdWFsLXdlYXItYW5kLXNwb3J0c3dlYXItYWNjb3JkaW5nLXRvLXRhaXdhbi10ZXh0aWxlLWZlZGVyYXRpb24v0gEA?oc=5\" target=\"_blank\">Taiwan’s Trailblazing Innovations Set A New Standard In Eco-Friendly Urban Casual Wear And Sportswear, According ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Textile World Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Taiwan’s Trailblazing Innovations Set A New Standard In Eco-Friendly Urban Casual Wear And Sportswear, According ... - Textile World Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi3AFodHRwczovL3d3dy50ZXh0aWxld29ybGQuY29tL3RleHRpbGUtd29ybGQvbm9ud292ZW5zLXRlY2huaWNhbC10ZXh0aWxlcy8yMDIzLzEyL3RhaXdhbnMtdHJhaWxibGF6aW5nLWlubm92YXRpb25zLXNldC1hLW5ldy1zdGFuZGFyZC1pbi1lY28tZnJpZW5kbHktdXJiYW4tY2FzdWFsLXdlYXItYW5kLXNwb3J0c3dlYXItYWNjb3JkaW5nLXRvLXRhaXdhbi10ZXh0aWxlLWZlZGVyYXRpb24v0gEA?oc=5\" target=\"_blank\">Taiwan’s Trailblazing Innovations Set A New Standard In Eco-Friendly Urban Casual Wear And Sportswear, According ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Textile World Magazine<\/font>","source.href":"https:\/\/www.textileworld.com","source.title":"Textile World Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Practices\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"TAIPEI, Taiwan — December 8, 2023 — Taiwan’s textile industry is at the forefront of research and development, capitalizing on the abundant supply of synthetic fiber raw materials and innovative weaving and dyeing technologies. This has solidified the industrial value chain and clustered advantages of functional textiles, earning the trust of numerous international brands. During major global sport events such as the Olympics and FIFA World Cup, Taiwanese manufacturers have become the preferred clothing suppliers for many national teams. In the 2022 FIFA World Cup, for instance, Taiwan’s innovation in transforming ocean waste into high-value fibers and utilizing anti-explosion weaving technology led to the adoption of these advancements by nine national teams. This trend continued in the 2023 FIFA Women’s World Cup and UEFA European Football Championship, with a total of 16 national teams selecting these innovative jerseys. Now, let’s delve into the highlights of five Taiwanese outdoor sports textile manufacturers: CBright: Pioneering Smart Wearable Tech CBright, established in 2006, specializes in intelligent wearable electronic textiles. With a focus on optical and thermal fibers, they hold numerous patents, including the groundbreaking “Intelligent Lighting Integrated System” and “Temperature Control Heating Device.” CBright is globally recognized as the first company to secure a US invention patent for “Mobile Textile Temperature Control.” (Website: https:\/\/www.CBrighttech.com) Hwa Fune: Elevating Sustainability with Porlite® 2.0 Hwa Fune Industry Co. Ltd. prioritizes environmental sustainability in its business principles. Porlite® 2.0, an advanced and sustainable fabric of Hwa Fune, overcomes previous limitations and offers vibrant colors and versatility. Committed to eco-friendly practices, Hwa Fune aligns with standards like bluesign, OEKO-TEX, and GRS, providing international brands with enhanced and sustainable choices. (Website: https:\/\/www.hwafune.com\/) Jax Wear: Bridging Tradition and Technology Founded in 2018, Jax Wear Co. Ltd. combines traditional textiles with cutting-edge technology to create “Made in Taiwan” functional clothing. Positioned as a fashion designer brand, they merge fashion aesthetics, smart manufacturing, and sustainability to deliver innovative sportswear and smart wearable technology. (Website: https:\/\/www.jaxweartw.com) Tiong Liong: Driving Sustainability through Digital Intelligence With a core value of “Realizing Earth’s Sustainable Development,” Tiong Liong offers eco-friendly materials like ARIAPRENE® and MARINYLON®. These materials, made from recycled sources, align with circular economy concepts as well as promote resource utilization. (Website: TLC: https:\/\/www.tiongliong.com\/ ; ARIAPRENE®: https:\/\/ariaprene.com\/) WidePlus: Innovating Eco-functional Fabric WidePlus International Co., Ltd., positions themselves as the “New Textile Industry,” emphasizing sustainable development. Their lightweight and durable ultra-high waterproof and breathable fabrics have gained recognition from top outdoor sports brands globally. (Website: https:\/\/WidePlustex.com\/) Taiwan Textiles- Your Sustainable Innovation Partner Don’t miss the latest video, “Taiwan Textiles – Sustainable Innovation.” Discover the multitude of sustainable textile firms and their groundbreaking products in Taiwan. For more information on these exciting new developments, please reach out to Michael Chang at tc_chang@textiles.org.tw or visit the TEPP project website Posted: December 11, 2023 Source: Taiwan Textiles","filter_flag":1}
{"title":"Ineos Inovyn Broadens PVC Product Portfolio with Expansion Initiative - ChemAnalyst","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5jaGVtYW5hbHlzdC5jb20vTmV3c0FuZERlYWxzL05ld3NEZXRhaWxzL2luZW9zLWlub3Z5bi1icm9hZGVucy1wdmMtcHJvZHVjdC1wb3J0Zm9saW8td2l0aC1leHBhbnNpb24taW5pdGlhdGl2ZS0yNDA2M9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5jaGVtYW5hbHlzdC5jb20vTmV3c0FuZERlYWxzL05ld3NEZXRhaWxzL2luZW9zLWlub3Z5bi1icm9hZGVucy1wdmMtcHJvZHVjdC1wb3J0Zm9saW8td2l0aC1leHBhbnNpb24taW5pdGlhdGl2ZS0yNDA2M9IBAA?oc=5","id":"CBMigAFodHRwczovL3d3dy5jaGVtYW5hbHlzdC5jb20vTmV3c0FuZERlYWxzL05ld3NEZXRhaWxzL2luZW9zLWlub3Z5bi1icm9hZGVucy1wdmMtcHJvZHVjdC1wb3J0Zm9saW8td2l0aC1leHBhbnNpb24taW5pdGlhdGl2ZS0yNDA2M9IBAA","guidislink":false,"published":"Thu, 21 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=355, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5jaGVtYW5hbHlzdC5jb20vTmV3c0FuZERlYWxzL05ld3NEZXRhaWxzL2luZW9zLWlub3Z5bi1icm9hZGVucy1wdmMtcHJvZHVjdC1wb3J0Zm9saW8td2l0aC1leHBhbnNpb24taW5pdGlhdGl2ZS0yNDA2M9IBAA?oc=5\" target=\"_blank\">Ineos Inovyn Broadens PVC Product Portfolio with Expansion Initiative<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ChemAnalyst<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Ineos Inovyn Broadens PVC Product Portfolio with Expansion Initiative - ChemAnalyst","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5jaGVtYW5hbHlzdC5jb20vTmV3c0FuZERlYWxzL05ld3NEZXRhaWxzL2luZW9zLWlub3Z5bi1icm9hZGVucy1wdmMtcHJvZHVjdC1wb3J0Zm9saW8td2l0aC1leHBhbnNpb24taW5pdGlhdGl2ZS0yNDA2M9IBAA?oc=5\" target=\"_blank\">Ineos Inovyn Broadens PVC Product Portfolio with Expansion Initiative<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ChemAnalyst<\/font>","source.href":"https:\/\/www.chemanalyst.com","source.title":"ChemAnalyst","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Practices\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Ineos Inovyn Broadens PVC Product Portfolio with Expansion Initiative Ineos Inovyn, a prominent vinyl producer headquartered in the UK, has recently embarked on a significant expansion of its polyvinyl chloride (PVC) range, introducing new products characterized by substantially reduced carbon footprints and heightened recycled content. This strategic move underlines the company's unwavering commitment to environmental sustainability and aligns with the broader industry shift towards eco-friendly practices. A cornerstone of Ineos Inovyn's ambitious journey towards carbon neutrality is Biovyn, an innovative bio-attributed PVC that made its debut in the market in 2019. Positioned as a pivotal element in the company's sustainability initiatives, Biovyn holds the potential to evolve into a carbon-neutral and net-zero solution. Its versatility is evident in diverse applications across various sectors, ranging from automotive and construction to medical and fashion. In response to the imperative for reducing greenhouse gas (GHG) emissions by 2030, Ineos Inovyn introduces Neovyn, a novel PVC range distinguished by a substantially reduced carbon footprint. According to the company, Neovyn achieves an impressive 37% reduction compared to the European industry average for suspension PVC, translating to a lower carbon footprint of 1.3 kilograms CO2 per kilogram PVC. The production of Neovyn will draw on sustainable initiatives implemented by Ineos Inovyn, including improved access to renewable energy, process electrification, and the production and utilization of renewable hydrogen. Positioned as the new standard for low carbon footprints, Neovyn aims to empower converters to advance their carbon roadmaps by reducing scope 3 emissions and offering products with smaller carbon footprints. Running in parallel with Neovyn, Ineos Inovyn introduces Recovyn, a product line meticulously designed to enhance recycling and circularity while minimizing non-mechanically recycled plastic waste. Comprising 100% recycled carbon feedstock, Recovyn caters to customers seeking to augment their recycled content while meeting stringent technical, quality, and regulatory requirements. The adaptability and versatility of Recovyn, Biovyn, and Neovyn are underscored by Ineos Inovyn, emphasizing their potential as drop-in solutions. These products undergo rigorous certification processes by independent third-party organizations such as the Roundtable on Sustainable Biomaterials (RSB) and the International Sustainability and Carbon Certification Plus (ISCC Plus), providing assurance of their sustainability credentials. Arnaud Valenduc, Business Director at Ineos Inovyn, articulates the company's commitment to maintaining industry leadership by continually introducing innovative products that respond to the urgent need for emission reduction and circularity. This commitment aligns seamlessly with the broader industry trajectory towards a sustainable and net-zero economy, showcasing Ineos Inovyn's proactive role in driving positive change on a global scale. The company's dedication to environmental stewardship and forward-thinking solutions positions it as a trailblazer in the pursuit of a more sustainable and eco-conscious future.","filter_flag":1}
{"title":"Cooler Box Market Size, Share & Forecast Analysis, 2024 - 2032 - Global Market Insights","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vd3d3LmdtaW5zaWdodHMuY29tL2luZHVzdHJ5LWFuYWx5c2lzL2Nvb2xlci1ib3gtbWFya2V00gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vd3d3LmdtaW5zaWdodHMuY29tL2luZHVzdHJ5LWFuYWx5c2lzL2Nvb2xlci1ib3gtbWFya2V00gEA?oc=5","id":"CBMiPmh0dHBzOi8vd3d3LmdtaW5zaWdodHMuY29tL2luZHVzdHJ5LWFuYWx5c2lzL2Nvb2xlci1ib3gtbWFya2V00gEA","guidislink":false,"published":"Mon, 11 Dec 2023 07:13:03 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=11, tm_hour=7, tm_min=13, tm_sec=3, tm_wday=0, tm_yday=345, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vd3d3LmdtaW5zaWdodHMuY29tL2luZHVzdHJ5LWFuYWx5c2lzL2Nvb2xlci1ib3gtbWFya2V00gEA?oc=5\" target=\"_blank\">Cooler Box Market Size, Share & Forecast Analysis, 2024 - 2032<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Global Market Insights<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Cooler Box Market Size, Share & Forecast Analysis, 2024 - 2032 - Global Market Insights","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vd3d3LmdtaW5zaWdodHMuY29tL2luZHVzdHJ5LWFuYWx5c2lzL2Nvb2xlci1ib3gtbWFya2V00gEA?oc=5\" target=\"_blank\">Cooler Box Market Size, Share & Forecast Analysis, 2024 - 2032<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Global Market Insights<\/font>","source.href":"https:\/\/www.gminsights.com","source.title":"Global Market Insights","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Practices\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Cooler Box Market Size Cooler Box Market was valued at over USD 6 billion in 2023 and is anticipated to grow at a CAGR of around 11% between 2024 and 2032. The industry is experiencing dynamic growth driven by multifaceted factors. At the forefront is the escalating demand within the food and beverage sector, where the preservation of perishable goods during transit and storage is paramount. This need extends to diverse industries, including pharmaceuticals, healthcare, and biotechnology, fueling the expansion of cooler box applications in the realm of cold chain logistics. The convergence of technological advancements stands as another pivotal driver, with innovations like vacuum insulation and phase change materials revolutionizing cooler box efficiency and thermal performance. These advancements cater to evolving market demands by enhancing the durability, portability, and sustainability of cooler boxes. To get key market trends Download Free Sample Simultaneously, the surge in outdoor activities, from picnics to camping and sports events, has led to a heightened consumer interest in portable cooler boxes, propelling market growth. Alongside this, environmental concerns and the global focus on sustainability have prompted manufacturers to adopt eco-friendly materials and designs, aligning with the market's inclination towards reduced environmental impact. Additionally, the ever-expanding realm of e-commerce and the increasing reliance on last-mile delivery systems have elevated the significance of insulated packaging, including cooler boxes, to ensure the safe and intact delivery of temperature-sensitive products. Cooler Box Market Report Attributes Report Attribute Details Base Year: 2022 Cooler Box Market Size in 2022: USD 6 Billion Forecast Period: 2023 to 2032 Forecast Period 2023 to 2032 CAGR: 11% 2032 Value Projection: USD 15 Billion Historical Data for: 2018 - 2022 No. of Pages: 200 Tables, Charts & Figures: 273 Segments covered: Type of PCB, Component, Technology, Soldering Process, Volume, Assembly, Vertical Growth Drivers: Growing demand for temperature-controlled transportation and storage Ongoing innovations such as advanced insulation materials Rising Outdoor Activities and Recreational Trends Environmental Concerns and Sustainability Pitfalls & Challenges: The growth of online retail and the need for effective last-mile delivery solutions Cost and Affordability Regulatory Compliance Challenges What are the growth opportunities in this market? Download Free Sample The production of technologically advanced and environmentally friendly cooler boxes often comes with higher manufacturing costs, potentially limiting their affordability and adoption, especially in price-sensitive markets or for smaller businesses. The development of technologically advanced and eco-friendly cooler boxes typically involves using innovative materials and manufacturing processes. These enhancements aim to improve insulation, durability, and sustainability, aligning with market demands and environmental concerns. However, these advancements often lead to increased production costs, which can pose challenges in terms of affordability and wider adoption, particularly in certain market segments. COVID-19 Impact The COVID-19 pandemic disrupted the PCB assembly market, leading to supply chain disruptions due to factory closures, component shortages, and logistical challenges. Manufacturing slowdowns and a reduced workforce capacity affected production timeline. Uncertainty led to project delays and fluctuations in demand from various sectors. With the development and global rollout of COVID-19 vaccines, there was an unprecedented surge in the demand for specialized cooler boxes capable of maintaining the required temperature for vaccine storage and transportation, especially for mRNA vaccines like Pfizer-BioNTech and Moderna, which require ultra-low temperatures. Cooler Box Market Trends A prominent trend shaping the cooler box industry is the increasing emphasis on sustainability and eco-friendly designs. This trend responds to heightened consumer awareness and concerns about environmental impact. Manufacturers are adopting innovative approaches by utilizing recycled materials in cooler box construction, reducing their carbon footprint. There's a notable shift towards biodegradable alternatives for insulation and packaging components, aligning with eco-conscious consumer preferences. These initiatives not only reduce the environmental impact of cooler box production but also resonate with a growing segment of environmentally conscious consumers seeking products that support sustainable practices. As demand continues to rise for eco-friendly solutions across industries, the integration of recycled materials and biodegradable elements in cooler box manufacturing is becoming a defining trend, influencing market offerings and consumer choices. Another significant trend in the cooler box market revolves around advancements in insulation and technology. Continuous innovation aims to enhance the thermal performance of cooler boxes, extending their ability to maintain desired temperatures for longer durations. Manufacturers are exploring novel insulation materials and design configurations to optimize temperature control within these boxes. Moreover, the integration of smart technologies, such as IoT sensors for temperature monitoring and control, is gaining traction. These technological integrations not only improve the efficiency of cooler boxes but also cater to the needs of various industries, including pharmaceuticals, food, and logistics. As businesses and consumers increasingly rely on precise temperature control during transport and storage, the incorporation of advanced insulation and smart technologies emerges as a pivotal trend, driving the evolution of cooler box capabilities and functionalities. Cooler Box Market Analysis Learn more about the key segments shaping this market Download Free Sample Based on type, the market is segmented into reusable and disposable. The reusable segment dominated the global market with a share of over 72% in 2023. The trend toward reusable cooler boxes is gaining prominence in the market, reflecting a growing emphasis on sustainability and eco-conscious practices. Reusable cooler boxes represent a shift away from single-use packaging towards durable, multi-purpose solutions designed for extended usage. These boxes are crafted from sturdy materials capable of withstanding multiple applications without compromising their structural integrity or cooling efficiency. The reusable segment addresses the growing demand for sustainable alternatives, offering consumers and businesses a durable, cost-effective, and environmentally friendly solution compared to single-use cooler boxes. This trend aligns with broader efforts to reduce waste and minimize the environmental impact of packaging, catering to the preferences of environmentally conscious consumers and industries striving for eco-friendly practices. As sustainability continues to drive consumer choices and industry standards, the reusable cooler box segment is poised for further growth and innovation in the coming years. Learn more about the key segments shaping this market Download Free Sample Based on end use, the market is divided into pharmaceuticals, food & beverages, others. The pharmaceutical segment is anticipated to register a CAGR of over 11.1% through 2032. The ongoing global vaccination campaigns, including routine immunization and mass vaccination drives, require efficient cold chain logistics for transporting vaccines. Cooler boxes play a pivotal role in maintaining the required temperature range during transportation and storage, ensuring vaccine efficacy. The pharmaceutical industry operates under strict regulatory guidelines mandating the maintenance of specific temperature ranges for various medications. Cooler boxes designed to meet these stringent standards are in high demand to ensure compliance and product integrity. The expansion of remote healthcare and telemedicine services requires secure and temperature-controlled transportation of medical supplies and samples, increasing the demand for specialized cooler boxes catering to these needs. Looking for region specific data? Download Free Sample Asia Pacific market held a share of over 28% in 2022 and is expected to grow at a lucrative pace. The cooler box market in the Asia Pacific region is undergoing rapid expansion, fueled by the surge in e-commerce, increased demand for healthcare and pharmaceutical products, and a shift in consumer preferences towards outdoor activities and fresh produce. The growing emphasis on sustainability and technological advancements in insulation and smart features further propel market growth. This dynamic landscape caters to diverse industries, including e-commerce, healthcare, logistics, and food and beverage, driving the demand for specialized cooler boxes designed to meet specific industry requirements while aligning with the region's evolving consumer behaviors and environmental consciousness. Cooler Box Market Share The global Ice\/Cooler box industry is fragmented due to the presence of many global and regional players in the market. Manufacturers are introducing new products in the market using new technologies. The companies use various marketing strategies to increase their market shares. Some of the market's leading players are heavily investing in research and development activities to improve their position in current technologies and processes to increase efficiency and lower costs. Cooler Box Market Companies Some of the key players in the global industry are: Bison Coolers B Medical System Blowkings Coldchain Technologies Inc. Cool Ice Box Company Eurobox Logistics FEURER GmbH Igloo ISONOVA K2 Coolers Sonoco Products Company Cooler Box Industry News In October 2022, AZENTA, INC. announced the acquisition of B Medical Systems S.Á R.L and its subsidiaries, a market leader in temperature-controlled storage and transportation solutions that enable the delivery of life-saving treatments to more than 150 countries worldwide. This acquisition complements Azenta's cold chain capabilities, adding differentiated solutions for reliable and traceable transport of temperature-sensitive specimens. The cooler box market research report includes in-depth coverage of the industry with estimates & forecast in terms of revenue (USD Billion) from 2018 to 2032 for the following segments: Click here to Buy Section of this Report Market, By Type Reusable Disposable Market, By Raw Material Extruded Polystyrene Expanded Polystyrene Expanded Polypropylene Others Market, By End Use Pharmaceuticals Food & Beverages Others The above information is provided for the following regions and countries:","filter_flag":1}
{"title":"Mitsubishi Corporation Plastics (MCP): Leading the eco-friendly charge in a changing landscape - The Worldfolio","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihwFodHRwczovL3d3dy50aGV3b3JsZGZvbGlvLmNvbS9pbnRlcnZpZXdzL21pdHN1YmlzaGktY29ycG9yYXRpb24tcGxhc3RpY3MtbWNwLWxlYWRpbmctdGhlLWVjb2ZyaWVuZGx5LWNoYXJnZS1pbi1jaGFuZ2luZy1sYW5kc2NhcGUvNTk4Ni_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihwFodHRwczovL3d3dy50aGV3b3JsZGZvbGlvLmNvbS9pbnRlcnZpZXdzL21pdHN1YmlzaGktY29ycG9yYXRpb24tcGxhc3RpY3MtbWNwLWxlYWRpbmctdGhlLWVjb2ZyaWVuZGx5LWNoYXJnZS1pbi1jaGFuZ2luZy1sYW5kc2NhcGUvNTk4Ni_SAQA?oc=5","id":"CBMihwFodHRwczovL3d3dy50aGV3b3JsZGZvbGlvLmNvbS9pbnRlcnZpZXdzL21pdHN1YmlzaGktY29ycG9yYXRpb24tcGxhc3RpY3MtbWNwLWxlYWRpbmctdGhlLWVjb2ZyaWVuZGx5LWNoYXJnZS1pbi1jaGFuZ2luZy1sYW5kc2NhcGUvNTk4Ni_SAQA","guidislink":false,"published":"Fri, 08 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=342, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihwFodHRwczovL3d3dy50aGV3b3JsZGZvbGlvLmNvbS9pbnRlcnZpZXdzL21pdHN1YmlzaGktY29ycG9yYXRpb24tcGxhc3RpY3MtbWNwLWxlYWRpbmctdGhlLWVjb2ZyaWVuZGx5LWNoYXJnZS1pbi1jaGFuZ2luZy1sYW5kc2NhcGUvNTk4Ni_SAQA?oc=5\" target=\"_blank\">Mitsubishi Corporation Plastics (MCP): Leading the eco-friendly charge in a changing landscape<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Worldfolio<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Mitsubishi Corporation Plastics (MCP): Leading the eco-friendly charge in a changing landscape - The Worldfolio","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihwFodHRwczovL3d3dy50aGV3b3JsZGZvbGlvLmNvbS9pbnRlcnZpZXdzL21pdHN1YmlzaGktY29ycG9yYXRpb24tcGxhc3RpY3MtbWNwLWxlYWRpbmctdGhlLWVjb2ZyaWVuZGx5LWNoYXJnZS1pbi1jaGFuZ2luZy1sYW5kc2NhcGUvNTk4Ni_SAQA?oc=5\" target=\"_blank\">Mitsubishi Corporation Plastics (MCP): Leading the eco-friendly charge in a changing landscape<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Worldfolio<\/font>","source.href":"https:\/\/www.theworldfolio.com","source.title":"The Worldfolio","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Practices\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Japan is a country that is now facing a massive demographic shift. It is the world’s oldest society and has a declining population due to a low birth rate. In fact, experts believe that the population will dip under 100 million by 2050. This is creating two key issues in our opinion; the first is a labor crisis, and the second is a shrinking domestic market. How is Mitsubishi Corporation Plastics (MCP) reacting to these demographic changes? In your opinion, how much do you need to look overseas in order to secure the business continuity of your firm? In the current situation the Japanese population is decreasing as you said, but in my opinion that doesn’t necessarily mean it is going to be a dramatic drop. Currently, the population of Japan sits around 120 million, and while that number isn’t going to increase, we believe we can still maintain our obligations. In terms of the supply side, there are some threats from overseas countries like China, South Korea, and Taiwan, but within the domestic market, there are some industries that are expected to have structural revolutions. If there is restructuring the size of companies or the industry as a whole might shrink. In that case, supply orders might decrease, so in that sense, we would have to go overseas to conduct more business. We are in a fortunate position where we can leverage the network of our parent company in order to conduct more business abroad. I think this is a very big advantage that our company holds over some competitors. Over the past 25-30 years Japan has faced the threats you mentioned from China, Korea, and Taiwan, who have replicated Japanese manufacturing processes, but done so at a cheaper labor cost, thus pushing Japan out of certain mass industrial markets. However, we still see Japanese firms such as yourselves as leaders in certain niche, B2B fields. With this in mind, can you tell us the main strengths of MCP? How is MCP able to compete with regional competitors despite the stiff price competition? The world we live in today is becoming more and more aware of environmental concerns. Japan is part of that movement and we are aware as a nation that things need to change. There is no choice and countries all over the world must become more eco-friendly. A big example of an industry that needs to change is plastic, the industry we are in. We as a company are in a situation where we have to implement eco-friendly materials in order to survive. As this environmental movement continues to gather steam we will need to catch as much information as possible so that we can provide information to our clients in advance. This allows them to prepare and become a part of this movement. I think another strength of MCP is our ability to respond to societal changes. I think that bio-polypropylene derived from sugarcane is a great example of what you just mentioned. In fact, we’ve met with Daio Paper who are developing cellulose nanofibrils (CNF), which is a plant-based material that can mimic plastic and is used in automotive applications such as bumpers. Can you give us your perspective on how close or how far we are from transitioning fully to plant-based and environmentally friendly plastic materials? What are some of the key products you are working on in this regard? First I would like to share some of the strengths of trading companies in general. As a trader we are actually facing various markets directly, so we think that is a strength. Even when we talk about eco-friendly, each client or industry has different purposes. Unfortunately, I think the big disadvantage of bio-materials in general is the cost. You might be aware of the 3Rs, those being reuse, reduce, and recycle. Over the past 30 years, we have been trading plastics, but we feel it might be difficult to fully permeate the complete use of only bio-derived plastics. This is because the use of plastic has accumulated over 30 plus years now. However, as a company that is facing the market directly, we can better understand the preferences of customers and clients. Our mission is to meet the market needs, and although it may be through 3R products or bio-derived materials, it is not really our decision to make, that is for the customers to decide. The market will make the decision and we will respond accordingly by making more investments and focusing our efforts in the direction decided. Right now we are not at that phase yet, and I personally feel that the serious environmental movement only started a couple of years ago. As a trader, we feel we have the flexibility needed to adjust to the whims of the market. With the growth in demand for sustainable solutions, each of your businesses has incorporated some ecological lines of conduct depending on your client’s needs. How do you align the products you offer with your client’s goals without impacting the level of quality? I think this is something that our clients actually need to decide themselves. The onus is on the brand owners and plastic fabrication is one step before the brand owner gets hold of the products. The bottles and the caps are actually made by different manufacturers and our company is providing the resin to local manufacturers who are fabricating the caps of bottles. Local manufacturers are actively exploring the production of eco-friendly goods, even if it means slightly higher costs. The rationale behind this approach is the belief that consumers are increasingly drawn to eco-friendly products, making it a potentially successful brand strategy. To address your question, the extent to which companies align their products with eco-friendly practices largely hinges on their brand strategy. We engage with these brand owners to gain a deeper understanding of their commitment to eco-friendly production and materials. It's important to note that certain products in Japan are highly advanced and robust, which can make it challenging to introduce additional eco-friendly features or enhancements. In contrast, more general products offer greater flexibility in terms of incorporating eco-friendly elements. Notably, our company has earned the International Sustainability & Carbon Certification (ISCC), a globally recognized sustainability certification system that oversees guaranteed biomass supply chains. This ISCC certification holds particular significance in Europe and empowers us to offer customers a broader array of options if they align with the ISCC system. It is interesting that globalized standardization isn’t always accepted in Japan. As Japan’s legislation tightens and disposal options diminish, waste management is becoming a very increasing challenge in many industries. Having a domestic and international vision, the regulatory aspect is one that is always changing and shifting. How do you help your clients navigate the stressful and complex legislation involved in integrating a more circular economy? Awareness of the environment is growing globally, and more and more people are becoming aware of eco-friendly options for the products they buy on a daily basis. In Japan, there are many companies that have committed to reducing their carbon emissions with the eventual goal of carbon neutrality by 2030 or 2050. It means that most companies are very aware that carbon emission reduction is something we have to do and can’t ignore. Right now, for MCP, we aren’t actually sure which method will be the best for our company. As you mentioned, one of our missions as a company is to provide options to our clients, so there are a few strategies we have in terms of giving them the advice and options they need. The first strategy is to urge clients to get on board with CO2 emission reduction, otherwise, they might not make it by 2030. Although many companies have made commitments, I personally don’t feel that they really see what is going on in the world. If we don’t do anything collectively until the last minute, then it is going to be too late. We are asking clients to start moving and putting policies in place before they are left behind. The other strategy relates to the domestic market, and the Japanese government is currently becoming much more serious about environmentally friendly initiatives for businesses. They believe that this activity will affect the growth of Japan. In particular, they are focusing on hydrogen and ammonia. In terms of carbon taxes, we believe that they can be collected and utilized for exporting businesses. It might be introduced by the Japanese government very shortly because the government wants more money for investment into eco-friendly technologies. In the short-term carbon tax might mean more expenditures but in the long term, it can reduce various other taxes. We explain to customers that right now eco-friendly technologies and products are high in cost, but once the tax is introduced costs will be reduced. Automobiles is one of the major sectors that you cater to, and as you are aware it is undergoing a huge transition with the adoption of EV and hybrid vehicles. Here in Japan, we know that 2035 was set by the former Prime Minister Suga’s administration and all cars must be either an EV or a hybrid vehicle. With this transition, we are seeing new material trends and new entities enter the market. As a trading company, how are you catering to the new demands firstly, in terms of products for the automotive industry, and secondly, in terms of new types of customers internationally for your business? When people think of plastic, they tend to think of materials that harm the environment, but with lightweight materials such as carbon fiber reinforced polymers (CFRP), we can actually make vehicles much more fuel efficient and thus much better for the environment. This is an arena we feel we can make contributions, and we are able to provide resins to meet the new demands of the industry. In terms of the automotive industry, we do have a lot of business with certain Automotive manufacturers, and recently they have shown a lot of interest in the recycling business. There are so many ways to recycle in the automotive industry. One example is when cars involved in serious crashes need to be scrapped due to safety concerns. Those cars can be segregated into their materials and then those materials can then be recycled for use in new vehicles. This sort of recycling movement is now gaining a lot of traction within the industry. We work closely with tier-1 and tier-2 companies to provide them with materials. When they receive products from us they often check the quality of the materials, so I think together with those companies we can make significant contributions to the recycling industry. This is what I feel is the best approach to permeating the recycling movement throughout the automotive industry as a whole. We know that in Japan R&D spending is very strong and Japanese companies have historically been able to create amazing products. As a country, Japan is investing around 3% of the GDP into R&D, a significant jump from China’s 1.5% and the US’s 2%. Being a trading company you are essentially the gatekeepers to all the needs of your clients and thus are able to get a better sense of the evolving needs of the industries you cater to. To what extent does the influence of the other Mitsubishi Group companies help the development of new products? Are there any new trends or products that you are developing right now that you would like to showcase for us today? We are a trading company, so we don’t really do any R&D per se, but we do want to have a better grasp of what is happening in Europe with recycling initiatives. The intention is to provide recycled materials both domestically and in international markets. We do have partnerships with several tier-1 and tier-2 companies that manufacture plastic parts. Those companies have their own research and development projects so we do try to assist by providing eco-friendly materials including recycled for them to check and compare to completely new materials. If a material quality is verified through these checks then we feel confident to introduce it to the market. What role do partnerships play in your business model? Are you looking for any new partnerships either domestically or overseas? I think right now is to concentrate for the current project with current partners. Regarding polyethylene terephthalate (PET) bottle recycling, we have made an investment with our parent company for collection at factories. We do have an overseas partner that we have been working with for a long time now in Thailand. In terms of the cost, Thailand is much cheaper especially when compared to Japan. When it comes to PET recycling, we produce flakes in Japan, while we consider several options for customer’s choice are taking PET flakes to Taiwan for mechanical recycling and Thailand for chemical recycling. The key to finding a partner in my opinion is finding someone that matches our mindset and strategies, so in that sense, it is important to establish trust and a long-lasting relationship. This allows us to continue to make investments in this relationship in the future. Right now though, as I mentioned, the timing isn’t there, so we are looking to see how the market moves before establishing more overseas partnerships. I think unfortunately it is still early days. We know that 46% of your revenue actually comes from overseas. Are you planning to expand more into maybe Europe or the US in the future? When it comes to our overseas business opportunities we need to think about geographical risks. A good example is China and the US which are very conflicted with each other right now. This needs to be considered before taking any opportunities overseas. I think when taking those risks into consideration, the US actually has a low amount of risk when compared to Europe right now, and that is because of the ongoing Russian invasion of Ukraine. Southeast Asia might actually be easier for us all things considered. Imagine that we come back on the very last day of your presidency and have this interview all over again. What goals or dreams do you hope to achieve by the time you are ready to hand the baton onto the next generation of MCP executives? I think my core mission as president of MCP is to change the culture. As a company, I think we have already grown beyond our parent company’s initial expectations and we are now moving on to the next phase. For those who have worked for the company for a long time it might be difficult to change the way they think or work, but having said that, our new eco-friendly businesses are the new strategy that the company is now leveraging upon. This is a new challenge and an emerging market, so I think my job is to empower employees and push the company forward to become a success in new and exciting eco-friendly business opportunities.","filter_flag":1}
{"title":"CASE Construction Equipment presents several new products at EXCON 2023 - ETAuto","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9uZXdzL2F1dG9tb3RpdmUvY2FzZS1jb25zdHJ1Y3Rpb24tZXF1aXBtZW50LXByZXNlbnRzLXNldmVyYWwtbmV3LXByb2R1Y3RzLWF0LWV4Y29uLTIwMjMvMTA1OTM4ODA40gGPAWh0dHBzOi8vYXV0by5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL2FtcC9uZXdzL2F1dG9tb3RpdmUvY2FzZS1jb25zdHJ1Y3Rpb24tZXF1aXBtZW50LXByZXNlbnRzLXNldmVyYWwtbmV3LXByb2R1Y3RzLWF0LWV4Y29uLTIwMjMvMTA1OTM4ODA4?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9uZXdzL2F1dG9tb3RpdmUvY2FzZS1jb25zdHJ1Y3Rpb24tZXF1aXBtZW50LXByZXNlbnRzLXNldmVyYWwtbmV3LXByb2R1Y3RzLWF0LWV4Y29uLTIwMjMvMTA1OTM4ODA40gGPAWh0dHBzOi8vYXV0by5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL2FtcC9uZXdzL2F1dG9tb3RpdmUvY2FzZS1jb25zdHJ1Y3Rpb24tZXF1aXBtZW50LXByZXNlbnRzLXNldmVyYWwtbmV3LXByb2R1Y3RzLWF0LWV4Y29uLTIwMjMvMTA1OTM4ODA4?oc=5","id":"CBMiiwFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9uZXdzL2F1dG9tb3RpdmUvY2FzZS1jb25zdHJ1Y3Rpb24tZXF1aXBtZW50LXByZXNlbnRzLXNldmVyYWwtbmV3LXByb2R1Y3RzLWF0LWV4Y29uLTIwMjMvMTA1OTM4ODA40gGPAWh0dHBzOi8vYXV0by5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL2FtcC9uZXdzL2F1dG9tb3RpdmUvY2FzZS1jb25zdHJ1Y3Rpb24tZXF1aXBtZW50LXByZXNlbnRzLXNldmVyYWwtbmV3LXByb2R1Y3RzLWF0LWV4Y29uLTIwMjMvMTA1OTM4ODA4","guidislink":false,"published":"Tue, 12 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=12, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=346, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9uZXdzL2F1dG9tb3RpdmUvY2FzZS1jb25zdHJ1Y3Rpb24tZXF1aXBtZW50LXByZXNlbnRzLXNldmVyYWwtbmV3LXByb2R1Y3RzLWF0LWV4Y29uLTIwMjMvMTA1OTM4ODA40gGPAWh0dHBzOi8vYXV0by5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL2FtcC9uZXdzL2F1dG9tb3RpdmUvY2FzZS1jb25zdHJ1Y3Rpb24tZXF1aXBtZW50LXByZXNlbnRzLXNldmVyYWwtbmV3LXByb2R1Y3RzLWF0LWV4Y29uLTIwMjMvMTA1OTM4ODA4?oc=5\" target=\"_blank\">CASE Construction Equipment presents several new products at EXCON 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ETAuto<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CASE Construction Equipment presents several new products at EXCON 2023 - ETAuto","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9uZXdzL2F1dG9tb3RpdmUvY2FzZS1jb25zdHJ1Y3Rpb24tZXF1aXBtZW50LXByZXNlbnRzLXNldmVyYWwtbmV3LXByb2R1Y3RzLWF0LWV4Y29uLTIwMjMvMTA1OTM4ODA40gGPAWh0dHBzOi8vYXV0by5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL2FtcC9uZXdzL2F1dG9tb3RpdmUvY2FzZS1jb25zdHJ1Y3Rpb24tZXF1aXBtZW50LXByZXNlbnRzLXNldmVyYWwtbmV3LXByb2R1Y3RzLWF0LWV4Y29uLTIwMjMvMTA1OTM4ODA4?oc=5\" target=\"_blank\">CASE Construction Equipment presents several new products at EXCON 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ETAuto<\/font>","source.href":"https:\/\/auto.economictimes.indiatimes.com","source.title":"ETAuto","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Practices\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Automotive 2 min read CASE Construction Equipment presents several new products at EXCON 2023 The company showcased its marquee Backhoe Loader – 770 NX Plus and Soil Compactor 1107 NX-PD at CII EXCON 2023. It also marked its debut in two new categories in India with the unveiling of an all new Skid Steer Loader – SSL 175 and compact machines through mini Excavator – CX 35D to its domestic product portfolio.","filter_flag":1}
{"title":"Role of MSMEs in India's Economic Growth Story of 2030 - SMEStreet","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vc21lc3RyZWV0LmluL2luZm9jdXMvcm9sZS1vZi1tc21lcy1pbi1pbmRpYXMtZWNvbm9taWMtZ3Jvd3RoLXN0b3J5LW9mLTIwMzAtMjAyMTU4OdIBWmh0dHBzOi8vc21lc3RyZWV0LmluL2luZm9jdXMvcm9sZS1vZi1tc21lcy1pbi1pbmRpYXMtZWNvbm9taWMtZ3Jvd3RoLXN0b3J5LW9mLTIwMzAtMjAyMTU4OQ?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vc21lc3RyZWV0LmluL2luZm9jdXMvcm9sZS1vZi1tc21lcy1pbi1pbmRpYXMtZWNvbm9taWMtZ3Jvd3RoLXN0b3J5LW9mLTIwMzAtMjAyMTU4OdIBWmh0dHBzOi8vc21lc3RyZWV0LmluL2luZm9jdXMvcm9sZS1vZi1tc21lcy1pbi1pbmRpYXMtZWNvbm9taWMtZ3Jvd3RoLXN0b3J5LW9mLTIwMzAtMjAyMTU4OQ?oc=5","id":"CBMiWmh0dHBzOi8vc21lc3RyZWV0LmluL2luZm9jdXMvcm9sZS1vZi1tc21lcy1pbi1pbmRpYXMtZWNvbm9taWMtZ3Jvd3RoLXN0b3J5LW9mLTIwMzAtMjAyMTU4OdIBWmh0dHBzOi8vc21lc3RyZWV0LmluL2luZm9jdXMvcm9sZS1vZi1tc21lcy1pbi1pbmRpYXMtZWNvbm9taWMtZ3Jvd3RoLXN0b3J5LW9mLTIwMzAtMjAyMTU4OQ","guidislink":false,"published":"Wed, 13 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=347, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vc21lc3RyZWV0LmluL2luZm9jdXMvcm9sZS1vZi1tc21lcy1pbi1pbmRpYXMtZWNvbm9taWMtZ3Jvd3RoLXN0b3J5LW9mLTIwMzAtMjAyMTU4OdIBWmh0dHBzOi8vc21lc3RyZWV0LmluL2luZm9jdXMvcm9sZS1vZi1tc21lcy1pbi1pbmRpYXMtZWNvbm9taWMtZ3Jvd3RoLXN0b3J5LW9mLTIwMzAtMjAyMTU4OQ?oc=5\" target=\"_blank\">Role of MSMEs in India's Economic Growth Story of 2030<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SMEStreet<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Role of MSMEs in India's Economic Growth Story of 2030 - SMEStreet","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vc21lc3RyZWV0LmluL2luZm9jdXMvcm9sZS1vZi1tc21lcy1pbi1pbmRpYXMtZWNvbm9taWMtZ3Jvd3RoLXN0b3J5LW9mLTIwMzAtMjAyMTU4OdIBWmh0dHBzOi8vc21lc3RyZWV0LmluL2luZm9jdXMvcm9sZS1vZi1tc21lcy1pbi1pbmRpYXMtZWNvbm9taWMtZ3Jvd3RoLXN0b3J5LW9mLTIwMzAtMjAyMTU4OQ?oc=5\" target=\"_blank\">Role of MSMEs in India's Economic Growth Story of 2030<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SMEStreet<\/font>","source.href":"https:\/\/smestreet.in","source.title":"SMEStreet","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Practices\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Micro, Small, and Medium Enterprises (MSMEs) play a crucial role in India's economic growth story, and their significance is expected to amplify in the coming years. Embracing technological advancements and fostering digital literacy will enhance operational efficiency and market reach. Entrepreneurial education and skill development programs should be bolstered to empower MSME owners and their workforce. Government support in terms of infrastructure development, both physical and digital, will be critical for improving connectivity and facilitating smooth business operations. Encouraging sustainable practices and promoting eco-friendly initiatives will align MSMEs with global trends. Furthermore, creating avenues for MSMEs to integrate into global supply chains and fostering international partnerships will open up new markets and opportunities. Collaboration with large corporations and leveraging e-commerce platforms will also play a vital role. Ultimately, a holistic and inclusive strategy that addresses financial, technological, and socio-economic aspects will contribute to the sustained growth and development of MSMEs, fostering economic resilience and diversity. Here are key aspects of the role of MSMEs in India's economic growth story by 2030: Employment Generation: MSMEs are major contributors to employment generation. They have the potential to create a large number of jobs, particularly in both urban and rural areas. As India works towards inclusive growth, MSMEs can play a pivotal role in reducing unemployment and underemployment. Contributing to GDP: MSMEs significantly contribute to India's Gross Domestic Product (GDP). By fostering the growth of these enterprises, the overall economic output of the country is boosted. As MSMEs expand, they contribute more substantially to the nation's economic performance. Promoting Innovation: MSMEs are often hubs of innovation and entrepreneurship. They can quickly adapt to changing market trends, introduce new products and services, and contribute to technological advancements. This innovation is vital for staying competitive on a global scale. Entrepreneurship Development: MSMEs provide a platform for aspiring entrepreneurs to enter the business world. They require lower initial investments compared to larger enterprises, making entrepreneurship more accessible. This fosters a culture of self-employment and business ownership. Rural Development: MSMEs have a significant presence in rural areas, contributing to rural development and reducing regional economic disparities. They create opportunities for livelihoods, improve income levels, and contribute to the overall development of rural economies. Diversification of Industries: MSMEs operate in diverse sectors, including manufacturing, services, and agribusiness. This diversification helps in creating a well-rounded and resilient economy. It also reduces dependency on specific industries, making the economy more robust. Export Promotion: MSMEs play a critical role in export promotion. With the right support and incentives, these enterprises can tap into international markets, contribute to foreign exchange earnings, and enhance India's global trade position. Supply Chain Integration: MSMEs often form a crucial part of larger supply chains, especially in manufacturing and services. Their integration into supply chains improves efficiency, reduces costs, and contributes to the overall competitiveness of industries. Financial Inclusion: MSMEs are instrumental in promoting financial inclusion by providing opportunities for small entrepreneurs to access formal credit. Government schemes and initiatives often target MSMEs to ensure they have the financial resources necessary for growth. Sustainable Development: MSMEs have the potential to adopt sustainable and eco-friendly practices. As global awareness of environmental issues increases, MSMEs can contribute to sustainable development by adopting green technologies and practices. Government Initiatives and Support: Government initiatives, policies, and financial support targeted at MSMEs can significantly boost their growth. Schemes related to credit availability, technology adoption, and skill development further enhance the role of MSMEs in the economic landscape. Digital Transformation: Embracing digital technologies can help MSMEs improve efficiency, reach a broader customer base, and compete more effectively. Digital transformation is a key enabler for MSMEs looking to scale and grow in the modern economy. Conclusion for the Growth Path Considering these factors, the sustained growth and development of MSMEs will likely be integral to India's economic growth story in 2030 and beyond. Policymakers, industry stakeholders, and the broader ecosystem must continue to support and nurture the MSME sector to unlock its full potential.","filter_flag":1}
