{"title":"Think that your plastic is being recycled? Think again. - MIT Technology Review","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LnRlY2hub2xvZ3lyZXZpZXcuY29tLzIwMjMvMTAvMTIvMTA4MTEyOS9wbGFzdGljLXJlY3ljbGluZy1jbGltYXRlLWNoYW5nZS1taWNyb3BsYXN0aWNzL9IBZ2h0dHBzOi8vd3d3LnRlY2hub2xvZ3lyZXZpZXcuY29tLzIwMjMvMTAvMTIvMTA4MTEyOS9wbGFzdGljLXJlY3ljbGluZy1jbGltYXRlLWNoYW5nZS1taWNyb3BsYXN0aWNzL2FtcC8?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LnRlY2hub2xvZ3lyZXZpZXcuY29tLzIwMjMvMTAvMTIvMTA4MTEyOS9wbGFzdGljLXJlY3ljbGluZy1jbGltYXRlLWNoYW5nZS1taWNyb3BsYXN0aWNzL9IBZ2h0dHBzOi8vd3d3LnRlY2hub2xvZ3lyZXZpZXcuY29tLzIwMjMvMTAvMTIvMTA4MTEyOS9wbGFzdGljLXJlY3ljbGluZy1jbGltYXRlLWNoYW5nZS1taWNyb3BsYXN0aWNzL2FtcC8?oc=5","id":"CBMiY2h0dHBzOi8vd3d3LnRlY2hub2xvZ3lyZXZpZXcuY29tLzIwMjMvMTAvMTIvMTA4MTEyOS9wbGFzdGljLXJlY3ljbGluZy1jbGltYXRlLWNoYW5nZS1taWNyb3BsYXN0aWNzL9IBZ2h0dHBzOi8vd3d3LnRlY2hub2xvZ3lyZXZpZXcuY29tLzIwMjMvMTAvMTIvMTA4MTEyOS9wbGFzdGljLXJlY3ljbGluZy1jbGltYXRlLWNoYW5nZS1taWNyb3BsYXN0aWNzL2FtcC8","guidislink":false,"published":"Thu, 12 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=285, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LnRlY2hub2xvZ3lyZXZpZXcuY29tLzIwMjMvMTAvMTIvMTA4MTEyOS9wbGFzdGljLXJlY3ljbGluZy1jbGltYXRlLWNoYW5nZS1taWNyb3BsYXN0aWNzL9IBZ2h0dHBzOi8vd3d3LnRlY2hub2xvZ3lyZXZpZXcuY29tLzIwMjMvMTAvMTIvMTA4MTEyOS9wbGFzdGljLXJlY3ljbGluZy1jbGltYXRlLWNoYW5nZS1taWNyb3BsYXN0aWNzL2FtcC8?oc=5\" target=\"_blank\">Think that your plastic is being recycled? Think again.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">MIT Technology Review<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Think that your plastic is being recycled? Think again. - MIT Technology Review","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LnRlY2hub2xvZ3lyZXZpZXcuY29tLzIwMjMvMTAvMTIvMTA4MTEyOS9wbGFzdGljLXJlY3ljbGluZy1jbGltYXRlLWNoYW5nZS1taWNyb3BsYXN0aWNzL9IBZ2h0dHBzOi8vd3d3LnRlY2hub2xvZ3lyZXZpZXcuY29tLzIwMjMvMTAvMTIvMTA4MTEyOS9wbGFzdGljLXJlY3ljbGluZy1jbGltYXRlLWNoYW5nZS1taWNyb3BsYXN0aWNzL2FtcC8?oc=5\" target=\"_blank\">Think that your plastic is being recycled? Think again.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">MIT Technology Review<\/font>","source.href":"https:\/\/www.technologyreview.com","source.title":"MIT Technology Review","query":"https:\/\/news.google.com\/rss\/search?q=\"Recyclable materials\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Some states, though, have instituted policies that actually hinder progress. Industry lobbyists are increasingly helping to institute state-level laws that prevent bans or limits on the use of plastics, especially plastic bags. Over a dozen states currently have preemptive laws on the books to prevent ordinances limiting plastics, though some of the same states are also trying to pass anti-preemption laws. Fundamentally, to solve the plastic pollution crisis, society must address the root problem: plastics are shockingly profitable and cheap. One way to improve recycling—and prevent unwanted health effects and environmental problems—would be to simplify and standardize the process of plastic production, Walker-Franklin says. Currently, more than 10,000 chemicals are used in the production of plastics, and upward of 3,200 have “one or more hazardous properties of concern,” with the potential to harm humans and wildlife, according to UNEP. Very little or nothing is known about the health effects or basic properties of thousands more. Another way to improve recycling would be to find a way to process mixed polymers into useful materials instead of having to sort everything first. One promising technique, described in an October 2020 study coauthored by Julie Rorrer, then a researcher at MIT, can process polypropylene and polyethylene into propane. Another process, described in a study published in Science the same month, can break down mixtures of common consumer plastics and re-form them into a bioplastic, in part by using an engineered soil bacterium. Others dream of a day when microbes could be used to recycle or clean up all this waste. One French biotechnology company, Carbios, opened a pilot plant in September 2021 to break down and recycle PET using an engineered form of an enzyme first discovered in compost; it’s currently building a full-scale facility due to open in 2025. In theory, this type of recycling could be truly circular, as it wouldn’t require the high heat that normally causes much of the degradation seen with recycled plastics. A microbe discovered in Japan in 2016, called Ideonella sakaiensis, produces two other enzymes that can break down PET. This microbe is especially intriguing because it is the first one identified that can live solely upon plastic as a food source. MIT researcher Linda Zhong-Johnson is working to create more efficient versions of the enzymes by tinkering with microbial genes. So far, one mutation she has identified creates an enzyme that appears to be up to 30% more efficient than its original wild form. Reducing demand Fundamentally, to solve the plastic pollution crisis, society must address the root problem: plastics are shockingly profitable and cheap because polymer producers do not pay for the abundant harm they cause. Any solution will require policy and behavioral changes small and large. As an example of the former, policymakers in Washington, DC, instituted a five-cent charge on plastic bags that began in 2010. Estimates suggest that the number of bags used quickly dropped—by more than half in the months after it was instituted—and the quantity found in local waterways dropped between 30% and 70% thereafter. Seemingly tiny changes like this can add up to reduce demand and decrease pollution. Meanwhile, a global EPR scheme would be an example of a major shift, and the UN process is seeking other big changes to the status quo. Of course, such changes will be difficult, but they can be instituted in gradual ways that don’t hurt businesses, Boachie says: “My hope emanates from the fact that what we are talking about is not something that will impede the growth and success of any company.” On the contrary, he adds, creating incentives for alternatives will spur innovation and create new jobs. A lot of such innovation will doubtless be needed to reverse situations like what I saw in the Connecticut salt marsh. At one point we came upon a couple of osprey nests from which plastic strands billowed, unwittingly collected by the birds as they built their nests. Later, we found a vinyl firehose lodged intractably in the muck between oysters. I couldn’t pull it out, nor could I cut into it with a small pocketknife. We reluctantly left it behind. Douglas Main is a journalist and former senior editor and writer at National Geographic.","filter_flag":1}
{"title":"The How2Recycle label does so much right. Why are recycling rates so low? - GreenBiz","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2hvdzJyZWN5Y2xlLWxhYmVsLWRvZXMtc28tbXVjaC1yaWdodC13aHktYXJlLXJlY3ljbGluZy1yYXRlcy1zby1sb3fSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2hvdzJyZWN5Y2xlLWxhYmVsLWRvZXMtc28tbXVjaC1yaWdodC13aHktYXJlLXJlY3ljbGluZy1yYXRlcy1zby1sb3fSAQA?oc=5","id":"CBMiZGh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2hvdzJyZWN5Y2xlLWxhYmVsLWRvZXMtc28tbXVjaC1yaWdodC13aHktYXJlLXJlY3ljbGluZy1yYXRlcy1zby1sb3fSAQA","guidislink":false,"published":"Fri, 06 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=279, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2hvdzJyZWN5Y2xlLWxhYmVsLWRvZXMtc28tbXVjaC1yaWdodC13aHktYXJlLXJlY3ljbGluZy1yYXRlcy1zby1sb3fSAQA?oc=5\" target=\"_blank\">The How2Recycle label does so much right. Why are recycling rates so low?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GreenBiz<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The How2Recycle label does so much right. Why are recycling rates so low? - GreenBiz","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2hvdzJyZWN5Y2xlLWxhYmVsLWRvZXMtc28tbXVjaC1yaWdodC13aHktYXJlLXJlY3ljbGluZy1yYXRlcy1zby1sb3fSAQA?oc=5\" target=\"_blank\">The How2Recycle label does so much right. Why are recycling rates so low?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GreenBiz<\/font>","source.href":"https:\/\/www.greenbiz.com","source.title":"GreenBiz","query":"https:\/\/news.google.com\/rss\/search?q=\"Recyclable materials\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Eleven years ago, an ambitious new label, How2Recycle, emerged to make it easier for U.S. consumers to put their packaging in the right place at end-of-use. It offers better information than the alternatives, and it’s growing. Yet in that time, recycling rates haven’t dramatically risen; many activists believe that recycling, especially for plastics, will never work; and other labels continue to confuse consumers and hamper recycling. In this challenging context, what’s it like to swim upstream? To find out, I sat down with Karen Hagerman, director of the How2Recycle program. The nonprofit GreenBlue originally rolled out How2Recycle (H2R) in 2012 \"to get more materials in the recycling bin by taking the guesswork out of recycling.\" Other than \"a couple of one-offs,\" no other nationwide system for labeling recyclable materials exists either in the U.S. or Canada, she said. After more than a decade, the H2R label has grown from a pilot program to one with over 500 brand members including Coca-Cola, Clorox and General Mills, an additional 100 packaging manufacturers or non-brand members and tens of thousands of labels on packaging in the U.S. and Canada. The improved information How2Recycle has done a great job of developing a more detailed and helpful label for recyclability because, as the example below shows, it breaks down a package by component — such as paper box or plastic tray — with specific instructions for each. An example of a How2Recycle label for multi-component packaging. Credit: how2recycle.info It offers more and better information than non-standardized labels, such as the widespread chasing arrows symbol, which lacks the details to help you decide where to put a container — especially because the acceptance of certain materials, such as polypropylene, varies by region, ZIP code and in some cases, which hauler services your address. The policy discussion \"One really hot topic with the How2Recycle label, our membership and just recyclability in general is all the movement on policy to regulate recyclability messaging,\" she said, referring to California’s S.B. 343 truth in labeling law coming into effect in 2024. \"It's really challenging because as we see that occur, (we’re) operating at a national scale, so figuring out how to adapt to the different states while still communicating to a national market is complex.\" Backing up, How2Recycle is founded on both the U.S. Federal Trade Commission (FTC) Green Guides and the Canadian Competition Bureau’s Environmental Claims and Greenwashing guidance. Hagerman described how H2R’s recyclability claims are based on five pillars: Compliance with applicable law Recycling access for the specific material for at least 60 percent of households, a threshold outlined in the Green Guides Technical sortation of materials Re-processability of the material The existence of an end market for the material The challenging environment To offer context for the environment in which the H2R label operates, I looked at the EPA’s most recent data about recycling rates, which is five years old. Recycling rates for packaging overall have risen from 38 percent to 54 percent between 2000 and 2018. But plastics recycling has barely budged, from 9 percent to 14 percent; it has remained at 14 percent between 2010 and 2018. Aluminum recycling, meanwhile, has fallen from 44 percent to 35 percent. It doesn't seem like we're moving the needle at all. Why not? As for these trends, according to Hagerman, even where materials are collected and sorted, the data about what recycled raw material feeds back into new products is tough to come by. U.S. recycling rates, 2000-2018, based on EPA data. In addition, the privatized system in the U.S. for collection, sorting and recycling leaves gaps. \"The data exists,\" Hagerman said, \"but it exists in such a fragmented way.\" \"I mean, I would love data on the effectiveness of the How2Recycle label,\" she added. \"I would love to do bale audits and see: Does our label sort correctly? Are consumers actually following the instructions? Is material making it to the right place? What percentage of the cardboard bale has the How2Recycle label on it? \"Those are things we're looking into and we're trying to increase our capacity and resources to be able to get that data, because at the end of the day I want to be able to tell businesses and consumers that yes, this label is effective at increasing the quality and quantity in the recycling system. That's our mission.\" My takeaway is that you can only improve what you measure, and in the case of recycling, we are not doing a great job of measuring. What can we learn from all this? Recycling is a systems issue. We can improve packaging design, labeling, collection and recycling infrastructure independently, but without linking them all together and creating end markets, it’ll be difficult to make headway.","filter_flag":1}
{"title":"Philadelphia Union and Subaru Reveal Sculpture to celebrate recycling milestone - Philadelphia Union","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnBoaWxhZGVscGhpYXVuaW9uLmNvbS9uZXdzL3BoaWxhZGVscGhpYS11bmlvbi1hbmQtc3ViYXJ1LXJldmVhbC1zY3VscHR1cmUtdG8tY2VsZWJyYXRlLXJlY3ljbGluZy1taWxlc3RvbmXSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnBoaWxhZGVscGhpYXVuaW9uLmNvbS9uZXdzL3BoaWxhZGVscGhpYS11bmlvbi1hbmQtc3ViYXJ1LXJldmVhbC1zY3VscHR1cmUtdG8tY2VsZWJyYXRlLXJlY3ljbGluZy1taWxlc3RvbmXSAQA?oc=5","id":"CBMidmh0dHBzOi8vd3d3LnBoaWxhZGVscGhpYXVuaW9uLmNvbS9uZXdzL3BoaWxhZGVscGhpYS11bmlvbi1hbmQtc3ViYXJ1LXJldmVhbC1zY3VscHR1cmUtdG8tY2VsZWJyYXRlLXJlY3ljbGluZy1taWxlc3RvbmXSAQA","guidislink":false,"published":"Thu, 05 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=278, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnBoaWxhZGVscGhpYXVuaW9uLmNvbS9uZXdzL3BoaWxhZGVscGhpYS11bmlvbi1hbmQtc3ViYXJ1LXJldmVhbC1zY3VscHR1cmUtdG8tY2VsZWJyYXRlLXJlY3ljbGluZy1taWxlc3RvbmXSAQA?oc=5\" target=\"_blank\">Philadelphia Union and Subaru Reveal Sculpture to celebrate recycling milestone<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philadelphia Union<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Philadelphia Union and Subaru Reveal Sculpture to celebrate recycling milestone - Philadelphia Union","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnBoaWxhZGVscGhpYXVuaW9uLmNvbS9uZXdzL3BoaWxhZGVscGhpYS11bmlvbi1hbmQtc3ViYXJ1LXJldmVhbC1zY3VscHR1cmUtdG8tY2VsZWJyYXRlLXJlY3ljbGluZy1taWxlc3RvbmXSAQA?oc=5\" target=\"_blank\">Philadelphia Union and Subaru Reveal Sculpture to celebrate recycling milestone<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philadelphia Union<\/font>","source.href":"https:\/\/www.philadelphiaunion.com","source.title":"Philadelphia Union","query":"https:\/\/news.google.com\/rss\/search?q=\"Recyclable materials\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Subaru of America, Inc. and the Philadelphia Union have revealed a unique “zero landfill” sculpture at Subaru Park in Chester, PA to commemorate its status as the first zero landfill stadium in Major League Soccer. Since achieving the milestone in 2021, Subaru and the Union have diverted more than one million pounds of waste from landfills. Subaru has been dedicated to helping other businesses and organizations achieve the same zero waste status that the Subaru of Indiana Automotive manufacturing plant achieved in 2004 and has freely shared knowledge with over 900 companies worldwide to help make the world a better place.","filter_flag":1}
{"title":"SK Chemicals to supply Estée Lauder with eco-friendly packaging materials - Premium beauty","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9zay1jaGVtaWNhbHMtdG8tc3VwcGx5LWVzdGVlLDIyNzY50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9zay1jaGVtaWNhbHMtdG8tc3VwcGx5LWVzdGVlLDIyNzY50gEA?oc=5","id":"CBMiR2h0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9zay1jaGVtaWNhbHMtdG8tc3VwcGx5LWVzdGVlLDIyNzY50gEA","guidislink":false,"published":"Wed, 18 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=291, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9zay1jaGVtaWNhbHMtdG8tc3VwcGx5LWVzdGVlLDIyNzY50gEA?oc=5\" target=\"_blank\">SK Chemicals to supply Estée Lauder with eco-friendly packaging materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"SK Chemicals to supply Estée Lauder with eco-friendly packaging materials - Premium beauty","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9zay1jaGVtaWNhbHMtdG8tc3VwcGx5LWVzdGVlLDIyNzY50gEA?oc=5\" target=\"_blank\">SK Chemicals to supply Estée Lauder with eco-friendly packaging materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","source.href":"https:\/\/www.premiumbeautynews.com","source.title":"Premium beauty","query":"https:\/\/news.google.com\/rss\/search?q=\"Recyclable materials\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"In a bid to accelerate its transition to circular packaging solutions, The Estée Lauder Companies has partnered with South Korea’s SK Chemicals for the supply of recycled and recyclable solutions. A specialist in advanced recycling – a technology that chemically allow to decompose waste plastic into monomers – SK Chemicals will supply The Estée Lauder Companies with resins incorporating advanced recycled materials such as Ecotria CR and Skypet CR, or that can be incorporated into a recycle stream, such as Ecozen Claro. The Estée Lauder Companies will use the materials supplied by SK Chemicals to develop eco-friendly circular packaging for its entire portfolio of more than twenty brand names including Bobbi Brown Cosmetics, Aveda, Clinique, Tom Ford, Glamglow, Jo Malone London and La Mer. SK Chemicals and The Estée Lauder Companies said they will gradually increase the amount of recycled materials in their products and replace other non-recyclable materials, with designs that incorporate recyclable or recycled materials. \"Through this agreement, we believe positive synergies can be created in both business and environmental aspects (…). We will continue to work harder to create a sustainable cosmetics container ecosystem,” said Ahn Jae-hyun, the CEO of SK Chemicals, in a statement. In March, SK Chemicals signed a business agreement with Yonwoo, a subsidiary of Kolmar Korea, which holds the highest market share in the Korean cosmetics container market, to develop and commercialize packaging solutions using recycled materials. In June, the company signed another business agreement with Cosmax, a global leader in cosmetics original development manufacturing (ODM), to \"build a cooperation model for cosmetics container proposal\" with the use of sustainable plastic materials. Moreover, in March, SK Chemicals signed an agreement to aquire the circular recycling raw material and circular recycled PET business of Shuye, a Chinese company specializing in green material, thereby strengthening its production system.","filter_flag":1}
{"title":"Answering the call for more recyclable packaging - Pet Food Processing","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnBldGZvb2Rwcm9jZXNzaW5nLm5ldC9hcnRpY2xlcy8xNjU0MC1hbnN3ZXJpbmctdGhlLWNhbGwtZm9yLW1vcmUtcmVjeWNsYWJsZS1wYWNrYWdpbmfSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnBldGZvb2Rwcm9jZXNzaW5nLm5ldC9hcnRpY2xlcy8xNjU0MC1hbnN3ZXJpbmctdGhlLWNhbGwtZm9yLW1vcmUtcmVjeWNsYWJsZS1wYWNrYWdpbmfSAQA?oc=5","id":"CBMiYWh0dHBzOi8vd3d3LnBldGZvb2Rwcm9jZXNzaW5nLm5ldC9hcnRpY2xlcy8xNjU0MC1hbnN3ZXJpbmctdGhlLWNhbGwtZm9yLW1vcmUtcmVjeWNsYWJsZS1wYWNrYWdpbmfSAQA","guidislink":false,"published":"Sun, 01 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=274, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnBldGZvb2Rwcm9jZXNzaW5nLm5ldC9hcnRpY2xlcy8xNjU0MC1hbnN3ZXJpbmctdGhlLWNhbGwtZm9yLW1vcmUtcmVjeWNsYWJsZS1wYWNrYWdpbmfSAQA?oc=5\" target=\"_blank\">Answering the call for more recyclable packaging<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pet Food Processing<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Answering the call for more recyclable packaging - Pet Food Processing","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnBldGZvb2Rwcm9jZXNzaW5nLm5ldC9hcnRpY2xlcy8xNjU0MC1hbnN3ZXJpbmctdGhlLWNhbGwtZm9yLW1vcmUtcmVjeWNsYWJsZS1wYWNrYWdpbmfSAQA?oc=5\" target=\"_blank\">Answering the call for more recyclable packaging<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pet Food Processing<\/font>","source.href":"https:\/\/www.petfoodprocessing.net","source.title":"Pet Food Processing","query":"https:\/\/news.google.com\/rss\/search?q=\"Recyclable materials\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"This article was published in the December 2022 issue of Pet Food Processing. Read it and other articles from this issue in our December digital edition. As the pet food industry moves toward a more sustainable future, recyclable packaging products are becoming more common. Recently, several leading pet food and packaging companies made a public commitment to sustainability by signing the Pet Sustainability Coalition’s (PSC) Packaging Pledge at SuperZoo 2022. The pledge is a voluntary commitment to move toward more sustainable, refillable, compostable and recyclable packaging. The pledge asks pet industry companies to develop measurable goals and track progress toward the use of refillable, compostable and recyclable packaging by the end of 2025. In exchange for their commitment, PSC will provide informational tools, including: A marketplace of vetted, pre-qualified packaging suppliers Methods of measuring packaging life cycles Packaging design guides and labeling support from How2Recycle Legislative updates from North America and the European Union on sustainable packaging Marketing assets, including badges and social media promotion opportunities “In exchange for their commitment, PSC is providing signatories with tools such as packaging benchmarking tools, North American and EU legislative briefs, a marketplace of pre-vetted packaging suppliers, communication assets, project support, and more,” said Caitlyn Dudas, executive director of the PSC, Boulder, Colo. “The PSC Packaging Pledge represents a powerful opportunity for us to collaborate in significantly reducing the industry’s impact on the environment. We are proud to spearhead this initiative and help drive more sustainable and successful business.” The positive impact of change The use of recyclable packaging offers many benefits, including reducing the amount of waste that ends up in landfills. In addition, the production of recyclable packaging often requires less energy and water, and creates fewer greenhouse gas emissions than non-recyclable packaging. “The greatest benefit of using recyclable packaging is reducing the impact we as an industry have on the environment,” said Dave McCoy, director of strategic sourcing, Instinct Pet Food, St. Louis, Mo. “By utilizing recyclable packaging, we’re moving material away from landfills and into recyclable streams that can use those bags to make other products.” “There are additional significant benefits that consumers may not realize, that are reaped before the kibble even hits the bag,” added Christine Mallier, sustainability and community relations manager, Petcurean, Chilliwack, British Columbia. “From the sourcing of the material and manufacturing to the transporting of the bags, there are reductions in greenhouse gas emissions, water use, mineral resource use, human impact and freshwater ecotoxicity.” During SuperZoo 2022, five pet food manufacturers — Canidae, Earth Animal, Instinct, Petcurean and Primal Pet Foods — publicly signed the PSC’s Packaging Pledge, making a commitment toward using more refillable, compostable and recyclable packaging through 2025. (Source: Sosland Publishing Co.) More and more consumers are becoming concerned about the environment and are choosing brands that are making an effort to be sustainable. By using recyclable packaging, pet food companies can show their commitment to sustainability and attract more environmentally conscious consumers. Committing to sustainability could also help companies attract and retain talent. “We are seeing more and more consumers increasingly prioritize the purchasing decisions around the environment and choosing to support brands that share their values,” Mallier said. “And, as more Gen Z’s start to enter the workforce in the coming years, we know that they will also seek out employers that share similar values. As such, companies with strong sustainability practices — like those that use recyclable packaging — will likely see an advantage when it comes to attracting and retaining employees.” Sustainable packaging solutions Pet food and treat manufacturers have a variety of recyclable packaging materials to choose from. The choice of material depends on a number of factors, including the type of product being packaged, transportation and storage considerations, safety standards and cost. “As we transition to more sustainable packaging across our Primal Pet Foods line, we don’t take a one-size-fits-all approach,” said Megan Pearson, director of major and strategic accounts and sustainability committee lead, Primal Pet Foods, Fairfield, Calif. “We work with our packaging suppliers to evaluate the different recyclable materials available and determine which is best suited for each product based on several factors. In addition to protecting our food and treats while they are being transported and handled, our packaging materials need to be able to maintain our high standards for quality and safety.” “We are seeing more and more consumers increasingly prioritize the purchasing decisions around the environment and choosing to support brands that share their values,” said Christine Mallier of Petcurean. Single-layer polyethylene is one of the most widely used types of recyclable packaging for pet food and treats. It offers a number of benefits, including being lightweight, strong and moisture resistant. The single-layer construction also makes it easy to recycle, unlike multi-layer materials. “Traditional flexible packaging consists of a multilayered structure with materials like polyester and polyethylene… Recycling centers are unable to separate the different films, thus rendering them unrecyclable,” McCoy explained. “The packaging and pet food industry is moving toward more sustainable, single (mono) structure bags made of polyethylene that are recyclable through store drop-off sites.” “The companion pet industry creates more than 300 million lbs of flexible plastic packaging in North America each year,” Dudas added. “Unfortunately, 99% of multi-laminate packaging used for most pet food and treats does not have a sustainable end-of-life solution and ends up in landfills. Our Packaging Pledge supports brands and suppliers as they commit to making measurable progress towards refillable, compostable and\/or recyclable packaging solutions by the end of 2025.” Thanh Phu Plastic Packaging Co., Ho Chi Minh, Vietnam, is one company that has made a commitment to sustainable packaging solutions. As a founding donor of the Packaging Pledge and recognized pioneer in developing sustainable flexible packaging, Thanh Phu has been working to create more eco-friendly packaging for the pet food industry. “Pet food packaging, especially for kibble, requires high-impact strength, large format pouches up to 20 kgs,” said Alex Dam, executive vice president, Thanh Phu Plastic Packaging Co. “In addition, some pet food and treats contain high protein and fat content, requiring a hermetic seal with a good oxygen and moisture barrier. Our Veloflex™ Low Density Polyethylene (LDPE) solution provides outstanding heat sealability and impact strength for a large temperature range from sub-zero to normal warehouse temperatures. Additionally, PE resin is abundantly available with good economies of scale to meet the transition from non-recyclable to fully recyclable mono-polyethylene packaging.” Overcoming challenges The many benefits of using recyclable packaging materials also come with some challenges. These include the properties of the materials themselves, the infrastructure needed to recycle them, and consumer education to ensure that packaging is properly recycled. “Recyclable bags have historically not been as strong and durable as non-recyclable bags,” said Dave McCoy of Instinct Pet Food. One challenge is finding recyclable materials that meet the performance requirements of pet food packaging. Although there has been a lot of progress in this area, it can take time for new materials to be fully tested and approved for use. Additionally, the availability of certain materials can be limited, which can impact cost. “Recyclable bags have historically not been as strong and durable as non-recyclable bags,” McCoy said. “Technology and films are improving in such a way where that gap in performance is shrinking, but oftentimes, there is a learning curve to implement... In addition, some recyclable material is simply not as readily available as its non-recyclable counterparts. That will change over time as more brands and suppliers increase their sustainability efforts and move to recyclable films. In the near term, proper forecasting and planning are needed to ensure access to material.” In terms of infrastructure, not all areas have the necessary facilities to process recyclable materials. This can make it difficult to ensure that packaging is properly recycled and does not end up in landfills. However, drop-off recycling centers are becoming more common, which makes it easier for consumers to recycle their packaging. Finally, many consumers are not aware of the importance of recycling or how to properly recycle their packaging. This can lead to packaging being thrown in the trash instead of being recycled. Pet food brands will need to continue to educate consumers on the importance of recycling and how to do it successfully. “One of the key challenges of using recyclable packaging in the pet food industry is that this type of packaging needs to be properly recycled at recycle depots or store drop-off locations to reap the full benefits of it,” Mallier said. “This is a challenge which requires a change in consumer behavior. With that said, it’s up to brands to help overcome this challenge through education — to retailers and consumers directly — and through their various marketing channels, like social media.” The evolving role As the pet food industry continues to evolve, the role of recyclable packaging will also change. More and more brands are likely to switch to recyclable packaging as they look for ways to reduce their environmental impact, and new technologies and materials will continue to emerge. “The near-term trend is moving toward recyclable bags, but there are many exciting possibilities for the future, including packaging that is compostable, biodegradable or refillable,’’ McCoy said. “As more brands incorporate these emerging, sustainable options into their portfolios, the more widely available they will become for the industry as a whole.” “It’s about progress, not perfection,” Pearson added. “We are committed to transitioning to more sustainable packaging across our Primal Pet Foods line over the next few years. As our industry makes this commitment, we expect to see an evolution in the recyclable materials and formats that are being used.” Although there is still a long way to go, initiatives like the PSC’s Packaging Pledge are helping to move the industry in the right direction. As more brands commit to using recyclable packaging, the availability of these materials will increase and the challenge of recycling will become easier to overcome. Through a combination of efforts, the pet food industry will be able to make significant progress in reducing its environmental impact. “Flexible plastic packaging can help prevent food waste throughout the supply chain from farm to table, with the lowest carbon footprint, compared with existing alternatives such as glass, metals and fiber,” Dam said. “In the new era of environmental conscience, the drawback of lightweight non-recyclable packaging becomes more significant and needs to be addressed.” Read more about packaging solutions and trends for pet food and treats.","filter_flag":1}
{"title":"Circularity comes to wiring accessories in new Nordic launch | ABB - ABB","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vbmV3LmFiYi5jb20vbmV3cy9kZXRhaWwvMTA4MjQ1L2NpcmN1bGFyaXR5LWNvbWVzLXRvLXdpcmluZy1hY2Nlc3Nvcmllcy1pbi1uZXctbm9yZGljLWxhdW5jaNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vbmV3LmFiYi5jb20vbmV3cy9kZXRhaWwvMTA4MjQ1L2NpcmN1bGFyaXR5LWNvbWVzLXRvLXdpcmluZy1hY2Nlc3Nvcmllcy1pbi1uZXctbm9yZGljLWxhdW5jaNIBAA?oc=5","id":"CBMiY2h0dHBzOi8vbmV3LmFiYi5jb20vbmV3cy9kZXRhaWwvMTA4MjQ1L2NpcmN1bGFyaXR5LWNvbWVzLXRvLXdpcmluZy1hY2Nlc3Nvcmllcy1pbi1uZXctbm9yZGljLWxhdW5jaNIBAA","guidislink":false,"published":"Thu, 12 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=285, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vbmV3LmFiYi5jb20vbmV3cy9kZXRhaWwvMTA4MjQ1L2NpcmN1bGFyaXR5LWNvbWVzLXRvLXdpcmluZy1hY2Nlc3Nvcmllcy1pbi1uZXctbm9yZGljLWxhdW5jaNIBAA?oc=5\" target=\"_blank\">Circularity comes to wiring accessories in new Nordic launch | ABB<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ABB<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Circularity comes to wiring accessories in new Nordic launch | ABB - ABB","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vbmV3LmFiYi5jb20vbmV3cy9kZXRhaWwvMTA4MjQ1L2NpcmN1bGFyaXR5LWNvbWVzLXRvLXdpcmluZy1hY2Nlc3Nvcmllcy1pbi1uZXctbm9yZGljLWxhdW5jaNIBAA?oc=5\" target=\"_blank\">Circularity comes to wiring accessories in new Nordic launch | ABB<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ABB<\/font>","source.href":"https:\/\/new.abb.com","source.title":"ABB","query":"https:\/\/news.google.com\/rss\/search?q=\"Recyclable materials\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"SAGA™, ABB’s new wiring collection of light switches and sockets, produced with bio-circular and recyclable materials, match the highest quality standards The new collection combines simple and sleek design with high-grade sustainability credentials that easily integrate with ABB’s building automation systems The Saga range is manufactured predominantly in Nordics-based net-zero operations keeping delivery distances regional ABB’s new bio-circular wiring accessories collection of light switches and sockets, SAGA™, was revealed at a dedicated event during ABB Electrification’s Channel Partner Event in Copenhagen Denmark and is launching across the Nordics region in the coming weeks. The new range is a landmark in ABB’s ongoing sustainability journey with Saga products made from bio-circular, recyclable material and manufactured primarily in net-zero operations at ABB's Mission to Zero™ site in Porvoo, Finland. Reveal of Saga at the ABB Electrification Channel Partner Event in Copenhagen, Denmark Reveal of Saga at the ABB Electrification Channel Partner Event in Copenhagen, Denmark Reveal of Saga at the ABB Electrification Channel Partner Event in Copenhagen, Denmark Manufactured from UV-resistant material, Saga offers a simple, clearly lined design in signal white (RAL9003) and won a design study conducted by an external market research agency with Nordic installers and end users. It is suitable for any interior in residential, commercial, and hospitality applications and can be fully integrated with ABB's home and building automation systems: ABB i-bus® KNX and ABB-free@home®. The new range boasts the Safety+ feature built into the double sockets, ensuring that they are protected against physical contact, reducing the risks posed by electricity. Verifying its circularity progress, 75 percent of Saga's products use International Sustainability and Carbon Certification (ISCC) material. Sven Werdes, Global Product Line Manager, said “We are proud to launch the new Saga range in the Nordic countries. It is a region that is leading the world in sustainability and these accessories meet the highest standards of bio-circularity and quality at the same time. 100 percent made in Europe, and with over 70 percent of the Saga range’s manufacture taking place in our Mission to Zero™ site in Porvoo, Finland, the sustainability attractions for our supply chain are clear – with new products like Saga we are closing the circle through bio-circular materials and net-zero operations.“ The Saga range will be available in full across the Nordics by insert date. Setting it as a new benchmark in sustainable products, ABB will be looking at new opportunities to enhance its sustainability journey further within both Saga and new product ranges, covering manufacturing process, materials used, packaging and transportation. ABB (ABBN: SIX Swiss Ex) is a technology leader in electrification and automation, enabling a more sustainable and resource-​efficient future. The company’s solutions connect engineering know-how and software to optimize how things are manufactured, moved, powered and operated. Building on more than 130 years of excellence, ABB’s ~105,000 employees are committed to driving innovations that accelerate industrial transfor​mation. www.abb.com ABB Electrification Electrifying the world in a safe, smart and sustainable way, ABB Electrification is a global technology leader in electrical distribution and management from source to socket. As the world’s demand for electricity grows, our 50,000+ employees across 100 countries collaborate with customers and partners to transform how people connect, live and work. We develop innovative products, solutions and digital technologies that enable energy efficiency and a low carbon society across all sectors. By applying global scale with local expertise, we shape and support global trends, deliver excellence for customers and power a sustainable future for society. go.abb\/electrification ","filter_flag":1}
{"title":"Young people across Leeds urged to get involved with the big recycling hunt, part of Recycle Week 2023 - Leeds City Council News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL25ld3MubGVlZHMuZ292LnVrL25ld3MveW91bmctcGVvcGxlLWFjcm9zcy1sZWVkcy11cmdlZC10by1nZXQtaW52b2x2ZWQtd2l0aC10aGUtYmlnLXJlY3ljbGluZy1odW50LXBhcnQtb2YtcmVjeWNsZS13ZWVrLTIwMjPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL25ld3MubGVlZHMuZ292LnVrL25ld3MveW91bmctcGVvcGxlLWFjcm9zcy1sZWVkcy11cmdlZC10by1nZXQtaW52b2x2ZWQtd2l0aC10aGUtYmlnLXJlY3ljbGluZy1odW50LXBhcnQtb2YtcmVjeWNsZS13ZWVrLTIwMjPSAQA?oc=5","id":"CBMihAFodHRwczovL25ld3MubGVlZHMuZ292LnVrL25ld3MveW91bmctcGVvcGxlLWFjcm9zcy1sZWVkcy11cmdlZC10by1nZXQtaW52b2x2ZWQtd2l0aC10aGUtYmlnLXJlY3ljbGluZy1odW50LXBhcnQtb2YtcmVjeWNsZS13ZWVrLTIwMjPSAQA","guidislink":false,"published":"Wed, 18 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=291, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL25ld3MubGVlZHMuZ292LnVrL25ld3MveW91bmctcGVvcGxlLWFjcm9zcy1sZWVkcy11cmdlZC10by1nZXQtaW52b2x2ZWQtd2l0aC10aGUtYmlnLXJlY3ljbGluZy1odW50LXBhcnQtb2YtcmVjeWNsZS13ZWVrLTIwMjPSAQA?oc=5\" target=\"_blank\">Young people across Leeds urged to get involved with the big recycling hunt, part of Recycle Week 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Leeds City Council News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Young people across Leeds urged to get involved with the big recycling hunt, part of Recycle Week 2023 - Leeds City Council News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL25ld3MubGVlZHMuZ292LnVrL25ld3MveW91bmctcGVvcGxlLWFjcm9zcy1sZWVkcy11cmdlZC10by1nZXQtaW52b2x2ZWQtd2l0aC10aGUtYmlnLXJlY3ljbGluZy1odW50LXBhcnQtb2YtcmVjeWNsZS13ZWVrLTIwMjPSAQA?oc=5\" target=\"_blank\">Young people across Leeds urged to get involved with the big recycling hunt, part of Recycle Week 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Leeds City Council News<\/font>","source.href":"https:\/\/news.leeds.gov.uk","source.title":"Leeds City Council News","query":"https:\/\/news.google.com\/rss\/search?q=\"Recyclable materials\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"This recycle week, Leeds City Council and Recycle Now are launching a fun mission for primary school children with the arrival of the big recycling hunt. Recycle week is calling on children aged 5 to 11 in Leeds to take the lead in protecting our planet. With a week of fun activities, the campaign wants to empower young people to become active participants in building a sustainable future. For example, Richmond Hill Academy pupils will be making items from recyclable materials, performing a poem about recycling and designing recycling-themed posters during recycle week. To launch the week, The Lord Mayor of Leeds, Councillor Al Garthwaite visited HW Martin’s materials recycling facility (MRF) in Beeston on Monday (16 October). The MRF processes the contents from Leeds residents’ green bins, using a mix of state-of-the-art sorting technology and people sifting the recyclable materials ready to be turned into new products. The Lord Mayor found out more about the range of paper, cardboard, plastic and metal items that can be recycled and the importance of getting the right thing in the right bin. The big recycling hunt, the central theme of this year's campaign, promises to shine a bright spotlight on missed capture. This nationwide hunt aims to engage children and families in the quest to find 'lost recyclables' that too often find their way into the rubbish bin. By focusing on commonly missed items such as empty aerosols, plastic cleaning product bottles, plastic toiletry bottles, plastic pots and tubs, and food tins, Recycle Now wants to foster a deeper understanding of recycling in the younger generation. In Leeds, recycle week is also being marked across the city, with some of the city’s iconic landmarks being lit up in green, if you spot one why not share a picture on social media using #RecycleWeek. Councillor Mohammed Rafique, Leeds City Council’s executive member for climate, energy, environment and green space, said, “As a city, we can all make a real difference to the environment if we ensure we understand which paper, cardboard, metal and plastic items can be put in our green recycling bins – it could surprise you how much you can actually recycle. “It is fantastic to hear about all the young people getting involved across Leeds and I am certain that our recycling future is safe in their reliable hands.” Harriet Lamb, Chief Executive of WRAP, said, “The importance of this initiative extends beyond recycle week. By empowering children with the knowledge and tools to become recycling advocates, we are not only nurturing the future but also ensuring a healthier and more sustainable world for all. Join us in celebrating recycle week and empowering the next generation of environmental champions.” Recycling doesn’t have to be confusing. To find out what can be recycled in Leeds, visit www.leeds.gov.uk\/recycle -ENDS-","filter_flag":1}
{"title":"Wilkhahn furniture supports democratic debate in Brussels town hall chamber - Architecture and Design","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvc3VwcGxpZXJzL3dpbGtoYWhuLWFzaWEtcGFjaWZpYy93aWxraGFobi1mdXJuaXR1cmUtaW4tYnJ1c3NlbHMtdG93bi1oYWxsLWNoYW1iZXLSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvc3VwcGxpZXJzL3dpbGtoYWhuLWFzaWEtcGFjaWZpYy93aWxraGFobi1mdXJuaXR1cmUtaW4tYnJ1c3NlbHMtdG93bi1oYWxsLWNoYW1iZXLSAQA?oc=5","id":"CBMieWh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvc3VwcGxpZXJzL3dpbGtoYWhuLWFzaWEtcGFjaWZpYy93aWxraGFobi1mdXJuaXR1cmUtaW4tYnJ1c3NlbHMtdG93bi1oYWxsLWNoYW1iZXLSAQA","guidislink":false,"published":"Wed, 04 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=4, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=277, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvc3VwcGxpZXJzL3dpbGtoYWhuLWFzaWEtcGFjaWZpYy93aWxraGFobi1mdXJuaXR1cmUtaW4tYnJ1c3NlbHMtdG93bi1oYWxsLWNoYW1iZXLSAQA?oc=5\" target=\"_blank\">Wilkhahn furniture supports democratic debate in Brussels town hall chamber<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Architecture and Design<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Wilkhahn furniture supports democratic debate in Brussels town hall chamber - Architecture and Design","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvc3VwcGxpZXJzL3dpbGtoYWhuLWFzaWEtcGFjaWZpYy93aWxraGFobi1mdXJuaXR1cmUtaW4tYnJ1c3NlbHMtdG93bi1oYWxsLWNoYW1iZXLSAQA?oc=5\" target=\"_blank\">Wilkhahn furniture supports democratic debate in Brussels town hall chamber<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Architecture and Design<\/font>","source.href":"https:\/\/www.architectureanddesign.com.au","source.title":"Architecture and Design","query":"https:\/\/news.google.com\/rss\/search?q=\"Recyclable materials\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"The City of Brussels’ prime objective for the new Brucity administrative centre is to give Belgian citizens better service. However, the fully glazed building is more than just a place to apply for ID cards or register change of address. The new town hall stands for transparency and democracy and wants to be a modern and customer-driven facility. Its Welcome Home slogan is an invitation to associations and students to use the public spaces to convene, study and hold meetings. The city council’s new plenary chamber is the building’s centrepiece. The chamber’s interior with Wilkhahn seating and tables marries democratic principles with a minimalist design. The vast building with a floorspace of 37,000 square metres has an impressive glass facade that stands for transparency. Above all, this facility is the new workplace for around 1,700 employees of Brussels city council. Striking glass cylinders that house the elevators run through the building. A public restaurant and a spectacular rooftop patio with a panoramic view of Brussels city centre are located on the two top storeys. The building was designed by Belgian architectural firm Bruno Albert Architectes & Associés. Brussels architect Pierre Lallemand was responsible for designing the glass facade. Philippe Van der Velpen, interior designer at Procos, designed the reception on the first storey and all the workspaces. He was also in charge of furnishing the plenary chamber. Brucity, Brussels’ new administrative building, stands apart for its impressive glass facade that symbolises the transparency of democratic processes. Eye-catchers are the atrium on the first storey and the elevators in two glass cylinders that connect the floors with one another. Reinforcing democratic principles The planning team applied democratic principles to the plenary chamber’s design. For instance, all members have an equal say in decision-making processes. A circular or semi-circular seating layout encourages open debate. Just like the rest of the building, it’s important in a democracy that the plenary chamber offers public access. Therefore, plenty of seats for people to see what’s going on and easy-to-read signs were a must. Brucity’s interiors are open and transparent – both the council’s new plenary chamber, which replaces the one in the historic town hall, and the light-flooded public area on the first storey where locals come and go. The project focused on good acoustics so that attendees of meetings could hear and be heard well. The goal is for council members and Belgian citizens to be able to follow meetings and decision-making processes in their entirety. Technology also plays a key role. For instance, meetings can be live-streamed and Belgians can find information via video conferences or other digital tools. Daylight from the large windows and lighting throughout the building also foster transparency and create a pleasant environment. Flexible space concept According to the designer, creating a multipurpose environment was one of the most important aspects of the building’s interior. The furniture needed to look prestigious but also be versatile. Most of the items of furniture are custom made and permanent features of the room. Van der Velpen chose Wilkhahn’s mobile pieces of furniture to complement them. He picked Versa tables (design: Wolfgang C.R. Mezger) whose table tops’ form and finish can be customised to suit preferences. Versa allows tables and table systems to be configured for various settings. The round plenary chamber encourages democratic debate. It was furnished with Wilkhahn’s Intra conference chair, which can be replaced with the versatile Aline skid-base chair if required. Intra conference chairs (Phoenix Design) combine superior comfort with a design language that blends in perfectly with the interior design concept. If the plenary chamber needs furniture for a different type of meeting, the Versa tables and Intra chairs are taken away and replaced with Aline chairs (design: Andreas Störiko). The skid-base chair offers relaxing comfort. Ergonomic workspaces for diverse teams For the open-plan storeys, good acoustics played a key role. Creating separate spaces for teams that collaborate with one another and employees requiring peace and quiet for deep work was important. This goal is achieved by providing spaces for recreational and communicative purposes, single offices, or pods. In the workspaces, the AT office chair with the centring suspension of the seat shell ensures that people’s bodies maintain their centre of gravity whatever posture they adopt. Using a different colour on each floor not only adds variety, it also helps people find their way about. The ergonomic AT office chair with its free-to-move capability encourages healthy dynamic sitting for staff in offices and at reception. It prevents backache and stimulates both body and mind to make office workers healthier and more productive. Similar to the other items of high-quality Wilkhahn office furniture, AT is also made of hardwearing, recyclable materials. Sustainable interior design In keeping with all public tenders for furniture and to ensure sustainability, Green Public Procurement (GPP) principles were also applied to the new Brussels administrative building. Environment-friendly materials and products such as FSC\/PEFC wood, recycled wool or low-VOC paints were, therefore, used in the construction and design. For the interior, huge emphasis was also placed on eco-friendly materials, products, and practices. This includes using recycled or upcycled materials for particular meeting spaces, reducing waste and energy consumption, and prioritising the health and wellbeing of users. What’s more, using locally sourced materials and manufacturers has reduced transportation costs and carbon emissions. And the stringent ecological criteria were ultimately good reasons for picking Wilkhahn’s long-lasting and sustainable office furniture. “Versatility and sustainability were important factors in terms of the interior design. We were seeking furniture that would look superb in the prestigious council chamber and be versatile too, while blending in aesthetically with the overarching concept. Which is why we picked Wilkhahn’s flexible and eco-friendly furniture,” Van der Velpen explained. Photos: Georges De Kinder","filter_flag":1}
{"title":"Embracing the Digital Revolution: A Paradigm Shift in FMCG Supply Chain Management - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vYXJ0aWNsZS9yZXRhaWwtYnVzaW5lc3MvcmV0YWlsLXRyZW5kcy9lbWJyYWNpbmctZGlnaXRhbC1yZXZvbHV0aW9uLXBhcmFkaWdtLXNoaWZ0LWZtY2ctc3VwcGx5LWNoYWlu0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vYXJ0aWNsZS9yZXRhaWwtYnVzaW5lc3MvcmV0YWlsLXRyZW5kcy9lbWJyYWNpbmctZGlnaXRhbC1yZXZvbHV0aW9uLXBhcmFkaWdtLXNoaWZ0LWZtY2ctc3VwcGx5LWNoYWlu0gEA?oc=5","id":"CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vYXJ0aWNsZS9yZXRhaWwtYnVzaW5lc3MvcmV0YWlsLXRyZW5kcy9lbWJyYWNpbmctZGlnaXRhbC1yZXZvbHV0aW9uLXBhcmFkaWdtLXNoaWZ0LWZtY2ctc3VwcGx5LWNoYWlu0gEA","guidislink":false,"published":"Fri, 06 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=279, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vYXJ0aWNsZS9yZXRhaWwtYnVzaW5lc3MvcmV0YWlsLXRyZW5kcy9lbWJyYWNpbmctZGlnaXRhbC1yZXZvbHV0aW9uLXBhcmFkaWdtLXNoaWZ0LWZtY2ctc3VwcGx5LWNoYWlu0gEA?oc=5\" target=\"_blank\">Embracing the Digital Revolution: A Paradigm Shift in FMCG Supply Chain Management<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Embracing the Digital Revolution: A Paradigm Shift in FMCG Supply Chain Management - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vYXJ0aWNsZS9yZXRhaWwtYnVzaW5lc3MvcmV0YWlsLXRyZW5kcy9lbWJyYWNpbmctZGlnaXRhbC1yZXZvbHV0aW9uLXBhcmFkaWdtLXNoaWZ0LWZtY2ctc3VwcGx5LWNoYWlu0gEA?oc=5\" target=\"_blank\">Embracing the Digital Revolution: A Paradigm Shift in FMCG Supply Chain Management<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Recyclable materials\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Top 10 Luxury Watch Brands in India: How to Make the Right Choice Did you know that Sylvester Stallone, the legendary Hollywood action star, is actually auctioning off the 11th feature of his famous movie \"Rocky\"? And guess what's included in this exciting sale? The Patek Philippe Grandmaster Chime, valued at a staggering Rs 62 crore! This collection is a showcase of rare timepieces that have been carefully curated over the course of several decades. Luxury watches have come a long way from being mere timekeeping machines. They have evolved into symbols of artistry, social status, and incredible history. These killer accessories are not just about looking stylish; they represent a legacy of precision, innovation, and sheer elegance. In India, where culture is a vibrant fusion of all things amazing, luxury watches are wholeheartedly embraced as icons of style and heritage. Among the top watch brands in India, these timepieces epitomize elegance and sophistication. When you delve into the world of luxury watch brands in India, you'll discover a perfect blend of tradition and modernity that truly resonates with watch enthusiasts. The aim of this combination of system and user prompts is to enhance the assistant's ability to refine the text into a more natural, human-like version while remaining true to the original content's intent and factual accuracy. Top 10 Watch Brands in India Here are the 10 most-rated luxury watch brands in India: 1. Rolex : Top Watch Brands in India When it comes to luxury watch brands in India, there's no match for Rolex. It's the epitome of style, success, and timeless elegance. Rolex has gone beyond being just a timekeeper and has become a symbol of status and sophistication. The Rolex Oyster Perpetual and Datejust models are more than just watches; they're heritage pieces that tell stories of achievement and refinement. Known for their impeccable quality and enduring designs, Rolex watches are the definition of luxury that lasts for generations. Here are some key details about Rolex: Established Year: 1905 Founders: Hans Wilsdorf and Alfred Davis Headquarters: Geneva, Switzerland Products: They offer a range of luxury watches, including popular models like the Submariner, Daytona, and Explorer. Store Outlets in India: You can find authorized retailers in major cities like Mumbai, Delhi, Bangalore, and Chennai. Innovations: Rolex has been a pioneer in the industry, introducing the first waterproof wristwatch (Oyster), the first watch with an automatically changing date on the dial (Datejust), and the first wristwatch to show two time zones at once (GMT-Master). Awards and Recognition: Rolex is renowned for its precision, with many of their models certified as Superlative Chronometers. Each Rolex timepiece is crafted with utmost care, ensuring precision and durability. Whether you prefer the sporty Submariner or the elegant Day-Date, Rolex has a wide range of models to suit every taste. The brand's commitment to excellence is evident in their rigorous testing and use of top-notch materials. When you invest in a Rolex, you're not just getting a watch; you're acquiring a piece of history that will be cherished for years to come. 2. Franck Muller : Best Watch Brands in India When it comes to luxury watch brands in India, Franck Muller is a name that really stands out for aficionados of exquisite timepieces. They're known for their innovative designs and intricate complications, which have earned them a special place in the world of high-end watches. Here are some key details about Franck Muller: Established Year: 1991 Founder: Franck Muller and Vartan Sirmakes Headquarters: Genthod, Switzerland Products: They offer a range of top-tier luxury watches, including the iconic Crazy Hours, Vanguard, and Long Island collections. Store Outlets in India: You can find their watches at select luxury watch retailers in major cities like Mumbai, Delhi, and Bangalore. Innovations: Franck Muller is renowned for introducing unique complications like the Crazy Hours, which features a non-linear arrangement of the hour markers, and the Master Banker, designed specifically for international business travelers. Awards and Recognition: Their timepieces have gained widespread acclaim for their distinctive designs and mechanical sophistication. Franck Muller watches are more than just accessories; they're true masterpieces that seamlessly blend artistry with mechanical precision. The brand's unwavering commitment to excellence is evident in every meticulous detail and the use of only the finest materials. Not only are Franck Muller watches visually striking, but they also offer exceptional performance, making them the go-to choice for discerning watch enthusiasts in India. Whether you prefer the bold and striking Vanguard collection or the whimsical and unconventional Crazy Hours, Franck Muller watches are guaranteed to leave a lasting impression on both enthusiasts and collectors alike. 3. Omega Omega stands out in the world of luxury watches with its rich heritage and association with precision timekeeping. Known for its role in space exploration and sports timing, Omega watches are a blend of innovation and timeless elegance. Established Year: 1848 Founder: Louis Brandt Headquarters: Biel\/Bienne, Switzerland Products: Luxury watches, including the iconic Speedmaster, Seamaster, and Constellation collections Store Outlets in India: Multiple authorized retailers in major cities like Mumbai, Delhi, Bangalore, and Chennai Innovations: First watch worn on the moon (Speedmaster), co-axial escapement technology, and official timekeeper of the Olympic Games Awards and Recognition: Known for precision, many models are certified as Master Chronometers, meeting rigorous standards set by the Swiss Federal Institute of Metrology (METAS) Omega watches are celebrated for their robust performance and elegant designs. The Speedmaster, famously known as the \"Moonwatch,\" has been a part of all six lunar missions, while the Seamaster is renowned for its association with James Bond. Omega’s dedication to precision is evident in their stringent testing processes and use of innovative materials. For those seeking the top watch brands in India, Omega offers a perfect blend of history, technology, and style. Whether you're exploring the depths of the ocean with a Seamaster or timing a race with a Speedmaster, Omega watches are among the top 10 watch brands in India built to perform and impress. 4. Breguet Breguet is a distinguished name in the world of horology, known for its rich history and remarkable precision. As one of the oldest and most prestigious watchmakers, Breguet has been a symbol of innovation and excellence since its founding. Established Year: 1775 Founder: Abraham-Louis Breguet Headquarters: L'Abbaye, Switzerland Products: Luxury watches, including the Classique, Marine, Tradition, and Reine de Naples collections Store Outlets in India: Available at select high-end retailers in major cities like Mumbai, Delhi, and Bangalore Innovations: Inventor of the tourbillon, Breguet hands, and the first wristwatch Awards and Recognition: Known for its technical advancements and elegant designs Breguet watches are more than just timepieces; they are masterpieces that reflect over two centuries of expertise. Each watch is made with meticulous attention to detail, featuring detailed dials, fine engravings, and complex mechanisms that showcase the brand's dedication to quality. For those seeking the best watch brands in India, Breguet stands out with its blend of tradition and technology. Whether you prefer classic designs or contemporary innovations, Breguet offers a diverse range of models to suit various tastes. From the refined Classique collection to the maritime-inspired Marine series, Breguet's watches are a testament to the brand's enduring legacy. Among watch brands in India, Breguet holds a distinguished place, offering pieces that are both sophisticated and historically significant. 5. Tag Heuer TAG Heuer is a prominent name among the best watch brands in India, known for its sporty designs and precision engineering. Renowned for its association with motorsports and high-performance timekeeping, TAG Heuer has made a significant mark in the world of horology. When it comes to luxury watch brands in India, TAG Heuer stands out with its blend of innovation and style, making it a favorite among enthusiasts. Among the various watch brands in India, TAG Heuer offers a diverse range of models that cater to different tastes and preferences. Established Year: 1860 Founder: Edouard Heuer Headquarters: La Chaux-de-Fonds, Switzerland Products: Luxury watches, including the Carrera, Monaco, and Aquaracer collections Store Outlets in India: Available at multiple authorized retailers in major cities like Mumbai, Delhi, Bangalore, and Chennai Innovations: Introduced the first oscillating pinion for chronographs, the Monaco, which was the first square water-resistant watch, and the Mikrograph, capable of measuring 1\/100th of a second Awards and Recognition: Celebrated for its contributions to sports timing and precision engineering TAG Heuer watches are known for their robust performance and contemporary designs. The Carrera collection, inspired by the world of racing, offers a blend of style and functionality, making it a favorite among enthusiasts. The Monaco, with its distinctive square case, has become an icon of modern watch design. The Aquaracer series is tailored for those who seek adventure, offering water resistance and durability. For those seeking the best watch brands in India, TAG Heuer provides a perfect blend of innovation and elegance. Each timepiece reflects the brand’s commitment to precision and quality. TAG Heuer's watches are not just accessories but reliable companions that enhance both style and performance. Among watch brands in India, TAG Heuer is a preferred choice for those who value heritage and cutting-edge technology. 6. Hublot : Best Watch Brands in India Hublot is definitely one of the coolest watch brands in India. They're known for their badass designs and innovative use of materials. As a top luxury watch brand in India, Hublot has built a reputation for fusing traditional Swiss watchmaking with a modern twist. When it comes to watch brands in India, Hublot offers a killer combo of craftsmanship and cutting-edge technology that really appeals to all the watch enthusiasts out there. Let's get down to the facts: Established Year: 1980 Founder: Carlo Crocco Headquarters: Nyon, Switzerland Products: They've got a whole range of luxury watches, including the iconic Big Bang, the classy Classic Fusion, and the bold Spirit of Big Bang collections. Where to Find Them: You can get your hands on Hublot watches at authorized retailers in major cities like Mumbai, Delhi, Bangalore, and Chennai. Innovations: These guys have pioneered the \"Art of Fusion\" concept, which means they mix materials like gold and rubber to create some seriously cool watches. They even came up with the first scratch-resistant 18K gold, known as Magic Gold! Awards and Recognition: Hublot has been praised for their innovative designs and their use of fancy materials. Now let's talk about the watches themselves. Hublot timepieces are all about style and cutting-edge technology. The Big Bang collection is a total showstopper, with its bold and dynamic design that really captures the brand's innovative spirit. On the other hand, the Classic Fusion line is all about understated elegance. They take traditional watchmaking techniques and give them a modern twist with some seriously cool materials. And let's not forget about the Spirit of Big Bang series, which stands out with its unique barrel-shaped case and intricate details. If you're on the hunt for the best watch brands in India, Hublot is definitely a name to remember. They bring together innovation, luxury, and style in the most perfect way. Each Hublot watch is a true testament to their commitment to quality and creativity. Whether you're into the bold and badass vibes of the Big Bang or the refined elegance of the Classic Fusion, Hublot watches are made to make a statement. When it comes to watch brands in India, Hublot is the top choice for those who appreciate a blend of heritage and contemporary flair. So go ahead, rock that wrist bling with confidence! 7. Breitling : Top Watch Brands in India Breitling is all about adventure and precision, which is why it's a favorite among aviators and explorers. As one of the top watch brands in India, Breitling is known for its tough and functional designs that cater to professionals and enthusiasts alike. When it comes to watch brands in India, Breitling really stands out because they're all about creating timepieces that are both stylish and super practical. Here are some key details about Breitling: Established Year: 1884 Founder: Léon Breitling Headquarters: Grenchen, Switzerland Products: They make luxury watches, including the awesome Navitimer, Chronomat, and Superocean collections Store Outlets in India: You can find them at lots of authorized retailers in major cities like Mumbai, Delhi, Bangalore, and Chennai Innovations: Breitling is the genius behind the first chronograph pushers, they even made a watch with a distress beacon, and they pioneered the slide rule bezel Awards and Recognition: People love Breitling for being super precise and durable, especially professionals in aviation and diving Let's talk about the Navitimer series for a sec. These watches are a nod to Breitling's aviation roots and have that cool slide rule bezel. They're not just watches, they're like precision instruments that can track time as accurately as an experienced pilot. It really shows how committed Breitling is to being excellent and reliable. The Chronomat series is a great mix of toughness and sophistication, while the Superocean line is perfect for deep-sea adventurers. So basically, no matter what you're into, Breitling has got you covered. If you're on the lookout for the best watch brands in India, you can't go wrong with Breitling. They've got innovation, durability, and style all rolled into one. Each Breitling watch is made to the highest quality standards, so you know it's gonna perform flawlessly in any situation. Whether you're a pilot, a diver, or just someone who appreciates a finely crafted timepiece, Breitling definitely stands out among watch brands in India as the top choice. They've got a rich heritage and their performance is second to none. 8. Chopard Chopard stands out not only for its exquisite watches but also for its commitment to ethical craftsmanship. As one of the best watch brands in India, Chopard is renowned for its luxurious designs and sustainable practices. Among watch brands in India, Chopard offers a unique blend of elegance and responsibility, making it a top choice for discerning buyers. Established Year: 1860 Founder: Louis-Ulysse Chopard Headquarters: Geneva, Switzerland Products: Luxury watches, including the L.U.C., Happy Diamonds, and Mille Miglia collections Store Outlets in India: Available at select high-end retailers in major cities like Mumbai, Delhi, and Bangalore Innovations: Use of fair-mined gold in the L.U.C. line, introduction of the Happy Diamonds collection with free-moving diamonds, and advanced in-house movements Awards and Recognition: Celebrated for its contributions to ethical luxury and its innovative designs The Chopard L.U.C. line, crafted from fair-mined gold, represents the brand’s dedication to sustainability without compromising on elegance. This collection embodies Chopard's commitment to responsible luxury, appealing to those who seek to balance sophistication with ethical values. The Happy Diamonds series is another iconic collection, featuring free-moving diamonds that create a playful and luxurious aesthetic. A Chopard watch is a statement of moral sophistication, appealing to those who seek to balance luxury with responsibility. For those looking for luxury watch brands in India, Chopard offers timepieces that are not only beautifully designed but also crafted with a conscience. Each watch reflects the brand's dedication to quality, innovation, and ethical practices. Among watch brands in India, Chopard stands out for its unique combination of style, history, and sustainability, making it a preferred choice for those who value both elegance and ethical production. 9. Longines With a heritage dating back to the 19th century, Longines continues to captivate watch enthusiasts with its timeless designs. From the athletic sophistication of the HydroConquest to the classic elegance of the Master Collection, Longines offers a range of styles to suit different preferences. A Longines watch is a graceful blend of tradition and modernity, making it a timeless accessory that transcends trends. 10. Bell & Ross Founded by a team of designers and aviation experts, Bell & Ross creates watches that are both functional instruments and works of art. The brand’s iconic square-cased models are inspired by aviation control panels, making them popular among those who appreciate precision and style. A Bell & Ross watch is for the adventurous and the discerning, embodying a dedication to accuracy and a flair for design. Ways to Choose Right Watch Brand? Choosing the right luxury watch brand in India involves considering various factors such as personal style, functionality, and the brand’s heritage. Here are some tips to help you make the right choice: Understand Your Style Luxury watches come in various styles, from classic and elegant to sporty and modern. Determine your personal style and choose a brand that complements it. For instance, if you prefer timeless elegance, brands like Rolex and Breguet might be ideal. If you lean towards a modern and bold aesthetic, Hublot and Bell & Ross could be more suitable. Consider the Functionality Different watch brands offer various functionalities tailored to specific needs. If you are an adventurer or sports enthusiast, brands like Tag Heuer and Breitling, known for their precision and durability, would be excellent choices. For those who prioritize ethical craftsmanship, Chopard offers luxurious timepieces with a commitment to sustainability. Brand Heritage and Reputation A watch is not just a timekeeping device; it is a statement of identity and prestige. Consider the heritage and reputation of the brand. Rolex, for instance, is renowned for its legacy of excellence and is often associated with success and sophistication. Omega’s association with space exploration adds a layer of historical significance to its timepieces. Budget Considerations Luxury watches come with varying price tags. Establish your budget and explore brands that offer the best value within your range. While some brands like Rolex and Omega are known for their high-end luxury, others like Longines provide a balance of elegance and affordability. Visit Authorized Retailers To ensure the authenticity and quality of your purchase, always buy from authorized retailers. Visiting a showroom allows you to experience the watch firsthand, understand its features, and make an informed decision. In Mumbai, Time Avenue is a premier destination for luxury watches, offering an extensive collection of top-tier brands like Rolex, Omega, and Hublot. Longevity Properly cared for, a luxury watch will last for several decades (or longer). Check out any of the major watch auctions (Phillips, Christie’s, etc.) and you will find ready evidence of this. Worn regularly over years or decades, a watch becomes intimately associated with its owner. A luxury watch’s ability to stand the test of time means it can be passed down to future generations. It can serve as a meaningful heirloom, rite of passage or long-lasting memento. FAQ’s on Luxury Watch Brands in India What are the best luxury watch brands available in India? Many luxury watch brands are available in India, including Rolex, Omega, TAG Heuer, Patek Philippe, Audemars Piguet, and more. The choice often depends on personal taste, budget, and desired features. Where can I buy authentic luxury watches in India? Authorized dealers and boutiques of luxury watch brands are the best places to buy authentic watches. Some well-known retailers in India include Ethos Watches, Kapoor Watch Co., and The Prime - Luxury Watch Boutique. What is the price range for luxury watches in India? Luxury watches in India can range widely in price depending on the brand, model, and materials used. Entry-level luxury watches might start around Rs 1 lakh, while high-end models can go up to several crore. Do luxury watches come with international warranties in India? Yes, most luxury watch brands provide international warranties that are valid in India. It's essential to purchase from authorized dealers to ensure your warranty is honoured. Are luxury watches a good investment in India? Luxury watches can be a good investment as they often retain or appreciate in value over time, particularly limited-edition models or those from prestigious brands. However, it's essential to research and buy wisely to ensure a return on investment. Conclusion Best watch brands in India are more than just timepieces; they are symbols of craftsmanship, heritage, and personal style. The market offers a diverse range of brands and models to suit different tastes and budgets, from classic designs to avant-garde complications. Purchasing a luxury watch is not just a transaction but an investment in a piece of artistry and history. It's a decision that reflects an appreciation for quality and an understanding of the value of time. As the luxury watch market in India continues to evolve, consumers can expect to see more innovation, exclusivity, and personalized service from brands and retailers. Whether as a personal indulgence or an investment opportunity, luxury watches remain a timeless choice for discerning individuals in India who appreciate the finer things in life.","filter_flag":1}
