{"title":"Geospatial intelligence empowers development in multiple fields - GIM International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmdpbS1pbnRlcm5hdGlvbmFsLmNvbS9jYXNlLXN0dWR5L2dlb3NwYXRpYWwtaW50ZWxsaWdlbmNlLWVtcG93ZXJzLWRldmVsb3BtZW50LWluLW11bHRpcGxlLWZpZWxkc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmdpbS1pbnRlcm5hdGlvbmFsLmNvbS9jYXNlLXN0dWR5L2dlb3NwYXRpYWwtaW50ZWxsaWdlbmNlLWVtcG93ZXJzLWRldmVsb3BtZW50LWluLW11bHRpcGxlLWZpZWxkc9IBAA?oc=5","id":"CBMibGh0dHBzOi8vd3d3LmdpbS1pbnRlcm5hdGlvbmFsLmNvbS9jYXNlLXN0dWR5L2dlb3NwYXRpYWwtaW50ZWxsaWdlbmNlLWVtcG93ZXJzLWRldmVsb3BtZW50LWluLW11bHRpcGxlLWZpZWxkc9IBAA","guidislink":false,"published":"Mon, 21 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=233, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmdpbS1pbnRlcm5hdGlvbmFsLmNvbS9jYXNlLXN0dWR5L2dlb3NwYXRpYWwtaW50ZWxsaWdlbmNlLWVtcG93ZXJzLWRldmVsb3BtZW50LWluLW11bHRpcGxlLWZpZWxkc9IBAA?oc=5\" target=\"_blank\">Geospatial intelligence empowers development in multiple fields<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GIM International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Geospatial intelligence empowers development in multiple fields - GIM International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmdpbS1pbnRlcm5hdGlvbmFsLmNvbS9jYXNlLXN0dWR5L2dlb3NwYXRpYWwtaW50ZWxsaWdlbmNlLWVtcG93ZXJzLWRldmVsb3BtZW50LWluLW11bHRpcGxlLWZpZWxkc9IBAA?oc=5\" target=\"_blank\">Geospatial intelligence empowers development in multiple fields<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GIM International<\/font>","source.href":"https:\/\/www.gim-international.com","source.title":"GIM International","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"The integration of geospatial information software (GIS), remote sensing and surveying and mapping data has accelerated in recent years. Meanwhile, new technologies such as AI models and ChatGPT are emerging and being integrated with GIS to bring new momentum. As the market enters a new development stage, how can we embrace these new technologies to empower industry innovation? And, how can we develop more powerful products to meet the growing market demand and solve new pain points? SuperMap Software Group, the leading GIS platform manufacturer in Asia and the second largest worldwide, released a new generation of GIS software products – SuperMap GIS 2023 – at the Geospatial Information Software Technology Conference (GISTC 2023) held in June this year. In this series, SuperMap has not only improved the five GIS platform software technical systems (BitDC, namely Big Data GIS, AI GIS, 3D GIS, Distributed GIS and cross-platform GIS) and enhanced the capabilities of the cloud GIS server, edge GIS server, terminal GIS and other products, but also released several new products. These include the cross-platform remote sensing image processing desktop software and the cross-platform electronic nautical chart production desktop software, meeting new market demands and solving users’ pain points. Integrating remote sensing and GIS to accurately address pain points Of the new products released at the conference, the remote sensing and GIS integration software attracted the most attention. “Remote sensing and GIS are closely related, but they have been disconnected from each other for a long time. Remote sensing image processing is carried out in remote sensing software, but data management, data release and data application all require GIS software. As data conversion is time-consuming and switching between different types of software laborious, the market urgently required the integration of remote sensing and GIS,” said Dr Song Guanfu, chair of the board of SuperMap Software Group. The SuperMap remote sensing and GIS integration product system consists of three levels: the spatial database, the C++ kernel and Java components, and products. Integrating the world’s leading photogrammetry and remote sensing core algorithms, and based on intelligent processing, automation, high-performance computing and other technologies, SuperMap developed a cross-platform remote sensing image processing desktop software – SuperMap ImageX Pro (beta). The software features remote sensing and GIS integration, cross-platform application, intelligent processing and high computing performance. SuperMap remote sensing and GIS integration product system. Chen Yong, associate director of SuperMap Research Institute, said in an interview after the conference: “The newly released remote sensing and GIS integration software can solve the two pain points that have long existed: remote sensing data that cannot be used or cannot be processed on time. For the past several years, SuperMap has accumulated a lot of experience in IT technologies such as big data, artificial intelligence, and 3D, distributed and cross-platform technologies. Big data and distributed technology enable the storage, analysis and use of massive amounts of data and improve the overall remote sensing image data processing capability. The application of artificial intelligence technology to the remote sensing processing can improve processing efficiency in terms of interpretation, speeding up the production process.” Electronic nautical chart production software assists with comprehensive marine management In addition to remote sensing and GIS integration software, the newly released cross-platform electronic nautical chart production desktop software – SuperMap iMaritimeEditor – has also drawn much attention. The software provides functions such as S57 standard chart data management, S52 chart display, S58 data check and standard expansion. It can be used for the production, application, printing and publication of inland river, port and coastal charts as well as military standard charts. Cross-platform nautical chart production. SuperMap iMaritimeEditor allows people to edit collaboratively but independently. Once the editing is complete, the version can be updated and any conflicts handled through the conflict handling mechanism. “In the past, there were problems in collaborative production, such as editing conflicts, version merging, and so on. Now, through version management abilities, multi-user collaborative production can be realized, ensuring data efficiency and follow-up work without errors. Version management is not just a capability in nautical chart production, but also the capability provided by the underlying SuperMap platform. The production of surveying and mapping data and the remote sensing data can all be powered using this capability,” said Chen Yong. SuperMap iMaritimeEditor supports the import of S57 chart data and the updating of files, and the imported chart data is displayed according to the S52 display standard. At the same time, electronic nautical charts can be integrated with additional GIS data to realize the overlayed display of maps such as vector maps and image maps. “We have also been paying attention to integrating sea and land. Our current sea chart can be displayed in an integrated manner with the traditional electronic map. In this way, the goals both at sea and on land can be presented together. The offshore area has a close relationship with inland, thus integrated management is possible,” continued Chen Yong. Digital twin technology boosts the digital transformation of enterprises SuperMap has also enhanced its digital twin technical capabilities. In 2020, SuperMap launched SuperMap Hi-Fi 3D SDKs, a high-fidelity 3D GIS development package deeply integrated with game engines. With digital twins being applied in more and more projects such as city construction, park management and water conservation, the requirements for full-element expression, visualized rendering and spatial analysis calculations, for example, are increasing. This year, SuperMap GIS 2023 further upgraded the high-fidelity 3D GIS development package. Its visualization effect has been improved to support more 3D GIS analysis and query functions. SuperMap iExplorer3D, an easier-to-use 3D scene browsing software, is also provided to support the rapid construction of high-fidelity 3D scenes. “A few years ago, we began to study the cross-border integration of SuperMap products and game engines and, over the years, we solved the problem of game engines accessing real geographic information data. We have also brought spatial analysis capabilities to game engines. Such a joint promotion of GIS and game engines embodies the enhancement of IT value. In this way, we can access massive spatial data in game engines and get good presentation effects as well,” said Chen Yong. Digital twins play an important role in the digital transformation of businesses today. To solve various problems encountered by enterprises due to a lack of experience in the digital transformation process and help enterprises achieve better digitalization, SuperMap has built digital twin construction capabilities in terms of data fusion and technology integration, to serve customers and businesses and ultimately realize business value. In terms of data fusion, SuperMap took the lead in drafting the spatial 3D data format (S3M) standard. As Wang Lei, vice president of SuperMap Software Group, reported at GISTC 2023: “From the perspective of technology integration, the platform is deeply connected and integrated with domestic servers, operating systems and databases to achieve cross-platform design. At the same time, through the integration of GIS and game engines, the platform not only achieves high-fidelity rendering effects, but also retains powerful spatial analysis capabilities and realizes 2D-3D integration and the integration of ‘display and computing’”.","filter_flag":1}
{"title":"Turning 30 in Style: NEOREST® Ushers in a New Era of Innovation - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvdHVybmluZy0zMC1pbi1zdHlsZS1uZW9yZXN0LXVzaGVycy1pbi1hLW5ldy1lcmEtb2YtaW5ub3ZhdGlvbi0zMDE4OTUyMDguaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvdHVybmluZy0zMC1pbi1zdHlsZS1uZW9yZXN0LXVzaGVycy1pbi1hLW5ldy1lcmEtb2YtaW5ub3ZhdGlvbi0zMDE4OTUyMDguaHRtbNIBAA?oc=5","id":"CBMidWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvdHVybmluZy0zMC1pbi1zdHlsZS1uZW9yZXN0LXVzaGVycy1pbi1hLW5ldy1lcmEtb2YtaW5ub3ZhdGlvbi0zMDE4OTUyMDguaHRtbNIBAA","guidislink":false,"published":"Tue, 08 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=220, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvdHVybmluZy0zMC1pbi1zdHlsZS1uZW9yZXN0LXVzaGVycy1pbi1hLW5ldy1lcmEtb2YtaW5ub3ZhdGlvbi0zMDE4OTUyMDguaHRtbNIBAA?oc=5\" target=\"_blank\">Turning 30 in Style: NEOREST® Ushers in a New Era of Innovation<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Turning 30 in Style: NEOREST® Ushers in a New Era of Innovation - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvdHVybmluZy0zMC1pbi1zdHlsZS1uZW9yZXN0LXVzaGVycy1pbi1hLW5ldy1lcmEtb2YtaW5ub3ZhdGlvbi0zMDE4OTUyMDguaHRtbNIBAA?oc=5\" target=\"_blank\">Turning 30 in Style: NEOREST® Ushers in a New Era of Innovation<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"\"The first NEOREST's R&D directive was simple: Design a toilet that is not a toilet,\" said TOTO USA CEO Hidemi Ishikawa. Post this \"When TOTO research and development engineers began work on the first-generation NEOREST, their instruction from TOTO's board of directors was quite simple: \"Design a toilet that is not a toilet,\" said Hidemi Ishikawa, CEO of TOTO USA. \"Today, thirty years later, TOTO has captured the imaginations of consumers the world over with our high-tech, high-luxe NEOREST smart bidet toilets that continue to defy the traditional concept of a toilet,\" Ishikawa continued. A Journey Beyond Imagination In 1988, when bathrooms were merely utilitarian spaces devoid of grace or grandeur, TOTO set out to transform them from simple spaces into luxurious havens with the creation of NEOREST. This groundbreaking toilet model combined cutting-edge technology and design. Over the past three decades, TOTO's visionary engineers have continuously redefined luxury and advanced technology with each new generation of NEOREST. TOTO engineers' original mission was clear: revolutionize the concept of toilets by transcending known limits in technology, design, and water conservation. TOTO's commitment to sustainability led the engineers to focus on dramatically reducing water consumption. They achieved this by visualizing the water flow inside the toilet, challenging the conventional notion of keeping the inner workings hidden. Transparent resin tubes were ingeniously incorporated to reveal the water flow and waste behavior, spurring progress in developing water-saving toilets across TOTO's portfolio. At this time, TOTO's engineers also innovated NEOREST's revolutionary electronic sequential valve system, eliminating the need for a tank above the bowl as seen on traditional residential toilets. This technological advance utilized computer-controlled valves to create three distinct stages of water flow for flushing, combined with another groundbreaking innovation, NEOREST's rimless bowl design. The result was a powerful 8-liter (2.1 gallons) per flush tankless toilet, saving an impressive 40% of water compared to conventional toilets of its time. TOTO's relentless pursuit of excellence has completely redefined the humble toilet into a global symbol of luxury, sustainability, cleanliness, and comfort. When TOTO engineers began their journey beyond imagination, their mandate was to innovate new technologies and improve on the very best of all TOTO technology to design one never-before-seen toilet model that would be called NEOREST (a neologism embodying the new restroom they were creating). Today more than 30 years later, TOTO's visionary research and development engineers have been sculpting dreams into reality, redefining luxury and advanced technology with each new NEOREST generation. The journey that began with the first-generation NEOREST continues to shape the future of toilets, as TOTO remains committed to pushing the boundaries of technology, design, and sustainability. Pure Luxury: New NEOREST Smart Bidet Toilets TOTO's newest NEOREST Smart Bidet Toilets offer visionary technology exquisitely designed for consumers' comfort and well-being. TOTO's NEOREST line is born of science and the company's belief in the importance of everyday wellness to rejuvenate consumers' bodies and minds. With its new NEOREST LS, NEOREST AS, and NEOREST RS Smart Bidet Toilets and enhanced NEOREST NX, TOTO brings a new form of pure luxury to life. New NEOREST LS Smart Bidet Toilet Experience elegance, cleanliness, and comfort with the NEOREST LS, TOTO's latest addition to its high-luxe, high-design smart bidet toilet line. Honored with design accolades like the Red Dot Design Awards and iF Design Awards, the NEOREST LS combines modern and classic elements, making it ideal for traditional, transitional, and contemporary bathrooms. Its wave-inspired design, enhanced with decorative metallic trim and matching stick-style remote available in silver, nickel, and black, adds sophistication and glamour. The NEOREST LS's stick-style remote control boasts a simple, luxurious design, matching flawlessly with metallic accents on its body. Its full-skirted design reinforces TOTO's commitment to luxury and quality and ensures easy maintenance. With the variety of trim options, consumers and designers can coordinate the NEOREST LS with other bathroom elements like faucets, showers, and paper holders, creating an elegant, harmonious bathroom interior. Make your bathroom the perfect in-home spa retreat with the NEOREST LS. New NEOREST AS Smart Bidet Toilet Experience elegance and sophistication in your bathroom with the new NEOREST AS smart bidet toilet, proudly awarded the prestigious iF Design Award. Its timeless charm and clean, classic lines create a dignified presence, while the full-cover lid and precise design elements add to its appeal. The NEOREST AS effortlessly complements various bathroom styles, enhancing their aesthetics with its sleek and modern look. With a chic stick-style remote control, it exudes luxury and sophistication. TOTO's eco-friendly NEOREST AS prioritizes personal cleanliness and user-friendliness, catering to heightened hygiene awareness post-COVID-19. The NEOREST AS smart bidet toilet's smooth shape and seamless surfaces ensure hygiene and balance in your bathroom. Discover the epitome of luxury and functionality with the NEOREST AS, where sophistication meets practicality in perfect harmony. New NEOREST RS Smart Bidet Toilet Experience the award-winning NEOREST RS Smart Bidet Toilet, honored with the Red Dot Design Award for its elegant simplicity and graceful curves. Its clean-line aesthetics and soft contours create a refined yet familiar look that complements any bathroom decor. The NEOREST RS comes with a sleek, white, ergonomic block-style remote control featuring an illuminated touchpad for personalized control and convenience. Enhance your personal hygiene with added functions, ensuring a clean and touch-free experience. Its automatic lid opens and closes smoothly, while its automatic flush function guarantees a reliably clean bowl. The lid's smooth, rounded curvature and closed shape provide a comfortable, hygienic space in your bathroom. Upgrade to the NEOREST RS for a sophisticated and convenient bathroom experience. Enhanced NEOREST NX2 Smart Bidet Toilet As TOTO marches confidently forward into its second century, the NEOREST NX2 Smart Bidet Toilet takes the spotlight as the flagship model of its world-renowned NEOREST series. This masterwork of elegance, comfort, and environmental consciousness seamlessly integrates TOTO's WASHLET personal cleansing technology with the porcelain toilet. The NEOREST NX2 boasts high-tech sensor operation for auto open\/close and flush, warm water cleansing, warm air dryer, heated seat, in-bowl catalytic deodorizer, and energy- and water-saving features, prioritizing user convenience. Inspired by nature's timeless elegance, the NEOREST NX2's elliptical silhouette, resembling water-sculpted pebbles, creates a captivating centerpiece for your bath. Its ACTILIGHT® bowl cleansing technology ensures a pristine and eco-friendly experience. With plain water PREMIST®, EWATER+® technology, titanium dioxide and zirconium bowl glaze, and integrated UV light, the NEOREST NX2 effortlessly cleans and freshens itself, breaking down organic substances at a cellular level. Elevate your bathroom experience with the high-luxe, high-tech, sustainable, NEOREST NX2. New NEOREST Advanced Cleaning Technology: EWATER+ for the Bidet Seat's Underside Among their numerous advanced technologies, the NEOREST LS, NEOREST AS, and NEOREST NX provide EWATER+ for the bidet seat's underside. After use, EWATER+ (electrolyzed water) automatically sprays throughout the entire bowl. The large droplets cover the bowl's surface. At the same time, an internal fan propels the smaller droplets to reach the bidet seat's front underside, ensuring comprehensive coverage, preventing waste accumulation and stubborn yellow stains, and reducing the need for harsh cleaning chemicals, which benefits the environment. CLEAN SYNERGY With the need for cleanliness and hygiene at the forefront of consumers' minds, TOTO's new NEOREST Smart Bidet Toilets offer advanced cleaning technologies that work synergistically to keep the toilet bowl fresh and clean at all times: PREMIST : The bowl's interior is sprayed with a fine water mist to reduce waste's ability to stick to its surface, which results in a better clean with every flush. : The bowl's interior is sprayed with a fine water mist to reduce waste's ability to stick to its surface, which results in a better clean with every flush. CEFIONTECT ® : TOTO's super-smooth, nano-technology glaze seals the porcelain with an ionized barrier, creating a super-slippery, non-porous surface that leaves waste nowhere to cling. : TOTO's super-smooth, nano-technology glaze seals the porcelain with an ionized barrier, creating a super-slippery, non-porous surface that leaves waste nowhere to cling. TORNADO FLUSH ® SYSTEM : The rimless bowl design and 2.5-diameter trapway use 100% of the water to remove waste effectively and clean every inch of the bowl and rim. TOTO's TORNADO FLUSH system optimizes water conservation (1.28 or 1.0 gallons per flush) while setting a high bar in quiet world-class flushing performance. : The rimless bowl design and 2.5-diameter trapway use 100% of the water to remove waste effectively and clean every inch of the bowl and rim. TOTO's TORNADO FLUSH system optimizes water conservation (1.28 or 1.0 gallons per flush) while setting a high bar in world-class flushing performance. EWATER+: The cleanliness of the bowl's surface, the interior and exterior of the NEOREST bidet wand, and the NEOREST NX, LS, and AS bidet seats' front underside are ensured by automatically misting them with electrolyzed water, a well-known cleaning agent, which reduces the need for harsh cleaning chemicals, which benefits the planet. Electrolyzed water is produced by electrolysis of the chloride ions in ordinary tap water. It is completely free of added chemicals and harsh cleaning agents. Over time, EWATER+ returns to its original state as regular tap water. About TOTO TOTO USA is headquarters for the Americas Division of the TOTO Global Group, which was established in 1917 with the founding of TOTO, Ltd., in Kitakyushu, Japan TOTO is the world's largest manufacturer of bathroom fixtures and fittings, with $5.87 billion in annual sales (April 2021 to March 2022). For more than 100 years, TOTO has been the recognized leader in innovation, technology, performance, and design with products that enhance the luxury bathroom experience. Today, the company maintains 36,853 employees in 18 countries and owns manufacturing facilities around the world in countries as diverse as Japan, Mexico, Germany, the USA, India, and China. Guided by its corporate philosophy , the TOTO Global Group strives to create a great company trusted by people worldwide, which contributes to the betterment of society. Dedicated to engineering products that respect the environment while meeting people's needs for comfort, beauty, and performance, TOTO is the sole plumbing manufacturer to maintain a research and development center devoted to universal design, advanced science, and technology. Consumers enjoy the peace of mind that comes from knowing they purchased a brand that innovates to improve people's quality of life. Winner of numerous domestic and international awards and recognitions, TOTO is the only plumbing manufacturer honored as Water Efficiency Leader by the U.S. Environmental Protection Agency. The company continues to raise industry standards and consumer expectations about what is possible in the bath space, as TOTO believes a high-quality bathroom is an experience and an everyday luxury people value and appreciate. For more information, consumers may visit www.totousa.com or call 1.888.295.8134, Option 5. Follow TOTO on Twitter ( @TOTOUSA ) and Instagram (@TOTOUSA) and become a TOTO fan on Facebook . SOURCE TOTO","filter_flag":1}
{"title":"Designing Sustainable Outdoor Living Spaces - Earth911.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vZWFydGg5MTEuY29tL2hvbWUtZ2FyZGVuL2Rlc2lnbmluZy1zdXN0YWluYWJsZS1vdXRkb29yLWxpdmluZy1zcGFjZXMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vZWFydGg5MTEuY29tL2hvbWUtZ2FyZGVuL2Rlc2lnbmluZy1zdXN0YWluYWJsZS1vdXRkb29yLWxpdmluZy1zcGFjZXMv0gEA?oc=5","id":"CBMiTWh0dHBzOi8vZWFydGg5MTEuY29tL2hvbWUtZ2FyZGVuL2Rlc2lnbmluZy1zdXN0YWluYWJsZS1vdXRkb29yLWxpdmluZy1zcGFjZXMv0gEA","guidislink":false,"published":"Thu, 24 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=24, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=236, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vZWFydGg5MTEuY29tL2hvbWUtZ2FyZGVuL2Rlc2lnbmluZy1zdXN0YWluYWJsZS1vdXRkb29yLWxpdmluZy1zcGFjZXMv0gEA?oc=5\" target=\"_blank\">Designing Sustainable Outdoor Living Spaces<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Earth911.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Designing Sustainable Outdoor Living Spaces - Earth911.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vZWFydGg5MTEuY29tL2hvbWUtZ2FyZGVuL2Rlc2lnbmluZy1zdXN0YWluYWJsZS1vdXRkb29yLWxpdmluZy1zcGFjZXMv0gEA?oc=5\" target=\"_blank\">Designing Sustainable Outdoor Living Spaces<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Earth911.com<\/font>","source.href":"https:\/\/earth911.com","source.title":"Earth911.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Our world was radically changed about three years ago at the start of the 2020 coronavirus pandemic. With people spending most of their time at home, working remotely, and being more cautious in general, the demand for outdoor living increased significantly. My career has revolved around enhancing outdoor living practices. During my time working with Trex, a composite decking company, we developed solutions for effective rain drainage on and under the deck, along with preserving the deck framing. In recent times, people have come to cherish their outdoor spaces, viewing them as essential extensions of their living areas. They also want to make design choices that are sustainable and environmentally responsible. Fortunately, there are now many convenient and budget-friendly options to create a stunning and environmentally responsible backyard. Outdoor Living According to the Outdoor Living Report from Brown Jordan Outdoor Kitchens, a vast majority of Americans said they were interested in updating their outdoor areas. Decks, yards, patios, and porches all ranked high among their preferred outdoor fun and entertainment places. Designing outdoor spaces in a way that respects our environment requires innovation and creativity. How do you construct a sustainable sanctuary outside and appreciate nature – and make it convenient to use? Sustainable Decks Building a sustainable deck is a good start. Choosing a recycled material, like aluminum or Trex composite decking, reduces the need for raw materials and energy in manufacturing. Trex composite, for example, is made from 95% recycled materials, including plastic and reclaimed wood. It retains its attractive appearance, is durable, and lasts a long time. Trex’s sustainable composite material is also designed to be low-maintenance. In 2021, Trex reduced Scope 1 and Scope 2 greenhouse gas emissions by 33% compared to 2020. Trex additionally prioritizes the communities where they operate, helping to collect plastic waste in hundreds of retail locations through one of the largest plastic recycling programs in the country. In 2021, through its NexTrex program, Trex rerouted over 1 million pounds of plastic from landfills. Although some homeowners may choose to use wood, I’m confident that composite decking pays off when you weigh all the ecological factors. If you choose to use wood, look for the FSC (Forest Stewardship Council) label. This certifies that the wood has been sourced responsibly with limited impact on natural resources. Check for locally sourced wood from forests near you, if possible, to reduce the emissions associated with shipping lumber thousands of miles. Certain wood types are preferable due to their sustainable sourcing and durability. Woods like ipê (Brazilian handroanthus) and bamboo are nature-friendly choices, as both last a long time. Bamboo is a renewable resource that grows quickly, which helps minimize its impact on the environment. Natural Water Features Installing water features, such as a solar-powered fountain or a self-sustaining pond, can provide a relaxing atmosphere without excessive electricity usage or adverse environmental impacts. The peaceful sounds of flowing water can be soothing after a long day, especially when they contribute positively to your backyard’s ecosystem. These options also lend themselves to healthier, moisturized air. Planting Ideas Speaking of the air we breathe, incorporating plants can enhance the surroundings of your yard and deck areas. Determine the USDA hardiness zone of your region to help you select plants that will do well where you live. Some plants will thrive in cooler or dryer weather, where others flourish in humidity and lots of sun. Native plants can help support local ecosystems and pollinators. The addition of natural elements like rocks and water features, in addition to being relaxing for you, may make your yard a haven for wildlife. Light It Up! Shining some light on your deck and yard at night shouldn’t be expensive, nor energy intensive. LED lights are easy on the environment, are durable, and last a long time. Soffit lights, which are installed in the area underneath the roof overhang, can create dramatic lighting, but are also perfect for softer hues. Do you need lights in dark places? No problem, these lights can be used like floodlights or to spotlight an unlit corner. If you’re looking for recessed lighting, soffit lights can be installed under the deck. They can even be installed in a pergola. Also, consider illuminating landscape features or a walkway using LED or solar lights. Utilizing lights in conjunction with plants to intensify the visual effect of your yard at night makes for a beautiful and stunning display. Backyard Conservation Sensible stewardship of your outdoor space isn’t just about picking the right materials, it’s also about intelligent design and effective conservation strategies. The story of Trex, and my own journey in manufacturing our products, illustrate how this can be achieved. To begin with, we have always been committed to integrating environmental conservation into our business. Our drive towards sustainability extends beyond the product to how we influence outdoor space management. One example of this is our approach to water conservation. If your yard tends to collect water, we recommend installing a robust drainage system. This protects your deck from water damage, prevents soil erosion, and reduces sediment build-up that could harm local waterways. Notably, it also lessens the chances of a mosquito infestation as well as water-related structural issues. Take a holistic view of outdoor space management and consider getting professional input. We encourage homeowners to consult design professionals who can assess your landscape and recommend solutions tailored to your unique situation. The solutions might include installing a French drain system, creating a rain garden, or other context-specific interventions. We are ardent advocates for using water wisely. Our approach emphasizes strategies that reduce water usage and promote sustainability. For instance, we encourage homeowners to collect rainwater to hydrate their plants, select drought-resistant plants, and even let their grass go dormant when necessary. From my personal experience in construction, I believe that responsible stewardship of our outdoor spaces should not be an afterthought but a guiding principle. As such, we aim to design products that not only respect the environment but also help homeowners reduce their environmental impact. Design for the Environment While there are many solutions we can make use of for building a healthy ecosystem in our yards and on our decks, it’s important that we consider all the things that we do, both good and bad. Though we don’t mean to, some activities we partake in can be detrimental to the earth. With a little effort there are ways to counter or reduce negative impacts, and to swing the effects in nature’s favor. When keeping sustainability in focus, there are several things you can do to ensure your backyard or deck is harmonious with the environment. Build with ecologically beneficial material. Certain woods are more environmentally friendly than others. Composite decking, like Trex, is also a prime example of an ecologically responsible material. Take advantage of nature’s bounties. Use the shade from your trees or the sun’s natural path to help plan your patio – or to plant your garden. Finally, consider refurbishing furniture or utilize sustainable décor for your deck. Remember, the key is to reduce your carbon footprint by recycling, repurposing, and reusing whenever possible. About the Author Dave Kile is the owner of IBP, LLC, the company behind some of the decking industry’s most successful innovations, including Trex® RainEscape® , Trex® Protect™, and Trex® Seal™. Over the past three decades, he has achieved incremental success by immersing himself in the industry, listening to customers and bringing new products to market that improve efficiency and effectiveness.","filter_flag":1}
{"title":"News - Retail India News: Kanine Collaborates with Myntra, Unveils Global Pet Fashion Brands in India - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3JldGFpbC1pbmRpYS1uZXdzLWthbmluZS1oYW5kLW15bnRyYS11bnZlaWxzLWdsb2JhbC1wZXQtZmFzaGlvbi1icmFuZHMtaW5kaWHSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3JldGFpbC1pbmRpYS1uZXdzLWthbmluZS1oYW5kLW15bnRyYS11bnZlaWxzLWdsb2JhbC1wZXQtZmFzaGlvbi1icmFuZHMtaW5kaWHSAQA?oc=5","id":"CBMicGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3JldGFpbC1pbmRpYS1uZXdzLWthbmluZS1oYW5kLW15bnRyYS11bnZlaWxzLWdsb2JhbC1wZXQtZmFzaGlvbi1icmFuZHMtaW5kaWHSAQA","guidislink":false,"published":"Thu, 24 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=24, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=236, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3JldGFpbC1pbmRpYS1uZXdzLWthbmluZS1oYW5kLW15bnRyYS11bnZlaWxzLWdsb2JhbC1wZXQtZmFzaGlvbi1icmFuZHMtaW5kaWHSAQA?oc=5\" target=\"_blank\">News - Retail India News: Kanine Collaborates with Myntra, Unveils Global Pet Fashion Brands in India<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"News - Retail India News: Kanine Collaborates with Myntra, Unveils Global Pet Fashion Brands in India - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3JldGFpbC1pbmRpYS1uZXdzLWthbmluZS1oYW5kLW15bnRyYS11bnZlaWxzLWdsb2JhbC1wZXQtZmFzaGlvbi1icmFuZHMtaW5kaWHSAQA?oc=5\" target=\"_blank\">News - Retail India News: Kanine Collaborates with Myntra, Unveils Global Pet Fashion Brands in India<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Retail India News: Juicy Chemistry and Mommy Shots by Amrita Unveil 'Scars are Beautiful' In honor of Women’s Day, Juicy Chemistry and Mommy Shots by Amrita join forces for the 'Scars are Beautiful' campaign, shedding light on the beauty of postpartum bodies and stretch marks. The campaign, launched on March 5th, 2024, features 11 mothers proudly displaying their bodies and sharing their motherhood experiences to inspire other women to embrace their bodies and change societal perceptions. Era Vashishta, mother of a 2.5-year-old shares her story “ I was diagnosed with chronic PCOD when I was 28, which got me very scared as to whether or not I would ever get pregnant or have a baby. I never thought of motherhood before this. Because of the PCOD it made me want to be a mom, because I thought maybe I might not happen. After which, I became a mom and everything changed. As soon as I met my baby that’s when I knew this is someone I want to protect for the rest of my life, the love is unconditional. It was so scary and overwhelming, but once you hang on to all these feelings you wouldn’t have it any other way, I’d never not want to be a mom. My scars are my tiger stripes, because I think I draw a lot of power from them. I’m a mom and this body gave birth to a life, which is what makes me bigger, it makes me a tiger.” Megha Asher, the Co-Founder and COO of Juicy Chemistry said, “At Juicy Chemistry, we believe in promoting self-love and body positivity, and we are thrilled to partner with Mommy Shots for this unique campaign. Through this powerful photo series, we hope to inspire and empower women to embrace their bodies, and scars not just physical but emotional ones as well, and celebrate their unique journeys of motherhood. As mothers ourselves, we understand the challenges that come with motherhood and the impact it can have on a woman's body and self-perception. We hope that this campaign will help shift the narrative and encourage women to see their bodies as beautiful and strong, no matter their shape or size. Together, we can create a more inclusive and diverse representation of beauty and promote self-love and acceptance for all women.\" Amrita Samant, Founder and CEO Mommyshots said, “In my world of photography, motherhood, babies and art, creating something meaningful that helps change the world obsessed with perfection was very close to my heart. We want to redefine beauty with every line and every scar that spells resilience strength and a unique journey, we want to go beyond the surface with this campaign. They’re more than blemishes, they’re badges of honor, they are tender and timeliness. I am super proud of the 11 women who came forward to normalize what the society has for far too long considered unsightly.” Sonia Chandrakumar, one of the 11 mothers who posed and actively participated in the shoot said, “The journey of motherhood is very different for me, I had a really tough time the first 6 months. I had all kinds of nausea, I could not brush my teeth and I had a lot of body changes that took place. My husband was my greatest support because he constantly reminded me that there’s something beautiful coming out of this and if you want something beautiful in life you need to cope with the changes that take place in your body or yourself. So I kept reminding myself and dealing with the challenges. I’d describe my marks as Caleb’s wonderful art palette that I have around my stomach. I would not want to get rid of my marks, I want to keep it as a memory.” Motherhood scars, resembling intricate battle scars, symbolize the strength and resilience embedded in a woman's journey. Each mark narrates a story of endurance and courage, celebrating the remarkable strength of women. In honoring these scars, we acknowledge the transformative power of motherhood, inspiring women to embrace their bodies and celebrate their unique journeys. #scarsarebeautiful ","filter_flag":1}
{"title":"Retail India News: Chumbak Launches Vibrant Smartwatch on Amazon India - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3JldGFpbC1pbmRpYS1uZXdzLWNodW1iYWstbGF1bmNoZXMtdmlicmFudC1zbWFydHdhdGNoLWFtYXpvbi1pbmRpYdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3JldGFpbC1pbmRpYS1uZXdzLWNodW1iYWstbGF1bmNoZXMtdmlicmFudC1zbWFydHdhdGNoLWFtYXpvbi1pbmRpYdIBAA?oc=5","id":"CBMiZmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3JldGFpbC1pbmRpYS1uZXdzLWNodW1iYWstbGF1bmNoZXMtdmlicmFudC1zbWFydHdhdGNoLWFtYXpvbi1pbmRpYdIBAA","guidislink":false,"published":"Mon, 07 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=219, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3JldGFpbC1pbmRpYS1uZXdzLWNodW1iYWstbGF1bmNoZXMtdmlicmFudC1zbWFydHdhdGNoLWFtYXpvbi1pbmRpYdIBAA?oc=5\" target=\"_blank\">Retail India News: Chumbak Launches Vibrant Smartwatch on Amazon India<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Retail India News: Chumbak Launches Vibrant Smartwatch on Amazon India - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3JldGFpbC1pbmRpYS1uZXdzLWNodW1iYWstbGF1bmNoZXMtdmlicmFudC1zbWFydHdhdGNoLWFtYXpvbi1pbmRpYdIBAA?oc=5\" target=\"_blank\">Retail India News: Chumbak Launches Vibrant Smartwatch on Amazon India<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Retail India News: Juicy Chemistry and Mommy Shots by Amrita Unveil 'Scars are Beautiful' In honor of Women’s Day, Juicy Chemistry and Mommy Shots by Amrita join forces for the 'Scars are Beautiful' campaign, shedding light on the beauty of postpartum bodies and stretch marks. The campaign, launched on March 5th, 2024, features 11 mothers proudly displaying their bodies and sharing their motherhood experiences to inspire other women to embrace their bodies and change societal perceptions. Era Vashishta, mother of a 2.5-year-old shares her story “ I was diagnosed with chronic PCOD when I was 28, which got me very scared as to whether or not I would ever get pregnant or have a baby. I never thought of motherhood before this. Because of the PCOD it made me want to be a mom, because I thought maybe I might not happen. After which, I became a mom and everything changed. As soon as I met my baby that’s when I knew this is someone I want to protect for the rest of my life, the love is unconditional. It was so scary and overwhelming, but once you hang on to all these feelings you wouldn’t have it any other way, I’d never not want to be a mom. My scars are my tiger stripes, because I think I draw a lot of power from them. I’m a mom and this body gave birth to a life, which is what makes me bigger, it makes me a tiger.” Megha Asher, the Co-Founder and COO of Juicy Chemistry said, “At Juicy Chemistry, we believe in promoting self-love and body positivity, and we are thrilled to partner with Mommy Shots for this unique campaign. Through this powerful photo series, we hope to inspire and empower women to embrace their bodies, and scars not just physical but emotional ones as well, and celebrate their unique journeys of motherhood. As mothers ourselves, we understand the challenges that come with motherhood and the impact it can have on a woman's body and self-perception. We hope that this campaign will help shift the narrative and encourage women to see their bodies as beautiful and strong, no matter their shape or size. Together, we can create a more inclusive and diverse representation of beauty and promote self-love and acceptance for all women.\" Amrita Samant, Founder and CEO Mommyshots said, “In my world of photography, motherhood, babies and art, creating something meaningful that helps change the world obsessed with perfection was very close to my heart. We want to redefine beauty with every line and every scar that spells resilience strength and a unique journey, we want to go beyond the surface with this campaign. They’re more than blemishes, they’re badges of honor, they are tender and timeliness. I am super proud of the 11 women who came forward to normalize what the society has for far too long considered unsightly.” Sonia Chandrakumar, one of the 11 mothers who posed and actively participated in the shoot said, “The journey of motherhood is very different for me, I had a really tough time the first 6 months. I had all kinds of nausea, I could not brush my teeth and I had a lot of body changes that took place. My husband was my greatest support because he constantly reminded me that there’s something beautiful coming out of this and if you want something beautiful in life you need to cope with the changes that take place in your body or yourself. So I kept reminding myself and dealing with the challenges. I’d describe my marks as Caleb’s wonderful art palette that I have around my stomach. I would not want to get rid of my marks, I want to keep it as a memory.” Motherhood scars, resembling intricate battle scars, symbolize the strength and resilience embedded in a woman's journey. Each mark narrates a story of endurance and courage, celebrating the remarkable strength of women. In honoring these scars, we acknowledge the transformative power of motherhood, inspiring women to embrace their bodies and celebrate their unique journeys. #scarsarebeautiful ","filter_flag":1}
