{"title":"Here's How Jeremy Jones Takes Climate Action Every Single Day - Outside","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3Lm91dHNpZGVvbmxpbmUuY29tL291dGRvb3ItYWR2ZW50dXJlL2Vudmlyb25tZW50L2hlcmVzLWhvdy1qZXJlbXktam9uZXMtdGFrZXMtY2xpbWF0ZS1hY3Rpb24tZXZlcnktc2luZ2xlLWRheS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3Lm91dHNpZGVvbmxpbmUuY29tL291dGRvb3ItYWR2ZW50dXJlL2Vudmlyb25tZW50L2hlcmVzLWhvdy1qZXJlbXktam9uZXMtdGFrZXMtY2xpbWF0ZS1hY3Rpb24tZXZlcnktc2luZ2xlLWRheS_SAQA?oc=5","id":"CBMieWh0dHBzOi8vd3d3Lm91dHNpZGVvbmxpbmUuY29tL291dGRvb3ItYWR2ZW50dXJlL2Vudmlyb25tZW50L2hlcmVzLWhvdy1qZXJlbXktam9uZXMtdGFrZXMtY2xpbWF0ZS1hY3Rpb24tZXZlcnktc2luZ2xlLWRheS_SAQA","guidislink":false,"published":"Wed, 12 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=102, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3Lm91dHNpZGVvbmxpbmUuY29tL291dGRvb3ItYWR2ZW50dXJlL2Vudmlyb25tZW50L2hlcmVzLWhvdy1qZXJlbXktam9uZXMtdGFrZXMtY2xpbWF0ZS1hY3Rpb24tZXZlcnktc2luZ2xlLWRheS_SAQA?oc=5\" target=\"_blank\">Here's How Jeremy Jones Takes Climate Action Every Single Day<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Outside<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Here's How Jeremy Jones Takes Climate Action Every Single Day - Outside","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3Lm91dHNpZGVvbmxpbmUuY29tL291dGRvb3ItYWR2ZW50dXJlL2Vudmlyb25tZW50L2hlcmVzLWhvdy1qZXJlbXktam9uZXMtdGFrZXMtY2xpbWF0ZS1hY3Rpb24tZXZlcnktc2luZ2xlLWRheS_SAQA?oc=5\" target=\"_blank\">Here's How Jeremy Jones Takes Climate Action Every Single Day<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Outside<\/font>","source.href":"https:\/\/www.outsideonline.com","source.title":"Outside","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Pro snowboarder Jeremy Jones thinks about climate change 100 times a day—that’s no exaggeration. As founder of Protect Our Winters, a nonprofit that focuses on legislative climate action, and Jones Snowboards, maker of boards, gear, and apparel, it’s his job. Jones also happens to be my cousin, and we’ve talked about environmentalism and sustainability our entire adult lives. But how does he translate those thoughts into actual, tangible, everyday deeds? I recently spoke to Jones about how he takes action for climate 365 days a year. Constant Communication Everyday actions and practices matter, but conversations, especially with people who might be in a different political camp as you, are key. A lot of people feel like they don’t belong to the climate movement because they recognize they contribute to the problem–maybe they fly a lot, raise cattle, or just love burgers, work for an oil or plastics company, or still buy bottled water by the case. This feeling of being on the outside is a huge problem. I don’t care what you do, we need you to join the climate movement. We need people from all sectors, political parties, regions, and backgrounds working together on this one unifying thing: the planet we all live on. Because climate change impacts all of us. When I talk to people about climate change, I try to find common ground. Your political leanings don’t matter: if you love skiing, snowboarding, snowmobiling, hunting, or fishing, this affects you. If you love to go mountain biking, RVing, waterskiing, or camping with your kids, it affects you, too. Everyone needs to be welcome in this movement. Whether you drive a monster truck or a Tesla, we want you to be part of the conversation and the solution. “Make your voice heard,” says Jones, who regularly lobbies in Washington, reaches out to lawmakers, and participates in climate rallies. (Photo: Ming Poon) A Greener Business We launched Jones Snowboards in 2010, and from the start we identified a three point North star: performance, durability, and sustainability. Being part of 1% For The Planet is key because we need more people that wake up every day working on climate action and our donation helps with that. Three years ago we took a big step by moving away from toxic traditional epoxy resins (to hold the board components together). We finally found a bio-based resin (made from tree sap) that works every bit as good as the old stuff. It took a lot of trial and error. Next winter we’ll take another big step, with a project that’s been six years in the making: turning old snowboards into new products, and keeping them out of the landfill. We developed a machine that pops the metal edges and inserts off old boards (for recycling). Then we stack boards on top of each other, press them together, and cut them into strips to create these really strong structural pieces we’ll use (instead of carbon fiber) to support power spots in new boards. Plant-Based Diet I hate dietary titles, but I’ve been embracing a vegan diet for over 10 years. I used to love a good burger, but I’ve lost the taste for it and this is the best lifestyle lever I can pull for the climate. The cattle industry accounts for 14.5 percent of all human-caused greenhouse gas emissions [according to the UN]. As a country, we eat way too much red meat. My plant-based diet has also made me a better athlete. I feel better at 48 than I did at 28. Years ago, I thought my snowboard career was waning, but when I switched to a plant-based diet, I felt way more spry and way less achy. I noticed less inflammation in my muscles and joints. Voting With Dollars Change takes longer than you think it will, but once it starts, it happens faster than you thought it could. Here’s an example, going back to the food idea: I was coming back from a snowboarding trip recently. It was late and we were driving through Bakersfield, California, (north of L.A) and we were starving. We found a random burger shack that was open and as we pulled in, I thought, ‘what am I gonna eat here.’ Turns out that place had awesome plant-based burgers and shakes. Even Burger King and MacDonald’s have plant-based options on the menus now. You would never have seen that a few years back. But people demanded it, and are voting for plant-based food with their dollars. And it’s changing. The same applies to the outdoor industry. Consumers are rewarding companies for making cleaner products and using their power to get us on a better path. Reducing Emissions We only have so much CO2 to burn and I think about my carbon emissions every day. I switched to an EV a couple years ago. I carpool to the mountain and the trailhead and ride my bike around town rather than drive. I recycle and avoid plastic. I’ve updated my house with solar panels, a heat pump, better insulation, more efficient appliances, all of which gave me huge energy savings. And I only get on a plane when I really have to. I take fewer, longer, slower trips now. The majority of my adventuring takes place here in the Sierra, my back yard, and I’ve cut my air travel by about 90 percent over the last 15 years.. It stung a bit at first losing my frequent flier benefits, but I’m over it and now I’m happy sitting in the back of the plane and traveling less. Pro tip for others who have recently lost airline status: Board last and ask if they can bump you up to a better seat or an empty row (poor man’s first class). Doing right by the planet can make you happier, healthier, and—yes—wealthier. Outside’s Head of Sustainability, Kristin Hostetter, explores small lifestyle tweaks that can make a big impact. Write to her at climateneutral-ish@outsideinc.com.","filter_flag":1}
{"title":"New Whitepaper Reveals Trillion-Dollar Opportunity for Corporate Climate Action in Asia - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmJjZy5jb20vcHJlc3MvMjFhcHJpbDIwMjMtbmV3LXdoaXRlcGFwZXItcmV2ZWFscy10cmlsbGlvbi1kb2xsYXItb3Bwb3J0dW5pdHktZm9yLWNvcnBvcmF0ZS1jbGltYXRlLWFjdGlvbi1pbi1hc2lh0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmJjZy5jb20vcHJlc3MvMjFhcHJpbDIwMjMtbmV3LXdoaXRlcGFwZXItcmV2ZWFscy10cmlsbGlvbi1kb2xsYXItb3Bwb3J0dW5pdHktZm9yLWNvcnBvcmF0ZS1jbGltYXRlLWFjdGlvbi1pbi1hc2lh0gEA?oc=5","id":"CBMifWh0dHBzOi8vd3d3LmJjZy5jb20vcHJlc3MvMjFhcHJpbDIwMjMtbmV3LXdoaXRlcGFwZXItcmV2ZWFscy10cmlsbGlvbi1kb2xsYXItb3Bwb3J0dW5pdHktZm9yLWNvcnBvcmF0ZS1jbGltYXRlLWFjdGlvbi1pbi1hc2lh0gEA","guidislink":false,"published":"Fri, 21 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=111, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmJjZy5jb20vcHJlc3MvMjFhcHJpbDIwMjMtbmV3LXdoaXRlcGFwZXItcmV2ZWFscy10cmlsbGlvbi1kb2xsYXItb3Bwb3J0dW5pdHktZm9yLWNvcnBvcmF0ZS1jbGltYXRlLWFjdGlvbi1pbi1hc2lh0gEA?oc=5\" target=\"_blank\">New Whitepaper Reveals Trillion-Dollar Opportunity for Corporate Climate Action in Asia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New Whitepaper Reveals Trillion-Dollar Opportunity for Corporate Climate Action in Asia - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmJjZy5jb20vcHJlc3MvMjFhcHJpbDIwMjMtbmV3LXdoaXRlcGFwZXItcmV2ZWFscy10cmlsbGlvbi1kb2xsYXItb3Bwb3J0dW5pdHktZm9yLWNvcnBvcmF0ZS1jbGltYXRlLWFjdGlvbi1pbi1hc2lh0gEA?oc=5\" target=\"_blank\">New Whitepaper Reveals Trillion-Dollar Opportunity for Corporate Climate Action in Asia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Climate change could have a disproportionate impact on Asian economies and people Despite challenges, Asia could see big revenue and job benefits from targeted climate action New World Economic Forum report, in collaboration with BCG and SAP, explores risks, challenges, and opportunities for climate action in Asia, and outlines a best practice for corporate climate action Singapore—A new whitepaper published today by the World Economic Forum in collaboration with Boston Consulting Group’s (BCG) Southeast Asia Centre for Climate & Sustainability, and SAP, a market leader in enterprise software, reveals the revenue and job opportunities available for Asian organisations investing in corporate climate action. The report, titled Accelerating Asia’s Advantage: A Guide to Corporate Climate Action, notes that a revenue opportunity of USD$4.3 trillion is available for Asian businesses by 2030 from activities like the expansion of renewable power, energy efficiency in buildings, and greater circularity in producing industries, making up a 43% share of the global total. Similarly, 58% of the jobs required to service those opportunities will be situated in Asia, creating as many as 232 million roles for the region. “Asia is key on the journey towards net zero,” said Gim Huay Neo, Managing Director, Centre for Nature and Climate, World Economic Forum. “Asia accounts for 51% of annual global greenhouse gas emissions. More than half of annual emissions are from industries like electricity, manufacturing, and land use. Business has a strong role in cutting emissions and climate action. To scale, accelerate, and sustain efforts, business needs to collaborate with government and communities, harness innovation, and build partnerships across their value chains.” The whitepaper makes clear the impact of inaction on Asia. Beyond the widespread environmental and individual impact, the report notes extreme climate change is expected to drastically affect Asian economies. Based on a severe increase of 3.2°C by 2050, Asia is projected to see a reduction in GDP by over 26%. Southeast Asia is predicted to experience a GDP reduction of 37%—by far the worst around the globe. “The business case for climate action is clear,” said Paul Marriott, APJ President at SAP. “We know that 50% of Asian businesses believe addressing environmental issues will be material to business results within the next five years. Organizations who ignore or hedge their climate strategies gamble their ethics, revenues, and competitive advantage.” “Unmitigated climate change is the biggest threat of our generation. The world economy could lose more than 18% of current GDP if no action on climate change is taken. And the impact would be significantly higher in Asia, at almost 26%,” said Neeraj Aggarwal, Chair, BCG Asia-Pacific. “At the same time, Asia is at a pivotal juncture in its history, where beyond its vulnerability, it also represents the biggest economic opportunity for global climate action. The time is right for Asian leaders to make bold strides for the good of their businesses, and the world.” The preliminary findings of Accelerating Asia’s Advantage: A Guide to Corporate Climate Action were discussed during a session at the World Economic Forum’s Annual Meeting 2023 in Davos-Klosters earlier this year. “The Net-Zero challenge requires urgent public-private co-operation on a global scale. The Forum engages and builds multi-stakeholder platforms to scale and accelerate the climate and nature agenda,” said Gim Huay Neo. “Only through fostering trust and collaboration can we safeguard our global commons and secure a net zero, nature positive and better living future for all of us and generations to come.” More information and the full Accelerating Asia’s Advantage: Your Guide to Corporate Climate Action report is available here. Media Contact Eugenia Siah +65 8907 4721 About World Economic Forum The World Economic Forum, committed to improving the state of the world, is the International Organization for Public-Private Cooperation. The Forum engages the foremost political, business and other leaders of society to shape global, regional and industry agendas. (www.weforum.org). About SAP SAP’s strategy is to help every business run as an intelligent, sustainable enterprise. As a market leader in enterprise application software, we help companies of all sizes and in all industries run at their best: SAP customers generate 87% of total global commerce. Our machine learning, Internet of Things (IoT), and advanced analytics technologies help turn customers’ businesses into intelligent enterprises. SAP helps give people and organizations deep business insight and fosters collaboration that helps them stay ahead of their competition. We simplify technology for companies so they can consume our software the way they want – without disruption. Our end-to-end suite of applications and services enables business and public customers across 25 industries globally to operate profitably, adapt continuously, and make a difference. With a global network of customers, partners, employees, and thought leaders, SAP helps the world run better and improve people’s lives. For more information, visit www.sap.com. About BCG’s Southeast Asia Center for Climate & Sustainability BCG’s Southeast Asia Center for Climate & Sustainability brings together the best of BCG's global expertise and offering to the region, leveraging Singapore as the hub to drive climate action and leading change for the future. Adopting a multifaceted approach, the Southeast Asia Center for Climate & Sustainability covers four key, distinct strategic areas: powering green ventures and investments, building cutting-edge capabilities, enriching partnerships to maximize impact, and enhancing skillsets for tomorrow.","filter_flag":1}
{"title":"Spin Master Issues 2022 Corporate Social Responsibility Report and Releases Climate Action Plan - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMilgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NwaW4tbWFzZXItaXNzdWVzLTIwMjItY29ycG9yYXRlLXNvY2lhbC1yZXNwb25zaWJpbGl0eS1yZXBvcnQtYW5kLXJlbGVhc2VzLWNsaW1hdGUtYWN0aW9uLXBsYW4tMzAxNzkxNTk4Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMilgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NwaW4tbWFzZXItaXNzdWVzLTIwMjItY29ycG9yYXRlLXNvY2lhbC1yZXNwb25zaWJpbGl0eS1yZXBvcnQtYW5kLXJlbGVhc2VzLWNsaW1hdGUtYWN0aW9uLXBsYW4tMzAxNzkxNTk4Lmh0bWzSAQA?oc=5","id":"CBMilgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NwaW4tbWFzZXItaXNzdWVzLTIwMjItY29ycG9yYXRlLXNvY2lhbC1yZXNwb25zaWJpbGl0eS1yZXBvcnQtYW5kLXJlbGVhc2VzLWNsaW1hdGUtYWN0aW9uLXBsYW4tMzAxNzkxNTk4Lmh0bWzSAQA","guidislink":false,"published":"Thu, 06 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=96, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NwaW4tbWFzZXItaXNzdWVzLTIwMjItY29ycG9yYXRlLXNvY2lhbC1yZXNwb25zaWJpbGl0eS1yZXBvcnQtYW5kLXJlbGVhc2VzLWNsaW1hdGUtYWN0aW9uLXBsYW4tMzAxNzkxNTk4Lmh0bWzSAQA?oc=5\" target=\"_blank\">Spin Master Issues 2022 Corporate Social Responsibility Report and Releases Climate Action Plan<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Spin Master Issues 2022 Corporate Social Responsibility Report and Releases Climate Action Plan - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NwaW4tbWFzZXItaXNzdWVzLTIwMjItY29ycG9yYXRlLXNvY2lhbC1yZXNwb25zaWJpbGl0eS1yZXBvcnQtYW5kLXJlbGVhc2VzLWNsaW1hdGUtYWN0aW9uLXBsYW4tMzAxNzkxNTk4Lmh0bWzSAQA?oc=5\" target=\"_blank\">Spin Master Issues 2022 Corporate Social Responsibility Report and Releases Climate Action Plan<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Company Introduces Evolved CSR Vision, Establishes New Environmental Targets and Increases Philanthropic Impact TORONTO, April 6, 2023 \/PRNewswire\/ - Spin Master Corp. (\"Spin Master\" or the \"Company\") (TSX: TOY) (www.spinmaster.com), a leading global children's entertainment company, today issued its fourth annual Corporate Social Responsibility report (2022 CSR Report), articulating the Company's evolved CSR Vision; environmental, social and governance performance in 2022; and new targets to reduce its environmental footprint. Spin Master’s 2022 CSR Report details the performance of the Company and new targets within four key areas: environment, products, people, and communities. (CNW Group\/Spin Master) Spin Maser Issues 2022 Corporate Social Responsibility Report and Releases Climate Action Plan (CNW Group\/Spin Master) \"We're proud of the progress we've made to date within CSR, particularly as it relates to setting targets and advancing towards increased transparency and enhanced governance,\" said Max Rangel, Spin Master's Global President and CEO. \"This year we refined our CSR vision to: Reimagining Play for Future Generations, reflecting our commitment to our purpose of creating magical play experiences for children and families, our responsibility to uphold an inclusive culture, empower children to grow and learn through play while also acting as custodians of the world these children will one day inherit.\" Spin Master's 2022 CSR Report details the performance of the Company and new targets within four key areas: environment, products, people, and communities, including the following: Environment Reduced Scope 1 + 2 emissions by 60% (from 2019) Decreased waste in leased and owned facilities by 63% (from 2020) and increased waste diversion to 42% Developed first-ever Climate Action Plan, mapping pathways to further reduce carbon emissions Set Scope 1 + 2 emission reduction targets of 70% by 2030 with the goal to achieve net-zero by 2050 Articulated new waste reduction targets of 85% in owned and leased facilities by 2025 and goal of zero waste by 2035 Externally verified carbon emissions data by a third-party for the first time Products Zero recalls in 16 years Audited 99% of manufacturing facilities Launched seven sustainably-minded products Advanced towards target of using vegetable or soy-based inks in 50% of packaging, reaching 23.7% in 2022 People Achieved 98% gender pay equity Improved employee engagement scores across the Company Awarded eight new Future of Play Scholarships to youth from equity-seeking communities studying in the fields of toy design, animation\/creative production and digital game design \"Spin Master remains dedicated to creating an inclusive workplace where everyone feels supported, valued and respected,\" said Tara Deakin, Spin Master's EVP and Chief People Officer. \"This past year, we strengthened our culture of innovation and inclusivity through investments in leadership training, enhanced benefits, a new employee share-ownership program and events that celebrate the diversity that makes our workforce so special.\" Communities Increased philanthropic financial giving with $3.01 million in financial donations* and 450,000 toys, impacting 610,000 children globally in financial donations* and 450,000 toys, impacting 610,000 children globally Reported employee volunteer hours for the first time and recorded over 5,000 hours Executed three Toy Movements providing nearly 200,000 toys to children in Somalia , Tanzania and five countries bordering Ukraine and delivered 1,000 play kits to Child Friendly Spaces in seven countries globally *Financial donations include monetary contributions to registered charities, costs of goods of donated products and direct operational costs associated with donations. The 2022 CSR Report includes Sustainability Accounting Standards (SASB) indicators for Toys & Sporting Goods, qualitative Taskforce for Climate Related Financial Disclosures (TCFD) and reporting towards the United Nations Sustainable Development Goals. Material indicators related to the Global Reporting Initiative (GRI) were updated to GRI Universal Standards 2021. To learn more about Spin Master's CSR efforts please visit https:\/\/www.spinmaster.com\/en-US\/corporate\/corporate-social-responsibility. About Spin Master Spin Master Corp. (TSX:TOY) is a leading global children's entertainment company, creating exceptional play experiences through its three creative centres: Toys, Entertainment and Digital Games. With distribution in over 100 countries, Spin Master is best known for award-winning brands PAW Patrol®, Bakugan®, Kinetic Sand®, Air Hogs®, Hatchimals®, Rubik's Cube® and GUND®, and is the global toy licensee for other popular properties. Spin Master Entertainment creates and produces compelling multiplatform content, through its in-house studio and partnerships with outside creators, including the preschool franchise PAW Patrol and numerous other original shows, short-form series and feature films. The Company has an established presence in digital games, anchored by the Toca Boca® and Sago Mini® brands, offering open-ended and creative game and educational play in digital environments. Through Spin Master Ventures, the Company makes minority investments globally in emerging companies and start-ups. With over 26 offices in close to 20 countries, Spin Master employs more than 2,000 team members globally. For more information visit spinmaster.com or follow-on Instagram, Facebook and Twitter @spinmaster. Cautionary Note Regarding Forward-Looking Statements Certain statements, other than statements of historical fact, contained in this Press Release constitute \"forward-looking information\" within the meaning of certain securities laws, including the Securities Act (Ontario), and are based on expectations, estimates and projections as of the date on which the statements are made in this Press Release. The words \"plans\", \"expects\", \"projected\", \"estimated\", \"forecasts\", \"anticipates\", \"indicative\", \"intend\", \"guidance\", \"outlook\", \"potential\", \"prospects\", \"seek\", \"strategy\", \"targets\" or \"believes\", or variations of such words and phrases or statements that certain future conditions, actions, events or results \"will\", \"may\", \"could\", \"would\", \"should\", \"might\" or \"can\", or negative versions thereof, \"be taken\", \"occur\", \"continue\" or \"be achieved\", and other similar expressions, identify statements containing forward-looking information. Statements of forward-looking information in this Press Release include, without limitation, statements with respect to the Company's environmental and climate change goals and targets, including Scope 1+2 reduced emissions targets, net zero by 2050, waste reduction targets and the use of vegetable or soy-based inks in packaging. Forward-looking statements are necessarily based upon management's perceptions of historical trends, current conditions and expected future developments, as well as a number of specific factors and assumptions that, while considered reasonable by management as of the date on which the statements are made in this Press Release, are inherently subject to significant business, economic and competitive uncertainties and contingencies which could result in the forward-looking statements ultimately being incorrect. In addition to any factors and assumptions set forth above in this Press Release, the material factors and assumptions used to develop the forward-looking information include, but are not limited to a continued reduction in owned manufacturing, transition to electric vehicles, enhanced energy efficiency within offices and the lowering of emissions within local electricity grids, and that the risk factors noted in this Press Release, collectively, do not have a material impact on the Company. By its nature, forward-looking information is subject to inherent risks and uncertainties that may be general or specific and which give rise to the possibility that expectations, forecasts, predictions, projections or conclusions will not prove to be accurate, that assumptions may not be correct, and that objectives, strategic goals and priorities will not be achieved. Known and unknown risk factors, many of which are beyond the control of the Company, could cause actual results to differ materially from the forward-looking information in this Press Release. Such risks and uncertainties include, without limitation, the factors discussed in the Company's disclosure materials, including the Annual or subsequent, most recent interim MD&A and the Company's most recent Annual Information Form, filed with the securities regulatory authorities in Canada and available under the Company's profile on SEDAR (www.sedar.com). These risk factors are not intended to represent a complete list of the factors that could affect the Company and investors are cautioned to consider these and other factors, uncertainties and potential events carefully and not to put undue reliance on forward-looking statements. There can be no assurance that forward-looking statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Forward-looking statements are provided for the purpose of providing information about management's expectations and plans relating to the future. The Company disclaims any intention or obligation to update or revise any forward-looking statements whether as a result of new information, future events or otherwise, or to explain any material difference between subsequent actual events and such forward-looking statements, except to the extent required by applicable law. SOURCE Spin Master","filter_flag":1}
{"title":"Advancing Human and Planetary Health: Enabling Healthy Diets and Addressing Climate Change - Food and Agriculture Organization of the United Nations","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3d3dy5mYW8ub3JnL2dlbmV2YS9uZXdzL2RldGFpbHMvQWR2YW5jaW5nLUh1bWFuLWFuZC1QbGFuZXRhcnktSGVhbHRoLUVuYWJsaW5nLUhlYWx0aHktRGlldHMtYW5kLUFkZHJlc3NpbmctQ2xpbWF0ZS1DaGFuZ2UtL2Vu0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3d3dy5mYW8ub3JnL2dlbmV2YS9uZXdzL2RldGFpbHMvQWR2YW5jaW5nLUh1bWFuLWFuZC1QbGFuZXRhcnktSGVhbHRoLUVuYWJsaW5nLUhlYWx0aHktRGlldHMtYW5kLUFkZHJlc3NpbmctQ2xpbWF0ZS1DaGFuZ2UtL2Vu0gEA?oc=5","id":"CBMihQFodHRwczovL3d3dy5mYW8ub3JnL2dlbmV2YS9uZXdzL2RldGFpbHMvQWR2YW5jaW5nLUh1bWFuLWFuZC1QbGFuZXRhcnktSGVhbHRoLUVuYWJsaW5nLUhlYWx0aHktRGlldHMtYW5kLUFkZHJlc3NpbmctQ2xpbWF0ZS1DaGFuZ2UtL2Vu0gEA","guidislink":false,"published":"Wed, 19 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=109, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3d3dy5mYW8ub3JnL2dlbmV2YS9uZXdzL2RldGFpbHMvQWR2YW5jaW5nLUh1bWFuLWFuZC1QbGFuZXRhcnktSGVhbHRoLUVuYWJsaW5nLUhlYWx0aHktRGlldHMtYW5kLUFkZHJlc3NpbmctQ2xpbWF0ZS1DaGFuZ2UtL2Vu0gEA?oc=5\" target=\"_blank\">Advancing Human and Planetary Health: Enabling Healthy Diets and Addressing Climate Change<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food and Agriculture Organization of the United Nations<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Advancing Human and Planetary Health: Enabling Healthy Diets and Addressing Climate Change - Food and Agriculture Organization of the United Nations","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3d3dy5mYW8ub3JnL2dlbmV2YS9uZXdzL2RldGFpbHMvQWR2YW5jaW5nLUh1bWFuLWFuZC1QbGFuZXRhcnktSGVhbHRoLUVuYWJsaW5nLUhlYWx0aHktRGlldHMtYW5kLUFkZHJlc3NpbmctQ2xpbWF0ZS1DaGFuZ2UtL2Vu0gEA?oc=5\" target=\"_blank\">Advancing Human and Planetary Health: Enabling Healthy Diets and Addressing Climate Change<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food and Agriculture Organization of the United Nations<\/font>","source.href":"https:\/\/www.fao.org","source.title":"Food and Agriculture Organization of the United Nations","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Geneva - The FAO Liaison Office in Geneva and the Food and Nutrition Division (ESN) organized the seventh issue of the FAO in Geneva Nutrition Dialogue Series on “Advancing Human and Planetary Health: Enabling Healthy Diets and Addressing Climate Change”. It focused on actions to address major obstacles to the advancement of agrifood systems transformation for healthy diets. Urgent need to address climate change and nutrition nexus The production of today's diets is putting significant strain on agrifood systems, compromising the stability and resilience of natural resources and biodiverse ecosystems, and contributing to climate change. Among the suggested actions to effectively address climate change and reduce agrifood systems’ environmental footprint, a shift towards healthy diets is considered central. In response, the Government of Egypt, as President of COP27, in partnership with the World Health Organization (WHO), FAO, Global Alliance for Improved Nutrition (GAIN) and other partners, launched the Initiative on Climate Action and Nutrition (I-CAN), which aims to create a strong alliance between the nutrition and climate communities to implement policy actions that simultaneously improve nutrition outcomes and support climate change mitigation and adaptation. Building on the I-CAN, the seventh FAO in Geneva Nutrition dialogue featured country experiences from Malawi, Pakistan and Ethiopia highlighting practical examples across agrifood systems that can simultaneously accelerate progress on climate change and nutrition. Linking advocacy to action: Initiative on Climate Action and Nutrition (I-CAN) In her opening remarks Naeema Al-Gasseer, WHO Representative to Egypt, introduced the ICAN and in particular the next steps to COP28. She highlighted that by COP28, I-CAN is expected to further articulate and amplify a narrative around climate and nutrition action, publish a report outlining the current situation in climate and nutrition action, as well as share a report on pathways to better nutrition and better climate actions. To set the scene of the discussion, Nancy Aburto, Deputy Director of the FAO Food and Nutrition Division, presented FAO’s new findings on systems pathways through which climate and nutrition interact - the agrifood systems, water systems, health systems and social protection systems. She also elaborated on how climate change interacts with the whole agrifood system and its sectors, especially on diet. Her intervention was followed by three speakers focusing on experiences at field level. Country stories from Malawi, Pakistan and Ethiopia Pemphero Chawinga, Nutrition Specialist, spoke about enhancing the Resilience of Agro-Ecological Systems Project (ERASP) in Malawi, with an aim to address land degradation, loss of agro-biodiversity and climate change adaptation and mitigation. Tannaza Sadaf, Portfolio Lead of GAIN Pakistan, demonstrated the importance of utilizing waste (whey) as a resource not only to reduce environmental impact but also to create new products that showed a potential for innovation as well as a new revenue stream in the dairy industry. Sisay Sinamo, Senior Program Manager of the Seqota Declaration Federal Program Delivery Unit and SUN Focal Person at the Ministry of Health of Ethiopia, introduced how Ethiopia integrates nutrition and climate action through the Seqota Declaration, especially by expanding climate smart irrigation potential to improve water-use efficiency and extend growing seasons, as well as improving climate resilient water supply. A panel discussion moderated by Vivian Maduekeh, Climate and Health Program Coordinator of Global Alliance For The Future Of Food (GAFF) ensued speakers’ interventions. The panelists reflected on the case studies presented and discussed the integration of nutrition and health in Nationally Determined Contributions (NDCs) to accelerate progress on climate change and nutrition, the need to back piloted concepts with investments, as well as the necessity to collaborate with local partners for scaling up solutions. Healthy diets – theme of FAO in Geneva Nutrition Dialogue Series in 2023 The FAO Liaison Office in Geneva and the Food and Nutrition Division (ESN) are organizing a series of Nutrition Dialogues in collaboration with the FAO Liaison Office in Brussels to share experiences and practical insights on how intervening in agrifood systems can support better nutrition and in doing so, also support other development outcomes across the Sustainable Development Goals (SDGs). The core component of the Nutrition Dialogue Series for 2023 is the sharing of relevant work carried out in agrifood systems in Member States with support from FAO and partners. The series highlights concrete actions in agrifood systems to achieve healthy diets, presenting an opportunity to examine positive actions as well as challenges. Examples showcase how existing activities influence diets and nutrition and where there are opportunities for engagement and collaboration to enhance synergies and manage tradeoffs across a range of development outcomes. Related links - Webinar recording: link (passcode: df&$=2Xj) - FAO Food and Nutrition website","filter_flag":1}
{"title":"LyondellBasell Details Accelerated Momentum in 2022 Sustainability Report - LyondellBasell","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5seW9uZGVsbGJhc2VsbC5jb20vZW4vbmV3cy1ldmVudHMvY29ycG9yYXRlLS1maW5hbmNpYWwtbmV3cy9seW9uZGVsbGJhc2VsbC1kZXRhaWxzLWFjY2VsZXJhdGVkLW1vbWVudHVtLWluLTIwMjItc3VzdGFpbmFiaWxpdHktcmVwb3J0L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5seW9uZGVsbGJhc2VsbC5jb20vZW4vbmV3cy1ldmVudHMvY29ycG9yYXRlLS1maW5hbmNpYWwtbmV3cy9seW9uZGVsbGJhc2VsbC1kZXRhaWxzLWFjY2VsZXJhdGVkLW1vbWVudHVtLWluLTIwMjItc3VzdGFpbmFiaWxpdHktcmVwb3J0L9IBAA?oc=5","id":"CBMikgFodHRwczovL3d3dy5seW9uZGVsbGJhc2VsbC5jb20vZW4vbmV3cy1ldmVudHMvY29ycG9yYXRlLS1maW5hbmNpYWwtbmV3cy9seW9uZGVsbGJhc2VsbC1kZXRhaWxzLWFjY2VsZXJhdGVkLW1vbWVudHVtLWluLTIwMjItc3VzdGFpbmFiaWxpdHktcmVwb3J0L9IBAA","guidislink":false,"published":"Tue, 25 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=115, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5seW9uZGVsbGJhc2VsbC5jb20vZW4vbmV3cy1ldmVudHMvY29ycG9yYXRlLS1maW5hbmNpYWwtbmV3cy9seW9uZGVsbGJhc2VsbC1kZXRhaWxzLWFjY2VsZXJhdGVkLW1vbWVudHVtLWluLTIwMjItc3VzdGFpbmFiaWxpdHktcmVwb3J0L9IBAA?oc=5\" target=\"_blank\">LyondellBasell Details Accelerated Momentum in 2022 Sustainability Report<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">LyondellBasell<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"LyondellBasell Details Accelerated Momentum in 2022 Sustainability Report - LyondellBasell","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5seW9uZGVsbGJhc2VsbC5jb20vZW4vbmV3cy1ldmVudHMvY29ycG9yYXRlLS1maW5hbmNpYWwtbmV3cy9seW9uZGVsbGJhc2VsbC1kZXRhaWxzLWFjY2VsZXJhdGVkLW1vbWVudHVtLWluLTIwMjItc3VzdGFpbmFiaWxpdHktcmVwb3J0L9IBAA?oc=5\" target=\"_blank\">LyondellBasell Details Accelerated Momentum in 2022 Sustainability Report<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">LyondellBasell<\/font>","source.href":"https:\/\/www.lyondellbasell.com","source.title":"LyondellBasell","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"HOUSTON and ROTTERDAM, Netherlands, April 25, 2023 \/PRNewswire\/ -- LyondellBasell (NYSE: LYB) today published its annual sustainability report titled, Unlocking Possibilities. The publication offers an in-depth review of the company's 2022 sustainability performance, focused on progress toward ending plastic waste in the environment, taking climate action and supporting a thriving society. Highlights include: Ramping up circular and low carbon solutions through initiatives including growing the company's plastics recycling footprint globally to meet customer demand for more sustainable products and solutions. Accelerating interim greenhouse gas (GHG) emissions reduction targets for 2030, in line with science-based guidance and the Paris Agreement, by increasing scope 1 and 2 emissions reduction target to 42% and establishing a scope 3 emissions reduction target of 30%, relative to a 2020 baseline. Contributing to a thriving society, including focusing on safety, advancing commitments to diversity, equity and inclusion, and continuing to contribute to and engage with the communities in which the company operates. \"The need to address climate and circularity has never been greater, and during my first year with LyondellBasell, we took decisive action to advance our sustainability goals and accelerate progress on existing commitments. We see opportunities to capture value from our actions and we are primed to unlock possibilities toward a more sustainable, low carbon future,\" said Peter Vanacker, CEO of LyondellBasell. In 2022, the company reported sustainability highlights including: Announcing four new plastic waste recycling projects and ventures to grow its mechanical recycling footprint and increase access to feedstock through advanced sorting. Producing and marketing more than 175,000 metric tons of recycled and renewable-based polymers since 2019 under its Circulen brand. The result marks progress toward the company's commitment to produce and market at least 2 million metric tons of recycled and renewable-based polymers annually by 2030. Signing renewable electricity power purchase agreements (PPAs) in the U.S. and Europe, achieving more than 50% of our target to procure at least half of our electricity from renewable sources by 2030. Agreements signed this year have now taken us to 70% of our target. Completing more than 17,000 training hours on diversity, equity and inclusion. Additionally, 40% of the CEOs direct reports are women. Achieving a record low total recordable injury rate (TRIR) of 0.12, a top-decile result within the petrochemical manufacturing sector. Recording five million safe work hours at four sites and one million safe work hours at 21 sites. \"We are committed to providing transparency and demonstrating how we are making an impact as a leader in the chemicals industry,\" said Vanacker. For more information, read the 2022 LyondellBasell Unlocking Possibilities sustainability report here. About LyondellBasell We are LyondellBasell – a leader in the global chemical industry creating solutions for everyday sustainable living. Through advanced technology and focused investments, we are enabling a circular and low carbon economy. Across all we do, we aim to unlock value for our customers, investors and society. As one of the world's largest producers of polymers and a leader in polyolefin technologies, we develop, manufacture and market high-quality and innovative products for applications ranging from sustainable transportation and food safety to clean water and quality healthcare. For more information, please visit www.lyondellbasell.com or follow @LyondellBasell on LinkedIn. Forward-Looking Statements The statements in this release relating to matters that are not historical facts are forward-looking statements. Actual results could differ materially based on factors including, but not limited to, market conditions, the business cyclicality of the chemical, polymers and refining industries; the availability, cost and price volatility of raw materials and utilities, particularly the cost of oil, natural gas, and associated natural gas liquids; our ability to successfully implement initiatives identified pursuant to our value enhancement program and generate anticipated earnings; competitive product and pricing pressures; labor conditions; our ability to attract and retain key personnel; operating interruptions (including leaks, explosions, fires, weather-related incidents, mechanical failure, unscheduled downtime, supplier disruptions, labor shortages, strikes, work stoppages or other labor difficulties, transportation interruptions, spills and releases and other environmental risks); the supply\/demand balances for our and our joint ventures' products, and the related effects of industry production capacities and operating rates; our ability to manage costs; future financial and operating results; our ability to recognize the benefits and synergies of any proposed transactions; legal and environmental proceedings; tax rulings, consequences or proceedings; technological developments, and our ability to develop new products and process technologies; our ability to meet our sustainability goals, including the ability to operate safely, increase production of recycled and renewable-based polymers to meet our targets and forecasts, and reduce our emissions and achieve net zero emissions by the time set in our goals; our ability to procure energy from renewable sources; our ability to hire and retain diverse employees and engage with the communities in which we operate; the successful shut down and closure of the Houston Refinery, including within the expected timeframe; potential governmental regulatory actions; political unrest and terrorist acts; risks and uncertainties posed by international operations, including foreign currency fluctuations; uncertainties and impacts related to the extent and duration of the pandemic; and our ability to comply with debt covenants and to repay our debt. Additional factors that could cause results to differ materially from those described in the forward-looking statements can be found in the \"Risk Factors\" section of our Form 10-K for the year ended December 31, 2022, which can be found at www.LyondellBasell.com on the Investor Relations page and on the Securities and Exchange Commission's website at www.sec.gov. There is no assurance that any of the actions, events or results of the forward-looking statements will occur, or if any of them do, what impact they will have on our results of operations or financial condition. Forward-looking statements speak only as of the date they were made and are based on the estimates and opinions of management of LyondellBasell at the time the statements are made. LyondellBasell does not assume any obligation to update forward-looking statements should circumstances or management's estimates or opinions change, except as required by law. CONTACT: LyondellBasell Media Relations, 713-309-7575, mediarelations@lyb.com","filter_flag":1}
{"title":"Tillamook County Creamery Association Partners With New Seasons Market to Drive Climate Action; Jocelyn Bridson ... - Deli Market News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMizgFodHRwczovL3d3dy5kZWxpbWFya2V0bmV3cy5jb20vcXVpY2stYml0ZS90aWxsYW1vb2stY291bnR5LWNyZWFtZXJ5LWFzc29jaWF0aW9uLXBhcnRuZXJzLW5ldy1zZWFzb25zLW1hcmtldC1kcml2ZS1jbGltYXRlLWFjdGlvbi1qb2NlbHluLWJyaWRzb24tYW5kLWF0aGVuYS1wZXR0eS1zaGFyZS9jaGFuZGxlci1qYW1lcy9mcmktMDQwNzIwMjMtMDg0NS8xNTI4ONIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMizgFodHRwczovL3d3dy5kZWxpbWFya2V0bmV3cy5jb20vcXVpY2stYml0ZS90aWxsYW1vb2stY291bnR5LWNyZWFtZXJ5LWFzc29jaWF0aW9uLXBhcnRuZXJzLW5ldy1zZWFzb25zLW1hcmtldC1kcml2ZS1jbGltYXRlLWFjdGlvbi1qb2NlbHluLWJyaWRzb24tYW5kLWF0aGVuYS1wZXR0eS1zaGFyZS9jaGFuZGxlci1qYW1lcy9mcmktMDQwNzIwMjMtMDg0NS8xNTI4ONIBAA?oc=5","id":"CBMizgFodHRwczovL3d3dy5kZWxpbWFya2V0bmV3cy5jb20vcXVpY2stYml0ZS90aWxsYW1vb2stY291bnR5LWNyZWFtZXJ5LWFzc29jaWF0aW9uLXBhcnRuZXJzLW5ldy1zZWFzb25zLW1hcmtldC1kcml2ZS1jbGltYXRlLWFjdGlvbi1qb2NlbHluLWJyaWRzb24tYW5kLWF0aGVuYS1wZXR0eS1zaGFyZS9jaGFuZGxlci1qYW1lcy9mcmktMDQwNzIwMjMtMDg0NS8xNTI4ONIBAA","guidislink":false,"published":"Fri, 07 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=97, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMizgFodHRwczovL3d3dy5kZWxpbWFya2V0bmV3cy5jb20vcXVpY2stYml0ZS90aWxsYW1vb2stY291bnR5LWNyZWFtZXJ5LWFzc29jaWF0aW9uLXBhcnRuZXJzLW5ldy1zZWFzb25zLW1hcmtldC1kcml2ZS1jbGltYXRlLWFjdGlvbi1qb2NlbHluLWJyaWRzb24tYW5kLWF0aGVuYS1wZXR0eS1zaGFyZS9jaGFuZGxlci1qYW1lcy9mcmktMDQwNzIwMjMtMDg0NS8xNTI4ONIBAA?oc=5\" target=\"_blank\">Tillamook County Creamery Association Partners With New Seasons Market to Drive Climate Action; Jocelyn Bridson ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deli Market News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Tillamook County Creamery Association Partners With New Seasons Market to Drive Climate Action; Jocelyn Bridson ... - Deli Market News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMizgFodHRwczovL3d3dy5kZWxpbWFya2V0bmV3cy5jb20vcXVpY2stYml0ZS90aWxsYW1vb2stY291bnR5LWNyZWFtZXJ5LWFzc29jaWF0aW9uLXBhcnRuZXJzLW5ldy1zZWFzb25zLW1hcmtldC1kcml2ZS1jbGltYXRlLWFjdGlvbi1qb2NlbHluLWJyaWRzb24tYW5kLWF0aGVuYS1wZXR0eS1zaGFyZS9jaGFuZGxlci1qYW1lcy9mcmktMDQwNzIwMjMtMDg0NS8xNTI4ONIBAA?oc=5\" target=\"_blank\">Tillamook County Creamery Association Partners With New Seasons Market to Drive Climate Action; Jocelyn Bridson ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deli Market News<\/font>","source.href":"https:\/\/www.delimarketnews.com","source.title":"Deli Market News","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"TILLAMOOK, OR Certified B Corporations® (B Corps™) continue to make the world a better place, and two Oregon-based brands are teaming up to make a bigger impact. Tillamook County Creamery Association (TCCA) and New Seasons Market (NSM) have teamed up to establish a native riparian forest habitat on farmland in Tillamook County. “Customers tell us that the brands they shop for, and grocery markets they shop at, should be doing good for the planet,” said Jocelyn Bridson, TCCA Director of Environment and Community Impact. “At the same time, it is critical that we support farmers as we ask them to implement environmental solutions. We saw an opportunity to engage everyone in the supply chain—from the farmers to the brand to the retailer—to improve environmental impacts and outcomes.” The two brands have come together to create a regenerative agriculture project to sequester carbon and improve ecosystems on farms. To kick off the venture, TCCA and NSM will each provide $15,000 to plant approximately five acres of native, woody vegetation on regional dairy farms within the TCCA Cooperative. The plantings—including diverse species of native trees and shrubs—will sequester carbon, protect and improve water quality, and enhance wildlife habitat. TCCA and NSM also included this project for a USDA Conservation Innovation Grant, noted the release, led by Zero Foodprint and MAD Agriculture. If awarded, it would fund additional acres for restoration. “Working in partnerships to accelerate regenerative agriculture within our supply chain is part of the solution to creating a low-carbon and resilient regional food economy,” said Athena Petty, New Seasons Market’s Senior Manager of Sustainability. With this plan in place, the companies aim to improve both businesses’ environmental footprints and help TCCA and NSM meet their collective climate goals. As noted in the release, it’s the first time TCCA has partnered with a retail customer on an environmental project. The riparian forest planting will begin over the winter of 2023–24 and will provide volunteer opportunities for staff of both B Corp partners. TCCA and NSM are committed to multi-faceted stewardship and helping to mitigate climate change. Learn more about TCCA’s Climate Action Plan here, and click here for details on NSM’s sustainability practices. Check back with Deli Market News as we keep a pulse on retail and specialty news.","filter_flag":1}
{"title":"Quick Tips to Repair Broken Items and Keep Them Out of the Landfill - Columbia University","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vbmV3cy5jbGltYXRlLmNvbHVtYmlhLmVkdS8yMDIzLzA0LzIwL3F1aWNrLXRpcHMtdG8tcmVwYWlyLWJyb2tlbi1pdGVtcy1hbmQta2VlcC10aGVtLW91dC1vZi10aGUtbGFuZGZpbGwv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vbmV3cy5jbGltYXRlLmNvbHVtYmlhLmVkdS8yMDIzLzA0LzIwL3F1aWNrLXRpcHMtdG8tcmVwYWlyLWJyb2tlbi1pdGVtcy1hbmQta2VlcC10aGVtLW91dC1vZi10aGUtbGFuZGZpbGwv0gEA?oc=5","id":"CBMicWh0dHBzOi8vbmV3cy5jbGltYXRlLmNvbHVtYmlhLmVkdS8yMDIzLzA0LzIwL3F1aWNrLXRpcHMtdG8tcmVwYWlyLWJyb2tlbi1pdGVtcy1hbmQta2VlcC10aGVtLW91dC1vZi10aGUtbGFuZGZpbGwv0gEA","guidislink":false,"published":"Thu, 20 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=110, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vbmV3cy5jbGltYXRlLmNvbHVtYmlhLmVkdS8yMDIzLzA0LzIwL3F1aWNrLXRpcHMtdG8tcmVwYWlyLWJyb2tlbi1pdGVtcy1hbmQta2VlcC10aGVtLW91dC1vZi10aGUtbGFuZGZpbGwv0gEA?oc=5\" target=\"_blank\">Quick Tips to Repair Broken Items and Keep Them Out of the Landfill<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Columbia University<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Quick Tips to Repair Broken Items and Keep Them Out of the Landfill - Columbia University","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vbmV3cy5jbGltYXRlLmNvbHVtYmlhLmVkdS8yMDIzLzA0LzIwL3F1aWNrLXRpcHMtdG8tcmVwYWlyLWJyb2tlbi1pdGVtcy1hbmQta2VlcC10aGVtLW91dC1vZi10aGUtbGFuZGZpbGwv0gEA?oc=5\" target=\"_blank\">Quick Tips to Repair Broken Items and Keep Them Out of the Landfill<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Columbia University<\/font>","source.href":"https:\/\/news.climate.columbia.edu","source.title":"Columbia University","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"What do you do when your shoes spring a leak, your toaster’s on the fritz, or your window fan stops spinning? Chances are, you grapple with feelings of guilt and then eventually toss it out. Unfortunately, in our society, it’s almost always easier and cheaper to order a replacement than to hire someone to repair it. Sandra Goldmark is a proponent of building a better system — one where we as as a society focus on making sturdier items, sustainably produced, that can be repaired and kept in circulation for a long time, then repurposed or recycled at the end of their useful lives. This concept is called the circular economy, and she talks about it in her 2020 book, Fixation: How to Have Stuff Without Breaking the Planet. In the circular economy formula, repair can be the trickiest variable for most of us. It’s not always feasible to track down a local expert who knows how to fix your item, and even if you do, it may not be an affordable solution. Since Goldmark founded and ran a repair service, we decided to ask her for tips on how and when it makes sense to look for a repair person, and how to do a few basic and common repairs ourselves. She shares tips in the Q&A and videos below. First off, could you tell us more about how fixing stuff is related to sustainability? Currently we live in a largely linear system of production and consumption. We extract resources from the earth. We make them into products that generally don’t last very long, and they go pretty much directly into an incinerator or landfill — often within a year. This causes a huge amount of emissions — the Ellen MacArthur Foundation estimates that as much as 55% of global greenhouse gas emissions come from the “production and use of everyday items” like food, cars, clothes and much more. It also impacts land use, habitat degradation and therefore biodiversity. It contributes to pollution of waterways and airways, as well as negative impacts on manufacturing communities where people are not always paid a proper living wage. A circular system is necessary as part of a global transition because it means extracting fewer resources from the earth. In a circular system, the materials we do extract are renewable and ethically sourced. It means designing products that will last a long time. It means continuing to manufacture, but also developing systems for collection, remanufacturing, and redistribution — basically keeping materials in use for as long as possible. And that’s where repair sits. If you have an object that breaks, it should be very simple and logical to just fix it. The problem, of course, is that today in the United States and in many places around the world, it’s incredibly hard to get something fixed. Products are not designed for repair, so they’re hard to fix. New products are artificially cheap, so paying a local craftsman to fix your item is sometimes more expensive than just getting a new one. How did you learn to repair broken items? I worked in theater as a set and costume designer for many years. So I learned to make and fix and paint. They call it upcycling now, but in theater it was more like Frankenstein-ing — and we do it all the time. You just get really comfortable with a lot of materials and tools. Also, I grew up with a mom who sewed, and who was very handy around the house and would fix all kinds of things. My whole family is a bunch of tinkerers, really. For people who didn’t have that kind of upbringing and experience, where would you recommend that they start? Well, the nice thing about fixing things is it’s really hard to mess it up, because the thing’s already broken. It’s a really wonderful place to get started with tinkering and working with your hands. There are tons of YouTube videos, especially from iFixit, that can teach you how to fix almost anything at home. There are repair cafes all over the country where you can go and volunteers will fix your object, but also teach you how to fix. There are maker spaces where you can practice fixing stuff with somebody who knows how to use the tools. And if you don’t have time to fix it yourself, that’s okay. Don’t feel bad. Go get it fixed. See if you can pay somebody to do it. Go to your local cobbler. There’s no shame in it — in fact, the opposite. I think that the more we do these things at home and also spend money on them in our communities, the more we develop an ecosystem around repair. In the repair service that you ran until 2019, what were some of the most common items you encountered? We got a lot of lamps — which is why we wanted to show everyone how rewire a lamp [see video]. We got a lot of small appliances, and jewelry. Not fine jewelry, just cheap necklaces and earrings and stuff that people liked and wanted to keep. We got a lot of chairs, tables, and other small furniture. And some oddball stuff, like ceramics and toys. What was interesting was that people mostly brought us everyday objects, not heirlooms and antiques. It wasn’t that people were only reserving repair for specialty items. It was more that repair was so inaccessible to them, that there was no way they could get these kinds of mundane items fixed until we opened our little shops. One of your videos shows us how to darn a sock. Why did you choose to demonstrate that repair? I chose a sock because it’s so easy and satisfying. You don’t need a lot of skills. You don’t need complicated tools. You don’t even need electricity. And you really can extend the life of a nice pair of socks for such a long time. Also, selfishly, my sock has a hole in it and I want to fix it! Let’s go through a quick list of items we might commonly throw out. Is it worth it to try to fix these things? Shoes? For me, dropping off at the cobbler is always a ‘yes, go for it.’ It has to be good shoes, though — like you can’t really fix a sneaker sole. The cobbler will tell you if they can repair it or not. What about nonstick pans that have gone sticky? I stopped using nonstick stuff a long time ago because of the chemicals. We switched to cast iron and never looked back. If you season it properly, it’s the ultimate repairable pan because if it starts to get sticky, you just season it again. You put it in the oven with oil and then it becomes nonstick again. It’s totally amazing. Toaster? This one you can forgive yourself for throwing away — or hopefully recycling. It is incredibly hard to find parts to repair toasters, and it’s incredibly hard to find anybody who will actually fix it for you. But some toasters and microwaves can be recycled in New York City, especially if the housing is metal. Electronics? With electronics, sometimes you can get them repaired, and sometimes you can do it yourself. Fix it if you can. If you can’t, recycle it and buy a used one, knowing that the global statistics on e-waste recycling are really poor. But until that bigger system gets a little better, you’ve done what you can. One of my big philosophies is, you don’t have to feel guilty if you didn’t fix every broken thing in your house, or if you didn’t repair your shoes. My philosophy is that I just try to do the best I can, and work with others to get corporations and policy makers to make it easier for us to do the right thing. Any other tips for people who are just trying their best? On the personal level, the area where I find I am able to make the most concerted effort is actually in the purchasing moment. When I buy something, I’m trying to buy something that is sustainably made, that is repairable. Can you buy a high quality item, used, that’s fixable? That’s when you really have the capacity to impact the end of life of that product. On a bigger level: advocate, advocate, advocate. We’ve got to push for a system where getting all kinds of items fixed is as simple and accessible as pushing that “buy now” button — as easy as darning a sock!","filter_flag":1}
{"title":"These 8 Countries are Embracing Plant-Based Food for the Planet - VegNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vdmVnbmV3cy5jb20vY291bnRyaWVzLWVtYnJhY2luZy1wbGFudC1iYXNlZC1mb29kLWZvci1wbGFuZXTSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vdmVnbmV3cy5jb20vY291bnRyaWVzLWVtYnJhY2luZy1wbGFudC1iYXNlZC1mb29kLWZvci1wbGFuZXTSAQA?oc=5","id":"CBMiQ2h0dHBzOi8vdmVnbmV3cy5jb20vY291bnRyaWVzLWVtYnJhY2luZy1wbGFudC1iYXNlZC1mb29kLWZvci1wbGFuZXTSAQA","guidislink":false,"published":"Tue, 04 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=4, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=94, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vdmVnbmV3cy5jb20vY291bnRyaWVzLWVtYnJhY2luZy1wbGFudC1iYXNlZC1mb29kLWZvci1wbGFuZXTSAQA?oc=5\" target=\"_blank\">These 8 Countries are Embracing Plant-Based Food for the Planet<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"These 8 Countries are Embracing Plant-Based Food for the Planet - VegNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vdmVnbmV3cy5jb20vY291bnRyaWVzLWVtYnJhY2luZy1wbGFudC1iYXNlZC1mb29kLWZvci1wbGFuZXTSAQA?oc=5\" target=\"_blank\">These 8 Countries are Embracing Plant-Based Food for the Planet<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","source.href":"https:\/\/vegnews.com","source.title":"VegNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"It’s no secret, global temperatures are soaring. The world’s biggest industries have pumped more and more greenhouse gasses into the atmosphere, and the consequences are becoming difficult to ignore. Last year was fraught with extreme weather events, like heatwaves and devastating floods, and this year, more is coming. In fact, early forecasts suggest that a combination of El Niño and the climate crisis could see temperatures exceed 1.5C of warming this year. The prediction is alarming. But, when it comes to climate crisis mitigation, we’re not totally powerless. As individuals, there are some actions we can take to reduce our own environmental impact. In 2018, the world’s biggest food production analysis, conducted at the University of Oxford, concluded that rejecting resource-intensive and pollutive animal agriculture, and adopting a plant-based diet, was the best way a person could reduce their own carbon footprint. “A vegan diet is probably the single biggest way to reduce your impact on planet Earth, not just greenhouse gases, but global acidification, eutrophication, land use, and water use,” said lead author Joseph Poore at the time. Unsplash But when it comes to climate action, the truth is, the problem is far bigger than individuals. And that means the solution needs to come from higher up. We are, of course, talking about governmental action. There is a long way to go before many countries, particularly those in the West (who are responsible for most of the world’s emissions), can say they have truly done their part to limit emissions and tackle the climate crisis. But, by pushing plant-based food consumption and supporting alternative protein development, some governments (at a local, state, and central level) have started to take important steps—here are eight examples. 1 Germany At the end of 2022, Germany’s federal minister of food and agriculture Cem Özdemir proposed Germany’s new National Nutrition Strategy in a paper titled “Towards the Federal Government’s Nutrition Strategy.” The paper acknowledged that the country’s meat consumption was far too high, both from a nutrition and sustainability standpoint. In 2021, Statista notes that German people ate 55kg of meat per capita—lower than in previous years, but still a significant amount.) “How and what we eat also has far-reaching effects: on the environment, biodiversity, and climate in Germany and worldwide, on animals as our fellow beings, on the agricultural and food industry, and not ultimately on our health and well-being,” the paper noted. It also lays out several goals, including the whole country going carbon neutral by 2045 and ensuring that 30 percent of agricultural goods come from organic farming by 2030, as well as halving food waste in every sector. It noted that to meet these goals, food strategies must embrace seasonal, local, plant-based produce. “The transformation of the entire food system towards a plant-based diet is the most important adjusting screw in the nutrition sector to achieve our national and international climate, biodiversity, and sustainability goals,” the paper continued. Unsplash 2 The US Across the US, several states and major cities have embraced a more plant-forward approach to food. In New York City, for example, public schools launched Vegan Fridays last year. The initiative means that every Friday, 930,000 children are served plant-based meals. And in March 2022, the city, which has its own vegan mayor, Eric Adams, joined 40 states and cities, including Colorado, by declaring March 20 “MeatOut Day.” The initiative was created by the Farm Animal Rights Movement in a bid to educate more people about the benefits of plant-based diets. On the West Coast, California has also been pushing plant-based diets. In July 2022, it became the first state to support plant-based school meals with a $700 million investment. “We are grateful to see both the legislature and the Governor recognize the cultural shift towards plant-based choices by supporting our children to eat healthier, more climate-friendly, and humane diets,” said Judie Mancuso, founder of animal advocacy nonprofit Social Compassion in Legislation, at the time. Elsewhere in the US, new legislation in Illinois, set to go into force this year, means that nearly 2 million children have access to plant-based school lunches. And in May 2022, Washington, DC celebrated its first vegan restaurant week thanks to a proclamation signed by Mayor Murial Bowser. “Whereas plant-centric eating lowers the risk of heart disease, stroke, obesity, and type 2 diabetes, and those conditions disproportionally undermine the health-related quality of life of Black, Indigenous, and people of color (BIPOC) residents of Washington, DC and whereas a global shift toward plant-centric food norms would help lower greenhouse gas emissions, and governments can play a crucial trailblazing role in facilitating such shifts by their citizenry,” Bowser said at the time. 3 Canada In the four years leading up to December 2022, Protein Industries Canada—which has received funding from the Government of Canada and is one of the country’s five Global Innovation Clusters—invested more than $477 million into Canada’s plant-based food sector. “We now have projects that span from British Columbia to Prince Edward Island and beyond,” Bill Greuel, the CEO of Protein Industries Canada, said. “More so, the result of this investment is becoming increasingly tangible, with new ingredients and food products making their way onto grocery shelves and restaurant menus in Canada and beyond.” Also in 2022, the government’s AgriInnovate Program awarded plant-based brand Big Mountain Foods 2 Ltd. more than $1.4 million in funding. 4 Denmark In 2021, the Danish government announced it would be dedicating more than 1.25 billion kroner (around $183 million) to the advancement of the plant-based food sector. The funding was agreed as part of an “unprecedented climate agreement for food and agriculture,” reported the Good Food Institute (GFI) Europe. “With this announcement, Denmark has recognized the huge potential of sustainable proteins to drive down agricultural emissions, and established itself as Europe’s biggest public investor in plant-based innovation,” Acacia Smith, GFI Europe’s policy manager, said at the time. In 2022, Denmark followed up this agreement by investing more than $100 million into its “Plant Fund.” 5Taiwan In January 2023, a new climate bill, which specifically references the promotion of plant-based, low-carbon diets, passed the legislature in Taiwan. The bill, called the Climate Change Response Act, also enshrines the country’s 2050 net zero targets into law. The move was praised by the Environment & Animal Society of Taiwan (EAST), which has campaigned consistently for an update to Taiwan’s laws regarding the role of food in the climate crisis. “As the world comes to grips with the importance of food systems in addressing climate change, we are delighted to see an emphasis on low-carbon diets in Taiwan’s climate legislation,” Wu Hung, EAST’s Chief Executive, said. @punehealthsave 6 India In 2021, a grassroots campaign called The Plant Based Treaty launched for the first time. Designed to accompany the Paris Agreement, the treaty aims to “put food systems at the heart of combatting the climate crisis.” So far, thousands of individuals have endorsed the treaty, as well as 20 cities around the world. While Boynton Beach, FL; Los Angeles, CA; Didim, Turkey; Haywards Heath, England; and Edinburgh, Scotland are among the endorsers, most (15) of the cities and towns on the list are located in India. Gopalpur, a coastal town in Odisha, was the most recent Indian town to endorse the treaty. “We completely agree with the motto ‘eat plants, plant trees,’” Gopalpur’s council said in a message regarding its endorsement. “We believe that shifting towards a plant-based diet can solve the climate crisis.” 7 The Netherlands In 2019, Amsterdam, the capital of the Netherlands, announced that meat would no longer be automatically available at government-catered events, starting in 2020. Instead, all menus are vegetarian by default. “The initiative makes it the individual’s choice of whether to have meat or fish,” Rutger Groot Wassink, the head of operational management, said at the time. “We are turning the norms upside down. The question is no longer, ‘Are you vegetarian?’ but ‘Do you eat meat or fish?’” In 2021, Amsterdam City Council also revealed plans to persuade citizens to go 50-percent plant-based by 2030, and 60-percent plant-based by 2040. Plus in 2022, the central government of the Netherlands showed its support for alternative protein when it allocated €60 Million for the cultivated meat industry (cultivated meat refers to growing meat from cells in laboratories, so it isn’t plant-based, but it is slaughter-free). 8 Finland In 2020, the Finnish government invested $2.4 million into the country’s plant-based meat sector. And, in December 2022, it was revealed that the funding is paying off. The VTT Technical Research Centre of Finland, which is owned by the state, announced that it had developed a new innovative technology that would help to perfect plant-based meat products. Essentially, it combines cellular agriculture techniques with plant-based ingredients, and the result tastes just like animal meat. “Our innovation toolkit allows producers to perfectly recreate the sizzling fat and juicy tenderness of meat like never before,” Nesli Sözer, Research Professor at VTT, said. “By combining our experience in plant-based ingredients, food design, and cellular agriculture, we can create proof-of-concept of prototypes for tasty, identical meat alternatives that are ready to be scaled up for industrial production.”","filter_flag":1}
{"title":"New York's Mannan Supermarket Partners with Charity Group to Improve Food Security - Progressive Grocer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vcHJvZ3Jlc3NpdmVncm9jZXIuY29tL25ldy15b3Jrcy1tYW5uYW4tc3VwZXJtYXJrZXQtcGFydG5lcnMtY2hhcml0eS1ncm91cC1pbXByb3ZlLWZvb2Qtc2VjdXJpdHnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vcHJvZ3Jlc3NpdmVncm9jZXIuY29tL25ldy15b3Jrcy1tYW5uYW4tc3VwZXJtYXJrZXQtcGFydG5lcnMtY2hhcml0eS1ncm91cC1pbXByb3ZlLWZvb2Qtc2VjdXJpdHnSAQA?oc=5","id":"CBMiZ2h0dHBzOi8vcHJvZ3Jlc3NpdmVncm9jZXIuY29tL25ldy15b3Jrcy1tYW5uYW4tc3VwZXJtYXJrZXQtcGFydG5lcnMtY2hhcml0eS1ncm91cC1pbXByb3ZlLWZvb2Qtc2VjdXJpdHnSAQA","guidislink":false,"published":"Wed, 19 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=109, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vcHJvZ3Jlc3NpdmVncm9jZXIuY29tL25ldy15b3Jrcy1tYW5uYW4tc3VwZXJtYXJrZXQtcGFydG5lcnMtY2hhcml0eS1ncm91cC1pbXByb3ZlLWZvb2Qtc2VjdXJpdHnSAQA?oc=5\" target=\"_blank\">New York's Mannan Supermarket Partners with Charity Group to Improve Food Security<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Progressive Grocer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New York's Mannan Supermarket Partners with Charity Group to Improve Food Security - Progressive Grocer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vcHJvZ3Jlc3NpdmVncm9jZXIuY29tL25ldy15b3Jrcy1tYW5uYW4tc3VwZXJtYXJrZXQtcGFydG5lcnMtY2hhcml0eS1ncm91cC1pbXByb3ZlLWZvb2Qtc2VjdXJpdHnSAQA?oc=5\" target=\"_blank\">New York's Mannan Supermarket Partners with Charity Group to Improve Food Security<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Progressive Grocer<\/font>","source.href":"https:\/\/progressivegrocer.com","source.title":"Progressive Grocer","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Independent halal grocer Mannan Supermarket, located in the New York City borough of Queens, is teaming up with Zara Charitable Foundation to combat food insecurity among local children. The foundation will underwrite the cost of a year’s worth of fresh, culturally appealing products sourced from Mannan to feed 200 diverse families served by The Gaton Foundation, a Jamaica, N.Y.-based nonprofit group that provides proper nutrition and wellness. According program organizers, the timing of the initiative comes after a rollback of pandemic-era assistance through the Supplemental Nutrition Assistance Program (SNAP) and the Special Supplemental Nutrition Program for Women, Infants and Children (WIC). “Food prices are increasing at the same time inflation is eating away at the value of money at the same time food benefits are vanishing, making it three times more expensive for families to afford to eat healthy,” explained Mannan's Mahinur Rahman. “When Zara suggested we work together to secure fresh, culturally relevant food to help people make ends meet, we were proud to supply the need.” Added Tony Subraj, managing partner of Jamaica, N.Y.-based Zara Realty and a leader of the Zara Charitable Foundation: “Many families are struggling to put food on the table and, after both SNAP and WIC resources got reduced, we knew how important it was to step up and help hardworking families maintain access to fresh, nutritious food.” The program kicked off in early March, when a Mannan Supermarket location in the Queens neighborhood of Jamaica donated a variety of foods to feed local families through Richmond Hill High School. Residents received products such as roti, lentils, tortillas, rice, butter, bread and crushed tomatoes.","filter_flag":1}
{"title":"California approves rule phasing out big diesel trucks - CBS Sacramento","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LmNic25ld3MuY29tL3NhY3JhbWVudG8vbmV3cy9jYWxpZm9ybmlhLWFwcHJvdmVzLXJ1bGUtcGhhc2luZy1vdXQtYmlnLWRpZXNlbC10cnVja3Mv0gFjaHR0cHM6Ly93d3cuY2JzbmV3cy5jb20vYW1wL3NhY3JhbWVudG8vbmV3cy9jYWxpZm9ybmlhLWFwcHJvdmVzLXJ1bGUtcGhhc2luZy1vdXQtYmlnLWRpZXNlbC10cnVja3Mv?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LmNic25ld3MuY29tL3NhY3JhbWVudG8vbmV3cy9jYWxpZm9ybmlhLWFwcHJvdmVzLXJ1bGUtcGhhc2luZy1vdXQtYmlnLWRpZXNlbC10cnVja3Mv0gFjaHR0cHM6Ly93d3cuY2JzbmV3cy5jb20vYW1wL3NhY3JhbWVudG8vbmV3cy9jYWxpZm9ybmlhLWFwcHJvdmVzLXJ1bGUtcGhhc2luZy1vdXQtYmlnLWRpZXNlbC10cnVja3Mv?oc=5","id":"CBMiX2h0dHBzOi8vd3d3LmNic25ld3MuY29tL3NhY3JhbWVudG8vbmV3cy9jYWxpZm9ybmlhLWFwcHJvdmVzLXJ1bGUtcGhhc2luZy1vdXQtYmlnLWRpZXNlbC10cnVja3Mv0gFjaHR0cHM6Ly93d3cuY2JzbmV3cy5jb20vYW1wL3NhY3JhbWVudG8vbmV3cy9jYWxpZm9ybmlhLWFwcHJvdmVzLXJ1bGUtcGhhc2luZy1vdXQtYmlnLWRpZXNlbC10cnVja3Mv","guidislink":false,"published":"Fri, 28 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=118, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LmNic25ld3MuY29tL3NhY3JhbWVudG8vbmV3cy9jYWxpZm9ybmlhLWFwcHJvdmVzLXJ1bGUtcGhhc2luZy1vdXQtYmlnLWRpZXNlbC10cnVja3Mv0gFjaHR0cHM6Ly93d3cuY2JzbmV3cy5jb20vYW1wL3NhY3JhbWVudG8vbmV3cy9jYWxpZm9ybmlhLWFwcHJvdmVzLXJ1bGUtcGhhc2luZy1vdXQtYmlnLWRpZXNlbC10cnVja3Mv?oc=5\" target=\"_blank\">California approves rule phasing out big diesel trucks<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CBS Sacramento<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"California approves rule phasing out big diesel trucks - CBS Sacramento","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LmNic25ld3MuY29tL3NhY3JhbWVudG8vbmV3cy9jYWxpZm9ybmlhLWFwcHJvdmVzLXJ1bGUtcGhhc2luZy1vdXQtYmlnLWRpZXNlbC10cnVja3Mv0gFjaHR0cHM6Ly93d3cuY2JzbmV3cy5jb20vYW1wL3NhY3JhbWVudG8vbmV3cy9jYWxpZm9ybmlhLWFwcHJvdmVzLXJ1bGUtcGhhc2luZy1vdXQtYmlnLWRpZXNlbC10cnVja3Mv?oc=5\" target=\"_blank\">California approves rule phasing out big diesel trucks<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CBS Sacramento<\/font>","source.href":"https:\/\/www.cbsnews.com","source.title":"CBS Sacramento","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"New big rigs and buses that run on diesel would not be sold in California starting in 2036, according to new rules approved by state regulators Friday to wean the state off fossil fuels and combat climate change. The rule would tackle pollution from heavy trucks used to transport goods through ports and require companies to disclose their use of these so-called drayage trucks by 2024. The rule cannot be implemented without approval by the U.S. Environmental Protection Agency. But it's related to standards the Biden administration already approved last month to phase out diesel-powered box trucks, semitrailers and large passenger pick-ups. If the EPA approves California's rule, other states could later adopt the same standards. Democratic Gov. Gavin Newsom touted Friday's move as a chance to show \"the world what real climate action looks like.\" \"We're one step closer to achieving healthier neighborhoods and cleaner air for all Californians,\" he said in a statement. The state continues to approve ambitious emissions standards as part of its broader goal of achieving carbon neutrality, meaning it would remove as many carbon emissions as it releases, by 2045. Air regulators previously voted to require that all new cars, pickup trucks and SUVs be electric or hydrogen by 2035. And they have banned the sale of new products run by small gas-powered engines, including leaf blowers, lawn mowers and portable generators. The truck emissions vote follows the California Air Resources Board's approval Thursday of a rule phasing out decades-old diesel locomotives and a transition to more zero-emission technology to power trains that transport food, lumber, oil and other products. But some in the trucking industry are concerned the rule will ultimately increase prices for goods that are trucked. The American Trucking Associations called the rule \"unrealistic.\" The group is worried about how expensive a drastic shift to zero-emission vehicles will be and says vehicle-charging infrastructure is not equipped for the transition. \"As it becomes clear that California's rhetoric is not being matched by technology, we hope the Board will reverse course and allow trucking companies the freedom to choose the clean technologies that work best for their operations,\" the group said in a statement. Emissions from trucks have already gone down drastically in recent decades, it said. More than 100 models of zero-emission trucks are available in North America, state regulators say. On top of that, more than 100 others are being produced. Friday's rule, combined with previous electric truck regulations approved by the state, would mean more than 1.6 million zero-emission medium- and heavy-duty trucks would operate in the state by 2048. Nationwide, the transportation sector contributes the largest share of greenhouse gas emissions annually, according to the EPA, with medium- and heavy-duty trucks contributing nearly a quarter of those emissions. Heavy-duty vehicles make up about 3% of vehicles on the road in California, but they generate more than half of nitrogen oxides and fine particle diesel pollution, according to the California Air Resources Board. That's because these trucks have diesel engines that, while more powerful, produce more pollution than gasoline engines. They also travel many more miles than passenger vehicles. California has lots of these trucks on the road because it has two of the busiest ports in the world at Los Angeles and Long Beach. Long Beach resident Theral Golden said the truck emissions rule is overdue but he wants officials to go further by downsizing the ports. \"We need additional relief,\" Golden said. Of the top 10 most ozone-polluted cities in the U.S., six are in California, according to the American Lung Association's State of the Air report. \"You can't overstate the importance of the actions taken in California today from a public health perspective,\" said Will Barrett, national senior director for clean air advocacy for the American Lung Association. Sam Wilson, an analyst with the Union of Concerned Scientists, said in a statement the technology is available to start transitioning toward electric trucks. \"We need this standard to accelerate the necessary phase-out of fossil-fueled trucks that are fouling our air,\" Wilson said. ___ Associated Press writer Adam Beam contributed to this report. ___ Sophie Austin is a corps member for the Associated Press\/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues. Follow Austin on Twitter: @sophieadanna","filter_flag":1}
{"title":"Ushering in the Next Generation of Climate Technology - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvbmV4dC1nZW5lcmF0aW9uLWNsaW1hdGUtbWl0aWdhdGlvbi10ZWNobm9sb2dpZXPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvbmV4dC1nZW5lcmF0aW9uLWNsaW1hdGUtbWl0aWdhdGlvbi10ZWNobm9sb2dpZXPSAQA?oc=5","id":"CBMiVWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvbmV4dC1nZW5lcmF0aW9uLWNsaW1hdGUtbWl0aWdhdGlvbi10ZWNobm9sb2dpZXPSAQA","guidislink":false,"published":"Tue, 18 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=108, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvbmV4dC1nZW5lcmF0aW9uLWNsaW1hdGUtbWl0aWdhdGlvbi10ZWNobm9sb2dpZXPSAQA?oc=5\" target=\"_blank\">Ushering in the Next Generation of Climate Technology<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Ushering in the Next Generation of Climate Technology - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvbmV4dC1nZW5lcmF0aW9uLWNsaW1hdGUtbWl0aWdhdGlvbi10ZWNobm9sb2dpZXPSAQA?oc=5\" target=\"_blank\">Ushering in the Next Generation of Climate Technology<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Climate technologies—technologies that accelerate decarbonization—are essential to limiting global warming. Despite the many attractive opportunities for investing in clean tech, global investments continue to fall short.1 1 “From Clean Tech 1.0 to Climate Tech 2.0: A New Era of Investment Opportunities,” B Capital Group, January 17, 2023, https:\/\/www.bcapgroup.com\/from-clean-tech-1-0-to-climate-tech-2-0-a-new-era-of-investment-opportunities\/. Notes: 1 “From Clean Tech 1.0 to Climate Tech 2.0: A New Era of Investment Opportunities,” B Capital Group, January 17, 2023, https:\/\/www.bcapgroup.com\/from-clean-tech-1-0-to-climate-tech-2-0-a-new-era-of-investment-opportunities\/. As a result, many of today’s companies lack the technologies they need to decarbonize their operations and value chains. At the current level of investment, the second wave of climate technology innovation will follow the long and winding path of wind and solar: scaling up and reducing carbon emissions over 20 to 30 years. But we do not have 20 to 30 years. To reduce emissions and avoid the worst impacts of climate change, we need to spend $3.5 trillion every year on climate technologies. Starting now. Public and philanthropic funding alone cannot fill this giant gap. But public and philanthropic funding combined with market-shaping mechanisms designed to accelerate the development and scaling of climate technologies can. (See “Executive Summary.”) EXECUTIVE SUMMARY To achieve global net zero by 2050, the global community must invest $3.5 trillion per year in emerging climate technologies, such as green hydrogen, clean steel, and long-duration energy storage. Emerging climate technologies often require significant amounts of capital with uncertain returns. Market-shaping mechanisms—such as innovative financing, climate-friendly legislation, and industry coalitions—reduce the investment risk. All companies, regardless of size or climate maturity, can play a role in creating a market for emerging climate technologies. To define their role in shaping the market and accelerating deployment of climate tech solutions, leaders should ask: What can my company do now? Define your decarbonization strategy; set tangible, actionable net-zero targets (rather than mere ambitions) and transition plans; issue advance market commitments, especially when you cannot act alone; and set sustainable financing commitments. What can my company do with industry partners now? Execute offtake agreements and volume guarantees, pool procurement of climate technologies, and join industry coalitions. What should I advocate for? Advocate for just transition incentives, support permitting reform, and engage with the public sector to steer future policy. The Power of Market Shaping Market shaping is a strategy used by companies, governments, and investors to address market failures and positively shape the development of a market. By coordinating actions with other stakeholders, organizations can address the bottlenecks and breakdowns that occur within a diverse ecosystem, distribute risk, and leverage purchasing power. In the case of climate technologies, market shaping has the potential to dramatically speed up the green revolution. Consider this. The global equity market cap is $120 trillion, and the global fixed-income market is another $120 trillion. By leveraging innovative market-shaping mechanisms, this huge pool of private capital that would otherwise go to less impactful investments can instead be directed into climate action. Private capital can be used to advance novel technologies faster, scale up proven solutions, and support adaptation and resilience to improve the lives of billions. A decade ago, we saw the power of market-shaping mechanisms in global health when governments and philanthropists committed $1.5 billion to GAVI, the Vaccine Alliance. This landmark public-private partnership accelerated development and production of pneumococcal vaccines by at least five years, saving over half a million lives. Public and philanthropic funding combined with market-shaping mechanisms are key to avoiding the worst impacts of climate change. The same sense of urgency and investment are needed to address the defining challenge of our time: climate change. Market-shaping activities are most effective when multiple players have a stake in the outcome, but limited incentives to act individually. Climate technology producers face uncertainties around the potential demand and willingness to pay for their products, while climate technology buyers can be reluctant to make long-term purchase commitments. Market-shaping mechanisms play a crucial role in creating the collective incentive for players across the climate technology value chain by derisking both demand-side and supply-side factors and encouraging economies of scale. We know what happens if we don’t invest aggressively in climate technologies. Recent models show that if we had invested $5 billion into solar in 1985, solar would have scaled—and started displacing carbon-intensive power eight years sooner.2 2 Financing the Clean Industrial Revolution, Breakthrough Energy, October 29, 2021, https:\/\/breakthroughenergy.org\/news\/financing-the-clean-industrial-revolution\/. Notes: 2 Financing the Clean Industrial Revolution, Breakthrough Energy, October 29, 2021, https:\/\/breakthroughenergy.org\/news\/financing-the-clean-industrial-revolution\/. The Challenges of Scaling Climate Technologies Strategic investments in climate technologies, combined with market-shaping activities, can accelerate the development and deployment of critical climate technologies. The aim of market shaping is to ensure high-potential technologies can successfully cross the so-called valley of death—the gap in funding that exists when companies want to transform a proven concept into a viable and affordable product. (See Exhibit 1.)","filter_flag":1}
{"title":"California approves phase-out of large diesel-powered trucks - Vijesti.me","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vZW4udmlqZXN0aS5tZS93b3JsZC9nbG9idXMvNjU0NDM4L0NhbGlmb3JuaWEtYXBwcm92ZXMtcGhhc2Utb3V0LW9mLWxhcmdlLWRpZXNlbC10cnVja3PSAVVodHRwczovL2VuLnZpamVzdGkubWUvYW1wLzY1NDQzOC9DYWxpZm9ybmlhLWFwcHJvdmVzLXBoYXNlLW91dC1vZi1sYXJnZS1kaWVzZWwtdHJ1Y2tz?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vZW4udmlqZXN0aS5tZS93b3JsZC9nbG9idXMvNjU0NDM4L0NhbGlmb3JuaWEtYXBwcm92ZXMtcGhhc2Utb3V0LW9mLWxhcmdlLWRpZXNlbC10cnVja3PSAVVodHRwczovL2VuLnZpamVzdGkubWUvYW1wLzY1NDQzOC9DYWxpZm9ybmlhLWFwcHJvdmVzLXBoYXNlLW91dC1vZi1sYXJnZS1kaWVzZWwtdHJ1Y2tz?oc=5","id":"CBMiXmh0dHBzOi8vZW4udmlqZXN0aS5tZS93b3JsZC9nbG9idXMvNjU0NDM4L0NhbGlmb3JuaWEtYXBwcm92ZXMtcGhhc2Utb3V0LW9mLWxhcmdlLWRpZXNlbC10cnVja3PSAVVodHRwczovL2VuLnZpamVzdGkubWUvYW1wLzY1NDQzOC9DYWxpZm9ybmlhLWFwcHJvdmVzLXBoYXNlLW91dC1vZi1sYXJnZS1kaWVzZWwtdHJ1Y2tz","guidislink":false,"published":"Sat, 29 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=119, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vZW4udmlqZXN0aS5tZS93b3JsZC9nbG9idXMvNjU0NDM4L0NhbGlmb3JuaWEtYXBwcm92ZXMtcGhhc2Utb3V0LW9mLWxhcmdlLWRpZXNlbC10cnVja3PSAVVodHRwczovL2VuLnZpamVzdGkubWUvYW1wLzY1NDQzOC9DYWxpZm9ybmlhLWFwcHJvdmVzLXBoYXNlLW91dC1vZi1sYXJnZS1kaWVzZWwtdHJ1Y2tz?oc=5\" target=\"_blank\">California approves phase-out of large diesel-powered trucks<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vijesti.me<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"California approves phase-out of large diesel-powered trucks - Vijesti.me","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vZW4udmlqZXN0aS5tZS93b3JsZC9nbG9idXMvNjU0NDM4L0NhbGlmb3JuaWEtYXBwcm92ZXMtcGhhc2Utb3V0LW9mLWxhcmdlLWRpZXNlbC10cnVja3PSAVVodHRwczovL2VuLnZpamVzdGkubWUvYW1wLzY1NDQzOC9DYWxpZm9ybmlhLWFwcHJvdmVzLXBoYXNlLW91dC1vZi1sYXJnZS1kaWVzZWwtdHJ1Y2tz?oc=5\" target=\"_blank\">California approves phase-out of large diesel-powered trucks<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vijesti.me<\/font>","source.href":"https:\/\/en.vijesti.me","source.title":"Vijesti.me","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Across the U.S., transportation contributes the largest share of greenhouse gas emissions, the EPA says, with medium- and heavy-duty trucks accounting for nearly a quarter of those emissions. Disclaimer: The translations are mostly done through AI translator and might not be 100% accurate. New diesel-powered tow trucks and buses will not be sold in California starting in 2036 - a new rule approved by its regulators this Sunday to wean the state off fossil fuels and fight climate change. That rule would refer to exhaust pollution from heavy trucks transporting goods through ports and would require companies to disclose how much they use those trucks as early as 2024. However, that rule cannot be applied without approval from the US Environmental Protection Agency (EPA). However, it is tied to standards the US government approved last month to phase out large diesel-powered box trucks, tow trucks and large buses. If the EPA approves the California rule, other states could later adopt the same standards. California Governor Gavin Newsom, a Democrat, said Friday's decision was an opportunity to \"show the world what real climate action looks like.\" \"We are one step closer to achieving healthier neighborhoods and cleaner air for all Californians,\" he said in a statement. California is approving ambitious emissions standards as part of its broader goal of achieving \"carbon neutrality,\" meaning by 2045 it will remove as much carbon as it emits. Air pollution regulators previously voted to require all new cars, trucks and SUVs to be electric or hydrogen-powered by 2035. And they banned the sale of new products powered by small internal combustion engines, including leaf blowers, lawn mowers and portable generators. The vote on truck emissions came as the California Air Resources Board on Thursday approved a rule to phase out decades-old diesel locomotives and transition to more zero-emissions technology for pogo trains that transport food, lumber, oil and other products. But some in the transportation industry are concerned that the rule will ultimately increase the cost of goods being transported. The American Trucking Association called the rule \"unrealistic.\" The group is concerned about how costly a drastic transition to zero-emission vehicles will be and says the infrastructure to charge such electric vehicles is not ready. \"As it becomes clear that California's rhetoric does not match the technology, we hope the Board will reverse course and allow transportation companies the freedom to choose the clean technologies that work best for their business,\" the group said in a statement. Gas emissions from trucks have been drastically reduced in recent decades, according to the announcement. More than 100 zero-emission truck models are available in North America, state regulators say, and more than 100 others are in production. California's new rule, combined with previous state-approved electric truck regulations, would mean more than 2048 million zero-emissions medium- and heavy-duty trucks operating in the state by 1,6. Across the U.S., transportation contributes the largest share of greenhouse gas emissions, the EPA says, with medium- and heavy-duty trucks accounting for nearly a quarter of those emissions. Heavy-duty vehicles make up about three percent of the vehicles on California's roads, but generate more than half of the nitrogen oxide and fine particulate pollution from diesel, according to the California Air Resources Board. This is because these trucks have diesel engines which, although more powerful than petrol engines, produce more pollution. They also travel much more than passenger vehicles. California has many of these trucks on the road because it has two of the busiest ports in the world: Los Angeles and Long Beach. Of the 10 most ozone-polluted US cities, six are in California, according to the American Pulmonologist Association's State of the Air Report. \"You cannot overstate the importance of the actions being taken in California today from a public health perspective,\" said Will Barrett, national senior director for the association. Sam Wilson, an analyst at the Union of Concerned Scientists, said in a statement that the technology is available to begin the transition to electric trucks. \"We need that standard to accelerate the necessary phase-out of fossil fuel trucks that pollute our air,\" Wilson said. Bonus video:","filter_flag":1}
{"title":"Austria launches $16 million rebate scheme for residential storage - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA0LzAzL2F1c3RyaWEtbGF1bmNoZXMtMTYtbWlsbGlvbi1yZWJhdGUtc2NoZW1lLWZvci1yZXNpZGVudGlhbC1zdG9yYWdlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA0LzAzL2F1c3RyaWEtbGF1bmNoZXMtMTYtbWlsbGlvbi1yZWJhdGUtc2NoZW1lLWZvci1yZXNpZGVudGlhbC1zdG9yYWdlL9IBAA?oc=5","id":"CBMiaWh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA0LzAzL2F1c3RyaWEtbGF1bmNoZXMtMTYtbWlsbGlvbi1yZWJhdGUtc2NoZW1lLWZvci1yZXNpZGVudGlhbC1zdG9yYWdlL9IBAA","guidislink":false,"published":"Mon, 03 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=93, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA0LzAzL2F1c3RyaWEtbGF1bmNoZXMtMTYtbWlsbGlvbi1yZWJhdGUtc2NoZW1lLWZvci1yZXNpZGVudGlhbC1zdG9yYWdlL9IBAA?oc=5\" target=\"_blank\">Austria launches $16 million rebate scheme for residential storage<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Austria launches $16 million rebate scheme for residential storage - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA0LzAzL2F1c3RyaWEtbGF1bmNoZXMtMTYtbWlsbGlvbi1yZWJhdGUtc2NoZW1lLWZvci1yZXNpZGVudGlhbC1zdG9yYWdlL9IBAA?oc=5\" target=\"_blank\">Austria launches $16 million rebate scheme for residential storage<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"From pv magazine Germany Austria has launched a new subsidy scheme for residential batteries. The Ministry of Climate Action and Energy is providing a total of €15 million ($16.1 million) to support the installation of new storage systems and the expansion of existing systems used in combination with renewable energy. Storage devices with storage capacities between 4 kWh and 50 kWh will be eligible for support. The flat-rate subsidy is €200\/kWh of usable storage capacity. Interested parties must initially register for the program on the Austrian Climate and Energy Fund website and then file for construction permits. The battery storage systems may not be ordered or set up prior to registration. Participants will have 24 months to complete their projects. Popular content The program states that the systems must be fully installed by authorized installers and the ratio of usable storage capacity must be at least 0.5 kWh per unit of installed renewables capacity. The battery storage systems must be operated for at least 10 years. “In Austria we already have technologically mature storage solutions that can be rolled out widely,” said Climate and Energy Fund Managing Director Bernd Vogl. “With the funding, we can manage to integrate these technologies into the system and improve the power supply in those regions where the grids are not sufficiently developed or where significantly more renewable electricity is produced than is used.”","filter_flag":1}
{"title":"Consumer Companies Must Innovate to Drive Impact on Climate - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvY29uc3VtZXItY29tcGFuaWVzLW5lZWQtaW5ub3ZhdGl2ZS1jbGltYXRlLWNoYW5nZS1zb2x1dGlvbnMtdG8tZHJpdmUtaW1wYWN00gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvY29uc3VtZXItY29tcGFuaWVzLW5lZWQtaW5ub3ZhdGl2ZS1jbGltYXRlLWNoYW5nZS1zb2x1dGlvbnMtdG8tZHJpdmUtaW1wYWN00gEA?oc=5","id":"CBMicWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvY29uc3VtZXItY29tcGFuaWVzLW5lZWQtaW5ub3ZhdGl2ZS1jbGltYXRlLWNoYW5nZS1zb2x1dGlvbnMtdG8tZHJpdmUtaW1wYWN00gEA","guidislink":false,"published":"Thu, 27 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=117, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvY29uc3VtZXItY29tcGFuaWVzLW5lZWQtaW5ub3ZhdGl2ZS1jbGltYXRlLWNoYW5nZS1zb2x1dGlvbnMtdG8tZHJpdmUtaW1wYWN00gEA?oc=5\" target=\"_blank\">Consumer Companies Must Innovate to Drive Impact on Climate<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Consumer Companies Must Innovate to Drive Impact on Climate - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvY29uc3VtZXItY29tcGFuaWVzLW5lZWQtaW5ub3ZhdGl2ZS1jbGltYXRlLWNoYW5nZS1zb2x1dGlvbnMtdG8tZHJpdmUtaW1wYWN00gEA?oc=5\" target=\"_blank\">Consumer Companies Must Innovate to Drive Impact on Climate<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Yet it’s one thing to say C&S is a priority—successful execution is another thing entirely. The CPG sector significantly lags other industries in what BCG calls “innovation readiness,” the underlying capabilities or “systems” that organizations deploy to generate new value propositions and profitably solve customer problems. According to our 2020 MIC findings, companies with mature innovation systems generate as much as 20% more innovation output than their peers. Concerned Consumers The lack of CPG preparedness is especially significant given consumers’ growing climate concerns—and the shift in their buying habits over the past few years. Approximately 80% of consumers say they think about sustainability in their day-to-day purchasing decisions. Also, according to the NYU Stern Center for Sustainable Business, between 2015 and 2021, sales of products marketed as sustainable grew 2.7 times faster than conventionally marketed products. However, today, only around 10% of CPG shoppers (8% to 18% across the categories we tested) say they purchase sustainable products or have sustainability in their top drivers of choice. This percentage could increase by up to 30% if CPG companies linked sustainability to other emotional and functional needs, such as quality or health. Other BCG research determined that 75% of consumers think that large companies must take the lead against climate change. Clearly, CPG companies must use this opportunity to raise the level of their sustainability efforts. Innovating on Three Levels Given the sheer size and complexity of the value chain, organizations that wish to achieve game-changing innovation in CPG must execute sustainability well at scale. This journey requires applying an innovation lens to three dimensions: products, customers, and advanced digital and AI tools. Improve Today’s Products and Invent Tomorrow’s As a first step toward greater sustainability, organizations should assess their product portfolio to identify the brands that can be made greener as well as those that require marketing to drive awareness and conversion. This is also the time to determine whether any brands should be divested because they don’t align with corporate sustainability ambitions. That move can help fund opportunities in existing brands as well as new categories with greater potential. Product-development teams can then make existing products greener by replacing unsustainable ingredients with sustainable ones. Yet while this approach can provide some quick wins, it won’t suffice over the long term. Based on our experience, re-engineering of current operations may achieve only about 30% to 40% of 2030 carbon goals; it is necessary to re-imagine the business model to close the gap, which will require both a transformational portfolio and consumer behavior change. Replacing unsustainable ingredients with sustainable ones won’t suffice over the long term. To create truly sustainable products in the future, companies need to develop new products based on new formulations. (See the sidebar on Nestlé and AB InBev.) Since the primary source of CPG emissions is Scope 3 (the value chain, especially upstream), organizations need to ensure that their suppliers meet sustainability standards. How Two Leading CPGs Are Using Innovation to Boost Sustainability across the Value Chain Leading CPG companies like Nestlé and AB InBev (ABI) have launched initiatives with the potential for large-scale impact as they put sustainability at the top of their ESG agenda, as well as their overall business agenda. Nestlé Nestlé, an acknowledged sustainability leader, is innovating in various ways to meet its dual ambitions of zero environmental impact in operations by 2030 and net-zero greenhouse-gas emissions by 2050. After determining the carbon footprint of its portfolio, the company has put more emphasis on expansion in the plant-based space, an important commercial and environmental opportunity. To make existing products carbon neutral, Nestlé has substituted ingredients and changed entire formulations. The company’s sustainable R&D accelerator and creative application of new R&D processes inspired the formulation used in brands such as Wunda, a pea-based milk alternative. Nestlé has also committed to making its product packaging 100% recyclable or reusable by 2025. In addition, it has shifted manufacturing to renewable energy and invested in more energy-efficient processes. And it has optimized routes and used low-emission fuels and rail transport. Together, these measures are projected to mitigate 14% of greenhouse-gas emissions associated with the projected 44 million tonnes of carbon-dioxide equivalents by 2030. To fill out its plant-based portfolio, Nestlé has also made some noteworthy acquisitions, including Garden Gourmet and Sweet Earth foods. In parallel, the company has sold its North American bottled-water business, a slow-growing business with a large environmental footprint, to fund investments in higher-growth categories. This slew of product innovations has been enabled by Nestlé’s leadership team. A top CEO priority, sustainably minded innovation receives sufficient resources and focus. Moreover, teams are encouraged to explore emerging categories and find applications for R&D developments across the Nestlé portfolio. For example, Nestlé is using lessons from Wunda to develop other innovations in the dairy-alternative space. By embedding sustainability every step of the way, Nestlé is driving both incremental and game-changing innovation—and raising the bar in the process. ABI To help address the growing global demand for food and the pressure this is putting on natural resources, ABI is leveraging its brewing expertise to find new ways of sourcing food sustainably. In addition to rolling out many incremental innovations, ABI has launched ventures that develop new-to-world technologies. One of its startups, EverGrain, is developing a technology that extracts the proteins and fibers from brewing grains to create nutrient-rich ingredients for use in protein shakes, breads, and milk alternatives. Another startup, BioBrew, is using ABI’s fermentation knowledge to scale production of alternative proteins. ABI’s ventures are expected to help reduce crop- and livestock-related carbon emissions from food production while providing access to new markets Nestlé, an acknowledged sustainability leader, is innovating in various ways to meet its dual ambitions of zero environmental impact in operations by 2030 and net-zero greenhouse-gas emissions by 2050. After determining the carbon footprint of its portfolio, the company has put more emphasis on expansion in the plant-based space, an important commercial and environmental opportunity.To make existing products carbon neutral, Nestlé has substituted ingredients and changed entire formulations. The company’s sustainable R&D accelerator and creative application of new R&D processes inspired the formulation used in brands such as Wunda, a pea-based milk alternative.Nestlé has also committed to making its product packaging 100% recyclable or reusable by 2025. In addition, it has shifted manufacturing to renewable energy and invested in more energy-efficient processes. And it has optimized routes and used low-emission fuels and rail transport.Together, these measures are projected to mitigate 14% of greenhouse-gas emissions associated with the projected 44 million tonnes of carbon-dioxide equivalents by 2030.To fill out its plant-based portfolio, Nestlé has also made some noteworthy acquisitions, including Garden Gourmet and Sweet Earth foods. In parallel, the company has sold its North American bottled-water business, a slow-growing business with a large environmental footprint, to fund investments in higher-growth categories.This slew of product innovations has been enabled by Nestlé’s leadership team. A top CEO priority, sustainably minded innovation receives sufficient resources and focus. Moreover, teams are encouraged to explore emerging categories and find applications for R&D developments across the Nestlé portfolio. For example, Nestlé is using lessons from Wunda to develop other innovations in the dairy-alternative space.By embedding sustainability every step of the way, Nestlé is driving both incremental and game-changing innovation—and raising the bar in the process.To help address the growing global demand for food and the pressure this is putting on natural resources, ABI is leveraging its brewing expertise to find new ways of sourcing food sustainably. In addition to rolling out many incremental innovations, ABI has launched ventures that develop new-to-world technologies.One of its startups, EverGrain, is developing a technology that extracts the proteins and fibers from brewing grains to create nutrient-rich ingredients for use in protein shakes, breads, and milk alternatives. Another startup, BioBrew, is using ABI’s fermentation knowledge to scale production of alternative proteins.ABI’s ventures are expected to help reduce crop- and livestock-related carbon emissions from food production while providing access to new markets . This is a huge undertaking, requiring bold experimentation with supply-chain and sourcing models. Companies will need to expand their roster of partners. They will also need to change relationships with existing partners to active collaborations where companies share product-development expertise and work with suppliers to develop sustainable practices. Since CPG companies are positioned to be the steward of the value chain, they need to engage with partners to drive broader impact. Guinness, for example, recently launched a regenerative-agriculture pilot in Ireland to reduce the carbon emissions from producing barley, a key raw material. Working with farmers and other suppliers, Guinness expects to see improvements in soil health and water quality, as well as enhanced biodiversity. Help Consumers Change Their Behaviors While these efforts will go a long way, innovation in CPG won’t be able to maximize the impact of decarbonization measures unless consumers take a more active role. Yet while consumers are increasingly concerned about the climate crisis, many have not yet incorporated sustainability into their everyday behaviors, and many are confused about their role (around 20% say that individuals have a role to play in climate change). Companies, therefore, need to activate consumer behaviors that will stick. One solution is to innovate and commercialize products in a way that resonates deeply with potential buyers, understanding their core needs and barriers to ensure that sustainable products address them. To maximize the impact of decarbonization measures, companies need to activate consumer behaviors that will stick. That is exactly what Reckitt Benckiser’s Finish did in 2020, when the maker of dishwashing products launched “Skip the Rinse,” a campaign that aimed to drive growth and also conserve water by encouraging consumers not to pre-rinse their dishes. Reckitt innovated its product, and the key benefit was that busy families could save time and effort while effectively cleaning their dishes, which appealed to a much broader audience than sustainability alone. As an added benefit, for every consumer who pledged to #skiptherinse, Finish agreed to donate $1 to The Nature Conservancy. In less than two years, more than 20 million gallons of water were conserved. In addition, Finish drove share growth and increased marketing ROI. Deploy Next-Generation Digital and AI Tools Advanced analytics driven by AI provide the transparency that’s necessary for identifying the C&S leads with the greatest likelihood of success. These next-generation tools include machine learning, natural-language processing, and geo-mapping, Unlike traditional methods, advanced analytics allow an organization to combine multiple data sources to identify potential targets across multiple sectors globally and further upstream. Moreover, they enable the automated scraping of websites and social media to identify business signals (triggers) in areas of the organization’s choosing, such as environmental, social, and governance (ESG). Third, they help to quickly narrow down searches to a short list of the most promising opportunities. No less important, these tools enable traceability, both for companies that wish to monitor the greenness of their suppliers and for consumers who want to know whether the product they’re thinking of purchasing has green roots. Advanced analytics can help identify C&S leads and enable traceability. Given both the immensity of the C&S opportunity and our relative nascency in addressing it, advanced analytics and AI tools (including machine learning, natural-language processing, and geo-mapping) can help drive impact at critical junctures across the innovation value chain. Companies deploying these tools will be better able to surface valuable insights, prioritize the innovation focus, explore the C&S implications of potential product features during the design stage, and identify emerging technologies and partners to add to their innovation ecosystems. In all likelihood, CPG companies will play a central role in the ultimate success or failure of the C&S effort. Therefore, it’s only fitting that they use this role to bring us closer to a decarbonized future. By applying an innovative lens to the sustainability agenda, companies can create value—for the environment, for consumers, and for themselves. But to create a real sustainability advantage, organizations must act now, before this source of differentiation evaporates.","filter_flag":1}
{"title":"Plastic-free produce: Are supermarkets and shoppers ready for loose fruit and veg? - Grocery Gazette","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3Lmdyb2NlcnlnYXpldHRlLmNvLnVrLzIwMjMvMDQvMTIvcGxhc3RpYy1sb29zZS1mcnVpdC12ZWcv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3Lmdyb2NlcnlnYXpldHRlLmNvLnVrLzIwMjMvMDQvMTIvcGxhc3RpYy1sb29zZS1mcnVpdC12ZWcv0gEA?oc=5","id":"CBMiRGh0dHBzOi8vd3d3Lmdyb2NlcnlnYXpldHRlLmNvLnVrLzIwMjMvMDQvMTIvcGxhc3RpYy1sb29zZS1mcnVpdC12ZWcv0gEA","guidislink":false,"published":"Wed, 12 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=102, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3Lmdyb2NlcnlnYXpldHRlLmNvLnVrLzIwMjMvMDQvMTIvcGxhc3RpYy1sb29zZS1mcnVpdC12ZWcv0gEA?oc=5\" target=\"_blank\">Plastic-free produce: Are supermarkets and shoppers ready for loose fruit and veg?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Grocery Gazette<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Plastic-free produce: Are supermarkets and shoppers ready for loose fruit and veg? - Grocery Gazette","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3Lmdyb2NlcnlnYXpldHRlLmNvLnVrLzIwMjMvMDQvMTIvcGxhc3RpYy1sb29zZS1mcnVpdC12ZWcv0gEA?oc=5\" target=\"_blank\">Plastic-free produce: Are supermarkets and shoppers ready for loose fruit and veg?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Grocery Gazette<\/font>","source.href":"https:\/\/www.grocerygazette.co.uk","source.title":"Grocery Gazette","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"The pushback against unnecessary plastic packaging has been growing for some time, with supermarkets and food brands falling over themselves to announce their latest new plastic-free packaging innovation. Admittedly, not all of them have been well-received (we’re looking at you, Sainsbury’s…), but it’s common knowledge that humans need to cut down on single-use plastic. Despite this, supermarket fruit and veg aisles still feature row upon row of apples, bananas and other fresh produce, all tightly wrapped in plastic packaging. However, this might not be the case for much longer. Currently, some fresh produce can be found both loose and packaged – but climate action organisations are calling for this to be applied across the board, with the ultimate goal of eliminating plastic packaging entirely. The move would remove an estimated 1.7 billion pieces of plastic packaging from usage, avoid over 77,000 tonnes of food being wasted, and save shoppers a combined total of over £85 million in uneaten food. It’s hard to argue against the idea. But despite the hugely positive impact the move would have, consumers remain reluctant to take it up. Although loose food is not a new thing (hello ‘pick and mix’), it seems that when the same rule is applied to fruit and veg, shoppers aren’t quite as keen on the idea, citing a range of concerns including hygiene and cost. Is the goal a realistic one for the grocery sector? What are the current targets? While climate action NGO Wrap originally hoped that 80% of packaging on fresh fruit and veg could be removed by 2025, last week it updated this estimation, cutting back plans to a new goal of 30% by 2025. Industry experts said the initial target was too ambitious and that supermarkets would not be able to deliver. Under the new industry pathway, retailers are encouraged to work towards each target as a minimum. Specifically looking to change the way apples, aubergines, avocados, bananas, broccoli, cabbages, carrots, ginger, garlic, lemons, limes, mangos, onions, oranges, parsnips, pears, peppers, potatoes, squash, swede and salad tomatoes are purchased, the first target wants supermarkets to be selling at least one line across each of these items loose, if two or more types of that product are stocked. By the end of 2024, this will be applied to each produce line, rising to 30% of all uncut fresh produce volume sales in store loose by 2025. By the end of 2030, the aim is for this to extend to 50%. “Nobody wants to see good food go to waste or add to the tide of plastic packaging which blights our streets and beautiful countryside,” Defra minister, Rebbeca Pow says. “This ambitious new initiative will help to tackle both these issues and builds on recent government efforts in this area.” Fresh Produce Consortium regulation and communications manager, Kelly Shields adds that Wrap’s pathways, which comes ahead of GB legislative requirements, “show pro-active commitment from the fresh produce industry”. Wrap’s research found that if plastic packaging was removed from the top five most wasted fresh fruit and veg products alone, 100,000 tonnes of food waste could be prevented. What are supermarkets doing and is it enough? Many convenience stores and discount grocers are unable to offer loose products, with just 15% of fruit and veg sales currently coming from loose products. This is for a number of reasons; not least the lack of weighing facilities. It’s a different story at the larger supermarkets though, where a Waitrose spokesperson told Grocery Gazette that it remains on target to meet Wrap’s 2030 ambition. “Our loose fruit and veg remain a popular choice. We’re working hard to increase our packaging-free selection, whilst also offering great value products that meet our high standards on quality and taste.” As active members of the Wrap working group which “explores opportunities to reduce packaging and offer more loose products, without affecting product quality or longevity”, Asda is also pushing forward with plastic-free produce. A spokesperson revealed the supermarket is “currently trialling more loose produce lines” at its trial store in Leeds, “to see if more can be rolled out across all our stores as we look towards the 50% target by 2030”. Sainsbury’s also told Grocery Gazette it is “committed to reducing our own-brand plastic packaging by 50% by 2025 by removing any unnecessary plastic packaging where possible”. However, the Big 4 grocer acknowledged customer concerns, adding that packaging “plays a vital role” in keeping the supermarkets food “safe and fresh.” “Since 2019 we have implemented a range of initiatives including removing single use plastic bags from loose fruit and veg. We will continue to work with Wrap to meet the targets set out in the UK Plastics Pact,” the spokesperson added. Despite this, City to Sea head of campaigns Jo Morley doesn’t think that supermarkets are doing enough, pointing out that removing plastic packaging from fruit and veg “is nothing new,” adding “it’s already happening in France and other countries in Europe.” France has already banned 30 fruits and vegetables from being wrapped in plastic packaging and Spain, Portugal and Luxembourg are set to follow later this year. Morley says supermarkets need to help customers to “choose loose”. While Everyday Plastic founder and director, Daniel Webb admits that removing packaging from fruit and veg is a “big and complex task,” he says that the pledges made by supermarkets in the Wrap report are “just another set of unambitious, voluntary commitments”. “They are not acting urgently enough nor seeing how huge this opportunity is for pioneering and positive change. Together, we must help shoppers to save plastic, money, and food waste by encouraging them to choose loose.” Are shoppers ready to go plastic-free? Although supermarkets are moving in the right direction, TGW Logistics Group vice president, James Osborn says that shoppers are “just not ready” for the move yet. He cites the top reason for this as hygiene. A recent survey by Everyday Plastic and Find Out Now also confirmed that hygiene is one of the major concerns that many shoppers have about buying loose fresh produce, particularly in the wake of the Covid-19 pandemic. Osborn suggests that a “medium term solution” could be “more sustainable products for movement and reuse or recycling.” He suggests that rather than scrapping packaging entirely, the industry could instead explore new products and materials that “minimise our impact on the environment”, but still meet “challenging physical demands”. Other concerns include produce longevity and cost, with many assuming (wrongly) that loose produce is more expensive. Research from Wrap also shows that plastic packaging does not actually help to prolong the life of uncut fresh fruit, and that refrigeration is more effective. Former Friends of the Earth campaigner and Everyday Plastic board member, Julian Kirby points out that by making loose fruit and veg more expensive, supermarkets are “penalising people who want to do the right thing”. He adds that “rather than helping customers say no to pointless plastic, it appears supermarkets are actively encouraging them to buy more”. While the efforts of Wrap and other environmental organisations certainly haven’t gone unnoticed by retailers, it’s also clear that more can be done. If each of the UK’s leading supermarkets were able to maintain 50% of uncut fresh produce sales in store loose by 2030, that would be an undeniable achievement for the industry. However, with that goal still seven years away, it also gives supermarkets no excuse in not encouraging, educating and incentivising consumers to get on board with this more sustainable way of shopping.","filter_flag":1}
{"title":"SFST's speech at High-level Dialogue cum Dinner - \"Hong Kong's Unique Position as the Green Finance and Fintech ... - info.gov.hk","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vd3d3LmluZm8uZ292LmhrL2dpYS9nZW5lcmFsLzIwMjMwNC8xNC9QMjAyMzA0MTMwMDM0Ni5odG3SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vd3d3LmluZm8uZ292LmhrL2dpYS9nZW5lcmFsLzIwMjMwNC8xNC9QMjAyMzA0MTMwMDM0Ni5odG3SAQA?oc=5","id":"CBMiQGh0dHBzOi8vd3d3LmluZm8uZ292LmhrL2dpYS9nZW5lcmFsLzIwMjMwNC8xNC9QMjAyMzA0MTMwMDM0Ni5odG3SAQA","guidislink":false,"published":"Thu, 13 Apr 2023 02:00:10 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=13, tm_hour=2, tm_min=0, tm_sec=10, tm_wday=3, tm_yday=103, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vd3d3LmluZm8uZ292LmhrL2dpYS9nZW5lcmFsLzIwMjMwNC8xNC9QMjAyMzA0MTMwMDM0Ni5odG3SAQA?oc=5\" target=\"_blank\">SFST's speech at High-level Dialogue cum Dinner - \"Hong Kong's Unique Position as the Green Finance and Fintech ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">info.gov.hk<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"SFST's speech at High-level Dialogue cum Dinner - \"Hong Kong's Unique Position as the Green Finance and Fintech ... - info.gov.hk","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vd3d3LmluZm8uZ292LmhrL2dpYS9nZW5lcmFsLzIwMjMwNC8xNC9QMjAyMzA0MTMwMDM0Ni5odG3SAQA?oc=5\" target=\"_blank\">SFST's speech at High-level Dialogue cum Dinner - \"Hong Kong's Unique Position as the Green Finance and Fintech ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">info.gov.hk<\/font>","source.href":"https:\/\/www.info.gov.hk","source.title":"info.gov.hk","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Following is the speech by the Secretary for Financial Services and the Treasury, Mr Christopher Hui, at the High-level Dialogue cum Dinner - \"Hong Kong's Unique Position as the Green Finance and Fintech Capital of Asia\" in Brussels, Belgium, yesterday (April 13, Brussels time):Distinguished guests, ladies and gentlemen,Good evening and hello from Hong Kong! I am very excited to be here in Brussels, which is the first stop for my trip this time in Europe. I am happy to tell you that Hong Kong has fully returned to normalcy, and I would like to take the opportunity tonight to share with you our latest development in financial services, in particular green finance and fintech.Green financeReducing carbon emissions and realising sustainable development are high priorities for governments, institutions and communities all over the world. I noticed that the EU (European Union) sets out a \"Fit for 55\" package, which is a set of proposals to revise and update EU legislation and to put in place new initiatives with the aim of ensuring that EU policies are in line with the climate goals agreed by the Council and the European Parliament. The European climate law makes reaching the EU's climate goal of reducing EU emissions by at least 55 per cent by 2030 a legal obligation. EU countries are working on new legislation to achieve this goal and make the EU climate-neutral by 2050.Hong Kong earnestly shares the global vision in pursuit of a greener world. Our country is advancing towards the \"3060 Dual Carbon Targets\". The HKSAR (Hong Kong Special Administrative Region) Government also announced Hong Kong's Climate Action Plan 2050 in October 2021, targeting to reduce Hong Kong's carbon emissions by 50 per cent before 2035 and achieve carbon neutrality before 2050. Behind the recent Budget's numbers and initiatives is the importance the HKSAR Government places on high-quality development, and that includes transformation to a green economy. We will also position Hong Kong as an international centre for green tech and green finance.The global pursuit to carbon neutrality has created a huge demand for innovative and technological solutions to reduce, mitigate or offset carbon emission, ranging from environmental engineering and carbon sequestration to the production of more environmentally friendly products.The global market for green technology is forecast to reach more than US$410 billion by 2030. That is more than 11 times the total from just two years ago. The opportunities for green finance are hence boundless. It has been estimated that the green financing needs in Asia alone would reach US$66 trillion for the next three decades. For Mainland China alone, US$14.5 trillion.Hong Kong is a leading player in green finance. In 2022, green and sustainable debts arranged or issued in Hong Kong amounted to over US$80.5 billion. The HKSAR Government has issued nearly US$16 billion government green bonds since 2019, including US$2.5 billion (HK$20 billion) retail green bond in May last year, as well as US$101 million (HK$800 million) tokenised green bond in February this year, the first of its kind released anywhere in the world by a government, as our attempt to further entrench the awareness of sustainability issues in combination with technology.We are establishing a Green Technology and Finance Development Committee, which will be tasked to work out an action agenda on a number of areas, namely:(a) building a green technology ecosystem to attract top-notch enterprises or start-ups to set up their operations in Hong Kong;(b) continuing to develop green financing, helping green projects and companies get the capital they need faster and easier;(c) promoting green certification and green standard setting and converging the Mainland and international standards;(d) nurturing talents, through providing local training as well as attracting talents from all over the world; and(e) enhancing collaboration with the Guangdong-Hong Kong-Macao Greater Bay Area (GBA) and the international markets.Moreover, the launch of Core Climate by the Hong Kong Exchanges and Clearing Limited last October for the trading of international voluntary carbon credits signifies a critical step forward in the development of carbon marketplace in Hong Kong. Carbon credits on the platform come from internationally certified carbon projects from around the world, including carbon avoidance, reduction and removal projects. All projects listed on Core Climate are verified against international standards.FintechTurning to Fintech development in Hong Kong. The Fintech landscape in Hong Kong is incredibly diverse and dynamic. We are now home to over 800 fintech companies and over 3 900 start-ups, offering a wide range of innovative services such as mobile payments, cross-border transfers, intelligent financial consultancy, wealth management, virtual asset trading, and blockchain. We were the pioneers in issuing virtual bank and virtual insurance company licences. Currently, we have eight such banks and four such insurance companies.Talking about insurance, the HKSAR Government issued the Development Roadmap for the Insurance Sector in Hong Kong in December last year, which outlines our visions and missions in developing the insurance sector, including:(a) to sharpen our competitive edge as a global risk management centre, and boost the synergies between different financial sectors to provide holistic risk and wealth management solutions facing a global clientele;(b) to enlarge the market accessible by our insurance sector through proactive policy initiatives and facilitative legislation;(c) to achieve balanced development of long-term and general businesses, strengthening Hong Kong as a sophisticated insurance hub;(d) to leverage on our unique advantages under the \"one country, two systems\" principle and integrate the insurance sector into national development riding on the \"Dual Circulation\" strategy; and(e) to give full play to the distinctive role of insurance in providing comprehensive risk management and mitigation solutions to all members of the public, thereby unleashing its social value.In fact, insurtech is a field that we strive to foster in Hong Kong. Our Insurance Authority has launched the Fast Track and Insurtech Sandbox in this regard to facilitate the insurtech development in Hong Kong. We observe that traditional insurers are seeking partnership with insurtech start-ups or technology providers to develop new products, models and tools, covering various aspects of the insurance value chain. From the Insurtech Survey done earlier, about 70 per cent of insurers would sustain investment in insurtech over the next three years.Hong Kong has one of the highest consumer fintech adoption rates (67 per cent) in the world, ranking above markets including France, the US (United States) and Japan. It also has a high B2B adoption rate of fintech with 66 per cent of fintech companies focusing on the B2B market. The city also serves as a platform for Mainland China, the world's top consumer market for fintech, with 51 per cent of companies operating or planning to expand in the GBA.To facilitate the incubation of innovative financial products, we launched the Fintech Proof-of-Concept Subsidy Scheme (PoC Subsidy Scheme) in February 2021, granting subsidies to fintech institutions to partner with financial institutions to test new and practical fintech solutions. A new round of PoC Subsidy Scheme was also rolled out in September 2022, and the scheme has been expanded to research institutions. The two rounds of schemes have approved over 140 projects.I would also like to talk more about virtual assets. I understand that the EU has reached agreement on groundbreaking Markets in Crypto-Assets rules for licensing and supervision. In fact, in October last year, we also published a Policy Statement on Development of Virtual Assets in Hong Kong, which sets out policy stance and approach towards developing a vibrant sector and ecosystem for virtual assets in Hong Kong. We will put in place timely and necessary guardrails to mitigate actual and potential risks in line with international standards, so that virtual asset innovations can thrive in Hong Kong in a sustainable manner. We have passed the legislation to introduce a licensing regime for virtual asset service providers with a view to ensuring that relevant services and service providers will be subject to appropriate supervision. Moreover, we have so far three crypto asset ETFs (exchange-traded funds) listed in Hong Kong, representing average daily turnover of about HK$7 million in February 2023.Hong Kong has what it takes to rise as a world leader in green finance and fintech to support an integrated and dynamic green industry cluster with a complete value chain.Both the EU and Hong Kong are pioneers in the area of green finance and we understand how new financial technologies facilitate access to financial services and improve the efficiency of the financial system for better development of green economy despite challenges under the worsening macroeconomic environment.We look forward to collaborating with the EU to promote a better greener world by making use of technology. We welcome EU enterprises and talent to collaborate with Hong Kong in fintech, a force for growth in financial services sector, towards the direction of sustainable finance and development.Thank you very much. Ends\/Friday, April 14, 2023 Issued at HKT 10:00 NNNN","filter_flag":1}
{"title":"Crown Coaches invests in Viva Energy carbon neutral diesel | News - Australasian Bus and Coach","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmJ1c25ld3MuY29tLmF1L2luZHVzdHJ5LW5ld3MvMjMwNC9jcm93bi1jb2FjaGVzLWludmVzdHMtaW4tdml2YS1lbmVyZ3ktY2FyYm9uLW5ldXRyYWwtZGllc2VsL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmJ1c25ld3MuY29tLmF1L2luZHVzdHJ5LW5ld3MvMjMwNC9jcm93bi1jb2FjaGVzLWludmVzdHMtaW4tdml2YS1lbmVyZ3ktY2FyYm9uLW5ldXRyYWwtZGllc2VsL9IBAA?oc=5","id":"CBMiaWh0dHBzOi8vd3d3LmJ1c25ld3MuY29tLmF1L2luZHVzdHJ5LW5ld3MvMjMwNC9jcm93bi1jb2FjaGVzLWludmVzdHMtaW4tdml2YS1lbmVyZ3ktY2FyYm9uLW5ldXRyYWwtZGllc2VsL9IBAA","guidislink":false,"published":"Thu, 27 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=117, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmJ1c25ld3MuY29tLmF1L2luZHVzdHJ5LW5ld3MvMjMwNC9jcm93bi1jb2FjaGVzLWludmVzdHMtaW4tdml2YS1lbmVyZ3ktY2FyYm9uLW5ldXRyYWwtZGllc2VsL9IBAA?oc=5\" target=\"_blank\">Crown Coaches invests in Viva Energy carbon neutral diesel | News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Australasian Bus and Coach<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Crown Coaches invests in Viva Energy carbon neutral diesel | News - Australasian Bus and Coach","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmJ1c25ld3MuY29tLmF1L2luZHVzdHJ5LW5ld3MvMjMwNC9jcm93bi1jb2FjaGVzLWludmVzdHMtaW4tdml2YS1lbmVyZ3ktY2FyYm9uLW5ldXRyYWwtZGllc2VsL9IBAA?oc=5\" target=\"_blank\">Crown Coaches invests in Viva Energy carbon neutral diesel | News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Australasian Bus and Coach<\/font>","source.href":"https:\/\/www.busnews.com.au","source.title":"Australasian Bus and Coach","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Image: Viva Energy Australia The Melbourne operator has made a major step towards fulfilling carbon emissions reduction commitment, courtesy of Viva Energy Australia In an industry-leading step towards a lower carbon future, Melbourne coach and bus operator Crown Coaches has signed on with Viva Energy to fuel its entire fleet with opt-in Carbon Neutral Diesel, a product certified by Climate Active. Crown Coaches has always had a focus on a sustainable future, with long-term investment in the most efficient vehicles for its bus and coach services. The choice to use opt-in Carbon Neutral Diesel is the next step in its journey towards a low or zero carbon future. Viva Energy’s Carbon Solutions team works with a range of industry sectors to help customers with their decarbonisation journey and has been pivotal in the introduction of Climate Active-certified opt-in carbon neutral products. Climate Active is an ongoing partnership between the federal government and Australian business to drive voluntary climate action. Viva Energy’s Chief Business Development and Sustainability Officer Lachlan Pfeiffer says the move to use opt-in carbon neutral fuels is expected to become an important transitional solution for more businesses as they embark on their decarbonisation journey. “We recognise that customers have a complex journey ahead of them to decarbonise their businesses, especially when they have fleets of heavy vehicles reliant on traditional fossil fuel products,” Pfeiffer says. RELATED ARTICLE: Viva Energy hydrogen super station to begin work in Geelong this year “Our Carbon Solutions team has been working with commercial customers to navigate their way to a lower carbon future with a range of new products and solutions.” Pfeiffer says that while new low-emission technologies such as hydrogen and EVs are on the way, transitional solutions are needed to lower the net carbon intensity for existing vehicles. “That is why products like opt-in Carbon Neutral Diesel and other low carbon fuels can help customers in the short and medium term to meet their decarbonisation goals,” he says. “We have a range of customers talking to us about these products across industries such as mining, construction, marine and heavy trucking.” Crown Coaches Business Development Manager Ivan Furlanetto says the company has been looking for opportunities to be more efficient and contribute to environmentally sustainable solutions. He says Crown started talking to Viva Energy about low-carbon fuel options after hearing a presentation at the Victorian Transport Association Alternative Fuel Summit last year. “Viva Energy was talking about a range of low carbon pathways, including carbon neutral fuels, and we saw this as an important step towards reducing our carbon footprint,” Furlanetto says. “We’ve been working on this with Viva Energy since January this year and have been using their opt-in Carbon Neutral Diesel fuel in all our vehicles. We see this as a bridging solution while we continue to transition our bus fleet to fully electric vehicles over the next few years. “The carbon credits used in offsetting the emissions associated with our diesel use are purchased and retired by Viva Energy on our behalf. “We are a local company and wanted this to have a local impact so we selected to use exclusively Australian Carbon Credit Units (ACCU’s) so we knew the purchase of this fuel was supporting Australian carbon projects.” Viva Energy is continuing to explore the introduction of new low carbon fuels, products and infrastructure to address the needs of its customers. These include fuels produced from alternative feedstocks, hydrogen refuelling and EV charging amongst others. Viva Energy’s New Energies Service Station, being developed in Geelong, will offer fast hydrogen refuelling for heavy vehicles as well as diesel and electric charging facilities – all co-located at one of the first publicly accessible refuelling sites of its kind in Australia. The site is due to begin construction in late 2023.","filter_flag":1}
{"title":"Viva Energy launches opt-in Carbon Neutral Diesel program - Big Rigs","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vYmlncmlncy5jb20uYXUvMjAyMy8wNC8yNi92aXZhLWVuZXJneS1sYXVuY2hlcy1vcHQtaW4tY2FyYm9uLW5ldXRyYWwtZGllc2VsLXByb2dyYW0v0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vYmlncmlncy5jb20uYXUvMjAyMy8wNC8yNi92aXZhLWVuZXJneS1sYXVuY2hlcy1vcHQtaW4tY2FyYm9uLW5ldXRyYWwtZGllc2VsLXByb2dyYW0v0gEA?oc=5","id":"CBMiXGh0dHBzOi8vYmlncmlncy5jb20uYXUvMjAyMy8wNC8yNi92aXZhLWVuZXJneS1sYXVuY2hlcy1vcHQtaW4tY2FyYm9uLW5ldXRyYWwtZGllc2VsLXByb2dyYW0v0gEA","guidislink":false,"published":"Wed, 26 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=116, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vYmlncmlncy5jb20uYXUvMjAyMy8wNC8yNi92aXZhLWVuZXJneS1sYXVuY2hlcy1vcHQtaW4tY2FyYm9uLW5ldXRyYWwtZGllc2VsLXByb2dyYW0v0gEA?oc=5\" target=\"_blank\">Viva Energy launches opt-in Carbon Neutral Diesel program<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Big Rigs<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Viva Energy launches opt-in Carbon Neutral Diesel program - Big Rigs","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vYmlncmlncy5jb20uYXUvMjAyMy8wNC8yNi92aXZhLWVuZXJneS1sYXVuY2hlcy1vcHQtaW4tY2FyYm9uLW5ldXRyYWwtZGllc2VsLXByb2dyYW0v0gEA?oc=5\" target=\"_blank\">Viva Energy launches opt-in Carbon Neutral Diesel program<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Big Rigs<\/font>","source.href":"https:\/\/bigrigs.com.au","source.title":"Big Rigs","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Viva Energy’s Carbon Solutions team works with a range of industry sectors to help customers with their decarbonisation journey and has been pivotal in the introduction of Climate Active-certified opt-in carbon neutral products. Climate Active is an ongoing partnership between the Australian Government and Australian business to drive voluntary climate action. Viva Energy’s chief business development and sustainability officer, Lachlan Pfeiffer, said the move to use opt-in carbon neutral fuels is expected to become an important transitional solution for more businesses as they embark on their decarbonisation journey. “We recognise that customers have a complex journey ahead of them to decarbonise their businesses, especially when they have fleets of heavy vehicles reliant on traditional fossil fuel products,” Pfeiffer said. “Our Carbon Solutions team has been working with commercial customers to navigate their way to a lower carbon future with a range of new products and solutions.” Pfeiffer added that while new low-emission technologies such as hydrogen and EVs are on the way, transitional solutions are needed to lower the net carbon intensity for existing vehicles. “That is why products like opt-in Carbon Neutral Diesel and other low carbon fuels can help customers in the short and medium term to meet their decarbonisation goals. We have a range of customers talking to us about these products across industries such as mining, construction, marine and heavy trucking,” he said. Crown Coaches is the first customer to sign on for Viva Energy’s Carbon Neutral Diesel. Business development manager Ivan Furlanetto said the company has been looking for opportunities to be more efficient and contribute to environmentally sustainable solutions. He said Crown started talking to Viva Energy about low-carbon fuel options after hearing a presentation at the Victorian Transport Association (VTA) Alternative Fuel Summit last year. “Viva Energy was talking about a range of low carbon pathways, including carbon neutral fuels, and we saw this as an important step towards reducing our carbon footprint,” Furlanetto said. “We’ve been working on this with Viva Energy since January this year, and have been using their opt-in Carbon Neutral Diesel fuel in all our vehicles. We see this as a bridging solution while we continue to transition our bus fleet to fully electric vehicles over the next few years.” “The carbon credits used in offsetting the emissions associated with our diesel use are purchased and retired by Viva Energy on our behalf. We are a local company and wanted this to have a local impact so we selected to use exclusively Australian Carbon Credit Units (ACCU’s) so we knew the purchase of this fuel was supporting Australian carbon projects.” Viva Energy is continuing to explore the introduction of new low carbon fuels, products and infrastructure to address the needs of its customers. These include fuels produced from alternative feedstocks, hydrogen refuelling and EV charging amongst others. Viva Energy’s New Energies Service Station, being developed in Geelong, will offer fast hydrogen refuelling for heavy vehicles as well as diesel, and electric charging facilities – all co-located at one of the first publicly accessible refuelling sites of its kind in Australia. The site is due to begin construction in late 2023.","filter_flag":1}
{"title":"The Battle for Net Zero Will Be Won or Lost in Asia - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYmF0dGxlLWZvci1uZXQtemVyby13b24tb3ItbG9zdC1pbi1hc2lh0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYmF0dGxlLWZvci1uZXQtemVyby13b24tb3ItbG9zdC1pbi1hc2lh0gEA?oc=5","id":"CBMiTWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYmF0dGxlLWZvci1uZXQtemVyby13b24tb3ItbG9zdC1pbi1hc2lh0gEA","guidislink":false,"published":"Fri, 21 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=111, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYmF0dGxlLWZvci1uZXQtemVyby13b24tb3ItbG9zdC1pbi1hc2lh0gEA?oc=5\" target=\"_blank\">The Battle for Net Zero Will Be Won or Lost in Asia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Battle for Net Zero Will Be Won or Lost in Asia - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYmF0dGxlLWZvci1uZXQtemVyby13b24tb3ItbG9zdC1pbi1hc2lh0gEA?oc=5\" target=\"_blank\">The Battle for Net Zero Will Be Won or Lost in Asia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate Action\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Home to more than half of the world’s population, Asia accounts for more than half of global primary energy consumption. Given its robust economic growth over the past three decades, Asia is also now the leading contributor of annual global greenhouse gas emissions with a 51% share. Asia’s pivotal role in global supply chains puts it at the center of a complex web of interregional embedded emissions. As a result, Asia—the most vital engine of global economic growth and the region most vulnerable to the impacts of unchecked emissions growth—is at the heart of the climate crisis. But businesses in Asia also have the greatest opportunity to lead on climate and transform their business for competitive advantage. Asia’s Climate Challenge The world is already struggling to align with the necessary changes to achieve the critical 1.5°C Paris agreement pathway—a fact laid bare in the recent IPCC (Intergovernmental Panel on Climate Change) Sixth Assessment Report.1 1 IPCC, Sixth Assessment Report, 2023, https:\/\/www.ipcc.ch\/assessment-report\/ar6\/. Notes: 1 IPCC, Sixth Assessment Report, 2023, https:\/\/www.ipcc.ch\/assessment-report\/ar6\/. The implications for Asia on the current trajectory are extreme: a severe increase of 3.2°C, could deliver a 26% dip in GDP for Asia. Southeast Asia fares even more poorly, with an expected hit of 37% to GDP. These economic impacts stand alongside far-reaching social and health considerations. Heading off such scenarios requires accelerated action in Asia. The region must deliver more than half of the emissions reductions needed to achieve the International Energy Agency’s (IEA) Net Zero Emissions by 2050 Scenario.2 2 IEA, Net Zero Emissions by 2050 Scenario (NZE), https:\/\/www.iea.org\/reports\/global-energy-and-climate-model\/net-zero-emissions-by-2050-scenario-nze. Notes: 2 IEA, Net Zero Emissions by 2050 Scenario (NZE), https:\/\/www.iea.org\/reports\/global-energy-and-climate-model\/net-zero-emissions-by-2050-scenario-nze. But the climate solutions in Asia are not straightforward. The region is diverse, and the need to deliver a just energy transition that balances economic growth, upward mobility, security, affordability, and sustainability means there is no one-size-fits-all solution that can be rolled out across the region. Asia’s Sustainability Opportunity The economic and business opportunity for Asia in driving to net zero is commensurate with the challenge. Asia is projected to unlock 43% ($4.3 trillion) of the $10.1 trillion revenue opportunity available by 2030 from activities like the expansion of renewable power, energy efficiency in buildings, transportation and agriculture, and greater circularity in producing industries. The story of job growth is equally compelling, with more than half (58%) of the 395 million jobs required to service those opportunities situated in Asia. The economic and business opportunity for Asia in driving to net zero is commensurate with the challenge. Companies have an essential role in realizing this opportunity and tackling overarching climate risks. Like the nuanced challenges faced by nations across the region, there is no sufficient single response. Corporations will need to define and implement both adaptation and mitigation strategies while also taking steps to support a just energy transition. To achieve this companies can adopt an approach based on best practices in the short-, medium-, and long-term: Take immediate action . This includes making climate action a top CEO priority, gaining a clear understanding of climate opportunities and risks, setting clear decarbonization targets and milestones, and fully leveraging existing cost-efficient emissions solutions. . This includes making climate action a top CEO priority, gaining a clear understanding of climate opportunities and risks, setting clear decarbonization targets and milestones, and fully leveraging existing cost-efficient emissions solutions. Enable transformation . Companies must mobilize the organization and resources to deliver climate impact and accelerate ecosystem collaboration, including to address Scope 3 emissions. . Companies must mobilize the organization and resources to deliver climate impact and accelerate ecosystem collaboration, including to address Scope 3 emissions. Unlock new growth. Climate action provides opportunities for companies to build out new capabilities and businesses, powering new green growth both within and beyond their existing value chain. Certainly many companies in Asia and elsewhere are just beginning this journey. But we see a number of forward-looking Asian companies that are already driving tangible climate outcomes across key industries, including real estate, energy, transport, and agriculture. Unmitigated climate change is the biggest threat of our generation. Corporate inaction on climate has a negative business impact. Conversely, timely corporate climate action will yield tremendous growth opportunities. Asian corporate leaders can make bold changes—for the good of their business and the world. This article is a summary of a longer report published by the World Economic Forum in collaboration with Boston Consulting Group and SAP. The full report can be downloaded here.","filter_flag":1}
