{"title":"Life cycle lessons - Resource Recycling","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9yZWN5Y2xpbmcvMjAyMy8wNi8yMS9saWZlLWN5Y2xlLWxlc3NvbnMv0gFHaHR0cHM6Ly9yZXNvdXJjZS1yZWN5Y2xpbmcuY29tL3JlY3ljbGluZy8yMDIzLzA2LzIxL2xpZmUtY3ljbGUtbGVzc29ucy8?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9yZWN5Y2xpbmcvMjAyMy8wNi8yMS9saWZlLWN5Y2xlLWxlc3NvbnMv0gFHaHR0cHM6Ly9yZXNvdXJjZS1yZWN5Y2xpbmcuY29tL3JlY3ljbGluZy8yMDIzLzA2LzIxL2xpZmUtY3ljbGUtbGVzc29ucy8?oc=5","id":"CBMiR2h0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9yZWN5Y2xpbmcvMjAyMy8wNi8yMS9saWZlLWN5Y2xlLWxlc3NvbnMv0gFHaHR0cHM6Ly9yZXNvdXJjZS1yZWN5Y2xpbmcuY29tL3JlY3ljbGluZy8yMDIzLzA2LzIxL2xpZmUtY3ljbGUtbGVzc29ucy8","guidislink":false,"published":"Wed, 21 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=172, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9yZWN5Y2xpbmcvMjAyMy8wNi8yMS9saWZlLWN5Y2xlLWxlc3NvbnMv0gFHaHR0cHM6Ly9yZXNvdXJjZS1yZWN5Y2xpbmcuY29tL3JlY3ljbGluZy8yMDIzLzA2LzIxL2xpZmUtY3ljbGUtbGVzc29ucy8?oc=5\" target=\"_blank\">Life cycle lessons<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Resource Recycling<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Life cycle lessons - Resource Recycling","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9yZWN5Y2xpbmcvMjAyMy8wNi8yMS9saWZlLWN5Y2xlLWxlc3NvbnMv0gFHaHR0cHM6Ly9yZXNvdXJjZS1yZWN5Y2xpbmcuY29tL3JlY3ljbGluZy8yMDIzLzA2LzIxL2xpZmUtY3ljbGUtbGVzc29ucy8?oc=5\" target=\"_blank\">Life cycle lessons<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Resource Recycling<\/font>","source.href":"https:\/\/resource-recycling.com","source.title":"Resource Recycling","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":" This article appeared in the May 2023 issue of Resource Recycling. Subscribe today for access to all print content. Following the passage of industry-supported recycling laws in California, Connecticut and Rhode Island, the mattress industry created the Mattress Recycling Council (MRC), a nonprofit organization designed to operate statewide mattress recycling programs. Since 2015, these programs have recycled more than 12 million mattresses and diverted 450 million pounds of valuable commodities from landfills and incinerators. Today, MRC is a mature product stewardship program. Its focus has evolved to include supporting the mattress industry in sustainability initiatives, including the Sleep Products Sustainability Program, and initiating various research programs that prepare MRC for the future. One such research endeavor is a life cycle analysis, conducted by an independent party, that recently found MRC’s California operations significantly reduce water consumption, energy consumption and greenhouse gas emissions. These environmental benefits reflect the savings achieved from recycled mattress materials displacing the raw materials and energy needed to manufacture new foam and steel springs. Setting the stage As part of a 2008 legislative mandate, California’s Department of Resources Recycling and Recovery (CalRecycle) contracted with UC Berkeley and UC Santa Barbara to study the full production and end-of-life management of carpets, carryout food clamshells, batteries and mattresses in terms of energy and greenhouse gas emissions. That study, conducted in 2012, concluded that significant energy and greenhouse gas reductions were possible if California encouraged mattress recycling. California in the MRC era MRC launched its California program on Dec. 30, 2015, and quickly grew its operations to allow for the capture and recycling of discarded mattresses from a variety of sources, including consumers, solid waste facilities and large-volume sources such as hotels and universities. By 2020, MRC’s California program was a mature and highly functional recycling system with quality data being collected from all aspects of the value chain. Conducting a life cycle analysis of a post-consumer collection program was unusual, but it was also a logical project for MRC to undertake to measure the baseline environmental footprint of its program. In that same year, MRC commissioned the aforementioned life cycle analysis to study, quantify and evaluate the environmental impacts and benefits of each component of its California program. The results of the study document the environmental benefits MRC provides and will guide the trajectory of our research projects and operational focus to achieve other goals. The analysis After a competitive review process, MRC selected Scope 3 Consulting from Santa Barbara, Calif. to conduct the life cycle analysis, based on their work with other consumer products and the involvement of one of Scope 3’s principals, Brandon Kuczenski, in the state’s 2012 baseline mattress study. This was a complicated multi-year project that MRC hoped would provide valuable information for stakeholders and the mattress industry. The scope of the study included all environmental impacts and benefits associated with each component of the program, which include: Collection: MRC aggregates discarded mattresses through a variety of collection channels, including collection events, drop-off at public collection sites and direct pick-up from large-volume sources such as hotels and universities. The starting point for the study began at the point of collection for each of these possible channels. Transportation: The study quantified the environmental impacts of transporting over 15,000 loads of mattresses throughout California by measuring the distance of every haul from each collection point to one of nine recycling\/deconstruction facilities. Most of these transporters used diesel fleets to move common 53-foot trailers. Recycling: In 2021, MRC’s contracted recycling facilities dismantled 1.6 million mattresses and box springs. The study measured the environmental impacts of each operation’s use of labor, equipment, energy, water and supplies to quantify the environmental impacts of the deconstruction process. End markets: By weight, 76% of the mattresses and box springs received by MRC’s recycling facilities were reused or recycled into new products or, in the case of box springs, wood that can be burned as biomass fuel. The primary materials extracted from discarded mattresses are steel and foam. The recovery and recycling of those two components drives most of the environmental benefit for the program by displacing the production of virgin foam and steel products. Non-recyclable materials constituted 23%, by weight, of the mattresses and box springs processed. The study quantified the environmental impacts of disposal alternatives, including landfilling, incineration, pyrolysis and gasification. Scope 3’s process required a deep dive into a variety of environmental indicators, including greenhouse gasses, energy demand, water use, particulate matter and smog emissions from each part of MRC’s program to quantify these environmental impacts. For more details on the study’s methods and findings, read the full report at www.mattressrecyclingcouncil.org\/lca-report. The findings The study found that recycling 1.6 million mattresses per year generated the following environmental benefits: 75 million fewer pounds of greenhouse gasses emitted, equivalent to the emission savings from driving a gas-fueled vehicle nearly 100 million fewer miles. 818 million gallons of water saved, equivalent to the annual consumption by a city of 37,500 residents in one year. 174,000 kilowatt hours of power saved, equivalent to the amount of power a city of 40,000 residents would use in one year. Stated differently, the materials reclaimed from every mattress recycled save 500 gallons of water, enough energy to power the average household for three days, and reduce greenhouse gas emissions by the equivalent of driving 60 fewer miles. Turning research into action MRC did not wait for the study’s results to start making changes. Knowing that transportation would be a significant contributor to its greenhouse gas emissions, MRC has begun actively managing its transportation network to reduce hauls and miles driven, thereby reducing associated carbon emissions. Likewise, MRC can further displace carbon emissions and other environmental impacts by increasing the recycling of mattress components that are otherwise landfilled. This study documented that mattress recycling provides an impressive number of benefits across a broad spectrum of environmental indicators. For MRC, the assessment will help guide investment and research decisions, inform policy discussions and allow the organization to evaluate its programs with an eye on its environmental footprint. Mike O’Donnell is MRC’s chief operating officer, with oversight of all aspects of the program, including the research team. He has over 30 years of experience managing solid and hazardous waste collection programs for public and private entities, including product stewardship programs for mattresses, paint and mercury-containing lamps. He can be reached at [email protected]. This article appeared in the May 2023 issue of Resource Recycling. Subscribe today for access to all print content.","filter_flag":1}
{"title":"Kellogg reduces Scope 1 and 2 greenhouse gas emissions, relies on renewable energy - Snack Food & Wholesale Bakery","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5zbmFja2FuZGJha2VyeS5jb20vYXJ0aWNsZXMvMTA5MTM2LWtlbGxvZ2ctcmVkdWNlcy1zY29wZS0xLWFuZC0yLWdyZWVuaG91c2UtZ2FzLWVtaXNzaW9ucy1yZWxpZXMtb24tcmVuZXdhYmxlLWVuZXJnedIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5zbmFja2FuZGJha2VyeS5jb20vYXJ0aWNsZXMvMTA5MTM2LWtlbGxvZ2ctcmVkdWNlcy1zY29wZS0xLWFuZC0yLWdyZWVuaG91c2UtZ2FzLWVtaXNzaW9ucy1yZWxpZXMtb24tcmVuZXdhYmxlLWVuZXJnedIBAA?oc=5","id":"CBMigAFodHRwczovL3d3dy5zbmFja2FuZGJha2VyeS5jb20vYXJ0aWNsZXMvMTA5MTM2LWtlbGxvZ2ctcmVkdWNlcy1zY29wZS0xLWFuZC0yLWdyZWVuaG91c2UtZ2FzLWVtaXNzaW9ucy1yZWxpZXMtb24tcmVuZXdhYmxlLWVuZXJnedIBAA","guidislink":false,"published":"Mon, 05 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=156, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5zbmFja2FuZGJha2VyeS5jb20vYXJ0aWNsZXMvMTA5MTM2LWtlbGxvZ2ctcmVkdWNlcy1zY29wZS0xLWFuZC0yLWdyZWVuaG91c2UtZ2FzLWVtaXNzaW9ucy1yZWxpZXMtb24tcmVuZXdhYmxlLWVuZXJnedIBAA?oc=5\" target=\"_blank\">Kellogg reduces Scope 1 and 2 greenhouse gas emissions, relies on renewable energy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Snack Food & Wholesale Bakery<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Kellogg reduces Scope 1 and 2 greenhouse gas emissions, relies on renewable energy - Snack Food & Wholesale Bakery","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5zbmFja2FuZGJha2VyeS5jb20vYXJ0aWNsZXMvMTA5MTM2LWtlbGxvZ2ctcmVkdWNlcy1zY29wZS0xLWFuZC0yLWdyZWVuaG91c2UtZ2FzLWVtaXNzaW9ucy1yZWxpZXMtb24tcmVuZXdhYmxlLWVuZXJnedIBAA?oc=5\" target=\"_blank\">Kellogg reduces Scope 1 and 2 greenhouse gas emissions, relies on renewable energy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Snack Food & Wholesale Bakery<\/font>","source.href":"https:\/\/www.snackandbakery.com","source.title":"Snack Food & Wholesale Bakery","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"As millions around the globe mark World Environment Day, Kellogg Company is highlighting the progress it made in 2022 against its Kellogg's Better Days Promise commitments to nurture the planet: 31.1% absolute reduction in Scope 1 and 2 greenhouse gas emissions (since 2015) 13% absolutely reduction in Scope 3 greenhouse gas emissions (since 2015, as of December 2021) 40.3% of electricity used was from renewable sources (in 2022) 17% reduction in water use in high stress regions (since 2015) 23% reduction in food waste (since 2016, as of December 2021) 485,000 farmers and agronomists supported (since 2015) 76% of packaging is recyclable at scale (in 2021) Since 2015, Kellogg has been working towards its ambitious goal of advancing sustainable and equitable access to food and creating #BetterDays for 3 billion people by the end of 2030. As part of its Kellogg's Better Days Promise strategy, the company has adopted a comprehensive range of commitments and practices aimed at decreasing its impact on the planet, addressing areas such as climate change, responsible sourcing, and food waste. These include: Reducing absolute Scope 1 & 2 greenhouse gas (GHG) emissions by 45% by the end of 2030. Partnering across our value chain to reduce absolute Scope 3 GHG emissions by 15% by the end of 2030. Progressing towards 100% renewable electricity in global Kellogg manufacturing facilities by the end of 2050. Reducing water use in global Kellogg manufacturing facilities in high water stress regions by 30% by the end of 2030. Reducing food waste across our global Kellogg-owned manufacturing facilities by 50% by the end of 2030. Supporting farmers and agronomists globally, including women and smallholders. Building resilient and responsible supply chains for our priority ingredients. Progressing towards 100% reusable, recyclable or compostable packaging (by volume). Learn more about how Kellogg came up with these commitments here. \"The relationship between the health of our planet and that of people is inextricable. Our changing climate is reducing crop yields, which leads to greater food insecurity that disproportionately affects diverse and underserved communities,\" said Janelle Meyers, Kellogg Company's chief sustainability officer. \"While we have more work to do, we've made significant progress towards reducing our impact on the environment and creating a climate-positive value chain.\" Learn more about Kellogg's Better Days Promise and how the company is working to create better days for people and planet at betterdays.kelloggcompany.com.","filter_flag":1}
{"title":"Study: Animal Products Linked to 95 Percent Increase In Emissions Over the Last 20 Years - VegNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vdmVnbmV3cy5jb20vYW5pbWFsLXByb2R1Y3RzLTk1LXBlcmNlbnQtZW1pc3Npb25zLXN0dWR50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vdmVnbmV3cy5jb20vYW5pbWFsLXByb2R1Y3RzLTk1LXBlcmNlbnQtZW1pc3Npb25zLXN0dWR50gEA?oc=5","id":"CBMiPmh0dHBzOi8vdmVnbmV3cy5jb20vYW5pbWFsLXByb2R1Y3RzLTk1LXBlcmNlbnQtZW1pc3Npb25zLXN0dWR50gEA","guidislink":false,"published":"Thu, 22 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=173, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vdmVnbmV3cy5jb20vYW5pbWFsLXByb2R1Y3RzLTk1LXBlcmNlbnQtZW1pc3Npb25zLXN0dWR50gEA?oc=5\" target=\"_blank\">Study: Animal Products Linked to 95 Percent Increase In Emissions Over the Last 20 Years<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Study: Animal Products Linked to 95 Percent Increase In Emissions Over the Last 20 Years - VegNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vdmVnbmV3cy5jb20vYW5pbWFsLXByb2R1Y3RzLTk1LXBlcmNlbnQtZW1pc3Npb25zLXN0dWR50gEA?oc=5\" target=\"_blank\">Study: Animal Products Linked to 95 Percent Increase In Emissions Over the Last 20 Years<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","source.href":"https:\/\/vegnews.com","source.title":"VegNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Science continues to point to the major role that animal agriculture plays in the climate crisis, including a study published this month in the journal Nature Food. Led by researchers at the Universities Groningen of Birmingham, the study found that over the last 20 years (from 2000 to 2019), food-related greenhouse gas emissions increased by 14 percent. Researchers found that increased consumption of animal-derived foods was responsible for 95 percent of these increased emissions, with beef and dairy accounting for 32 percent and 46 percent, respectively. Luke Stackpoole\/Unsplash “A global shift in diets, including reducing excessive intake of red meat and improving shares of plant-based protein—will not only reduce emissions but avoid health risks such as obesity and cardiovascular disease,” Professor Klaus Hubacek, a corresponding author from the University of Groningen, said in a statement. Further, food consumption in the five highest greenhouse gas-emitting countries (namely China, India, Indonesia, Brazil, and the United States) accounted for 40 percent of emissions from the global food supply. Putting food-related emissions on the table at climate conferences How are world leaders addressing this issue? Ahead of the UN’s big COP28 summit in Dubai in December, world leaders gathered for the Framework Convention on Climate Change (UNFCCC) conference in Bonn Germany this month. A number of groups, including Humane Society International (HSI), were in attendance at this conference to bring the topic of shifting away from animal agriculture to the forefront of climate discussions. “Although we are encouraged that the UN is increasingly acknowledging the role that food plays in climate change and beginning to include food systems on the agenda during climate conversations, the SBs [subsidiary bodies] made it clear there is still much work to be done,” Stefanie McNerney, Senior Manager of Food Policy at HSI, who was in attendance at Bonn, tells VegNews. “Agriculture and food systems continue to receive far less attention than a sector that is responsible for nearly one-third of all human-caused greenhouse gas emissions deserves,” McNerney says. More than 92 billion land animals are slaughtered for food every year according to the most recent statistics from the United Nations’ Food and Agriculture Organization (FAO). If demand for animal products is not reduced, this number will only continue to increase in tandem with the growing world population—all to the detriment of the planet. Getty “If we are to meaningfully address the challenges of climate change, we cannot continue with business-as-usual practices—not in the energy sector, nor in the transportation sector, and certainly not when it comes to agriculture and food systems,” McNerney says. “Governments and other stakeholders must work towards a just transformation of our global food systems—paving the way through major policy reforms, substantial investment, and creating enabling environments that foster and embrace innovation,” McNerney says. Vegan hot dogs at Bonn Climate Conference At Bonn, activists from The Plant Based Treaty (PBT)—which advocates for a transition to a global plant-based food system—distributed 2,000 vegan hot dogs at the entrance of the conference for three days to start the conversation about the need to shift toward more sustainable proteins. Plant Based Treaty “Because of these hotdogs it was so much easier for us to talk about the protein shift because people just had a positive experience with vegan food,” PBT organizer Lea de Zwart said in a statement. “Climate conferences should definitely be vegan, it’s important we lead by example and show what can be done,” de Zwart said. Like its predecessors, the Bonn Climate Conference was decidedly not vegan. In fact, coffee booths at the conference charged an additional €0.50 for soy and oat milk substitutions. PBT called upon the UNFCCC and World Conference Center to end this surcharge, citing the hypocrisy in creating an obstacle for attendees looking to make climate-friendly choices. “Climate conferences should not be providing financial incentives for delegates to consume dairy, which is fueling the climate crisis, deforestation and draining freshwater supplies,” Tim Werner, PBT scientific advisor, said in a statement. Get the Newsletter Never miss out on breaking stories, recipes, and deals “The UN must end the plant-based tax; if there are going to be surcharges, they should be applied on products containing polluting meat and dairy, or better yet, make climate conferences vegan,” he said. Making the case for a plant-based food system The PBT also held a press conference during Bonn to bring attention to the urgency of the issue of animal agriculture-related emissions. Already signed by more than 20 global municipalities, the PBT advocates for a shift with three tenants: Relinquish (freeze expansion of animal agriculture to halt environmental destruction); Redirect (shift toward a plant-based food system); and Restore (rewild natural habitats to restore balance). Werner presented climate data that outlined the need to address animal agriculture as part of climate mitigation strategies. “Animal agriculture is the leading cause of biodiversity loss, large-scale deforestation, soil degradation, and water depletion and it’s a leading cause of global warming and chemical pollution,” Werner said. At the Bonn Climate Conference, PBT also launched a petition to demand that all future climate conferences bring sustainable food to the table, both literally (by switching to plant-based catering) and figuratively (through policy change). Plant Based Treaty So was any progress made at Bonn? McNerney says world leaders did begin negotiations around the new Sharm el-Sheikh joint work to implement climate action on agriculture and food security. However, despite a good start, the sessions concluded without tangible outcomes, and further discussions were tabled until COP28. “This disappointing conclusion was slightly alleviated by the openness and interest some negotiators showed in engaging with civil society on topics such as protein diversification,” McNerney says. “We hope to continue to see this interest and engagement going forward, and we will continue to advocate for an increased focus on global food systems transformation.”","filter_flag":1}
{"title":"AXA Net Zero strategy for investment & underwriting - AXA.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmF4YS5jb20vZW4vY29tbWl0bWVudHMvYXhhLW5ldC16ZXJvLXN0cmF0ZWd5LWZvci1pbnZlc3RtZW50LWFuZC11bmRlcndyaXRpbmfSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmF4YS5jb20vZW4vY29tbWl0bWVudHMvYXhhLW5ldC16ZXJvLXN0cmF0ZWd5LWZvci1pbnZlc3RtZW50LWFuZC11bmRlcndyaXRpbmfSAQA?oc=5","id":"CBMiWGh0dHBzOi8vd3d3LmF4YS5jb20vZW4vY29tbWl0bWVudHMvYXhhLW5ldC16ZXJvLXN0cmF0ZWd5LWZvci1pbnZlc3RtZW50LWFuZC11bmRlcndyaXRpbmfSAQA","guidislink":false,"published":"Thu, 29 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=180, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmF4YS5jb20vZW4vY29tbWl0bWVudHMvYXhhLW5ldC16ZXJvLXN0cmF0ZWd5LWZvci1pbnZlc3RtZW50LWFuZC11bmRlcndyaXRpbmfSAQA?oc=5\" target=\"_blank\">AXA Net Zero strategy for investment & underwriting<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AXA.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"AXA Net Zero strategy for investment & underwriting - AXA.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmF4YS5jb20vZW4vY29tbWl0bWVudHMvYXhhLW5ldC16ZXJvLXN0cmF0ZWd5LWZvci1pbnZlc3RtZW50LWFuZC11bmRlcndyaXRpbmfSAQA?oc=5\" target=\"_blank\">AXA Net Zero strategy for investment & underwriting<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AXA.com<\/font>","source.href":"https:\/\/www.axa.com","source.title":"AXA.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"AXA’s objectives, specifically for the global P&C underwriting business, encompass three areas: engagement with clients and partners on the transition development of new products and solutions enabling insurance innovation for a greener economy, and measuring and reporting the impact of these efforts against our most material underwriting emissions reductions objectives. AXA’s current P&C underwriting policies will also continue to be applied and refined to match AXA climate transition efforts as well as our strategic ambition. Taking AXA’s net zero journey to the next level: how AXA will insure the transition With these new announcements we move forward on our net zero transition journey. These announcements are possible due in part to the methodological work undertaken within the sector. AXA was a significant contributor to the development of these tools and methodologies for companies to measure and disclose greenhouse gas emissions associated with insurance and reinsurance underwriting portfolios, as well as the protocol for setting underwriting transition ambition. From now until 2026, AXA will be engaging with our top 200 largest commercial clients globally, to increase their knowledge about climate impacts, transition efforts and associated risks as well as sources of emissions, solutions, and the benefits of disclosure. We are conscious that commercial clients are not all facing the same challenges with global climate transition efforts, and one role of AXA is to help by engaging to understand their unique risks and needs with regards to the climate transition. Engagement approaches with agents and brokers as well with retail motor clients will also be adopted. Moreover, in the same time frame (by 2026), AXA will strengthen its offers & services to “insure” the transition, namely by increasing its support for renewable energy installations and infrastructure and by expanding sustainable claims management options and other climate transition products, including nature-based solutions. We are aiming to increase our green and sustainable claims by 10% and retail customers will also benefit from education efforts on sustainable mobility and the electric vehicles transition more broadly. These activities support the Group intermediate targets for the most material commercial and retail motor portfolios of AXA, by 2030: a reduction in the carbon intensity (IAE*\/vehicle) of the personal motor portfolio in selected geographies by 20%, using the baseline year 2019. a reduction in the absolute carbon emissions (IAE) of AXA’s largest commercial insurance clients by 30%, using the baseline year 2021, and a reduction in the the carbon intensity (IAE\/GWP) of all other corporate clients within AXA’s largest markets by 20%, using the baseline year 2021**. A collective leadership responsibility – AXA’s call for action We want to be an enabler and a supporter of the transition and we are taking concrete actions to drive the broader ecosystem in support of transition efforts. We want to lead by example but the whole real-economy needs to follow suit: AXA’s underwriting emissions reduction objectives reflect an optimistic-yet-possible view of real economy efforts for a stable and just transition. Achieving these interim targets depends on a number of variables. In particular: the real economy, including policy holders, transitioning in line with those scientific 1.5°C pathways[1] which have been used for AXA’s emissions reduction calculation; the energy transition for in-scope economic markets, being in-line with the transition pathways[2] used for AXA’s emissions reduction calculation; the transition of personal transportation to electric vehicles (EVs) and other low emissions solutions being in-line with government commitments; and Governments and regulators (including insurance and financial regulators) around the world retaining, strengthening and evolving policies to achieve the emission reductions necessary to meet their 1.5°C pledges. In this regard, measurement and disclosure is a key step in achieving emissions reductions: our efforts to measure underwriting portfolio emissions are limited by the disclosure efforts of the real economy. Until this improves, actions and ambition are limited where only proxy data is available. The intermediate transition targets have been set on a limited scope of AXA’s underwriting portfolio and only include client’s Scope 1 and 2 emissions. It is possible in the future that additional portfolios may be included and scope 3 GHG emissions integrated. Moreover, as highlighted above, a significant gap currently exists between policies and science. Policy gap analysis highlights the widening divide between agreed 1.5C pathways and the estimated impact of currently funded policies. Despite the known challenges and limitation AXA is taking the first step for its P&C underwriting portfolios. In doing so, we are also calling for collective action to embark all stakeholders on this journey. This is an investment for the next generation and AXA, as we deliver value to our clients and partners. Investments AXA is committed to transitioning its investment portfolio to net-zero greenhouse gas (GHG) emissions by 2050, consistent with a maximum temperature rise of 1.5°C above preindustrial levels by 2100 and taking into account the Intergovernmental Panel on Climate Change (IPCC) transition pathways. In 2019, AXA committed to reducing the carbon footprint of its general account investments by 20% between 2019 and 2025. This objective was met, and exceeded, with a reduced carbon footprint of 35% at year-end 2022. Following this successful first phase of AXA’s investment decarbonization plan, on 29 June 2023 the AXA Group established a new intermediate target on investments to reduce the carbon footprint of its General Account assets by 50% by 2030 (using the baseline year 2019). The measure used to calculate AXA’s carbon footprint is carbon intensity normalized with enterprise value and using Scope 1 and 2 greenhouse gas data (according to the GHG Protocol). The asset classes covered are listed equities and corporate bonds as well as real estate, consistent with the approach adopted by the AXA Group with its first intermediate target. The use of a carbon intensity normalization with enterprise value to measure carbon intensity allows a close link to the financing sources of the corporates and hence to our role as an investor. It also allows an easy comparison among asset classes, portfolios and sectors, compared with other metrics such as revenue or physical intensity. Carbon intensity is expressed in tons of CO2 equivalent by million of euros invested. This means that we are aiming to reduce the carbon intensity of our combined portfolio of listed equities and corporate bonds complemented by real estate, from 66tCO2 equivalent per million euros invested in 2019 to 33tCO2 equivalent per million euros invested by 2030, which is in line with the trajectories prescribed by the IPCC and will mean us remaining highly selective in the years ahead. At the end of 2022, our portfolio came out at 43tCO2 equivalent per million euros invested - a reduction which reflected both our portfolio management efforts and the fall in scope 1 and 2 emissions from the companies in which we invested. We expect this to continue as we move into the second phase of AXA’s decarbonization plan. Additionally, within our investment decision framework, AXA Group will reinforce its engagement with listed corporates contributing the most to its portfolio’s carbon footprint, focusing first on 20 listed companies among these largest contributors. We want to lead by example but the whole real-economy needs to follow suit: AXA’s reduction objectives reflect an optimistic-yet-possible view of real economy efforts for a stable and just transition. Achieving these new intermediate targets depends on a number of variables. In particular: the real economy and the companies in which we invest transitioning in line with those scientific 1.5°C pathways***** which have been used for AXA’s investment portfolio reduction calculation; Government’s and regulators (including insurance and financial regulators) around the world retaining, strengthening and evolving policies to achieve the emission reductions necessary to meet their 1.5°C pledges. In this regard, measurement and disclosure is a key step in achieving emissions reductions: our efforts to measure investment portfolio carbon intensity are limited by the disclosure efforts of the real economy. Until this improves, actions and ambition are limited where only proxy data is available. It is possible in the future that additional assets may be included and scope 3 GHG emissions integrated. Notes: Climate or sustainability-related metrics and underlying emissions data are subject to measurement uncertainties resulting from limitations inherent in the nature and the methods used to determine them. There is a limited availability of relevant data: such data is not yet systematically disclosed by issuers, or, when disclosed by issuers or collected from third-party data providers, it may be incorrect, incomplete or follow various reporting methodologies. The measurement techniques used for determining non-financial metrics and data may involve complex modelling processes and research. The use of different measurement techniques can also result in materially different measurements, while the precision of these techniques may vary. The data sources and methodologies for emissions factors are expected to evolve and improve over time and may materially impact targets and the achievement of targets. The interim portfolio transition targets noted above reflect management’s current expectations, and are subject to a number of assumptions, variables and uncertainties. In particular, the achievement of AXA’s transition targets will depend on the overall transition of the world economy and society to net zero in the coming decades which itself will depend on a variety of political, economic, regulatory, civil society and scientific developments beyond AXA’s control. There can be no assurances that our transition targets will be achieved in whole or in part, the timetable for any transition process, or the impact on our business of meeting or failing to meet such targets. * IAE represents Insurance-Associated Emissions as defined by the absolute carbon accounting standard published by the Partnership for Carbon Accounting Financials ** Commercial IAE values based on client Scopes 1 and 2 emissions *** “Net Zero by 2050: A Global Roadmap for the Global Energy Sector”; IEA: May 2021 and SBTi sector guidance **** “World Energy Outlook 2022”; IEA; October 2022 ***** IPCC Special Report on Global Warming of 1.5°C and IPCC Sixth Assessment Report (AR6)","filter_flag":1}
{"title":"Strengthening Sustainable Building Operations | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvc3RyZW5ndGhlbmluZy1zdXN0YWluYWJsZS1idWlsZGluZy1vcGVyYXRpb25z0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvc3RyZW5ndGhlbmluZy1zdXN0YWluYWJsZS1idWlsZGluZy1vcGVyYXRpb25z0gEA?oc=5","id":"CBMiU2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvc3RyZW5ndGhlbmluZy1zdXN0YWluYWJsZS1idWlsZGluZy1vcGVyYXRpb25z0gEA","guidislink":false,"published":"Fri, 23 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=174, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvc3RyZW5ndGhlbmluZy1zdXN0YWluYWJsZS1idWlsZGluZy1vcGVyYXRpb25z0gEA?oc=5\" target=\"_blank\">Strengthening Sustainable Building Operations | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Strengthening Sustainable Building Operations | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvc3RyZW5ndGhlbmluZy1zdXN0YWluYWJsZS1idWlsZGluZy1vcGVyYXRpb25z0gEA?oc=5\" target=\"_blank\">Strengthening Sustainable Building Operations | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Full abatement of a country’s building operations emissions will require a combination of these technologies. Global players need to customize their decarbonization pathway in individual regions by considering a tapestry of local factors. These include climate, regulation, infrastructure, tenant receptivity to technology, the current energy efficiency of the building stock, and the type of technologies already in use. For example, whereas district heating is emerging as a leading solution in Germany, the short-term potential to use this technology to heat commercial and residential buildings is far more limited in the US due to a lack of infrastructure. At the same time, governments are also taking action: by implementing tougher regulations paired with more generous incentives, they are increasing the pressure on stakeholders to adopt levers that decarbonize building operations. For example, the US has set aside $9 billion in incentives for heat pumps and homeowner retrofit rebates in the Inflation Reduction Act. Germany is providing $6.5 billion in incentives for energy efficiency measures via its COVID-19 recovery and emergency gas programs. Four Stakeholders That Are Critical for Success Four stakeholders have a significant influence on building operations and thus can play a key role in tackling emissions at this crucial stage in the building life cycle. These stakeholders—asset owners, OEMs, utility players, and local regulators—must act decisively if the building sector is to reach net zero. All four can gain significant benefits by doing so. For example, stakeholders can strengthen their license to operate, lock up early access to low-carbon power supplies, expand into new high-growth markets, and drive increased market valuations. We have found that companies with best-in-class sustainability metrics enjoy a premium of 10% to 15% in their valuations. And because about 60% of employees worldwide factor sustainability into their choice of job, building stakeholders can attract much-needed talent. None of the four stakeholders can solve the building sector’s huge decarbonization challenge alone. Historically, industry players have been slow to collaborate—in part because of a fragmented value chain. But stakeholders will need to cooperate and join forces if decarbonization initiatives are to be effective. Stakeholders will need to cooperate and join forces if decarbonization initiatives are to be effective. Nevertheless, each of the four stakeholders has a unique role to play to enable the building sector to reach net zero. By embracing this role, they can seize new opportunities but will also need to tackle critical challenges. Asset Owners Role. As the key decision makers on how buildings are constructed, equipped, and renovated, asset owners will play a leading decarbonization role. Unlike other stakeholders, asset owners are ultimately responsible for ensuring that their buildings achieve net zero, and these owners face the prospect of penalties if they fail to comply with low-emissions regulations or meet green targets. By driving the demand side of green solutions, asset owners will set the pace on adoption rates and the sector’s transition to net zero. Opportunities and Challenges. Assets owners have an opportunity to capture operational savings from more cost-effective technologies and potentially to command a rent premium for more attractive, sustainable buildings. By adopting decarbonization measures now, they can also gain reputation benefits, leverage green sources of capital, and mitigate the impact of future carbon taxes. But they will need to develop capabilities in several areas: measuring the existing CO 2 emissions baseline of assets, determining the feasibility of different green solutions so they can allocate capital more effectively, and implementing solutions in both new and existing buildings. Asset owners will also have to explore the optimal combination and sequencing of green solutions for their buildings. Once they have developed these capabilities, they can offer them as a service to other asset owners, thus establishing new green ventures beyond their core business. OEMs Role. OEMs need to provide the green technologies and services that are fundamental for the decarbonization of building operations. Their ability to innovate and market energy-efficient solutions and maintain them over the life cycle not only generates customer value but also significantly reduces CO 2 emissions. Opportunities and Challenges. Although some OEMs must deal with the challenge of declining legacy technology (such as oil and gas heating in Europe), most have a promising future driven by an ever-increasing customer appetite for energy-efficient products. The potential for OEMs to differentiate themselves from competitors has historically been based on classical buying criteria like quality, price, and availability. In recent years, this has shifted to a focus on adding capabilities such as the capacity to combine different technologies into a single solution that adds customer value (for example, sector coupling of electricity-based heating with distributed solar photovoltaic) or the ability to offer superior control on the back of IoT-enabled cloud-edge connectivity (such as smart control and optimization of electricity consumption via home or building energy management systems). In the long term, however, these players face uncertainty about the pace of the green transition, the resilience of their established go-to-market networks, and how incentives and regulations will evolve. Furthermore, it remains unclear whether the regional nature of the green building technology markets will persist. It is likely that global competition will intensify and offer Asian mass producers an even stronger inroad to Western markets. For example, in the market for air-to-air heat pumps, players like Daikin and Mitsubishi are starting to gain share over regional incumbents in Europe. To sustain an advantage, incumbents may need to invest (in expanding their footprint, for instance), forge partnership ecosystems, or consider strategic M&A. Market access and scale will be increasingly important as green building technologies evolve along the maturity curve. The US firm Carrier Global’s acquisition of the climate solution business of Germany’s Viessmann is a good example of strategic thinking in that regard, if approved by regulators. Utility Companies Role. Utility providers need to supply the green electricity that will enable the building sector to reach net zero. And they will have to deliver a lot more of it as buildings increasingly electrify and demand skyrockets. Opportunities and Challenges. Utility players have an opportunity to capture a share of the growing green electricity market and, in doing so, mitigate their own Scope 3 emissions. They can also establish new business lines, such as installing and servicing green solutions, leveraging their existing field staff and deep, data-driven understanding of customers’ energy usage and requirements. Utility companies will be able to offer large asset owners a one-stop-shopping solution that combines renewable energy services with heat pumps and other green technologies such as district heating. But utility operators also face uncertainty about the potential trajectory of green solutions as well as challenges in anticipating the future demand for green electricity—and they may lose customers if they do not navigate the energy transition smoothly. In addition, they will need to motivate and forge strong partnerships with independent technical installers. Furthermore, the grid infrastructure in some countries needs upgrading to support renewable energy. Still, many utility companies have seen windfall profits over the past year from higher energy bills. By investing some of this money in the building value chain (for example, in installation services), they can play an important role in the sector’s decarbonization journey. Local Regulators Role. These players need to drastically simplify the local regulations that planners must comply with, as these requirements often impede the adoption of green building technologies. At the same time, local regulators should increase sustainability requirements for building approvals and extend incentives for green solutions. Opportunities and Challenges. Local regulators have an opportunity to significantly accelerate building decarbonization and promote effective green technologies. To do so successfully, they will need to develop new capabilities for assessing and prioritizing green solutions and evaluating building plans that contain new technologies. They must also avoid creating further regulatory complexity that impedes change. Regulators should prioritize introducing new requirements for the highest-emitting sources and segments and should deploy financial incentives to help players with high upfront investment costs. Given the size of building sector emissions, key stakeholders must act to help mitigate the global climate crisis. Although steps are needed across the building life cycle and from all players, decarbonizing the operations phase by using the dual levers of energy efficiency and fuel switching\/electrification will have the greatest impact. While a lot still has to be done, the pieces are in place for the building sector to succeed. Cost-efficient decarbonization technologies already exist, governments are setting tougher targets and providing more generous incentives, and players—faced with higher energy costs—are recognizing the importance of taking action. Building stakeholders must now grasp the challenge and accelerate the push to net zero.","filter_flag":1}
{"title":"Reducing greenhouse gases: a Guide from Cosmed and ADEME - CosmeticOBS","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vY29zbWV0aWNvYnMuY29tL2VuL2FydGljbGVzL3NlY3Rvci00OS9yZWR1Y2luZy1ncmVlbmhvdXNlLWdhc2VzLWEtZ3VpZGUtZnJvbS1jb3NtZWQtYW5kLWFkZW1lLTc0MjHSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vY29zbWV0aWNvYnMuY29tL2VuL2FydGljbGVzL3NlY3Rvci00OS9yZWR1Y2luZy1ncmVlbmhvdXNlLWdhc2VzLWEtZ3VpZGUtZnJvbS1jb3NtZWQtYW5kLWFkZW1lLTc0MjHSAQA?oc=5","id":"CBMiamh0dHBzOi8vY29zbWV0aWNvYnMuY29tL2VuL2FydGljbGVzL3NlY3Rvci00OS9yZWR1Y2luZy1ncmVlbmhvdXNlLWdhc2VzLWEtZ3VpZGUtZnJvbS1jb3NtZWQtYW5kLWFkZW1lLTc0MjHSAQA","guidislink":false,"published":"Mon, 19 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=170, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vY29zbWV0aWNvYnMuY29tL2VuL2FydGljbGVzL3NlY3Rvci00OS9yZWR1Y2luZy1ncmVlbmhvdXNlLWdhc2VzLWEtZ3VpZGUtZnJvbS1jb3NtZWQtYW5kLWFkZW1lLTc0MjHSAQA?oc=5\" target=\"_blank\">Reducing greenhouse gases: a Guide from Cosmed and ADEME<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticOBS<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Reducing greenhouse gases: a Guide from Cosmed and ADEME - CosmeticOBS","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vY29zbWV0aWNvYnMuY29tL2VuL2FydGljbGVzL3NlY3Rvci00OS9yZWR1Y2luZy1ncmVlbmhvdXNlLWdhc2VzLWEtZ3VpZGUtZnJvbS1jb3NtZWQtYW5kLWFkZW1lLTc0MjHSAQA?oc=5\" target=\"_blank\">Reducing greenhouse gases: a Guide from Cosmed and ADEME<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticOBS<\/font>","source.href":"https:\/\/cosmeticobs.com","source.title":"CosmeticOBS","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"In order to provide companies with the best possible help in carrying out their GHG emissions assessments, Cosmed, supported by the BL Evolution consultancy and with the technical and financial support of ADEME, has spent a year working with players in the industry to draw up calculation methods for each emissions item, illustrated by concrete examples and taking into account: • The diversity of activities: own brands, subcontractors, ingredient manufacturers • The diversity of products sold and raw materials purchased • The diversity of structure sizes, with in particular a large number of small players with adapted methodological needs • The large number of emissions factors to be taken into account and their availability for all raw materials","filter_flag":1}
{"title":"How to make climate finance work for everyone - World Economic Forum","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzA2L2NsaW1hdGUtZGVjYXJib25pemF0aW9uLWZpbmFuY2UtZXF1aXRhYmxlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzA2L2NsaW1hdGUtZGVjYXJib25pemF0aW9uLWZpbmFuY2UtZXF1aXRhYmxlL9IBAA?oc=5","id":"CBMiUWh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzA2L2NsaW1hdGUtZGVjYXJib25pemF0aW9uLWZpbmFuY2UtZXF1aXRhYmxlL9IBAA","guidislink":false,"published":"Mon, 19 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=170, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzA2L2NsaW1hdGUtZGVjYXJib25pemF0aW9uLWZpbmFuY2UtZXF1aXRhYmxlL9IBAA?oc=5\" target=\"_blank\">How to make climate finance work for everyone<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">World Economic Forum<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How to make climate finance work for everyone - World Economic Forum","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzA2L2NsaW1hdGUtZGVjYXJib25pemF0aW9uLWZpbmFuY2UtZXF1aXRhYmxlL9IBAA?oc=5\" target=\"_blank\">How to make climate finance work for everyone<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">World Economic Forum<\/font>","source.href":"https:\/\/www.weforum.org","source.title":"World Economic Forum","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Climate finance needs to be scaled up and redesigned so that governments, investors and businesses prioritize green solutions. Around $5 trillion will be needed every year by 2050 to meet climate and biodiversity goals, and scale new low-carbon technologies. Recent legislation such as the US Inflation Reduction Act shows how the public sector can steer markets in a new direction. The transition to a decarbonized economy offers the chance to eradicate poverty, reduce inequality and decent employment for all. Every day, governments, financial institutions and corporations have a choice to make: invest in physical assets that emit greenhouse gases and harm nature or prioritize the development of green solutions that foster a stable, resilient and equitable economy. As communities face the harsh impacts of climate change, the choice to build a sustainable future is becoming clearer. Estimates suggest around $5 trillion of capital will be needed every year by 2050 to meet climate and biodiversity goals. These investments are essential to research and scale new low-carbon technologies, to substitute the existing capital stock with sustainable alternatives, to shift business models away from harmful practices and to enable rich countries to support vulnerable ones in their climate resilience and biodiversity protection, all while ensuring that historically marginalized communities share in the broad prosperity created. Systems Change Lab is tracking six major shifts in the finance sector that can drastically transform how investments are scaled and allocated for a sustainable future. If these transformations are achieved together, it will enable the fundamental changes needed for the planet and people to thrive: Discover Accelerating Climate Action Show more A 2018 report by the Intergovernmental Panel on Climate Change found we have until 2030 – just 11 more years – to avert climate change. The run-up to 2020 is a crucial period for delivering sufficient climate action to limit global warming to 1.5°C, as countries move to expand their climate commitments. To help meet this global challenge, the World Economic Forum's 2019 Sustainable Development Impact summit has made Accelerating Climate Action one of four focus areas. Following the UN Secretary-General’s Climate Action Summit this month, this meeting will bring together stakeholders to cap global warming at 1.5°C through innovative partnerships and smart technologies. The action areas include heavy industries and transport, energy innovation, nature-based climate solutions, restoring ocean health and the role cities, among others. 1) Measure, disclose and manage climate- and nature-related financial risks The transition to a decarbonized and nature-positive future will disrupt products and services, especially those that have high emission outputs and are harmful to ecosystems. Not only are there risks to physical facilities, including factories and operations, but also to existing business models. Corporations, financial institutions and regulators must have access to information and a clear understanding of the risks and opportunities to target investments that advance sustainable transformations of their businesses. Accurate disclosures are needed to allow financial institutions and governments to deploy capital efficiently and monitor and manage risks at a portfolio and systemic level. An increasing number of corporations disclose their climate risks under standards created by the Sustainability Accounting Standards Board, which follows recommendations from the Taskforce for Climate-related Financial Disclosures. Analysis from the Systems Change Lab shows that 36% of the largest global companies have set climate risk disclosures (up from about 32% in 2021). By 2030, all of these businesses need to provide disclosures. There is also positive momentum regarding nature-related disclosures. The Taskforce for Nature-related Financial Disclosures framework is in the process of being finalized and has also received substantial support from the private sector. 36% of the world's largest global companies have set climate risk disclosures, expected to reach 100% before 2030. Image: Systems Change Lab Despite progress in adoption, disclosures have been on a voluntary basis with inconsistent quality and gaps in coverage. Governments must play a crucial role in mandating high-quality disclosures to ensure there is universal coverage and uniformity in reporting. Regulators are stepping up. The world’s largest economies and capital markets are considering mandating such disclosures and incorporating them into the supervision of their economies. In 2022, 36 countries planned or set mandatory climate-related disclosures aligned with the Taskforce for Climate-related Financial Disclosures. The countries include Brazil, India, Japan, the United Kingdom, countries in the European Union and the United States. 2) Scale up public finance for climate and nature The public sector can play a significant role in the protection of climate and nature by investing directly in climate initiatives and steering private markets, all while formulating policies that promote an equitable transition toward a green economy. Governments are the biggest allocators of capital in most economies, and their investment is crucial in areas where private finance is unable or unwilling to take a leading role such as development of new, high-risk technologies, public infrastructure and supporting underserved and marginalized communities. Recent climate legislation such as the U.S. Inflation Reduction Act is a concrete example of how the public sector can steer markets in new directions that favor decarbonization, allocate public finance to invest and develop new low-carbon solutions, and address inequities in disadvantaged communities. For example, policies like the Inflation Reduction Act are expected to significantly grow the amount of government investments in research and development of low-carbon technologies, currently estimated to be around $24 billion per year globally. Reactions from the business community, especially the finance sector, have been positive, recognizing that the legislation is expected to dramatically increase the scale of business opportunities and investments in both mature and nascent climate solutions. Climate finance needs to increase more than 10x faster than current trends to stay on track with climate goals. Image: Systems Change Lab To prevent some of the worst impacts of climate change, estimates suggest that public climate finance of at least $1.3 trillion will be needed every year by 2030. In 2020, it totaled $333 billion, significantly below the levels required to meet that target. To bridge the gap, financing needs to grow by more than eight times the historical rate. Fortunately, the Inflation Reduction Act and similar climate-focused legislation being planned in Europe and other major economies will help. Some estimates suggest that the Inflation Reduction Act will result in $1.2 trillion over 10 years in public incentives on clean technologies, with potential to go further depending on uptake. Finally, public finance from developed countries can play a key role in meeting their annual $100 billion commitment to support developing countries on climate mitigation and adaptation. In 2020, the amount totaled $83 billion, falling short of the target. The quality of financing also needs to improve as multilateral development banks, one of the main providers of climate finance, can increase share of grants and concessional loans to give developing countries greater financial flexibility in addressing their climate needs. New initiatives such as the Bridgetown Initiative that aim to help developing countries meet their climate goals by reforming the global financial architecture are gaining momentum and garnering attention. 3) Scale up private finance for climate and nature Meeting climate and nature goals also depends on the participation of the private sector. Some projections suggest that three-quarters of the estimated $5 trillion needed per year by 2030 will come from private sources while historically there has been an even split between public and private climate finance. The corporate sector can help scale the climate solutions needed to decarbonize our economies, but investments need to accelerate more than 10 times to reach the estimated $2.6 trillion to $3.9 trillion per year from the private sector by 2030. There are some signs of progress. Innovative firms have identified which new risks and business opportunities are developing out of the economic transition. An increasing number of firms are adapting their strategies and business models to reduce their exposure to such risks, setting net-zero targets to cut their emissions and investing in new products and services to grow in this new economic reality. The number of corporations with science-based targets that have been independently validated by the Science Based Targets initiative to align with the goals of the Paris Agreement grew 20% in 2022 and continues to increase. Such emissions-reduction targets are expected to influence their business strategies and investments, both on their own operations as well as capital allocated to other firms. But such corporate targets will require further scrutiny, improvement, robust oversight and implementation monitoring. The number of firms with validated science-based targets grew more than 15-fold in the last five years. Image: Systems Change Lab Investors are also aligning their investment allocation — about $7.5 trillion in assets — to net-zero targets by pushing high-emitting companies to change their businesses and shifting capital toward firms developing low-carbon solutions. Investor initiatives like Climate Action 100+ have engaged with the largest corporate emitters of greenhouse gases via joint shareholder proposals and escalation actions to reduce their emissions and adapt their businesses. The pool of capital aligned with net-zero targets is expected to expand as investors increasingly realize that sustainable business practices not only result in more competitive and resilient firms but also align with profitable financial returns. Finally, getting private finance involved in supporting developing countries in their decarbonization and adaptation efforts has long been a goal. While the record of de-risking private finance is mixed, recent initiatives like the Energy Transition Accelerator and the Just Energy Transition Partnerships are novel attempts to harness private finance to decarbonize middle- and low-income countries. 4) Extend economic and financial inclusion to underserved and marginalized groups Our current economic and financial systems have failed to be inclusive in sharing economic prosperity, resulting in historical inequities that have been perpetuated and sometimes worsened, further marginalizing already underserved groups. The transition to a decarbonized and sustainable economy provides an opportunity for historically underserved communities to share in new prosperity which will contribute to a more inclusive, fair and democratic society. Success in implementing a just transition will enable the world to meet the UN Sustainable Development Goals of eradicating poverty, reducing inequality and promoting full employment. Such progress is not only morally right but will also gain popular support and provide the political legitimacy and social stability that allow the transition to be accomplished. To do this, governments can coordinate with the private sector to create high-quality employment in green industries that will enable communities to work and participate in building a decarbonized future. Additionally, access to well-regulated financial resources, such as bank accounts and well-regulated lending, can help them build the financial security needed to become resilient and adapt to a changing environment. In 2021, 76% of the world's adult population had access to a bank account, indicating that the remaining 1.4 billion adults were still considered “unbanked.” The public sector can establish the infrastructure that facilitates access to financial services for all while also providing direct assistance to vulnerable communities with cash transfers, which serve as an entry point into the formal financial system and are an important aspect of social safety nets. Connecting green finance and financial inclusion. Image: Systems Change Lab 5) Price greenhouse gas emissions and other environmental externalities One of the largest challenges to shifting investments to a more sustainable future is the lack of accounting for the negative external costs generated by the fossil-fuel industry and other high polluters that get passed into society. These indirect costs, often referred to as “externalities,” are not adequately captured by prices despite the negative effects attributed to them such as lower quality of life, economic disruption and environmental degradation. As a result, polluters profit from their harmful activities and are not held accountable for these externalities while distorted prices can discourage changes in consumption patterns and efforts to reduce pollution. Applying a direct carbon price via carbon markets or a carbon tax on polluters can ensure that these external costs are properly accounted for in planning and decision-making that reduces environmental harm. While carbon pricing is not a silver bullet to solve climate change, it can complement a broader toolkit of approaches such as industrial policy and incentives for research and development of new low-carbon technologies. Similarly, taxing other environmentally harmful activities such as air pollution, natural resource use and waste can internalize their externalities which are estimated to reach $7.8 trillion annually by 2050. Currently only about 23% of global greenhouse gas emissions are covered by a direct carbon pricing regime. Pricing levels globally average about $23 per ton of carbon dioxide equivalent, which are well below the minimum of $170 required to prevent the most harmful impacts of climate change. To reach complete coverage by 2030 with at least some level of carbon pricing, coverage will need to grow nearly three times the historical rate. The share of GHG emissions covered by direct carbon pricing needs to accelerate 3x faster than historical rates. Image: Systems Change Lab 6) Eliminate harmful subsidies and financing Public and private investments continue to support activities that are incompatible with a sustainable future such as the development of new fossil fuel exploration and land degradation. Shifting investments toward a decarbonized future means stopping such harmful practices and redirecting capital to build a sustainable economy. The public sector continues to provide significant financing and investment to the fossil fuel industry via subsidies, financing from development finance institutions and fossil fuel investments from state-owned companies. Public financing for fossil fuels totaled $687 billion in 2020 — still very far from the phaseout needed by 2030 which requires a decreased pace of almost five times the historical rate. Public financing for fossil fuels needs to decrease 5x faster to achieve a phase-out by 2030. Image: Systems Change Lab Similarly, governments persist in granting detrimental agricultural subsidies that incentivize the overuse of land and excessive use of fertilizers and pesticide, which contribute to environmental degradation. For example, total agricultural support reached $530 billion in 2021 for the countries in the Organization for Economic Co-operation and Development plus 11 major developing economies and it is estimated that 87% of such support is “price-distorting or harmful to nature and health.” Agricultural and fisheries subsidies should be structured to reduce their environmental harm and encourage sustainable practices. Finance for a sustainable future Across these six shifts, we have already seen some positive developments from both public and private finance in channeling financial flows toward creating a green and sustainable economy. Although these signs are encouraging, current levels of investment are still far behind what is required.","filter_flag":1}
{"title":"Upcycled Del Monte Foods, Inc. Products Named Snack Product - CSRwire.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc3Njk0MS11cGN5Y2xlZC1kZWwtbW9udGUtZm9vZHMtaW5jLXByb2R1Y3RzLW5hbWVkLXNuYWNrLXByb2R1Y3RzLXllYXItMjAyMy1taW5kZnVs0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc3Njk0MS11cGN5Y2xlZC1kZWwtbW9udGUtZm9vZHMtaW5jLXByb2R1Y3RzLW5hbWVkLXNuYWNrLXByb2R1Y3RzLXllYXItMjAyMy1taW5kZnVs0gEA?oc=5","id":"CBMiemh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc3Njk0MS11cGN5Y2xlZC1kZWwtbW9udGUtZm9vZHMtaW5jLXByb2R1Y3RzLW5hbWVkLXNuYWNrLXByb2R1Y3RzLXllYXItMjAyMy1taW5kZnVs0gEA","guidislink":false,"published":"Fri, 16 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=167, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc3Njk0MS11cGN5Y2xlZC1kZWwtbW9udGUtZm9vZHMtaW5jLXByb2R1Y3RzLW5hbWVkLXNuYWNrLXByb2R1Y3RzLXllYXItMjAyMy1taW5kZnVs0gEA?oc=5\" target=\"_blank\">Upcycled Del Monte Foods, Inc. Products Named Snack Product<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CSRwire.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Upcycled Del Monte Foods, Inc. Products Named Snack Product - CSRwire.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc3Njk0MS11cGN5Y2xlZC1kZWwtbW9udGUtZm9vZHMtaW5jLXByb2R1Y3RzLW5hbWVkLXNuYWNrLXByb2R1Y3RzLXllYXItMjAyMy1taW5kZnVs0gEA?oc=5\" target=\"_blank\">Upcycled Del Monte Foods, Inc. Products Named Snack Product<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CSRwire.com<\/font>","source.href":"https:\/\/www.csrwire.com","source.title":"CSRwire.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"The company has won accolades for its innovative snacking products, building on recognition already received this year for its new brand JOYBA® Published 06-16-23 Submitted by Del Monte Foods WALNUT CREEK, Calif., June 16, 2023 \/CSRwire\/ – Del Monte® Gut Love and Boost Me Fruit Cup® Snacks with Infusions have been recognized as the Overall Snack Products of the Year by the 2023 Mindful Awards. The Mindful Awards highlight conscious companies and products in the Consumer Packaged Goods (CPG) industry that stand up for what’s right and take action to make a positive impact on people and the planet. This recognition for Del Monte Foods speaks to the company’s purpose as Growers of Good® to nourish people and the planet by making nutritious foods more accessible to all. The Del Monte® Gut Love and Boost Me Fruit Cup® Snacks with Infusions are made with real fruit like mangos and pineapples, and are infused with antioxidants and natural ingredients including Vitamin C, nourishing prebiotics, and coffee extract, making better for you snacking delicious and convenient. The two new products add to Del Monte’s existing products that are Upcycled Certified. Through Gut Love and Boost Me Fruit Cup® Snacks, the company is re-directing approximately 130,000 pounds of pineapple juice each year, helping to provide nutritious and affordable food, while reducing greenhouse gas emissions. “We’re constantly innovating to make great-tasting products that are more convenient and accessible to meet the needs of consumers’ ever-changing habits and lifestyles,” said Bibie Wu, Chief Marketing Officer for Del Monte Foods. “This recognition is a testament to the hard work of our team members in using sustainable practices to ensure that food reaches its highest and best purpose, while creating delicious snacks that bring joy to nutritious eating.” Del Monte Foods has launched a slew of new products during the past five years using breakthrough technologies in ingredients, packaging and processes. One of its latest brands, JOYBA®, was recently recognized by the Refrigerated and Frozen Food Awards as part of the Best New Retail Products for 2023. The brand’s Blueberry Pomegranate Bubble Tea ranked third of five new products of the year, decided by consumer vote. JOYBA® Bubble Tea is a first of its kind line of boba shop-inspired ready to drink beverages made with real brewed tea and popping boba, conveniently available in retail stores nationwide. Del Monte® Gut Love and Boost Me Fruit Cup® Snacks are available at major national retailers including Walmart and Kroger. JOYBA® Bubble Tea is available at select Target, Walmart, Costco, Sam’s Club and Circle K. To learn more and to locate a store partner near you, please visit www.delmonte.com and www.joyba.com. About Del Monte Foods For more than 135 years, Del Monte Foods, Inc. has been driven by our mission to nourish families with earth's goodness. As the original plant-based food company, we're always innovating to make nutritious and delicious foods more accessible to consumers across our portfolio of beloved brands, including Del Monte®, Contadina®, College Inn®, Kitchen Basics®, JOYBA®, Take Root Organics™ and S&W®. We believe that everyone deserves great tasting food they can feel good about, which is why we grow and produce our products using sustainable and earth-friendly practices for a healthier tomorrow. Del Monte Foods, Inc. is the U.S. subsidiary of Del Monte Pacific Limited (Bloomberg: DELM SP, DELM PM) and is not affiliated with certain other Del Monte companies around the world, including Fresh Del Monte Produce Inc., Del Monte Canada, or Del Monte Asia Pte. Ltd. For more information about Del Monte Foods and our products, please visit www.delmontefoods.com or www.delmonte.com.","filter_flag":1}
{"title":"The benefits to biodiversity of a strong circular economy - European Environment Agency","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vd3d3LmVlYS5ldXJvcGEuZXUvcHVibGljYXRpb25zL3RoZS1iZW5lZml0cy10by1iaW9kaXZlcnNpdHnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vd3d3LmVlYS5ldXJvcGEuZXUvcHVibGljYXRpb25zL3RoZS1iZW5lZml0cy10by1iaW9kaXZlcnNpdHnSAQA?oc=5","id":"CBMiQ2h0dHBzOi8vd3d3LmVlYS5ldXJvcGEuZXUvcHVibGljYXRpb25zL3RoZS1iZW5lZml0cy10by1iaW9kaXZlcnNpdHnSAQA","guidislink":false,"published":"Mon, 12 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=163, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vd3d3LmVlYS5ldXJvcGEuZXUvcHVibGljYXRpb25zL3RoZS1iZW5lZml0cy10by1iaW9kaXZlcnNpdHnSAQA?oc=5\" target=\"_blank\">The benefits to biodiversity of a strong circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">European Environment Agency<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The benefits to biodiversity of a strong circular economy - European Environment Agency","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vd3d3LmVlYS5ldXJvcGEuZXUvcHVibGljYXRpb25zL3RoZS1iZW5lZml0cy10by1iaW9kaXZlcnNpdHnSAQA?oc=5\" target=\"_blank\">The benefits to biodiversity of a strong circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">European Environment Agency<\/font>","source.href":"https:\/\/www.eea.europa.eu","source.title":"European Environment Agency","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"The circular economy aims to transform our economy from the current, mostly linear, take-make-waste model towards a closed-loop model. This transformation can minimise the use of materials and energy while reducing environmental pressures linked to resource extraction, emissions and waste (EEA, 2016). In this way, the circular economy principles provide solutions that achieve more sustainable production and consumption patterns, which in turn benefit biodiversity and nature through reduced resource extraction and waste. Nevertheless, the potential benefits circular economy has on biodiversity is somewhat overlooked. At the same time, growing efforts to reduce biodiversity loss, including recent initiatives such as the EU’s biodiversity strategy for 2030, the 2022 global agreement at the UN Biodiversity Conference, and the European Commission’s proposal for an EU nature restoration law, could benefit from further inclusion of circular economy actions. This briefing explores the intersections between the circular economy and biodiversity (see Ellen MacArthur Foundation, 2021; IUCN, 2022; Sitra, 2022) and advocates a biodiversity-inclusive circular economy. It is based on the European Topic Centre on Circular Economy and Resource Use report. Drivers of and pressures on biodiversity loss Biodiversity and well-functioning ecosystems are the very foundation of our economy and well-being. We depend on ecosystems services for our food, materials, clean water, climate regulation, and cultural and spiritual enrichment, among many other things. However, biodiversity is facing a threat unprecedented in human history. Three quarters of the Earth’s terrestrial area and two thirds of its marine environment have been significantly altered by human activities, putting about 1 million species at direct risk of extinction, and prompting experts to argue that we are already experiencing a sixth ‘mass extinction event’ (IPBES, 2019). The magnitude of this problem has led the UN to include biodiversity loss as one of the triple planetary crises facing humanity, together with climate change and pollution. This alarming global trend is evident in Europe as well. European natural ecosystems have declined both in extent, e.g. wetland has declined by 50% since 1970, and in species diversity, e.g. 28% of species living exclusively in Europe and Central Asia are threatened. Moreover, landscapes and seascapes have become more uniform in their species composition and thus their diversity has declined (IPBES, 2018). So what is driving this alarming rate of biodiversity loss? The Intergovernmental Science-Policy Platform on Biodiversity and Ecosystem Services (IPBES) points to five key anthropogenic drivers of biodiversity loss, namely habitat loss, overexploitation of natural resources, climate change, pollution and invasive alien species. Figure 1 illustrates these drivers, providing examples from Europe. Figure 1. Key drivers of biodiversity loss These drivers are the result of underlying anthropogenic activities, which is referred to as ‘pressures’ (Figure 2). Key pressures include: Land use, land cover and land management changes: the significant increase in land needed for anthropogenic activities such as agriculture and built-up areas has left little room for habitats for plants, animals and ecosystems to thrive in. the significant increase in land needed for anthropogenic activities such as agriculture and built-up areas has left little room for habitats for plants, animals and ecosystems to thrive in. Material use: our demand for materials and resources can lead to habitat loss and overexploitation of natural resources during the extraction, processing and use stages of the life cycle. Demand for materials can also increase the spread of invasive species, e.g. when new plant species are introduced into agriculture or forestry to fulfil anticipated consumer demand, or by accident, because the threat of invasive species is often intensified in disturbed habitats. our demand for materials and resources can lead to habitat loss and overexploitation of natural resources during the extraction, processing and use stages of the life cycle. Demand for materials can also increase the spread of invasive species, e.g. when new plant species are introduced into agriculture or forestry to fulfil anticipated consumer demand, or by accident, because the threat of invasive species is often intensified in disturbed habitats. Energy system: producing energy can cause climate change through greenhouse gas emissions, habitat loss during resource extraction and overexploitation of biomass. The increasing demand for biomass needs to consider the biophysical limits, as one parcel of land cannot indefinitely satisfy competing demands for biomass provision and biodiversity conservation (EEA, forthcoming). producing energy can cause climate change through greenhouse gas emissions, habitat loss during resource extraction and overexploitation of biomass. The increasing demand for biomass needs to consider the biophysical limits, as one parcel of land cannot indefinitely satisfy competing demands for biomass provision and biodiversity conservation (EEA, forthcoming). Waste and emissions: producing the goods and services we consume creates harmful greenhouse gases and causes water, soil and air pollution. In addition, in most production sectors and consumption domains, waste is generated that may lead to pollution, especially in cases of improper waste management. How our current production and consumption patterns impact biodiversity The source of these drivers of and pressures on biodiversity is our production and consumption systems (Figure 2). The International Resource Panel estimates that 90% of global biodiversity loss can be attributed to the extraction of natural resources (mainly agriculture) and that we are heading towards a doubling of material extraction by 2060 (IRP, 2019). This means that the entire production and consumption system must be transformed if we are to reduce the alarming trend in biodiversity loss. Targeting individual drivers or pressures without considering our production and consumption systems will have limited effect. Circular economy’s contribution to halting biodiversity loss Circular economy has the potential to reduce the impact of our production and consumption systems on biodiversity through three key areas of intersection (Figure 2): Reduce primary resource demand can be achieved by changing consumption patterns, extending product lifespans, recycling materials and adopting circular business models (EEA, 2021b). Lower demand for primary resources decreases the demand for excavation activities and for converting natural habitats into cropland or monocrop plantations. As a result, key drivers of biodiversity loss, including habitat loss, overexploitation and the introduction of invasive species, will be eased. Preventing pollution can be achieved by phasing out hazardous substances, reducing emissions and other forms of leakage, and promoting closed and clean loops (EEA, 2022a). This in turn reduces the impacts on biodiversity of pollution, such as air pollution, fertiliser run-off, or leakage of toxic chemicals, but also contributes to climate change mitigation by lowering greenhouse gas emissions from waste decomposition. Biodiversity-friendly supply relates to the sourcing and cultivation of raw materials). It can be achieved by reducing the negative impact of resource extraction, e.g. by improving environmental practices in the forestry sector or by promoting the regeneration of natural habitats in areas where resources are extracted (e.g. silvopasture or agroforestry). This in turn contributes to more resilient production and consumption systems. Figure 2. How the circular economy can reduce the loss of biodiversity attributed to our production and consumption systems Source: European Topic Centre on Circular Economy and Resource Use and EEA. Examples of circular economy actions that can reduce pressure on biodiversity To illustrate how this could look in practice, we use examples of product value chains that put considerable pressure on biodiversity, namely the food, construction and textile sectors (Kurth et al., 2021). The examples have been selected for illustrative and inspirational purposes and have not been subjected to impact assessments for this briefing. Food The food and agriculture sector is a major contributor to the loss of biodiversity and ecosystem services, due to land use change (habitat loss) and land use intensification in particular (Jaureguiberry et al., 2022; ETC CE, 2023). About half of the world’s habitable land is currently used for agriculture, and nearly two thirds of all species are threatened by agriculture and aquaculture (Sitra, 2022). Hence, using circular economy actions to change the current food and biomass production systems is critical to change the current trend in biodiversity loss. It is also an area where the concept of ‘regeneration’ can be further explored. The following examples of circular economy actions that reduce pressure on biodiversity from the food and agriculture sectors illustrate the potential in this value chain: Projects that recycle nutrients from agricultural waste into animal feed and fertilisers using insects increase the efficiency of resource and material use and reduce the land needed (habitat loss) to produce feed and can produce a more environmentally friendly fertiliser to regenerate soils. Using seaweed to produce a biodiversity-friendly supply of food, animal feed and fertiliser can also help regenerate local marine ecosystems by absorbing nutrients and CO 2 , and requires no synthetic inputs. Construction Infrastructure and buildings are currently designed, developed and demolished in a predominantly linear way, leading to a significant environmental impact and fragmentation of landscapes. Globally, the construction sector is responsible for more than a third of global material resource consumption, including 12% of all freshwater and 85% of all mining material, and significantly contributes to the generation of solid waste (UNEP, 2011). Construction and demolition waste streams account for approximately 37% of all waste generated in the EU (Eurostat, 2022). Circular economy examples in the construction sector that benefit biodiversity include: projects that re-circulate water from green rooftops for use in urban pools, toilet flushing and irrigation, which increases the effective use of resources and materials; using by-products from other sectors (industrial symbiosis) to produce construction materials, or reusing and recycling existing materials (EEA 2022b). These examples can help reduce the demand for primary resources, thereby reducing habitat loss and overexploitation of natural resources. Moreover, as illustrated with green roofs, such actions can also provide co-benefits in terms of temperature control and reducing air pollution. Textiles The textile supply chain for consumption in Europe cause on average the fourth highest pressures on the environment and climate after food, housing and mobility. More specifically it causes the third highest water and land use and the fifth highest use of materials and greenhouse gas emissions, (EEA, 2021c). Less than 1% of material used to produce clothing is recycled into new clothing (Ellen MacArthur Foundation, 2017). Over 90% of the water and land used for producing textiles consumed in Europe occurs outside Europe (EEA, 2022c). Examples of projects in the textile sector that increase circularity and reduce pressure on biodiversity include: projects that produce raw materials for textiles using agroforest production methods and industrial by-products; extending the lifespan of clothes by leasing and repairing them, or advancing techniques to recycle, for example, cellulose fibres. These examples cover all three areas of intersection (reduce use of primary resources, preventing pollution, and biodiversity-friendly sourcing). They help reduce water and land use, and can keep fibres and (non-toxic) chemicals within closed loops. The above examples represent a small selection of how circular economy actions can be used to reduce the pressure on biodiversity from our production and consumption systems. These actions can also help address other environmental threats, including climate change and pollution. A biodiversity-inclusive circular economy By maintaining the value of products, materials and other resources in the economy for as long as possible, enhancing their efficient use in production and consumption, and returning them to the product cycle at the end of their life, circular economy measures reduce the need for resource extraction and reduce waste, which can help reduce the current rate of biodiversity loss. These two principles are commonly covered when discussing circular economy measures and strategies (Figure 3). However, to further enhance the positive impact of the circular economy and not only reduce but also reverse biodiversity loss, more attention needs to be devoted to biodiversity-friendly sourcing efforts. This entails reducing harm to nature but also, importantly, adopting regenerative production practices in, for example, agriculture, aquaculture and forestry, including nutrient retention, soil conservation, water management and sustainable pest management. A recent study found that a circular economy built around regenerative production principles can halt and even partly reverse biodiversity loss (Sitra, 2022). The positive impacts that the circular economy can have on biodiversity (and climate change) should not be taken for granted but need to become a central part of designing and implementing circular economy actions. How resources are sourced and cultivated needs to be added to the traditional hierarchy of ‘reduce, reuse and recycle’. This entails bridging links between how we make use of materials in our economy and how we produce and source them in the first place (Figure 3). From the case studies examined above, eco-design came up as a crucial ‘circular touchpoint’ for both enhancing the circularity of products and ensuring that the resources used to make the products come from a biodiversity-friendly supply chain. The circular economy is, however, not a panacea; policies and measures specifically designed for biodiversity protection remain indispensable (e.g. the EU biodiversity strategy and the European Commission’s proposal for a nature restoration law). Figure 3. A biodiversity-inclusive circular economy Source: EEA. Policymakers, business and citizens all play a vital role Policymakers play a crucial role in developing the necessary framework for further integrating the circular economy and biodiversity. It can be challenging to tackle individual pressures on or drivers of biodiversity loss, as actions targeting one driver may negatively affect other drivers (Sitra, 2022). Therefore, policymakers need to adopt a systemic approach to integrating biodiversity and circular economy that considers multiple factors across the entire life cycle of goods and services. More systemic approaches that integrate the circular economy and biodiversity are essential to leverage synergies while mitigating trade-offs. The European Green Deal and the EU’s taxonomy for a sustainable finance system are important steps in this direction by integrating a broad range of agendas, including biodiversity and the circular economy. Other policies, such as eco-design, green public procurement, material and reporting requirements, and due diligence for supply chains, also represent avenues for further development of a more biodiversity-inclusive circular economy. Businesses have a role in developing and upscaling technical innovations and circular eco-design options. This means (1) continuing to work on enhancing the reusability, repairability and recyclability of their products, (2) ensuring that components do not leak into the environment and (3) carefully considering the materials and resources used and how they are sourced. Implementing corporate sustainability strategies is vital, including adopting biodiversity targets and ensuring compliance from the supply chain, recognising that biodiversity loss is not only bad for us and our environment but is also a key business risk. Lastly, citizens can play their part in the transformation by reducing consumption levels and demanding more biodiversity-friendly choices. Dietary shifts alone can free up a significant amount of land and reduce water use, as well as reducing greenhouse gas emissions. The difficult issues of overconsumption and sufficiency will need to be addressed at the same time as the more technical approaches to the circular economy, in order to allow biodiversity and ecosystems to regenerate. However, the responsibility for shifts in consumption patterns needs to be shared between public authorities, businesses and consumers. The circular economy has quickly become a political priority, but we need to remember that it is not an end in itself — it is a means to an end. Reducing biodiversity loss needs to be one of the overarching aims of the circular economy, and therefore we need to make it more biodiversity inclusive.","filter_flag":1}
{"title":"Del Monte fights food waste - Supermarket Perimeter","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LnN1cGVybWFya2V0cGVyaW1ldGVyLmNvbS9hcnRpY2xlcy8xMDQzOS1kZWwtbW9udGUtZmlnaHRzLWZvb2Qtd2FzdGXSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LnN1cGVybWFya2V0cGVyaW1ldGVyLmNvbS9hcnRpY2xlcy8xMDQzOS1kZWwtbW9udGUtZmlnaHRzLWZvb2Qtd2FzdGXSAQA?oc=5","id":"CBMiT2h0dHBzOi8vd3d3LnN1cGVybWFya2V0cGVyaW1ldGVyLmNvbS9hcnRpY2xlcy8xMDQzOS1kZWwtbW9udGUtZmlnaHRzLWZvb2Qtd2FzdGXSAQA","guidislink":false,"published":"Sun, 11 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=162, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LnN1cGVybWFya2V0cGVyaW1ldGVyLmNvbS9hcnRpY2xlcy8xMDQzOS1kZWwtbW9udGUtZmlnaHRzLWZvb2Qtd2FzdGXSAQA?oc=5\" target=\"_blank\">Del Monte fights food waste<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Supermarket Perimeter<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Del Monte fights food waste - Supermarket Perimeter","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LnN1cGVybWFya2V0cGVyaW1ldGVyLmNvbS9hcnRpY2xlcy8xMDQzOS1kZWwtbW9udGUtZmlnaHRzLWZvb2Qtd2FzdGXSAQA?oc=5\" target=\"_blank\">Del Monte fights food waste<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Supermarket Perimeter<\/font>","source.href":"https:\/\/www.supermarketperimeter.com","source.title":"Supermarket Perimeter","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"One of the pillars of Del Monte Foods’ corporate responsibility philosophy is its commitment to reducing food waste. The company put that commitment into practice with the announcement that several of its products have been Upcycled Certified by the Upcycled Food Association, the world’s only third-party certification program for upcycled food ingredients and products. Over the last two years, Del Monte Foods has helped lead the upcycled food movement. In 2021, the company announced the industry’s first canned vegetable products to be Upcycled Certified. In 2022 Del Monte Gut Love and Boost Me Fruit Infusions received their own certifications. According to Feeding America, 119 billion pounds of food are wasted in the United States each year, with devastating consequences for people and the planet. It is also estimated by the Environmental Protection Agency that food loss and waste account for 8% of global greenhouse gas emissions. Del Monte Foods actively seeks ways to redirect surplus product, helping to provide healthy and affordable food while reducing greenhouse gas emissions, according to the company. Del Monte has a dedicated task force that reviews food waste streams monthly to find more ways to divert food from landfills through upcycling and food donations. “In line with our Growers of Good mission, we’re always seeking to innovate our products and processes in ways that better both our people and the planet,” said Greg Longstreet, president and CEO of Del Monte Foods. “Recognizing the global impacts of food waste, we’re in a fortunate position to make a difference and use our scale for good.” Through Del Monte Foods’ upcycling efforts, the company has: Diverted 10 million pounds of peach pieces from landfills through a Feeding America partnership. Upcycled approximately 600,000 pounds (270 tons) of surplus green beans, pineapple juice and boba syrup in fiscal 2022. Del Monte will continue to identify opportunities to expand upcycling across its portfolio of brands, according to the company. For example, it’s currently testing ways to repurpose peach slivers and small grapes into new products. This article is an excerpt from the November 2023 issue of Supermarket Perimeter. You can read the entire Corporate Responsibility feature and more in the digital edition here.","filter_flag":1}
{"title":"EPG outlines FY23\/24 business plan with a 10% sales growth target from ready-to-profit new products - Nation Thailand","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPGh0dHBzOi8vd3d3Lm5hdGlvbnRoYWlsYW5kLmNvbS9wci1uZXdzL21vcmUvcHItbmV3cy80MDAyODE4MNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPGh0dHBzOi8vd3d3Lm5hdGlvbnRoYWlsYW5kLmNvbS9wci1uZXdzL21vcmUvcHItbmV3cy80MDAyODE4MNIBAA?oc=5","id":"CBMiPGh0dHBzOi8vd3d3Lm5hdGlvbnRoYWlsYW5kLmNvbS9wci1uZXdzL21vcmUvcHItbmV3cy80MDAyODE4MNIBAA","guidislink":false,"published":"Thu, 01 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=152, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPGh0dHBzOi8vd3d3Lm5hdGlvbnRoYWlsYW5kLmNvbS9wci1uZXdzL21vcmUvcHItbmV3cy80MDAyODE4MNIBAA?oc=5\" target=\"_blank\">EPG outlines FY23\/24 business plan with a 10% sales growth target from ready-to-profit new products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nation Thailand<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"EPG outlines FY23\/24 business plan with a 10% sales growth target from ready-to-profit new products - Nation Thailand","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPGh0dHBzOi8vd3d3Lm5hdGlvbnRoYWlsYW5kLmNvbS9wci1uZXdzL21vcmUvcHItbmV3cy80MDAyODE4MNIBAA?oc=5\" target=\"_blank\">EPG outlines FY23\/24 business plan with a 10% sales growth target from ready-to-profit new products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nation Thailand<\/font>","source.href":"https:\/\/www.nationthailand.com","source.title":"Nation Thailand","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Although the global economy is recovering, there are still concerns to be aware of, such as geopolitical conflicts, inflation, energy costs, and climate change. As a result, EPG's global market presence is a key challenge, with the goal of expanding further in fiscal year 23\/24 (April 23 - March 24). The company's primary focus is on operations as seen below. 1) Achieve an Organic Growth: With existing products and innovative products in all business segments certified to several significant standards, the company is able to respond to the needs of customers comprehensively, assisting in the retention of existing customers while expanding to new customer groups. We also search for key strengths in each business group, including how to increase production efficiency and how to reduce costs, etc. 2) Be committed to R&D and the creation of innovative products for New S-Curve to support our core businesses and to create new potential businesses in the future. 3) Synergize business in Australia for a turnaround. 4) Establish long-term goals of \"Net Zero\" greenhouse gas emissions by 2042. During the previous fiscal year, the subsidiary installed a solar roof top with a total power capacity of about 18 MW, and the company has planned its production for this fiscal year to support the use of solar energy for maximum value and efficiency.","filter_flag":1}
{"title":"Guardian print operation comprises 71% of CO2 emissions (but 28% of revenue) - Press Gazette","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vcHJlc3NnYXpldHRlLmNvLnVrL25ld3MvZ3VhcmRpYW4tc3VzdGFpbmFiaWxpdHktcmVwb3J0LWNvMi1lbWlzc2lvbnMtcHJpbnQv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vcHJlc3NnYXpldHRlLmNvLnVrL25ld3MvZ3VhcmRpYW4tc3VzdGFpbmFiaWxpdHktcmVwb3J0LWNvMi1lbWlzc2lvbnMtcHJpbnQv0gEA?oc=5","id":"CBMiU2h0dHBzOi8vcHJlc3NnYXpldHRlLmNvLnVrL25ld3MvZ3VhcmRpYW4tc3VzdGFpbmFiaWxpdHktcmVwb3J0LWNvMi1lbWlzc2lvbnMtcHJpbnQv0gEA","guidislink":false,"published":"Wed, 07 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=158, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vcHJlc3NnYXpldHRlLmNvLnVrL25ld3MvZ3VhcmRpYW4tc3VzdGFpbmFiaWxpdHktcmVwb3J0LWNvMi1lbWlzc2lvbnMtcHJpbnQv0gEA?oc=5\" target=\"_blank\">Guardian print operation comprises 71% of CO2 emissions (but 28% of revenue)<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Press Gazette<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Guardian print operation comprises 71% of CO2 emissions (but 28% of revenue) - Press Gazette","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vcHJlc3NnYXpldHRlLmNvLnVrL25ld3MvZ3VhcmRpYW4tc3VzdGFpbmFiaWxpdHktcmVwb3J0LWNvMi1lbWlzc2lvbnMtcHJpbnQv0gEA?oc=5\" target=\"_blank\">Guardian print operation comprises 71% of CO2 emissions (but 28% of revenue)<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Press Gazette<\/font>","source.href":"https:\/\/pressgazette.co.uk","source.title":"Press Gazette","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"The Guardian Media Group offices at Kings Place, London. Picture: Graeme Robertson Guardian Media Group has published its second “positive impact and sustainability report”, revealing that print remains by far its biggest source of greenhouse gas emissions. Improvements in supply chain and declining print circulation have played their part in reducing The Guardian’s carbon footprint. More subtle changes include a ban on serving beef in the company canteen. The company, which publishes The Guardian and Observer newspapers, is attempting to eliminate two-thirds of its 2020 greenhouse emissions by 2030. The business is not counting carbon offsets, for example tree planting, in its progress toward that goal. The report shows that GMG is ahead of target – despite a small year-on-year increase in its emissions. Related And it also provides an insight into the demographics at The Guardian and Observer today, showing that parts of the business are substantially less white or male than others. Subscribe to our newsletters View all newsletters Never miss a story Press Gazette Sign up here Select and enter your email address Future of Media Weekly insight into the big strategic issues affecting the future of the news industry. Essential reading for media leaders every Thursday. Press Gazette Daily Your morning brew of news about the world of news from Press Gazette and elsewhere in the media. Sent at around 10am UK time. Future Of Media USA Our weekly does of strategic insight about the future of news media aimed at US readers. Marketing Matters A fortnightly update from the front-line of news and advertising. Aimed at marketers and those involved in the advertising industry. Your email address Job title Job title Business owner\/co-owner CEO COO CFO CTO Chairperson Non-Exec Director Other C-Suite Managing Director President\/Partner Senior Executive\/SVP or Corporate VP or equivalent Director or equivalent Group or Senior Manager Head of Department\/Function Manager Non-manager Retired Other Job title Business owner\/co-owner CEO COO CFO CTO Chairperson Non-Exec Director Other C-Suite Managing Director President\/Partner Senior Executive\/SVP or Corporate VP or equivalent Director or equivalent Group or Senior Manager Head of Department\/Function Manager Non-manager Retired Other Sign up Visit our privacy Policy for more information about our services, how Progressive Media Investments may use, process and share your personal data, including information on your rights in respect of your personal data and how you can unsubscribe from future marketing communications. Thank you Thanks for subscribing. Close [Read more: UK press embraced nuclear power and fracking over renewables in 2022] Print dominates The Guardian’s carbon dioxide emissions GMG found it produced 23,907 tonnes of carbon dioxide equivalent (tCO2e) emissions in the year to March 2022, a 7% rise on the year to March 2021. The company attributed that rise to the end the pandemic and a subsequent increase in business travel and print newspaper circulations compared to lockdown-hit 2020. However, GMG emphasised that the newest figure was still 30% lower than 2019\/20, when pre-pandemic emissions stood at 33,949 tCO2e. The figure is also lower than the company’s target emissions goal for 2021\/22, which was 23,907 tCO2e – meaning GMG is approximately two years ahead of its emissions reduction targets. Some 71% of the 2021\/22 emissions came from The Guardian and Observer’s print products. The GMG print operation produced 16,969 tonnes of carbon dioxide equivalent in that year, approximately as much greenhouse gas as 2,000 UK homes. In comparison, digital products accounted for 11% of GMG’s carbon footprint in 2021\/22, a proportion which was itself 28% smaller than the year previous. Emissions associated with digital products included the energy used by readers to access theguardian.com and its apps, as well as energy used by Guardian servers. GMG chief executive Anna Bateson disclosed last month that 70% of the company’s revenues now come from digital sources. The paper announced in 2011 that it would become digital-first, then a rarity among the British press. GMG will likely remain invested in print for some time longer, however. Although The Guardian and Observer no longer disclose their circulation figures through ABC, for many publishers print remains a valuable, if diminishing, source of revenue. GMG’s financial results for the year to 3 April 2022 show print circulation accounted for £71.5m of the company’s total £255.6m revenue that year. Nonetheless, emissions from printing were down by 18%, and emissions from producing paper down by 25%, since 2019\/20 - suggesting that declining circulation is playing its part in reducing the carbon footprint. According to the sustainability report, 64% of the paper used by GMG - some 29,000 tonnes - goes to printing The Guardian or The Observer. Some 63% of that paper, in turn, is 100% recycled. (Paper fibres degrade across repeated recycling, so must be supplemented with some “virgin” fibre.) Higher-quality magazine paper for supplements, meanwhile, accounted for 36% of the company’s paper consumption in 2021\/22. Only 18% of the fibre for this paper is recycled, although GMG says it only uses paper “from recycled fibre or from sustainably managed forests certified by the Forest Stewardship Council”. Both GMG’s headquarters at Kings Place in London and its offices in Australia use 100% renewable energy, the company says. Emissions associated with catering, meanwhile, have dropped both the last two years despite the post-lockdown return to the office. The report notes GMG has “removed beef completely from the menus” and ensured more than half of food options are vegan or vegetarian. Asked whether it was fair to credit declining circulation for a drop in emissions, a Guardian News and Media spokesperson said: \"We expect emissions from this area to continue to fall over the coming years regardless of fluctuations in circulation due to (among other things) reduced waste and greater use of renewable energy in the supply chain, and the introduction of cleaner vehicles for distribution. Our print products are cherished by readers and are a core part of how we make an impact with our journalism.\" [Read more: Pulp friction - Why paper has become a huge headache for publishers] Guardian US: less white, more women The report also paints a picture of two demographically distinct Guardian newsrooms either side of the Atlantic. In the US, people of colour (POC) represent 41% of GMG’s workforce, up from 38% last year. In the UK that figure is 18%, approximately representing the British population in general. The company is targeting 20% POC representation among staff in the UK. The racial pay gap, however, is bigger in the US than the UK. In 2022\/21 Guardian US recorded a 12.4% gap between white and POC colleagues, versus a 10.8% median and 8.5% mean gap in the UK. In the UK, The Guardian says the proportion of women at the organisation has risen from 44% in 2017 to 48% in 2022. Women make up 43% of the top-paid half of staff (up from 36% in 2017) and the median gender pay gap was 9% (12.1% in 2017). The mean pay gap was 8.6% (11.3% in 2017) and 48% of those promoted were women. Over in the US, The Guardian is majority-women: 61% of staff are women, a two point rise on last year. The company does not publicly share its US pay gap figures, but says they are provided to staff annually. [Read more: Gender pay gap at UK media companies narrows to 12%] Email pged@pressgazette.co.uk to point out mistakes, provide story tips or send in a letter for publication on our \"Letters Page\" blog","filter_flag":1}
{"title":"How Secondary Market Can Help Tame E-Waste Crisis - EE Times","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmVldGltZXMuY29tL2hvdy1zZWNvbmRhcnktbWFya2V0LWNhbi1oZWxwLXRhbWUtZS13YXN0ZS1jcmlzaXMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmVldGltZXMuY29tL2hvdy1zZWNvbmRhcnktbWFya2V0LWNhbi1oZWxwLXRhbWUtZS13YXN0ZS1jcmlzaXMv0gEA?oc=5","id":"CBMiSmh0dHBzOi8vd3d3LmVldGltZXMuY29tL2hvdy1zZWNvbmRhcnktbWFya2V0LWNhbi1oZWxwLXRhbWUtZS13YXN0ZS1jcmlzaXMv0gEA","guidislink":false,"published":"Fri, 16 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=167, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmVldGltZXMuY29tL2hvdy1zZWNvbmRhcnktbWFya2V0LWNhbi1oZWxwLXRhbWUtZS13YXN0ZS1jcmlzaXMv0gEA?oc=5\" target=\"_blank\">How Secondary Market Can Help Tame E-Waste Crisis<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EE Times<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How Secondary Market Can Help Tame E-Waste Crisis - EE Times","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmVldGltZXMuY29tL2hvdy1zZWNvbmRhcnktbWFya2V0LWNhbi1oZWxwLXRhbWUtZS13YXN0ZS1jcmlzaXMv0gEA?oc=5\" target=\"_blank\">How Secondary Market Can Help Tame E-Waste Crisis<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EE Times<\/font>","source.href":"https:\/\/www.eetimes.com","source.title":"EE Times","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"By Marcus Shen 1 \/\/php echo do_shortcode('[responsivevoice_button voice=\"US English Male\" buttontext=\"Listen to Post\"]') ?> Despite increasing awareness of e-waste and the implementation of recycling initiatives in many countries, the electronic waste problem continues to persist. According to the Global E-waste Monitor 2020 report, only 17.4% of the 53.6 million metric tons of electronic waste generated worldwide in 2019 was recycled. Changing regulations for reducing e-waste can take months, if not years, to approve. But that’s not the only solution. Responsible businesses can aid in turning the tables on the e-waste crisis using the secondary market. With only a small percentage of e-waste recycled, the circular economy can play a pivotal role in reducing the environmental and health impact of e-waste. Businesses and major wireless retailers can sell excess and trade-in inventory–electronics and mobile devices in particular–to business buyers who are capable of recycling, reselling or refurbishing said goods. Resellers and refurbishers with an R2 certification are qualified to handle the proper recycling and extracting of precious metals found inside cell phones, such as gold and silver, thus reducing the demand for new mining of these metals. Partner Content View All By Hynetek Semiconductor 06.20.2024 By Nantian Electronics Co., Limited 06.20.2024 By FLIR Systems 06.19.2024 Whether inventory is overproduced, unpopular, returned unused or well-loved and traded in, electronic goods become obsolete especially quickly compared with other types of merchandise. Thanks to “recommerce,” preowned or refurbished electronics can make their way into the hands of end consumers looking for a discounted or older model. This practice keeps products that still have value out of landfills while conserving resources and reducing greenhouse gas emissions associated with manufacturing new products. For those responsible for inventory reduction, excess electronics can be a challenge due to the costs of refurbishment, storage, transportation, labor, and other overhead. Pair these issues with mounting customer returns in a fast-moving industry, and businesses have quite a problem on their hands. Fortunately, there is demand for the goods that businesses might not be able to effectively liquidate with in-house solutions: There is now a genuine opportunity to turn unsold inventory into cash while maximizing operational efficiency and saving on disposal fees and logistics costs. Businesses can recover the best value for their products through data-backed decision-making. For example, according to B-Stock’s network-wide data, computers and tablets grouped in smaller lots tend to recover more. This one insight is just the beginning of what a great inventory reduction platform can provide. By using a fully managed asset recovery solution with a broad buyer network, retailers and manufacturers can sustainably sell amounts of surplus that would be overwhelming with traditional methods. While it’s true that recycling initiatives have had some impact in reducing the amount of e-waste, they have not been able to significantly address the root causes of the problem. One of the main reasons is the lack of infrastructure and regulations to properly collect, transport, and process e-waste. Even in countries with recycling programs, not all e-waste is properly collected or disposed of, and much of it ends up being exported to developing countries where it is often processed in unsafe and environmentally damaging ways. For example, causing chemical leaching. Additionally, companies sometimes create products intended to last just a few years. While the intent of this practice is to create a positive and consistent user experience, the unintended result is a constant stream of e-waste. It’s also worth noting the role that consumer behavior plays. Last year, 5.3 billion mobile phones were discarded. Many people are not aware of the importance of recycling e-waste, and even those who are may not know how to properly dispose of their electronics. Some people may also prioritize convenience over responsible disposal, leading to e-waste being thrown in the trash instead of being recycled. By tapping into the secondary market, businesses can ease pressure on overfilled warehouses by selling preowned and excess electronics in a more sustainable way. This opportunity not only increases the velocity of a business’s value recovery on said goods but helps reduce waste by ensuring surplus products and materials fall into the hands of consumers. A circular economy is a win-win for business, consumers, and the earth. Marcus Shen is the CEO of B-Stock.","filter_flag":1}
{"title":"St Regis Group Announces Partnership With TUMI - Advertising Specialty Institute","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vbWVtYmVycy5hc2ljZW50cmFsLmNvbS9uZXdzL25ld3NsZXR0ZXJzL3Byb21vZ3JhbS9qdW5lLTIwMjMvc3QtcmVnaXMtZ3JvdXAtYW5ub3VuY2VzLXBhcnRuZXJzaGlwLXdpdGgtdHVtaS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vbWVtYmVycy5hc2ljZW50cmFsLmNvbS9uZXdzL25ld3NsZXR0ZXJzL3Byb21vZ3JhbS9qdW5lLTIwMjMvc3QtcmVnaXMtZ3JvdXAtYW5ub3VuY2VzLXBhcnRuZXJzaGlwLXdpdGgtdHVtaS_SAQA?oc=5","id":"CBMic2h0dHBzOi8vbWVtYmVycy5hc2ljZW50cmFsLmNvbS9uZXdzL25ld3NsZXR0ZXJzL3Byb21vZ3JhbS9qdW5lLTIwMjMvc3QtcmVnaXMtZ3JvdXAtYW5ub3VuY2VzLXBhcnRuZXJzaGlwLXdpdGgtdHVtaS_SAQA","guidislink":false,"published":"Tue, 06 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=157, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vbWVtYmVycy5hc2ljZW50cmFsLmNvbS9uZXdzL25ld3NsZXR0ZXJzL3Byb21vZ3JhbS9qdW5lLTIwMjMvc3QtcmVnaXMtZ3JvdXAtYW5ub3VuY2VzLXBhcnRuZXJzaGlwLXdpdGgtdHVtaS_SAQA?oc=5\" target=\"_blank\">St Regis Group Announces Partnership With TUMI<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Advertising Specialty Institute<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"St Regis Group Announces Partnership With TUMI - Advertising Specialty Institute","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vbWVtYmVycy5hc2ljZW50cmFsLmNvbS9uZXdzL25ld3NsZXR0ZXJzL3Byb21vZ3JhbS9qdW5lLTIwMjMvc3QtcmVnaXMtZ3JvdXAtYW5ub3VuY2VzLXBhcnRuZXJzaGlwLXdpdGgtdHVtaS_SAQA?oc=5\" target=\"_blank\">St Regis Group Announces Partnership With TUMI<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Advertising Specialty Institute<\/font>","source.href":"https:\/\/members.asicentral.com","source.title":"Advertising Specialty Institute","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"The supplier of awards and incentive products now offers select bags, backpacks and luggage from the retail brand. St Regis Group (asi\/84592; Canada, asi\/84595) has added new premium products to its line of awards, incentive items and corporate gifts. The supplier, with locations in Itasca, IL, and Markham, ON, announced a new partnership with Edison, NJ-based retail luggage company TUMI and will now offer select bags, backpacks and luggage from the lifestyle brand to distributors in the U.S. and Canada. The TUMI Alpha Short Trip expandable 4-wheel carry-on (TUM1019-BK) is now available from St Regis Group. “TUMI is a cherished international brand, and we’re thrilled to introduce its line of products to our customers,” said Richard Firkser, president and CEO of St Regis Group. “TUMI brings exceptional quality and high-performance products to our growing collection of bags, backpacks and now luggage.” TUMI bags are made with a specially designed ballistic nylon with a tight weave and special coating that offer extra durability. Shown here is the TUMI Corporate Collection Crossbody (TUM1002-BK) from St Regis Group. The supplier has been adding to its product line in recent months – in late 2022, it acquired Clearmount (asi\/45440), a Scarborough, ON-based supplier of custom Lucite awards and the North American representative of SIGG bottles. The company also recently released its first-ever ESG report, in which it announced a commitment to reduce Scope 1 and 2 greenhouse gas emissions 20% by 2025.","filter_flag":1}
{"title":"Food waste and the complexity of New York City's garbage - Phys.org","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vcGh5cy5vcmcvbmV3cy8yMDIzLTA2LWZvb2QtY29tcGxleGl0eS15b3JrLWNpdHktZ2FyYmFnZS5odG1s0gFDaHR0cHM6Ly9waHlzLm9yZy9uZXdzLzIwMjMtMDYtZm9vZC1jb21wbGV4aXR5LXlvcmstY2l0eS1nYXJiYWdlLmFtcA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vcGh5cy5vcmcvbmV3cy8yMDIzLTA2LWZvb2QtY29tcGxleGl0eS15b3JrLWNpdHktZ2FyYmFnZS5odG1s0gFDaHR0cHM6Ly9waHlzLm9yZy9uZXdzLzIwMjMtMDYtZm9vZC1jb21wbGV4aXR5LXlvcmstY2l0eS1nYXJiYWdlLmFtcA?oc=5","id":"CBMiRGh0dHBzOi8vcGh5cy5vcmcvbmV3cy8yMDIzLTA2LWZvb2QtY29tcGxleGl0eS15b3JrLWNpdHktZ2FyYmFnZS5odG1s0gFDaHR0cHM6Ly9waHlzLm9yZy9uZXdzLzIwMjMtMDYtZm9vZC1jb21wbGV4aXR5LXlvcmstY2l0eS1nYXJiYWdlLmFtcA","guidislink":false,"published":"Tue, 20 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=171, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vcGh5cy5vcmcvbmV3cy8yMDIzLTA2LWZvb2QtY29tcGxleGl0eS15b3JrLWNpdHktZ2FyYmFnZS5odG1s0gFDaHR0cHM6Ly9waHlzLm9yZy9uZXdzLzIwMjMtMDYtZm9vZC1jb21wbGV4aXR5LXlvcmstY2l0eS1nYXJiYWdlLmFtcA?oc=5\" target=\"_blank\">Food waste and the complexity of New York City's garbage<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Phys.org<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Food waste and the complexity of New York City's garbage - Phys.org","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vcGh5cy5vcmcvbmV3cy8yMDIzLTA2LWZvb2QtY29tcGxleGl0eS15b3JrLWNpdHktZ2FyYmFnZS5odG1s0gFDaHR0cHM6Ly9waHlzLm9yZy9uZXdzLzIwMjMtMDYtZm9vZC1jb21wbGV4aXR5LXlvcmstY2l0eS1nYXJiYWdlLmFtcA?oc=5\" target=\"_blank\">Food waste and the complexity of New York City's garbage<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Phys.org<\/font>","source.href":"https:\/\/phys.org","source.title":"Phys.org","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility: Credit: Unsplash\/CC0 Public Domain Working steadily every day, \"New York's Strongest,\" the city's Department of Sanitation, works to clear our streets of mountains of garbage. The Department is well-managed, and its Commissioner, Jessica Tisch, is a creative and effective public manager. But waste management is a political backwater, and no mayor ever wants to hold a press conference to cut the ribbon on a new waste transfer station or an anaerobic digester to process food waste. As I often say, most people assume all those green bags somehow magically get transported to solid waste heaven. They do not want a waste management facility of any kind sited near their home. To achieve environmental sustainability, we will eventually need to use most of what we now call waste as raw materials for new products. The implementation of a circular economy—where all materials are reused, and there is no waste—is essential to the future of our species and our planet. Recycling is a building block on the road to a circular economy, but as important as it is as a first step, it is deeply flawed as a long-term solution. As a first step, it educates the public about waste and its potential reuse, and it can reduce the volume of waste that is dumped in our landfills. The problem though is that recycling rates tend to be low in the United States, and the market for the waste we recover is unstable. The long-term answer is an automated system of waste management that uses artificial intelligence and automation to sort waste and mine it for resources. That technology is under development, but the capital to pay for these facilities and the political noise that must be addressed to site them make waste mining a long-term solution. The idea is that some of the capital cost of waste facilities could be recovered by generating a revenue stream for resources mined from the waste stream. This would also require an organizational effort to market the products of waste, likely a private firm with experience in mining and marketing raw materials. Sanitation departments are not known for expertise in sales and marketing. In the short term, we need to develop the capacity to collect and process the forms of waste that are most easily separated from the waste stream. Materials like paper and bottles have somewhat successfully been isolated from mixed waste. A few weeks ago, New York's City Council enacted mandatory residential food recycling. On June 8th, Mariana Simões reported in City Limits that \"the New York City Council passed a long-awaited 'Zero Waste' legislative package on Thursday, which will expand the pick-up of food-based waste citywide and require all residential buildings to participate by fall of 2024. Instead of being dumped in a landfill, the bills mandate that organic waste be reused for environmentally friendly purposes. That includes composting, which is the process of recycling organic material to reuse it as fertilizer for soil and plants, as well as processing waste to generate alternative forms of electricity that emit less greenhouse gasses. The carbon dioxide released from food waste represents 20% of New York City's overall greenhouse gas emissions, making it the third largest contributor behind buildings (35%) and transportation (21%).\" It is not yet clear if the mayor will sign the bill, but if he does, three questions remain: How can the mandate be enforced? Where will we get the money for the additional weekly waste pick-up? Where will the food waste go? The enforcement issue relates to the fact that 70% of New Yorkers live in multi-family dwellings where typically the waste from one apartment is combined with the waste from others. It's true that most of the land in New York City sits beneath single-family homes, but most of the people in New York live in apartments. The second issue is how will the cash-strapped city afford city-wide separate food waste pick-ups? The third issue is that if the mandate were effective, it would overwhelm our region's ability to process food waste in anaerobic digesters or compost heaps. If we are really serious about food waste, we will need to build many anaerobic digesters. It makes no sense to build a system that requires us to ship untreated food waste thousands of miles from the city. Instead, we need to build regional anaerobic digesters to treat the waste. According to the EPA: \"Anaerobic digestion is a process through which bacteria break down organic matter—such as animal manure, wastewater biosolids, and food wastes—in the absence of oxygen. Anaerobic digestion for biogas production takes place in a sealed vessel called a reactor, which is designed and constructed in various shapes and sizes specific to the site and feedstock conditions (learn more about AD system design and technology). These reactors contain complex microbial communities that break down (or digest) the waste and produce resultant biogas and digestate (the solid and liquid material end-products of the AD process) which is discharged from the digester.\" Digesters produce fuel and fertilizer and can be scaled to the size needed to process the massive amount of food waste produced in New York. However, as noted above, the organizational capacity to collect and process is not the same as that needed to sell the products of a recycling plant. New York should get creative and figure out a way to generate revenues from its food waste. While avoiding landfill tipping fees is a good way to save money, most of those savings will need to be spent on collecting and processing food waste. The next step would be to sell the recycled products to help pay for the waste management system. The good news about New York's new law is that the impact of mandatory food recycling is likely to be the same as voluntary recycling, and so it's likely that the city's meager food reprocessing capacity will meet the needs created by the initial food waste stream. New York has had a less than stellar record on food waste recycling to date. In the apartment building I live in, we once had brown and orange sealed containers for food waste that helped train residents to separate their food waste while reducing the rat population. These early efforts were working, but as I observed back in 2021: \"During the height of the COVID crisis, Bill DeBlasio suspended a very promising food waste recycling program that had already reached 500,000 city residents. When the budget gets tight, recycling is an easy target.\" The truly sad part of DeBlasio's action was that due to closed restaurants and increased take-out dining, the amount of residential food waste soared at the very same time the city ended its residential food recycling program. As for the new mandatory food waste recycling included in the City Council's bill, the mandate is relatively harmless if no effort is devoted to enforcement. While I think a voluntary program makes more sense, mandates do communicate seriousness of purpose. The problem with enforcing a mandate is that the only place it is feasible is single-family homes, and it is not difficult to imagine a negative political response from a poorly targeted and arbitrary enforcement effort. The other issue omitted from the City Council bill is recycling the non-residential food waste picked up by the Sanitation Department. While for the past decade, large restaurants, stadia, catering operations, food retailers, and wholesalers in New York City have been required under Local Law 146 of 2013 to separate their organic waste and have it collected by private recyclers, the new law ignores the nonprofits that have their waste picked up by the Sanitation Department: What happens to their food waste? New York City's waste management system is complicated, and food waste recycling mandates add to the complexity. Despite these design problems, the goal of reusing food waste is worthwhile. The amount of food we waste is stunning and is truly an artifact of our fast-paced lifestyles and incredible plenty. In more traditional societies, there is very little food discarded. In my grandparents' generation, every part of a chicken was cooked, with some parts ending up in soups or stews. Back then, people ate nearly all the food they were fed and saved what they couldn't finish for another meal. In many parts of the world, those traditions continue. In New York City, a great deal of uneaten food is not discarded but repurposed as meals for people in need. When food is not eaten, it should be reprocessed as fertilizer or fuel. That is the goal of the City Council's new food waste law, and either in its current or revised form, it should be enacted, signed, and implemented as soon as possible. Provided by State of the Planet This story is republished courtesy of Earth Institute, Columbia University http:\/\/blogs.ei.columbia.edu.","filter_flag":1}
{"title":"POSCO Launches Korea's First Low-Carbon Brand Product - POSCO","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vbmV3c3Jvb20ucG9zY28uY29tL2VuL3Bvc2NvLWxhdW5jaGVzLWtvcmVhcy1maXJzdC1sb3ctY2FyYm9uLWJyYW5kLXByb2R1Y3Qv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vbmV3c3Jvb20ucG9zY28uY29tL2VuL3Bvc2NvLWxhdW5jaGVzLWtvcmVhcy1maXJzdC1sb3ctY2FyYm9uLWJyYW5kLXByb2R1Y3Qv0gEA?oc=5","id":"CBMiU2h0dHBzOi8vbmV3c3Jvb20ucG9zY28uY29tL2VuL3Bvc2NvLWxhdW5jaGVzLWtvcmVhcy1maXJzdC1sb3ctY2FyYm9uLWJyYW5kLXByb2R1Y3Qv0gEA","guidislink":false,"published":"Thu, 22 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=173, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vbmV3c3Jvb20ucG9zY28uY29tL2VuL3Bvc2NvLWxhdW5jaGVzLWtvcmVhcy1maXJzdC1sb3ctY2FyYm9uLWJyYW5kLXByb2R1Y3Qv0gEA?oc=5\" target=\"_blank\">POSCO Launches Korea's First Low-Carbon Brand Product<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">POSCO<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"POSCO Launches Korea's First Low-Carbon Brand Product - POSCO","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vbmV3c3Jvb20ucG9zY28uY29tL2VuL3Bvc2NvLWxhdW5jaGVzLWtvcmVhcy1maXJzdC1sb3ctY2FyYm9uLWJyYW5kLXByb2R1Y3Qv0gEA?oc=5\" target=\"_blank\">POSCO Launches Korea's First Low-Carbon Brand Product<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">POSCO<\/font>","source.href":"https:\/\/newsroom.posco.com","source.title":"POSCO","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Mass-balance type low-carbon “Greenate certified steel” launched on June 1 Certified reduction of carbon emissions by 590,000 tons allocated to products for sale LG Electronics to be supplied 200 tons of steel… Mid- to long-term carbon neutral collaboration with Samsung Electronics On June 1, POSCO organized an event at the POSCO Center in Gangnam and invited key domestic clients to “a briefing session on its plan to launch a low-carbon product.” During the session, POSCO provided insights into the current global demand for carbon reduction and presented its 2050 carbon neutral roadmap. The company also unveiled a lineup of low-carbon products set to be released by 2030. One of the notable products introduced by POSCO is “Greenate certified steel,” which operates on a mass-balance principle. This product effectively reduces carbon emissions by distributing the emissions saved through the implementation of low-carbon production processes and the use of low-carbon steel. Companies that purchase this product are acknowledged for their efforts in reducing carbon emissions equivalent to the amount associated with the product. At the Green Materials Forum 2022 on November 1 last year, POSCO Group launched Greenate, a master brand representing the company’s ambitious mission to achieve carbon neutrality by 2050, after which the product is named. Greenate encompasses all the efforts and products of POSCO Group to produce low-carbon steel and eco-friendly secondary battery materials, as well as the three major eco-friendly steel brands e Autopos, INNOVILT, and Greenable. Leading steel manufacturers in Europe and Japan had already adopted the mass balance methodology, which involves allocating carbon reductions to specific steel products, in 2021. POSCO became the first company in Korea to adopt this method for launching a low-emission product. The evaluation of carbon emission reduction for Greenate was conducted according to the GHG Protocol, a widely used international standard that measures greenhouse gas emissions. The assessment was performed by DNV (Det Norske Veritas) UK, one of the top three certification agencies globally, with extensive experience in certifying carbon-reduced steel from steel companies worldwide. The evaluation took place at POSCO’s Pohang Works and Gwangyang Works. Companies that purchase Greenate certified steel receive DNV’s product guarantee, with includes information on carbon reduction information on the raw material, along with POSCO’s purchase certificate. LG Electronics is the first client to purchase the newly released Greenate certified steel. Last November, POSCO and LG Electronics signed a business agreement for the supply and purchase of mass-balance type low-carbon steel products. Immediately after the product launch, LG Electronics placed an order for 200 tons of the new steel, which will be used as materials for their dryers. The company intends to actively explore opportunities for expanding the use of low-carbon steel in household appliances in the future. In addition, Samsung Electronics is currently considering the procurement of Greenate certified steel for their premium ovens. Recently, POSCO and Samsung Electronics entered into a three-year supply contract for high-strength, high-corrosion, and electric steel plate products for home appliances. This marks the first long-term agreement between the two companies, underscoring their shared dedication to technological collaboration and carbon neutrality. “The low emission trend is inevitable in the steel industry, and POSCO is responding proactively by launching new products,” Gi-cheon Eom, Head of Marketing Strategy Office, said at the briefing session. “With the launch of Greenate certified steel, the company has taken a step forward in its long journey towards carbon neutrality.”","filter_flag":1}
{"title":"Why CPG Leaders Must Reimagine Business Models | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LWNwZy1sZWFkZXJzLW11c3QtcmVpbWFnaW5lLWJ1c2luZXNzLW1vZGVsc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LWNwZy1sZWFkZXJzLW11c3QtcmVpbWFnaW5lLWJ1c2luZXNzLW1vZGVsc9IBAA?oc=5","id":"CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LWNwZy1sZWFkZXJzLW11c3QtcmVpbWFnaW5lLWJ1c2luZXNzLW1vZGVsc9IBAA","guidislink":false,"published":"Thu, 08 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=159, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LWNwZy1sZWFkZXJzLW11c3QtcmVpbWFnaW5lLWJ1c2luZXNzLW1vZGVsc9IBAA?oc=5\" target=\"_blank\">Why CPG Leaders Must Reimagine Business Models | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why CPG Leaders Must Reimagine Business Models | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LWNwZy1sZWFkZXJzLW11c3QtcmVpbWFnaW5lLWJ1c2luZXNzLW1vZGVsc9IBAA?oc=5\" target=\"_blank\">Why CPG Leaders Must Reimagine Business Models | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Scores of consumer-packaged goods (CPG) companies have set net-zero commitments. The problem? Extensive interviews with executives across the CPG industry and a BCG survey of their downstream customers in the retail sector indicate that most companies are not on track to meet their pledges to nearly halve their greenhouse gas (GHG) emissions by 2030. Although companies are deploying decarbonization technologies to reengineer their existing products, services, and business models, they are not yet reimagining their business. They have not yet pushed the boundaries of what is possible by further innovating their business models, even within the existing technology landscape. Undoubtedly, technological advances that create significant new opportunities will emerge. But companies can scale existing solutions on the basis of existing technologies over the next eight years by embracing new sustainable business models and building new markets, thereby meeting their 2030 net-zero goals. This article explores the broad principles that CPG companies must embrace to achieve their 2030 goals. Companies can accelerate their journey toward net zero and create advantage by taking a transformation lens to sustainability, by looking holistically at the system they are trying to change in order to focus on what matters, and by collaborating across the value chain. Although it may seem counterintuitive, partnering, even with competitors, is critical to driving change at scale and achieving advantage. In an environment characterized by disrupted supply chains, high inflation, and major geopolitical uncertainty related to the war in Ukraine, companies may find it very tempting to focus primarily on addressing near-term challenges. But inaction on the climate front carries a steep price. Companies that do not move aggressively now may have trouble accessing critical green resources later. They will also cede the lead in burgeoning markets to others and will miss out on capturing significant efficiencies. In contrast, those that seize the lead will establish meaningful competitive advantage. The Risk of Delay GHG emissions have continued to rise over the past two decades, and global CO2 emissions rebounded in 2021 first to match and then to surpass their highest previously recorded level. To limit global warming to an increase of 1.5°C above preindustrial levels, global emissions must peak during the next three years and then fall by 45% by 2030. The CPG industry will play a central role in the ultimate success or failure of that effort because the agri-food supply chain—in which CPG is a prominent player—currently accounts for an estimated 31% of annual global GHG emissions. Despite the urgency of the situation—and some promising initial steps that industry leaders have taken—most CPG companies are not yet moving aggressively to deliver on their climate ambitions. For example, a BCG survey of nearly 1,300 large companies in nine industries (including CPG) conducted in 2021 found that while 96% had set a goal of reducing emissions, only 11% had successfully cut emissions in line with those targets over the previous five years. For CPG companies, decarbonization must be part of a true sustainability transformation. Those that move slowly on this front face increasing risks. For one thing, companies that fail to secure the green resources needed for a sustainability transformation will likely find that those assets are in short supply in the near future. For example, according to BCG estimates , 45% of demand for recycled PET is likely to go unmet in 2025 as a result of supply shortages. In addition, companies that lag on sustainability will miss out on a major value creation opportunity and the chance to generate significant efficiencies. In six industries, including fast-moving consumer goods, BCG research found that the compound annual growth rate was 4 to 25 percentage points higher for green products than for nongreen products. And companies that fail to deliver on their net-zero promises will undermine their credibility with consumers and investors. Reimagining the Business for Sustainability A sustainability transformation starts with a clearly defined ambition, strategy, and roadmap. Building from that foundation, companies must integrate sustainability throughout the existing business, including by establishing sustainability KPIs and embedding them in business reviews. In our work in the industry, we see many companies with a focus on sustainability that have set their strategy and begun to integrate sustainability into the core of the business. But progress is still too slow. The problem is particularly evident in decarbonization work. Efforts to decarbonize can be understood as a matrix based on technology and business model or market. (See the exhibit.)","filter_flag":1}
{"title":"Almond Yogurt Is Healthier and More Sustainable Than Dairy, Study Finds - VegNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vdmVnbmV3cy5jb20vYWxtb25kLXlvZ3VydC1oZWFsdGhpZXItc3VzdGFpbmFibGUtZGFpcnktc3R1ZHnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vdmVnbmV3cy5jb20vYWxtb25kLXlvZ3VydC1oZWFsdGhpZXItc3VzdGFpbmFibGUtZGFpcnktc3R1ZHnSAQA?oc=5","id":"CBMiQ2h0dHBzOi8vdmVnbmV3cy5jb20vYWxtb25kLXlvZ3VydC1oZWFsdGhpZXItc3VzdGFpbmFibGUtZGFpcnktc3R1ZHnSAQA","guidislink":false,"published":"Tue, 13 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=164, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vdmVnbmV3cy5jb20vYWxtb25kLXlvZ3VydC1oZWFsdGhpZXItc3VzdGFpbmFibGUtZGFpcnktc3R1ZHnSAQA?oc=5\" target=\"_blank\">Almond Yogurt Is Healthier and More Sustainable Than Dairy, Study Finds<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Almond Yogurt Is Healthier and More Sustainable Than Dairy, Study Finds - VegNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vdmVnbmV3cy5jb20vYWxtb25kLXlvZ3VydC1oZWFsdGhpZXItc3VzdGFpbmFibGUtZGFpcnktc3R1ZHnSAQA?oc=5\" target=\"_blank\">Almond Yogurt Is Healthier and More Sustainable Than Dairy, Study Finds<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","source.href":"https:\/\/vegnews.com","source.title":"VegNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Almond-based vegan yogurt outranks dairy on several metrics, according to a study conducted by researchers at the University of Massachusetts and published in the scientific journal Frontiers in Nutrition. The study also highlighted the environmental benefits of vegan yogurts over their dairy-based counterparts. The dairy industry has long been known for its significant environmental impact, including greenhouse gas emissions, water resource utilization, and land requirements. Global livestock production is estimated to contribute 14.5 percent of total anthropogenic greenhouse gas emissions, with dairy production responsible for approximately one-third of that. While yogurt only constitutes a portion of the dairy industry’s environmental impact, it still contributes significantly. In the United States, yogurt accounts for approximately 6.3 percent of all dairy consumption. In 2021 alone, consumers spent $9.2 million on yogurt, while the plant-based yogurt market was valued at $1.6 million. Getty However, in recent years, plant-based yogurts have gained recognition as a more sustainable alternative to dairy yogurt. Driven by concerns over environmental sustainability and eating fewer animal-based food products, the plant-based yogurt market is expected to grow to $6.5 billion by 2030. “Plant-based diets are gaining popularity, especially in American culture, but just because it’s plant-based doesn’t mean it’s more nutritious,” lead author Astrid D’Andrea said in a statement. “There has to be specific research that answers that question.” Is plant-based yogurt nutritious? Beyond environmental considerations, recent research suggests that plant-based yogurts may also offer health benefits. The researchers at the University of Massachusetts aimed to evaluate the nutritional value of plant-based and dairy yogurts, an area that had not been extensively studied before. Silk For the study, the researchers analyzed the nutritional information of more than 600 yogurts introduced to the market between 2016 and 2021. Using the Nutrient Rich Foods Index, which assigns scores based on nutrient density, they compared the nutritional profiles of yogurts in terms of protein, fiber, iron, total sugar, and sodium. Of the yogurts analyzed, 159 were full-fat dairy; 303 were low- and nonfat dairy; 61 were coconut; 44 were almond; 30 were cashew; and 15 were oat. The study found that almond yogurt exhibited the highest nutrient density, surpassing the other options. The second most nutritious option was oat yogurt. D’Andrea attributed the high scores of almond and oat yogurts to their low levels of total sugar, sodium, and saturated fat. “When looking at the overall nutrient density, comparing dairy yogurt to plant-based yogurt, with the nutrients that we looked at, almond yogurt has a significantly higher nutrient density,” D’Andrea said. It should be noted that the study did not extensively analyze soy yogurts due to their limited availability in the market. However, soy is considered the healthiest plant-based milk option. Why almond yogurt is better The study sheds light on the potential health and environmental benefits of plant-based yogurt. By considering these findings, the food industry can work toward creating more nutritious and sustainable yogurt options for consumers. However, the researchers acknowledged that switching from dairy yogurt to plant-based yogurt might be challenging for some consumers—and they went as far as suggesting the creation of a hybrid yogurt that is both plant- and dairy-based to help consumers make the switch. But given the study’s findings, consuming almond yogurt without the dairy component is more beneficial. One such yogurt brand focusing on providing nutritious almond yogurt to consumers is Ayo. Ayo Ayo founder Matt Billings is a California almond farmer whose family has been farming for 100 years—50 of those years in the almond business. In creating Ayo, Billings’ goal was to connect his almond farm to consumers by producing almond yogurt, which is made by adding water and yogurt cultures to almond butter. “We are not trying to make an imitation dairy yogurt. We are taking the almonds that we grow and love, we lightly roast them, and turn them into a simple, delicious, creamy almond milk yogurt,” Billings tells VegNews. “We are high in fiber, low in sugar, and delicious. If you like yogurt and like almonds I promise you will love our yogurt,” Billings adds. Billings’ farm is also committed to forward-thinking practices of sustainability, traceability, and vertical integration, which nourish the land they are proud to call home. Recently, Ayo rolled out plain yogurt in a 16-ounce reusable tub and will soon expand its products with a more affordable line. “The natural line does not use organic almonds or fruit and this allows us to provide a better value to the customer,” Billings says. “We too are feeling the tough economic times and we wanted to provide an option to the customer that will help them stretch their grocery dollars.”","filter_flag":1}
{"title":"Circularity: the key to decarbonising Europe's chemical industry? - Financial Times","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmZ0LmNvbS9wYXJ0bmVyY29udGVudC9kb3cvY2lyY3VsYXJpdHktdGhlLWtleS10by1kZWNhcmJvbmlzaW5nLWV1cm9wZXMtY2hlbWljYWwtaW5kdXN0cnkuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmZ0LmNvbS9wYXJ0bmVyY29udGVudC9kb3cvY2lyY3VsYXJpdHktdGhlLWtleS10by1kZWNhcmJvbmlzaW5nLWV1cm9wZXMtY2hlbWljYWwtaW5kdXN0cnkuaHRtbNIBAA?oc=5","id":"CBMiaWh0dHBzOi8vd3d3LmZ0LmNvbS9wYXJ0bmVyY29udGVudC9kb3cvY2lyY3VsYXJpdHktdGhlLWtleS10by1kZWNhcmJvbmlzaW5nLWV1cm9wZXMtY2hlbWljYWwtaW5kdXN0cnkuaHRtbNIBAA","guidislink":false,"published":"Thu, 15 Jun 2023 08:53:44 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=15, tm_hour=8, tm_min=53, tm_sec=44, tm_wday=3, tm_yday=166, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmZ0LmNvbS9wYXJ0bmVyY29udGVudC9kb3cvY2lyY3VsYXJpdHktdGhlLWtleS10by1kZWNhcmJvbmlzaW5nLWV1cm9wZXMtY2hlbWljYWwtaW5kdXN0cnkuaHRtbNIBAA?oc=5\" target=\"_blank\">Circularity: the key to decarbonising Europe's chemical industry?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Financial Times<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Circularity: the key to decarbonising Europe's chemical industry? - Financial Times","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmZ0LmNvbS9wYXJ0bmVyY29udGVudC9kb3cvY2lyY3VsYXJpdHktdGhlLWtleS10by1kZWNhcmJvbmlzaW5nLWV1cm9wZXMtY2hlbWljYWwtaW5kdXN0cnkuaHRtbNIBAA?oc=5\" target=\"_blank\">Circularity: the key to decarbonising Europe's chemical industry?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Financial Times<\/font>","source.href":"https:\/\/www.ft.com","source.title":"Financial Times","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Greenhouse gas emissions from the EU chemical industry fell 54 per cent between 1990 and 2019 at the same time that output increased by 47 per cent.6 As part of the European Green Deal, and in line with the European Union’s commitment to global climate action under the Paris Agreement, the EU has stated its ambition to become climate neutral by 2050. Europe’s chemical industry has supported this ambition by making a similar commitment to climate neutrality by the same date. For an industry leader such as Dow, the materials science company and chemical manufacturer, these ambitions align with its own long-standing recognition of its responsibility to help drive the transformational change needed to address climate change, as well as tackling the environmental damage caused by plastic waste.","filter_flag":1}
{"title":"Mycoprotein and fungal proteins - The sustainability potential - FoodNavigator.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8wNi8wNi9NeWNvcHJvdGVpbi1hbmQtZnVuZ2FsLXByb3RlaW5zLVRoZS1zdXN0YWluYWJpbGl0eS1wb3RlbnRpYWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8wNi8wNi9NeWNvcHJvdGVpbi1hbmQtZnVuZ2FsLXByb3RlaW5zLVRoZS1zdXN0YWluYWJpbGl0eS1wb3RlbnRpYWzSAQA?oc=5","id":"CBMibWh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8wNi8wNi9NeWNvcHJvdGVpbi1hbmQtZnVuZ2FsLXByb3RlaW5zLVRoZS1zdXN0YWluYWJpbGl0eS1wb3RlbnRpYWzSAQA","guidislink":false,"published":"Fri, 09 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=160, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8wNi8wNi9NeWNvcHJvdGVpbi1hbmQtZnVuZ2FsLXByb3RlaW5zLVRoZS1zdXN0YWluYWJpbGl0eS1wb3RlbnRpYWzSAQA?oc=5\" target=\"_blank\">Mycoprotein and fungal proteins - The sustainability potential<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Mycoprotein and fungal proteins - The sustainability potential - FoodNavigator.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8wNi8wNi9NeWNvcHJvdGVpbi1hbmQtZnVuZ2FsLXByb3RlaW5zLVRoZS1zdXN0YWluYWJpbGl0eS1wb3RlbnRpYWzSAQA?oc=5\" target=\"_blank\">Mycoprotein and fungal proteins - The sustainability potential<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","source.href":"https:\/\/www.foodnavigator.com","source.title":"FoodNavigator.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"The food system, as a whole, makes up about 30% of global greenhouse gas emissions. Much of this stems from traditional meat and dairy. However, protein is a vital nutrient for human health, and meat and dairy provide many people with much of their protein. Fungal-based proteins, such as mycoprotein, fare well in sustainability when compared to animal-based proteins, providing a possible alternative to meat and dairy, explained Quorn at the Mycoprotein Summit in Kew, UK, last week. Tracking sustainability​ Quorn is keen to aim towards having a ‘net positive’ effect on the environment. In its efforts to reach this goal, the company tracks each stage in its production process and assess its sustainability. Mycoprotein is far more sustainable than animal agriculture, Bibi Rodgers Hunt, Net Positive Lead at Quorn, told FoodNavigator. This is because it doesn’t take up as much land. Twin 150,000-litre fermentation towers, belonging to Quorn parent company Marlow Foods, rather than industrialised farms, is where its mycoprotein is made. The towers take up significantly less space than animal agriculture, which covers vast swathes of land and is one of the driving forces behind deforestation. Quorn’s fermentation also emits 98% less carbon than beef, according to Rodgers Hunt. Quorn fermentation towers. Image Source: Quorn Foods Upscaling potential of waste materials ​ One of the benefits of fungi is that it can be used to upscale food waste into new products. “The idea of waste is a human concept.” ​said Dr Vincent Walsh, an expert in regenerative agriculture, during a panel on sustainability, “The biosphere never created waste​, and never will because it can’t, it always has to upcycle. So there's biological principles that we know work, and we have to start mimicking them​.” Circularity, he said, is key. “For example, 3.4 billion years ago, we know the Earth system started to become circular from photosynthesis. Well, that tells you a lot about any complex ecosystem​.” By studying the circularity of the real world, Walsh believes, we can find inspiration on how to upcycle food ourselves. On his farm, Walsh upscales fungal protein, using waste products from other food companies. “There is a deep relationship between food companies in terms of waste outputs, and farmers,” ​he said. “The biosphere never created waste, and never will because it can’t\" - Image Source: Abstract Aerial Art\/Getty Images “And so what I want to do with food companies is look at their waste streams; and through a number of biological processes, we upcycle.” ​Walsh collects waste materials from companies such as Quorn, and upcycles it in a process mirroring nature, using a fungi-based compost system. “And what we end up with is a number of biological materials that we can pop back onto our farm​.” Walsh spoke about the importance of working with food companies. “If we want more sustainable agriculture based on complexity​,” he said, “we need to be working with food companies, because food companies have a range of waste streams, and we can use the waste streams to feed into our farming platforms​.” Most importantly, fungi is, said Walsh, “critical to everything that I do.​ “ Nature is in freefall​ “Nature is in freefall​,” said Joanna Trewern, head of consumption at WWF UK, during the panel. To protect it, traditional conservation is not enough. We need, she said, to “transform our production and consumption methods​.” Because of the grand toll that meat production takes on the environment, we need meat alternatives that are as appealing as possible. “I think particularly there is a need for the meat alternatives that are undoubtedly useful at helping people transition to lower meat diets being nutritionally adequate,” ​said Trewern. “And lots of the products we see on the market are not​.” Trewern spoke to FoodNavigator afterwards about the need to transition away from animal-based proteins. “Humanity is facing into a ‘triple challenge’: how to ensure food and nutrition security for a growing global population while keeping global warming to 1.5 degrees and reversing nature loss. ​ “Around 30% of global greenhouse gas emissions are associated with the food system, and almost half have been attributed to animal agriculture. Our food system is also the greatest driver of biodiversity loss. If we’re to stand any chance of meeting global climate and nature targets, we need to change how we produce and consume food​.” Thus, switching to a plant-based diet is vital in order to reverse the effects of climate change. ‘Eating for Net Zero,’ a new report by WWF, “shows that adoption of healthy, sustainable diets in the UK could deliver over half of the food-related emissions reductions we need by 2030 to stay aligned with IPCC targets​,” Trewern told us. “In the UK we consume on average more protein than needed – at 76g per person per day compared to recommendations of 45g (for women) and 56g (for men). Most of our protein currently comes from animal-based sources​.” Transitioning to alternative proteins, such as mycoprotein, is not just beneficial for health but for environmental reasons as well.","filter_flag":1}
{"title":"Could printed copper become the new industry standard? - Electronic Products & Technology","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmVwdC5jYS8yMDIzLzA2L2NvdWxkLXByaW50ZWQtY29wcGVyLWJlY29tZS10aGUtbmV3LWluZHVzdHJ5LXN0YW5kYXJkL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmVwdC5jYS8yMDIzLzA2L2NvdWxkLXByaW50ZWQtY29wcGVyLWJlY29tZS10aGUtbmV3LWluZHVzdHJ5LXN0YW5kYXJkL9IBAA?oc=5","id":"CBMiUWh0dHBzOi8vd3d3LmVwdC5jYS8yMDIzLzA2L2NvdWxkLXByaW50ZWQtY29wcGVyLWJlY29tZS10aGUtbmV3LWluZHVzdHJ5LXN0YW5kYXJkL9IBAA","guidislink":false,"published":"Tue, 20 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=171, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmVwdC5jYS8yMDIzLzA2L2NvdWxkLXByaW50ZWQtY29wcGVyLWJlY29tZS10aGUtbmV3LWluZHVzdHJ5LXN0YW5kYXJkL9IBAA?oc=5\" target=\"_blank\">Could printed copper become the new industry standard?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Electronic Products & Technology<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Could printed copper become the new industry standard? - Electronic Products & Technology","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmVwdC5jYS8yMDIzLzA2L2NvdWxkLXByaW50ZWQtY29wcGVyLWJlY29tZS10aGUtbmV3LWluZHVzdHJ5LXN0YW5kYXJkL9IBAA?oc=5\" target=\"_blank\">Could printed copper become the new industry standard?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Electronic Products & Technology<\/font>","source.href":"https:\/\/www.ept.ca","source.title":"Electronic Products & Technology","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"The recent results obtained by a team of Canadian scientists made up of members from academia and industry and based at C2MI – Canada’s largest microelectronics R&D centre – may lead to achieving greener, more sustainable products, by scaling up and enabling technological boundaries to be pushed back and broadened. C2MI recently joined the Semiconductor Climate Consortium, with the clear intention of offering new avenues in microelectronic products manufacturing. The consortium is focused on the challenges of climate change and works to speed industry value chain efforts to reduce greenhouse gas emissions in member company operations and in other sectors of our value chain. In the flexible electronics world, two options are available, including flexible circuits manufactured with traditional pcb technology. These copper circuits provide good reliability, but requires harsh chemicals to manufacture and these subtractive processes waste a lot of copper. Printed circuits technology is also available, but mainly with printed silver circuits which are costly and have the disadvantage of suffering from electromigration during the product’s life affecting the reliability of the device. While new printing technology is offering more versatility, no one is ready to give up on reliability nor experience higher production costs. That is why the aim of this project has been to create a solution that would have the advantage of both worlds. The printed copper solution presented in this paper have reliability similar to traditional pcb technology with the advantage of using additive technology to prevent copper waste and the use of harsh chemistry. C2MI is equipped with industry equipment which enables pilot production on production ready equipment to ensure a smooth transfer of developed technologies onto larger volume product lines once the developed new products are ready for volume commercialization and manufacturing. Advertisement The printed electronic tests were conducted in a manufacturing process mode targeting optimal and reliable results such as those that are conventionally widely obtained in the industry. The new copper-based printed electronics flexible circuits are indeed meeting the JEDEC JES022-A110 standard while reducing considerably copper loss, chemical consumption as well as significantly reducing the overall costs compared to traditionally used subtractive processes. The printed technology selected is as close as possible to readily available technology: copper-based circuits are widely used with rigid boards. The assembly process used with this new copper printed flexible electronics utilizes the same equipment present in a standard card attach line as to streamline the transfer of that technology to existing assembly plants. Therefore, copper printed circuits were selected as the best option for the following advantages: Reducing chemical consumption compared to current pcb technology: Printed circuit board manufacturing is currently made with subtractive processes. These processes require harsh chemicals such as copper etching solutions. Direct printing of circuits doesn’t require those harsh chemistry and consume less copper per unit manufactured compared to the subtractive processes currently used within the industry. Meeting the standards: copper is a documented reliable material and show no signs of electromigration during reliability testing. Wetting is one of the criteria of IPC standards for quality control. With our printed circuit technology, we obtain wetting that would be acceptable under IPC-A-610. Testing was also done after assembly and the circuits were having similar energy consumption and LED output compared to an available flexible circuit manufactured with traditional pcb technology. Reducing the overall costs of printed products: Reducing the cost of inks by more than 50% in comparison to silver inks. Using copper printed traces instead of silver enables the use of solder paste as component attach material. Solder pastes are widely used in the card attach industry and are between 10 and 100 times cheaper than component attach materials commonly used to attach components on silver traces. This new technology has the advantage of both solutions present on the market namely the advantage of a printing technology that doesn’t rely on harsh chemicals, cut costs, and minimize waste through an additive process instead of a subtractive one. All of this is achieved while maintaining the same reliability obtained with currently used pcb technology. This new technology is a great example of what C2MI has at its core value, providing a solution to customers that are low cost, reliable and with less waste. ————————————- The study was performed by C2MI and ETS, involving a close collaboration between Sylvain Cloutier Professor and Chair of the Electrical Engineering Department at École de technologie supérieure (ETS) Canada Research Chair in Printable Optoelectronics Materials & Devices and Christophe Sansregret, Process development engineer in printed electronics and microelectronics assembly at C2MI along with a team composed of ETS Students ( Arjun Wadhwa, Alain Picard, Luis-Felipe Gerlein, François-Xavier Fortier, Debika Banerjee, Jaime Benavides and Alexandre Perroton) as well as C2MI team members (Julien Néron and Sylvain Yergeau), features conclusive results.","filter_flag":1}
{"title":"This Company Makes Vegan Cheese With Soy, But Not the Way You'd Expect - VegNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMWh0dHBzOi8vdmVnbmV3cy5jb20vdmVnYW4tY2hlZXNlLXNveS1ub2JlbGwtZm9vZHPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMWh0dHBzOi8vdmVnbmV3cy5jb20vdmVnYW4tY2hlZXNlLXNveS1ub2JlbGwtZm9vZHPSAQA?oc=5","id":"CBMiMWh0dHBzOi8vdmVnbmV3cy5jb20vdmVnYW4tY2hlZXNlLXNveS1ub2JlbGwtZm9vZHPSAQA","guidislink":false,"published":"Thu, 22 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=173, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMWh0dHBzOi8vdmVnbmV3cy5jb20vdmVnYW4tY2hlZXNlLXNveS1ub2JlbGwtZm9vZHPSAQA?oc=5\" target=\"_blank\">This Company Makes Vegan Cheese With Soy, But Not the Way You'd Expect<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"This Company Makes Vegan Cheese With Soy, But Not the Way You'd Expect - VegNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMWh0dHBzOi8vdmVnbmV3cy5jb20vdmVnYW4tY2hlZXNlLXNveS1ub2JlbGwtZm9vZHPSAQA?oc=5\" target=\"_blank\">This Company Makes Vegan Cheese With Soy, But Not the Way You'd Expect<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","source.href":"https:\/\/vegnews.com","source.title":"VegNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Using soybeans as a base for vegan cheese is nothing new. However, harnessing the soy plant to replace the cow in the production of dairy proteins is novel. Magi Richani, founder and CEO of pioneering food-technology startup Nobell Foods, calls this process PGP (or “plant-grown protein”) and it has the potential to change the way dairy is made for good. “What’s unique about Nobell is we’re pioneering a new category in food with PGP and it’s the world’s most efficient protein factory,” Richani tells VegNews. Nobell Foods The key here is the production of casein, a functional milk protein that is responsible for the melty, stretchy, and overall “cheesy” qualities of dairy cheese. Northern California-based Nobell discovered a way to recreate the genetic code for the functional milk protein in soybean seeds, which it grows into plants that have the same dairy caseins found in animal milk. Nobell then extracts the caseins to create a variety of dairy-identical cheeses, all without the need for farming animals. Harnessing plants to make casein Why use soy plants to make cheese? The legumes deliver a punch of protein (36 to 43 percent in total) and are easy to scale as the infrastructure for growing soy is already in place. Approximately 90 million acres of land are dedicated to growing soybeans in the United States alone. The majority of these soybeans (approximately 70 percent) are grown for animal feed, an inefficiency Nobell’s process aims to solve. Richani explains that cows are fed approximately 6 kgs (13.2 pounds) of plant protein to produce 1 kg (2.2 pounds) of dairy protein. It also takes on average 600 liters (158.5 gallons) of water to produce 1 liter (a quart) of milk. “Sourcing proteins is based on an antiquated model—grow plants to then feed these plants to animals to then feed the animals nourished by plants to people,” she says. Nobell Foods What Nobell’s process does is remove the cow as the middleman in traditional dairy production—which accounts for 2 to 3 percent of all greenhouse gas emissions. Nobell’s process stands to cut carbon emissions by 90 percent when compared to traditional animal farming. To truly transform the dairy industry, farmers must be part of the equation and Nobell’s technology offers them a place at the table. “Cutting emissions while still meeting the growing global food demand requires finding innovative ways to work within our pre-established global system and that means ensuring farmers are part of the solution,” Richani says. “Partnering with farmers we know and trust to grow and harvest our plants is essential to furthering our mission and giving farmers choices to grow specialty crops like ours provides them with new economic opportunities,” she says. Nobell’s breakthrough technology gains traction Fast Company recently awarded Nobell’s technology the top spot in the agriculture of its World Changing Ideas 2023 list. Having raised $100 million in funding to date, Nobell also gained support from forward-thinkers, including Bill Gates and actor Robert Downey Jr., both of whom invested in the company through their respective funds. Tracy Nguyen\/Nobell Foods Nobell has been building its casein technology from scratch for the last seven years and the company has met challenges and gathered learnings along the way. “Figuring out how to produce a protein commonly found in dairy milk without animals was no easy task and with creating an entirely new category, we had to be open to failure,” Richani says. “When you’re working on breakthroughs in biology, you have to embrace and welcome mistakes—it’s the only way to get closer to success.” While Nobell is not ready to disclose where its cheeses will make their initial debut, in July, the company will unveil a campaign in partnership with high-profile collaborators across multiple industries to highlight the effects of climate change on the dairy industry. Taking the cow out of cheese production Improving the way dairy is made is a massive undertaking that requires a multi-pronged approach from different companies with varying technologies. “We don’t view what we’re at Nobell as competition with other food technologies,” Richani says. “In fact, we need as many solutions to a climate solution as possible.” Luckily, Nobell is part of a growing number of companies working to improve animal-free cheese by harnessing the full potential of plants and microorganisms. In Berkeley, CA, startup Climax Foods recently announced its discovery of a plant-derived casein that also functions identically to its dairy counterpart. Currently, Climax is commercializing a few varieties of vegan cheeses such as blue, brie, feta, and chévere and working on a mozzarella that will showcase the stretching abilities imparted by its plant casein. The startup’s vegan cheeses have already found favor with acclaimed chefs such as Dominique Crenn, Tal Ronen, Jean Georges Vongerichten, and Matthew Kenney. Climax is also working with French cheese giant Bel Group to formulate new, dairy-identical vegan versions of its iconic cheeses such as Babybel, The Laughing Cow, and Boursin. New Culture A third Northern California-based startup, New Culture, is also working to bring its novel vegan cheeses to the masses, starting with mozzarella made using precision fermentation—where microbes replace cows in producing dairy proteins. New Culture counts James Beard Award-winning Nancy Silverton as a partner who is putting its vegan mozzarella on the menu at her Pizzeria Mozza in 2024.","filter_flag":1}
{"title":"How the nearly indestructible tardigrade can bring vaccines and medicine to Africa - Big Think","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMGh0dHBzOi8vYmlndGhpbmsuY29tL2hlYWx0aC90YXJkaWdyYWRlLXZhY2NpbmVzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMGh0dHBzOi8vYmlndGhpbmsuY29tL2hlYWx0aC90YXJkaWdyYWRlLXZhY2NpbmVzL9IBAA?oc=5","id":"CBMiMGh0dHBzOi8vYmlndGhpbmsuY29tL2hlYWx0aC90YXJkaWdyYWRlLXZhY2NpbmVzL9IBAA","guidislink":false,"published":"Thu, 08 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=159, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMGh0dHBzOi8vYmlndGhpbmsuY29tL2hlYWx0aC90YXJkaWdyYWRlLXZhY2NpbmVzL9IBAA?oc=5\" target=\"_blank\">How the nearly indestructible tardigrade can bring vaccines and medicine to Africa<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Big Think<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How the nearly indestructible tardigrade can bring vaccines and medicine to Africa - Big Think","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMGh0dHBzOi8vYmlndGhpbmsuY29tL2hlYWx0aC90YXJkaWdyYWRlLXZhY2NpbmVzL9IBAA?oc=5\" target=\"_blank\">How the nearly indestructible tardigrade can bring vaccines and medicine to Africa<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Big Think<\/font>","source.href":"https:\/\/bigthink.com","source.title":"Big Think","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Microscopic tardigrades, widely considered to be some of the toughest animals on earth, can survive for decades without oxygen or water and are thought to have lived through a crash-landing on the moon. Also known as water bears, they survive by fully dehydrating and later rehydrating themselves – a feat only a few animals can accomplish. Now scientists are harnessing tardigrades’ talents to make medicines that can be dried and stored at ambient temperatures and later rehydrated for use—instead of being kept refrigerated or frozen. Many biologics—pharmaceutical products made by using living cells or synthesized from biological sources—require refrigeration, which isn’t always available in many remote locales or places with unreliable electricity. These products include mRNA and other vaccines, monoclonal antibodies and immuno-therapies for cancer, rheumatoid arthritis and other conditions. Cooling is also needed for medicines for blood clotting disorders like hemophilia and for trauma patients. Formulating biologics to withstand drying and hot temperatures has been the holy grail for pharmaceutical researchers for decades. It’s a hard feat to manage. “Biologic pharmaceuticals are highly efficacious, but many are inherently unstable,” says Thomas Boothby, assistant professor of molecular biology at University of Wyoming. Therefore, during storage and shipping, they must be refrigerated at 2 to 8 degrees Celsius (35 to 46 degrees Fahrenheit). Some must be frozen, typically at -20 degrees Celsius, but sometimes as low -90 degrees Celsius as was the case with the Pfizer Covid vaccine. For Covid, fewer than 73 percent of the global population received even one dose. The need for refrigerated or frozen handling was partially to blame. The costly cold chain The logistics network that ensures those temperature requirements are met from production to administration is called the cold chain. This cold chain network is often unreliable or entirely lacking in remote, rural areas in developing nations that have malfunctioning electrical grids. “Almost all routine vaccines require a cold chain,” says Christopher Fox, senior vice president of formulations at the Access to Advanced Health Institute. But when the power goes out, so does refrigeration, putting refrigerated or frozen medical products at risk. Consequently, the mRNA vaccines developed for Covid-19 and other conditions, as well as more traditional vaccines for cholera, tetanus and other diseases, often can’t be delivered to the most remote parts of the world. To understand the scope of the challenge, consider this: In the U.S., more than 984 million doses of Covid-19 vaccine have been distributed so far. Each one needed refrigeration that, even in the U.S., proved challenging. Now extrapolate to all vaccines and the entire world. For Covid, fewer than 73 percent of the global population received even one dose. The need for refrigerated or frozen handling was partially to blame. Freeze-drying, also called lyophilization, which is common for many vaccines, isn’t always an option. Many freeze-dried vaccines still need refrigeration, and even medicines approved for storage at ambient temperatures break down in the heat of sub-Saharan Africa. “Even in a freeze-dried state, biologics often will undergo partial rehydration and dehydration, which can be extremely damaging,” Boothby explains. The cold chain is also very expensive to maintain. The global pharmaceutical cold chain packaging market is valued at more than $15 billion, and is expected to exceed $60 billion by 2033, according to a report by Future Market Insights. This cost is only expected to grow. According to the consulting company Accenture, the number of medicines that require the cold chain are expected to grow by 48 percent, compared to only 21 percent for non-cold-chain therapies. Tardigrades to the rescue Tardigrades are only about a millimeter long – with four legs and claws, and they lumber around like bears, thus their nickname – but could provide a big solution. “Tardigrades are unique in the animal kingdom, in that they’re able to survive a vast array of environmental insults,” says Boothby, the Wyoming professor. “They can be dried out, frozen, heated past the boiling point of water and irradiated at levels that are thousands of times more than you or I could survive.” So, his team is gradually unlocking tardigrades’ survival secrets and applying them to biologic pharmaceuticals to make them withstand both extreme heat and desiccation without losing efficacy. Boothby’s team is focusing on blood clotting factor VIII, which, as the name implies, causes blood to clot. Currently, Boothby is concentrating on the so-called cytoplasmic abundant heat soluble (CAHS) protein family, which is found only in tardigrades, protecting them when they dry out. “We showed we can desiccate a biologic (blood clotting factor VIII, a key clotting component) in the presence of tardigrade proteins,” he says—without losing any of its effectiveness. The researchers mixed the tardigrade protein with the blood clotting factor and then dried and rehydrated that substance six times without damaging the latter. This suggests that biologics protected with tardigrade proteins can withstand real-world fluctuations in humidity. Furthermore, Boothby’s team found that when the blood clotting factor was dried and stabilized with tardigrade proteins, it retained its efficacy at temperatures as high as 95 degrees Celsius. That’s over 200 degrees Fahrenheit, much hotter than the 58 degrees Celsius that the World Meteorological Organization lists as the hottest recorded air temperature on earth. In contrast, without the protein, the blood clotting factor degraded significantly. The team published their findings in the journal Nature in March. Although tardigrades rarely live more than 2.5 years, they have survived in a desiccated state for up to two decades, according to Animal Diversity Web. This suggests that tardigrades’ CAHS protein can protect biologic pharmaceuticals nearly indefinitely without refrigeration or freezing, which makes it significantly easier to deliver them in locations where refrigeration is unreliable or doesn’t exist. The tricks of the tardigrades Besides the CAHS proteins, tardigrades rely on a type of sugar called trehalose and some other protectants. So, rather than drying up, their cells solidify into rigid, glass-like structures. As that happens, viscosity between cells increases, thereby slowing their biological functions so much that they all but stop. Now Boothby is combining CAHS D, one of the proteins in the CAHS family, with trehalose. He found that CAHS D and trehalose each protected proteins through repeated drying and rehydrating cycles. They also work synergistically, which means that together they might stabilize biologics under a variety of dry storage conditions. “We’re finding the protective effect is not just additive but actually is synergistic,” he says. “We’re keen to see if something like that also holds true with different protein combinations.” If so, combinations could possibly protect against a variety of conditions. Commercialization outlook Before any stabilization technology for biologics can be commercialized, it first must be approved by the appropriate regulators. In the U.S., that’s the U.S. Food and Drug Administration. Developing a new formulation would require clinical testing and vast numbers of participants. So existing vaccines and biologics likely won’t be re-formulated for dry storage. “Many were developed decades ago,” says Fox. “They‘re not going to be reformulated into thermo-stable vaccines overnight,” if ever, he predicts. Extending stability outside the cold chain, even for a few days, can have profound health, environmental and economic benefits. Instead, this technology is most likely to be used for the new products and formulations that are just being created. New and improved vaccines will be the first to benefit. Good candidates include the plethora of mRNA vaccines, as well as biologic pharmaceuticals for neglected diseases that affect parts of the world where reliable cold chain is difficult to maintain, Boothby says. Some examples include new, more effective vaccines for malaria and for pathogenic Escherichia coli, which causes diarrhea. Tallying up the benefits Extending stability outside the cold chain, even for a few days, can have profound health, environmental and economic benefits. For instance, MenAfriVac, a meningitis vaccine (without tardigrade proteins) developed for sub-Saharan Africa, can be stored at up to 40 degrees Celsius for four days before administration. “If you have a few days where you don’t need to maintain the cold chain, it’s easier to transport vaccines to remote areas,” Fox says, where refrigeration does not exist or is not reliable. Subscribe for counterintuitive, surprising, and impactful stories delivered to your inbox every Thursday Notice: JavaScript is required for this content. Better health is an obvious benefit. MenAfriVac reduced suspected meningitis cases by 57 percent in the overall population and more than 99 percent among vaccinated individuals. Lower healthcare costs are another benefit. One study done in Togo found that the cold chain-related costs increased the per dose vaccine price up to 11-fold. The ability to ship the vaccines using the usual cold chain, but transporting them at ambient temperatures for the final few days cut the cost in half. There are environmental benefits, too, such as reducing fuel consumption and greenhouse gas emissions. Cold chain transports consume 20 percent more fuel than non-cold chain shipping, due to refrigeration equipment, according to the International Trade Administration. A study by researchers at Johns Hopkins University compared the greenhouse gas emissions of the new, oral Vaxart COVID-19 vaccine (which doesn’t require refrigeration) with four intramuscular vaccines (which require refrigeration or freezing). While the Vaxart vaccine is still in clinical trials, the study found that “up to 82.25 million kilograms of CO 2 could be averted by using oral vaccines in the U.S. alone.” That is akin to taking 17,700 vehicles out of service for one year. Although tardigrades’ protective proteins won’t be a component of biologic pharmaceutics for several years, scientists are proving that this approach is viable. They are hopeful that a day will come when vaccines and biologics can be delivered anywhere in the world without needing refrigerators or freezers en route. This article appeared on Leaps.org, a publisher of award-winning journalism about scientific innovation, ethics, and the future of humanity.","filter_flag":1}
{"title":"Game Changers Star James Wilks Launches Protein Powder Made With Upcycled Barley - vegconomist - the vegan business magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vdmVnY29ub21pc3QuY29tL3Byb2R1Y3RzLWxhdW5jaGVzL2dhbWUtY2hhbmdlcnMtamFtZXMtd2lsa3MtcHJvdGVpbi1wb3dkZXIv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vdmVnY29ub21pc3QuY29tL3Byb2R1Y3RzLWxhdW5jaGVzL2dhbWUtY2hhbmdlcnMtamFtZXMtd2lsa3MtcHJvdGVpbi1wb3dkZXIv0gEA?oc=5","id":"CBMiU2h0dHBzOi8vdmVnY29ub21pc3QuY29tL3Byb2R1Y3RzLWxhdW5jaGVzL2dhbWUtY2hhbmdlcnMtamFtZXMtd2lsa3MtcHJvdGVpbi1wb3dkZXIv0gEA","guidislink":false,"published":"Fri, 23 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=174, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vdmVnY29ub21pc3QuY29tL3Byb2R1Y3RzLWxhdW5jaGVzL2dhbWUtY2hhbmdlcnMtamFtZXMtd2lsa3MtcHJvdGVpbi1wb3dkZXIv0gEA?oc=5\" target=\"_blank\">Game Changers Star James Wilks Launches Protein Powder Made With Upcycled Barley<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">vegconomist - the vegan business magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Game Changers Star James Wilks Launches Protein Powder Made With Upcycled Barley - vegconomist - the vegan business magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vdmVnY29ub21pc3QuY29tL3Byb2R1Y3RzLWxhdW5jaGVzL2dhbWUtY2hhbmdlcnMtamFtZXMtd2lsa3MtcHJvdGVpbi1wb3dkZXIv0gEA?oc=5\" target=\"_blank\">Game Changers Star James Wilks Launches Protein Powder Made With Upcycled Barley<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">vegconomist - the vegan business magazine<\/font>","source.href":"https:\/\/vegconomist.com","source.title":"vegconomist - the vegan business magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"James Wilks, a former UFC fighter who produced and starred in the critically acclaimed documentary The Game Changers, has founded a new sports nutrition brand called FȲTA. The first products to launch are protein powders containing EverPro, a plant-based protein made from upcycled American barley. The ingredient is produced by EverGrain, a company that uses proprietary technologies to turn spent brewer’s grain into high-quality ingredients. During beer brewing, the carbohydrates in grains are separated from the protein and fiber. While the carbohydrates are used to initiate the fermentation process, the other components are normally sent to landfill or used as livestock feed. However, EverGrain has developed a method to upcycle them. According to FȲTA, the resulting protein is the most soluble and digestible in the category. It is also said to be the most sustainable protein commercially available at scale, requiring 14 times less land and 34 times less water than whey protein while generating five times fewer greenhouse gas emissions. “Truly unique product” FȲTA’s new Elite Plant Protein combines EverPro with lupin beans to create an easy-to-mix plant-based powder. Available in the flavors Café Latte, Creamy Chocolate, and Caramel Vanilla, it contains 30 grams of protein per serving, including all nine essential amino acids. Elite Plant Protein also contains 3g of fiber and minimal added sugar. In a blind taste test, FȲTA claims the products were preferred 3 to 1 over comparable leading protein powders, with testers especially impressed by their rapid solubility in any liquid. The launch comes just weeks after it was announced that a Game Changers sequel is in the works. The original documentary — which explores the benefits of a plant-based diet for athletic performance — has been viewed over 100 million times. It has also received accreditations from the U.S. Department of Defense and the Academy of Nutrition and Dietetics. “It’s amazing to think that such a high quality, highly digestible, and highly versatile protein was being thrown away,” said Wilks. “EverGrain’s efforts to upcycle a protein that would otherwise go to waste not only resulted in a truly unique product, but aligns with our mission to create a stronger, healthier population and planet.”","filter_flag":1}
{"title":"Creating a more sustainable approach to infrastructure construction - NIC - National Infrastructure Commission","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vbmljLm9yZy51ay9pbnNpZ2h0cy9jcmVhdGluZy1hLW1vcmUtc3VzdGFpbmFibGUtYXBwcm9hY2gtdG8taW5mcmFzdHJ1Y3R1cmUtY29uc3RydWN0aW9uL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vbmljLm9yZy51ay9pbnNpZ2h0cy9jcmVhdGluZy1hLW1vcmUtc3VzdGFpbmFibGUtYXBwcm9hY2gtdG8taW5mcmFzdHJ1Y3R1cmUtY29uc3RydWN0aW9uL9IBAA?oc=5","id":"CBMiYGh0dHBzOi8vbmljLm9yZy51ay9pbnNpZ2h0cy9jcmVhdGluZy1hLW1vcmUtc3VzdGFpbmFibGUtYXBwcm9hY2gtdG8taW5mcmFzdHJ1Y3R1cmUtY29uc3RydWN0aW9uL9IBAA","guidislink":false,"published":"Thu, 01 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=152, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vbmljLm9yZy51ay9pbnNpZ2h0cy9jcmVhdGluZy1hLW1vcmUtc3VzdGFpbmFibGUtYXBwcm9hY2gtdG8taW5mcmFzdHJ1Y3R1cmUtY29uc3RydWN0aW9uL9IBAA?oc=5\" target=\"_blank\">Creating a more sustainable approach to infrastructure construction - NIC<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">National Infrastructure Commission<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Creating a more sustainable approach to infrastructure construction - NIC - National Infrastructure Commission","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vbmljLm9yZy51ay9pbnNpZ2h0cy9jcmVhdGluZy1hLW1vcmUtc3VzdGFpbmFibGUtYXBwcm9hY2gtdG8taW5mcmFzdHJ1Y3R1cmUtY29uc3RydWN0aW9uL9IBAA?oc=5\" target=\"_blank\">Creating a more sustainable approach to infrastructure construction - NIC<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">National Infrastructure Commission<\/font>","source.href":"https:\/\/nic.org.uk","source.title":"National Infrastructure Commission","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"For many of us, recycling has become a part of the daily routine. We separate out glass, plastic and cardboard waste into recycling bins, to be collected and reprocessed into new products We donate old clothes to charity shops where they’re given a new lease of life. And put our garden waste in a separate bin so it can be composted. This goal of a more ‘circular’ waste economy, where more of our waste is reused and repurposed rather than simply disposed of, is an important component in decarbonising the systems we use to manage the UK’s waste, some of which – including energy-from-waste plants and landfill sites – produce significant greenhouse gas emissions or damage the environment in other ways. But how do you recycle something like a wind turbine, a disused motorway flyover or a bus station, or build them in a low carbon, ‘circular’ way in the first place? Can the principles behind a circular economy for household waste be applied to how we construct our infrastructure? The organisations behind Our Shared Understanding think so. It’s a call to action by over 80 businesses and organisations involved in creating and managing the global built environment. They want to create a sustainable future for the sector by accelerating the transition to a circular economy across the construction supply chain. The Commission has added its name because the approach aligns with much of our current work, namely how we best reduce the overall environmental impacts of our infrastructure and ensure it helps the UK achieve its target of net zero carbon emissions by 2050. This is an important element of our work for good reason: two thirds of all UK greenhouse gas emissions come from infrastructure. Take waste, for instance – emissions from the UK waste sector are just over 20 MtCO 2 e a year. So the question of what the waste sector must do to eliminate emissions and shift to a more circular model is something we’re looking at closely in our next National Infrastructure Assessment. But creating more sustainable infrastructure is not just about reducing emissions from its operation. It is about considering sustainability at every stage of a project, including its construction and design. Good infrastructure design means providing opportunities during the planning and construction phases to mitigate and reduce carbon and other emissions from key processes such as from the manufacture and use of concrete, which is often a key feature of many major infrastructure projects. Infrastructure developers should also consider the impact of any development on natural capital – our rivers, our air, our wildlife habitats – and take every opportunity for it to contribute positively to the local environment and biodiversity, leaving the environment in measurably better state than before. These approaches underpin the ‘carbon’ principle in our Design Principles for National Infrastructure, developed by our Design Group in 2020. The need for more sustainable infrastructure has also shaped recommendations we’ve made more recently, such as calling for a shift towards nature-based drainage solutions ahead of more concrete pipes in new housing development to address surface water flooding, or ensuring that the planning system encourages infrastructure projects that measurably improve the state of the natural environment. Reducing the environmental impact of our built environment and creating a circular economy is a significant challenge. As Our Shared Understanding reminds us, globally the built environment sector is a big user of natural resources, extracting over 100 billion tonnes of natural resources a year. And while the built environment covers only one per cent of the earth’s surface, it’s responsible for a quarter of land system changes that lead to habitat destruction, water stress and biodiversity loss. So, significant change is required. But that can only come through a shared recognition of both the scale of the problem, and the steps needed to respond effectively. Our Shared Understanding recognises the impact that the built environment has on the environment and, in response, sets out broad principles that will allow the sector to better operate within the planet’s finite resource and do more to both handle and reduce the waste it generates on any major building project. These include: getting the greatest possible value from the use of materials and products used in creating the built environment, including by redeploying elsewhere assets or materials that have reached the end or their useful life ensuring building design uses more renewable materials in the first place and makes greater use of nature-based solutions, such as for flood protection using digital technology to connect the complex systems on which construction depends and getting the most out of materials and products by making buildings last longer and be easier to adapt and maintain. Sustainable infrastructure construction is an important part of a low carbon future, and some transformative changes will be required to deliver it. Our Shared Understanding offers a blueprint for where, and how, that transformation can begin. Jo Pearce is a policy adviser at the Commission working on waste. ","filter_flag":1}
{"title":"How much does sustainable timber contribute to carbon emissions reduction? - Architecture and Design","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvZmVhdHVyZXMvY29tbWVudC9zdXN0YWluYWJsZS10aW1iZXLSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvZmVhdHVyZXMvY29tbWVudC9zdXN0YWluYWJsZS10aW1iZXLSAQA?oc=5","id":"CBMiTGh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvZmVhdHVyZXMvY29tbWVudC9zdXN0YWluYWJsZS10aW1iZXLSAQA","guidislink":false,"published":"Mon, 26 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=177, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvZmVhdHVyZXMvY29tbWVudC9zdXN0YWluYWJsZS10aW1iZXLSAQA?oc=5\" target=\"_blank\">How much does sustainable timber contribute to carbon emissions reduction?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Architecture and Design<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How much does sustainable timber contribute to carbon emissions reduction? - Architecture and Design","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvZmVhdHVyZXMvY29tbWVudC9zdXN0YWluYWJsZS10aW1iZXLSAQA?oc=5\" target=\"_blank\">How much does sustainable timber contribute to carbon emissions reduction?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Architecture and Design<\/font>","source.href":"https:\/\/www.architectureanddesign.com.au","source.title":"Architecture and Design","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"How can timber construction be sustainable when you have to cut down trees to source the material? Construction and carbon emissions A 2021 report by the Clean Energy Finance Corporation (CEFC) reveals that the traditional steel-and-concrete construction sector is one of the biggest contributors to carbon emissions, accounting for around 39 percent of total global emissions – 28 percent from building operations and 11 per cent from embodied carbon in building materials and construction. Australia’s $65-billion construction material industry alone accounts for 30-50 million tonnes of CO2-e each year, amounting to approximately 5-10 per cent of the national greenhouse gas emissions (GHGs). Substitution of carbon-intensive materials such as steel and cement with low embodied carbon materials is one of the strategies being adopted to reduce the industry’s carbon footprint. Timber is an infinitely renewable resource, stores carbon (approx. 1 tonne\/m³), and has very low embodied carbon. By replacing steel and concrete with timber products for instance, embodied carbon can be reduced by up to 75 percent, according to the CEFC. However, given the global campaign against deforestation, how will we get the timber for our buildings? Sourcing timber from Australia’s forests According to the Federal Government's Department of Agriculture, Fisheries and Forestry, Australia has a total forest cover of 134 million hectares, equivalent to 17% of the country’s total land area. While 132 million hectares (98 percent) are designated ‘native forests’, 1.74 million hectares are 'commercial plantations'. More than 85 percent of the 32.9 million cubic metres of logs harvested in Australia each year is sourced from plantations. A key objective of Australia’s national forest policy has been to increase the plantation timber resource ‘to expand Australia's forest industries and offset the reduced access to native forest resource’, states the Department of Agriculture, Fisheries and Forestry. Towards this, the Federal Government has committed $86.2 million in the 2022-23 budget to support a 5-year program for the establishment of new plantations and help secure future domestic timber supply. But what makes timber sustainable? Sustainable timber is timber sourced from sustainably managed and certified forests. Applicable to both native forests and plantations, forest certification demonstrates the implementation of sustainable forest management practices and is conducted through an audit by an independent third-party certification agency. In Australia, forests can be certified by the two major global forest certification bodies – the Programme for the Endorsement of Forest Certification (PEFC) under the Responsible Wood Certification Scheme, or the Forest Stewardship Council (FSC). Currently, 26.7 million hectares of native forests and plantations are certified under the Responsible Wood Certification Scheme, and 1.2 million hectares under the FSC. Both forest certification schemes provide chain-of-custody certification, which can be used to track wood and wood-based products sourced from certified forests throughout the supply chain from the forest to the market. This provides buyers the assurance that the timber products they have purchased have originated from a sustainably managed and certified forest that practises responsible forestry. Sustainable timber for environment-friendly construction The mass timber building movement across the world is seeing leading developers competing for the “tallest timber building” crown, with new projects announced almost every month. A global audit of tall timber buildings (8+ storeys) conducted by CTBUH in February 2022 yielded a total of 139 buildings that were either proposed, under construction or completed, and featured all-timber or hybrid construction methods, with Europe leading the way with 60 buildings, followed by North America (15) and Australia (8). Having identified the potential to cut emissions in the building and construction sector, the CEFC announced a new $300 million program in early 2022 to encourage and accelerate the use of mass timber construction across the property industry. Seeking to transform Australia’s approach to large-scale building construction, CEFC believes the program can substantially cut construction-related emissions, providing a greener alternative to conventional construction materials. CEFC CEO Ian Learmonth said: “Timber has been used in construction for generations. Innovations in engineered wood products have created new opportunities for mass timber construction to be used in larger projects, creating the potential for immediate and long-term environmental benefits. Our new Timber Building Program will help finance this transition by encouraging owners, developers and builders to use lower carbon engineered wood products in their projects.” CEFC director of property investment Ryan Rathborne added: “The time is right for the development of more timber buildings across the property sector. By locking in mass timber construction in new projects, we can also help develop local skills and experience, supply chains and delivery capabilities, all of which can catalyse more timber-based building activity into the future.” While the jury is still out on how much sustainable timber can contribute to carbon emissions reduction, the use of mass timber in construction is already delivering a slew of benefits: Engineered wood is lightweight, allowing for simple handling and machining; offers structural strength comparable to steel and concrete; enables prefabrication offsite with onsite assembly, reducing construction time and labour costs; is fire-resistant; and can be dismantled and reused in new structures. Image: Australia’s tallest engineered timber office building, Brisbane’s 25 King has officially been unveiled. Image: Sustainability Awards","filter_flag":1}
{"title":"New investment in peat in fight against climate change - GOV.UK","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3Lmdvdi51ay9nb3Zlcm5tZW50L25ld3MvbmV3LWludmVzdG1lbnQtaW4tcGVhdC1pbi1maWdodC1hZ2FpbnN0LWNsaW1hdGUtY2hhbmdl0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3Lmdvdi51ay9nb3Zlcm5tZW50L25ld3MvbmV3LWludmVzdG1lbnQtaW4tcGVhdC1pbi1maWdodC1hZ2FpbnN0LWNsaW1hdGUtY2hhbmdl0gEA?oc=5","id":"CBMiWWh0dHBzOi8vd3d3Lmdvdi51ay9nb3Zlcm5tZW50L25ld3MvbmV3LWludmVzdG1lbnQtaW4tcGVhdC1pbi1maWdodC1hZ2FpbnN0LWNsaW1hdGUtY2hhbmdl0gEA","guidislink":false,"published":"Thu, 29 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=180, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3Lmdvdi51ay9nb3Zlcm5tZW50L25ld3MvbmV3LWludmVzdG1lbnQtaW4tcGVhdC1pbi1maWdodC1hZ2FpbnN0LWNsaW1hdGUtY2hhbmdl0gEA?oc=5\" target=\"_blank\">New investment in peat in fight against climate change<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GOV.UK<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New investment in peat in fight against climate change - GOV.UK","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3Lmdvdi51ay9nb3Zlcm5tZW50L25ld3MvbmV3LWludmVzdG1lbnQtaW4tcGVhdC1pbi1maWdodC1hZ2FpbnN0LWNsaW1hdGUtY2hhbmdl0gEA?oc=5\" target=\"_blank\">New investment in peat in fight against climate change<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GOV.UK<\/font>","source.href":"https:\/\/www.gov.uk","source.title":"GOV.UK","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"New action to reduce peat carbon emissions, improve resilience to drought and support farmers following recommendations from the Chair of the Lowland Agricultural Peat Task Force Over £7.5 million of new funding for innovative water management projects to help mitigate the impacts of climate change Winners of £5 million Paludiculture Exploration Fund grant scheme also announced New investment and actions to improve lowland peat and reduce carbon emissions have been set out by the government today (Thursday 29 June). Peat soils contain over half the country’s terrestrial carbon stores and serve as a potent nature-based solution against climate change. However, as a result of centuries of drainage to create land suitable for agriculture, our peat soils are drying out, causing the organic matter they contain to decompose and release carbon into the atmosphere. Today, just 1% of England’s lowland peatlands remain in a near-natural state. By rewetting lowland peat soils, we can deliver carbon emission reductions, improve food security, boost wetland biodiversity, and better protect communities from flooding. To support the preservation and sustainable management of lowland peatlands, the government has announced that it will take forward action on all the recommendations made by Robert Caudwell, independent Chair of the Lowland Agricultural Peat Task Force, whose report is published today. Environment Minister Trudy Harrison said: Our peatlands are invaluable allies in our battle against climate change, housing over half of our terrestrial carbon stores and providing resilience for future farming. These new measures, which includes funding for innovative new water management schemes, bolster our efforts to protect and improve peat soils – enhancing carbon storage, preserving vital ecosystems, and paving the way for a more sustainable future. This comes alongside over £7.5 million of new funding to kickstart improvements in how we manage water resources to rewet and preserve peat soils. This funding will drive advancements in our understanding of the lowland peat water challenge to transform the way we use water in England’s lowland peat, and will also pay for the installation of infrastructure and monitoring technology to enable more control of water levels in these regions. The measures government is taking will also improve resilience to drought and safeguard productive farming on some of our most valuable agricultural land, supporting our rural economy and those whose livelihoods are intrinsically tied to the land. In 2020, the government established the Lowland Agricultural Peat Task Force to explore how to improve the condition of England’s lowland farmed peat whilst ensuring the continuation of productive agriculture for years to come. The Chair of the task force has put forward fourteen recommendations to government and the wider sector to ensure that lowland peat soils can be managed more sustainably. These recommendations include: New investment in water storage, management and control Public money for wetter modes of farming on peat soils Technical advice on keeping peat soils wetter Creating viable opportunities in private finance Raising the profile of lowland agricultural peat soils Adopting the task force’s roadmap to commercially viable paludiculture (farming on rewetted peat) Robert Caudwell, Chair of the Lowland Agricultural Peat Task Force said: I thank all the members of the Lowland Agricultural Peat Task Force for their time and commitment to finding ways of managing lowland agricultural peat that are sustainable and substantially reduce carbon emissions. All the evidence demonstrates that reducing carbon emissions from lowland peat is vital as part of the United Kingdom government’s plan to tackle climate change. The report and the U.K. government’s response are important first steps in a journey that will require partnership between all stakeholders, and I am confident that the work that is already underway will give farmers opportunities to develop their businesses and contribute to the challenge of net zero. The new funding is distributed across two pilots. The Lowland Agricultural Peat Small Infrastructure Pilot (£5.45m) will support the installation of infrastructure and monitoring technology to enable more control of water levels for the preservation and rewetting of lowland peat. Delivery of this project is being supported by the Association of Drainage Authorities. The Lowland Agricultural Peat Water Discovery Pilot (£2.2m), to be delivered by the Environment Agency, will allow local and water peatland partnerships to collaborate to develop costed water level management plans for lowland peat areas in England. Alan Lovell, Chair of the Environment Agency said: The Environment Agency welcomes the publication of the Caudwell report. Drawing on the report’s recommendations, we recognise that the sustainable management of the water environment through raising the water table within peat soils holds a pivotal role in protecting the carbon it stores. The report findings combined with further research and development provide useful support and incentives to farmers looking to transition to more climate friendly farming of peat soils. This is set out in our National Flood and Coastal Erosion Risk Management Strategy for England and Roadmap. Twelve projects across England are also set to receive support through the £5 million Paludiculture Exploration Fund grant scheme - administered by Natural England - to help understand and overcome barriers to developing paludiculture as a commercially viable farming practice on lowland peat soils. Tony Juniper, Chair of Natural England said: Lowland peatlands play an important role in combating climate change, by keeping carbon in the land and out of the air. Working with land managers and others, it is imperative we find ways to support livelihoods and produce what society needs while at the same time halting the degradation of peat soils. This is why I am so delighted that the £5 million Paludiculture Exploration Fund grant scheme will support twelve projects aimed at overcoming obstacles to developing economically viable farming on wet peat soils. This promising form of wetland agriculture holds tremendous potential for both revitalising peatlands and supporting profitable and sustainable rural businesses. Today’s announcements are part of the government’s commitments to drive international ambition on action to tackle climate change and work towards nature-based solutions, and demonstrate our ambition to deliver on our net zero pathway. The evidence generated by the projects will enable Defra to deliver on our lowland peat commitments within the government’s England Peat Action Plan, Net Zero Strategy, Environmental Improvement Plan, and Plan for Water. On lowland peat, Defra has already funded a new update to the Peatland Code, announced a £6.6m peatland research and development programme, and is developing new farming schemes to support rewetting, restoration and new farming methods in the lowlands. It will also be publishing the new England Peat Map next year. In recognition of the environmental benefits and the key role lowland peat soils play in food production, the government will continue to work with the Chair of the task force as well as farmers, landowners and the wider industry to take forward action on all the report’s recommendations for more sustainable forms of peatland management. Notes to editors: Lowland Agricultural Peat Task Force Robert Caudwell was chair of the Lowland Agricultural Peat Task Force – a group that was tasked with improving the condition of England’s farmed lowland peat. The task force ran between 2021 and 2022. It comprised a national group and four regional sub-groups, which advised on the circumstances of our most extensive lowland peatlands spanning North-East, North-West, South-West and East England. The Task Force was also supported by a sub-group composed of experts in paludiculture. Membership of the Task Force was as follows: Andrea Kelly, Broads Authority Charles Shropshire, G’s Global Chris Evans, UK Centre For Ecology & Hydrology (UKCEH) Daniel Johns, Anglian Water Deborah Land, Natural England Ian Moodie, Association of Drainage Authorities (ADA) Julie Foley, Environment Agency Olly Watts, RSPB Philippa Arnold, National Farmers Union (NFU) Richard Lindsay, University of East London (UEL) Stephen Briggs, Innovation for Agriculture Colleagues from Defra and the Environment Agency Project details Project: Lowland Agricultural Peat Water Discovery Pilot (2023-2025) Funding: £2.2 million Details: The Lowland Agricultural Peat Water Discovery Pilot, delivered by the Environment Agency, will help to improve Defra’s understanding of how water can be better managed to support the rewetting and preservation of lowland peatlands. The project will allow partnerships to collaborate locally to develop costed water level management plans for lowland peat areas in England. Project: Lowland Agricultural Peat Small-Infrastructure Pilot (2023-2025) Funding: £5.45 million Details: The Lowland Agricultural Peat Small Infrastructure Pilot will support the installation of infrastructure and monitoring technology, which will enable more control of water levels for the preservation and rewetting of lowland peat. Delivery of this project is being supported by the Association of Drainage Authorities. In addition to these projects, Defra is planning to support a research and development programme over the next two years with the Environment Agency to investigate questions around rewetting peat, such as water demand, supply and storage; water-management structures; flood-risk management; nature-based solutions for water quality; biodiversity and regulation. The new projects sit alongside an existing portfolio of work on lowland peat, which includes: Lowland Peat 3 This project forms part of the £6.6 million Lowland Peat Research and Development Programme, and will explore further the options, feasibility and wider impacts of managing lowland agricultural peat for reduced greenhouse gas emissions. The work will focus on water availability and distribution to rewet lowlands; impact of topography on rewetting; impacts and risks of more sustainable management practices; and implications on national food supplies. More information is available on the Lowland Peat Project 3 page. The Peatland Code Following a Defra funded research report on greenhouse gas data and emissions factors, the IUCN UK Peatland Programme launched an update to the Peatland Code in March 2023, which allowed lowland fen peatland to be included for the first time. The Peatland Code helps to promote the restoration and protection of peatlands in the UK through attracting private finance. The Peatland Code allows landowners with eligible peatlands to generate carbon units which can be sold to companies seeking to offset their residual carbon emissions. Paludiculture Exploration Fund Paludiculture, or farming on rewetted peat, is a system of agriculture for the profitable production of wetland crops under conditions that support the competitive advantage of these crops. It offers an opportunity to continue profitable agriculture on lowland peat while also managing the land in a way that benefits the environment and supports our net zero ambitions. The £5m Paludiculture Exploration Fund grant scheme application window was open from January 2023 to March 2023. Natural England are today announcing the twelve projects across England which have been successful in securing grants to support the reduction of barriers to developing commercially viable paludiculture on lowland peat soils. Paludiculture Exploration Fund: grant awardees Below is a list and brief description of the projects that this fund is supporting. The projects will explore: how water levels might be raised and managed how crop production might be increased new products and markets that might evolve from paludiculture crops · You can find follow these projects and other developments in paludiculture at www.paludiculture.org.uk AutoSpray Systems: Develop protocols & best working practices for the use of drones for seeding & crop maintenance in Paludiculture. The project will look at existing use of drones and explore potential new areas of use for drones in paludiculture scenarios. The project will focus on various potential crop management tasks as well as the use of drones to monitor crop health. The project will also explore the environmental impact of drone use. The Broads Authority: Fibre Broads The project aims to ‘unlock paludiculture’ through several outcomes. Through feasibility discussions with farmers, it will identify areas in the Broads most suited to wetland crops. In a strategic alliance it will promote and provide a demonstration of paludiculture fibre products to farmers in the region. To promote paludiculture sourced materials in developing consumer and construction products and explore new market opportunities for paludiculture products. Coates English Willow: Low impact Willow Growing as a Paludiculture Crop to produce a high value product ensuring a sustainable future for landowners on the lowland Somerset Moors The project will use willow to produce a sustainable, renewable product whilst protecting and preserving the peat on West Sedgemoor. Utilising hundreds of years of expertise and knowledge of willow and the land, the project will research and develop new science and technology for more efficient planting, with lower herbicide use, and improved harvesting practises and develop a high value product to provide sustainability to farming businesses. Farming and Wildlife Advisory Group Southwest: Developing sustainable land use options on the Somerset Levels Explore a viable land use on multiple pockets of land across the Somerset Levels & Moors (SL&M), overcoming economic and cultural barriers to raising water levels across hydrological blocks of peat. Provide an income stream for owners of the lowest-lying fields, enabling water tables to be raised in higher\/drier fields and reducing CO2 emissions without expensive hydrological engineering works. Explore paludiculture to improve water quality, specifically by reducing phosphate pollution levels within SSSI and Ramsar protected sites. To assess if paludiculture can play a role in supporting ecological diversity of the SL&M through targeted use within the landscape. Fenland SOIL Ltd: Mapping and identification of peatland suitable for change of land-use to paludiculture in the East Anglian Fens The project will work with farmers to build on work the group has already completed in an NCPGS discovery project. Creating and ground truthing detailed peat maps. Supporting these maps with productivity and water management opportunity data. Implementing hydrological modelling of the landscape to monitor water table fluctuation along with CO2 & CH4 emissions. Harper Adams University: The Paludiculture Innovation Project Research and development into the practical field preparation; water management and associated infrastructure needed to establish paludiculture crops. Demonstrated on the university site to use as an educational facility as well as building knowledge around the cropping techniques. Assessment of machinery requirements and opportunities. Collecting data on the above outcomes as well as social impact and value modelling to establish best practice, relevance, and barriers to paludiculture among the farming community. Lancashire Wildlife Trust : Typha production at scale – from field to market. The focus of the project is to develop understanding of the economics, practical issues, and environmental uplift of commercial Typha growing at field scale. Many practical aspects of growing crops on wet soil conditions will be explored from sowing through to management and harvesting. Adapting current mechanised processes and exploring new ones through farmer led experience. In support of this other food crops will be grown at trial scale to explore these opportunities. Manchester Metropolitan University: OPENpeat - Opportunities for Paludiculture and Engagement in the North West: promoting knowledge exchange and assessing opportunity OPENpeat will define and demonstrate the future role of paludiculture in a conservation and ecosystem services focussed landscape. Sharing best practice from existing and emerging paludiculture trials in UK and EU through direct farmer engagement and promote peer to peer learning between UK farmers. During the project period, activities including interviews and workshops aim to embed paludiculture discussion and willingness of farmers on lowland peat to experiment with paludiculture. Micropropagation Services: Solving The Peatland Crisis Through Sphagnum Farming – The Green Alternative to Peat The project will scale up the production of Sphagnum Farming to produce sustainable growing media to replace peat and support the English horticulture sector, whilst also supporting lowland peat farmers with this sustainable, profitable Sphagnum crop for their land. The project will create a commercially sustainable demonstration farm and overcome identified barriers throughout the supply chain. Saltyco: Typha seed heads for textile production: typha processing, agronomy and analysis for paludiculture market development and new knowledge for scaled cultivation To develop and scale up the process of seed separation for Saltyco’s patented BioPuff product. To explore the potential to use these seeds as planting source for new crop establishment. In addition to this, new uses and products will be explored for the Typha seeds to add further value to this paludiculture crop. UK Centre for Ecology & Hydrology: Overcoming Financial Barriers for Paludiculture with Biochar Integration The project aims to build on and expand trials of incorporating biochar in peat soils. Biochar is a charcoal-like product following the pyrolysis of biomass feedstocks under low oxygen conditions. Being high in carbon (>70%) and relatively stable, it is viewed as a form of carbon capture but may also improve other functions in soil and deliver other agronomic benefits. In this way, biochar has the potential to be an additional income stream for farmers considering paludiculture. Vitagrass Farms Ltd: Paludiculture Opportunities at Vitagrass The overall goal and vision for this project is to overcome the variety of barriers to paludiculture. The grant will explore the options that need to be considered to produce a business case. On production of the business case a small-scale trial site will explore a recommended paludiculture option.","filter_flag":1}
{"title":"Al Ain Zoo marks World Environment Day - Gulf Today","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3Lmd1bGZ0b2RheS5hZS9uZXdzLzIwMjMvMDYvMDUvYWwtYWluLXpvby1tYXJrcy13b3JsZC1lbnZpcm9ubWVudC1kYXnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3Lmd1bGZ0b2RheS5hZS9uZXdzLzIwMjMvMDYvMDUvYWwtYWluLXpvby1tYXJrcy13b3JsZC1lbnZpcm9ubWVudC1kYXnSAQA?oc=5","id":"CBMiT2h0dHBzOi8vd3d3Lmd1bGZ0b2RheS5hZS9uZXdzLzIwMjMvMDYvMDUvYWwtYWluLXpvby1tYXJrcy13b3JsZC1lbnZpcm9ubWVudC1kYXnSAQA","guidislink":false,"published":"Mon, 05 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=156, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3Lmd1bGZ0b2RheS5hZS9uZXdzLzIwMjMvMDYvMDUvYWwtYWluLXpvby1tYXJrcy13b3JsZC1lbnZpcm9ubWVudC1kYXnSAQA?oc=5\" target=\"_blank\">Al Ain Zoo marks World Environment Day<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Gulf Today<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Al Ain Zoo marks World Environment Day - Gulf Today","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3Lmd1bGZ0b2RheS5hZS9uZXdzLzIwMjMvMDYvMDUvYWwtYWluLXpvby1tYXJrcy13b3JsZC1lbnZpcm9ubWVudC1kYXnSAQA?oc=5\" target=\"_blank\">Al Ain Zoo marks World Environment Day<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Gulf Today<\/font>","source.href":"https:\/\/www.gulftoday.ae","source.title":"Gulf Today","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"The event will also feature a documentary presentation called \"Natural Life in Abu Dhabi — Al Dhafra Turtles\". Al Ain Zoo emphasised some of its efforts in nature conservation and preservation of wildlife and held an event at the Sheikh Zayed Desert Learning Centre on the occasion of World Environment Day, celebrated on June 5th every year. First, of the Zoo's achievements, is its first natural reserve for the protection and breeding of the Arabian Oryx. This achievement was followed by various programmes such as the programme for the Arabian Sand Cat Breeding and the Publication of the Dama Gazelle Conservation Strategy. Based on the intent to make a difference in environmental awareness and nature preservation, the Zoo organise an event on World Environment Day to be held at the Sheikh Zayed Desert Learning Centre entitled, \"Beat Plastic Pollution”. This event intends to provide information to all Zoo Staff about the danger of plastics and their threat to nature and wildlife. The event will also feature a documentary presentation called \"Natural Life in Abu Dhabi — Al Dhafra Turtles\". This will be followed by several environment-related awareness\/workshops such as plastic identification, waste classification, and recycling. As a token of appreciation to all who will attend the event, reusable metal water bottles will be distributed as an encouragement to stop using disposable plastic water bottles. READ MORE Sheikha Bodour appoints Mariam Al Obaidli as managing director of Kalimat Group Sheikh Ahmed reviews progress of key development projects in Hatta A documentary called; \"Drowning in Plastic” was also featured. Several environment-related awareness workshops were held such as plastic identification code awareness and waste classification and recycling. The Zoo distributed reusable metal water bottles for visitors and the Zoo staff to encourage them to stop using disposable plastic water bottles and switch to choose more sustainable materials as an alternative to disposable plastic containers. On this note, as of August 2022, the Zoo was able to reduce the use of disposable plastic water bottles by 6880 bottles along with the recycling of 3761kg of paper, 480kg of plastics, 170kg of ink cartridges, 5kg of metal containers and 400kg of electronic waste. The Zoo's recycling initiatives by using recycle materials to make new products helped minimised greenhouse gas emissions, and reduce energy consumption, saving 391 million thermal power units of energy, 117 cubic meters of landfill, 232 trees, and 1810 gallons of fuel. Al Ain Zoo is always keen to educate the public, especially the UAE youth and its employees, on the importance of preserving the environment, its natural resources, and its wildlife, by celebrating environmental events, organizing awareness-raising activities, workshops, camps, and many more. WAM","filter_flag":1}
{"title":"Uber offers electric vehicle choice to riders at no extra cost - 9News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LjluZXdzLmNvbS5hdS9uYXRpb25hbC91YmVyLWdyZWVuLWVsZWN0cmljLXZlaGljbGUtY2hvaWNlLXJpZGVzaGFyZS1hdXN0cmFsaWEvYThkOGNkYjgtZTEyMS00MGYzLTk5NDMtYmUyOTY2ZDViOWZj0gFFaHR0cHM6Ly9hbXAuOW5ld3MuY29tLmF1L2FydGljbGUvYThkOGNkYjgtZTEyMS00MGYzLTk5NDMtYmUyOTY2ZDViOWZj?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LjluZXdzLmNvbS5hdS9uYXRpb25hbC91YmVyLWdyZWVuLWVsZWN0cmljLXZlaGljbGUtY2hvaWNlLXJpZGVzaGFyZS1hdXN0cmFsaWEvYThkOGNkYjgtZTEyMS00MGYzLTk5NDMtYmUyOTY2ZDViOWZj0gFFaHR0cHM6Ly9hbXAuOW5ld3MuY29tLmF1L2FydGljbGUvYThkOGNkYjgtZTEyMS00MGYzLTk5NDMtYmUyOTY2ZDViOWZj?oc=5","id":"CBMifWh0dHBzOi8vd3d3LjluZXdzLmNvbS5hdS9uYXRpb25hbC91YmVyLWdyZWVuLWVsZWN0cmljLXZlaGljbGUtY2hvaWNlLXJpZGVzaGFyZS1hdXN0cmFsaWEvYThkOGNkYjgtZTEyMS00MGYzLTk5NDMtYmUyOTY2ZDViOWZj0gFFaHR0cHM6Ly9hbXAuOW5ld3MuY29tLmF1L2FydGljbGUvYThkOGNkYjgtZTEyMS00MGYzLTk5NDMtYmUyOTY2ZDViOWZj","guidislink":false,"published":"Thu, 08 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=159, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LjluZXdzLmNvbS5hdS9uYXRpb25hbC91YmVyLWdyZWVuLWVsZWN0cmljLXZlaGljbGUtY2hvaWNlLXJpZGVzaGFyZS1hdXN0cmFsaWEvYThkOGNkYjgtZTEyMS00MGYzLTk5NDMtYmUyOTY2ZDViOWZj0gFFaHR0cHM6Ly9hbXAuOW5ld3MuY29tLmF1L2FydGljbGUvYThkOGNkYjgtZTEyMS00MGYzLTk5NDMtYmUyOTY2ZDViOWZj?oc=5\" target=\"_blank\">Uber offers electric vehicle choice to riders at no extra cost<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">9News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Uber offers electric vehicle choice to riders at no extra cost - 9News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LjluZXdzLmNvbS5hdS9uYXRpb25hbC91YmVyLWdyZWVuLWVsZWN0cmljLXZlaGljbGUtY2hvaWNlLXJpZGVzaGFyZS1hdXN0cmFsaWEvYThkOGNkYjgtZTEyMS00MGYzLTk5NDMtYmUyOTY2ZDViOWZj0gFFaHR0cHM6Ly9hbXAuOW5ld3MuY29tLmF1L2FydGljbGUvYThkOGNkYjgtZTEyMS00MGYzLTk5NDMtYmUyOTY2ZDViOWZj?oc=5\" target=\"_blank\">Uber offers electric vehicle choice to riders at no extra cost<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">9News<\/font>","source.href":"https:\/\/www.9news.com.au","source.title":"9News","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Uber has announced a range of new products and initiatives in London today which focus on the company's ambition to be a zero-emissions platform by 2040, including the option to book a \"green\" car at no extra cost. According to the rideshare giant, light vehicles like those being used by Uber drivers to take people from place to place account for some 11 per cent of Australia's greenhouse gas emissions. With a goal for net zero , it's going to take a lot more than talk to achieve results. READ MORE: Woolworths backflips on paper bag promise ﻿ Uber has unveiled its new Uber Green option. (Rob Locke) Uber ANZ general manager Dom Taylor told 9News that \"Australia's path to net zero is going to take a concerted effort from all of us, and Uber is stepping up to play our part\". \"We have a responsibility to offer more sustainable choices across our platform and to do our bit in accelerating Australia's path to zero emissions,\" he added. To this end, Uber is today launching Uber Green, an option for passengers to choose when booking a ride that the car that arrives for them is a hybrid or fully electric. Uber Green is an option for passengers to choose when booking a ride that will ensure the car that arrives for them is a hybrid or fully electric vehicle. (Rob Locke) Drivers are being incentivised to drive electrified vehicles through reduced Uber commissions, meaning more money in their pocket from every trip they drive, while for passengers there is no cost attached to their choice. In fact, the company says because Uber Green is priced the same as the entry-level Uber X, it's likely the ride is a better deal in terms of comfort and value. Australia's Uber Green option includes hybrid and fully electric vehicles, unlike other markets like London where the announcement was made. In the UK, the Uber Green option is fully electric thanks mainly to the higher rate of EV sales. READ MORE: Pizza Hut Australia sold to US franchise giant ﻿ Uber Green is available to passengers in Sydney, Melbourne, Brisbane, the Gold Coast, Perth, Adelaide and Canberra. (Rob Locke) \"As we transition to net zero we need to bring industry along the journey with us, particularly emissions-heavy sectors like transport,\" Queensland Transport Minister Mark Bailey, the first Australian to take an Uber Green trip, said. \"This is a smart innovation from Uber. It's through these simple changes in our day-to-day routines that we will reduce our emissions and achieve our net zero target.\" The company is also expanding its partnership with BP Pulse to offer charging discounts to Uber drivers with fully electric cars, and the Uber Eats platform has a goal to reduce its use of plastics and other waste with sustainable packaging for restaurant deliveries by the end of the decade. A new ride option labelled Uber Green is available today to passengers in Sydney, Melbourne, Brisbane, the Gold Coast, Perth, Adelaide and Canberra. Trevor Long travelled to London as a guest of Uber Australia. Rare classic cars up for auction after huge 230-vehicle find View Gallery","filter_flag":1}
