{"title":"National Programs for Science and Technology","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cd68ee3443daf5ea25fe50078f3&url=http%3a%2f%2fwww.china.org.cn%2fenglish%2ffeatures%2fChina2005%2f142235.htm&c=3233604962656498707&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cd68ee3443daf5ea25fe50078f3&url=http%3a%2f%2fwww.china.org.cn%2fenglish%2ffeatures%2fChina2005%2f142235.htm&c=3233604962656498707&mkt=en-us","summary":"and advanced and energy-saving technology. Launched in 1986, the Spark Program aims to revitalize rural economy through development and popularization of science and technology in rural areas so ...","published":"Mon, 08 Feb 2010 19:28:00 GMT","published_parsed":"time.struct_time(tm_year=2010, tm_mon=2, tm_mday=8, tm_hour=19, tm_min=28, tm_sec=0, tm_wday=0, tm_yday=39, tm_isdst=0)","news_source":"China Internet Information Center","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"National Programs for Science and Technology","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"and advanced and energy-saving technology. Launched in 1986, the Spark Program aims to revitalize rural economy through development and popularization of science and technology in rural areas so ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Energy-saving technology\" \"new products\"&format=rss","text":"National Programs for Science and Technology As of the 1980s, China has formulated a series of programs for science and technology research and development, with the strategic aim of improving China's competitiveness in science and technology in the 21st century. The Key Technologies Resarch and Development Program, the 863 Program and the 973 Program form the main body of state programs for science and technology. The Spark and the Torch programs have been important in raising China's strength in this area. Key Technologies Research and Development Program The Key Technologies Research and Development Program, launched in 1982, was the biggest scientific and technological program in China during the 20th century. Oriented toward national economic construction, it aims to solve critical, direction-related and comprehensive problems in national economic and social development; it covers agriculture, electronic information, energy, transport, materials, resources exploration, environmental protection and medical care, and other fields. Engaging tens of thousands of researchers in over 1,000 research institutes, the Key Technologies Program has had the largest funding, employed the most people and had the greatest impact on national economy of any plan to date. 863 Program In March 1986, the National Hi-tech Research and Development Program (863 Program) was launched, after exhaustive examination by scientists. The Program set 20 themes in biology, spaceflight, information, laser, automation, energy, new materials and oceanography. Government's role is one of macro-control and support. The general research is decided on by scientific discussion, and specific projects determined by a committee of experts responsible for keeping abreast of international research developments, and reporting annually on their own fields, so as to set new research directions. Another distinctive feature of the program is that its results can be quickly industrialized. 973 Program A national key program for development of basic scientific research, the 973 Program was launched in 1998. It mainly involves multi-disciplinary, comprehensive research on important scientific issues in such fields as agriculture, energy, information, resources, population, health, and materials, providing theoretical basis and scientific foundations for solving problems. The program encourages outstanding scientists to carry out key basic research in cutting-edge science and important sci-tech issues in fields with a great bearing on socio-economic development. Representing China's national goals, it aims to provide strong scientific and technological support for significant issues in China's 21st century socio- economic development. Torch Program Launched in August 1988, the Torch Program is China's most important high-tech industry program and a national guideline program. As such, it includes: organizing and putting into action a series of development projects for high-tech products with advanced technology levels and good economic benefits in domestic and foreign markets; establishing high-tech industrial development zones throughout the country; and, exploring management systems and operation mechanisms suitable for hi-tech industrial development. The Program mainly involves projects in new technological fields, such as new materials, biotechnology, electronic information, integrated mechanical-electrical technology, and advanced and energy-saving technology. Spark Program Launched in 1986, the Spark Program aims to revitalize rural economy through development and popularization of science and technology in rural areas so as to improve the lives of the rural population. Today, there are more than 140,000 sci-tech demonstration projects being carried out in 90 percent of rural areas throughout China. The Key Technologies Research and Development Program, launched in 1982, was the biggest scientific and technological program in China during the 20th century. Oriented toward national economic construction, it aims to solve critical, direction-related and comprehensive problems in national economic and social development; it covers agriculture, electronic information, energy, transport, materials, resources exploration, environmental protection and medical care, and other fields. Engaging tens of thousands of researchers in over 1,000 research institutes, the Key Technologies Program has had the largest funding, employed the most people and had the greatest impact on national economy of any plan to date.In March 1986, the National Hi-tech Research and Development Program (863 Program) was launched, after exhaustive examination by scientists. The Program set 20 themes in biology, spaceflight, information, laser, automation, energy, new materials and oceanography. Government's role is one of macro-control and support. The general research is decided on by scientific discussion, and specific projects determined by a committee of experts responsible for keeping abreast of international research developments, and reporting annually on their own fields, so as to set new research directions. Another distinctive feature of the program is that its results can be quickly industrialized.A national key program for development of basic scientific research, the 973 Program was launched in 1998. It mainly involves multi-disciplinary, comprehensive research on important scientific issues in such fields as agriculture, energy, information, resources, population, health, and materials, providing theoretical basis and scientific foundations for solving problems. The program encourages outstanding scientists to carry out key basic research in cutting-edge science and important sci-tech issues in fields with a great bearing on socio-economic development. Representing China's national goals, it aims to provide strong scientific and technological support for significant issues in China's 21st century socio- economic development.Launched in August 1988, the Torch Program is China's most important high-tech industry program and a national guideline program. As such, it includes: organizing and putting into action a series of development projects for high-tech products with advanced technology levels and good economic benefits in domestic and foreign markets; establishing high-tech industrial development zones throughout the country; and, exploring management systems and operation mechanisms suitable for hi-tech industrial development. The Program mainly involves projects in new technological fields, such as new materials, biotechnology, electronic information, integrated mechanical-electrical technology, and advanced and energy-saving technology.Launched in 1986, the Spark Program aims to revitalize rural economy through development and popularization of science and technology in rural areas so as to improve the lives of the rural population. Today, there are more than 140,000 sci-tech demonstration projects being carried out in 90 percent of rural areas throughout China.","filter_flag":1}
