{"title":"Australian Engineers Unveil Breakthrough in Concentrating Solar Thermodynamics - Microgrid Media","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vbWljcm9ncmlkbWVkaWEuY29tL2F1c3RyYWxpYW4tZW5naW5lZXJzLXVudmVpbC1icmVha3Rocm91Z2gtaW4tY29uY2VudHJhdGluZy1zb2xhci10aGVybW9keW5hbWljcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vbWljcm9ncmlkbWVkaWEuY29tL2F1c3RyYWxpYW4tZW5naW5lZXJzLXVudmVpbC1icmVha3Rocm91Z2gtaW4tY29uY2VudHJhdGluZy1zb2xhci10aGVybW9keW5hbWljcy_SAQA?oc=5","id":"CBMiamh0dHBzOi8vbWljcm9ncmlkbWVkaWEuY29tL2F1c3RyYWxpYW4tZW5naW5lZXJzLXVudmVpbC1icmVha3Rocm91Z2gtaW4tY29uY2VudHJhdGluZy1zb2xhci10aGVybW9keW5hbWljcy_SAQA","guidislink":false,"published":"Thu, 26 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=299, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vbWljcm9ncmlkbWVkaWEuY29tL2F1c3RyYWxpYW4tZW5naW5lZXJzLXVudmVpbC1icmVha3Rocm91Z2gtaW4tY29uY2VudHJhdGluZy1zb2xhci10aGVybW9keW5hbWljcy_SAQA?oc=5\" target=\"_blank\">Australian Engineers Unveil Breakthrough in Concentrating Solar Thermodynamics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Microgrid Media<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Australian Engineers Unveil Breakthrough in Concentrating Solar Thermodynamics - Microgrid Media","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vbWljcm9ncmlkbWVkaWEuY29tL2F1c3RyYWxpYW4tZW5naW5lZXJzLXVudmVpbC1icmVha3Rocm91Z2gtaW4tY29uY2VudHJhdGluZy1zb2xhci10aGVybW9keW5hbWljcy_SAQA?oc=5\" target=\"_blank\">Australian Engineers Unveil Breakthrough in Concentrating Solar Thermodynamics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Microgrid Media<\/font>","source.href":"https:\/\/microgridmedia.com","source.title":"Microgrid Media","query":"https:\/\/news.google.com\/rss\/search?q=\"Low energy demand\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"In a remarkable stride towards revolutionizing the realm of renewable energy, a team of engineers at Australia’s Commonwealth Scientific and Industrial Research Organisation (CSIRO) has revealed a cutting-edge advancement in Concentrating Solar Thermodynamics (CST). This pioneering technology leverages ceramic particles to amplify heat capture and storage capabilities, potentially ushering in elevated working temperatures and prolonged thermal storage durations. Dr. Jin-Soo Kim, the head of CSIRO’s solar technology team, voiced optimism about this innovation’s potential to play a pivotal role in delivering cost-effective renewable energy solutions for Australia’s heavy industry, thereby making significant contributions to the nation’s decarbonization endeavors. Concentrating Solar Thermodynamics, while not a novel concept, remains a field ripe for innovation and exploration. Under the CST umbrella, a variety of systems exist, including central tower, linear parabolic trough collectors, and linear Fresnel collectors. These systems all rely on mirrors and lenses to focus solar rays onto a receiver, thereby heating a heat transfer fluid to exceedingly high temperatures. This heated fluid, whether it’s composed of molten salts, water, diathermic oils, or supercritical CO2, is subsequently directed to a steam generator to produce electricity. During periods of low energy demand, surplus heat is judiciously stored in the fluid for later use. Despite numerous projects and studies aimed at enhancing CST efficiency, market growth has been sluggish. According to the latest report from REN 21, the global installed concentrating solar capacity merely increased by 200 MW in 2022, reaching a cumulative total of 6.3 GW. While this growth signals a positive turnaround compared to the almost stagnant performance in 2021, it underscores a significant deceleration compared to the heady days of the early 2010s when Spain and the United States spearheaded the CST revolution. Today, emerging markets such as Chile, China, Israel, Morocco, South Africa, and the United Arab Emirates are at the forefront of pioneering new CST projects. One of the primary impediments to CST deployment has been the prohibitively high cost of establishing these plants, accentuating the need for the industry to enhance efficiency and yield, thereby rendering CST economically viable. The recent milestone achieved by CSIRO offers a promising solution to some of the challenges confronting CST technology. The team, led by Dr. Jin-Soo Kim and colleague Wes Stein, has successfully engineered ceramic particles, akin to the size of sand grains, capable of withstanding extreme temperatures. These particles can be heated to temperatures as astonishing as 800°C, with the potential to surpass the 1000°C threshold in the future, outperforming conventional heat transfer materials like molten salts and diathermic oils, which are limited to temperatures of up to 600°C and 400°C, respectively. However, the innovation doesn’t stop at the ceramic particles themselves. Scientists have meticulously devised a tailor-made heat-transfer system. In this system, ceramic particles are released from a cone perched atop a solar tower, enabling them to directly absorb concentrated solar energy. Once heated, these particles are stored in a silo for subsequent use when energy demand necessitates it. While CSIRO’s concentrating solar thermodynamic system in Newcastle currently boasts a commendable array of 400 mirrors, the potential for scaling up this technology is nothing short of monumental. Experts suggest that a full-scale system could harness the power of over 10,000 mirrors or more, with the capacity to generate a staggering 100 MW of electricity. The groundbreaking achievement by CSIRO’s engineers signifies a significant milestone in the realm of renewable energy. By harnessing the potential of ceramic particles that can endure extreme temperatures and crafting an efficient heat-transfer system, they have paved the way for CST to become a more cost-effective and efficient source of renewable energy. This innovation serves the interests of Australia’s heavy industry in its pursuit of decarbonization and holds the promise of revolutionizing CST technology on a global scale. As the world intensifies its efforts to combat climate change, these Australian-led advancements in CST offer a beacon of hope for a greener and more sustainable future.","filter_flag":1}
