{"title":"BOSCH BMP585 Barometric Pressure Sensor | New Product Brief - New Products - All About Circuits","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmFsbGFib3V0Y2lyY3VpdHMuY29tL25ldy1pbmR1c3RyeS1wcm9kdWN0cy9ib3NjaC1ibXA1ODUtYmFyb21ldHJpYy1wcmVzc3VyZS1zZW5zb3ItbmV3LXByb2R1Y3QtYnJpZWYv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmFsbGFib3V0Y2lyY3VpdHMuY29tL25ldy1pbmR1c3RyeS1wcm9kdWN0cy9ib3NjaC1ibXA1ODUtYmFyb21ldHJpYy1wcmVzc3VyZS1zZW5zb3ItbmV3LXByb2R1Y3QtYnJpZWYv0gEA?oc=5","id":"CBMicWh0dHBzOi8vd3d3LmFsbGFib3V0Y2lyY3VpdHMuY29tL25ldy1pbmR1c3RyeS1wcm9kdWN0cy9ib3NjaC1ibXA1ODUtYmFyb21ldHJpYy1wcmVzc3VyZS1zZW5zb3ItbmV3LXByb2R1Y3QtYnJpZWYv0gEA","guidislink":false,"published":"Wed, 28 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=179, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmFsbGFib3V0Y2lyY3VpdHMuY29tL25ldy1pbmR1c3RyeS1wcm9kdWN0cy9ib3NjaC1ibXA1ODUtYmFyb21ldHJpYy1wcmVzc3VyZS1zZW5zb3ItbmV3LXByb2R1Y3QtYnJpZWYv0gEA?oc=5\" target=\"_blank\">BOSCH BMP585 Barometric Pressure Sensor | New Product Brief - New Products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">All About Circuits<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"BOSCH BMP585 Barometric Pressure Sensor | New Product Brief - New Products - All About Circuits","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmFsbGFib3V0Y2lyY3VpdHMuY29tL25ldy1pbmR1c3RyeS1wcm9kdWN0cy9ib3NjaC1ibXA1ODUtYmFyb21ldHJpYy1wcmVzc3VyZS1zZW5zb3ItbmV3LXByb2R1Y3QtYnJpZWYv0gEA?oc=5\" target=\"_blank\">BOSCH BMP585 Barometric Pressure Sensor | New Product Brief - New Products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">All About Circuits<\/font>","source.href":"https:\/\/www.allaboutcircuits.com","source.title":"All About Circuits","query":"https:\/\/news.google.com\/rss\/search?q=\"Robust design\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"BOSCH BMP585 Barometric Pressure Sensor The Bosch BMP585 Barometric Pressure Sensor, available from Mouser Electronics, is an innovative and reliable solution for pressure sensing applications. It sets a high standard with its exceptional performance and features. The sensor boasts an absolute accuracy of plus or minus 50 Pascals, ensuring precise pressure measurements. It also has a temperature coefficient offset of plus or minus 0.5 Pascals per degree Kelvin, further enhancing its accuracy and stability. The BMP585 can detect height changes as small as a few centimeters, making it highly sensitive and suitable for various applications. Its operational pressure range spans from 300 to 1250 Hectopascals. Operating voltages for the BMP585 range from 1.08 to 3.6 Volts for the IOs and 1.71 to 3.6 Volts for the primary supply. This flexibility in voltage requirements allows for easy integration into different systems and power sources. The sensor is designed with a gel-filled cavity, providing robust protection against water, chemicals, and other liquids. This ensures its durability and reliability even in harsh environments. With its compact footprint, the Bosch BMP585 Barometric Pressure Sensor offers a convenient single-package solution for various applications, including smartwatches, wearables, home appliances, and more. Its high performance, accuracy, and robust design make it an industry-leading choice for pressure sensing requirements. Bosch BMP585 Barometric Pressure Sensor excels in reliability and performance. It offers precise and accurate pressure measurements, sensitivity to small height changes, and robust protection against liquids. With its compact form factor, it is a versatile solution suitable for a wide range of applications. For more information, visit Mouser.com. New Industry Products are a form of content that allows industry partners to share useful news, messages, and technology with All About Circuits readers in a way editorial content is not well suited to. All New Industry Products are subject to strict editorial guidelines with the intention of offering readers useful news, technical expertise, or stories. The viewpoints and opinions expressed in New Industry Products are those of the partner and not necessarily those of All About Circuits or its writers.","filter_flag":1}
{"title":"thyssenkrupp Uhde and Johnson Matthey providing technologies for ammonia plant in Turkey - ChemEngOnline","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5jaGVtZW5nb25saW5lLmNvbS90aHlzc2Vua3J1cHAtdWhkZS1hbmQtam9obnNvbi1tYXR0aGV5LXByb3ZpZGluZy10ZWNobm9sb2dpZXMtZm9yLWFtbW9uaWEtcGxhbnQtaW4tdHVya2V5Lz9wcmludG1vZGU9MdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5jaGVtZW5nb25saW5lLmNvbS90aHlzc2Vua3J1cHAtdWhkZS1hbmQtam9obnNvbi1tYXR0aGV5LXByb3ZpZGluZy10ZWNobm9sb2dpZXMtZm9yLWFtbW9uaWEtcGxhbnQtaW4tdHVya2V5Lz9wcmludG1vZGU9MdIBAA?oc=5","id":"CBMigwFodHRwczovL3d3dy5jaGVtZW5nb25saW5lLmNvbS90aHlzc2Vua3J1cHAtdWhkZS1hbmQtam9obnNvbi1tYXR0aGV5LXByb3ZpZGluZy10ZWNobm9sb2dpZXMtZm9yLWFtbW9uaWEtcGxhbnQtaW4tdHVya2V5Lz9wcmludG1vZGU9MdIBAA","guidislink":false,"published":"Wed, 07 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=158, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5jaGVtZW5nb25saW5lLmNvbS90aHlzc2Vua3J1cHAtdWhkZS1hbmQtam9obnNvbi1tYXR0aGV5LXByb3ZpZGluZy10ZWNobm9sb2dpZXMtZm9yLWFtbW9uaWEtcGxhbnQtaW4tdHVya2V5Lz9wcmludG1vZGU9MdIBAA?oc=5\" target=\"_blank\">thyssenkrupp Uhde and Johnson Matthey providing technologies for ammonia plant in Turkey<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ChemEngOnline<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"thyssenkrupp Uhde and Johnson Matthey providing technologies for ammonia plant in Turkey - ChemEngOnline","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5jaGVtZW5nb25saW5lLmNvbS90aHlzc2Vua3J1cHAtdWhkZS1hbmQtam9obnNvbi1tYXR0aGV5LXByb3ZpZGluZy10ZWNobm9sb2dpZXMtZm9yLWFtbW9uaWEtcGxhbnQtaW4tdHVya2V5Lz9wcmludG1vZGU9MdIBAA?oc=5\" target=\"_blank\">thyssenkrupp Uhde and Johnson Matthey providing technologies for ammonia plant in Turkey<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ChemEngOnline<\/font>","source.href":"https:\/\/www.chemengonline.com","source.title":"ChemEngOnline","query":"https:\/\/news.google.com\/rss\/search?q=\"Robust design\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"thyssenkrupp Uhde (Essen, Germany) and Johnson Matthey plc (JM; London) have been commissioned by İGSAŞ – İstanbul Gübre Sanayii A.Ş., Kocaeli (Turkey) to supply a solution to significantly reduce the pressure in the synthesis loop of an ammonia plant while maintaining the nameplate capacity of 1,200 metric tons per day (m.t.\/d). The new cartridge will be based on the latest design principles, including a modular design with removable catalyst beds which enable better accessibility during catalyst filling, axial-radial flow beds, lower pressure drop, etc. The cartridge, which will be installed in the existing pressure shell, will bring further benefits in terms of safety as no major welding activities are required during installation. The currently installed cartridge, based on a design by thyssenkrupp Uhde, has reached an extraordinarily long lifetime of 36 years in operation. Usually, replacements are necessary after two catalyst exchange cycles, approximately after 20 years. However, thanks to the robust design and high quality requirements set by thyssenkrupp Uhde during equipment manufacturing and testing, life times of 30 years and more are feasible. Kutay Durna, factory manager at İGSAŞ: “With this upgrade of our plant, we are ready for the future. Key decision points for choosing thyssenkrupp Uhde were the proven reliability of their products combined with reducing the energy consumption in our Kocaeli plant.” Thore Lohmann, Executive Director Fertilizer and Methanol at thyssenkrupp Uhde: “This is further proof that our uhde ammonia technology can meet the diverse requirements of plant owners around the globe. Our proprietary design of ammonia converter cartridges meets the highest quality standards and, when retrofitted to ammonia converters, it hugely enhances plant performance.” The improved reliability of the plant and the energy savings will be achieved by combining the new uhde ammonia converter cartridge with Johnson Matthey’s high-performance catalyst KATALCOTM 74-1. This combination will open up the potential for a further increase in plant capacity in the future, for example for green ammonia production. The new equipment is under fabrication, and start-up is scheduled for mid-2024. thyssenkrupp Uhde will perform full supervision services during converter opening, catalyst unloading, cartridge disassembly, converter inspection, cartridge assembly, catalyst filling\/activation, startup and performance testing at this time. Besides supplying the new cartridge for İGSAŞ, thyssenkrupp Uhde currently has eight additional uhde ammonia converter cartridges underway for their current blue ammonia projects.","filter_flag":1}
{"title":"Golden Age confirms construction company for second Glen Waverley offering - Architecture and Design","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvbmV3cy9nb2xkZW4tYWdlLWNvbmZpcm1zLWNvbnN0cnVjdGlvbi1jb21wYW55LWZsb3JldNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvbmV3cy9nb2xkZW4tYWdlLWNvbmZpcm1zLWNvbnN0cnVjdGlvbi1jb21wYW55LWZsb3JldNIBAA?oc=5","id":"CBMiXWh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvbmV3cy9nb2xkZW4tYWdlLWNvbmZpcm1zLWNvbnN0cnVjdGlvbi1jb21wYW55LWZsb3JldNIBAA","guidislink":false,"published":"Fri, 30 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=30, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=181, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvbmV3cy9nb2xkZW4tYWdlLWNvbmZpcm1zLWNvbnN0cnVjdGlvbi1jb21wYW55LWZsb3JldNIBAA?oc=5\" target=\"_blank\">Golden Age confirms construction company for second Glen Waverley offering<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Architecture and Design<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Golden Age confirms construction company for second Glen Waverley offering - Architecture and Design","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvbmV3cy9nb2xkZW4tYWdlLWNvbmZpcm1zLWNvbnN0cnVjdGlvbi1jb21wYW55LWZsb3JldNIBAA?oc=5\" target=\"_blank\">Golden Age confirms construction company for second Glen Waverley offering<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Architecture and Design<\/font>","source.href":"https:\/\/www.architectureanddesign.com.au","source.title":"Architecture and Design","query":"https:\/\/news.google.com\/rss\/search?q=\"Robust design\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Golden Age Group has confirmed that construction has commenced on its second Glen Waverley offering, the Rothelowman-designed Floret. The developer released a media statement earlier this week announcing both the commencement of construction, as well as the appointment of Figurehead as preferred builder. The 77-townhouse project received approval nearly 12 months ago, and shapes up as a key development in the growth of the east Melbourne suburb. The townhomes have been built to meld into the streetscape, accounting for both architectural heritage and the demand for high-end design within the area. Rothelowman has worked with Golden Age in the past, delivering Sky Garden, a similarly community-centric project. “Their commitment to a conservative and robust design and delivery model aligns with our obligation to our key stakeholders, the end users of our product,” says Figurehead Managing Director Joe Grasso. “Figurehead Construction has specialised in the delivery of townhomes since its inception in 2007, and for us, it’s important in this challenging climate that we partner with a reputable team, and take on projects we have a track record of delivering to a high standard,” said Joe. Gardens designed by Aspect Studio aim to enhance the sense of community through lush landscapes made ideal for families. An array of amenities have been integrated within the development, while three-level townhouses separate ground floor offices and upper-level living spaces in the hybrid work era. Ensuite bedrooms are also located on the ground floor which feature direct courtyard access, while the kitchen and living areas serve as connection points. Golden Age Founder and Managing Director Jeff Xu says he is delighted to have announced the appointment of Figurehead, given the company’s reputation for producing high-end design outcomes within the construction phase. “Figurehead has an extensive and diverse portfolio of more than 100 completed projects, all with unwavering quality,” he says. Collectively, we are eager to deliver a thorough and proactive approach to this project as it is one that will lift the standard within the area.” Over 80 percent of Floret’s first stage has been sold, with new park front lots brought forward to cater to demand. Nearly half of the new releases flew off the plan within 24 hours, outlining the demand for buyers looking to create a life in Glen Waverley. Construction is scheduled for completion in 2025. For more information, visit florethomes.com.au.","filter_flag":1}
