{"title":"How we’re helping - ExxonMobil","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vY29ycG9yYXRlLmV4eG9ubW9iaWwuY29tL25ld3Mvdmlld3BvaW50cy9oZWxwaW5nLW1lZXQtdGhlLXBsYXN0aWMtd2FzdGUtY2hhbGxlbmdl0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vY29ycG9yYXRlLmV4eG9ubW9iaWwuY29tL25ld3Mvdmlld3BvaW50cy9oZWxwaW5nLW1lZXQtdGhlLXBsYXN0aWMtd2FzdGUtY2hhbGxlbmdl0gEA?oc=5","id":"CBMiWWh0dHBzOi8vY29ycG9yYXRlLmV4eG9ubW9iaWwuY29tL25ld3Mvdmlld3BvaW50cy9oZWxwaW5nLW1lZXQtdGhlLXBsYXN0aWMtd2FzdGUtY2hhbGxlbmdl0gEA","guidislink":false,"published":"Tue, 30 May 2023 15:29:15 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=30, tm_hour=15, tm_min=29, tm_sec=15, tm_wday=1, tm_yday=150, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vY29ycG9yYXRlLmV4eG9ubW9iaWwuY29tL25ld3Mvdmlld3BvaW50cy9oZWxwaW5nLW1lZXQtdGhlLXBsYXN0aWMtd2FzdGUtY2hhbGxlbmdl0gEA?oc=5\" target=\"_blank\">How we’re helping<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ExxonMobil<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How we’re helping - ExxonMobil","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vY29ycG9yYXRlLmV4eG9ubW9iaWwuY29tL25ld3Mvdmlld3BvaW50cy9oZWxwaW5nLW1lZXQtdGhlLXBsYXN0aWMtd2FzdGUtY2hhbGxlbmdl0gEA?oc=5\" target=\"_blank\">How we’re helping<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ExxonMobil<\/font>","source.href":"https:\/\/corporate.exxonmobil.com","source.title":"ExxonMobil","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Product Solutions President Karen McKee discussed the need for policymakers, industry, communities and consumers to work together for a lower-waste, lower-carbon future at a roundtable hosted by the World Plastics Council on May 27 in Paris. In her role as president of the International Council of Chemical Associations, she emphasized how people rely on plastics throughout the world and made the case for improving the circular economy for plastics. Her talk preceded a United Nations conference on plastic pollution that began May 29 in Paris. ExxonMobil is strengthening the circularity of plastics through our Exxtend™ technology for advanced recycling. Our new advanced recycling facility in Baytown is one of North America’s largest, with capacity of 40,000 metric tons per year, and we have begun building a market for the certified circular polymers that Baytown makes from waste. We have plans underway for up to 500,000 metric tons per year of advanced recycling capacity by year-end 2026 around the world. Here’s what Karen had to say: This week, the nations of the world convene in Paris to continue their work on a global agreement that will shape how the world deals with plastic waste. With that in mind, it’s important for policymakers to listen closely to everyone who plays a role in the life cycle of plastics: designers, producers, consumers, transporters, recyclers. Plastics enrich lives around the globe. We use them to grow and preserve food, to deliver clean water to billions of people, to treat people in our hospitals, and to make transportation and communication more efficient. They are a material of choice because their combination of strength, flexibility and light weight saves time, money and effort. Vehicles, airplanes, mobile phones, greenhouses, solar panels -- all of them rely on plastics. And as society moves to reduce emissions, plastics will play a vital role. In many cases, they are the lowest-emission alternative, with a smaller carbon footprint than alternative materials such as paper, aluminum and glass. Plastics are critical to achieving the U.N.’s Sustainable Development Goals and building a lower-carbon future. At the same time, far too much plastic ends up as waste in the developing world, discarded onto land and into rivers and oceans. Unmanaged waste can have significant environmental and economic impacts. Plastic waste is a significant global challenge. We envision a world without plastic pollution. We support governments’ ambition to eliminate additional plastic pollution by 2040. We champion a global agreement to ensure access to proper waste management, eliminate leakage of plastic into the ocean, and promote circularity. The question is: How do we get there? We believe any global plastics agreement should include well-designed incentives to accelerate the collection of waste plastic and support the sustainable reuse and recycling of plastic products and packaging. Plastics are much too valuable to throw away, and the world’s economy should reflect that. Plastics should be designed with reuse or recycling in mind, used appropriately, collected in efficient waste management systems, and finally transported to facilities that can turn them back into useful goods. We in the industry are doing our part to make that happen. We’re investing substantially around the world to broaden the range of plastic that can be recycled. We’re also creating new technologies, business approaches and partnerships to enable that circularity. All so that we can continue to enjoy the emissions reductions and other critical benefits that plastics provide, while enabling a world without plastic pollution. Plastics have improved and are improving the lives of billions. Ending plastic waste will require a sustained effort from all of us – industry, governments, financial institutions, producers and consumers, waste management operations. We look forward to meeting the challenge.","filter_flag":1}
{"title":"It's time for The Big Food Redesign Challenge! - ellenmacarthurfoundation.org","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmVsbGVubWFjYXJ0aHVyZm91bmRhdGlvbi5vcmcvbmV3cy9pdHMtdGltZS1mb3ItdGhlLWJpZy1mb29kLXJlZGVzaWduLWNoYWxsZW5nZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmVsbGVubWFjYXJ0aHVyZm91bmRhdGlvbi5vcmcvbmV3cy9pdHMtdGltZS1mb3ItdGhlLWJpZy1mb29kLXJlZGVzaWduLWNoYWxsZW5nZdIBAA?oc=5","id":"CBMiWmh0dHBzOi8vd3d3LmVsbGVubWFjYXJ0aHVyZm91bmRhdGlvbi5vcmcvbmV3cy9pdHMtdGltZS1mb3ItdGhlLWJpZy1mb29kLXJlZGVzaWduLWNoYWxsZW5nZdIBAA","guidislink":false,"published":"Tue, 23 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=143, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmVsbGVubWFjYXJ0aHVyZm91bmRhdGlvbi5vcmcvbmV3cy9pdHMtdGltZS1mb3ItdGhlLWJpZy1mb29kLXJlZGVzaWduLWNoYWxsZW5nZdIBAA?oc=5\" target=\"_blank\">It's time for The Big Food Redesign Challenge!<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ellenmacarthurfoundation.org<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"It's time for The Big Food Redesign Challenge! - ellenmacarthurfoundation.org","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmVsbGVubWFjYXJ0aHVyZm91bmRhdGlvbi5vcmcvbmV3cy9pdHMtdGltZS1mb3ItdGhlLWJpZy1mb29kLXJlZGVzaWduLWNoYWxsZW5nZdIBAA?oc=5\" target=\"_blank\">It's time for The Big Food Redesign Challenge!<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ellenmacarthurfoundation.org<\/font>","source.href":"https:\/\/www.ellenmacarthurfoundation.org","source.title":"ellenmacarthurfoundation.org","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"In 2021, we launched our report, The Big Food Redesign, and two years later, we are excited to share The Big Food Redesign Challenge, which will accelerate the transformation of our food system. Designed in partnership with the Sustainable Food Trust, the Challenge is for ambitious producers, brands, retailers, and suppliers of all sizes to apply Circular Design for Food to their products. As part of the Big Food Redesign Challenge, participants will be tasked with designing new food products – or redesigning existing ones – using circular design principles, meaning they are produced in a way that regenerates nature. Participants will be supported throughout the Challenge, with the first designs expected towards the end of this year. Products will be assessed against a range of criteria and a lite version of the Global Farm Metric. Participants will also have free access to the HowGood Latis Platform — a leading data platform for sustainably-sourced consumer product ingredients. Successful food product ideas will then be invited to go into production and made available in 2024. We are pleased to announce that Waitrose will be supporting the final products with dedicated shelf space. Their parent company, John Lewis and Partners, has also joined the network as a partner. “ “We’re delighted to be involved with the global Big Food Redesign Challenge and look forward to stocking our shelves with some of the innovative products that are being created with nature in mind. Our customers are thoughtful shoppers who trust us to offer responsibly sourced produce, and we can't wait to hear their thoughts on the new products developed for the Challenge.” – Ben Thomas, Senior Environment Manager, John Lewis Partnership “ “We know the problems. The current food system is a key driver of biodiversity loss and accounts for a third of global greenhouse gases. By applying the principles of circular design to our food system, we can create food that regenerates nature and tackles some of our most pressing global issues.” – Dame Ellen MacArthur, Founder and Chair of Trustees, Ellen MacArthur Foundation By applying circular economy principles to the way that food is designed — from the concept to ingredients and packaging — we can significantly reduce the negative impact of our food and could even create a system that is nature-positive. The Big Food Redesign Challenge is generously supported with funds raised by players of People’s Postcode Lottery and awarded through the Dream Fund, with additional support provided by the Schmidt Family Foundation.","filter_flag":1}
{"title":"UN offers 'roadmap' to reducing plastic pollution by 80% by 2040 - Fox Weather","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmZveHdlYXRoZXIuY29tL2VhcnRoLXNwYWNlL3VuLXJlcG9ydC1wbGFzdGljLXBvbGx1dGlvbi1ieS0yMDQw0gFOaHR0cHM6Ly93d3cuZm94d2VhdGhlci5jb20vZWFydGgtc3BhY2UvdW4tcmVwb3J0LXBsYXN0aWMtcG9sbHV0aW9uLWJ5LTIwNDAuYW1w?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmZveHdlYXRoZXIuY29tL2VhcnRoLXNwYWNlL3VuLXJlcG9ydC1wbGFzdGljLXBvbGx1dGlvbi1ieS0yMDQw0gFOaHR0cHM6Ly93d3cuZm94d2VhdGhlci5jb20vZWFydGgtc3BhY2UvdW4tcmVwb3J0LXBsYXN0aWMtcG9sbHV0aW9uLWJ5LTIwNDAuYW1w?oc=5","id":"CBMiSmh0dHBzOi8vd3d3LmZveHdlYXRoZXIuY29tL2VhcnRoLXNwYWNlL3VuLXJlcG9ydC1wbGFzdGljLXBvbGx1dGlvbi1ieS0yMDQw0gFOaHR0cHM6Ly93d3cuZm94d2VhdGhlci5jb20vZWFydGgtc3BhY2UvdW4tcmVwb3J0LXBsYXN0aWMtcG9sbHV0aW9uLWJ5LTIwNDAuYW1w","guidislink":false,"published":"Tue, 16 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=136, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmZveHdlYXRoZXIuY29tL2VhcnRoLXNwYWNlL3VuLXJlcG9ydC1wbGFzdGljLXBvbGx1dGlvbi1ieS0yMDQw0gFOaHR0cHM6Ly93d3cuZm94d2VhdGhlci5jb20vZWFydGgtc3BhY2UvdW4tcmVwb3J0LXBsYXN0aWMtcG9sbHV0aW9uLWJ5LTIwNDAuYW1w?oc=5\" target=\"_blank\">UN offers 'roadmap' to reducing plastic pollution by 80% by 2040<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fox Weather <\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"UN offers 'roadmap' to reducing plastic pollution by 80% by 2040 - Fox Weather","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmZveHdlYXRoZXIuY29tL2VhcnRoLXNwYWNlL3VuLXJlcG9ydC1wbGFzdGljLXBvbGx1dGlvbi1ieS0yMDQw0gFOaHR0cHM6Ly93d3cuZm94d2VhdGhlci5jb20vZWFydGgtc3BhY2UvdW4tcmVwb3J0LXBsYXN0aWMtcG9sbHV0aW9uLWJ5LTIwNDAuYW1w?oc=5\" target=\"_blank\">UN offers 'roadmap' to reducing plastic pollution by 80% by 2040<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fox Weather <\/font>","source.href":"https:\/\/www.foxweather.com","source.title":"Fox Weather","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"NEW YORK – The UN Environment Programme released a report on Tuesday that examines the economic and business models needed to reduce plastic pollution by 80 percent by 2040. The report outlines a roadmap for governments and companies to use existing technologies to shift the market to a more sustainable circular economy. A circular economy is a market in which products are reused or repurposed, rather than thrown away to then extract new resources to make new products. The UNEP noted that shifting markets to a circular economy model can help reduce the number of plastics produced and slash plastic pollution that enters the environment by 80 percent by 2040. To achieve this, the UNEP called for three market shifts: Reuse - Promoting reusable options, such as refillable bottles and bulk dispensers. - Promoting reusable options, such as refillable bottles and bulk dispensers. Recycle - Making recycling a more stable and profitable venture and taking measures to increase the share of economically recyclable plastics. - Making recycling a more stable and profitable venture and taking measures to increase the share of economically recyclable plastics. Reorient and diversify - Replacing products, such as plastic wrappers, with products made from alternative materials, such as paper or compostable materials. MOST PLASTIC RECYLING ENDS UP IN THE TRASH, GREENPEACE REPORT FINDS By shifting toward a circular economy, the UNEP said the changes result in $1.27 trillion in savings, considering costs and recycling revenues. They also mentioned an additional $3.25 trillion in savings, which would come from avoiding health, climate, air pollution, marine ecosystem degradation and litigation-related costs. The shift will also benefit the workforce. According to the UNEP, these changes would result in an estimated net increase of 700,000 jobs by 2040. Most of the new jobs would be in low-income countries, which would significantly improve the livelihoods of millions of workers, the UNEP said. HOW TO WATCH FOX WEATHER \"If we follow this roadmap, including in negotiations on the plastic pollution deal, we can deliver major economic, social, and environmental wins,\" said Inger Andersen, executive director of UNEP. The report noted a sense of urgency for taking action. According to the UNEP, a five-year delay may lead to an increase of 80 million metric tons of plastic pollution by 2040.","filter_flag":1}
{"title":"End-of-life Recycling in the Fashion Industry | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvZW5kLW9mLWxpZmUtcmVjeWNsaW5nLWluLXRoZS1mYXNoaW9uLWluZHVzdHJ50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvZW5kLW9mLWxpZmUtcmVjeWNsaW5nLWluLXRoZS1mYXNoaW9uLWluZHVzdHJ50gEA?oc=5","id":"CBMiU2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvZW5kLW9mLWxpZmUtcmVjeWNsaW5nLWluLXRoZS1mYXNoaW9uLWluZHVzdHJ50gEA","guidislink":false,"published":"Wed, 31 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=151, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvZW5kLW9mLWxpZmUtcmVjeWNsaW5nLWluLXRoZS1mYXNoaW9uLWluZHVzdHJ50gEA?oc=5\" target=\"_blank\">End-of-life Recycling in the Fashion Industry | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"End-of-life Recycling in the Fashion Industry | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvZW5kLW9mLWxpZmUtcmVjeWNsaW5nLWluLXRoZS1mYXNoaW9uLWluZHVzdHJ50gEA?oc=5\" target=\"_blank\">End-of-life Recycling in the Fashion Industry | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"The process is far from being perfectly linear and straightforward. Instead, it is a complex and intricate web of diverse connections and actors characterized by several complications. Recognizing these complications is the first step toward designing appropriate interventions. Multiple Concurrent Processes. Garments rarely make it through the end-of-life value chain in a streamlined, linear manner. Instead, a garment may go through multiple permutations of collection, sorting, and reuse before reaching the recycling stage. For example, a garment collected, sorted, and designated for resale may go unsold, be exported, and go through another round of sorting to determine its next destination (resale, recycling, or landfill). Garments rarely make it through the end-of-life value chain in a streamlined, linear manner. Instead, a garment may go through multiple permutations of collection, sorting, and reuse before reaching the recycling stage. For example, a garment collected, sorted, and designated for resale may go unsold, be exported, and go through another round of sorting to determine its next destination (resale, recycling, or landfill). Interdependencies Between Actors. No single player in the value chain has in-house capabilities to execute all the necessary steps in the process. Actors specialize in different parts of the value chain and work together to facilitate execution. For example, recyclers rely on sorters to receive presorted feedstock, and brands rely on resale-as-a-service (RaaS) partners to provide the backend infrastructure for their take-back programs. This system generates efficiencies but comes with logistical and operational complexities. No single player in the value chain has in-house capabilities to execute all the necessary steps in the process. Actors specialize in different parts of the value chain and work together to facilitate execution. For example, recyclers rely on sorters to receive presorted feedstock, and brands rely on resale-as-a-service (RaaS) partners to provide the backend infrastructure for their take-back programs. This system generates efficiencies but comes with logistical and operational complexities. Limited Connectivity Between Players. Certain steps in the value chain have geographical hubs that exacerbate the logistical inefficiencies in the process. For instance, the supply of feedstock comes primarily from Western countries, while many of the advanced chemical recycling plants are in Europe, and the production of new garments that require recycled materials occurs in Asia. This geographic fragmentation, combined with the high cost of transportation, hinders the optimal matching of demand and supply. Certain steps in the value chain have geographical hubs that exacerbate the logistical inefficiencies in the process. For instance, the supply of feedstock comes primarily from Western countries, while many of the advanced chemical recycling plants are in Europe, and the production of new garments that require recycled materials occurs in Asia. This geographic fragmentation, combined with the high cost of transportation, hinders the optimal matching of demand and supply. Evolving Business Models. Growth in resale and recycling programs has led to the emergence of new players, technologies, and ways of working. Actors are experimenting with different circularity initiatives to identify their optimal model. For example, hundreds of brands have ventured into resale, some doing it in-house and others in partnership with RaaS companies or third-party consignment marketplaces. The frequent introduction of new business models, while representing growth, adds further complexity to a crowded and disparate landscape. Gaps in the End-of-Life Value Chain In addition to the complexities that drive inefficiencies in the end-of-life process, there are several gaps where circularity efforts fail and merely postpone landfilling of textile waste. These gaps, discussed below, must be bridged to promote a perpetual cycle of true circularity. Collection. Significant volumes of reusable and recyclable garments are either not being collected or are being discarded due to barriers that limit consumer engagement and brand adoption of reuse and recycling. Collection efforts are fragmented. Consumers find the disparity in collection efforts across brands, municipalities, and other players confusing and inconvenient. The sheer number and variety of collection options can be overwhelming, and many require making trips to stores to physically deposit clothing. As a result, many consumers simply dispose of unwanted clothing. Mail-backs or pickups, while easier for consumers, are more expensive and logistically complex for brands. Collecting low-value items in smaller quantities from a large pool of consumers on a recurring basis can make it challenging for collection businesses to achieve economies of scale. Consumers find the disparity in collection efforts across brands, municipalities, and other players confusing and inconvenient. The sheer number and variety of collection options can be overwhelming, and many require making trips to stores to physically deposit clothing. As a result, many consumers simply dispose of unwanted clothing. Mail-backs or pickups, while easier for consumers, are more expensive and logistically complex for brands. Collecting low-value items in smaller quantities from a large pool of consumers on a recurring basis can make it challenging for collection businesses to achieve economies of scale. Incentivization for take-back schemes is incomprehensive and insufficient. Many consumers are not sufficiently motivated by monetary incentives to return used clothing. For example, online consignment marketplaces offer commissions but have long processing times and low payouts. A lack of comprehensive incentive mechanisms leads to unfavorable consumer tradeoffs between the value (financial or non-financial) and effort of take-back programs. Sorting. Inefficiencies in the sorting market, driven by nascent technologies and inadequate connectivity, inhibit the optimal processing of garments. Sorting processes are largely manual and labor intensive. While there has been notable progress in optical-fiber-sorting innovations. such as infrared and visual spectrometry, widespread adoption of these technologies in textiles will require them to become economically viable. Missing or inadequate labeling of garments further compounds the challenge for sorters to accurately identify a garment’s material composition. While there has been notable progress in optical-fiber-sorting innovations. such as infrared and visual spectrometry, widespread adoption of these technologies in textiles will require them to become economically viable. Missing or inadequate labeling of garments further compounds the challenge for sorters to accurately identify a garment’s material composition. Geographical barriers are driving logistical inefficiencies. In the sorting market, the distance between players is a primary factor, and logistical barriers often prevent optimal recycling practices. Typically, sorters source from regional collectors within their geographical network to optimize for the lowest cost of freight and sell to the highest-bidding recyclers. However, recyclers may lack the capacity or capability to recycle a sorter’s garments. Alternatively, because of the economics of sourcing, that feedstock may not be viable for recyclers. The inventory that can’t be sold to recyclers often ends up in landfills. Growing adequate regional sorting and recycling hubs, particularly for chemical recycling, will be critical to overcome these geographical and logistical barriers. Reuse. Reuse models (resale, repair, or rental) without accompanying measures for products whose lifecycle cannot be further extended are incomplete solutions for achieving circularity. Garments collected for resale may still end up in landfills. Only a small percentage of clothing collected for resale is ultimately sold. Resale take-back programs by brands, donation houses, and third-party players often lack supporting strategies to manage unsold clothing. Limited storage capacity and holding costs exert additional pressure to offload garments quickly. As a result, rather than spending resources to repurpose or recycle unsold inventory, players find it more economical to destroy those garments. Only a small percentage of clothing collected for resale is ultimately sold. Resale take-back programs by brands, donation houses, and third-party players often lack supporting strategies to manage unsold clothing. Limited storage capacity and holding costs exert additional pressure to offload garments quickly. As a result, rather than spending resources to repurpose or recycle unsold inventory, players find it more economical to destroy those garments. Exporting clothing does not ensure reuse. A considerable amount of post-consumer clothing is either immediately exported upon collection or exported if it does not sell through resale channels. However, the supply of secondhand clothing is substantially higher than the demand in importing countries, resulting in a significant amount of clothing being landfilled abroad without ever being reused. Recycling. Open-loop and closed-loop recycling have significant limitations: Open-loop recycling does not enable full circularity. Open-loop recycling downcycles textiles into lower-value use items (such as rags and upholstery stuffing) that are usually landfilled at the end of their usable life. While preferable to a purely linear “take-make-waste” model, open-loop recycling is not a truly circular solution. Open-loop recycling downcycles textiles into lower-value use items (such as rags and upholstery stuffing) that are usually landfilled at the end of their usable life. While preferable to a purely linear “take-make-waste” model, open-loop recycling is not a truly circular solution. Closed-loop recycling technologies have not achieved scale. Closed-loop recycling, which converts textile waste into fiber that can be used in new material production, has yet to achieve the scale required to process the full spectrum of materials produced and volumes of waste generated. There are two main methods of closed-loop recycling: Mechanical closed-loop recycling involves strict material processing requirements (for example, mono-materials, undyed), which can make it difficult and expensive for recyclers to source feedstock. The process also shortens and weakens material fibers, requiring them to be blended with virgin fibers to yield quality yarns. Chemical closed-loop recycling tackles the limitations of mechanical closed-loop recycling by targeting materials that are tough to recycle (such as polyester and polyblends) and producing virgin-equivalent output. However, these solutions are nascent, have limited processing capacities, and are not yet economically viable. The economics of recycling are unfavorable for brands. Many brands destroy unsold inventory (for example, damaged goods, returns, excess) at the end of a season instead of reselling or donating it. While recycling that inventory would be a preferable alternative to destruction, it is often cheaper for brands to dispose of excess product than to repurpose or recycle it. Some countries, such as France and Germany, have passed legislation banning companies from destroying unsold or returned garments. We believe that introducing regulations that would make recycling financially favorable for brands—for example, by offering tax benefits—would reduce resistance to similar legislation worldwide. Toward a Circular Future While several solutions to advance circularity from an end-of-life perspective exist, their adoption by the fashion industry remains limited. Rather than waiting for the next breakthrough technology or becoming paralyzed in the pursuit of perfection, the industry must seize opportunities to take meaningful action now. To accelerate progress toward a circular future with positive financial returns, the fashion industry must pursue the strategies discussed below. Mobilize Demand for Recycled Output The limited inclusion of recycled textiles in clothing lines today is driven by the low availability and high price of recycled fibers compared with alternatives. Brands rely on recycled plastic waste for their sustainable collections while waiting for recycled textiles to become economically viable. This is particularly true for recycled polyester, as most brands use recycled plastics (for example, plastic bottles and packaging) from other industries instead of using regenerated polyester from the garments they produce. This has resulted in a recycling paradox, where textile-recycling technologies are unable to scale without sufficient demand for their output from brands, and brands are hesitant to increase their use of recycled textiles until these technologies become more cost-effective. To break this cycle, brands must increase their use of recycled textiles available today while also investing in the growth of closed-loop textile-recycling technologies to drive demand and achieve economies of scale. Adopt Investment Models That Accelerate Expansion While investment is needed to support early-stage innovations and to scale promising technologies, the latter is harder to achieve given high-risk, capital-intense requirements to scale. There are many promising technologies, particularly in closed-loop recycling, that are ready to be scaled today. However, most players find it challenging to scale their operations beyond a single commercial-scale plant. Alternative investment models, such as licensing and joint ventures, can reduce upfront capital needs and allow innovators to overcome current funding constraints to scale. Although the tradeoffs between pursuing these alternative investment models and establishing owned-and-operated factories are not unique to textile recycling, prioritizing the former can deliver speed to scale with favorable economic returns. Underpin Recycling with Sorting Infrastructure and Technology Scaling recycling without developing the supporting infrastructure and technology for collection and sorting will create a feedstock gap. Closed-loop recyclers have high purity standards and can primarily process mono-materials (for example, pure cotton). Purity constraints, combined with the difficulty in accurately identifying the composition of post-consumer waste, make it a less desirable source of feedstock despite being considerably larger than industrial waste. As demand for recycled output increases, competition for pure feedstock will also increase, impacting its supply. To address this issue, it is essential to scale closed-loop recycling technologies that can process a wider variety of blended materials and sorting technologies that can accurately identify material composition, making post-consumer waste a more viable source of feedstock. Maximize Impact Through Concerted Efforts Individual, small-scale efforts will not achieve the impact required to tackle fashion’s decentralized waste problem. Industry actors have launched initiatives and joined coalitions and alliances to create collective action. Despite the commitment, many players chase communal goals individually, resulting in a sustainability landscape saturated with well-intentioned but fragmented and overlapping initiatives. Actors must give a higher priority to consolidating efforts at scale than to pursuing individual competitive advantages. For instance, brands can consolidate take-back programs, pool investment in technologies, and share best practices to amplify and accelerate impact. Chemical closed-loop recyclers can also work together to ensure that impurities extracted during processing (that is, materials a particular technology cannot recycle) are passed on to recyclers with suitable technology. For example, a polyester closed-loop recycler can pass on the cotton extracted during processing to a cotton closed-loop recycler. Build Momentum by Starting Today In searching for opportunities with the highest potential for impact and visibility, brands often overlook short-term prospects that can move the needle. But brands can gradually build end-of-life business models by starting with initiatives that fit into their current ecosystem. One such opportunity could be forging partnerships that unify incentives, remove friction, and create revenue streams. For example, brands can sell their excess inventory directly to closed-loop recyclers, thereby making it easier for recyclers to source feedstock with known material composition. Brands can further integrate circularity into their core business operations through versatile tools that drive business and social value. For instance, digital IDs enable brands to remain connected to their consumers beyond the point of sale and generate future revenue streams by offering authentication and traceability. Additionally, digital IDs can be used to engage consumers via marketing and storytelling; educate them about the product’s origin, materials, and care; and enable them to eventually resell, repair, or recycle the product. Defining Your Circularity Agenda In addition to reducing waste and emissions, pursuing circularity can yield significant economic value. Circular business models are expected to grow to approximately 23% of the fashion market by 2030, representing an estimated $700 billion opportunity.2 2 Ellen MacArthur Foundation and BCG, Circular Business Models: Redefining Growth for a Thriving Fashion Industry (2021) Notes: 2 Ellen MacArthur Foundation and BCG, Circular Business Models: Redefining Growth for a Thriving Fashion Industry (2021) Companies with a clearly defined and well-executed circularity and sustainability agenda stand to win through incremental revenues (via circular business models and recycling), decreased costs, reduced reliance on virgin materials, improved supply-chain control, greater risk resilience, enhanced strategic positioning, and a more favorable brand perception. Early movers in fashion circularity recognize that implementing circularity at scale requires an industry-wide transformation. From setting ambitious goals to launching diverse initiatives across the circular value chain, chief executives have demonstrated their commitment to advancing circularity in the fashion industry. Nevertheless, despite the urgency surrounding circularity, many companies struggle to identify where to begin their journey. Pressure from stakeholders for immediate action often leads organizations to replicate frameworks applied by other brands and implement circularity initiatives in an ad hoc, piecemeal manner. However, when it comes to circularity strategies and models, no single approach fits all. BCG has supported many fashion brands with their circularity agenda, and in our experience, a successful circularity strategy is comprehensive and tailored to the overall business. For example, we applied our integrated circularity framework, called Circelligence, to build and execute a circularity strategy for an athletic- apparel and footwear brand in three phases: Set a vision. Establishing a credible baseline is a crucial first step for any brand looking to embark on a circularity journey or build on existing initiatives. Using our proprietary tools, we baselined and benchmarked the brand's circular performance relative to its peers. This initial assessment allowed us to define the brand's ambition level and establish a clear circularity definition and vision for the organization. Establishing a credible baseline is a crucial first step for any brand looking to embark on a circularity journey or build on existing initiatives. Using our proprietary tools, we baselined and benchmarked the brand's circular performance relative to its peers. This initial assessment allowed us to define the brand's ambition level and establish a clear circularity definition and vision for the organization. Build plans. We identified circularity opportunities across the brand’s value chain and prioritized initiatives based on impact and feasibility. Circularity intersects with many areas of a business; however, it is often treated as an isolated function, with teams working in silos. BCG’s deep experience across the end-to-end value chain allowed us to recognize cross-functional synergies and develop an integrated circularity plan. We identified circularity opportunities across the brand’s value chain and prioritized initiatives based on impact and feasibility. Circularity intersects with many areas of a business; however, it is often treated as an isolated function, with teams working in silos. BCG’s deep experience across the end-to-end value chain allowed us to recognize cross-functional synergies and develop an integrated circularity plan. Drive to action. We developed detailed implementation roadmaps for prioritized initiatives and launched pilots to test and refine them. We also crafted authentic and compelling circularity communication materials, including narratives and reports, recognizing that in today's context of increased scrutiny of sustainability claims, transparency is more crucial than ever. By partnering with the brand from conceptualization to implementation, we accelerated its circularity journey and set it up for success in the long term. The brand embraced circular design principles and scaled up the use of circular inputs in its new products, among other initiatives. As long as revenues remain inextricably linked to linear production models, mobilizing for change will be difficult. Ultimately, though, if industry interest in circularity fails to translate into impact, the status quo will be disrupted through policy and regulation. Widespread regulation curbing the destruction of textile waste is on the horizon, and those who fail to respond proactively will struggle to survive. It’s time to pivot away from experimenting in circularity to fundamentally rethinking end-of-life strategies.","filter_flag":1}
{"title":"Building a circular economy - CSIRO","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmNzaXJvLmF1L2VuL2Fib3V0L2NoYWxsZW5nZXMtbWlzc2lvbnMvQ2lyY3VsYXItRWNvbm9tedIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmNzaXJvLmF1L2VuL2Fib3V0L2NoYWxsZW5nZXMtbWlzc2lvbnMvQ2lyY3VsYXItRWNvbm9tedIBAA?oc=5","id":"CBMiQmh0dHBzOi8vd3d3LmNzaXJvLmF1L2VuL2Fib3V0L2NoYWxsZW5nZXMtbWlzc2lvbnMvQ2lyY3VsYXItRWNvbm9tedIBAA","guidislink":false,"published":"Tue, 16 May 2023 06:22:22 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=16, tm_hour=6, tm_min=22, tm_sec=22, tm_wday=1, tm_yday=136, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmNzaXJvLmF1L2VuL2Fib3V0L2NoYWxsZW5nZXMtbWlzc2lvbnMvQ2lyY3VsYXItRWNvbm9tedIBAA?oc=5\" target=\"_blank\">Building a circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CSIRO<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Building a circular economy - CSIRO","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmNzaXJvLmF1L2VuL2Fib3V0L2NoYWxsZW5nZXMtbWlzc2lvbnMvQ2lyY3VsYXItRWNvbm9tedIBAA?oc=5\" target=\"_blank\">Building a circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CSIRO<\/font>","source.href":"https:\/\/www.csiro.au","source.title":"CSIRO","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Potential impact Adopting circular economy principles will support industry and government to catalyse new markets, develop new products, and metrics for success. Globally, we need to rethink design to avoid waste products, including reusing materials many times over, and adding value at each step of the supply chain. This will conserve valuable and limited natural resources. We can achieve these shared goals through a circular economy. Our research and innovation will help inform Australia’s modern manufacturing initiative to support the target of tripling Australia’s circularity to contribute $30b by 2030. This aligns with Australia’s resource recovery targets outlined in Australia’s National Waste Plan . Our scope of work will provide researchers, government, industry and communities with innovative science to accelerate a circular economy. This includes developing products, processes and technologies to avoid waste, recover materials, and capture value through reuse, repurposing, recycling and remanufacturing. This will decrease demand on resources and reduce impact to the environment. New circular products from waste resources could provide export opportunities with the potential of a $210 billion economic boost for Australia to 2050. Circular economy principles could support a range of sectors including agriculture, renewable energy, fisheries, forestry, and mining resources to build circularity and turn waste into useful products.","filter_flag":1}
{"title":"Uzbekistan is stepping up efforts to use innovation as a driver for the circular economy transition - UNECE","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vdW5lY2Uub3JnL2NpcmN1bGFyLWVjb25vbXkvbmV3cy91emJla2lzdGFuLXN0ZXBwaW5nLWVmZm9ydHMtdXNlLWlubm92YXRpb24tZHJpdmVyLWNpcmN1bGFyLWVjb25vbXktdHJhbnNpdGlvbtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vdW5lY2Uub3JnL2NpcmN1bGFyLWVjb25vbXkvbmV3cy91emJla2lzdGFuLXN0ZXBwaW5nLWVmZm9ydHMtdXNlLWlubm92YXRpb24tZHJpdmVyLWNpcmN1bGFyLWVjb25vbXktdHJhbnNpdGlvbtIBAA?oc=5","id":"CBMidWh0dHBzOi8vdW5lY2Uub3JnL2NpcmN1bGFyLWVjb25vbXkvbmV3cy91emJla2lzdGFuLXN0ZXBwaW5nLWVmZm9ydHMtdXNlLWlubm92YXRpb24tZHJpdmVyLWNpcmN1bGFyLWVjb25vbXktdHJhbnNpdGlvbtIBAA","guidislink":false,"published":"Tue, 23 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=143, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vdW5lY2Uub3JnL2NpcmN1bGFyLWVjb25vbXkvbmV3cy91emJla2lzdGFuLXN0ZXBwaW5nLWVmZm9ydHMtdXNlLWlubm92YXRpb24tZHJpdmVyLWNpcmN1bGFyLWVjb25vbXktdHJhbnNpdGlvbtIBAA?oc=5\" target=\"_blank\">Uzbekistan is stepping up efforts to use innovation as a driver for the circular economy transition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">UNECE<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Uzbekistan is stepping up efforts to use innovation as a driver for the circular economy transition - UNECE","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vdW5lY2Uub3JnL2NpcmN1bGFyLWVjb25vbXkvbmV3cy91emJla2lzdGFuLXN0ZXBwaW5nLWVmZm9ydHMtdXNlLWlubm92YXRpb24tZHJpdmVyLWNpcmN1bGFyLWVjb25vbXktdHJhbnNpdGlvbtIBAA?oc=5\" target=\"_blank\">Uzbekistan is stepping up efforts to use innovation as a driver for the circular economy transition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">UNECE<\/font>","source.href":"https:\/\/unece.org","source.title":"UNECE","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"The transition towards a circular economy could create an estimated 4.5 trillion USD of global economic growth by 2030, while helping to restore natural systems. Within the landlocked countries of Central Asia, this transition can help economies diversify away from a dependence on exports of finite resources, reduce negative environmental impacts, and create new business opportunities and jobs. As highlighted in the Innovation for Sustainable Development Review (I4SDR) of Uzbekistan published by UNECE in 2022, innovation is a main facilitator of the transition to a circular economy. Innovation in this context is understood to reach beyond the narrow definition of high technology and start-ups: it involves introducing new products, services, and production, business and marketing processes that can foster sustainable growth and solve the challenges posed by the circular transition. Recent policy frameworks in Uzbekistan recognize this important link ; for example, circular economy indicators play a crucial role in the Strategy for the Transition of the Republic of Uzbekistan to a Green Economy (2019-2030). Meanwhile, the Strategy for Innovative Development of Uzbekistan (2022-2026) aims to create an innovation ecosystem that will connect industry, regions, and scientific\/higher educational organizations for sustainable growth. Since the publication of the I4SDR, Uzbekistan has taken several steps to implement the recommendations contained in the Review and recorded strong progress, becoming one of the top three innovation economies in Central and Southern Asia according to the 2022 WIPO Global Innovation Index. In 2023, the Government requested follow-up capacity building to spur further implementation. Innovation for the green and circular transition was highlighted as a topic of particular interest. In response to this request, UNECE staff and experts travelled to Tashkent on 1-3 May 2023 to launch a dedicated programme of activities. UNECE and the National Office for Innovation Implementation and Technology Transfer organized a workshop for Chief Innovation Officers from over 100 state-owned enterprises (SOEs). The workshop introduced participants to circular economy concepts, highlighted the link between circular economy and innovation, and provided case studies and business models. Discussions also addressed green finance and green certification programmes. Given the prevalence of SOEs in the Uzbek private sector, the position of Chief Innovation Officer has been established in each SOE by Presidential decree. The workshop therefore served to enhance the efforts of the Government to foster a culture of innovation in these companies. UNECE and the National Office also organized a roundtable with start-ups, which provided an opportunity to showcase the many promising green and circular products being developed in Uzbekistan, and exchange views on the challenges faced by Uzbek start-ups in scaling up their businesses. UNECE support to Uzbekistan will attempt to address some of these challenges, both through the dedicated programme and though ongoing work to empower business incubators and accelerators for sustainable development in Central Asia. In addition to these capacity building activities, the UNECE delegation discussed upcoming activities with the National Office of Innovation Implementation and Technology Transfer, the Ministry of Economy and Finance and the Ministry of Agriculture, in order to ensure cross-sectoral targeting and alignment with national development priorities. This UNECE capacity building programme for Uzbekistan will continue throughout 2023. It will offer trainings, policy dialogues, B2B conferences and other events for entrepreneurs, SOEs, business support institutions and policymakers, with the goal of empowering both private and public stakeholders to support the innovation process towards a circular economy. UNECE assists its member States to better integrate into the world economy and to harness trade, innovation and infrastructure financing and investment for sustainable development in the region. UNECE normative tools cover many diverse areas, ranging from trade facilitation and agricultural quality standards to ESG traceability of supply chains, innovation and public private partnerships. UNECE also specifically supports its 17 programme countries in Central Asia, the Caucasus, the Western Balkans and Eastern Europe, in close cooperation with UN Country Teams.","filter_flag":1}
{"title":"How the circular economy could change the bicycle industry | IAA MOBILITY - IAA Mobility","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LmlhYS1tb2JpbGl0eS5jb20vZW4vbmV3c3Jvb20vbmV3cy9jeWNsaW5nLW1pY3JvbW9iaWxpdHkvaG93LXRoZS1jaXJjdWxhci1lY29ub215LWNvdWxkLWNoYW5nZS10aGUtYmljeWNsZS1pbmR1c3RyedIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LmlhYS1tb2JpbGl0eS5jb20vZW4vbmV3c3Jvb20vbmV3cy9jeWNsaW5nLW1pY3JvbW9iaWxpdHkvaG93LXRoZS1jaXJjdWxhci1lY29ub215LWNvdWxkLWNoYW5nZS10aGUtYmljeWNsZS1pbmR1c3RyedIBAA?oc=5","id":"CBMifmh0dHBzOi8vd3d3LmlhYS1tb2JpbGl0eS5jb20vZW4vbmV3c3Jvb20vbmV3cy9jeWNsaW5nLW1pY3JvbW9iaWxpdHkvaG93LXRoZS1jaXJjdWxhci1lY29ub215LWNvdWxkLWNoYW5nZS10aGUtYmljeWNsZS1pbmR1c3RyedIBAA","guidislink":false,"published":"Sat, 20 May 2023 09:51:42 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=20, tm_hour=9, tm_min=51, tm_sec=42, tm_wday=5, tm_yday=140, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LmlhYS1tb2JpbGl0eS5jb20vZW4vbmV3c3Jvb20vbmV3cy9jeWNsaW5nLW1pY3JvbW9iaWxpdHkvaG93LXRoZS1jaXJjdWxhci1lY29ub215LWNvdWxkLWNoYW5nZS10aGUtYmljeWNsZS1pbmR1c3RyedIBAA?oc=5\" target=\"_blank\">How the circular economy could change the bicycle industry | IAA MOBILITY<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">IAA Mobility<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How the circular economy could change the bicycle industry | IAA MOBILITY - IAA Mobility","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LmlhYS1tb2JpbGl0eS5jb20vZW4vbmV3c3Jvb20vbmV3cy9jeWNsaW5nLW1pY3JvbW9iaWxpdHkvaG93LXRoZS1jaXJjdWxhci1lY29ub215LWNvdWxkLWNoYW5nZS10aGUtYmljeWNsZS1pbmR1c3RyedIBAA?oc=5\" target=\"_blank\">How the circular economy could change the bicycle industry | IAA MOBILITY<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">IAA Mobility<\/font>","source.href":"https:\/\/www.iaa-mobility.com","source.title":"IAA Mobility","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"What Bronsvoort means becomes apparent when you look at the lifecycle of a bike. A bicycle consists of more than 2,000 parts. These are produced in various locations around the world, especially in Asia. The majority of these are metals and composites that are only shipped to Europe or North America for final assembly. \"It's a huge supply chain. The material extraction, the production, the transport, the final production, the way to the bike shop - all this leaves an ecological footprint,\" Bronsvoort reports. How this journey translates into numbers is examined by the US bike manufacturer Trek in a sustainability report published in 2021: The mountain bike \"Marlin\" comes to around 116 kilograms of CO2. The \"Rail\" e-mountainbike even produces 220 kilograms of CO2. However, the footprint of a bicycle is still significantly lower than that of a car. A newly produced car produces five to 30 tonnes of CO2, depending on the model. The Trek sustainability report also suggests that the supply chain is only one side of the coin. Thus, the study does not include potential costs for recycling or disposing of frames and components after use. In fact, few parts of a broken bicycle are reused. Instead, most bikes end up in the scrap yard. \"The reason for this is that most companies in the bicycle industry work with a linear economic model - also called a throwaway economy. Raw materials used for a product are not returned to the cycle after their useful life in this type of economy, so that they could be reused,\" says Bronsvoort and emphasises: \"The solution to this problem would be to move to the so-called circular economy.\"","filter_flag":1}
{"title":"May 2 - Ecology seeks comments on rule for recycled content in plastic packaging - Washington State Department of Ecology","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vZWNvbG9neS53YS5nb3YvYWJvdXQtdXMvd2hvLXdlLWFyZS9uZXdzLzIwMjMvbWF5LTItZWNvbG9neS1zZWVrcy1jb21tZW50cy1vbi1ydWxlLWZvci1yZWN5Y2xlZNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vZWNvbG9neS53YS5nb3YvYWJvdXQtdXMvd2hvLXdlLWFyZS9uZXdzLzIwMjMvbWF5LTItZWNvbG9neS1zZWVrcy1jb21tZW50cy1vbi1ydWxlLWZvci1yZWN5Y2xlZNIBAA?oc=5","id":"CBMiZmh0dHBzOi8vZWNvbG9neS53YS5nb3YvYWJvdXQtdXMvd2hvLXdlLWFyZS9uZXdzLzIwMjMvbWF5LTItZWNvbG9neS1zZWVrcy1jb21tZW50cy1vbi1ydWxlLWZvci1yZWN5Y2xlZNIBAA","guidislink":false,"published":"Tue, 02 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=122, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vZWNvbG9neS53YS5nb3YvYWJvdXQtdXMvd2hvLXdlLWFyZS9uZXdzLzIwMjMvbWF5LTItZWNvbG9neS1zZWVrcy1jb21tZW50cy1vbi1ydWxlLWZvci1yZWN5Y2xlZNIBAA?oc=5\" target=\"_blank\">May 2 - Ecology seeks comments on rule for recycled content in plastic packaging<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Washington State Department of Ecology<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"May 2 - Ecology seeks comments on rule for recycled content in plastic packaging - Washington State Department of Ecology","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vZWNvbG9neS53YS5nb3YvYWJvdXQtdXMvd2hvLXdlLWFyZS9uZXdzLzIwMjMvbWF5LTItZWNvbG9neS1zZWVrcy1jb21tZW50cy1vbi1ydWxlLWZvci1yZWN5Y2xlZNIBAA?oc=5\" target=\"_blank\">May 2 - Ecology seeks comments on rule for recycled content in plastic packaging<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Washington State Department of Ecology<\/font>","source.href":"https:\/\/ecology.wa.gov","source.title":"Washington State Department of Ecology","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Ecology is now accepting comments on a proposed rule to implement the recycled content requirements of the 2021 Plastics Law. OLYMPIA – A key piece of Washington’s 2021 plastics law aims to reduce the production of new plastic for consumer packaging by requiring producers of certain product categories to include a minimum amount of post-consumer recycled content (PCRC) in trash bags and plastic packaging containers. The Washington Department of Ecology is now asking the public to review and comment on a proposed rule that establishes the agency’s oversight and enforcement procedures for the PCRC portions of the plastics law, including the agency’s method for calculating producer fees. The public review and comment period ends on July 1, 2023, and gives the public the opportunity to participate in an important process that will establish key processes and provide clarity that helps affected producers comply with the law. Ecology will also hold two online public hearings on June 8 and 15, 2023, where attendees can ask questions, learn more about the rule, and provide verbal testimony. More information, including links to the proposed rule, registration information for the public hearings, and the online comment portal are available on Ecology’s rule website. Ecology will review all input on the proposed rule after the comment period ends and publish responses this fall. After the rule is finalized, it will take effect on Jan. 1, 2024. 2021 Plastics Law Plastic pollution is pervasive across Washington and poses a threat to human health, wildlife, and the environment. The 2021 Plastics Law establishes PCRC minimum requirements- one of the key recommendations in Washington’s 2020 plastics study. Utilizing PCRC in the manufacturing of new products reduces cradle-to-grave greenhouse gas emissions by at least 30% compared to emissions from the use of virgin material, according to one study. Using existing PCRC resin also supports end-markets that boost the value of plastics placed in curbside recycling bins. Post-consumer recycled content minumum requirements increase over time. Washington is among several states to pass laws requiring producers to include recycled content in product packaging. The first PCRC requirements began this year as producers of most beverages and trash bags were required to include at least 15% recycled content in the plastic bottles and bags. Over time, the minimum requirements will increase and apply to a greater number of products, including plastic containers for personal care products and household cleaning products, plastic bottles for dairy beverages, and small plastic wine bottles. More information about the 2021 plastics law is available at Ecology’s website. Visit Ecology’s PCRC rule website to comment on the proposed rule, learn more about public hearings, and sign up for email updates.","filter_flag":1}
{"title":"In focus: eBay - M&G","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3Lm1hbmRnLmNvbS9pbnZlc3RtZW50cy9wcm9mZXNzaW9uYWwtaW52ZXN0b3IvZW4tZ2IvaW5zaWdodHMvc3BvdGxpZ2h0L3Bvc2l0aXZlLWltcGFjdC1mdW5kL2ViYXnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3Lm1hbmRnLmNvbS9pbnZlc3RtZW50cy9wcm9mZXNzaW9uYWwtaW52ZXN0b3IvZW4tZ2IvaW5zaWdodHMvc3BvdGxpZ2h0L3Bvc2l0aXZlLWltcGFjdC1mdW5kL2ViYXnSAQA?oc=5","id":"CBMiamh0dHBzOi8vd3d3Lm1hbmRnLmNvbS9pbnZlc3RtZW50cy9wcm9mZXNzaW9uYWwtaW52ZXN0b3IvZW4tZ2IvaW5zaWdodHMvc3BvdGxpZ2h0L3Bvc2l0aXZlLWltcGFjdC1mdW5kL2ViYXnSAQA","guidislink":false,"published":"Thu, 25 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=145, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3Lm1hbmRnLmNvbS9pbnZlc3RtZW50cy9wcm9mZXNzaW9uYWwtaW52ZXN0b3IvZW4tZ2IvaW5zaWdodHMvc3BvdGxpZ2h0L3Bvc2l0aXZlLWltcGFjdC1mdW5kL2ViYXnSAQA?oc=5\" target=\"_blank\">In focus: eBay<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">M&amp;G<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"In focus: eBay - M&G","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3Lm1hbmRnLmNvbS9pbnZlc3RtZW50cy9wcm9mZXNzaW9uYWwtaW52ZXN0b3IvZW4tZ2IvaW5zaWdodHMvc3BvdGxpZ2h0L3Bvc2l0aXZlLWltcGFjdC1mdW5kL2ViYXnSAQA?oc=5\" target=\"_blank\">In focus: eBay<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">M&amp;G<\/font>","source.href":"https:\/\/www.mandg.com","source.title":"M&G","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"eBay is a large online marketplace, with approximately 147 million active buyers bidding on 1.5 billion listings across 190 worldwide markets. The circular economy eBay’s business model centres around ‘re-commerce’ – the sale of used, refurbished and out-of-season items, rather than new products. According to management, nearly 90% of gross merchandise value (GMV) is made up of used, refurbished and non-new products. Therefore, eBay primarily makes a positive impact through its contribution to the circular economy. This involves re-using and recycling the products already in the economic system, rather than relying solely on new products. This change in consumption patterns helps to avoid the extraction of new materials, the fabrication of these materials (which can be energy intensive), and negates the need for products to be placed in landfill prematurely (where they will produce further emissions). According to The Ellen MacArthur Foundation, of which eBay is a member, up to 20% of carbon emissions could be avoided by adopting a more circular method to the way in which our economy operates. It will therefore play an essential role in global efforts to reach net-zero emissions. Impact data and reporting The nature of eBay’s business model makes the collection of impact data difficult. With so many listings, the company is somewhat reliant on sellers accurately categorising their products as new, refurbished or used. However, the company sends users surveys and engages with third parties to get a clearer picture. Furthermore, eBay engages with independent specialists to calculate and validate its data for avoided emissions and landfill waste. The company believes the current numbers are conservative, and will look to improve the methodology and accuracy over time. Encouragingly, eBay also produces an annual impact report, covering the company’s impact and sustainability priorities, new initiatives in these areas, and its methodology for calculating impact metrics.","filter_flag":1}
{"title":"Circular economy solution gives electric vehicle batteries a second life - Cordis News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vY29yZGlzLmV1cm9wYS5ldS9hcnRpY2xlL2lkLzQ0MzQxMi1jaXJjdWxhci1lY29ub215LXNvbHV0aW9uLWdpdmVzLWVsZWN0cmljLXZlaGljbGUtYmF0dGVyaWVzLWEtc2Vjb25kLWxpZmXSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vY29yZGlzLmV1cm9wYS5ldS9hcnRpY2xlL2lkLzQ0MzQxMi1jaXJjdWxhci1lY29ub215LXNvbHV0aW9uLWdpdmVzLWVsZWN0cmljLXZlaGljbGUtYmF0dGVyaWVzLWEtc2Vjb25kLWxpZmXSAQA?oc=5","id":"CBMic2h0dHBzOi8vY29yZGlzLmV1cm9wYS5ldS9hcnRpY2xlL2lkLzQ0MzQxMi1jaXJjdWxhci1lY29ub215LXNvbHV0aW9uLWdpdmVzLWVsZWN0cmljLXZlaGljbGUtYmF0dGVyaWVzLWEtc2Vjb25kLWxpZmXSAQA","guidislink":false,"published":"Mon, 08 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=128, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vY29yZGlzLmV1cm9wYS5ldS9hcnRpY2xlL2lkLzQ0MzQxMi1jaXJjdWxhci1lY29ub215LXNvbHV0aW9uLWdpdmVzLWVsZWN0cmljLXZlaGljbGUtYmF0dGVyaWVzLWEtc2Vjb25kLWxpZmXSAQA?oc=5\" target=\"_blank\">Circular economy solution gives electric vehicle batteries a second life<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cordis News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Circular economy solution gives electric vehicle batteries a second life - Cordis News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vY29yZGlzLmV1cm9wYS5ldS9hcnRpY2xlL2lkLzQ0MzQxMi1jaXJjdWxhci1lY29ub215LXNvbHV0aW9uLWdpdmVzLWVsZWN0cmljLXZlaGljbGUtYmF0dGVyaWVzLWEtc2Vjb25kLWxpZmXSAQA?oc=5\" target=\"_blank\">Circular economy solution gives electric vehicle batteries a second life<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cordis News<\/font>","source.href":"https:\/\/cordis.europa.eu","source.title":"Cordis News","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Circular economy solution gives electric vehicle batteries a second life Two demo sites in Finland and Norway will showcase how used electric vehicle batteries can be exploited in battery systems for energy storage purposes. Climate Change and Environment Energy © malp\/stock.adobe.com The EU-funded TREASoURcE project will be commissioning a stationary battery energy storage system (BESS) built with used electric vehicle batteries at two demo sites in the summer of 2023. This is part of TREASoURcE’s mission to create systemic circular economy solutions for currently underutilised or unused plastic waste, end-of-life electric vehicle batteries, and bio-based waste and side streams. The two sites chosen to test the BESS are the Rudskogen Motorsports Centre in Norway and the municipally owned Lempäälä House (Lempäälä-talo) in Finland. The aim of the demonstrations is to gain more insight into the second life and functionality of batteries and the ways in which stationary batteries can balance electricity demand. Norwegian TREASoURcE project partner SINTEF, one of Europe’s largest independent research organisations, is leading the pilot and project partner ECO STOR, also from Norway, is supplying the battery systems. The BESS benefits Using the BESS has economic, environmental and social benefits. The rechargeable battery system will store excess energy collected from solar panels and then later discharge that energy to provide electricity when needed. By shifting energy consumption, it reduces energy costs and helps to stabilise the entire electricity grid. The use of second-life batteries in the system reduces the negative impact on the environment by saving critical minerals and other natural resources. The demo sites Plans to improve the facilities at the Rudskogen Motorsports Centre include new buildings currently under construction and the installation of solar panels. The centre’s BESS will have a rated capacity of 120 kWh and rated power of 60 kW. “Rudskogen Motorsports Center wishes to choose good and sustainable solutions in connection with the expansion and electrification of the facilities. This will facilitate for future electrification of the sport,” states Rudskogen Motorsports Centre Board Chairman Bård Mikkelsen in a news item posted on the TREASoURcE project website. The second demo site, Lempäälä House, is a modern building that houses Lempäälä’s main library, a centralised service corridor, a restaurant and a gym. The BESS installed at this site will have a rated capacity of 80 kWh and rated power of 40 kW. “The pilot sounded immediately interesting and especially the application of demand response is very topical,” remarks Lempäälä Municipality construction manager Ulla Palo-oja in the same news item. “Lempäälä House is very energy efficient to begin with, it has its own solar panel system and sufficient space to store the batteries, so we thought it was very suitable to be a demo site in the project. We’re very excited to see the results so we can further apply them in our future projects as well.” The battery systems will be operating and collecting research data from the two sites until 2026. The TREASoURcE (TERRITORIAL AND REGIONAL DEMONSTRATIONS OF SYSTEMIC SOLUTIONS OF KEY VALUE CHAINS AND THEIR REPLICATION TO DEPLOY CIRCULAR ECONOMY) team is currently also considering commissioning a third demo site in the second half of 2023. For more information, please see: TREASoURcE project website Keywords TREASoURcE, battery, electric vehicle, storage, energy, stationary battery, battery energy storage system","filter_flag":1}
{"title":"We need a clear strategy for a circular economy - The Business Standard","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LnRic25ld3MubmV0L3Rob3VnaHRzL3dlLW5lZWQtY2xlYXItc3RyYXRlZ3ktY2lyY3VsYXItZWNvbm9teS02MzE0OTTSAVNodHRwczovL3d3dy50YnNuZXdzLm5ldC90aG91Z2h0cy93ZS1uZWVkLWNsZWFyLXN0cmF0ZWd5LWNpcmN1bGFyLWVjb25vbXktNjMxNDk0P2FtcA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LnRic25ld3MubmV0L3Rob3VnaHRzL3dlLW5lZWQtY2xlYXItc3RyYXRlZ3ktY2lyY3VsYXItZWNvbm9teS02MzE0OTTSAVNodHRwczovL3d3dy50YnNuZXdzLm5ldC90aG91Z2h0cy93ZS1uZWVkLWNsZWFyLXN0cmF0ZWd5LWNpcmN1bGFyLWVjb25vbXktNjMxNDk0P2FtcA?oc=5","id":"CBMiT2h0dHBzOi8vd3d3LnRic25ld3MubmV0L3Rob3VnaHRzL3dlLW5lZWQtY2xlYXItc3RyYXRlZ3ktY2lyY3VsYXItZWNvbm9teS02MzE0OTTSAVNodHRwczovL3d3dy50YnNuZXdzLm5ldC90aG91Z2h0cy93ZS1uZWVkLWNsZWFyLXN0cmF0ZWd5LWNpcmN1bGFyLWVjb25vbXktNjMxNDk0P2FtcA","guidislink":false,"published":"Sun, 14 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=134, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LnRic25ld3MubmV0L3Rob3VnaHRzL3dlLW5lZWQtY2xlYXItc3RyYXRlZ3ktY2lyY3VsYXItZWNvbm9teS02MzE0OTTSAVNodHRwczovL3d3dy50YnNuZXdzLm5ldC90aG91Z2h0cy93ZS1uZWVkLWNsZWFyLXN0cmF0ZWd5LWNpcmN1bGFyLWVjb25vbXktNjMxNDk0P2FtcA?oc=5\" target=\"_blank\">We need a clear strategy for a circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Business Standard<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"We need a clear strategy for a circular economy - The Business Standard","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LnRic25ld3MubmV0L3Rob3VnaHRzL3dlLW5lZWQtY2xlYXItc3RyYXRlZ3ktY2lyY3VsYXItZWNvbm9teS02MzE0OTTSAVNodHRwczovL3d3dy50YnNuZXdzLm5ldC90aG91Z2h0cy93ZS1uZWVkLWNsZWFyLXN0cmF0ZWd5LWNpcmN1bGFyLWVjb25vbXktNjMxNDk0P2FtcA?oc=5\" target=\"_blank\">We need a clear strategy for a circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Business Standard<\/font>","source.href":"https:\/\/www.tbsnews.net","source.title":"The Business Standard","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Infographic: TBS A circular economy is principally poles apart from a linear economy. In a linear economy, raw materials that we process into a product are mostly thrown away after use, which creates a burden on nature. However, in a circular economy, the cycle is closed as all these raw materials come back in production in a different way, to produce the same product or a different product through innovation, putting lesser pressure on nature. Considering the severe climate change impact, there is a need to create realisation about the importance of a circular economy with a proper and clear strategy. According to a report published in 2019 by the Ellen MacArthur Foundation, only 9% of the world's economy is circular, meaning that the remaining 91% is still largely based on the traditional linear model of take-make-dispose. This report also noted that the circular economy could generate $4.5 trillion in economic benefits by 2030, creating new jobs and reducing environmental impacts. Another report by the Circle Economy organisation estimates that the global circularity rate was around 8.6% in 2019, up from 7.2% in 2015. The report noted that there is still a long way to go in achieving a fully circular economy, but progress is being made in several areas, including circular design, recycling and sharing platforms. It seems that the global circular economy (CE) has not expanded to satisfaction, while climate change issues are bellying up in a bigger way, and burdening nature, and has become a serious liability to humanity. Even though as per above statistics the share of CE is not high, gradually a large number of countries have taken strategies to enter into the circular economy. In the Circular Economy Action Plan for cleaner and more competitive Europe or simply #EUGREENDEAL, global consumption of materials such as biomass fossil fuel, metals and minerals has been estimated to double in the next forty years, while waste generation will increase by 70% by 2050. They have planned an Industrial Strategy applying CE and see potential to increase EU GDP by an additional 0.5% by 2030, creating around 700,000 new jobs. Countries are not only thinking of going for CE, but at the same time how they can transform their economy in such a way to utilise the principles of CE to create more jobs and increasing contributions to GDP. In the Industrial Policy 2022, in its Chapter 17 on Establishment of Environment Friendly Industry and Wastage Management, on paragraph 17.9, it is mentioned industrial entrepreneurs will be encouraged to adopt 5R: Refuse, Reduce, Reuse, Repurpose and Recycle strategy. Time has come for Bangladesh to outline a clear national strategy, setting targets, for scaling up CE with an aim to create new jobs and at the same time become a climate neutral country. Bangladesh has passed through a number of stages of industrialisation. In the 8th five year plan, among the core objectives, one of the important aspects is the expansion of a manufacturing-based export-led economy. However, nature cannot be punished for industrialisation. For traditional industry, we take a lot of raw materials from nature which depletes our resources, and when we use this raw material in industries, there is wastage, and a part of the wastage again returns to nature as a burden. In a circular economy, we take less from nature. So wastage is less and the burden on nature is also less. We know the importance of a circular economy, however, how we can best utilise the benefits is a big question. The nature and type of industries are different and thus wastage comes in different categories, needs separate treatment, while the technology involved are also different. So, in case of practicing circular economy, what are the products and bi-products, their end of life, where they could go and how best can they be recycled throughout their product life, needs extensive research. In that respect, industry-academia collaboration is critical. Nowadays universities have been taking interest in the issue; they need to be encouraged with support. While we discuss circular economy, we can see that circular economy is not new in our life, for example; used books are being used for packaging, rice and rice straws for cattle. There are a number of other examples of circularity. In the past, cattle manure was used for fire in the villages, sometimes burned old clothes were used as a remedy for wounds etc. These are circularities embedded in our conception of a circular economy. There remains ample opportunities for wider and systematic use and adaptable technology. However, businesses treat it as a paradigm shift; some believe it expensive, technology-intensive and requires new and huge investment. However, experts believe that the environmental impact of 80% of products are determined at the design phase, so in order to ensure sustainability of products, designing is a big issue. In that respect, the EU is going to propose a sustainable product policy legislative initiative with a core objective of eco-design directives for the broadest possible range of products, to deliver with circularity. Bangladesh needs to think about a collaborative approach, as eco-designing policies with clear directives is not a nation-specific issue and will have an impact on everyone. In a recent business summit organised by FBCCI, there was a specific session on circular economy. A presentation referred to the paper industry, which is a big industry, where wastewater is a big problem, but pulp recovery is possible. Entrepreneurs need to be serious and need to know about technology so that recovery of valuable materials is possible. Besides, a circular economy can create new job opportunities. We have to consider the natural footprint and environmental footprint of our products. We need to involve academia to innovate new products. From a circular economy we can attract bio-economy. Nature is showing us alternatives of products, from less hazardous to more hazardous ones. By using principles of circularity we can innovate by-products and new products through modernisation and alteration. Nevertheless, challenges are there in terms of where additional funding, linkage, education for stakeholders, and acceptance of the circular economy will come. Here is the need for institutionalisation of industry-academia collaboration. In our country, industrialisation depends mostly on imported technology and we have less trust in our indigenous technology. There are fund limitations in the universities and whatever funds are available can not be used in some cases. Additionally, there are pledges of international funding, such as the green climate fund. In the LDC5 conference, there were a number of declarations on different funding arrangements, however, the conditionalities were so stringent that it is almost impossible for SMEs to meet it. So, the only alternative for them is to avail financial support from different schemes announced by the central bank. There is a need for stock-taking of products, getting the right information at different phases, future projection of what materials we will use and how much natural product can be produced by the manufacturers, and designing our manufacturing process accordingly. Cluster based support for ETP, wastewater treatment plants and close work with existing industry to create new initiatives is now a priority. One of the key areas where Bangladesh has made progress is in textile and garment manufacturing, which is one of the largest industries in the country. In recent years, there has been a growing interest in sustainable and circular textile production, with several initiatives and programs promoting sustainable production practices and the use of recycled materials. Bangladesh Garment Manufacturers and Exporters Association (BGMEA) has launched a sustainability initiative that aims to reduce waste and promote circular practices in the industry. Another area where Bangladesh is promoting CE is in waste management. The country has a significant waste management problem, with inadequate infrastructure and limited resources to manage the waste generated by its growing population. However, there are several initiatives and programs in place to address this issue, such as the Solid Waste Management Program, which aims to promote waste reduction, segregation and recycling. There are several small-scale circular initiatives, such as recycling and up-cycling workshops and social enterprises that use waste materials to create new products. Despite these initiatives, there are challenges, such as limited resources, inadequate infrastructure, lack of awareness and understanding of the circular economy concept. To fully realise its potential, there is a need for policy support, targeted investment in circular infrastructure and technologies. A clear strategy addressing these issues can attract entrepreneurs to opt for a circular economy. Sketch: TBS Ferdaus Ara Begum is the chief executive officer of BUILD, a public-private dialogue platform that works in the area of private-sector development. Disclaimer: The views and opinions expressed in this article are those of the author and do not necessarily reflect the opinions and views of The Business Standard.","filter_flag":1}
{"title":"Is Repair the Future of Design? Katie Treggiden Explores... - Design Milk","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vZGVzaWduLW1pbGsuY29tL2lzLXJlcGFpci10aGUtZnV0dXJlLW9mLWRlc2lnbi1rYXRpZS10cmVnZ2lkZW4tZXhwbG9yZXMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vZGVzaWduLW1pbGsuY29tL2lzLXJlcGFpci10aGUtZnV0dXJlLW9mLWRlc2lnbi1rYXRpZS10cmVnZ2lkZW4tZXhwbG9yZXMv0gEA?oc=5","id":"CBMiUGh0dHBzOi8vZGVzaWduLW1pbGsuY29tL2lzLXJlcGFpci10aGUtZnV0dXJlLW9mLWRlc2lnbi1rYXRpZS10cmVnZ2lkZW4tZXhwbG9yZXMv0gEA","guidislink":false,"published":"Tue, 09 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=129, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vZGVzaWduLW1pbGsuY29tL2lzLXJlcGFpci10aGUtZnV0dXJlLW9mLWRlc2lnbi1rYXRpZS10cmVnZ2lkZW4tZXhwbG9yZXMv0gEA?oc=5\" target=\"_blank\">Is Repair the Future of Design? Katie Treggiden Explores...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Design Milk<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Is Repair the Future of Design? Katie Treggiden Explores... - Design Milk","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vZGVzaWduLW1pbGsuY29tL2lzLXJlcGFpci10aGUtZnV0dXJlLW9mLWRlc2lnbi1rYXRpZS10cmVnZ2lkZW4tZXhwbG9yZXMv0gEA?oc=5\" target=\"_blank\">Is Repair the Future of Design? Katie Treggiden Explores...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Design Milk<\/font>","source.href":"https:\/\/design-milk.com","source.title":"Design Milk","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"“Is repair the future of design?” That’s the question that our very own Editor at Large, author, podcaster, and keynote speaker Katie Treggiden is asking as she launches her sixth book, Broken: Mending & Repair in a Throwaway World (published by Ludion and available in the US from May 29). “The linear “take-make-waste” model is no longer working,” she says. “The design industry needs to embrace the circular economy, and fast.” According to the Ellen MacArthur Foundation website: “In our current economy, we take materials from the Earth, make products from them, and eventually throw them away as waste – the process is linear. In a circular economy, by contrast, we stop waste being produced in the first place.” Describing the circular economy as “driven by design,” the organization proposes three principles: “eliminate waste and pollution”, “keep materials and objects in use”, and “regenerate nature”. Treggiden’s previous book, Wasted: When Trash Becomes Treasure (Ludion, 2020) explores the idea of keeping materials in use – i.e. using waste rather than raw materials to create new products. She has continued to explore this idea in her monthly column for Design Milk, Circular by Design, in the three years since then. Her new book takes that idea one step further and suggests that we don’t need to make new products at all – but instead can keep objects in use by repairing them to extend their lifespan and evolve their use case. “The design industry – and the media in particular – is obsessed with the new,” says Treggiden. “As a design journalist, I’m guilty of it myself. The first thing I have historically asked brands when covering design festivals for Design Milk is “what’s new?” But a linear economy is simply not sustainable on a finite planet. If we’re going to find genuine solutions for the climate crisis, we need to embrace reuse and repair.” “We live in a throwaway society in which is it usually cheaper and easier to replace than repair, and yet people still mend things,” she continues. “In this book, I was interested to find out why. What cultural and societal roles do mending and repair play? By understanding that, I hope to inspire the whole industry to let go of its “veneration of newness” and instead embrace the patina of use, the stories of age, and the longevity of care and repair.” Alongside five in-depth essays exploring these roles – which Treggiden proposes include storytelling, activism, and healing – the book includes profiles of 28 artists, curators, menders, and re-makers who use repair techniques in their work. The book includes a foreword by Jay Blades, who British readers will be familiar with as the presenter of the BBC’s Repair Shop – credited with increasing the popularity of repair in the UK. Blades describes Treggiden as his “fairy godmother,” crediting her as one his earliest champions, and says “Broken is fundamentally a book about community. Every one of the makers, menders, artists, and craftspeople featured – whether they’re using repair to fix something physically broken or as a way to process profound emotional trauma – understands that repair is a conversation with the past, and an act of care for the future.” And it’s this act of care for the future that inspired the book. Treggiden’s own introduction provides an accessible, erudite, and fresh perspective on the topic of repair, connecting the personal to the systemic, and calling for change. To align with the topics explored in the book, Treggiden’s Circular by Design column for Design Milk will conclude its exploration of waste as a raw material and pivot towards an investigation into the role that mending can play in a much-needed shift towards a more circular economy – arguing that repair is indeed the future of design.","filter_flag":1}
{"title":"How a circular economy would lead to EU energy savings - The Brussels Times","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LmJydXNzZWxzdGltZXMuY29tLzQ5ODIzNi9ob3ctYS1jaXJjdWxhci1lY29ub215LXdvdWxkLWxlYWQtdG8tZXUtZW5lcmd5LXNhdmluZ3PSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LmJydXNzZWxzdGltZXMuY29tLzQ5ODIzNi9ob3ctYS1jaXJjdWxhci1lY29ub215LXdvdWxkLWxlYWQtdG8tZXUtZW5lcmd5LXNhdmluZ3PSAQA?oc=5","id":"CBMiW2h0dHBzOi8vd3d3LmJydXNzZWxzdGltZXMuY29tLzQ5ODIzNi9ob3ctYS1jaXJjdWxhci1lY29ub215LXdvdWxkLWxlYWQtdG8tZXUtZW5lcmd5LXNhdmluZ3PSAQA","guidislink":false,"published":"Thu, 11 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=131, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LmJydXNzZWxzdGltZXMuY29tLzQ5ODIzNi9ob3ctYS1jaXJjdWxhci1lY29ub215LXdvdWxkLWxlYWQtdG8tZXUtZW5lcmd5LXNhdmluZ3PSAQA?oc=5\" target=\"_blank\">How a circular economy would lead to EU energy savings<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Brussels Times<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How a circular economy would lead to EU energy savings - The Brussels Times","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LmJydXNzZWxzdGltZXMuY29tLzQ5ODIzNi9ob3ctYS1jaXJjdWxhci1lY29ub215LXdvdWxkLWxlYWQtdG8tZXUtZW5lcmd5LXNhdmluZ3PSAQA?oc=5\" target=\"_blank\">How a circular economy would lead to EU energy savings<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Brussels Times<\/font>","source.href":"https:\/\/www.brusselstimes.com","source.title":"The Brussels Times","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Credit: Evan Demicoli\/Unsplash A circular economy can play an important role in reducing energy consumption in the European Union by keeping materials and products in the economy for longer, a new report by the Materials & Products Taskforce of the European Corporate Leaders Group (CLG Europe) shows. With over a year since Russia’s invasion of Ukraine, the EU is still faced with energy instability and a cost-of-living crisis, which have prompted a rapid roll-out of measures – from diversifying energy sources to a move towards renewables in the medium and long term. \"Politicians have naturally been keen to alleviate the worst effects of rising food and energy prices for people. This has led to tensions around whether long-term ambitions to shift towards a green economy should be postponed in favour of tackling shorter-term challenges,\" the authors of the report stated. \"But such a black-and-white dichotomy is false.\" A key long-term solution for the EU's energy and climate challenges is a circular economy, they stressed. Meeting climate targets “The war in Ukraine has led to increased energy costs at a time when we also need to reduce our energy use,\" said Tahmid Chowdhury, Materials and Products Taskforce lead at CISL Brussels in a press release, adding that the report demonstrates that circular solutions can have a triple benefit. \"Reducing carbon emissions, reducing energy consumption and reducing material use – a win both for the economy and the environment,\" he said. \"This will be a key requirement in future European Industrial Policy and will enable us to have a thriving industry, to meet our climate targets while also respecting our limited planetary resources.\" While current energy policies look to reduce greenhouse gas emissions by at least 55%, research shows that circular approaches have the potential to address the remaining 45% of emissions stemming from material production. On top of a shift towards renewable energy and phasing out fossil fuels, the EU also plans to cut its use of energy by at least 13% (up from 9% in 2022). The circular economy will be a key driver for the bloc’s climate ambitions by reducing both greenhouse gas emissions and energy consumption. A key factor will be keeping materials and products in the economy for longer, encouraging reuse and repair, and imposing mandatory recycling measures. Drawing on examples from leading progressive businesses in Europe, the report demonstrates how many are already benefitting from this shift to a circular economy – as well as the challenges they are facing. A global manufacturer of construction materials, Saint-Gobain, for example, launched a ‘Glass Forever roadmap’ in 2017, aiming to increase the proportion of recycled glass in its glass production to 50% by 2025. Not only did this result in reduced emissions, but the process also used significantly less energy than melting virgin materials. \"Fostering circularity and decarbonisation in the built environment are two top priorities for us. Introducing greater circularity into our production makes a significant impact,\" said Céline Carré, Head of Public Affairs at Saint-Gobain. \"Every ton of cullet (recycled glass) introduced into glass production saves 1.2 tonnes of virgin material, whilst the melting process of cullet uses 30% less energy than melting virgin materials,\" she added. \"These are significant benefits which demonstrate why a circular economy can reduce material needs whilst also lowering energy consumption.\" Related News Another example is insulation provider ROCKWOOL, which created a closed-loop recycling system to allow stone wool insulation materials – typically considered waste and discarded in landfills – to be recycled and used as secondary raw material for new products. The report also provides six recommendations for policymakers on how to build greater circularity through existing policies. Notably, creating a clear vision for a new European green industrial strategy, constructing clearer supporting links between energy efficiency and circular economy policies, and supporting the development and widespread adoption of recycling technological solutions. Additionally, the recirculation of materials through fiscal policies should be enabled and applied across all stages of the product’s life cycle in alignment with existing EPR fees, added by an increased use of demand-side policies for circular product services, and improving policy coherence.","filter_flag":1}
{"title":"Environmentalists Seek End to Plastic Industry “Hoax” – Mother Jones - Mother Jones","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3Lm1vdGhlcmpvbmVzLmNvbS9wb2xpdGljcy8yMDIzLzA1L2NoZW1pY2FsLWFkdmFuY2VkLXJlY3ljbGluZy1ob2F4LXBvbGx1dGlvbi1lbWlzc2lvbnMtZmVkZXJhbC10cmFkZS1jb21taXNzaW9uL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3Lm1vdGhlcmpvbmVzLmNvbS9wb2xpdGljcy8yMDIzLzA1L2NoZW1pY2FsLWFkdmFuY2VkLXJlY3ljbGluZy1ob2F4LXBvbGx1dGlvbi1lbWlzc2lvbnMtZmVkZXJhbC10cmFkZS1jb21taXNzaW9uL9IBAA?oc=5","id":"CBMie2h0dHBzOi8vd3d3Lm1vdGhlcmpvbmVzLmNvbS9wb2xpdGljcy8yMDIzLzA1L2NoZW1pY2FsLWFkdmFuY2VkLXJlY3ljbGluZy1ob2F4LXBvbGx1dGlvbi1lbWlzc2lvbnMtZmVkZXJhbC10cmFkZS1jb21taXNzaW9uL9IBAA","guidislink":false,"published":"Tue, 02 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=122, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3Lm1vdGhlcmpvbmVzLmNvbS9wb2xpdGljcy8yMDIzLzA1L2NoZW1pY2FsLWFkdmFuY2VkLXJlY3ljbGluZy1ob2F4LXBvbGx1dGlvbi1lbWlzc2lvbnMtZmVkZXJhbC10cmFkZS1jb21taXNzaW9uL9IBAA?oc=5\" target=\"_blank\">Environmentalists Seek End to Plastic Industry “Hoax” – Mother Jones<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mother Jones<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Environmentalists Seek End to Plastic Industry “Hoax” – Mother Jones - Mother Jones","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3Lm1vdGhlcmpvbmVzLmNvbS9wb2xpdGljcy8yMDIzLzA1L2NoZW1pY2FsLWFkdmFuY2VkLXJlY3ljbGluZy1ob2F4LXBvbGx1dGlvbi1lbWlzc2lvbnMtZmVkZXJhbC10cmFkZS1jb21taXNzaW9uL9IBAA?oc=5\" target=\"_blank\">Environmentalists Seek End to Plastic Industry “Hoax” – Mother Jones<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mother Jones<\/font>","source.href":"https:\/\/www.motherjones.com","source.title":"Mother Jones","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"This story was originally published by Inside Climate News and is reproduced here as part of the Climate Desk collaboration. The newest flashpoint in a political battle between environmental groups and the plastics industry over “chemical” or “advanced” recycling has to do with the kinds of claims that can be made and still be truthful with American consumers. The Federal Trade Commission is weighing its first changes in 10 years to its Green Guides, which establish guidelines for companies’ environmental advertising and labeling claims. The FTC’s review goes far beyond plastic recycling and includes concepts such as “net zero” related to greenhouse gas emissions, biodegradability, sustainability, and organic products. But recycling is front and center in the FTC review, which comes amid a global recognition of a plastic crisis, United Nations negotiations toward a treaty to curb plastic waste and the awareness of the widespread failure of plastic recycling. Tens of millions of Americans still dutifully sort their household plastic to be recycled, even though most of it ends up in landfills or is sent to incinerators. The US has the biggest plastic-waste footprint of any nation—about 486 pounds per person annually. Plastic manufacturers are also pushing hard now with media, advertising and lobbying campaigns to gain public acceptance of advanced or chemical recycling, which requires new, largely unproven kinds of chemical plants that seek to break down plastic waste with chemicals, high-heat processes, or both, and then turn the waste into feedstocks that can be mixed with fossil fuels or incorporated into new plastic products. The industry says that through advanced recycling a “circular” plastics economy can be created that reduces the need to tap virgin fossil fuels to make its products. Environmentalists say advanced recycling is in many cases tantamount to “greenwashing”—an energy-intensive process with a high carbon footprint that essentially incinerates much of the waste and turns a small percentage into feedstocks for new plastics, or more fossil fuels. Whichever way the FTC comes down on the question could go a long way toward reinforcing recycling policies across the country for the next decade or longer. So could the potential for new scrutiny of certain kinds of chemical recycling by the EPA, announced in a draft plastic waste strategy issued late last month. To date, the EPA has tended to view these “advanced” processes as incineration, not recycling, though the agency in its 2021 National Recycling Strategy said it would “welcome” further discussion of chemical recycling—a position it is now partially walking back. Taken together, the FTC and EPA actions stand to affect the growth potential of the nascent advanced recycling industry across the United States. That includes one of the largest proposals—Houston-based Encina’s plan to erect a $1.1 billion chemical plant on 100 acres next to the Susquehanna River in Northumberland County, Pennsylvania, which has run into local opposition. The plant is being designed to convert end-of-life plastics into benzene, toluene, and xylene to be used to manufacture new plastic products, according to the company. The United States has about 4 percent of the world’s population but generates nearly 11 percent of global plastic waste and has the biggest plastic-waste footprint of any country, generating approximately 486 pounds per person annually, according to the EPA. A study last year by the environmental groups Beyond Plastics and The Last Beach Cleanup, found plastics recycling in the United States had fallen to below 6 percent. Businesses cannot be trusted, said Jan Dell, founder of The Last Beach Cleanup, based in Southern California. Dell has recently put digital trackers in plastic bags or containers labeled as recyclable, dropped them off at recycling stations, then traced them to local landfills. “There are thousands of products labeled with false recyclable labels,” she said. The FTC first issued its Green Guides in 1992 and they were revised in 1996, 1998 and 2012. They provide guidance on environmental marketing claims, including how consumers are likely to interpret them and how marketers can substantiate them to avoid deceiving consumers, according to the agency. “People decide what to buy, or not to buy, for all kinds of reasons,” FTC Chair Lina M. Khan said in a Dec. 14 statement when the agency opened a comment period for the Green Guides update. “Walk down the aisle at any major store (and) you’re likely to see packages trumpeting their low carbon footprint, their energy efficiency, or their sustainability. For the average consumer, it’s impossible to verify these claims.” “The FTC has an opportunity to stop the widespread greenwashing about the recyclability of plastic packaging.” More than 7,000 people, businesses, and organizations submitted written comments by the FTC’s April 24 deadline, which marks the beginning of a drawn-out process that will include the agency reviewing the comments, holding workshops, drafting revisions to the Green Guides and then seeking more public comment, an agency spokesman said. The agency has posted nearly 1,000 of the comments. Environmental, business and industry groups are all calling for clearer guidance on claims that consumers rely upon to choose what products to buy. Environmentalists want new mandates. The Consumer Brands Association, whose members include beverage, food and drug companies, and retailers including Amazon, for example, told the FTC that a comprehensive update of the guides is needed for clarity. “The distinction between environmental benefit claims as opposed to instructions which direct consumers how to recycle products have amplified confusion in the marketplace, and consequently the potential for consumer deception,” the association wrote. “At the same time, there is a lack of clarity for (the) consumer and regulatory certainty for industry that has been exacerbated by lack of uniform federal standards, a patchwork of state approaches to environmental claims and recycling systems, as well as litigation.” Strong reforms are necessary around recycling claims, said John Hocevar, oceans campaign director with the environmental group, Greenpeace USA. “The FTC has an opportunity to stop the widespread greenwashing about the recyclability of plastic packaging,” he said. “It is clear that the current approach has not been successful, so it is time to codify and start enforcing the Green Guides. Once corporations stop misleading their customers that all this throwaway plastic packaging is recyclable, it will be much easier to have honest conversations about real solutions.” Greenpeace USA joined other environmental groups including Beyond Plastics, the Center for Biological Diversity and The Last Beach Cleanup in written comments calling for FTC to give the Green Guides, which critics describe as largely voluntary, the full force of federal law while encouraging the agency to adopt California’s 2021 Senate Bill 343. The bill requires products to meet benchmarks in order to be advertised or labeled as recyclable, and is designed to help consumers to clearly identify which products are recyclable in California. Across the country, seven categories of plastics currently include the so-called “chasing-arrows” symbol—numbered 1 through 7—as a sign that the material is recyclable, even though often it is not. Of those seven, plastic bottles and jugs numbered 1 and 2 made of polyethylene terephthalate (PET) and high-density polyethylene (HDPE) are the most commonly recycled, according to a 2022 Greenpeace report that included Dell’s research. Numbers 3-7 (polyvinyl chloride, or PVC; low-density polyethylene, or LDPE; polypropylene, or PP; polystyrene, or PS; and mixtures of various plastics), are rarely, if ever, recycled, Dell said. The environmental group Californians Against Waste described SB 343 as prohibiting “the use of the chasing-arrows symbol or any other suggestion that a material is recyclable, unless the material is actually recyclable” in most communities “and is routinely sold to manufacturers to make new products.” New recycling and plastic-to-fuel technologies “have enormous adverse impacts on human health and the climate system.” The environmental groups told the FTC that it is not enough to say a plastic product is potentially recyclable. In the current plastic waste stream, only certain types of plastic bottles are actually recycled and reused again as plastic bottles. Most plastic waste, even when it contains the chasing-arrows symbol, ends up in either a landfill or an incinerator. Environmental groups are also pressing the FTC to crack down on misleading claims of “circularity,” a new industry buzzword with no widely accepted definition that is used to suggest products are repeatedly made from waste without tapping new natural resources. “The Guides should require that any ‘circular economy’ claim necessitates showing a decline or, at a minimum, a cap on virgin resource extraction, production, and product manufacturing, and an overall reduction in emissions and toxic pollution throughout the lifecycle of the material,” according to written comments from the Center for Climate Integrity, a nonprofit that works with local communities to hold oil companies accountable for climate impacts. Recycling plastics, the group argues, should not be considered circular because the plastics industry has no intention of minimizing resource extraction, and because new recycling and plastic-to-fuel technologies “have enormous adverse impacts on human health and the climate system.” For its part, ExxonMobil offered up advanced recycling as a solution to the most difficult kinds of plastics to be recycled—mixed, post-consumer wastes made of a myriad of chemicals that are often incompatible with the recycling process. “To facilitate a circular economy, it is critical that society embrace solutions that enable a broader range of plastics to be recycled and a broader segment of industry to participate,” the company wrote. “Advanced recycling provides such a solution.” The chemical industry hopes to catch a break with the FTC on advanced or chemical recycling and is advocating technical methods that it says can be used by companies to quantify how much recycled plastic is contained in new plastic products or packaging. The American Chemistry Council, a lobby group, claims in its submittal that polling suggests 88 percent of Americans consider advanced recycling to be recycling. The industry group has told the FTC its Green Guides should embrace this technology. But environmentalists and even some plastic recycling advocates are pushing back hard, saying FTC should limit environmental claims around chemical recycling or not even consider it recycling. Some are calling the chemical industry’s recycled-content accounting methods a hoax. Depending on what the FTC does, the result could give chemical recycling legitimacy or curtail certain types of recycling because environmental claims of recycled content in plastic packaging or products cannot be supported by the facts. The industry is pushing a form of advanced recycling based on a process known as pyrolysis. It heats plastic waste at high temperatures in a vessel with little or no oxygen, sometimes with a chemical catalyst, to create synthetic gases, a synthetic fuel called pyrolysis oil and a carbon char waste product. What the chemical industry is doing is “trying to deceive the American people.” “The crux of this is, if they can’t count this make-believe recycled content as recycled content, then pyrolysis is out of business,” said Dell, head of The Last Beach Cleanup and a former engineer in the oil and gas industry. With pyrolysis and a similar process known as gasification, much of the waste plastic is lost in the process, which critics have said makes it hard to describe those processes as recycling. In fact, a recent research paper from the federal government’s National Renewable Energy Lab in Colorado reported that only 1 to 14 percent of the plastic sent through those processes can be retained as plastic, though industry sources have argued those numbers are out of date. Most plastic recycled in the United States is done through a mechanical process, in which plastic waste discarded by consumers is sorted, washed and shredded before a small percentage of the waste is molded into other plastic products. Mechanical recycling produces plastic pellets that can be traced and accounted for, allowing for companies to determine what percentage of new plastic products are derived from recycled plastic. That can’t be done with chemical recycling, which mixes feedstocks made at recycling plants with virgin fossil fuel feedstocks, such as polyvinyl chloride or polyethylene. So the industry is proposing a contentious accounting method to calculate the percentage of recycled content in packaging from chemical recycling known by the arcane term, “mass balance.” A report to Congress cited “unsettled issues, ill-defined terms, and conflicting objectives” related to how recycled plastics are quantified. It’s an accounting method intended to estimate inputs and outputs from plastic waste recycling plants. “Mass balance accounting provides an important pathway for the plastics industry and major brands to track the amount of recycled material included in their products, and increase transparency for marketers and consumers,” according to the American Chemistry Council. But in a report to Congress last year, the National Institute of Standards and Technology found “many unsettled issues, ill-defined terms, and conflicting objectives with regards to the application” of mass balance calculations of plastics. And the Association of Plastic Recyclers, a group that represents recycling companies including mechanical recyclers, consumer product companies, plastic resin producers, and plastic packaging producers, urged the FTC to reject mass balance methods for estimating recycled content. Those methods provide “little to no physical traceability of recycled content compared to other chain-of-custody tracking. Consumers must trust there is actual recycled content in the actual product, and claims must be as representative of this intention as possible,” the association said. In The Last Beach Cleanup, Beyond Plastics and Greenpeace USA comments, the environmental groups say mass balance calculations can easily be manipulated. Dell said that mass balance calculations disguise the fact that only trivial amounts of chemical recycling feedstocks are being mixed with vastly larger amounts of fossil fuels feedstocks, just so companies using plastic packaging can claim products are produced with recycled content when, for all intents and purposes, they are not. “It’s a magical allocation based on bookkeeping,” she said. “It’s a hoax.” Available certification systems have weak rules and are ineffective, Dell said. “This is a brand new playground here,” she said of chemical recycling, adding that the FTC needs to get it right. What the chemical industry is doing, she said, is “trying to deceive the American people.” In a separate matter, the EPA late last month unveiled its new Draft National Strategy to Prevent Plastic Pollution, which identifies proposed actions to eliminate plastic waste from land-based sources by 2040. In it, EPA said it does not consider activities that convert plastic waste to fuels or energy production to be recycling. Further, EPA said it was concerned about environmental risks posed by impurities in pyrolysis oils generated from plastic waste recycling. The agency said it will make companies submit new pyrolysis oil chemicals for testing under the Toxic Substances Control Act prior to their approval, and then conduct ongoing testing to ensure there is no variability in the plastic waste stream that is used to generate the pyrolysis oil. A spokeswoman for Encina, the chemical recycler planning the Pennsylvania plant, said the company will comply with whatever rules on chemical recycling that the EPA requires. Hocevar, with Greenpeace, said he was encouraged to see “some positive signs from the EPA” regarding chemical recycling, a process he said will “not stand up to scrutiny.” But Judith Enck, founder and president of Beyond Plastics, said the EPA should have rejected chemical recycling outright in its draft plastic waste strategy. “It is enormously disappointing that the EPA is not slamming the door shut on every type of chemical recycling, including pyrolysis,” said Enck, a former EPA regional administrator. “EPA needs to provide actual leadership in policies that reduce the generation, use and disposal of plastics and do not prop up pyrolysis and other chemical recycling false solutions.”","filter_flag":1}
{"title":"Sustainable side-stream management in Swedish food processing companies using external actors and biogas solutions - Frontiers","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZyZnN0LjIwMjMuMTA3MzY2M9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZyZnN0LjIwMjMuMTA3MzY2M9IBAA?oc=5","id":"CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZyZnN0LjIwMjMuMTA3MzY2M9IBAA","guidislink":false,"published":"Tue, 16 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=136, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZyZnN0LjIwMjMuMTA3MzY2M9IBAA?oc=5\" target=\"_blank\">Sustainable side-stream management in Swedish food processing companies using external actors and biogas solutions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sustainable side-stream management in Swedish food processing companies using external actors and biogas solutions - Frontiers","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZyZnN0LjIwMjMuMTA3MzY2M9IBAA?oc=5\" target=\"_blank\">Sustainable side-stream management in Swedish food processing companies using external actors and biogas solutions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","source.href":"https:\/\/www.frontiersin.org","source.title":"Frontiers","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Side-stream management in food processing companies has the potential to improve sustainability performance by upcycling or managing bio-residuals into high-value products. This article investigates how food processing companies manage their side-streams by studying their sustainability reports, interviewing the companies, identifying external or internal side-stream management alternatives, and qualitatively analyzing the data. By learning more about how food processing companies prefer to manage their side-streams, it becomes easier to develop ideas for further refining of bio-residuals. One of the main results is that most of the companies prefer to use external actors for side-stream management and for processing them into high-value products, rather than developing and investing in the technology themselves. The few actors investing in side-stream management themselves have long-term strategies on how to become more sustainable and circular. This study also identifies biogas solutions through anaerobic digestion to have a special role in side-stream management due to its versatile and multifunctional nature. 1 Introduction The circular bio-economy is important as fossil products, to a larger extent, need to be replaced by bio-based ones, which means energy, nutrients, plastics, chemicals, and more need to be sourced from bio-based resources. Food production is one of the major contributors to environmental change and has a significant role in transitioning towards a more sustainable society. Recirculation of nutrients is becoming more prominent as the production of mineral fertilizers today is energy intensive and we approach phosphorus depletion (Sherwood, 2020). A focus on side-stream management within food industries can improve nutrient recovery and reduce environmental impact from the food processing company value chain. A large impact derives from agriculture and animal husbandry activities, but there is still environmental work to be done by food processing companies regarding side-streams. Sustainability strategies are important for food processing companies since customers and other stakeholders have high demands (Lozano, 2015). Commonly, packaging, transport, reducing waste, and technology improvements in industrial plants are common measures taken when food processing companies try to reduce their environmental impact. Side-streams always arise in food processing companies, and they can be managed in several ways. In this article, side-streams are defined as all flows\/streams not considered main products, thus including by-products, solid waste, and wastewater. The term side-stream is used as it gives the organic flow more value compared to calling it waste flow and is also used by practitioners (Adven, 2022; Metsä Group, n.d.2022). Value is used in this article and means benefits related to economic, environmental, societal, or business-related impacts of the side-stream management of the companies. When food processing companies manage their side-streams, they can be guided by the food waste hierarchy, following the steps of prevention, re-use, recycle, recovery, and disposal (Papargyropoulou et al., 2014), with the recent addition of upcycled food products and specific recirculation alternatives (Figure 1). FIGURE 1 FIGURE 1. Food waste hierarchy (based on the study by Moshtaghian et al., 2021). Valorization of food processing side-streams as animal feed is one of the most common practices in many settings (Otles et al., 2015). There is often potential for more high-value solutions, and side-stream management could provide an economic or environmental advantage (Garcia-Garcia et al., 2019). Legalization regarding food waste is improving, but there are still issues; for example, processed waste can be non-classified for human consumption, and thus, further development is impossible (Garske et al., 2020). The scientific literature regarding side-stream management in food industries focuses, to a large extent, on high-value products to be extracted from different food waste streams (c.f. Pfaltzgraff et al., 2013; Ravelli and Samorì, 2021), or a waste biorefinery approach (c.f. Alibardi et al., 2020; Chen et al., 2018; Dahiya et al., 2018), or the life-cycle impact of different treatment methods (c.f. Fei et al., 2022; Kobayashi et al., 2023; Xu et al., 2015). Yet, more research is needed regarding the role side-streams have in food processing companies’ sustainability strategy, business models, and if side-streams should acquire more attention than before. There are identified research gaps by Klitkou et al. (2019) and Salvador et al. (2021) regarding lack of business models for valorization of side-streams and the circular bio-economy in general. Therefore, this paper investigates if, and how, side-stream management is integrated into sustainability strategies among food processing companies and how they organize their management and use of side-streams. Sustainability strategies reflect long-term ideas for how the food processing company can reduce its environmental impact. The institutions and the food processing companies can work together to develop commercially viable processes for side-stream management according to Khedkar and Singh (2018). When it comes to the management literature, Magnusson et al. (2019) developed a framework for recovery of side-streams in manufacturing firms, and they identified four main alternatives for recovery and use of side-streams based on internal or external activities. Their article is like a bridge between this one and the field of industrial ecology and business strategy. There is more to learn from food processing industries regarding their perspective on side-streams and circularity and, especially, the side-streams seen as lower valued. Using side-streams as animal feed or for biogas solutions can mitigate global warming and recover energy and fertilizer (Hagman et al., 2020), which contributes to the development of more environmentally sustainable handling of different food side-streams and keeps valuable resources in a circular system (Scherhaufer et al., 2020). Biogas solutions include anaerobic digestion of organic streams, where biogas is produced and can be used as energy either directly, through a generator, or upgraded to fuel; in addition, a nutrient and fiber-rich digestate is produced in biogas plants, which can be used as biofertilizer (Wellinger et al., 2013), as biochar, or dried as an incineration fuel. Their other advantage is that they involve the return of nutrients to food-producing fields. There is an important role for biogas solutions to play in the transition into more bio-based synergies between industries (Medkova et al., 2019; Vanhamäki et al., 2020), not only as a bio-refining concept but also as a hub for surrounding industries (Lybæk and Kjær, 2021) and for improved nutrient recovery from digested streams (Vaneeckhaute et al., 2017). Biogas solutions are multifunctional (Lindfors et al., 2020) and versatile (Mountraki et al., 2016). This means they can have several roles in a bio-based cluster, such as waste management, wastewater management, energy provision, or fertilizer production. Biogas solutions can handle a range of diverse types of substrates and are useful even when the quality of the residuals is not high enough for feed or when materials are bulky and expensive to transport (Pereira et al., 2013). To use biogas solutions at the end of a cascading sequence, a company may improve the value of its raw material while generating products useful for its suppliers and energy for its production facility (Fagerström et al., 2018). This article aims to investigate how food processing companies manage and consider their side-streams with a special focus on biogas solutions as a management alternative. This topic will be studied in the light of sustainable strategies of the companies. The structure of the article is as follows: Section 2 provides a description of methods used; Section 3 provides the results and analysis of how the side-stream management is organized, connected to strategy, and motivated; and Section 4 provides a discussion including circularity of side-stream management and the role of biogas solutions. 2 Methods This article is based on a qualitative research approach (Bryman, 2016, chap. 17). Fifteen identified study objects from the Swedish food processing industry were asked to participate in this study, and ten of these were identified as the largest (based on turnover), according to largestcompanies.se January 2021 and, thus, covering a large part of the Swedish food market. In Sweden, the presence of large and centralized private or cooperative food processing actors is common. The remaining five were chosen as they had established biogas solutions as a side-stream management; three of these were identified by Google search using the keywords (“food processing company” +biogas + Sweden), and two were known from previous studies by the author. The study objects are chosen to assure that biogas solutions could be focused upon in the cases. 2.1 Data collection A desktop study was performed, focusing on the study objects’ websites and sustainability reports. In Figure 2, the method is illustrated. FIGURE 2 FIGURE 2. Method description regarding study objects chosen, desktop review performed, and focus areas for interviews. Following the desktop study, interviews were conducted during 2021. Within the companies, the aim was to contact sustainability managers who would have a good perspective of the company’s organization and sustainability ambition together with the business strategies, while still having some knowledge of what happens to the side-streams. In some cases, if the sustainability manager could not be reached, then perspectives of employees working with side-streams were then used together with the information from the sustainability reports. Among the 15 contacted companies, 12 chose to respond to an interview, and the results are based on these 12 companies’ responses and background information. The three non-participating companies belonged to sectors included among the other companies. The interviews were semi-structured, and after the respondents (Table 1) had introduced themselves with background and work descriptions, attention was on five focus areas: management alternatives for side-streams, biogas solutions, factors for choosing side-stream management, business strategy and collaboration, and sustainability work and organization. TABLE 1 TABLE 1. Side-streams and side-stream management for all interviewed cases are presented. In addition, information about the respondents is also included. The first results show the type of side-streams (defined by the companies themselves) and what they are used for. These results are followed by how the actors consider their side-stream management. 2.2 Data analysis The first part of the analysis, reported in Section 3.2, uses the informant’s description of their business and collaboration strategies and the sustainability reports to analyze the company’s sustainability ambitions. It looks at the company’s long-term visions, plans for circularity, and role of the environmental issues. The second part of the analysis is based on the side-stream options found at the companies, and a framework given by Magnusson et al. (2019) is applied. The framework originates from manufacturing firms and how they manage their recovered resources. They perform recovery either internally or by external actors, and the product can then be used internally or sold externally. In this paper, it is reorganized according to Figure 3. The side-stream management mapped through the interviews is categorized into this framework, and the result shows the connection between a company’s side-stream management and way of including external actors. FIGURE 3 FIGURE 3. Analysis method restructured from the work of Magnusson et al. (2019). Another analysis of the data identifies a hierarchy among the side-stream management alternatives based on responses from several actors who ranked side-stream management options in the interviews. Because of biogas solutions’ nutrient recovery and potential for circularity within the value chain, there are specific discussions regarding this as a side-stream management option and the connections to a company’s sustainability strategy. 3 Results and analysis 3.1 Descriptions of the side-stream management among the studied cases The companies participating in this study represent several types of food processing companies. In Table 1, the specific side-streams and types of management alternatives are listed. There is a range of various kinds of side-streams connected to dairies, slaughterhouses, vegetable processing, and fats, which are often used as food components, feed, or biogas solutions. Focus has been on the flows, which the companies themselves see as side-streams; for example, slaughterhouses have several products that could be considered side-streams but are commonly used as products and are, therefore, not included. The results are based on activities in Sweden. Actors with activities in other countries mention that the circularity has not been prioritized, partly because landfilling is a cheap alternative, but food donations are also more common in these countries. 3.2 Results and analysis of sustainability and business strategies within the companies The business strategy is to produce food and generate returns for shareholders. Side-streams are not prioritized among most food processing companies. Their sustainability strategies focus on reducing CO 2 emissions by using fossil-free fuels and energy sources, energy efficiency measures, and smarter packaging. The main driver for this is the increased pressure from consumers and stakeholders. The studied companies have worked for a few years on improving their own climate emissions, and, recently, several of them have set up science-based targets, which are in line with the Paris 2015 agreement (Science Based Targets, 2022). They address the full value chain’s sustainability impact, and the results show that approximately 90% of the value chain’s impact is in the food-producing stage according to several respondents. The studied companies identify that collaboration with upstream partners or reducing food losses are other keys to improve the value chain’s sustainability. Other aspects discussed in company groups with activities outside Sweden are water quality and security. Upcycling side-streams into food products is also becoming more interesting; because some of the actors in this category have a wider range of products, the development potential for new food from side-streams is easier. Secondary products, which earlier could be sold at the local industrial plant, can now be sold as specific products, marketed to improve resource efficiency, on the regular market. The author can identify two ambition levels regarding the companies’ sustainability strategies, based on information from interviews and sustainability reports. Some actors work with sustainability because customer demand has increased, but their main aim is to generate more money for their shareholders. Others invest large amounts of money in improving circularity and product development, as they see a need to work with this question for the environment’s sake, although economic results are still important. When the companies in the first category discuss sustainability strategies for side-streams, economical, climate-related, high-value, and organizational aspects are in focus. The economical aspect is prioritized for these companies, and sustainable action is becoming more justified with more economic reasoning than a decade ago. Most actors are reactive to the stakeholders and changes in society demanding sustainable products and improved animal welfare. One company has not had high stakeholder and customer demands and noticed that its sustainability work lagged behind. Most of the companies find sustainability important and high on their agenda, yet they connect reduced climate impact with the possibility to reduce costs or market themselves. Circularity is not always an integrated strategy for these companies, but they are moving in that direction. The organization for sustainability in these companies differs; some have a group of people, others have sustainability managers who are putting the responsibility on plant managers, and others try to integrate sustainability in everyday work. When the companies in the second category talk about strategies for side-streams, they work proactively to ensure sustainable operation in the future. Sustainable investments can be more expensive, as it becomes a competitive advantage. One company uses two investment budgets, one for long-term projects with a sustainability focus allowing a pay-off of 10–15 years and a regular one. Another company, family-owned, allows longer pay-off times compared to regular projects with only 3–5 years pay-off. Several actors in this category point out that customers and partners need to accept sustainable products cost more because they require higher investments and work intensity. The companies are working with this aim to integrate sustainability into the whole company and educate their employees on how to think and act. They monitor their side-streams to be able to identify further valorization alternatives for the streams. They mention that stubbornness is important to see change, as sustainability actions can be slow to get through. Most of these companies market their solutions very little; they are mentioned on websites and in sustainability reports, but some just see it as a natural way to work and have not considered it a unique selling point. 3.3 Analysis of side-stream management among food processing companies The prioritization among interviewed actors is to reduce side-streams and ensure that fewer side-streams are generated. After that, it is preferred to either partner with external companies or invest in technology themselves regarding high-value components, like xylitol, or new food products. New food products could include sales of secondary products or side-streams refined into new products. The will to invest in innovative technology for side-streams is low, and most actors prefer if external actors want to buy the side-streams for further valorization; this is often true for lower-valued solutions. An example was a company with beetroot juice, which could be further refined to coloring additives, but the food processing company did not want the investment and no external actor was found. The choice of management for their side-streams can depend on the communication value of the solution. High-value components or new food products can be good to communicate or as feed, and biogas solutions can be communicated as local and circular options. There are other reasons why an option is chosen; one company mentioned that a side-stream they wanted to use as feed required quality analysis to be approved, and as soon as it was approved, they were not eager to change management alternatives as they had paid for the tests to use it as feed. The most important factor for the food processing companies is that side-streams do not end up in incinerators or landfills. The management alternative can come with a risk as well. The demand for slaughter wastes as feed for the fur industry disappeared overnight when Denmark killed all their ferrets during the COVID-19 pandemic. It was a side-stream market in decline, so options like salmon feed and biogas production had been identified, but it was problematic to change with such short notice. It is common for food processing companies to be aware of and follow the food waste hierarchy. Figure 4 shows how food processing companies in general have chosen to recover their side-streams and how they use the recovered product. A company can appear in several squares, as they may have several side-streams and management alternatives. FIGURE 4 FIGURE 4. This figure illustrates how the studied companies manage their side-streams in relation to external or internal actors for the recovery of side-streams and use of recovered products. Open solutions are applied in all case companies on one or several side-streams. This option is driven by economic benefits, focusing on core business and a smooth solution. The food processing companies claim that those best suited to valorization should ensure it. Sustainability strategies have a role in open cases where higher valorization by an external actor is preferred. Business-related advantages with open solutions are that uncertainties are put to the external actors, as they make the necessary investments and manage the sales and marketing, and the food processing company can focus on ensuring that the operation runs smoothly with their external partners and that they stay in business (Magnusson et al., 2019). For food processing companies with large (often liquid) flows, alternatives which can manage the full volume are preferred to have long-term contracts with, such as biogas solutions. The open strategy depends on potential products produced from the side-stream, how much additional processing is needed, and how long transportation is required to valorize the side-stream. In open systems, biogas solutions are useful in local settings with short transportation or distribution through pipes. Depending on the distance, the income from biogas solutions is low for the food processing company; instead, values from regional development, reduced transportation, nutrient recirculation, and sustainability strategies are arguments for biogas solutions in open systems. The food processing company can sign long-term contracts with one side-stream actor who manages the side-streams in different parts of the country, and they can then get invoices and data directly from that company, which facilitates the side-stream management that can require significant paperwork for the food processing company due to reporting demands. The side-streams are monitored monthly and followed up on to see where further improvements are possible. Outsourcing among all the studied cases includes a biogas component. There is an internal energy demand in the production plant which can be replaced by biogas, but they do not have the capacity to produce the biogas themselves, so they deliver side-streams for biogas production and buy the produced gas. This seems common when there is a local biogas plant, and the food processing company has goals to replace fossil fuels and reduce CO 2 emissions. It requires long-term agreements to reduce uncertainty regarding deliveries in these setups as the food processing company is extending its value chain (Magnusson et al., 2019). The food processing industry’s side-stream volumes may be too small to invest in a biogas production facility itself, and so prefer to buy gas from a co-digestion plant. The business value lies in improving sustainability performance by using biogas instead of fossil fuels. Diversification is chosen by actors who have side-streams through which they recover or upgrade to food products in four cases and oleochemical products in the fifth. In those cases, the upgraded product lies within their business strategy: “to produce high-value food products or fatty products.” They are not moving outside their business idea by refining these products. These companies see a value in their side-streams and integrate them into the business strategy because they become products that are easy to incorporate into the overall business strategy. The sustainability aspect of this alternative is important, as food is a prioritized product for a food processing company, and it reduces the need for other food products. Drivers for these solutions are either economical or part of the sustainability strategy. One company invested in technology to extract a high-value sweetener component, as the economic performance would improve and because the circular economy discourse in society inspired them to develop new products. By diversifying and creating new products from side-streams, new markets may open to the food processing company, but it comes with additional costs for technology, marketing, and potentially sales (Magnusson et al., 2019). Closed arrangements are applied by companies recovering their own side-streams and are often used for internal energy purposes. These solutions are common in wastewater streams or when flows of by-products are large, and the produced gas has enough value to replace external energy. In four cases, biogas solutions are used as a closed system, and the final alternative is bio-oil for energy. These companies have made the investment to become more self-sufficient in energy. The companies could save money by producing energy from internal waste or wastewater flows and cost reduction is a motive for change (c.f. Van Beers et al., 2007). It was important for some of the actors to produce their own energy and reduce their climate impact. Two of the companies find the circularity of nutrients important, as they either have their own farm to fertilize or collaborate with farmers. Closed systems are useful if the company has internal needs for the recovered products and is willing to invest in technology for recovery (Magnusson et al., 2019). 3.4 Hierarchy of side-stream management Improving resource efficiency implies that the food industries need to prioritize how to manage their side-streams. Based on the responses from the case studies, a hierarchy within food side-streams can be constructed (Figure 5), which is more specific in the re-use, recycle, and recovery steps in the food waste hierarchy compared to earlier examples (Papargyropoulou et al., 2014; Moshtaghian et al., 2021). It is illustrated as a staircase rather than a pyramid since volumes going into different treatments can vary, and large volumes of low-quality side-streams can be diverted to steps further down the hierarchy. Another difference is that anaerobic digestion is equal to feed, which in other hierarchies is often ranked lower (Papargyropoulou et al., 2014; Moshtaghian et al., 2021). Still, higher-value products should be prioritized, and biogas solutions can often manage side-streams originating from these upcycled products. FIGURE 5 FIGURE 5. Hierarchy among side-stream management alternatives ranging from high-value chemicals to food, bioenergy, and feed. To a large degree, the staircase hierarchy focuses on economic factors; higher-ranked options, for example, pay better. The options that are the hardest to separate among the respondents in this stair-based hierarchy are the feed and biogas alternatives (circled in Figure 3), which are often the main competitors for lower-quality residuals that are not fit for human consumption. Which one of these is chosen is related to the availability of the local actors. Biogas solutions have the advantage of handling larger volumes than most feed customers do. Biogas solutions are chosen instead of feed if the company desires to produce its own energy or when agricultural actors are already collaborating with the food processing company, and the biofertilizer is valuable to them; otherwise, feed is the chosen option. 4 Discussion 4.1 Implementation of sustainable side-stream management According to the interviews, side-streams did not have a prominent role in business or sustainability strategies among the food companies a decade ago, but with the growing discourse about circular economy, the interest increased, which was also put forward by Kähkönen and Lintukangas (2022). The companies find it attractive to be a part of a circular system instead of a linear one, both from a financial and market perspective. The side-stream management can be inspired by other actors in the same sector, and the Swedish Food Federation is working more actively with improving sustainability among their members (Swedish Food Federation, 2019). One case study, which has been in action for generations, has ambitious sustainability plans to assure the company will survive for many more generations. Ferreira et al. (2021) also suggested that family businesses have more long-term perspectives compared to competitors in their area, indicating higher sustainability ambitions than others. Klein et al. (2022) studied agri-food companies handling potatoes and concluded that the industry needs to reform their business model to become more sustainable and see side-streams as a value rather than a waste, but this transformation is affected by both internal and external factors, and they also identified external partnerships as important in the development. Klein et al. (2022) put the finger on what this article will show: business models need to be thought through to improve sustainability in these value chains and external partners are important to assure a sustainable use of side-streams. Research focusing on business models regarding side-streams in the agri-food sector is not common, but this article can strengthen the results of Klein et al. (2022), as multiple cases show comparable results. Actors preferring internal recovery of their side-stream often do so when new food products can be produced out of a side-stream. Magnusson et al. (2019) showed that valorizing side-streams internally can be tempting but hard, as it requires investments and comes with a risk. Deciding what kind of products should be produced from the side-stream can be hard; in scientific literature, there are a large number of articles focusing on bioenergy recovery rather than higher-valued physical products according to Jones et al. (2022). The organization around the side-stream management, therefore, needs to be assessed, and Lybæk and Kjær (2021) identified biogas solutions to be an attractive hub for circularity in a region rather than a component at biorefineries to improve circularity. Lybæk and Kjær (2021) demonstrated that agricultural residuals can be managed in a more circular way by extracting high-value products like wax and furfural substrates and that a biogas plant would function as a hub among the refining actors. These actors are typically small but can contribute with simple biorefinery modules in a region. The idea is to combine product development from side-streams but also recovery energy. Business models for circular economy may inspire food processing companies on how to manage their side-streams. Similar to the work of Lybæk and Kjær (2021), an article by Tsvetkova and Gustafsson (2012) points out the modular approach, where actors surrounding biofuel production plants, in their case, support the main actor with distinct functions, creating a bio-based local system that is reliable and persistent. The circular approach is driven by the close collaboration within the value chain, and biogas solutions are useful when the side-streams’ quality is low, and nutrients can be recovered locally according to the work of Feiz et al. (2021). Biomass production, nutrient flows, and energy use are interlinked, and biogas solutions could provide options for improving nutrient recycling as well as allowing for bioenergy production, which does not compete with food production (Koppelmäki et al., 2021). Partnerships, value creation, and circularity play important roles when choosing internal recovery of side-streams among the studied cases. Partners that manage side-streams are often found locally, and several actors highlight the local circularity as important for their choice. This is in line with the work of Feiz et al. (2021) who identified local development to have a role in bio-based clusters with biogas solutions. While some see their side-stream partners as part of the business strategy, others focus on the economic value where the partners help in valorizing side-streams and food industry companies can focus on their core business. High-value components are investigated to improve circularity and income, and several actors in this study have started to look at biochar from their carbon-rich side-stream. Biochar is a way of improving carbon storage in soils (Lehmann et al., 2011). The implications of these results show how a more resource efficient management of side-streams will be developed and what arguments are brought forward for different alternatives among practitioners. It can impact what strategies food processing companies will have when they need to find higher-valued uses of their side-streams. The results are useful in places where large food processing companies are common, where similar business strategies are applied, and where the management of bio-based waste is regulated in some way. 4.2 Role of biogas solutions Food processing companies need to work with the full value chain to ensure sustainable practices; this includes cascading and upcycling between products and energy solutions. Biogas can be a suitable finish in a resource-efficient bio-economy (Hagman et al., 2018). Lyng et al. (2018) observed that biogas solutions are well integrated in a value chain and improve the sustainability performance of the system. In one of the cases studied in this article, a food processing company has close collaboration with the delivering farms; it sees value in delivering biofertilizer back to these farmers, which will reduce the overall environmental impact when replacing mineral fertilizers or reduce costs compared to other organic approved fertilizers. Even if side-streams should be avoided and high-value products prioritized according to Lybæk and Kjær (2021), the role of biogas solutions is to connect the farmers producing the food with the processing companies refining the products, creating a truly circular system thanks to the nutrient recovery (Carey et al., 2016; Vaneeckhaute et al., 2017). This study shows that a beneficial solution can be used to combine manure-based biogas plants at farms with input from low-value side-streams from the food processing companies, as short transportation distances were preferred among the respondents. The results from Feiz et al. (2021) showed that nutrient recovery improved and transportation was reduced when applying biogas solutions compared to other alternatives, which may be of importance when food industries choose the management option. Other options for biogas solutions are when no higher-valued solutions can be identified, or the high-value extraction results in low-value side-streams, or if alternatives are too costly to perform due to transportation, or if circularity is important and the nutrient recovery is prioritized. Fagerström et al. (2018) suggested that a company may improve the value of its raw material while generating products useful for its suppliers and energy for its production facility through biogas solutions. That is in line with the results from the respondents in this article as well but the diversity of solutions that can potentially be realized from a biogas solution is not considered among most of the companies. Instead, few companies bring up the nutrient and fiber aspect when recovering side-streams. The nutrient question may not be so high on their agenda as climate impact and CO 2 emissions are the priority among most companies and perhaps the nutrient issue is not well known. It is worth noting that composting, a nutrient recovery option, was not mentioned as an alternative among any food processing company in the study. The nutrient issue has become more pressing lately and will most likely be considered more in the future. The nutrient aspect of sustainable side-stream management in food processing companies should be further explored. Biogas solutions have long been viewed as an energy recovery step that is often far down in the food waste hierarchies by Moshtaghian et al. (2021) and Papargyropoulou et al. (2014). This article shows that biogas solutions have a natural role in the food processing company’s side-stream management because of the additional possibility to recover nutrients and its versatile nature. When food waste cannot be avoided, Stone et al. (2019) identified further valorization to increase a company’s resilience. With these results, the biogas sector can better understand what customers are looking for when comparing, for example, feed options and biogas options. Transportation distance, payment, and connection to farmers in need of digestate are reasons to choose biogas solutions over feed options. This can help them in choosing market strategies and their customer relations. 5 Conclusion This article focuses on the strategic role of side-stream management in food processing industries. The interviewed Swedish companies are good at valorizing their side-streams, but there is potential to create more value. If external actors are available, food processing companies prefer external management rather than investing in innovative technology themselves, developing into a biorefinery. With this knowledge, local networks to valorize food processing side-streams can be developed. The results from this article add to the existing literature an insight that side-stream management can be organized in several ways and that food processing companies often prefer external actors to manage their side-streams, which is in line with earlier research. However, more information on the characteristics of partnerships and interactions is needed to make more conclusive statements. Companies with a circular approach in their sustainability strategy regarding their side-stream management seem to be more active in identifying new alternatives and accepting long-term investments. Embracing the side-stream management has the potential to improve sustainability, resource efficiency, and the value for the company. When high-value products and new food products are extracted from the side-streams, the remaining fraction is often suited for a biogas solution to recover its energy and nutrients. If food processing companies work more within their own value chain, biogas solutions can improve sustainability performance for the agricultural actors in the value chain by using digestate as fertilizer to a higher degree. In future studies, there can be a focus on how these systems will become more resource efficient either through developing an internal biorefinery processer or using external actors to continue processing the materials, how different alternatives can be facilitated, and what factors are relevant for either method to develop (Budzianowski, 2017; Venkata Mohan et al., 2019). Data availability statement The original contributions presented in the study are included in the article\/Supplementary Material; further inquiries can be directed to the corresponding author. Author contributions The author confirms being the sole contributor of this work and has approved it for publication. Acknowledgments The author wants to thank her supervisors Mats Eklund and Niclas Svensson for the support in the work of this article. She is grateful for the funding received for this research through the Biogas Research Center by the Swedish Energy Agency, companies, and municipalities involved. She also wants to thank the reviewers who helped to improve this article. Conflict of interest The author declares that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors, and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References Adven, (2022). Material and side stream recovery and processing. Available at: https:\/\/adven.com\/solutions-industries\/material-and-side-stream-recovery-and-processing\/([WWW Document]. Adven. URL accessed 15 2, 22). Google Scholar Bryman, A. (2016). Social research methods. Oxford, United Kingdom: Oxford University Press. Google Scholar Budzianowski, W. M. (2017). High-value low-volume bioproducts coupled to bioenergies with potential to enhance business development of sustainable biorefineries. Renew. Sustain. Energy Rev. 70, 793–804. doi:10.1016\/j.rser.2016.11.260 CrossRef Full Text | Google Scholar Fagerström, A., and Murphy, J. D. (2018). “IEA bioenergy task 37,” in The role of anaerobic digestion and biogas in the circular economy (Paris, France: IEA Bioenergy Programme). Google Scholar Fei, X., Jia, W., Chen, T., and Ling, Y. (2022). Life cycle assessment of food waste anaerobic digestion with hydrothermal and ionizing radiation pretreatment. J. Clean. Prod. 338, 130611. doi:10.1016\/j.jclepro.2022.130611 CrossRef Full Text | Google Scholar Feiz, R., Larsson, M., Ekstrand, E.-M., Hagman, L., Ometto, F., and Tonderski, K. (2021). The role of biogas solutions for enhanced nutrient recovery in biobased industries—Three case studies from different industrial sectors. Resour. Conservation Recycl. 175, 105897. doi:10.1016\/j.resconrec.2021.105897 CrossRef Full Text | Google Scholar Ferreira, J. J., Fernandes, C. I., Schiavone, F., and Mahto, R. V. (2021). Sustainability in family business – a bibliometric study and a research agenda. Technol. Forecast. Soc. Change 173, 121077. doi:10.1016\/j.techfore.2021.121077 CrossRef Full Text | Google Scholar Garcia-Garcia, G., Stone, J., and Rahimifard, S. (2019). Opportunities for waste valorisation in the food industry – a case study with four UK food manufacturers. J. Clean. Prod. 211, 1339–1356. doi:10.1016\/j.jclepro.2018.11.269 CrossRef Full Text | Google Scholar Garske, B., Heyl, K., Ekardt, F., Weber, L. M., and Gradzka, W. (2020). Challenges of food waste governance: An assessment of European legislation on food waste and recommendations for improvement by economic instruments. Land 9, 231. doi:10.3390\/land9070231 CrossRef Full Text | Google Scholar Hagman, L., Blumenthal, A., Eklund, M., and Svensson, N. (2018). The role of biogas solutions in sustainable biorefineries. J. Clean. Prod. 172, 3982–3989. doi:10.1016\/j.jclepro.2017.03.180 CrossRef Full Text | Google Scholar Hagman, L., Eklund, M., and Svensson, N. (2020). Assessment of by-product valorisation in a Swedish wheat-based biorefinery. Waste Biomass Valor 11, 3567–3577. doi:10.1007\/s12649-019-00667-0 CrossRef Full Text | Google Scholar Jones, R. E., Speight, R. E., Blinco, J. L., and O’Hara, I. M. (2022). Biorefining within food loss and waste frameworks: A review. Renew. Sustain. Energy Rev. 154, 111781. doi:10.1016\/j.rser.2021.111781 CrossRef Full Text | Google Scholar Kähkönen, A.-K., and Lintukangas, K. (2022). Towards sustainable supply strategy in the food industry: The case of Finland. Br. Food J. 124, 143–164. doi:10.1108\/BFJ-03-2021-0257 CrossRef Full Text | Google Scholar Khedkar, R., and Singh, K. (2018). “Food industry waste: A panacea or pollution hazard?,” in Paradigms in pollution prevention, SpringerBriefs in environmental science. Editor T. Jindal (Berlin, Germany: Springer International Publishing), 35–47. CrossRef Full Text | Google Scholar Klein, O., Nier, S., and Tamásy, C. (2022). Circular agri-food economies: Business models and practices in the potato industry. Sustain Sci. 17, 2237–2252. doi:10.1007\/s11625-022-01106-1 CrossRef Full Text | Google Scholar A. Klitkou, A. M. Fevolden, and M. Capasso (Editors) (2019). From waste to ValueValorisation pathways for organic waste streams in circular bioeconomies (London, United Kingdom: Routledge). Google Scholar Koppelmäki, K., Helenius, J., and Schulte, R. P. O. (2021). Nested circularity in food systems: A nordic case study on connecting biomass, nutrient and energy flows from field scale to continent. Resour. Conservation Recycl. 164, 105218. doi:10.1016\/j.resconrec.2020.105218 CrossRef Full Text | Google Scholar Lehmann, J., Rillig, M. C., Thies, J., Masiello, C. A., Hockaday, W. C., and Crowley, D. (2011). Biochar effects on soil biota - a review. Soil Biol. Biochem. 43, 1812–1836. doi:10.1016\/j.soilbio.2011.04.022 CrossRef Full Text | Google Scholar Lindfors, A., Gustafsson, M., Anderberg, S., Eklund, M., and Mirata, M. (2020). Developing biogas systems in Norrköping, Sweden: An industrial symbiosis intervention. J. Clean. Prod. 277, 122822. doi:10.1016\/j.jclepro.2020.122822 CrossRef Full Text | Google Scholar Lybæk, R., and Kjær, T. (2021). Biogas technology as an “engine” for facilitating circular bio-economy in Denmark—the case of lolland & falster municipalities within region zealand. Front. Energy Res. 9. doi:10.3389\/fenrg.2021.695685 CrossRef Full Text | Google Scholar Lyng, K.-A., Stensgård, A. E., Hanssen, O. J., and Modahl, I. S. (2018). Relation between greenhouse gas emissions and economic profit for different configurations of biogas value chains: A case study on different levels of sector integration. J. Clean. Prod. 182, 737–745. doi:10.1016\/j.jclepro.2018.02.126 CrossRef Full Text | Google Scholar Magnusson, T., Andersson, H., and Ottosson, M. (2019). Industrial ecology and the boundaries of the manufacturing firm. J. Industrial Ecol. 23, 1211–1225. doi:10.1111\/jiec.12864 CrossRef Full Text | Google Scholar Medkova, K., Vanhamäki, S., and Snell, J. (2019). Bio-based circular economy action plan sets the future steps in päijät-häme. Lille, France: BIOREGIO project,Interreg Europe. Google Scholar Metsä Group, n. d. (2022). From side streams to new products. Available at: https:\/\/www.metsagroup.com\/en\/media\/Pages\/Case-From-side-streams-to-new-products.aspx ([WWW Document] URL accessed 10 2, 22). Google Scholar Moshtaghian, H., Bolton, K., and Rousta, K. (2021). Challenges for upcycled foods: Definition, inclusion in the food waste management hierarchy and public acceptability. Foods 10, 2874. doi:10.3390\/foods10112874 PubMed Abstract | CrossRef Full Text | Google Scholar Mountraki, A., Tsakalova, M., Panteli, A., Papoutsi, A. I., and Kokossis, A. C. (2016). Integrated waste management in multiproduct biorefineries: Systems optimization and analysis of a real-life industrial plant. Industrial Eng. Chem. Res. 55, 3478–3492. doi:10.1021\/acs.iecr.5b03431 CrossRef Full Text | Google Scholar Otles, S., Despoudi, S., Bucatariu, C., and Kartal, C. (2015). “Chapter 1 - food waste management, valorization, and sustainability in the food industry,” in Food waste recovery. Editor C. M. Galanakis (San Diego, United States: Academic Press), 3–23. CrossRef Full Text | Google Scholar Papargyropoulou, E., Lozano, R., Steinberger, K. J., Wright, N., and Ujang, Z. B. (2014). The food waste hierarchy as a framework for the management of food surplus and food waste. J. Clean. Prod. 76, 106–115. doi:10.1016\/j.jclepro.2014.04.020 CrossRef Full Text | Google Scholar Pereira, C. P. P., Slingerland, M. A., Lier, J. B., and Rabbinge, R. (2013). “Anaerobic digestion as a key technology for biomass valorization: Contribution to the energy balance of biofuel chains,” in The biogas handbook: Science, production and applications (Sawston, United Kingdom: Woodhead Publishing), 166–188. Google Scholar D. Ravelli, and C. Samorì (Editors) (2021). Biomass valorization: Sustainable methods for the production of chemicals (Weinheim, Germany: Wiley VCH). Google Scholar Salvador, R., Puglieri, F. N., Halog, A., Andrade, F. G. D., Piekarski, C. M., and De Francisco, A. C. (2021). Key aspects for designing business models for a circular bioeconomy. J. Clean. Prod. 278, 124341. doi:10.1016\/j.jclepro.2020.124341 CrossRef Full Text | Google Scholar Scherhaufer, S., Davis, J., Metcalfe, P., Gollnow, S., Colin, F., De Menna, F., et al. (2020). Environmental assessment of the valorisation and recycling of selected food production side flows. Resour. Conservation Recycl. 161, 104921. doi:10.1016\/j.resconrec.2020.104921 CrossRef Full Text | Google Scholar Science Based Targets, (2022). Ambitious corporate climate action. Available at: https:\/\/sciencebasedtargets.org\/([WWW Document]. Science Based Targets URL accessed 30 6, 22). Google Scholar Stone, J., Garcia-Garcia, G., and Rahimifard, S. (2019). Development of a pragmatic framework to help food and drink manufacturers select the most sustainable food waste valorisation strategy. J. Environ. Manag. 247, 425–438. doi:10.1016\/j.jenvman.2019.06.037 PubMed Abstract | CrossRef Full Text | Google Scholar Swedish Food Federation, (2019). Sustainability manifesto. Athina, Greece: AEGEE. Google Scholar Tsvetkova, A., and Gustafsson, M. (2012). Business models for industrial ecosystems: A modular approach. J. Clean. Prod. 29 (30), 246–254. doi:10.1016\/j.jclepro.2012.01.017 CrossRef Full Text | Google Scholar Van Beers, D., Corder, G., Bossilkov, A., and Van Berkel, R. (2007). Industrial symbiosis in the Australian minerals industry: The cases of Kwinana and Gladstone. J. Industrial Ecol. 11, 55–72. doi:10.1162\/jiec.2007.1161 CrossRef Full Text | Google Scholar Vaneeckhaute, C., Lebuf, V., Michels, E., Belia, E., Vanrolleghem, P. A., Tack, F. M. G., et al. (2017). Nutrient recovery from digestate: Systematic technology review and product classification. Waste Biomass Valor 8, 21–40. doi:10.1007\/s12649-016-9642-x CrossRef Full Text | Google Scholar Vanhamäki, S., Virtanen, M., Luste, S., and Manskinen, K. (2020). Transition towards a circular economy at a regional level: A case study on closing biological loops. Resour. Conservation Recycl. 156, 104716. doi:10.1016\/j.resconrec.2020.104716 CrossRef Full Text | Google Scholar Venkata Mohan, S., Dahiya, S., Amulya, K., Katakojwala, R., and Vanitha, T. K. (2019). Can circular bioeconomy be fueled by waste biorefineries — a closer look. Bioresour. Technol. Rep. 7, 100277. doi:10.1016\/j.biteb.2019.100277 CrossRef Full Text | Google Scholar A. Wellinger, J. Murphy, and D. Baxter (Editors) (2013). The biogas handbook: Science, production and applications (Sawston, United Kingdom: Woodhead). Google Scholar","filter_flag":1}
{"title":"PureCycle Technologies' Born Digital Innovative Plastic Recycling Plant - Automation.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LmF1dG9tYXRpb24uY29tL2VuLXVzL2FydGljbGVzL21heS0yMDIzL3B1cmVjeWNsZS10ZWNobm9sb2dpZXMtYm9ybi1kaWdpdGFsLXJlY3ljbGluZ9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LmF1dG9tYXRpb24uY29tL2VuLXVzL2FydGljbGVzL21heS0yMDIzL3B1cmVjeWNsZS10ZWNobm9sb2dpZXMtYm9ybi1kaWdpdGFsLXJlY3ljbGluZ9IBAA?oc=5","id":"CBMiYGh0dHBzOi8vd3d3LmF1dG9tYXRpb24uY29tL2VuLXVzL2FydGljbGVzL21heS0yMDIzL3B1cmVjeWNsZS10ZWNobm9sb2dpZXMtYm9ybi1kaWdpdGFsLXJlY3ljbGluZ9IBAA","guidislink":false,"published":"Fri, 19 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=139, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LmF1dG9tYXRpb24uY29tL2VuLXVzL2FydGljbGVzL21heS0yMDIzL3B1cmVjeWNsZS10ZWNobm9sb2dpZXMtYm9ybi1kaWdpdGFsLXJlY3ljbGluZ9IBAA?oc=5\" target=\"_blank\">PureCycle Technologies' Born Digital Innovative Plastic Recycling Plant<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Automation.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"PureCycle Technologies' Born Digital Innovative Plastic Recycling Plant - Automation.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LmF1dG9tYXRpb24uY29tL2VuLXVzL2FydGljbGVzL21heS0yMDIzL3B1cmVjeWNsZS10ZWNobm9sb2dpZXMtYm9ybi1kaWdpdGFsLXJlY3ljbGluZ9IBAA?oc=5\" target=\"_blank\">PureCycle Technologies' Born Digital Innovative Plastic Recycling Plant<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Automation.com<\/font>","source.href":"https:\/\/www.automation.com","source.title":"Automation.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Summary PureCycle Technologies' mission is to transform plastic waste into an infinitely sustainable material ending the culture of single-use plastic and created to truly circular economy. PureCycle Technologies' Born Digital Innovative Plastic Recycling Plant James Haw PE, PMP, CMRP, vice president, Program Management & Digital Strategy at PureCycle Technologies described applying digitalization from the ground up in new plastic recycling facilities at the 27th Annual ARC Industry Forum. PureCycle Technologies' mission is to transform plastic waste into an infinitely sustainable material ending the culture of single-use plastic and created to truly circular economy. Today’s plastic recycling methods yield low value resins only fit for limited applications such as a park bench, trashcan and deck boards. It can’t be used in all the original use cases to create plastic products. A fundamental concept he continually emphasized is using digitalization providing the tools empowering people to do their job more effectively and concentrate on high value added tasks.James Haw has more than 30 years of automation, instrumentation and electrical engineering experience in many industries, including oil & chemical. Haw described how PureCycle Technologies is changing the game when it comes to plastic waste, noting you may not know what polypropylene plastic is, but you use it every day, and the waste is mostly goes unrecycled, often ending up in our oceans and environment. The PureCycle is changing this yielding a resin using a patented process designed to transform polypropylene plastic waste (designated as No. 5 plastic) into a continuously renewable resource. The company’s process takes polypropylene plastic waste and purifies it, washing and scrubbing it at the molecular level creating ultra-pure recycled (UPR) resin. PureCycle resin is a like-virgin material, easily colorable, and is not only 100% recyclable, but also projected to use approximately 79% less energy than virgin resin. It’s also projected to release 35% fewer carbon emissions than new polypropylene manufacturing, further substantiating its sustainability benefits. Born digital architecture Haw emphasized since these are new facilities they are “Born Digital like a planned community.\" All aspects of the production facility and business are fully digitized from the beginning with a common data lake. This includes all systems that contribute to and draw from the data lake whether on premise or cloud hosted including process automation, maintenance, engineering, operations, HSSE (Health, Safety, Security & Environment), building automation and business systems. Digital design from the ground up provides a great number of features and empowers employees with information to work more efficiently and effectively. Employees use mobile devices, including tablet computers and RealWear hands-free, assisted reality headsets that incorporate front facing high definition camera, audio, and visual information from plant systems. The RealWear lens provides mobility and ability to work with remote experts in addition to providing users with information at their fingertips. Watch the hands-free, assisted reality headsets video. Mobile worker use cases User virtually touch a pipe with the headset and the system displays the real-time data direction of flow, temperature, flow rate, any data that is in the Emerson Delta V system. Additionally, the user can call up any documentation including P&ID diagrams. Maintenance people wearing a headset can virtually touch any device such as a motor and will be provided visually information including every part the bills replaceable without having to remove the equipment and send it off for repair. The user could also see information about the make and model of every repair part available on-site. “I don’t have maintenance technicians going back and researching, searching on Google, and calling suppliers such as Emerson asking what part do I need?” Maintenance processes are fully digitized, empowering maintenance technicians in the field with tablet computers to interact with the systems including access to all information and the ability to create work orders in the plant as they walking around inspecting equipment. When a maintenance technician needs a permit for example to remove a valve they click an icon that informs the operator of everything they need to lockout without having to look up reference information. “This eliminates the possibility of missing something that would put someone in harm’s way,\" he said. This information is all tied into the digital twin and operators immediately see any work being done, the people working on it and estimated completion time. Digital twin The digital twin ties in every system including Maintenance System (CMMS), engineering system, Operations System, creating one single version of the truth. “Having more than one version of the truth creates confusion in your business, you have to have everyone working from the same version of the truth to make effective decisions,\" Haw noted. Health, safety, security and environment digitalization The plant has integrated digital into Health, Safety, Security, and Environment (HSEE) incorporating a network of video cameras, employee electronic fobs grading system awareness and alerts for unexpected people movements. For example, if a person activates a safety shower, we know who the person is in the exact location and dispatch people out to help. All of the companies Layer of Protection Analysis (LOPA), Process Hazard Analysis (PHA), is done in an exSILentia system. Engaging employees James Haw discussed how digitalization is expected throughout the organization from plant people to executives that understand the benefits of superior technology in their personal lives observing, “In the old days all the great technology was at work, and we didn’t have great technology at home,\" Haw said. “Now we have great technology at home and not so great technology at work.” To attract talent, the user experience must be digital. Remote Visibility “Born Digital” allows the company to view and monitor operations anywhere in the world seeing the same information that plant control rooms have from a Central Control room in Orlando, Florida including viewing all on-site video cameras. The company has plans to build other plants in Europe and Asia that can all be monitored from the Central Control room in Orlando, Florida. Thoughts and observations: Digitalization business strategy PureCycle building new plants from the ground up has the advantage of a complete digital design, which leverages technology to create highly efficient and competitive production. Existing plants have a different investment dynamic that many times lead to continuous improvement rather than digital transformation which has a potential for these companies to become unprofitable with declining sales. Not transforming production is betting on the incompetence of competitors. This can be extremely dangerous for the future of a company, leading to loss of business and jobs. About The Author Bill Lydon brings more than 10 years of writing and editing expertise to Automation.com, plus more than 25 years of experience designing and applying technology in the automation and controls industry. Lydon started his career as a designer of computer-based machine tool controls; in other positions, he applied programmable logic controllers (PLCs) and process control technology. Working at a large company, Lydon served a two-year stint as part of a five-person task group, that designed a new generation building automation system including controllers, networking, and supervisory & control software. He also designed software for chiller and boiler plant optimization. Bill was product manager for a multimillion-dollar controls and automation product line and later cofounder and president of an industrial control software company.","filter_flag":1}
{"title":"Sustainable Technologies Reprocessing Medical Devices To Reduce Healthcare's Carbon Footprint And Drive Cost ... - Med Device Online","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMinQFodHRwczovL3d3dy5tZWRkZXZpY2VvbmxpbmUuY29tL2RvYy9zdXN0YWluYWJsZS10ZWNobm9sb2dpZXMtcmVwcm9jZXNzaW5nLW1lZGljYWwtZGV2aWNlcy10by1yZWR1Y2UtaGVhbHRoY2FyZS1zLWNhcmJvbi1mb290cHJpbnQtYW5kLWRyaXZlLWNvc3Qtc2F2aW5ncy0wMDAx0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMinQFodHRwczovL3d3dy5tZWRkZXZpY2VvbmxpbmUuY29tL2RvYy9zdXN0YWluYWJsZS10ZWNobm9sb2dpZXMtcmVwcm9jZXNzaW5nLW1lZGljYWwtZGV2aWNlcy10by1yZWR1Y2UtaGVhbHRoY2FyZS1zLWNhcmJvbi1mb290cHJpbnQtYW5kLWRyaXZlLWNvc3Qtc2F2aW5ncy0wMDAx0gEA?oc=5","id":"CBMinQFodHRwczovL3d3dy5tZWRkZXZpY2VvbmxpbmUuY29tL2RvYy9zdXN0YWluYWJsZS10ZWNobm9sb2dpZXMtcmVwcm9jZXNzaW5nLW1lZGljYWwtZGV2aWNlcy10by1yZWR1Y2UtaGVhbHRoY2FyZS1zLWNhcmJvbi1mb290cHJpbnQtYW5kLWRyaXZlLWNvc3Qtc2F2aW5ncy0wMDAx0gEA","guidislink":false,"published":"Wed, 10 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=130, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinQFodHRwczovL3d3dy5tZWRkZXZpY2VvbmxpbmUuY29tL2RvYy9zdXN0YWluYWJsZS10ZWNobm9sb2dpZXMtcmVwcm9jZXNzaW5nLW1lZGljYWwtZGV2aWNlcy10by1yZWR1Y2UtaGVhbHRoY2FyZS1zLWNhcmJvbi1mb290cHJpbnQtYW5kLWRyaXZlLWNvc3Qtc2F2aW5ncy0wMDAx0gEA?oc=5\" target=\"_blank\">Sustainable Technologies Reprocessing Medical Devices To Reduce Healthcare's Carbon Footprint And Drive Cost ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Med Device Online<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sustainable Technologies Reprocessing Medical Devices To Reduce Healthcare's Carbon Footprint And Drive Cost ... - Med Device Online","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinQFodHRwczovL3d3dy5tZWRkZXZpY2VvbmxpbmUuY29tL2RvYy9zdXN0YWluYWJsZS10ZWNobm9sb2dpZXMtcmVwcm9jZXNzaW5nLW1lZGljYWwtZGV2aWNlcy10by1yZWR1Y2UtaGVhbHRoY2FyZS1zLWNhcmJvbi1mb290cHJpbnQtYW5kLWRyaXZlLWNvc3Qtc2F2aW5ncy0wMDAx0gEA?oc=5\" target=\"_blank\">Sustainable Technologies Reprocessing Medical Devices To Reduce Healthcare's Carbon Footprint And Drive Cost ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Med Device Online<\/font>","source.href":"https:\/\/www.meddeviceonline.com","source.title":"Med Device Online","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"The healthcare industry contributes about 8.5% of greenhouse gas emissions (GHG) in the U.S., according to the Commonwealth Fund, and more than 70% of the emissions stem from the supply chain, including the manufacturing and disposal of medical devices, according to a report on GreenBook.org. As a result, U.S. hospitals are facing growing pressure to reduce their environmental impact, even as they deal with rising costs and decreasing revenue. Reprocessing single-use medical devices can be a valuable tool, creating a more circular economy, extending the life of medical devices and reducing both product cost and waste. “The increased focus on reducing healthcare’s carbon footprint has dramatically increased demand for the services of Sustainable Technologies™, and led us to a significant expansion of its facility near Tampa, Florida, completed last year,” said Pete Bennett, senior vice president of Global Logistics. Sustainable Technologies™ is a leading provider of single-use device (SUD) collections, reprocessing and recycling services in the U.S. As reported in Cardinal Health's most recent ESG Report, the Sustainable Technologies™ business, which serves more than 2,000 U.S. hospitals and ambulatory service centers, collected 18.3 million SUDs in fiscal 2022 alone, diverting more than 5.6 million pounds of waste from landfills. The expanded facility is twice the size of the original, providing the space to reprocess a larger number of SUDs as well as for testing new ways of reprocessing medical products that aren’t yet in the Sustainable Technologies™ portfolio. Robert Rajalingam, president of Cardinal Health’s U.S. Medical Products and Distribution (U.S. MPD) business, said, “In addition to its positive environmental impact, reprocessing SUDs adds resiliency to the supply chain: It gives hospitals another source for the same product, and reprocessed products typically can be acquired more quickly than products from original equipment manufacturers (OEMs).” In addition, hospitals that purchase reprocessed SUDs rather than new products can achieve significant savings. A report by the Association of Medical Device Reprocessors (AMDR), a nonprofit trade organization, noted that in 2021, U.S. hospitals and surgical centers saved more than $412 million through reprocessing. “Our investment in Sustainable Technologies™ aligns with Cardinal Health’s commitment to helping reduce the sector’s environmental impact as we work to be healthcare’s most trusted partner,” Bennett said. “We continue to bring on new reprocessed products, and better meet the increasing demand for existing products, as we help reduce costs and waste for customers.” How Sustainable Technologies™ works “When we talk with hospital leaders, we share how our reprocessing program can help meet their sustainability goals – because it’s now top of mind for many to identify ways to reduce waste,” said Meg McClanahan, global portfolio director of Sustainable Technologies and board chair of AMDR. “Reprocessing requires minimal change in clinical workflow, so it is one of the best and easiest solutions for hospitals to implement to reduce waste.” Once a customer commits to reprocessing, the team at Sustainable Technologies™ maps the hospital to ensure that the SUD collection bins are placed in the best locations for efficient collections. The team offers single-stream collections, meaning that all products within a single area of care can go into one bin. Sustainable Technologies™ offers a white glove collection service that picks up collection bins on a schedule customized to the hospital, or a mailback collections program. Devices are shipped from hospitals to our reprocessing facility in Florida. Once there, the devices are sorted, then cleaned, tested, inspected, packaged and either high-level disinfected or sterilized. Many SUDs can be reprocessed multiple times, and when they can no longer be reprocessed, they can be recycled. “Our work is closely regulated by the U.S. Food and Drug Administration (FDA), which requires that reprocessed devices are substantially equivalent to their original counterparts,” McClanahan explained. “Every device we reprocess is 100% functionally tested to confirm safety and quality before being redistributed to our healthcare customers.” Sustainable Technologies™ reprocesses a wide array of products, including compression sleeves, electrocardiogram lead wires and cables, air transfer mats (used to transfer and reposition patients), pneumatic tourniquet cuffs, pressure infusion bags, pulse oximetry sensors, and many products used in surgery, including ablation wands and electrodes, arthroscopic abraders and shavers, orthopedic manual devices and more. (You can find the full list of products Sustainable Technologies reprocesses here.) The Florida facility operates on a unique zero waste-to-landfill model for end-of-life disposition. Lithium-ion and alkaline batteries, for example, are melted down into a commodity for the metals market; corrugated cardboard is recycled and reprocessed into more corrugated cardboard or chipboard; and regulated medical waste and plant trash are turned into energy through a waste to energy program. Since launching its zero waste-to-landfill initiative in 2016, Sustainable Technologies™ has diverted 99.9% of waste from landfills. The blended-code (B-code) model Cardinal Health created a blended code (or B-code) model for customers, which combines both new and reprocessed products in one kit. The B-code model delivers the products at one price point and one sku – all of which meet the same specifications as new products. Rajalingam explained the model’s benefits: “One customer is not going to get 100% of a particular product from a reprocessor; they’re going to need to augment that supply with products from an OEM. But the unit price for all the products within a single kit is the same; three may be brand new and the fourth may be reprocessed. All meet the same quality standards as a new product. They’re equally safe and effective, but each is less expensive than a new product.” The B-code model also means there is a single point of contact for a specific product, whether new or reprocessed, simplifying communications and purchasing. Products currently offered with the blended model include compression sleeves, electrocardiogram lead wires and cables and air transfer mats. Reporting “Our data and analytics capabilities are very important to this business,” McClanahan said. “Customers want to understand the impact of their reprocessing program, and analytics help healthcare systems to maximize their reprocessing program and their savings.” Sustainable Technologies™ provides a sustainability value report to customers each month, which details to the unit level within the facility the number of devices collected, the savings achieved through their reprocessing program, and the regulated medical waste savings customers can achieve because we are removing and disposing that waste ­– at no cost to our customers. The reporting is also important to the Sustainable Technologies™ team, McClanahan said. “It helps us to quickly identify any dips within a unit or facility, which might indicate staff changes and a need for reeducation about the collections program.” Our sales team consistently engages with our customers to ensure every aspect of the reprocessing program is successful, and provides the most value. What’s ahead “Our biggest growth potential is in expanding our portfolio,” McClanahan said. “Though we’re among the top reprocessors in the U.S., there are devices that we don’t yet reprocess. As we expand the number of products that we reprocess, we’ll be able to increase savings and reduce waste for customers.” The Sustainable Technologies™ team continually seeks innovative ways to become more sustainable in our processes, as well, she said. “We're currently working on several exciting projects that will help to increase supply resiliency, reduce water consumption and extend the life of single-use devices.” Under site director Natalia Quintero’s guidance, the team is working to improve process efficiencies and increase productivity while maintaining quality. “We have a good road map and a great team,” Quintero said. “We’re all very excited about the progress we’ve made and the future of our site.” Ultimately, McClanahan said, “Sustainable Technologies™ aims to grow its portfolio of both Cardinal brand and other manufacturers' products to provide the most value. Expanding our product offerings makes us a better partner to our healthcare customers, and aligns with our mission to reduce the impact of healthcare delivery on the environment.”","filter_flag":1}
{"title":"Banana fibre fabric and houses made of rice: The circular innovations of May 2023 - edie.net","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmVkaWUubmV0L2JhbmFuYS1maWJyZS1mYWJyaWMtYW5kLWhvdXNlcy1tYWRlLW9mLXJpY2UtdGhlLWNpcmN1bGFyLWlubm92YXRpb25zLW9mLW1heS0yMDIzL9IBb2h0dHBzOi8vd3d3LmVkaWUubmV0L2JhbmFuYS1maWJyZS1mYWJyaWMtYW5kLWhvdXNlcy1tYWRlLW9mLXJpY2UtdGhlLWNpcmN1bGFyLWlubm92YXRpb25zLW9mLW1heS0yMDIzLz9hbXA9dHJ1ZQ?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmVkaWUubmV0L2JhbmFuYS1maWJyZS1mYWJyaWMtYW5kLWhvdXNlcy1tYWRlLW9mLXJpY2UtdGhlLWNpcmN1bGFyLWlubm92YXRpb25zLW9mLW1heS0yMDIzL9IBb2h0dHBzOi8vd3d3LmVkaWUubmV0L2JhbmFuYS1maWJyZS1mYWJyaWMtYW5kLWhvdXNlcy1tYWRlLW9mLXJpY2UtdGhlLWNpcmN1bGFyLWlubm92YXRpb25zLW9mLW1heS0yMDIzLz9hbXA9dHJ1ZQ?oc=5","id":"CBMiZmh0dHBzOi8vd3d3LmVkaWUubmV0L2JhbmFuYS1maWJyZS1mYWJyaWMtYW5kLWhvdXNlcy1tYWRlLW9mLXJpY2UtdGhlLWNpcmN1bGFyLWlubm92YXRpb25zLW9mLW1heS0yMDIzL9IBb2h0dHBzOi8vd3d3LmVkaWUubmV0L2JhbmFuYS1maWJyZS1mYWJyaWMtYW5kLWhvdXNlcy1tYWRlLW9mLXJpY2UtdGhlLWNpcmN1bGFyLWlubm92YXRpb25zLW9mLW1heS0yMDIzLz9hbXA9dHJ1ZQ","guidislink":false,"published":"Thu, 25 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=145, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmVkaWUubmV0L2JhbmFuYS1maWJyZS1mYWJyaWMtYW5kLWhvdXNlcy1tYWRlLW9mLXJpY2UtdGhlLWNpcmN1bGFyLWlubm92YXRpb25zLW9mLW1heS0yMDIzL9IBb2h0dHBzOi8vd3d3LmVkaWUubmV0L2JhbmFuYS1maWJyZS1mYWJyaWMtYW5kLWhvdXNlcy1tYWRlLW9mLXJpY2UtdGhlLWNpcmN1bGFyLWlubm92YXRpb25zLW9mLW1heS0yMDIzLz9hbXA9dHJ1ZQ?oc=5\" target=\"_blank\">Banana fibre fabric and houses made of rice: The circular innovations of May 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">edie.net<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Banana fibre fabric and houses made of rice: The circular innovations of May 2023 - edie.net","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmVkaWUubmV0L2JhbmFuYS1maWJyZS1mYWJyaWMtYW5kLWhvdXNlcy1tYWRlLW9mLXJpY2UtdGhlLWNpcmN1bGFyLWlubm92YXRpb25zLW9mLW1heS0yMDIzL9IBb2h0dHBzOi8vd3d3LmVkaWUubmV0L2JhbmFuYS1maWJyZS1mYWJyaWMtYW5kLWhvdXNlcy1tYWRlLW9mLXJpY2UtdGhlLWNpcmN1bGFyLWlubm92YXRpb25zLW9mLW1heS0yMDIzLz9hbXA9dHJ1ZQ?oc=5\" target=\"_blank\">Banana fibre fabric and houses made of rice: The circular innovations of May 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">edie.net<\/font>","source.href":"https:\/\/www.edie.net","source.title":"edie.net","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"“I believe we must base the next industrial revolution – a planned one – on the thesis that there is no such thing as waste, that waste is simply some useful substance that we do not yet have the wit to use.” It may surprise you to learn that these words are not from the past decade, during which time the concept of the circular economy has taken off in popularity, but were rather published in a March 1970 edition of the Journal Science. A circular economy is one where stakeholders are incentivised to reuse and recycle resources. It stands in contrast to a linear economic process whereby raw materials are extracted, converted into products, then thrown away at the end of their useful life. While the concept has deep roots, we today remain overwhelmingly dependent on non-circular consumption. For example, the Circularity Gap Report 2023, produced by global impact organisation Circle Economy in partnership with Deloitte, found that ‘secondary materials’ – used materials cycled back into the economy – only make up 7.2% of all material inputs. Part of the solution for delivering a circular economy is behaviour change from consumers, and supportive policy from regulators and lawmakers. But innovation in technology and processes is also essential. For this reason, and as part of edie’s focus week on the circular economy, our innovations of the month for May are all those that embody circular principles. From green chemicals made from coffee waste to a backpack made of recycled plastic and captured carbon, these solutions give meaning to the proverb ‘one man’s trash is another man’s treasure.’ Photo source GroundTruth A BACKPACK MADE FROM RECYCLED PLASTIC AND CAPTURED CARBON The outdoor recreation industry accounts for around 2% of US GDP. And although the sector promotes connection to nature, many of the materials traditionally used in outdoor apparel are unsustainable. But now materials science company GroundTruth has developed carbon-neutral, vegan, recycled plastic backpacks and carryalls that have a 10-year performance guarantee. The latest product is the 38L Hybrid Duffle Pack that incorporates the company’s latest technology – hardware that incorporates captured carbon. The packs can be carried by hand, on the back, and across the body, with bottle holders on the front of the pack to make hydrating easy. The bags also open a full 180 degrees for swift accessibility. Notably, each duffle uses 123 plastic bottles for the exterior fabric, and the interior fabric is made from recycled fishing nets. In tests, the captured carbon material performed 40% better than virgin plastic. The waterproof coating on the material contains no volatile organic compounds, and the company works with Bluesign-certified manufacturers that meet Global Recycled Standards for safe and healthy production processes. Photo source Tania Melnyczuk on Unsplash CELLULOSE-BASED INSULATION MADE FROM RECYCLED CARDBOARD The residential sector accounts for 21% of total energy consumption in the US, with over half of a house’s energy usage coming from heating and cooling. Home insulation is one of the swiftest, easiest ways to improve the energy efficiency of a home, and cellulose could be one of the best materials for preventing heat loss. Cleantech company CleanFiber uses recycled cardboard boxes – many of them from the millions of Amazon orders placed locally – as the base for its innovative new building insulation. CleanFiber insulation is made by using a proprietary liquid to separate the fibres that make up a cardboard box. The fibres are then infused with an all-borate, liquid fire-retardant before being dried and shredded. Borates help reduce smouldering and combustion should a fire break out. Adding the retardant to the insulation when it is wet creates a cleaner manufacturing process, by eliminating the need to add additional powders to the insulation after it is dried. The final product is a soft, dust-free insulation fibre and tests on building sites indicate that the cellulose insulation is easier to install because it doesn’t get caught in machinery during application. Additionally, during production, CleanFiber removes contaminants from the boxes, making the insulation better for the health of those that produce and install it, and those who live and work in buildings insulated with it. Photo source The University of East London CONSTRUCTION BLOCKS MADE FROM SUGARCANE Sugarcane is the world’s most-produced crop as of 2021 and is grown mostly for use as sugar and ethanol. Bagasse is the waste product left behind after the sugarcane is crushed to harvest the juice. Some of this leftover material is used for biofuel, but much is left to go to waste. And many of the world’s developing countries are key sugarcane producers, so finding a way to turn the bagasse waste into a valuable new product would provide significant support in further developing local economies. Now, a collaborative project based in the University of East London has brought together researchers, commercial partners, sustainability experts, and architects to create Sugarcrete, a concrete brick replacement. According to the team, if only 30% of the world’s bagasse waste was used for Sugarcrete production, the global brick industry could be completely replaced. Sugarcrete bricks are ultra-low carbon and are made by mixing bagasse with mineral binders. A fast-growing crop, sugarcane is an extremely efficient carbon sink. When combined with the low-emission manufacturing process, the final product becomes a particularly sustainable building option. The polyhedral bricks are designed to lock together to create strength without the need for additional supplies. Square slabs of the bricks are held together with only perimeter ties, and the team is working on strengthening the bricks further. The bricks meet industry standards for strength, durability, fire resistance, and thermal properties, and are four times lighter than traditional bricks with only 15% of the carbon footprint. The team has made its research open source to support communities in developing new industries to replace the need to import expensive building supplies. Photo source Mike Kenneally on Unsplash CREATING SUSTAINABLE CHEMICALS AND PRODUCTS WITH COFFEE WASTE It is estimated that 6 million tonnes of coffee grounds are sent to landfills each year, where they create methane – a greenhouse gas that has a greater impact on global warming than carbon dioxide. Now, a technology company from Warsaw, EcoBean, has created a spent coffee grounds collection service that processes waste into green raw materials and products. By doing this, the startup is extending the coffee value chain and making it more sustainable by introducing a circular economy. And for every tonne of coffee ground waste that is collected by EcoBean, 600 kilogrammes of carbon dioxide are prevented from being emitted. EcoBean processes the coffee waste into raw materials, including coffee oil, coffee lignin, lactic acid, and protein feed additives, with a focus on zero-waste production. With these green raw materials, EcoBean has developed a range of circular and sustainable coffee-based products. These usable and recyclable products include EcoBean Flowerpots and EcoBean Straws. The company has also partnered with Dutch startup You Lucky Bird (YLB) to create the You Lucky Bird eco-friendly cups, which are 100%recycled – made from coffee waste and other vegetable-derived materials. Photo source Max Ducourneau on Unsplash FABRIC PRODUCTS MADE FROM BANANA FIBRES As innovators create new sustainable fibres, the options available to those working in the fashion industry are expanding, making it easier to design and produce products with lower carbon footprints. The new fabrics are exciting, bringing with them increased options and challenges for designers. Additionally, many of the companies behind the latest offerings have broader social goals embedded into their working philosophy. Uganda’s Mawejje Creations, for instance, is a socially minded company that produces textiles made from waste banana plants, fabric offcuts, secondhand clothes, and organic cotton. The business’s Commune Fabric is made for use in fashion and consists entirely of banana crop biowaste. Much like hemp, when grown as part of a sustainable, mixed agricultural crop, the banana plant requires little to no maintenance, making it an excellent replacement for water-heavy cotton crops. Easily grown in Uganda, the banana plant requires no fertiliser or pesticides, and the production process for the fibres ensures that the final fabric is chemical-free. Mawejje Creations also trains young people in the fabric production process and encourages local farmers to use sustainable methods for the highest quality plants. Importantly, part of the training process includes learning certain styles of weaving as a means of preserving and passing along some of the area’s heritage skills. Photo source Barbara Corsico HOUSES MADE FROM RICE The International Energy Agency (IEA) estimates that the buildings and construction industry was responsible for 39% of process and energy-related carbon emissions in 2018, 11% of which come from the production of building materials. Italy-based architectural firm Ricehouse is on a mission to build houses more sustainably, by using rice by-products. The company uses natural waste residues, such as rice straw, husk, and chaff from the rice industry to create circular construction materials, including thermal insulating plasters, finishings, lightweight screeds, and prefabricated panels. Ricehouse obtains the waste directly from local farmers in northern Italy, where the company is based, and rice processing factories. The company believes that engaging in the circular economy, by turning organic waste into a source of value, is vital to green construction and sustainable built environments. And once Ricehouse’s products reach the end of their usable lives, they can either be used in new products or harmlessly returned to nature to break down. The products have high-performance acoustic insulation, as well as having high durability. And because the final rice-based products are effective thermal insulators, it will help houses achieve energy efficiency standards and cut carbon footprints associated with heating. They are also breathable and resistant to harmful biological agents such as viruses, bacteria, and fungi – making them mould-proof. Crucially, the products can be applied using traditional layering techniques and do not require the use of any specialised equipment.","filter_flag":1}
{"title":"Lush's new £2.3m Green Hub facility – 'We've gone from recycling 2.5 tonnes of waste to 20 tonnes' - CosmeticsDesign-Europe.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMilwFodHRwczovL3d3dy5jb3NtZXRpY3NkZXNpZ24tZXVyb3BlLmNvbS9BcnRpY2xlLzIwMjMvMDUvMjUvbHVzaC1zLW5ldy0yLjNtLWdyZWVuLWh1Yi1mYWNpbGl0eS13ZS12ZS1nb25lLWZyb20tcmVjeWNsaW5nLTIuNS10b25uZXMtb2Ytd2FzdGUtdG8tMjAtdG9ubmVz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMilwFodHRwczovL3d3dy5jb3NtZXRpY3NkZXNpZ24tZXVyb3BlLmNvbS9BcnRpY2xlLzIwMjMvMDUvMjUvbHVzaC1zLW5ldy0yLjNtLWdyZWVuLWh1Yi1mYWNpbGl0eS13ZS12ZS1nb25lLWZyb20tcmVjeWNsaW5nLTIuNS10b25uZXMtb2Ytd2FzdGUtdG8tMjAtdG9ubmVz0gEA?oc=5","id":"CBMilwFodHRwczovL3d3dy5jb3NtZXRpY3NkZXNpZ24tZXVyb3BlLmNvbS9BcnRpY2xlLzIwMjMvMDUvMjUvbHVzaC1zLW5ldy0yLjNtLWdyZWVuLWh1Yi1mYWNpbGl0eS13ZS12ZS1nb25lLWZyb20tcmVjeWNsaW5nLTIuNS10b25uZXMtb2Ytd2FzdGUtdG8tMjAtdG9ubmVz0gEA","guidislink":false,"published":"Thu, 25 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=145, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilwFodHRwczovL3d3dy5jb3NtZXRpY3NkZXNpZ24tZXVyb3BlLmNvbS9BcnRpY2xlLzIwMjMvMDUvMjUvbHVzaC1zLW5ldy0yLjNtLWdyZWVuLWh1Yi1mYWNpbGl0eS13ZS12ZS1nb25lLWZyb20tcmVjeWNsaW5nLTIuNS10b25uZXMtb2Ytd2FzdGUtdG8tMjAtdG9ubmVz0gEA?oc=5\" target=\"_blank\">Lush's new £2.3m Green Hub facility – 'We've gone from recycling 2.5 tonnes of waste to 20 tonnes'<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign-Europe.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Lush's new £2.3m Green Hub facility – 'We've gone from recycling 2.5 tonnes of waste to 20 tonnes' - CosmeticsDesign-Europe.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilwFodHRwczovL3d3dy5jb3NtZXRpY3NkZXNpZ24tZXVyb3BlLmNvbS9BcnRpY2xlLzIwMjMvMDUvMjUvbHVzaC1zLW5ldy0yLjNtLWdyZWVuLWh1Yi1mYWNpbGl0eS13ZS12ZS1nb25lLWZyb20tcmVjeWNsaW5nLTIuNS10b25uZXMtb2Ytd2FzdGUtdG8tMjAtdG9ubmVz0gEA?oc=5\" target=\"_blank\">Lush's new £2.3m Green Hub facility – 'We've gone from recycling 2.5 tonnes of waste to 20 tonnes'<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign-Europe.com<\/font>","source.href":"https:\/\/www.cosmeticsdesign-europe.com","source.title":"CosmeticsDesign-Europe.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Lush first opened an on-site Green Hub in 2015 to find new ways to reuse, repurpose and recycle by-products from its cosmetics production, but quickly saw a need for a larger in-house facility completely dedicated to waste management. The company decided to invest £2.3m to relocate to and refit a new 40,000 sq ft premises in Fleets Corner Business Park, Poole. Two years later, after a lot of hard work, the new Green Hub is up and running and open to the public. The new building is three times the size of its previous location and has improved its capabilities to reuse, repurpose, repair and recycle materials from across the whole business. According to Eloise Flinter, Business Development Manager for The Green Hub, the new facility serves two purposes: The first was to increase capacity for recycling. “The new machinery allows us to process 10 times more waste​,” she explained. “We have gone from recycling 2.5 tonnes of waste to 20 tonnes – the weight of a London bus. ​ This increases local recycling capacity and new infrastructure for a circular economy in our area.​” The second purpose was to open the facility up to the public to reach the local and global communities, such as schools, local groups and like-minded businesses. “By opening up to the public and working with the community, people can physically see the circular economy and it can have more impact,”​ explained Flint. Investing in racking and repurposing granulators To reduce transport emissions,​ the move involved relocating six different departments under one new roof – from electrical engineers in the repairs department to carpenters in the woodwork department, and even a laundry department where Lush washes the towels and linen used in its spas. The activities carried out at the Green Hub include: granulating plastic as part of the brand’s ‘Bring it Back​’ customer recycling scheme; treating wastewater from its manufacturing and laundry processes; repairing machinery so it doesn’t need to buy new ones; and donating funds to charities and grassroots groups across the UK from selling surplus products. Flinter revealed that Lush continued to repurpose its waste while it relocated the Green Hub, which was no easy task. “While we repurposed our plastic granulators, we had to store all of our packaging returns throughout this time,” ​she said (as Lush encourages customers to bring their used packs back to the stores to receive 50 pence per item). “Now the granulator is back on, it’s been running round the clock to process all of this accumulated packaging.” ​ During this period, the company invested £55k in racking to store the packaging that needed to be reprocessed. “We will still use the racking,” ​says Flinter. “It currently has everything from Christmas trees to baths on it – from when we have done events or store remodels. All ready to be reclaimed and reused again.” ​ Repairing, reusing and recycling Along with looking after the company’s 15+ manufacturing buildings and maintaining and repairing over 300 pieces of machinery, Lush’s repairs team is on-hand to fix anything and everything. “It’s great that we are all together in the hub as it prevents delays – if a machine breaks now we can get it fixed straight away​,” says Flinter. “The repairs team is very busy, as we encourage repairs across the board. They’ve repaired everything from broken kettles to an electric scooter for our teams.” ​ The company also has an in-house shop, which Flinter dubs: “a trash-to-treasure store.” ​It sells all kinds of items that are left over from the business. For example, teapots that were used in spa treatments were sent back to the Green Hub shop and sold for a small sum to raise funds for grassroots charities. “We also reuse and resell our gift packaging,” ​said Flinter. “Last year we donated over 100,000 products to local charities and produced gift packaging for schools’ arts and crafts projects. We look at every material we use and see where else it can be reused or resold to raise funds for charities.” ​ Future plans: a close-looped water system Now that the Green Hub is running at its full capacity, its next goal is to close-loop its water system to process 500 tonnes of dirty water each year. “Our water waste system DAF unit can clean dirty water from our manufacturing systems, then we can close-loop it and reuse it in the laundry facility and washing​,” explained Flinter. “Before we had to transport tonnes of water to be transported off-site. Now we will be able to do that in-house, too​.” Lush has now opened the Green Hub to the public with a schedule of events, workshops and community engagement opportunities designed to facilitate environmental-focused education. Flinter is excited to see the effects of this, as she makes it clear that the success of the Green Hub relies on collaboration between Lush and its customers, as well as the wider community. “This collaboration is key for the circular economy to work,” ​she concludes. “Where we can come together and innovate with suppliers, customers, other businesses, schools, etc. this is the key to making it work, so we can ensure that we’re ‘Leaving the world Lusher than we found it’ – as we like to say here​.”","filter_flag":1}
{"title":"What is Recommerce? (+ How to Sell Resale Goods in 2024) - Shopify","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vd3d3LnNob3BpZnkuY29tL3JldGFpbC9yZXNhbGUtcHJvZ3JhbXPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vd3d3LnNob3BpZnkuY29tL3JldGFpbC9yZXNhbGUtcHJvZ3JhbXPSAQA?oc=5","id":"CBMiLmh0dHBzOi8vd3d3LnNob3BpZnkuY29tL3JldGFpbC9yZXNhbGUtcHJvZ3JhbXPSAQA","guidislink":false,"published":"Wed, 17 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=137, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vd3d3LnNob3BpZnkuY29tL3JldGFpbC9yZXNhbGUtcHJvZ3JhbXPSAQA?oc=5\" target=\"_blank\">What is Recommerce? (+ How to Sell Resale Goods in 2024)<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Shopify<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"What is Recommerce? (+ How to Sell Resale Goods in 2024) - Shopify","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vd3d3LnNob3BpZnkuY29tL3JldGFpbC9yZXNhbGUtcHJvZ3JhbXPSAQA?oc=5\" target=\"_blank\">What is Recommerce? (+ How to Sell Resale Goods in 2024)<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Shopify<\/font>","source.href":"https:\/\/www.shopify.com","source.title":"Shopify","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Recommerce (or reverse commerce) is the process of selling previously-owned products through physical and online channels. The last few years have been a turbulent time for retail. There’s the threat of a looming recession. Environmentally-minded consumers are questioning the wastefulness of the fast fashion industry. Or at least new to them. These factors are helping pave the way for retailers to set up a resale program: buying back old products and giving them a new life. It’s a win\/win; customers get the same quality products for a fraction of the cost, and retailers get to generate revenue without generating excess production. By 2030, the recommerce industry is expected to be worth $84 billion, almost double that of fast fashion. Let’s take a closer look at why this shift is happening and how your store can introduce a resale program. What is recommerce? Recommerce typically happens through organized buyback, trade-in or upcycling programs—initiatives that allow customers to return their used products, often in exchange for money or store credit. Retailers then clean up the items and resell them, in-store or online, at a reduced price. How big is the recommerce market? The earth is changing, and so is the way consumers shop. With 77% of Americans concerned about the environmental impact of products they buy, retailers are revamping their business models to improve both the planet and their balance sheets. For years, the fashion industry has faced backlash for its climate-harming practices. Consider these facts: One new garment takes 77 gallons of water and creates 17 pounds of CO2 equivalent Over 100 billion garments are produced each year, and 73% of all apparel ends up in a landfill is incinerated Buying one used item reduces its carbon, waste, and water footprints by 82% Today, studies show that 272 million people are currently buying or selling secondhand goods. Almost six in 10 Americans who do so plan to increase their recommerce activity over the next year. As a result, the recommerce and resale market is growing at a rate 11 times faster than the broader retail market—a figure that’s expected to double within the next five years. The benefits of recommerce Beyond the sheer volume of the market, here are some of the reasons retail businesses are getting involved with product resales. Convert price-sensitive shoppers. Many shoppers are reducing their spending as a result of the recession. Plus, for premium brands, selling used goods is a way to convert more price-sensitive shoppers. Once they’ve tried the item once, it becomes easier to convert them into full-price consumers. Many shoppers are reducing their spending as a result of the recession. Plus, for premium brands, selling used goods is a way to convert more price-sensitive shoppers. Once they’ve tried the item once, it becomes easier to convert them into full-price consumers. Cost savings and price control. Instead of manufacturing the same product multiple times for individual customers, resell the same item to several people. It’ll shorten your retail supply chain while maximizing the revenue each item generates. Instead of manufacturing the same product multiple times for individual customers, resell the same item to several people. It’ll shorten your retail supply chain while maximizing the revenue each item generates. Sustainability. To combat fashion’s wastage problem, many retail-focused sustainability initiatives center on moving toward a circular economy, one that emphasizes the repair and recycling of existing materials and products for as long as possible. To combat fashion’s wastage problem, many retail-focused sustainability initiatives center on moving toward a circular economy, one that emphasizes the repair and recycling of existing materials and products for as long as possible. Conscious consumption. As it becomes easier to sell clothes online, people are getting rid of their old clothes and reinvesting the money in more glamorous used items. Apps like Depop and Poshmark have paved the way for modern recommerce services, while simultaneously helping to give birth to the thriving recommerce industry. As it becomes easier to sell clothes online, people are getting rid of their old clothes and reinvesting the money in more glamorous used items. Apps like Depop and Poshmark have paved the way for modern recommerce services, while simultaneously helping to give birth to the thriving recommerce industry. Encourage retention. Once shoppers are in-store, especially returning customers, they’re more likely to buy. Customers are also more inclined to shop knowing that their products have resale value. “I don’t think we’ve unleashed the creativity [for recommerce] yet. The field is wide open,” says Monica Park, co-founder of circular fashion group Eleven Radius. “The winners, long-term, will have a very clear, almost-obsessed focus on the customer experience and finding the right incentives to truly reward and shift their habits. This is going to come from people within brands who really understand and care about the customers who buy their products the first time around.” How does recommerce work? Types of recommerce There are three main types of recommerce. Let’s take a look at each one, with an example of when it might be used. Buyback. A buyback program encourages people to return their pre-loved items by offering to refund a percentage of the sale price. If someone returns a $29 phone charger, for example, the retailer could offer a $2.90 credit note to redeem on their next purchase. A buyback program encourages people to return their pre-loved items by offering to refund a percentage of the sale price. If someone returns a $29 phone charger, for example, the retailer could offer a $2.90 credit note to redeem on their next purchase. Trade-in offers. Get customers to bring back used products by offering a trade-in deal. Apple is one recommerce example. In its retail stores, Apple customers can return used devices in exchange for credit on newer ones. Get customers to bring back used products by offering a trade-in deal. Apple is one recommerce example. In its retail stores, Apple customers can return used devices in exchange for credit on newer ones. Upcycling. An upcycling program reuses old items and turns them into newer products. LUSH Cosmetics, for example, recycles its plastic containers when shoppers use up the product and bring it back in-store. Those old containers are used to sell new products. Some retailers combine recommerce programs with customer incentives. Take Allbirds, for example. Its partnership with Trove allows the retailer to offer customers $20 in-store credit in exchange for turning in their pre-loved Allbirds shoes. The used shoes are then resold online on the ReRun platform, starting at $59. This initiative is part of a broader effort around Allbirds Flight Plan, a strong commitment to upholding a more sustainable fashion economy. Who buys recommerce products? Data from Thredup shows millennial and Generation Z shoppers are most likely to buy second-hand apparel. The willingness to buy recommerce products seems to decline with age—just 16% of boomers over the age of 56 are open to buying second-hand clothing. This is partly why recommerce is on the rise. Younger generations have greater purchasing power; it’s estimated that Gen Z consumers make a total of 358 transactions each year, each averaging at $58.30 per transaction. Boomers, on the other hand, spend $60.38 across just 202 transactions. “I have decided to buy a lot of my Christmas gifts for my friends and family this year from secondhand shops, both in-store and online,” says Maggie Vlasaty, account associate at One Simple Plan. “I have done this in the past, but I always make a point of shopping at secondhand stores first and foremost, regardless of the occasion. It’s small purchases like shopping secondhand that can truly make an impact in the long run, both environmentally and emotionally.” What items can you sell as recommerce? The best items to resell through your store are goods that aren’t perishable and hold a good resale value. That includes: Apparel and clothing , particularly baby clothes, which become too small very quickly , particularly baby clothes, which become too small very quickly Antiques and collectables , including old coins, stamps, or jewelry , including old coins, stamps, or jewelry Used electronics , such as older PCs, video consoles, or smartphones , such as older PCs, video consoles, or smartphones Home goods , including furniture, kitchen gadgets, or appliances , including furniture, kitchen gadgets, or appliances Sporting goods, such as football jerseys, bicycles, or exercise machines Grace Baena, director of brand of Kaiyo, says, “I recently purchased a refurbished Macbook Air through Apple after the Macbook I’d purchased brand new years ago finally was due to be replaced. “I have personal experience with the longevity of Mac laptops so I felt comfortable purchasing one used in order to take advantage of the lower price, especially given the fact that even refurbished laptops come with an optional warranty.” Statista reports that clothing, books, and electronics are the most popular types of second-hand products. Tips for including recommerce in your store Confirm which products can be resold Depending on your industry, not all of the products in your retail store will be eligible for recommerce. Items that can’t be resold include: Skincare or makeup items Hygiene products, such as sanitary items or underwear Items with shelf life issues, such as food and drink (Although these items can’t be resold, you can run an upcycling program to recycle used packaging—especially if it’s made with plastic.) The best items to resell are products that hold residual value. It’s largely why designer brands often have a resale program. People still aspire to have the social status associated with luxury brands, so they’re willing to splash thousands on a second-hand designer bag. They get the same quality product at a lower price. Have strict quality control criteria Just because shoppers are giving old products a new life, it doesn’t mean they’re willing to sacrifice much on quality. Set clear expectations on how refurbished products will function with a grading scale. If you’re selling refurbished electronics, for example, your grading scale could be as simple as: Exceptional: Like new Like new Good: Fully functioning, but with minor scratches Fully functioning, but with minor scratches OK: Some elements need repairing Take lululemon, for example. The athleisure brand operates a Like New resale program to all stores nationwide. Whether online or at any store in the US, customers can exchange their gently used lululemon gear for an online gift card ranging from $5 to $25, depending on the item. The goods are then resold by lululemon on its Like New platform for nearly 50% off the retail price. Any item that doesn’t meet the predetermined quality standards is recycled through Debrand. The lululemon resale program will reduce its products’ carbon footprint by up to 50%, and all profits will be directed toward its Impact Agenda. By 2030, lululemon pledges to make 100% of its products with sustainable materials and end-of-use solutions. Educate customers on the value of recycled goods While sustainability plays a large role in many purchasing decisions, some consumers may still not be aware of the impact their purchases have on the environment. Educate these people with marketing messages that highlight the value of recommerce. Take the organic skincare brand Meow Meow Tweet, for example. As part of its unique Bulk Aisle refill program, the retailer encourages its customers to shop in bulk after their first purchase. By refilling the glass bottle from their first order, buying in bulk reduces the amount of plastic packaging needed for reorders and saves customers money. All bulk purchases are delivered in lightweight aluminum bottles and come with free shipping as an added incentive. To educate customers on the upside of buying in bulk, Meow Meow Tweet breaks down the Bulk Aisle math that results in each customer saving 255 bottles from landfills and saving $1,575 over a 30-year span. Host “garage sales” for resale customers Garage sales and flea markets aren’t things of the past. More than 6.5 million Americans host yard or garage sales each year. Along with flea markets, they help people in the local community buy second-hand products at a fraction of the retail price. Use the format when introducing recommerce into your retail store. Host a garage sale and use local marketing techniques to drive the local community toward your store. These events can attract people who would otherwise think your products are too expensive. A retail leader in sustainability, REI has been selling used gear since 2017. Although all shoppers are able to buy pre-owned items, the trade-in option is available only for REI Co-op members. It operates the same way as a standard program: trade in your used gear in exchange for an REI gift card. REI has also tested pop-up shops, selling only used gear as an expansion of its famous in-store Members Only Garage Sales. List on recommerce marketplaces Recommerce marketplaces connect buyers and sellers of second-hand goods. Alongside your brick-and-mortar stores, list pre-loved items on these online marketplaces to attract local shoppers: The best part? You can use these preloved marketplaces to divert foot traffic to your store. Offer buy online, pick up in-store for marketplace buyers. Once they’re in your store, have a retail salesperson convince them to buy more products. Incorporate recommerce in your store You may not be in a position to launch a buyback, trade-in, or upcycling program now, and that’s OK. What’s important is that you’re thinking about how to move toward participating in the circular economy. Quiz your existing customers and ask whether they’d be interested in a resale program—one where they get access to the same quality products for a smaller price. You might open the door to a whole new market, increasing your bottom line while becoming more sustainable. Get started with Shopify POS Join Allbirds, Meow Meow Tweet, and other brands using Shopify POS to unlock growth in-store and online and create a unified, modern customer experience.","filter_flag":1}
{"title":"European Commission Regulation restricting lead in PVC enables continuity of PVC recycling. - RECYCLING magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiQFodHRwczovL3d3dy5yZWN5Y2xpbmctbWFnYXppbmUuY29tLzIwMjMvMDUvMDUvZXVyb3BlYW4tY29tbWlzc2lvbi1yZWd1bGF0aW9uLXJlc3RyaWN0aW5nLWxlYWQtaW4tcHZjLWVuYWJsZXMtY29udGludWl0eS1vZi1wdmMtcmVjeWNsaW5nL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiQFodHRwczovL3d3dy5yZWN5Y2xpbmctbWFnYXppbmUuY29tLzIwMjMvMDUvMDUvZXVyb3BlYW4tY29tbWlzc2lvbi1yZWd1bGF0aW9uLXJlc3RyaWN0aW5nLWxlYWQtaW4tcHZjLWVuYWJsZXMtY29udGludWl0eS1vZi1wdmMtcmVjeWNsaW5nL9IBAA?oc=5","id":"CBMiiQFodHRwczovL3d3dy5yZWN5Y2xpbmctbWFnYXppbmUuY29tLzIwMjMvMDUvMDUvZXVyb3BlYW4tY29tbWlzc2lvbi1yZWd1bGF0aW9uLXJlc3RyaWN0aW5nLWxlYWQtaW4tcHZjLWVuYWJsZXMtY29udGludWl0eS1vZi1wdmMtcmVjeWNsaW5nL9IBAA","guidislink":false,"published":"Fri, 05 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=125, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiQFodHRwczovL3d3dy5yZWN5Y2xpbmctbWFnYXppbmUuY29tLzIwMjMvMDUvMDUvZXVyb3BlYW4tY29tbWlzc2lvbi1yZWd1bGF0aW9uLXJlc3RyaWN0aW5nLWxlYWQtaW4tcHZjLWVuYWJsZXMtY29udGludWl0eS1vZi1wdmMtcmVjeWNsaW5nL9IBAA?oc=5\" target=\"_blank\">European Commission Regulation restricting lead in PVC enables continuity of PVC recycling.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RECYCLING magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"European Commission Regulation restricting lead in PVC enables continuity of PVC recycling. - RECYCLING magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiQFodHRwczovL3d3dy5yZWN5Y2xpbmctbWFnYXppbmUuY29tLzIwMjMvMDUvMDUvZXVyb3BlYW4tY29tbWlzc2lvbi1yZWd1bGF0aW9uLXJlc3RyaWN0aW5nLWxlYWQtaW4tcHZjLWVuYWJsZXMtY29udGludWl0eS1vZi1wdmMtcmVjeWNsaW5nL9IBAA?oc=5\" target=\"_blank\">European Commission Regulation restricting lead in PVC enables continuity of PVC recycling.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RECYCLING magazine<\/font>","source.href":"https:\/\/www.recycling-magazine.com","source.title":"RECYCLING magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"The Regulation, which will enter into force in twenty days, supports the industry’s efforts to substitute lead stabilisers in PVC production. In fact, VinylPlus has been working proactively to substitute lead, and since 2015, the EU PVC industry across all EU-27 Member States has ceased using lead-based stabilisers. With this restriction, the European Commission Regulation builds upon the industry’s efforts to reduce the use of hazardous substances in PVC products and further enhances the circularity of the PVC industry. The Regulation will restrict the import of lead-containing PVC products from third countries where lead is still used as a stabiliser. It will also set a way forward to enable the recycling of PVC products containing legacy lead additives in a manner which safeguards human health and the environment. Additionally, the industry will be given enough time to adjust to the new rules, ensuring the continuity of recycling and enabling the industry’s contribution to the EU’s circular economy. Brigitte Dero, VinylPlus Managing Director, commented: “PVC is a building block of our modern societies: it is a versatile, durable and highly recyclable polymer, widely used in various applications, including building and construction, energy production, agriculture, and healthcare. It plays a significant role in enabling the EU Green Deal, and the industry’s commitment to increase its recycling rate contributes to the EU circular economy. The restriction on lead in PVC represents a significant step in enabling the PVC industry to meet its ambitious recycling targets of one million tonnes per year of recycled PVC used in new products by 2030 in a safe way for human health and the environment. VinylPlus is committed to continuing its efforts to accelerate the European PVC value chain transition to a circular economy, and we look forward to collaborating with all stakeholders to achieve our common goals.”","filter_flag":1}
{"title":"New tech tackles plastic farm waste, News - La Trobe University","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmxhdHJvYmUuZWR1LmF1L25ld3MvYXJ0aWNsZXMvMjAyMy9yZWxlYXNlL25ldy10ZWNoLXRhY2tsZXMtcGxhc3RpYy1mYXJtLXdhc3Rl0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmxhdHJvYmUuZWR1LmF1L25ld3MvYXJ0aWNsZXMvMjAyMy9yZWxlYXNlL25ldy10ZWNoLXRhY2tsZXMtcGxhc3RpYy1mYXJtLXdhc3Rl0gEA?oc=5","id":"CBMiWWh0dHBzOi8vd3d3LmxhdHJvYmUuZWR1LmF1L25ld3MvYXJ0aWNsZXMvMjAyMy9yZWxlYXNlL25ldy10ZWNoLXRhY2tsZXMtcGxhc3RpYy1mYXJtLXdhc3Rl0gEA","guidislink":false,"published":"Wed, 31 May 2023 01:46:24 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=31, tm_hour=1, tm_min=46, tm_sec=24, tm_wday=2, tm_yday=151, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmxhdHJvYmUuZWR1LmF1L25ld3MvYXJ0aWNsZXMvMjAyMy9yZWxlYXNlL25ldy10ZWNoLXRhY2tsZXMtcGxhc3RpYy1mYXJtLXdhc3Rl0gEA?oc=5\" target=\"_blank\">New tech tackles plastic farm waste, News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">La Trobe University<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New tech tackles plastic farm waste, News - La Trobe University","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmxhdHJvYmUuZWR1LmF1L25ld3MvYXJ0aWNsZXMvMjAyMy9yZWxlYXNlL25ldy10ZWNoLXRhY2tsZXMtcGxhc3RpYy1mYXJtLXdhc3Rl0gEA?oc=5\" target=\"_blank\">New tech tackles plastic farm waste, News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">La Trobe University<\/font>","source.href":"https:\/\/www.latrobe.edu.au","source.title":"La Trobe University","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Funded by a Circular Economy Markets Fund grant from the Victorian Government through Sustainability Victoria, the project will investigate how agricultural plastic waste can be recycled. Using Rtec’s technology, plastics such as baling twine, nets, covers and fertiliser bags will be melted down and used to make products such as fence posts and shipping pallets, which will then be tested by La Trobe experts for end-market use. Lead researcher at La Trobe University, Associate Professor Ing Kong, said that the project could offer a solution to Australia’s current recycling crisis, helping move Victoria a step closer to a Circular Economy. “This technology can take plastic that we previously sent off-shore for processing, melt it down locally and extrude something we can use to make new products,” Associate Professor Kong said. “We will then test the various applications of this recycled plastic – for example simulating how a fence post will stand up to 30 years of sun exposure or 10 years of heavy rain – to ensure its fit for purpose.” Rtec Founder Dr William Ritchie said the new technology is a win for both the environment and the agriculture sector. “Disposing of plastic waste can be a significant additional cost for farmers, and we know that many in the industry either send plastic to landfill or even burn it because they don’t have another option,” Dr Ritchie said. “The technology will allow farmers to not only recycle this plastic, but potentially benefit from selling the recycled product back to plastics manufacturers.” As part of the project, a prototype of the machine will be built and tested in the lab at La Trobe University’s Bendigo campus, melting down plastic waste and exuding it in a granular form that can be moulded into new products. More about the Circular Economy Markets Fund: Materials This project is supported by the Circular Economy Markets Fund. The Fund is delivered by Sustainability Victoria under the Victorian Government’s circular economy policy, Recycling Victoria: a new economy. The Fund provides grants to support research institutes, industry and business to develop and commercialise innovative, new products and processes that incorporate recycled materials. 22 projects will share in $4.96 million in grants under the Fund. The La Trobe project with Rtec received $145,000 in funding from the Circular Economy Markets Fund and will run for 18 months. Media contact: Courtney Carthy, c.carthy-oneill@latrobe.edu.au +61 487 448 793","filter_flag":1}
{"title":"This new service is the first-of-its-kind online thrift store for sneakers — and the savings on top brands are tremendous - The Cool Down","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LnRoZWNvb2xkb3duLmNvbS9ncmVlbi1idXNpbmVzcy9zbmVha2VyY3ljbGUtZ290c25lYWtlcnMtdGhyaWZ0LXN0b3JlLW9ubGluZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LnRoZWNvb2xkb3duLmNvbS9ncmVlbi1idXNpbmVzcy9zbmVha2VyY3ljbGUtZ290c25lYWtlcnMtdGhyaWZ0LXN0b3JlLW9ubGluZS_SAQA?oc=5","id":"CBMiWGh0dHBzOi8vd3d3LnRoZWNvb2xkb3duLmNvbS9ncmVlbi1idXNpbmVzcy9zbmVha2VyY3ljbGUtZ290c25lYWtlcnMtdGhyaWZ0LXN0b3JlLW9ubGluZS_SAQA","guidislink":false,"published":"Tue, 16 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=136, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LnRoZWNvb2xkb3duLmNvbS9ncmVlbi1idXNpbmVzcy9zbmVha2VyY3ljbGUtZ290c25lYWtlcnMtdGhyaWZ0LXN0b3JlLW9ubGluZS_SAQA?oc=5\" target=\"_blank\">This new service is the first-of-its-kind online thrift store for sneakers — and the savings on top brands are tremendous<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Cool Down<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"This new service is the first-of-its-kind online thrift store for sneakers — and the savings on top brands are tremendous - The Cool Down","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LnRoZWNvb2xkb3duLmNvbS9ncmVlbi1idXNpbmVzcy9zbmVha2VyY3ljbGUtZ290c25lYWtlcnMtdGhyaWZ0LXN0b3JlLW9ubGluZS_SAQA?oc=5\" target=\"_blank\">This new service is the first-of-its-kind online thrift store for sneakers — and the savings on top brands are tremendous<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Cool Down<\/font>","source.href":"https:\/\/www.thecooldown.com","source.title":"The Cool Down","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"\"To see a pair of sneakers go in the trash is blasphemous.\" Sneakerheads, rejoice — your sneaker habit is about to get a lot more affordable. SneakerCycle is a new ecommerce site being billed as the first and only online thrift store completely dedicated to sneakers. It offers more than 33,000 pairs of gently-used and refurbished sneakers from brands like Nike, Asics, HOKA, Reebok, Vans, Adidas, Converse, New Balance, and more. Most of the sneakers are less than $100 with an average price of $45. And each sneaker is individually photographed with at least eight photos to help customers inspect and evaluate the sneakers. The company also offers free shipping and free returns. If you're grossed out by wearing \"pre-loved\" sneakers, never fear. SneakerCycle's restoration team cleans and disinfects the sneakers using a high-grade disinfectant formula that is \"EPA-registered to kill as many as 64 micro-organisms that eliminates odors and kills bacteria, viruses, fungi, mold and 99.9% of germs.\" (The Cool Down may receive a commission on sign-ups made through links on this page at no cost to you.) SneakerCycle is the brainchild of Steven Salstein, a die-hard sneakerhead and the co-founder and president of GotSneakers, a sneaker recycling program that will actually pay you to send in your old sneakers. Join our newsletter Good news, green hacks, and the latest cool clean tech — straight to your inbox every week! As he told The Cool Down, \"I wear sneakers unless I'm going to a black-tie wedding.\" Salstein is a fourth-generation family business owner. His great-great-grandfather was an OG circular economy pioneer, working as a tailor who sold extra clothing remnants to create new products. So it was in Salstein's DNA to extend the life cycle of apparel — and now he's built a business around giving sneakers a new life through recycling, restoration, and reuse. Along with his elementary school friend Eric Mesa, Salstein launched GotSneakers to get unwanted footwear from consumers into the hands of the hundreds of millions of people around the world who need them, all while keeping sneakers out of landfills. (Read more about our experience trying the service here.) Each check the company sends to donors also comes with a sustainability report reinforcing the environmental impact of the program. \"To see a pair of sneakers go in the trash is blasphemous,\" Salstein told The Cool Down. Building on the success of GotSneakers and wanting to make brand-name sneakers more accessible, Salstein and Mesa saw an opportunity for a direct-to-consumer pre-loved sneaker brand with companies like ThredUp as inspiration. In addition to offering a service that would meet the needs of people pinched by inflation and rising prices, they were passionately committed to reducing waste. \"We made a decision that sustainability was going to be at the forefront and would be the most important part of this business,\" said Salstein. \"We want to be a leader in the salvage sustainability business.\" The SneakerCycle inventory is a mixture of sneakers from the \"CleanOut\" and recycling service offered through GotSneakers, as well as those from any individual or organization who wants to keep footwear out of landfills. SneakerCycle also receives surplus and returns from retailers and brands looking for innovative recycling and resale solutions — and many of these shoes are in excellent condition. Salstein and Mesa are hoping SneakerCycle is a win-win for its customers and our planet. As the company's website says, \"When you purchase a pair of used sneakers, you're extending the life of a sneaker that might have otherwise ended up in a landfill, and helping reduce the need for brands to manufacture new sneakers which helps decrease emissions and preserves water.\" Join our free newsletter for cool news and actionable info that makes it easy to help yourself while helping the planet.","filter_flag":1}
{"title":"Regulation needed to advance circular economy - Waste Management Review","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9yZWd1bGF0aW9uLW5lZWRlZC10by1hZHZhbmNlLWNpcmN1bGFyLWVjb25vbXkv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9yZWd1bGF0aW9uLW5lZWRlZC10by1hZHZhbmNlLWNpcmN1bGFyLWVjb25vbXkv0gEA?oc=5","id":"CBMiU2h0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9yZWd1bGF0aW9uLW5lZWRlZC10by1hZHZhbmNlLWNpcmN1bGFyLWVjb25vbXkv0gEA","guidislink":false,"published":"Tue, 23 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=143, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9yZWd1bGF0aW9uLW5lZWRlZC10by1hZHZhbmNlLWNpcmN1bGFyLWVjb25vbXkv0gEA?oc=5\" target=\"_blank\">Regulation needed to advance circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Waste Management Review<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Regulation needed to advance circular economy - Waste Management Review","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9yZWd1bGF0aW9uLW5lZWRlZC10by1hZHZhbmNlLWNpcmN1bGFyLWVjb25vbXkv0gEA?oc=5\" target=\"_blank\">Regulation needed to advance circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Waste Management Review<\/font>","source.href":"https:\/\/wastemanagementreview.com.au","source.title":"Waste Management Review","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Recycling is one link in the circular economy – but it’s the link that closes the loop. Suzanne Toumbourou, CEO of the Australian Council of Recycling, talks about the importance of regulatory support and end markets. The past few months have been tough for the recycling industry in Australia. Although the industry is as disappointed in the collapse of REDcycle as the general public, it is also acutely aware of the circumstances and challenges that led to it. It was the result of a fragmented and misaligned regulatory system, exponential growth in the amount of post-consumer soft plastics collected, disruption to recycling infrastructure and stagnated market demand for the recycled products produced. All these factors can be distilled down to the fundamental lack of co-ordination between environmental policies, and circular economy principles that hinder the recycling sector’s ability to maximise resource recovery and create a strong and resilient industry. A toxic context As the leading national industry association for the recycling and resource recovery sector in Australia, the Australian Council of Recycling (ACOR), has long advocated for a circular economy where resource recovery, remanufacturing and recycling are recognised and supported as integral functions of this circular process. However, the current regulatory framework in place for waste – and therefore resource recovery, remanufacturing and recycling – is decidedly linear. Across all jurisdictions, government departments and regulatory bodies are all too often drawing a straight line from new product to ‘waste’ – and are not creating the environment, incentives, and end markets to turn that ‘waste’ back into new products. The regulatory framework for waste is so fractured that recycling is presently an exception of the process, rather than the goal. Treating all materials as (eventual) waste turns the entire process into a disposal logistics operation, rather than a resource recovery opportunity. This has led to the various environmental bodies across jurisdictions becoming more focused on mitigating risk than recycling right. This risk mitigation creates additional burdens on recyclers, such as exorbitant financial assurances and insurance costs and is not a context in which they can operate optimally. Regulators wanting risk-free, guaranteed outcomes that predominantly longstanding conventional processes are able to provide, leave innovators out in the cold with the barriers to entry simply too high. While we support sensible and safe risk mitigation policies, the same risks are simply not present across all material streams within the ecosystem. The one-size-fits-most risk mitigation policies for waste does not fit all recyclers – not to mention the fact that virgin and new materials are not scrutinised under these same parameters. We have to balance safety and efficiency and enable recovered resources to compete on a more level playing field with virgin resources. This is particularly poignant in priorities around storage. The overarching theme that ‘stockpiling’ recoverable resources is always a dangerous practice and a betrayal of the ethos of recycling needs to be abandoned. Storing materials is a legitimate and often necessary operational function across all manufacturing enterprises. However, the regulatory landscape that has been created in which ‘all discarded or surplus material is ‘waste’’ means that when it comes to recycling, the storage of recoverable resources is demonised, while perfectly acceptable in other adjacent industries. We must avoid the rise of Schrodingers Stockpiles, where stored materials are arbitrarily deemed as hazardous waste – potentially condemned to landfill or progressed through the recycling system and turned into new products. The stockpiles exist in both states – waste and recoverable resources – and their final state is only decided by how rapidly it moves through the recycling pipeline. The lack of nationally harmonised definitions of waste, recycling and recoverable resources respectively further creates confusion, contamination and missed economic opportunities. We need a conscious uncoupling of recycling and waste management, and we must draw a definitive (regulatory) line between the two. At the very least, we need a nationally agreed definition of end-of-waste, and a nationally consistent regulatory framework and governance model that includes industry at the table. A spoke in the wheel There are three main phases in recycling: collection, processing, and end markets. Our industry cannot direct the volume and quality of the material that flows into our operations, but we can control what comes out – and there must be markets for what does. There are currently barriers to strong market uptake of recycled material, including cost competitiveness with virgin materials and willingness within the supply chain to embrace change. The manufacturing and remanufacturing process needs more support from governments, private businesses, and consumers. This should include a legislated minimum recycled content component for all new product packaging. Along with many others in the industry, we would like to see the 2025 National Packaging Targets designed by the Australian Packaging Covenant Organisation mandated. This would promote strong end markets by 2025, ensuring that 50 per cent of average recycled content is included in packaging, and making 100 per cent of packaging reusable, recyclable or compostable. These mandates should apply to all packaging that is sold in Australia and should be benchmarked and regularly and transparently reported on. This level of government support for a thriving, competitive recycling market through mandated recycled content in packaging would help kick-start supply chain integration of recycled products and materials and establish robust and resilient end markets. Closing the loop The recycling sector continues to face a fragmented, variable, and duplicative regulatory environment across Australia’s states and territories, which undermines investor confidence in recycling infrastructure, and public confidence in recycling overall. Australia’s governments must come together with industry to develop a nationally agreed definition of end-of-waste, a nationally consistent regulatory framework, and a robust governance model that delivers best-practice regulation. Many gaps in the system resulted in a significant disruption to soft plastics recycling. We must urgently address these gaps to safeguard the sector. Recycling is just one link in the circular economy – but it’s the link that closes the loop. Given the right regulatory support and strong end markets, recycling can supercharge the circular economy, delivering significant social, economic, and environmental value like never before.","filter_flag":1}
{"title":"Technology and Fashion: A Step Towards Greener Innovation - Fibre2fashion.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTYzMS90ZWNobm9sb2d5LWFuZC1mYXNoaW9uLWEtc3RlcC10b3dhcmRzLWdyZWVuZXItaW5ub3ZhdGlvbtIBdWh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTYzMS90ZWNobm9sb2d5LWFuZC1mYXNoaW9uLWEtc3RlcC10b3dhcmRzLWdyZWVuZXItaW5ub3ZhdGlvbj9hbXA9dHJ1ZQ?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTYzMS90ZWNobm9sb2d5LWFuZC1mYXNoaW9uLWEtc3RlcC10b3dhcmRzLWdyZWVuZXItaW5ub3ZhdGlvbtIBdWh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTYzMS90ZWNobm9sb2d5LWFuZC1mYXNoaW9uLWEtc3RlcC10b3dhcmRzLWdyZWVuZXItaW5ub3ZhdGlvbj9hbXA9dHJ1ZQ?oc=5","id":"CBMibGh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTYzMS90ZWNobm9sb2d5LWFuZC1mYXNoaW9uLWEtc3RlcC10b3dhcmRzLWdyZWVuZXItaW5ub3ZhdGlvbtIBdWh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTYzMS90ZWNobm9sb2d5LWFuZC1mYXNoaW9uLWEtc3RlcC10b3dhcmRzLWdyZWVuZXItaW5ub3ZhdGlvbj9hbXA9dHJ1ZQ","guidislink":false,"published":"Tue, 09 May 2023 12:26:18 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=9, tm_hour=12, tm_min=26, tm_sec=18, tm_wday=1, tm_yday=129, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTYzMS90ZWNobm9sb2d5LWFuZC1mYXNoaW9uLWEtc3RlcC10b3dhcmRzLWdyZWVuZXItaW5ub3ZhdGlvbtIBdWh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTYzMS90ZWNobm9sb2d5LWFuZC1mYXNoaW9uLWEtc3RlcC10b3dhcmRzLWdyZWVuZXItaW5ub3ZhdGlvbj9hbXA9dHJ1ZQ?oc=5\" target=\"_blank\">Technology and Fashion: A Step Towards Greener Innovation<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2fashion.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Technology and Fashion: A Step Towards Greener Innovation - Fibre2fashion.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTYzMS90ZWNobm9sb2d5LWFuZC1mYXNoaW9uLWEtc3RlcC10b3dhcmRzLWdyZWVuZXItaW5ub3ZhdGlvbtIBdWh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTYzMS90ZWNobm9sb2d5LWFuZC1mYXNoaW9uLWEtc3RlcC10b3dhcmRzLWdyZWVuZXItaW5ub3ZhdGlvbj9hbXA9dHJ1ZQ?oc=5\" target=\"_blank\">Technology and Fashion: A Step Towards Greener Innovation<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2fashion.com<\/font>","source.href":"https:\/\/www.fibre2fashion.com","source.title":"Fibre2fashion.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"As we face global challenges such as climate change, it is increasingly important for designers to prioritise sustainability in their work. By creating products and systems that are environmentally friendly, socially responsible, and economically viable, they can help to create a more sustainable future for us and our future generations. These days, there is a gradual and responsible shift taking place from a linear ‘take-make-dispose’ model to a circular economy. Sustainability means using resources and managing our environment in a way that meets the needs of today without compromising the ability of future generations to meet their own needs. In other words, living sustainably involves making choices that consider the long-term impact on the planet, the economy, and society as a whole. It means using renewable resources, reducing waste, protecting natural habitats, and ensuring that everyone has access to essential resources and opportunities. That’s about finding a balance between economic growth, social development, and environmental protection. Essentially, it is about living our lives in a way that supports the health and well-being of our planet and all the living things on it, while also ensuring that we can continue to thrive for generations to come. This means making conscious choices about how we consume and produce goods and services, and working towards creating a more equitable, inclusive, and resilient society that values the long-term health of our planet and all its inhabitants. Sustainable design and technology have a close relationship as they both aim to minimise the negative impacts of human activities on the environment. Designers use technology as a tool to create sustainable products and systems that are energy-efficient, use renewable resources, reduce waste, and are environmentally friendly. Technology can help designers to identify problems and come up with sustainable solutions by minimising the use of resources and energy, serving as a tool to create environmentally friendly answers to challenges. This can be seen in the development of sustainable building and energy systems, eco-friendly materials, and waste management processes. Sustainable design and technology have also enabled the development of new products and services that promote sustainability in various industries. For instance, sustainable fashion brands use technology to produce eco-friendly textiles, reduce water consumption in textile manufacturing, and improve supply chain transparency. Thus, the relationship between sustainable design and technology is mutually reinforcing as both work towards creating a more sustainable future by minimising the negative environmental impacts of human activities. As sustainability has become a growing concern in the fashion industry, many brands are now adopting sustainable practices and materials to reduce their impact on the environment and promote ethical production practices. Here are some examples of sustainable fashion brands: 1. Patagonia - This outdoor clothing company has been a pioneer in environmental sustainability and ethical sourcing. It uses recycled materials and has implemented fair labour practices. 2. Reformation - This fashion brand focuses on sustainable fashion for women. It uses eco-friendly materials and has a rigorous sustainability programme that includes recycling and reducing waste. 3. Everlane - This online retailer focuses on ethical manufacturing, radical transparency, and sustainable materials. It is committed to reducing its carbon footprint and improving its impact on the environment. 4. Stella McCartney - This luxury fashion brand has an eco-friendly ethos and uses sustainable materials like organic cotton, recycled polyester, and vegan leather. It also has a focus on ethical animal welfare. 5. Eileen Fisher - This brand focuses on environmentally sustainable and socially responsible practices. It utilises organic cotton and non-toxic dyes and has a closed-loop system to minimise waste. Since sustainability is becoming a more significant consideration for consumers, these and other such brands are leading the way in creating sustainable fashion that is stylish, high-quality, and environmentally conscious. Technology provides designers with the tools and resources needed to implement sustainable design features. This combination of sustainability, technology and fashion will lead to the development of innovative materials and production methods that can reduce waste and pollution while also improving the quality and durability of fashion products. Sustainable technologies such as 3D printing, biodegradable and eco-friendly fabrics, and digital manufacturing can enable the creation of more sustainable and ethical products. In addition, the use of technology can enable better tracking and monitoring durability of fashion products. Some examples of sustainable technology in fashion include: 1. Sustainable fibres and fabrics: Eco-friendly and sustainable fabrics such as organic cotton, bamboo, hemp, and recycled polyester are being used by fashion brands to reduce the environmental impact of their production process. 2. 3D printing: 3D printing is a sustainable technology that can be used to create custom designs and tailor-made clothing. It reduces the need for mass production and eliminates waste by only producing what is needed. 3. Dyeing and finishing: Traditional dyeing and finishing processes use harmful chemicals that can pollute waterways and harm workers. Sustainable technologies like natural dyes and waterless dyeing are being used by some brands to reduce the environmental impact of dyeing and finishing. 4. Upcycling and recycling: Upcycling and recycling are sustainable practices that involve turning waste materials into new products. Some fashion brands are incorporating these practices into their production process, creating unique clothing made from recycled materials. Overall, the combination of sustainable technology and fashion is driving innovation towards a more sustainable and circular fashion industry. It is encouraging to see that many brands are adopting these practices, making them more accessible, and contributing towards a greener future.","filter_flag":1}
{"title":"Good News – Your Breakfast Cereal Should Stop Killing The Planet By 2050 - Yahoo Canada Sports","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vY2Euc3BvcnRzLnlhaG9vLmNvbS9uZXdzL2dvb2QtbmV3cy1icmVha2Zhc3QtY2VyZWFsLXN0b3AtMTYzNTI2NTI5Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vY2Euc3BvcnRzLnlhaG9vLmNvbS9uZXdzL2dvb2QtbmV3cy1icmVha2Zhc3QtY2VyZWFsLXN0b3AtMTYzNTI2NTI5Lmh0bWzSAQA?oc=5","id":"CBMiT2h0dHBzOi8vY2Euc3BvcnRzLnlhaG9vLmNvbS9uZXdzL2dvb2QtbmV3cy1icmVha2Zhc3QtY2VyZWFsLXN0b3AtMTYzNTI2NTI5Lmh0bWzSAQA","guidislink":false,"published":"Wed, 10 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=130, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vY2Euc3BvcnRzLnlhaG9vLmNvbS9uZXdzL2dvb2QtbmV3cy1icmVha2Zhc3QtY2VyZWFsLXN0b3AtMTYzNTI2NTI5Lmh0bWzSAQA?oc=5\" target=\"_blank\">Good News – Your Breakfast Cereal Should Stop Killing The Planet By 2050<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Canada Sports<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Good News – Your Breakfast Cereal Should Stop Killing The Planet By 2050 - Yahoo Canada Sports","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vY2Euc3BvcnRzLnlhaG9vLmNvbS9uZXdzL2dvb2QtbmV3cy1icmVha2Zhc3QtY2VyZWFsLXN0b3AtMTYzNTI2NTI5Lmh0bWzSAQA?oc=5\" target=\"_blank\">Good News – Your Breakfast Cereal Should Stop Killing The Planet By 2050<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Canada Sports<\/font>","source.href":"https:\/\/ca.sports.yahoo.com","source.title":"Yahoo Canada Sports","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Good News – Your Breakfast Cereal Should Stop Killing The Planet By 2050 Your breakfast cereal should start being more environmentally-friendly within the next few decades, according to food giant Nestle. Your breakfast cereal should start being more environmentally-friendly within the next few decades, according to food giant Nestle. Your breakfast cereal should be more environmentally-friendly by 2050, according to Nestlé. Yes, the world’s largest food and drink company behind Nesquik, Cheerios, and Chocapic is hoping to make your first meal potentially the most eco-conscious one of your whole day. Cereal Partners Worldwide (CPW) – the name of the partnership between Nestlé and General Mills, which together make Nestlé Breakfast Cereals – announced last week their plan to halve their own greenhouse gas emissions by 2030, and reach net zero emissions by 2050. David Clark, president and CEO at Cereal Partners Worldwide, acknowledged the growing threat of climate change and said: “As a company, we have a responsibility not only to our consumers but also to the communities in which we operate and to the planet.” He added: “We have paid close attention to how we source ingredients and make our products for many years – so this is not the start of our journey to contribute to a better planet. “The development of our 2050 Net Zero Roadmap is an important next step, and we are pleased to be setting ourselves clear actions to ensure we meet our targets.” How is breakfast cereal bad for the environment? As independent authority, The Good Shopping Guide, explained: “Toxic chemicals, pesticides, palm oil, and other non-sustainable ingredients in breakfast cereals is responsible for deforestation, habitat loss, and forcibly relocating indigenous communities. There’s also a surprising lack of vegetarian and vegan cereal options!” It currently gives Nestlé a 43\/100 ethical score. How will your Nestlé becoming more eco-friendly? It all comes down to sourcing the ingredients, according to CPW, as this contributes 56% of the company’s greenhouse gas emissions. The company will be looking to focus on regenerative agriculture instead. This is where farmers are assisted in safeguarding their local biodiversity, water supplies and soil health, while reducing their dependency on conventional agri-chemicals. It’s also shifting towards using palm oil, pulp, paper and cocoa supplies which are 100% deforestation-free. CWP claims it will choose ingredients with lower carbon footprint by repurposing by-products or waste materials into new products and prioritising circular economy business models. Packaging will apparently be made 100% from recycled materials by 2025, and it hopes to use 100% grid-sourced renewable electricity, switching to alternative renewable energy sources and reducing waste, too. Related...","filter_flag":1}
{"title":"12 May: Earth Overshoot Day - Endesa","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LmVuZGVzYS5jb20vZW4vdGhlLWUtZmFjZS9jaXJjdWxhci1lY29ub215L3JhcXVlbC1jYW5hbGVzLTEyLW1heS1kYXktb3ZlcmNhcGFjaXR5LWVhcnRoLWNpcmN1bGFyLWVjb25vbXnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LmVuZGVzYS5jb20vZW4vdGhlLWUtZmFjZS9jaXJjdWxhci1lY29ub215L3JhcXVlbC1jYW5hbGVzLTEyLW1heS1kYXktb3ZlcmNhcGFjaXR5LWVhcnRoLWNpcmN1bGFyLWVjb25vbXnSAQA?oc=5","id":"CBMic2h0dHBzOi8vd3d3LmVuZGVzYS5jb20vZW4vdGhlLWUtZmFjZS9jaXJjdWxhci1lY29ub215L3JhcXVlbC1jYW5hbGVzLTEyLW1heS1kYXktb3ZlcmNhcGFjaXR5LWVhcnRoLWNpcmN1bGFyLWVjb25vbXnSAQA","guidislink":false,"published":"Fri, 19 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=139, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LmVuZGVzYS5jb20vZW4vdGhlLWUtZmFjZS9jaXJjdWxhci1lY29ub215L3JhcXVlbC1jYW5hbGVzLTEyLW1heS1kYXktb3ZlcmNhcGFjaXR5LWVhcnRoLWNpcmN1bGFyLWVjb25vbXnSAQA?oc=5\" target=\"_blank\">12 May: Earth Overshoot Day<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Endesa<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"12 May: Earth Overshoot Day - Endesa","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LmVuZGVzYS5jb20vZW4vdGhlLWUtZmFjZS9jaXJjdWxhci1lY29ub215L3JhcXVlbC1jYW5hbGVzLTEyLW1heS1kYXktb3ZlcmNhcGFjaXR5LWVhcnRoLWNpcmN1bGFyLWVjb25vbXnSAQA?oc=5\" target=\"_blank\">12 May: Earth Overshoot Day<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Endesa<\/font>","source.href":"https:\/\/www.endesa.com","source.title":"Endesa","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"12 May 2023 was Country Overshoot Day for Spain. From that date, all the resources that the planet can renew in a year will have been consumed. This day is calculated using two principal concepts: the planet's biocapacity, which is the amount of ecological resources the planet is able to generate (in global hectares) and the ecological footprint, i.e. the annual consumption of ecological resources by humanity. This date undoubtedly reflects the pressure to which we are subjecting the planet, highlighting the need to change how we produce and consume today. In 2023 it was 12 May, but what happened in previous years? Since 1971 this deadline has been continuously brought forward, so that in 2018 the date was 11 June, in 2019 May 29, in 2020 May 27 and in 2021 May 25. These are dates that point to an unsustainable economy in terms of the relationship with the biocapacity and ecological footprint of our planet, mainly due to certain human activities such as the increase in greenhouse gas emissions chiefly resulting from the burning of fossil fuels, deforestation and agricultural overexploitation. The current consumption model means that, every year, we need the equivalent of 1.75 planets to meet our resource needs, of which 68% are not renewable (such as minerals and fossil fuels, for example).","filter_flag":1}
{"title":"The future of the European textile industry is now - The Brussels Times","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmJydXNzZWxzdGltZXMuY29tLzUxNzEwOS90aGUtZnV0dXJlLW9mLXRoZS1ldXJvcGVhbi10ZXh0aWxlLWluZHVzdHJ5LWlzLW5vd9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmJydXNzZWxzdGltZXMuY29tLzUxNzEwOS90aGUtZnV0dXJlLW9mLXRoZS1ldXJvcGVhbi10ZXh0aWxlLWluZHVzdHJ5LWlzLW5vd9IBAA?oc=5","id":"CBMiV2h0dHBzOi8vd3d3LmJydXNzZWxzdGltZXMuY29tLzUxNzEwOS90aGUtZnV0dXJlLW9mLXRoZS1ldXJvcGVhbi10ZXh0aWxlLWluZHVzdHJ5LWlzLW5vd9IBAA","guidislink":false,"published":"Tue, 23 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=143, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmJydXNzZWxzdGltZXMuY29tLzUxNzEwOS90aGUtZnV0dXJlLW9mLXRoZS1ldXJvcGVhbi10ZXh0aWxlLWluZHVzdHJ5LWlzLW5vd9IBAA?oc=5\" target=\"_blank\">The future of the European textile industry is now<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Brussels Times<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The future of the European textile industry is now - The Brussels Times","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmJydXNzZWxzdGltZXMuY29tLzUxNzEwOS90aGUtZnV0dXJlLW9mLXRoZS1ldXJvcGVhbi10ZXh0aWxlLWluZHVzdHJ5LWlzLW5vd9IBAA?oc=5\" target=\"_blank\">The future of the European textile industry is now<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Brussels Times<\/font>","source.href":"https:\/\/www.brusselstimes.com","source.title":"The Brussels Times","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"This is an opinion article by an external contributor. The views belong to the writer. In March 2022, the European Commission published the EU Strategy for Sustainable & Circular Textiles; it followed the European Industrial Strategy where 14 priority industrial ecosystems – among which textiles – were identified to achieve the “twin transition to a green and digital economy, make EU industry more competitive globally, and enhance Europe’s open strategic autonomy.” But what is the EU Textile Strategy and what concrete impact will it have on the European textile industry and its citizens? With over 160.000 companies employing 1.3 million people, the European textile industry is a vital part of European society. Textiles have a profound impact on the local economy and on local communities across all EU regions by generating jobs and creating business opportunities; also, European textiles and fashion is an integral part of European culture with deep root in cultural heritage while setting the creative trends all over the world. Composed mainly of SMEs, the European textile industry generated a turnover of €169 billion in 2022 – an increase of 13% compared to 2021. But, according to the European Union, textile is the fourth highest industry to have an impact on the environment and climate change, it is one of the top 3 industries for water and land use, and among the top 5 in terms of raw materials use and greenhouse gas emission. The EU Strategy for Sustainable & Circular Textiles aims at mitigating the impact of the textile industry on the environment while enhancing its competitiveness and resilience through a series of new and game-changing regulations – such as eco-design (ESPR), Product Environmental Footprint (PEF), Extended Producer Responsibility (EPR), Due Diligence, the creation of a digital product passport, the analysis of the impact of microplastics and harmful chemicals to find solutions, as well as regulating so-called “green claims” and ecolabel to ensure such a claim is accurately presented to consumers. The EU Textile Strategy also aims to tackle the issue of over-production and over-consumption by promoting high quality durable, repairable and recyclable textiles and fibres; indeed, fast fashion is out of fashion. A key element for the future of European textiles is the establishment of compulsory textile waste collection by 2025, sparking the need for a new business model and supply chain, as well as a Europe-wide level plain field, concrete investments in innovation and skills leading towards a tangible green and realistic digital transition. The European Commission, through partners and agencies, is supporting the development and implementation of projects to create a new circular economy, where textiles and clothes can and are reused, repaired and recycled. After clothes have been used and then mended many times, citizens will be able to recycle them in the same way as they now recycle plastic, fuelling the textile industry with recycled materials and triggering a new circular economy. Currently, many pilot projects are being implemented exploring possibilities for new products and services, which will soon become everyday reality.","filter_flag":1}
{"title":"VIC Gov introduces new glass recycling bins - Council - Council Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vY291bmNpbG1hZ2F6aW5lLmNvbS5hdS92aWMtZ292LWludHJvZHVjZXMtbmV3LWdsYXNzLXJlY3ljbGluZy1iaW5zL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vY291bmNpbG1hZ2F6aW5lLmNvbS5hdS92aWMtZ292LWludHJvZHVjZXMtbmV3LWdsYXNzLXJlY3ljbGluZy1iaW5zL9IBAA?oc=5","id":"CBMiS2h0dHBzOi8vY291bmNpbG1hZ2F6aW5lLmNvbS5hdS92aWMtZ292LWludHJvZHVjZXMtbmV3LWdsYXNzLXJlY3ljbGluZy1iaW5zL9IBAA","guidislink":false,"published":"Mon, 15 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=15, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=135, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vY291bmNpbG1hZ2F6aW5lLmNvbS5hdS92aWMtZ292LWludHJvZHVjZXMtbmV3LWdsYXNzLXJlY3ljbGluZy1iaW5zL9IBAA?oc=5\" target=\"_blank\">VIC Gov introduces new glass recycling bins - Council<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Council Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"VIC Gov introduces new glass recycling bins - Council - Council Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vY291bmNpbG1hZ2F6aW5lLmNvbS5hdS92aWMtZ292LWludHJvZHVjZXMtbmV3LWdsYXNzLXJlY3ljbGluZy1iaW5zL9IBAA?oc=5\" target=\"_blank\">VIC Gov introduces new glass recycling bins - Council<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Council Magazine<\/font>","source.href":"https:\/\/councilmagazine.com.au","source.title":"Council Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"The Victorian Government is rolling out new bins across the state for recycling glass, with many councils taking up the new initiative. Acting State Minister for Environment, Lily D’Ambrosio, visited the City of Merri-bek to announce that the new purple-lidded bins are being rolled out to residents across the municipality, with the rollout to be complete by July 2023. “The four-stream recycling system will work alongside the new Container Deposit Scheme to make it easier than ever for Victorians to recycle their glass, so that it can be turned into new products,” Ms D’Ambrosio said. “Our new household recycling services will maximise our recycling capacity, create new jobs and divert 80 per cent of waste from landfill by 2030, while helping to reduce emissions by 50 per cent.” By separating glass, Victoria will be able to recycle more glass into new products and re-use more materials from the yellow mixed recycling bin due to reduced contamination from glass. The glass bin will work alongside Victoria’s new container deposit scheme, CDS Vic, which commences on 1 November 2023 – making it easier for Victorians to recycle their glass whether they are at home or out in the community. The City of Merri-bek will become the 13th early-mover council to complete the rollout of its kerbside glass service, joining Ararat, Whittlesea, Colac Otway, Hobsons Bay, Horsham, Macedon Ranges, Moyne, Pyrenees, Surf Coast, Warrnambool, City of Yarra and Yarriambiack, with other councils continuing to prepare for their rollout. City of Merri-bek Mayor, Angelica Panopoulos, said, “We’re proud to be a leader in sustainability and early adopter of the four-stream waste service, and this funding will help us ensure the transition is as smooth as possible for our community.” The government has invested $129 million to support all Victorian councils to buy new bins, improve drop-off facilities, deliver education campaigns and ensure they have the infrastructure in place to roll out these reforms. The four-stream recycling system is a key part of the government’s waste and recycling reforms, ensuring that it meets its goal of diverting 80 per cent of all material away from landfill by 2030, including 20,000t of glass. The government said the reforms will create nearly 4,000 new jobs for Victorians and boost the state’s economy by up to $6.7 billion by 2030 – backed by its $515 million investment to deliver the biggest ever transformation of the waste and recycling sector in the state’s history. This investment includes $380 million to deliver the circular economy policy, Recycling Victoria: A new economy, which will further reduce waste, boost jobs and establish a recycling system Victorians can rely on.","filter_flag":1}
{"title":"Parry & Evans steps up recycling efforts with new Deeside facility - Deeside.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmRlZXNpZGUuY29tL3BhcnJ5LWV2YW5zLXN0ZXBzLXVwLXJlY3ljbGluZy1lZmZvcnRzLXdpdGgtbmV3LWRlZXNpZGUtZmFjaWxpdHkv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmRlZXNpZGUuY29tL3BhcnJ5LWV2YW5zLXN0ZXBzLXVwLXJlY3ljbGluZy1lZmZvcnRzLXdpdGgtbmV3LWRlZXNpZGUtZmFjaWxpdHkv0gEA?oc=5","id":"CBMiWWh0dHBzOi8vd3d3LmRlZXNpZGUuY29tL3BhcnJ5LWV2YW5zLXN0ZXBzLXVwLXJlY3ljbGluZy1lZmZvcnRzLXdpdGgtbmV3LWRlZXNpZGUtZmFjaWxpdHkv0gEA","guidislink":false,"published":"Wed, 31 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=151, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmRlZXNpZGUuY29tL3BhcnJ5LWV2YW5zLXN0ZXBzLXVwLXJlY3ljbGluZy1lZmZvcnRzLXdpdGgtbmV3LWRlZXNpZGUtZmFjaWxpdHkv0gEA?oc=5\" target=\"_blank\">Parry & Evans steps up recycling efforts with new Deeside facility<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deeside.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Parry & Evans steps up recycling efforts with new Deeside facility - Deeside.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmRlZXNpZGUuY29tL3BhcnJ5LWV2YW5zLXN0ZXBzLXVwLXJlY3ljbGluZy1lZmZvcnRzLXdpdGgtbmV3LWRlZXNpZGUtZmFjaWxpdHkv0gEA?oc=5\" target=\"_blank\">Parry & Evans steps up recycling efforts with new Deeside facility<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deeside.com<\/font>","source.href":"https:\/\/www.deeside.com","source.title":"Deeside.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Parry & Evans steps up recycling efforts with new Deeside facility This article is old - Published: Wednesday, May 31st, 2023 In a boost to recycling efforts in Wales, family-owned business Parry & Evans has opened its new plastic recycling facility in Deeside. The ribbon-cutting ceremony was graced by local Member of the Senedd, Jack Sargeant, and Managing Director Steve Evans, along with his sons Lee and Jordan Evans. The new facility is equipped to process various grades of plastics, transforming them into flakes and pellets that can be recycled into new products. This development is a testament to the company’s commitment to the circular economy and enhancing recycling capabilities in the region. Alyn and Deeside MS Jack Sargeant, lauded the initiative, saying, “The climate crisis is the biggest issue we face in society. Recycling contributes to mitigating that. In Wales, we have a great recycling record, but this new facility in Wales adds to that record and I congratulate Parry & Evans for that.” Parry & Evans, with operations across its sites in Deeside and Welshpool, has continually invested in improving its services to customers. The construction of the new plastics recycling facility is a significant step in this direction, enabling the company to process even more material along with paper and cardboard, glass, metals, and wood. Steve Evans, Managing Director of Parry & Evans, expressed his enthusiasm about the new facility, stating, “We look forward to working with councils and businesses across the UK to process their plastics as part of the circular economy.” This development underscores the growing momentum in the recycling sector in the UK, as businesses and governments alike recognise the importance of sustainable practices in mitigating the effects of climate change.","filter_flag":1}
{"title":"Union Minister Hardeep S Puri launches mega campaign 'Meri LiFE, Mera Swachh Shehar'. - Etemaad","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihwFodHRwczovL3d3dy5lbi5ldGVtYWFkZGFpbHkuY29tL3dvcmxkL25hdGlvbmFsL3VuaW9uLW1pbmlzdGVyLWhhcmRlZXAtcy1wdXJpLWxhdW5jaGVzLW1lZ2EtY2FtcGFpZ24tbWVyaS1saWZlLW1lcmEtc3dhY2hoLXNoZWhhcjoxMzE3OTHSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihwFodHRwczovL3d3dy5lbi5ldGVtYWFkZGFpbHkuY29tL3dvcmxkL25hdGlvbmFsL3VuaW9uLW1pbmlzdGVyLWhhcmRlZXAtcy1wdXJpLWxhdW5jaGVzLW1lZ2EtY2FtcGFpZ24tbWVyaS1saWZlLW1lcmEtc3dhY2hoLXNoZWhhcjoxMzE3OTHSAQA?oc=5","id":"CBMihwFodHRwczovL3d3dy5lbi5ldGVtYWFkZGFpbHkuY29tL3dvcmxkL25hdGlvbmFsL3VuaW9uLW1pbmlzdGVyLWhhcmRlZXAtcy1wdXJpLWxhdW5jaGVzLW1lZ2EtY2FtcGFpZ24tbWVyaS1saWZlLW1lcmEtc3dhY2hoLXNoZWhhcjoxMzE3OTHSAQA","guidislink":false,"published":"Tue, 16 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=136, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihwFodHRwczovL3d3dy5lbi5ldGVtYWFkZGFpbHkuY29tL3dvcmxkL25hdGlvbmFsL3VuaW9uLW1pbmlzdGVyLWhhcmRlZXAtcy1wdXJpLWxhdW5jaGVzLW1lZ2EtY2FtcGFpZ24tbWVyaS1saWZlLW1lcmEtc3dhY2hoLXNoZWhhcjoxMzE3OTHSAQA?oc=5\" target=\"_blank\">Union Minister Hardeep S Puri launches mega campaign 'Meri LiFE, Mera Swachh Shehar'.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Etemaad<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Union Minister Hardeep S Puri launches mega campaign 'Meri LiFE, Mera Swachh Shehar'. - Etemaad","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihwFodHRwczovL3d3dy5lbi5ldGVtYWFkZGFpbHkuY29tL3dvcmxkL25hdGlvbmFsL3VuaW9uLW1pbmlzdGVyLWhhcmRlZXAtcy1wdXJpLWxhdW5jaGVzLW1lZ2EtY2FtcGFpZ24tbWVyaS1saWZlLW1lcmEtc3dhY2hoLXNoZWhhcjoxMzE3OTHSAQA?oc=5\" target=\"_blank\">Union Minister Hardeep S Puri launches mega campaign 'Meri LiFE, Mera Swachh Shehar'.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Etemaad<\/font>","source.href":"https:\/\/www.en.etemaaddaily.com","source.title":"Etemaad","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"New Delhi: Minister for Housing and Urban Affairs Hardeep S Puri launched his Ministry's mega campaign ‘Meri LiFE, Mera Swachh Shehar’, in New Delhi yesterday. This campaign aims to champion, Reduce, Reuse, and Recycle (RRR) concept of waste management. Under this nationwide campaign, RRR Centres or one-stop collection centres will be set up where citizens can give their used clothes, shoes, old books, toys and plastic to be reused or recycled. This three-week campaign will strengthen citizens' resolve under SBM-U 2.0 - to reduce, reuse and recycle - and will also champion Mission LiFE’s objective of taking collective action for the protection and conservation of the environment by adopting sustainable daily habits. The RRR Centres are scheduled to be launched nationwide on the 20th of this month and will serve as a one-stop solution for citizens, institutions, and commercial enterprises to deposit unused or used plastic items, clothes, shoes, footwear, books, and toys. After collection, these items will be given to different stakeholders to be refurbished for reuse or would be made into new products, thus truly taking forward the Government’s vision of a circular economy. The Meri LiFE, Mera Swachh Shehar will culminate on the 5th of next month with the Pledge for LiFE, which will be undertaken by everyone on the occasion of World Environment Day as well as large-scale cleanliness drives across all cities. ","filter_flag":1}
