{"title":"TransPennine Express makes Cleethorpes, Hull and Scarborough stations even greener with new coffee cup recycling ... - TransPennine Express News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMinQFodHRwczovL21lZGlhY2VudHJlLnRwZXhwcmVzcy5jby51ay9uZXdzL3RyYW5zcGVubmluZS1leHByZXNzLW1ha2VzLWNsZWV0aG9ycGVzLWh1bGwtYW5kLXNjYXJib3JvdWdoLXN0YXRpb25zLWV2ZW4tZ3JlZW5lci13aXRoLW5ldy1jb2ZmZWUtY3VwLXJlY3ljbGluZy1iaW5z0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMinQFodHRwczovL21lZGlhY2VudHJlLnRwZXhwcmVzcy5jby51ay9uZXdzL3RyYW5zcGVubmluZS1leHByZXNzLW1ha2VzLWNsZWV0aG9ycGVzLWh1bGwtYW5kLXNjYXJib3JvdWdoLXN0YXRpb25zLWV2ZW4tZ3JlZW5lci13aXRoLW5ldy1jb2ZmZWUtY3VwLXJlY3ljbGluZy1iaW5z0gEA?oc=5","id":"CBMinQFodHRwczovL21lZGlhY2VudHJlLnRwZXhwcmVzcy5jby51ay9uZXdzL3RyYW5zcGVubmluZS1leHByZXNzLW1ha2VzLWNsZWV0aG9ycGVzLWh1bGwtYW5kLXNjYXJib3JvdWdoLXN0YXRpb25zLWV2ZW4tZ3JlZW5lci13aXRoLW5ldy1jb2ZmZWUtY3VwLXJlY3ljbGluZy1iaW5z0gEA","guidislink":false,"published":"Tue, 16 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=136, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinQFodHRwczovL21lZGlhY2VudHJlLnRwZXhwcmVzcy5jby51ay9uZXdzL3RyYW5zcGVubmluZS1leHByZXNzLW1ha2VzLWNsZWV0aG9ycGVzLWh1bGwtYW5kLXNjYXJib3JvdWdoLXN0YXRpb25zLWV2ZW4tZ3JlZW5lci13aXRoLW5ldy1jb2ZmZWUtY3VwLXJlY3ljbGluZy1iaW5z0gEA?oc=5\" target=\"_blank\">TransPennine Express makes Cleethorpes, Hull and Scarborough stations even greener with new coffee cup recycling ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TransPennine Express News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"TransPennine Express makes Cleethorpes, Hull and Scarborough stations even greener with new coffee cup recycling ... - TransPennine Express News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinQFodHRwczovL21lZGlhY2VudHJlLnRwZXhwcmVzcy5jby51ay9uZXdzL3RyYW5zcGVubmluZS1leHByZXNzLW1ha2VzLWNsZWV0aG9ycGVzLWh1bGwtYW5kLXNjYXJib3JvdWdoLXN0YXRpb25zLWV2ZW4tZ3JlZW5lci13aXRoLW5ldy1jb2ZmZWUtY3VwLXJlY3ljbGluZy1iaW5z0gEA?oc=5\" target=\"_blank\">TransPennine Express makes Cleethorpes, Hull and Scarborough stations even greener with new coffee cup recycling ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TransPennine Express News<\/font>","source.href":"https:\/\/mediacentre.tpexpress.co.uk","source.title":"TransPennine Express News","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"TransPennine Express (TPE) has unveiled new recycling bins, specifically for single-use coffee cups, at some of its stations as part of its commitment to sustainability. The bins have been installed at Cleethorpes, Hull and Scarborough stations as part of a trial to improve recycling at each location, with there being potential for a roll out to further stations in the future. Each bin is made up of three tubes, one for lids, one for cups and a third for any liquids. A tube bin can be found in each station in easily accessible locations. The cups that are collected will be recycled into new products, rather than being sent to landfill. Nicola Martin, Head of Sustainability for TransPennine Express, said: “TPE are committed to providing our customers with a more sustainable service. The new coffee cup bins will make it easier for our customers to recycle their waste. \"Single-use coffee cups are one of our biggest forms of customer waste we collect, and it can be extremely difficult to recover these materials from waste bins, making material recovery options limited. \"Most coffee cups are coated in plastic, with only a few specialist facilities able to process and recover the materials, meaning most cups end up at an incinerator. \"TPE is delighted to provide designated coffee cup waste recycling bins to help recover more cups through recycling routes. We are committed to providing more ways for customers to travel sustainably.” Last year TPE collected and recycled 221 tonnes of recyclable waste and the business’ recycling rate has increased from 36 per cent to 65 per cent in recent years, and we continue to send zero waste to landfill. TPE has worked closely with waste solution business, co-cre8, to produce the recycling bins and further increase the recycling rate. Peter Goodwin, Managing Director and co-founder of co-cre8, said “With hot beverage cups now one of the fastest growing waste streams, progressive businesses need solutions to effectively separate them from other materials so that they can be properly recycled. “Our range of Cup Collection Stations are not only Department for Transport (DFT) approved, but have also been proven to be both practical and durable in transport hub environments. These have also been designed with consumer engagement in mind and so we’re delighted to be helping TransPennine Express provide its customers with new ways to become more sustainable” To discover more about TPEs commitment to sustainability visit Sustainability our vision and ambition (tpexpress.co.uk)","filter_flag":1}
{"title":"Plastic export ban exemption a 'release valve' - Waste Management Review","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9wbGFzdGljLWV4cG9ydC1iYW4tZXhlbXB0aW9uLWEtcmVsZWFzZS12YWx2ZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9wbGFzdGljLWV4cG9ydC1iYW4tZXhlbXB0aW9uLWEtcmVsZWFzZS12YWx2ZS_SAQA?oc=5","id":"CBMiUmh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9wbGFzdGljLWV4cG9ydC1iYW4tZXhlbXB0aW9uLWEtcmVsZWFzZS12YWx2ZS_SAQA","guidislink":false,"published":"Fri, 19 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=139, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9wbGFzdGljLWV4cG9ydC1iYW4tZXhlbXB0aW9uLWEtcmVsZWFzZS12YWx2ZS_SAQA?oc=5\" target=\"_blank\">Plastic export ban exemption a 'release valve'<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Waste Management Review<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Plastic export ban exemption a 'release valve' - Waste Management Review","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9wbGFzdGljLWV4cG9ydC1iYW4tZXhlbXB0aW9uLWEtcmVsZWFzZS12YWx2ZS_SAQA?oc=5\" target=\"_blank\">Plastic export ban exemption a 'release valve'<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Waste Management Review<\/font>","source.href":"https:\/\/wastemanagementreview.com.au","source.title":"Waste Management Review","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"closeup escalator with a pile of plastic bottles at the factory for processing and recycling. PET recycling plant A temporary exemption on the export of waste plastic for further processing has been described as a “release valve” for the Australian recycling sector. Tanya Plibersek, Minister for Environment and Water, has granted Oatley Resources Australia a one-year exemption to export clean and sorted polyethylene terephthalate (PET) waste plastic for processing and remanufacturing into new products overseas. The exemption has been granted to help resolve domestic stockpiling issues. The export of waste plastics without a licence was banned under the Recycling and Waste Reduction Act 2020 in response to China’s refusal to accept certain types of waste. Plibersek said recycling infrastructure in Australia does not meet current needs and the exemption was granted to make sure PET is recycled and does not end up in landfill. The exemption only applies for PET that is not able to be recycled domestically. It is expected the amount that is exported will decrease over the approval period, as new recycling facilities come online. Suzanne Toumbourou, Chief Executive Officer of the Australian Council of Recycling (ACOR), said recycling facilities invested in by industry and government haven’t come online in time to address the volume of material coming through. She said an ACOR report released in 2022 showed a capacity shortfall of 5700 tonnes. “The last thing anyone wants is diversion of recyclable material to landfill,” Toumbourou said. “But if we don’t have the capability or capacity to process it here, it’s appropriate to make sure it gets recycled somewhere else while we build capacity. “A balance has to be struck. We see this as helping release the valve while some of the capacity in the pipeline gears up.” Toumbourou said she believed the 12-month exemption would not include material collected through Australia’s container deposit schemes, or clear, rigid baled beverage containers. “It’s directed at the material that is harder to reprocess here such as coloured PET, thermos trays and raw mixed material coming out of material recovery facilities. “We see this as a release valve to ensure recycled plastic doesn’t go to landfill. But we absolutely must ensure we are supporting the processing infrastructure the government and industry has jointly invested in and supporting onshore capacity when it is available.” Brett Lemin, Executive Officer of the Victorian Waste Management Association, said several members had made submissions to the government, raising concerns about the nation’s capacity to process plastic waste onshore. Senator Peter Whish-Wilson, Greens spokesperson for waste and recycling said an export ban on sending plastics overseas for recycling should have signalled a boost for Australia’s recycling industry – particularly for procurement processes – but successive governments have failed to take steps to make Australia self-sufficient waste and recycling managers. “The recycling sector has consistently called for legally binding and mandatory national packaging targets in order to have the confidence to invest in upgrading the infrastructure necessary to process plastic and other waste,” Whish-Wilson said. “The system is broken.” Related stories: Qenos, Cleanaway join forces in plastic-to-plastic recycling study REDcycle pause spurs broader industry discussion","filter_flag":1}
{"title":"City of Newcastle advances recycling initiatives with new plant - Australian Manufacturing","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmF1c3RyYWxpYW5tYW51ZmFjdHVyaW5nLmNvbS5hdS9jaXR5LW9mLW5ld2Nhc3RsZS1hZHZhbmNlcy1yZWN5Y2xpbmctaW5pdGlhdGl2ZXMtd2l0aC1uZXctcGxhbnQv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmF1c3RyYWxpYW5tYW51ZmFjdHVyaW5nLmNvbS5hdS9jaXR5LW9mLW5ld2Nhc3RsZS1hZHZhbmNlcy1yZWN5Y2xpbmctaW5pdGlhdGl2ZXMtd2l0aC1uZXctcGxhbnQv0gEA?oc=5","id":"CBMia2h0dHBzOi8vd3d3LmF1c3RyYWxpYW5tYW51ZmFjdHVyaW5nLmNvbS5hdS9jaXR5LW9mLW5ld2Nhc3RsZS1hZHZhbmNlcy1yZWN5Y2xpbmctaW5pdGlhdGl2ZXMtd2l0aC1uZXctcGxhbnQv0gEA","guidislink":false,"published":"Thu, 25 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=145, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmF1c3RyYWxpYW5tYW51ZmFjdHVyaW5nLmNvbS5hdS9jaXR5LW9mLW5ld2Nhc3RsZS1hZHZhbmNlcy1yZWN5Y2xpbmctaW5pdGlhdGl2ZXMtd2l0aC1uZXctcGxhbnQv0gEA?oc=5\" target=\"_blank\">City of Newcastle advances recycling initiatives with new plant<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Australian Manufacturing<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"City of Newcastle advances recycling initiatives with new plant - Australian Manufacturing","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmF1c3RyYWxpYW5tYW51ZmFjdHVyaW5nLmNvbS5hdS9jaXR5LW9mLW5ld2Nhc3RsZS1hZHZhbmNlcy1yZWN5Y2xpbmctaW5pdGlhdGl2ZXMtd2l0aC1uZXctcGxhbnQv0gEA?oc=5\" target=\"_blank\">City of Newcastle advances recycling initiatives with new plant<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Australian Manufacturing<\/font>","source.href":"https:\/\/www.australianmanufacturing.com.au","source.title":"Australian Manufacturing","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"The City of Newcastle is continuing its investment in the future of recycling after awarding the contract to build Newcastle’s first Material Recovery Facility (MRF). On Tuesday night, council members unanimously decided to accept a $56.7 million bid from the Australian-owned recycler iQRenew for the design and construction of the MRF at CN’s Summerhill Waste Management Facility. The plant, which will be able to process up to 85,000 tonnes of recyclables annually, will be operated and maintained by the Central Coast-based company. In a news release, CN said residents’ yellow-lid rubbish bins will be used to collect recyclables, which the MRF will separate into different materials like paper, cardboard, glass, plastics, steel, and aluminium. These materials can then be sold to recyclers for use in the manufacture of new products, according to CN. Newcastle Lord Mayor Nuatali Nelmes stated that the MRF will provide a regional recycling solution that will divert waste from landfill, reduce glasshouse gas emissions, and create local jobs. “City of Newcastle is committed to delivering responsible, environmentally sustainable, and commercially feasible waste and recycling operations to manage our current and future waste streams,” Nelmes said. The mayor underscored that in addition to ensuring that about 200,000 tonnes of recyclables from Newcastle homes are kept out of the landfill, the construction of a local, council-owned plant will eliminate about 6,000 tonnes of transportation-related glasshouse gas emissions over the next 25 years. “The delivery of the MRF will also provide a major economic boost to our region, creating around 185 jobs during the construction and fit-out phase and up to 28 ongoing jobs when it becomes operational,” Nelmes noted. Moreover, CN revealed the community has enthusiastically supported CN’s plans to create the new facility, with 98 per cent of locals polled during the project’s development affirming their support. The Hunter and Central Coast Regional Planning Panel is now evaluating a development application for the MRF; a decision is anticipated in the second half of 2023. If approved, the project’s preparatory earthworks would start later this year, and construction of the facility would start in the first quarter of 2024.","filter_flag":1}
{"title":"Take waste recycling seriously: Chiwenga - The Herald","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LmhlcmFsZC5jby56dy90YWtlLXdhc3RlLXJlY3ljbGluZy1zZXJpb3VzbHktY2hpd2VuZ2Ev0gFFaHR0cHM6Ly93d3cuaGVyYWxkLmNvLnp3L3Rha2Utd2FzdGUtcmVjeWNsaW5nLXNlcmlvdXNseS1jaGl3ZW5nYS9hbXAv?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LmhlcmFsZC5jby56dy90YWtlLXdhc3RlLXJlY3ljbGluZy1zZXJpb3VzbHktY2hpd2VuZ2Ev0gFFaHR0cHM6Ly93d3cuaGVyYWxkLmNvLnp3L3Rha2Utd2FzdGUtcmVjeWNsaW5nLXNlcmlvdXNseS1jaGl3ZW5nYS9hbXAv?oc=5","id":"CBMiQWh0dHBzOi8vd3d3LmhlcmFsZC5jby56dy90YWtlLXdhc3RlLXJlY3ljbGluZy1zZXJpb3VzbHktY2hpd2VuZ2Ev0gFFaHR0cHM6Ly93d3cuaGVyYWxkLmNvLnp3L3Rha2Utd2FzdGUtcmVjeWNsaW5nLXNlcmlvdXNseS1jaGl3ZW5nYS9hbXAv","guidislink":false,"published":"Sat, 06 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=126, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LmhlcmFsZC5jby56dy90YWtlLXdhc3RlLXJlY3ljbGluZy1zZXJpb3VzbHktY2hpd2VuZ2Ev0gFFaHR0cHM6Ly93d3cuaGVyYWxkLmNvLnp3L3Rha2Utd2FzdGUtcmVjeWNsaW5nLXNlcmlvdXNseS1jaGl3ZW5nYS9hbXAv?oc=5\" target=\"_blank\">Take waste recycling seriously: Chiwenga<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Herald<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Take waste recycling seriously: Chiwenga - The Herald","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LmhlcmFsZC5jby56dy90YWtlLXdhc3RlLXJlY3ljbGluZy1zZXJpb3VzbHktY2hpd2VuZ2Ev0gFFaHR0cHM6Ly93d3cuaGVyYWxkLmNvLnp3L3Rha2Utd2FzdGUtcmVjeWNsaW5nLXNlcmlvdXNseS1jaGl3ZW5nYS9hbXAv?oc=5\" target=\"_blank\">Take waste recycling seriously: Chiwenga<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Herald<\/font>","source.href":"https:\/\/www.herald.co.zw","source.title":"The Herald","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Vice President Dr Constantino Chiwenga is joined by ZANU PF Deputy Secretary for Security Cde Tendai Chirau (right), Harare Central Ward 5 aspiring Councillor Cde Abdurrahman Sapa (second from left), Government officials, the party’s Harare Province party members and Environmental Management Agency officers in placing litter into a plastic bin liner at Africa Unity Square during a clean-up in Harare yesterday. — Picture: Kudakwashe Hunda. Mukudzei Chingwere-Herald Reporter Zimbabweans must be serious about recycling waste and take up the opportunities in waste management using the recyclers directory of the Environmental Management Agency (EMA), Acting President Dr Constantino Chiwenga said yesterday. The Acting President was speaking after leading the monthly National Clean-up Day at Africa Unity Square in Harare yesterday morning, stressing both the need and the money that could be earned through effective recycling, and the need for people to elect local authorities who could at least collect the garbage. Local authorities have been deficient in collecting rubbish in recent months, allowing it to pile up and create health hazards. This failure has kept Zimbabwe with the lingering threat of public health time bombs and Government believes it is high time it moves in to correct the enduring threat. With the 2023 general elections around the corner, pending a date proclamation by the President, Acting President Chiwenga said this year’s election was an opportunity for urban voters to draw a line in the sand and choose quality, development-oriented representatives. Most urbanities, particularly in the metropolitan province of Harare have since the turn of the millennium, consistently voted for opposition parties whose candidates have however failed to live to the electorate’s expectation thus resulting in marked regression of development. Zanu PF, especially under the Second Republic, has however made considerable gains towards regaining the trust of the urban voter on the back of rapid economic transformation being championed by President Mnangagwa leading to an empowered upper middle-income economy by 2030. “Let me hasten to highlight that waste recovery enables the establishment of a waste vending business, supplying various processors within the recycling value chain,” said Acting President Chiwenga. “Recycling is not only a billion-dollar industry, but also helps to keep the environment clean. Harare Metropolitan Province produces tonnes of waste products, which we can use to our advantage to build and grow businesses out of waste management. “Research findings show that only about 10 percent of the recyclable waste generated in the country is recycled, while the remnant is dumped in the environment as residual waste. “Recycling does not only reduce the volume of waste sent to the landfill but also reduces the cost of waste collection and the amount of energy used to manufacture new products from raw materials. This saves the environment from degradation. “When we recycle more, we reduce the need for new resources to create products and this helps to reduce our negative impact on the environment. “To strengthen the recycling business market linkages, the Environmental Management Agency has developed a recyclers directory. “In my capacity as the Minister of Health and Child Care, I want to call upon everyone to manage our waste properly and remain vigilant, against the backdrop of the recent cholera outbreak cases reported in Harare and other parts of the country. “We should uphold the ethos for peace, love, tolerance, unity and harmony, that is before, during and after the elections. “It is our duty to ensure that we vote for a party that will restore the City of Harare to its former glory as the Sunshine City,” said Acting President Chiwenga. The Acting President also said the engagement and re-engagement policy adopted by the Second Republic is starting bearing fruit with the closest example that of President Mnangagwa who is in the United Kingdom at the invitation of the hosts for the coronation of King Charles III. This month’s clean-up is running under the theme, “Material Recovery- Reduced residual waste in the environment.” Deputy Minister of Environment, Climate, Tourism and Hospitality Industry Cde Barbara Rwodzi blasted the local authority for not playing an active role in waste management. She also commended the national clean-up campaign for its positive impact, the campaign is in its fifth year following its launch in 2018 by President Mnangagwa,” said Cde Rwodzi. “The programme has been able to inculcate and create an eco-conscience society as shown by the adoption of the best practices in waste management by the people of Zimbabwe. “An increasing number of individuals, stakeholders and sectors have taken up recycling agenda seriously and they are demystifying the narrative in a positive way and this also conforms to stakeholder participation which remains key in sustainable environmental management in line with National Development Strategy 1.”","filter_flag":1}
{"title":"NMC’s RRR push: ‘Reduce, Reuse, Recycle’ at prabhag levels begins - The Times of India","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L25hZ3B1ci9ubWNzLXJyci1wdXNoLXJlZHVjZS1yZXVzZS1yZWN5Y2xlLWF0LXByYWJoYWctbGV2ZWxzLWJlZ2lucy9hcnRpY2xlc2hvdy8xMDAyMzgwMjkuY21z0gGJAWh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2NpdHkvbmFncHVyL25tY3MtcnJyLXB1c2gtcmVkdWNlLXJldXNlLXJlY3ljbGUtYXQtcHJhYmhhZy1sZXZlbHMtYmVnaW5zL2FtcF9hcnRpY2xlc2hvdy8xMDAyMzgwMjkuY21z?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L25hZ3B1ci9ubWNzLXJyci1wdXNoLXJlZHVjZS1yZXVzZS1yZWN5Y2xlLWF0LXByYWJoYWctbGV2ZWxzLWJlZ2lucy9hcnRpY2xlc2hvdy8xMDAyMzgwMjkuY21z0gGJAWh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2NpdHkvbmFncHVyL25tY3MtcnJyLXB1c2gtcmVkdWNlLXJldXNlLXJlY3ljbGUtYXQtcHJhYmhhZy1sZXZlbHMtYmVnaW5zL2FtcF9hcnRpY2xlc2hvdy8xMDAyMzgwMjkuY21z?oc=5","id":"CBMihQFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L25hZ3B1ci9ubWNzLXJyci1wdXNoLXJlZHVjZS1yZXVzZS1yZWN5Y2xlLWF0LXByYWJoYWctbGV2ZWxzLWJlZ2lucy9hcnRpY2xlc2hvdy8xMDAyMzgwMjkuY21z0gGJAWh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2NpdHkvbmFncHVyL25tY3MtcnJyLXB1c2gtcmVkdWNlLXJldXNlLXJlY3ljbGUtYXQtcHJhYmhhZy1sZXZlbHMtYmVnaW5zL2FtcF9hcnRpY2xlc2hvdy8xMDAyMzgwMjkuY21z","guidislink":false,"published":"Mon, 15 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=15, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=135, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L25hZ3B1ci9ubWNzLXJyci1wdXNoLXJlZHVjZS1yZXVzZS1yZWN5Y2xlLWF0LXByYWJoYWctbGV2ZWxzLWJlZ2lucy9hcnRpY2xlc2hvdy8xMDAyMzgwMjkuY21z0gGJAWh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2NpdHkvbmFncHVyL25tY3MtcnJyLXB1c2gtcmVkdWNlLXJldXNlLXJlY3ljbGUtYXQtcHJhYmhhZy1sZXZlbHMtYmVnaW5zL2FtcF9hcnRpY2xlc2hvdy8xMDAyMzgwMjkuY21z?oc=5\" target=\"_blank\">NMC’s RRR push: ‘Reduce, Reuse, Recycle’ at prabhag levels begins<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Times of India<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"NMC’s RRR push: ‘Reduce, Reuse, Recycle’ at prabhag levels begins - The Times of India","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L25hZ3B1ci9ubWNzLXJyci1wdXNoLXJlZHVjZS1yZXVzZS1yZWN5Y2xlLWF0LXByYWJoYWctbGV2ZWxzLWJlZ2lucy9hcnRpY2xlc2hvdy8xMDAyMzgwMjkuY21z0gGJAWh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2NpdHkvbmFncHVyL25tY3MtcnJyLXB1c2gtcmVkdWNlLXJldXNlLXJlY3ljbGUtYXQtcHJhYmhhZy1sZXZlbHMtYmVnaW5zL2FtcF9hcnRpY2xlc2hvdy8xMDAyMzgwMjkuY21z?oc=5\" target=\"_blank\">NMC’s RRR push: ‘Reduce, Reuse, Recycle’ at prabhag levels begins<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Times of India<\/font>","source.href":"https:\/\/timesofindia.indiatimes.com","source.title":"The Times of India","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Nagpur: The Nagpur Municipal Corporation (NMC) is set to launch ‘Reduce, Reuse and Recycle’ (RRR) centres at the ward level as part of the ‘Meri Life, Mera Swachh Shehar’ launched by the Swachh Bharat Mission-Urban 2.0 under the aegis of the ministry of housing and urban affairs. The campaign will take off on May 15 and will run till World Environment Day on June 5.The three-week campaign is part of a build up to World Environment Day and will motivate citizens to give used plastic items, old books, used clothes and footwear and any other item that the city chooses, which will be further refurbished, reused or processed for making new products.Such a drive will not only further strengthen the resolve of SBM-U to reduce, reuse and recycle waste but also align with LiFE Mission’s objective of undertaking collective action for protecting and conserving the environment by adopting sustainable living habits.“NMC will be setting up collection points that would be termed ‘Reduce, Reuse and Recycle’ centres or RRR centres in 38 prabhags,” said additional municipal commissioner Ram Joshi who on Saturday convened a meeting of self-help groups established under the National Urban Livelihood Mission to chalk out a plan for the RRR centres.Deputy municipal commissioner (SWM) Dr Gajendra Mahalle said the NMC will start the campaign from May 15 but the RRR centres will be operative from May 20 across the city. Like other cities, the NMC will also set up such RRR centres with the right signage and branding in every ward across various locations identified during the preparatory phase.The civic body will start the RRR centres from its existing six material recovery facilities, as per Dr Mahalle.","filter_flag":1}
{"title":"iQRenew wins tender for $56.7M City of Newcastle MRF - Waste Management Review","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9pcXJlbmV3LXdpbnMtdGVuZGVyLWZvci01Ni03bS1jaXR5LW9mLW5ld2Nhc3RsZS1tcmYv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9pcXJlbmV3LXdpbnMtdGVuZGVyLWZvci01Ni03bS1jaXR5LW9mLW5ld2Nhc3RsZS1tcmYv0gEA?oc=5","id":"CBMiWWh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9pcXJlbmV3LXdpbnMtdGVuZGVyLWZvci01Ni03bS1jaXR5LW9mLW5ld2Nhc3RsZS1tcmYv0gEA","guidislink":false,"published":"Thu, 25 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=145, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9pcXJlbmV3LXdpbnMtdGVuZGVyLWZvci01Ni03bS1jaXR5LW9mLW5ld2Nhc3RsZS1tcmYv0gEA?oc=5\" target=\"_blank\">iQRenew wins tender for $56.7M City of Newcastle MRF<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Waste Management Review<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"iQRenew wins tender for $56.7M City of Newcastle MRF - Waste Management Review","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9pcXJlbmV3LXdpbnMtdGVuZGVyLWZvci01Ni03bS1jaXR5LW9mLW5ld2Nhc3RsZS1tcmYv0gEA?oc=5\" target=\"_blank\">iQRenew wins tender for $56.7M City of Newcastle MRF<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Waste Management Review<\/font>","source.href":"https:\/\/wastemanagementreview.com.au","source.title":"Waste Management Review","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"A Material Recovery Facility will be built at the Summerhill Waste Management Facility. Australian-owned recyclables processor, iQRenew, has won the tender for City of Newcastle’s (CN) first Material Recovery Facility (MRF). The council voted unanimously on 23 May to approve iQRenew’s $56.7 million tender to design and build the MRF at the city’s Summerhill Waste Management Facility. iQRenew is also set to operate and maintain the facility which is predicted to process 85,000 tonnes of recyclable per year. In a statement, the council said the MRF would deliver a regional recycling solution designed to divert waste from landfill, cut greenhouse gas emissions and create local jobs. Recyclables from residents’ yellow-lid bins, such as paper, cardboard, glass, plastics, steel and aluminium, will be separated at the MRF and sold to recycling companies who can repurpose them to create new products. Newcastle Lord Mayor, Nuatali Nelmes, said he was committed to increasing the city’s capabilities in recycling and reuse of materials. “City of Newcastle is committed to delivering responsible, environmentally sustainable and commercially feasible waste and recycling operations to manage our current and future waste streams,” Nelmes said. He said the sudden closure of the only MRF in the Hunter in 2020 meant recyclables from Newcastle had to be transported to a processing facility on the Central Coast. For other local councils, their recyclables are transported to Sydney at expense to their ratepayers. “The establishment of a local, council-owned facility will remove around 6000 tonnes of transport-related greenhouse gas emissions over the next 25 years while also ensuring almost 200,000 tonnes of recyclables from Newcastle homes are diverted from landfill,” Nelmes said. “Beyond meeting the needs and expectations of Newcastle residents, the MRF’s scalable processing capacity and optimal location close to the Hunter Expressway and M1 will make it an essential piece of regional infrastructure capable of servicing the entire region. “The delivery of the MRF will also provide a major economic boost to our region, creating about 185 jobs during the construction and fit-out phase and up to 28 ongoing jobs when it becomes operational.” The construction of the MRF is expected to begin early in 2024. The project received positive endorsement from the community, with 98 per cent of respondents to a survey indicating their support. The project has received $5 million from the Federal and New South Wales Governments. For more information, visit: www.newcastle.nsw.gov.au Related stories: Residents back Newcastle MRF plan Newcastle fast tracks FOGO plan","filter_flag":1}
{"title":"TransPennine Express makes stations greener with coffee cup recycling - RailAdvent - Railway News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LnJhaWxhZHZlbnQuY28udWsvMjAyMy8wNS90cmFuc3Blbm5pbmUtZXhwcmVzcy1tYWtlcy1zdGF0aW9ucy1ncmVlbmVyLXdpdGgtY29mZmVlLWN1cC1yZWN5Y2xpbmcuaHRtbNIBc2h0dHBzOi8vd3d3LnJhaWxhZHZlbnQuY28udWsvMjAyMy8wNS90cmFuc3Blbm5pbmUtZXhwcmVzcy1tYWtlcy1zdGF0aW9ucy1ncmVlbmVyLXdpdGgtY29mZmVlLWN1cC1yZWN5Y2xpbmcuaHRtbC9hbXA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LnJhaWxhZHZlbnQuY28udWsvMjAyMy8wNS90cmFuc3Blbm5pbmUtZXhwcmVzcy1tYWtlcy1zdGF0aW9ucy1ncmVlbmVyLXdpdGgtY29mZmVlLWN1cC1yZWN5Y2xpbmcuaHRtbNIBc2h0dHBzOi8vd3d3LnJhaWxhZHZlbnQuY28udWsvMjAyMy8wNS90cmFuc3Blbm5pbmUtZXhwcmVzcy1tYWtlcy1zdGF0aW9ucy1ncmVlbmVyLXdpdGgtY29mZmVlLWN1cC1yZWN5Y2xpbmcuaHRtbC9hbXA?oc=5","id":"CBMib2h0dHBzOi8vd3d3LnJhaWxhZHZlbnQuY28udWsvMjAyMy8wNS90cmFuc3Blbm5pbmUtZXhwcmVzcy1tYWtlcy1zdGF0aW9ucy1ncmVlbmVyLXdpdGgtY29mZmVlLWN1cC1yZWN5Y2xpbmcuaHRtbNIBc2h0dHBzOi8vd3d3LnJhaWxhZHZlbnQuY28udWsvMjAyMy8wNS90cmFuc3Blbm5pbmUtZXhwcmVzcy1tYWtlcy1zdGF0aW9ucy1ncmVlbmVyLXdpdGgtY29mZmVlLWN1cC1yZWN5Y2xpbmcuaHRtbC9hbXA","guidislink":false,"published":"Sun, 21 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=141, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LnJhaWxhZHZlbnQuY28udWsvMjAyMy8wNS90cmFuc3Blbm5pbmUtZXhwcmVzcy1tYWtlcy1zdGF0aW9ucy1ncmVlbmVyLXdpdGgtY29mZmVlLWN1cC1yZWN5Y2xpbmcuaHRtbNIBc2h0dHBzOi8vd3d3LnJhaWxhZHZlbnQuY28udWsvMjAyMy8wNS90cmFuc3Blbm5pbmUtZXhwcmVzcy1tYWtlcy1zdGF0aW9ucy1ncmVlbmVyLXdpdGgtY29mZmVlLWN1cC1yZWN5Y2xpbmcuaHRtbC9hbXA?oc=5\" target=\"_blank\">TransPennine Express makes stations greener with coffee cup recycling<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RailAdvent - Railway News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"TransPennine Express makes stations greener with coffee cup recycling - RailAdvent - Railway News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LnJhaWxhZHZlbnQuY28udWsvMjAyMy8wNS90cmFuc3Blbm5pbmUtZXhwcmVzcy1tYWtlcy1zdGF0aW9ucy1ncmVlbmVyLXdpdGgtY29mZmVlLWN1cC1yZWN5Y2xpbmcuaHRtbNIBc2h0dHBzOi8vd3d3LnJhaWxhZHZlbnQuY28udWsvMjAyMy8wNS90cmFuc3Blbm5pbmUtZXhwcmVzcy1tYWtlcy1zdGF0aW9ucy1ncmVlbmVyLXdpdGgtY29mZmVlLWN1cC1yZWN5Y2xpbmcuaHRtbC9hbXA?oc=5\" target=\"_blank\">TransPennine Express makes stations greener with coffee cup recycling<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RailAdvent - Railway News<\/font>","source.href":"https:\/\/www.railadvent.co.uk","source.title":"RailAdvent - Railway News","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"TransPennine Express (TPE) has installed new recycling bins, specifically for single-use coffee cups, at three of its stations. TPE, which will return to public ownership at the end of May, has introduced the bins at Cleethorpes, Hull and Scarborough stations, as part of a trial to improve recycling. If successful, the trial may lead to the bins being installed at more stations on the TPE network in the future. Each bin is made up of three tubes, one for lids, one for cups and a third for any liquids. The cups that are collected will be recycled into new products. The tube bins are located in easy-to-access locations on each station: Hull – outside the waiting room on platform 3 Scarborough – by the bike racks on platform 3 Cleethorpes – on the concourse between platforms 1 and 2. Last year, TPE collected and recycled 221 tonnes of waste. It has increased its recycling rate from just over a third (36 per cent) to nearly two-thirds (65 per cent) in recent years. None of its waste is sent to landfill. The company has worked with waste solution business, co-cre8, to produce the recycling bins, which it hopes will increase its recycling rate further still. The last year has seen several train operators take new initiatives to increase recycling and reduce waste, including: Northern trialling a new system for sorting waste at Bradford Interchange; free water refills at Greater Anglia's South Woodham Ferrers station in Essex; and Govia Thameslink Railway recycling its staff's tablet computers for use by schoolchildren in Malawi. Nicola Martin, Head of Sustainability for TransPennine Express, said: “TPE are committed to providing our customers with a more sustainable service. The new coffee cup bins will make it easier for our customers to recycle their waste. “Single-use coffee cups are one of our biggest forms of customer waste we collect, and it can be extremely difficult to recover these materials from waste bins, making material recovery options limited. “Most coffee cups are coated in plastic, with only a few specialist facilities able to process and recover the materials, meaning most cups end up at an incinerator. “TPE is delighted to provide designated coffee cup waste recycling bins to help recover more cups through recycling routes. We are committed to providing more ways for customers to travel sustainably.” Peter Goodwin, Managing Director and co-founder of co-cre8, said “With hot beverage cups now one of the fastest growing waste streams, progressive businesses need solutions to effectively separate them from other materials so that they can be properly recycled. “Our range of Cup Collection Stations are not only Department for Transport (DFT) approved, but have also been proven to be both practical and durable in transport hub environments. These have also been designed with consumer engagement in mind and so we're delighted to be helping TransPennine Express provide its customers with new ways to become more sustainable”","filter_flag":1}
