{"title":"Former Studio Chief Michael Nathanson Appointed Rewilding America Now CEO\/Managing Director Demonstrating ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi2QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Zvcm1lci1zdHVkaW8tY2hpZWYtbWljaGFlbC1uYXRoYW5zb24tYXBwb2ludGVkLXJld2lsZGluZy1hbWVyaWNhLW5vdy1jZW9tYW5hZ2luZy1kaXJlY3Rvci1kZW1vbnN0cmF0aW5nLWNvbW1pdG1lbnQtdG8tZW52aXJvbm1lbnRhbC1jb25zZXJ2YXRpb24tYW5kLXdpbGQtaG9yc2VzLTMwMjAxNDEwMi5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi2QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Zvcm1lci1zdHVkaW8tY2hpZWYtbWljaGFlbC1uYXRoYW5zb24tYXBwb2ludGVkLXJld2lsZGluZy1hbWVyaWNhLW5vdy1jZW9tYW5hZ2luZy1kaXJlY3Rvci1kZW1vbnN0cmF0aW5nLWNvbW1pdG1lbnQtdG8tZW52aXJvbm1lbnRhbC1jb25zZXJ2YXRpb24tYW5kLXdpbGQtaG9yc2VzLTMwMjAxNDEwMi5odG1s0gEA?oc=5","id":"CBMi2QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Zvcm1lci1zdHVkaW8tY2hpZWYtbWljaGFlbC1uYXRoYW5zb24tYXBwb2ludGVkLXJld2lsZGluZy1hbWVyaWNhLW5vdy1jZW9tYW5hZ2luZy1kaXJlY3Rvci1kZW1vbnN0cmF0aW5nLWNvbW1pdG1lbnQtdG8tZW52aXJvbm1lbnRhbC1jb25zZXJ2YXRpb24tYW5kLXdpbGQtaG9yc2VzLTMwMjAxNDEwMi5odG1s0gEA","guidislink":false,"published":"Wed, 13 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=347, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi2QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Zvcm1lci1zdHVkaW8tY2hpZWYtbWljaGFlbC1uYXRoYW5zb24tYXBwb2ludGVkLXJld2lsZGluZy1hbWVyaWNhLW5vdy1jZW9tYW5hZ2luZy1kaXJlY3Rvci1kZW1vbnN0cmF0aW5nLWNvbW1pdG1lbnQtdG8tZW52aXJvbm1lbnRhbC1jb25zZXJ2YXRpb24tYW5kLXdpbGQtaG9yc2VzLTMwMjAxNDEwMi5odG1s0gEA?oc=5\" target=\"_blank\">Former Studio Chief Michael Nathanson Appointed Rewilding America Now CEO\/Managing Director Demonstrating ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Former Studio Chief Michael Nathanson Appointed Rewilding America Now CEO\/Managing Director Demonstrating ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi2QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Zvcm1lci1zdHVkaW8tY2hpZWYtbWljaGFlbC1uYXRoYW5zb24tYXBwb2ludGVkLXJld2lsZGluZy1hbWVyaWNhLW5vdy1jZW9tYW5hZ2luZy1kaXJlY3Rvci1kZW1vbnN0cmF0aW5nLWNvbW1pdG1lbnQtdG8tZW52aXJvbm1lbnRhbC1jb25zZXJ2YXRpb24tYW5kLXdpbGQtaG9yc2VzLTMwMjAxNDEwMi5odG1s0gEA?oc=5\" target=\"_blank\">Former Studio Chief Michael Nathanson Appointed Rewilding America Now CEO\/Managing Director Demonstrating ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"LOS ANGELES, Dec. 13, 2023 \/PRNewswire\/ -- Rewilding America Now (RAN), a non-profit organization dedicated to preserving America's wild horses and promoting innovative environmental conservation practices, has announced the appointment of former Hollywood studio chief Michael Nathanson as their new CEO and Managing Director. With over four decades of broad experience as a chief executive in the motion picture and entertainment industry, Nathanson brings his award-winning passion for storytelling, business acumen and expertise to the organization as he stewards its rebranding and new initiatives. For bio and photos: HERE Michael Nathanson, CEO and Managing Director of Rewilding America Now (Photo Courtesy of Rewilding America Now) \"I am honored and excited to join Rewilding America Now and lead their mission to protect and preserve America's native landscape and wild horses,\" said Nathanson. \"This is one of those rare opportunities where we can apply our trade to something with a much higher calling, one that will make a difference.\" Nathanson's appointment comes at a crucial time for Rewilding America Now, formerly known as the CANA Foundation. The organization has successfully led the way for innovative wild horse rewilding, conservation awareness, and the inclusion of traditional knowledge through Native American Culture. RAN has been actively working towards a groundbreaking next step in the world of conservation. RAN is in the process of acquiring 400,000 acres of grazing lands in the Birch Creek Valley of Idaho to rewild. RAN continues its dedicated efforts to preserving and rewilding America's wild horses, which are facing numerous threats such as habitat loss, overgrazing, and roundups by the Bureau of Land Management. Under Nathanson's leadership, the organization hopes to spearhead the way for a sustainable future committed to preserving wild horses, restoring ecosystems, and championing climate stewardship. As a leader in the entertainment industry, Nathanson has overseen and participated in every facet of the industry, from operational and production aspects to development, marketing, and distribution, often handling annual budgets of one billion dollars. He has previously served as chairman or president of three major motion picture companies and studios including MGM, Columbia Pictures, and New Regency. Michael has produced numerous acclaimed films, including the Academy Award®-winning LA Confidential and the Academy Award-nominated Hell or High Water. Notably, he played a pivotal role in the rejuvenation and management of both the James Bond, Pink Panther, and Legally Blonde franchises. Nathanson's journey takes an exciting new turn as he assumes the role of Managing Director\/CEO at Rewilding America Now. His first spotlight will be Rewilding Idaho, an ambitious and vital project set in Birch Creek, Idaho, to create a wildlife corridor that will enlarge Yellowstone National Park all the way to the Idaho wilderness area. This project is comprised of purchasing and protecting over 55 miles of grazing lands where the wild horses live with America's iconic wildlife. This is a once in a lifetime opportunity that has never been attempted before and is the cornerstone of RAN's mission today. \"The acquisition and completion of Rewilding Idaho is crucial to the future of conservation in North America, an initiative that I have become dedicated to accomplishing,\" says Nathanson. \"Michael's passion for environmental conservation and wild horses makes him the perfect fit for Rewilding America Now,\" says Manda Kalimian, Founder and president of Rewilding America Now. \"Rewilding is a key component for conserving ecosystems and natural habitats, and protecting native species is critical to our survival. Wild horses play a key role in creating rewilding initiatives. They are a species native to North America and are going to help us build grasslands to capture carbon and be the leader in climate breakdown initiatives.\" For more information about Rewilding America Now and its mission, please visit their website at www.rewildingamericanow.org. About Rewilding America Now (RAN) The mission at Rewilding America Now is to conserve and restore the North American landscape through innovative rewilding initiatives, with a focus on wild horses as a keystone species. Using science-backed research and partnerships with tribal nations and incorporating traditional ecological knowledge, RAN advocates for public policy that protects wild horses and native lands, and allocates new resources for breakthrough rewilding projects. Rewilding America Now is a not-for-profit 501(c)(3) organization. Follow Rewilding America Now on Instagram Facebook X (formerly Twitter) YouTube REWILDING AMERICA NOW CONTACT: Manda Kalimian, President \/ Founder [email protected] Media Contact: Rick Markovitz 818.760.8995 [email protected] SOURCE Rewilding America Now","filter_flag":1}
{"title":"Two Studies Make the Case For Eating a Lot More Plants for Your Health and the Planet - VegNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiNmh0dHBzOi8vdmVnbmV3cy5jb20vdHdvLXN0dWRpZXMtbW9yZS1wbGFudHMtZm9yLWhlYWx0aNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiNmh0dHBzOi8vdmVnbmV3cy5jb20vdHdvLXN0dWRpZXMtbW9yZS1wbGFudHMtZm9yLWhlYWx0aNIBAA?oc=5","id":"CBMiNmh0dHBzOi8vdmVnbmV3cy5jb20vdHdvLXN0dWRpZXMtbW9yZS1wbGFudHMtZm9yLWhlYWx0aNIBAA","guidislink":false,"published":"Wed, 06 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=340, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNmh0dHBzOi8vdmVnbmV3cy5jb20vdHdvLXN0dWRpZXMtbW9yZS1wbGFudHMtZm9yLWhlYWx0aNIBAA?oc=5\" target=\"_blank\">Two Studies Make the Case For Eating a Lot More Plants for Your Health and the Planet<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Two Studies Make the Case For Eating a Lot More Plants for Your Health and the Planet - VegNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNmh0dHBzOi8vdmVnbmV3cy5jb20vdHdvLXN0dWRpZXMtbW9yZS1wbGFudHMtZm9yLWhlYWx0aNIBAA?oc=5\" target=\"_blank\">Two Studies Make the Case For Eating a Lot More Plants for Your Health and the Planet<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","source.href":"https:\/\/vegnews.com","source.title":"VegNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"In an era marked by environmental challenges and health crises, two recent studies have illuminated the profound impact of plant-based diets on both human health and the planet’s well-being. The studies offer compelling evidence of the benefits of reducing meat consumption and incorporating more plant-based foods into our diets. Getty The first study, published in the journal Nature Communications, presents a groundbreaking revelation. By replacing half of meat products with plant-based alternatives, global agricultural pollution could be reduced by a third by 2050 compared to 2020 levels. This significant decrease in pollution, alongside reductions in land use, could halt deforestation and protect vital ecosystems. “Plant-based meats are not just a novel food product but a critical opportunity for achieving food security and climate goals while also achieving health and biodiversity objectives worldwide,” Eva Wollenberg, a co-author of the study, said in a statement. The study specifically highlights the environmental toll of cow farming, a major contributor to deforestation and methane production. Methane, a gas far more potent than carbon dioxide in warming the planet, is a significant byproduct of cattle rearing. Adopting a “plant-forward” diet, which entails substituting meat with plant-based alternatives like beans, vegetables, tofu, or seitan, could offer a nutritious and eco-friendly way of life. Another compelling study, published in the journal BMC Medicine, reinforces the health benefits of plant-based diets. Conducted by a team led by Sabrina Schlesinger of the German Diabetes Center, the research systematically reviewed the health outcomes of replacing animal-based foods with plant-based alternatives. This comprehensive review, the first of its kind, found a correlation between plant-based diets and reduced risks of heart disease and type 2 diabetes. Getty The study noted a 27-percent reduction in heart disease incidence and a 22-percent reduction in type 2 diabetes incidence when processed meat was replaced with nuts or legumes. Additionally, swapping butter with olive oil and eggs with nuts also showed potential health benefits, though replacing other animal-based foods had less clear effects. Duane Mellor, a senior teaching fellow at the UK’s Aston Medical School, provided context to these findings, saying they align with the broader trends shaping dietary guidelines. “It’s adding to the picture that we are already fairly comfortable with,” he noted. These studies collectively highlight the dual benefits of plant-based diets: promoting personal health and contributing to environmental conservation. They underscore the need for a shift in dietary habits, not just as a personal health choice, but as a crucial step towards addressing larger environmental and climate issues.","filter_flag":1}
{"title":"Press Release: VAPORESSO Launches Global Carbon Neutral I... - Vaping360","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL3ZhcGluZzM2MC5jb20vdmFwZS1uZXdzLzEyNzYwOS9wcmVzcy1yZWxlYXNlLXZhcG9yZXNzby11bnZlaWxzLWdsb2JhbC1jYXJib24tbmV1dHJhbC1wcm9ncmFtLXBpb25lZXJpbmctZW52aXJvbm1lbnRhbC1zdXN0YWluYWJpbGl0eS1pbi10aGUtdmFwaW5nLWluZHVzdHJ5L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL3ZhcGluZzM2MC5jb20vdmFwZS1uZXdzLzEyNzYwOS9wcmVzcy1yZWxlYXNlLXZhcG9yZXNzby11bnZlaWxzLWdsb2JhbC1jYXJib24tbmV1dHJhbC1wcm9ncmFtLXBpb25lZXJpbmctZW52aXJvbm1lbnRhbC1zdXN0YWluYWJpbGl0eS1pbi10aGUtdmFwaW5nLWluZHVzdHJ5L9IBAA?oc=5","id":"CBMipAFodHRwczovL3ZhcGluZzM2MC5jb20vdmFwZS1uZXdzLzEyNzYwOS9wcmVzcy1yZWxlYXNlLXZhcG9yZXNzby11bnZlaWxzLWdsb2JhbC1jYXJib24tbmV1dHJhbC1wcm9ncmFtLXBpb25lZXJpbmctZW52aXJvbm1lbnRhbC1zdXN0YWluYWJpbGl0eS1pbi10aGUtdmFwaW5nLWluZHVzdHJ5L9IBAA","guidislink":false,"published":"Wed, 06 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=340, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL3ZhcGluZzM2MC5jb20vdmFwZS1uZXdzLzEyNzYwOS9wcmVzcy1yZWxlYXNlLXZhcG9yZXNzby11bnZlaWxzLWdsb2JhbC1jYXJib24tbmV1dHJhbC1wcm9ncmFtLXBpb25lZXJpbmctZW52aXJvbm1lbnRhbC1zdXN0YWluYWJpbGl0eS1pbi10aGUtdmFwaW5nLWluZHVzdHJ5L9IBAA?oc=5\" target=\"_blank\">Press Release: VAPORESSO Launches Global Carbon Neutral I...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vaping360<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Press Release: VAPORESSO Launches Global Carbon Neutral I... - Vaping360","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL3ZhcGluZzM2MC5jb20vdmFwZS1uZXdzLzEyNzYwOS9wcmVzcy1yZWxlYXNlLXZhcG9yZXNzby11bnZlaWxzLWdsb2JhbC1jYXJib24tbmV1dHJhbC1wcm9ncmFtLXBpb25lZXJpbmctZW52aXJvbm1lbnRhbC1zdXN0YWluYWJpbGl0eS1pbi10aGUtdmFwaW5nLWluZHVzdHJ5L9IBAA?oc=5\" target=\"_blank\">Press Release: VAPORESSO Launches Global Carbon Neutral I...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vaping360<\/font>","source.href":"https:\/\/vaping360.com","source.title":"Vaping360","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"As the world experiences rapid economic and technological growth, it also grapples with the negative impacts of this development, including ecological degradation, the greenhouse effect, and global warming. The challenge lies in reducing carbon dioxide emissions and increasing carbon sinks. In response to the challenge of carbon dioxide emissions reduction, VAPORESSO is introducing its first conceptual innovative product “OCEANGLINT” ECO NANO, the first ocean-friendly product in vaping industry. Design to promote a low carbon lifestyle, “OCEANGLINT” ECO NANO takes a step further based on VAPORESSO’s ECO NANO which is reusable, offering a sustainable alternative to disposable products. It can be recharged and refilled, reducing the user's cost by 60% per year and significantly reducing pollution. While the “OCEANGLINT” ECO NANO represents a significant stride for VAPORESSO in its pursuit of carbon reduction and environmental conservation. By utilizing PCR (Post-Consumer Recycled) material sourced from recyclable marine plastic waste, “OCEANGLINT” ECO NANO tackles \"white pollution\" caused by plastic packaging, thereby helping to protect the marine environment. Meanwhile, VAPORESSO is dedicated to increasing carbon sinks and will launch initiatives to involve its users into a joint effort. A UN report states forests are crucial for carbon storage, but 420 million hectares were lost to deforestation from 1990-2020. VAPORESSO invites users to join in its initiatives of planting 6000 more trees in the coming months, aiming to reduce carbon dioxide emissions and add 66 tons of carbon to the Earth's carbon sink annually, thus reducing ecological damage and promoting global sustainability. As part of the Program, VAPORESSO will launch several initiatives, including UNITE TO PLANT to provide users with an online interactive platform to experience the fun of low-carbon environmental protection and support tree-planting through quizzes. It also invites clients as Global Green Partners to join planting trees to promote the environmental development of the vaping industry. In collaboration with its stores worldwide, including those in the U.S., the UK, and France, etc., the brand has launched the STEP COUNT CHALLENGE to encourage users to adopt eco-friendly travel methods, especially walking. Users can participate in this challenge through various store locations to win incredible rewards from VAPORESSO. For more information, please visit: https:\/\/www.vaporesso.com\/.","filter_flag":1}
{"title":"Bio-Link Introduces New Water Purification System, Revolutionizing Global Water Quality APAC - English - APAC - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvYmlvLWxpbmstaW50cm9kdWNlcy1uZXctd2F0ZXItcHVyaWZpY2F0aW9uLXN5c3RlbS1yZXZvbHV0aW9uaXppbmctZ2xvYmFsLXdhdGVyLXF1YWxpdHktMzAyMDE4NDQ0Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvYmlvLWxpbmstaW50cm9kdWNlcy1uZXctd2F0ZXItcHVyaWZpY2F0aW9uLXN5c3RlbS1yZXZvbHV0aW9uaXppbmctZ2xvYmFsLXdhdGVyLXF1YWxpdHktMzAyMDE4NDQ0Lmh0bWzSAQA?oc=5","id":"CBMikwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvYmlvLWxpbmstaW50cm9kdWNlcy1uZXctd2F0ZXItcHVyaWZpY2F0aW9uLXN5c3RlbS1yZXZvbHV0aW9uaXppbmctZ2xvYmFsLXdhdGVyLXF1YWxpdHktMzAyMDE4NDQ0Lmh0bWzSAQA","guidislink":false,"published":"Tue, 19 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=19, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=353, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvYmlvLWxpbmstaW50cm9kdWNlcy1uZXctd2F0ZXItcHVyaWZpY2F0aW9uLXN5c3RlbS1yZXZvbHV0aW9uaXppbmctZ2xvYmFsLXdhdGVyLXF1YWxpdHktMzAyMDE4NDQ0Lmh0bWzSAQA?oc=5\" target=\"_blank\">Bio-Link Introduces New Water Purification System, Revolutionizing Global Water Quality APAC - English - APAC<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bio-Link Introduces New Water Purification System, Revolutionizing Global Water Quality APAC - English - APAC - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvYmlvLWxpbmstaW50cm9kdWNlcy1uZXctd2F0ZXItcHVyaWZpY2F0aW9uLXN5c3RlbS1yZXZvbHV0aW9uaXppbmctZ2xvYmFsLXdhdGVyLXF1YWxpdHktMzAyMDE4NDQ0Lmh0bWzSAQA?oc=5\" target=\"_blank\">Bio-Link Introduces New Water Purification System, Revolutionizing Global Water Quality APAC - English - APAC<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"HONG KONG, Dec. 19, 2023 \/PRNewswire\/ -- As global demands for high-quality water purification rise, Hong Kong-based Bio-Link, supported by its American counterpart Bio-Pro, has launched a cutting-edge reverse osmosis water purification system. This pivotal development not only cements Bio-Link's leadership in the international water purification industry but also marks a significant leap in their global strategy, bringing American technological expertise to Asian markets. Bio-Link, incorporating American Bio-Pro's advanced technology, constantly improves our ultrafiltration and RO systems to ensure every drop of water is of the purest standard. Established in 1997, Bio-Link has been devoted to offering effective and reliable water purification solutions. Its latest system merges two core technologies: ultrafiltration and reverse osmosis (RO). The ultrafiltration technique uses ultra-microporous membrane filters to efficiently remove impurities, bacteria, and viruses, ensuring water safety and purity. The RO technology, with a breakthrough filtration capability of 0.0001 microns, surpasses other systems in effectively eliminating tiny pathogens. Bio-Link adheres to rigorous quality control measures in production, selecting advanced filter membrane technology from Dow Chemical, USA. This approach aligns with the National Sanitation Foundation (NSF) standards in the US, further affirming the high standard and reliability of Bio-Link products. Despite numerous competitors, Bio-Link distinguishes itself through its exceptional technology. Over the years, the company has forged partnerships with various international corporations, including real estate, financial institutions, jewelry stores, banks, the catering industry, and educational organizations. These alliances have not only bolstered Bio-Link's brand influence but also proven the versatility and superior performance of its products in a diverse range of markets. Alongside its technological advances, Bio-Link prioritizes customer service and product maintenance. It provides a one-year free maintenance service, encompassing regular professional checks, disinfection, and filter replacement, maintaining each system's peak performance. This commitment to high-quality service further consolidates Bio-Link's reputation for reliability. Moreover, Bio-Link actively participates in environmental conservation and sustainable practices. Its efficient membrane technology significantly reduces wastewater, a crucial contribution to global environmental efforts. The team pledges ongoing investment in water treatment technology research, striving to minimize environmental impact and support global ecological health. In today's world, clean water is vital for health and environmental protection. Bio-Link's advanced water purification technology fulfills this need, offering everyone the purest water. Excelling in innovation and customer service, Bio-Link elevates its products to a new level, providing consumers with a safer, more effective choice in water purification. SOURCE Bio-Link","filter_flag":1}
{"title":"Move Over, Los Angeles and NYC: These 3 City Council Votes Could Make Pittsburgh the New Vegan Capital - VegNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vdmVnbmV3cy5jb20vY2l0eS1jb3VuY2lsLWFuaW1hbC1yaWdodHMtdm90ZXMtcGl0dHNidXJnaNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vdmVnbmV3cy5jb20vY2l0eS1jb3VuY2lsLWFuaW1hbC1yaWdodHMtdm90ZXMtcGl0dHNidXJnaNIBAA?oc=5","id":"CBMiP2h0dHBzOi8vdmVnbmV3cy5jb20vY2l0eS1jb3VuY2lsLWFuaW1hbC1yaWdodHMtdm90ZXMtcGl0dHNidXJnaNIBAA","guidislink":false,"published":"Thu, 07 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=341, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vdmVnbmV3cy5jb20vY2l0eS1jb3VuY2lsLWFuaW1hbC1yaWdodHMtdm90ZXMtcGl0dHNidXJnaNIBAA?oc=5\" target=\"_blank\">Move Over, Los Angeles and NYC: These 3 City Council Votes Could Make Pittsburgh the New Vegan Capital<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Move Over, Los Angeles and NYC: These 3 City Council Votes Could Make Pittsburgh the New Vegan Capital - VegNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vdmVnbmV3cy5jb20vY2l0eS1jb3VuY2lsLWFuaW1hbC1yaWdodHMtdm90ZXMtcGl0dHNidXJnaNIBAA?oc=5\" target=\"_blank\">Move Over, Los Angeles and NYC: These 3 City Council Votes Could Make Pittsburgh the New Vegan Capital<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","source.href":"https:\/\/vegnews.com","source.title":"VegNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"A series of groundbreaking animal rights bills are under consideration by the Pittsburgh City Council. Aiming to implement significant changes in the city’s approach to animal welfare, if passed, the legislative moves would be the first to happen all at once in any US city. The measures could see a preliminary vote as early as next week and the final vote before the Christmas holiday. Spearheaded by Councilmembers Bruce Kraus (D-South Side), and Erika Strassburger, (D-Squirrel Hill), the proposed legislation targets the sale and manufacture of fur products, the use of horse-drawn carriages, and the sale of foie gras. The proposed ban on the sale and manufacturing of fur products within the city is an initiative driven by the desire to curb what is seen as widespread animal suffering. Councilman Kraus, who is at the forefront of this effort, emphasizes the preventive nature of these bills. Despite acknowledging the current limited market for the items in question, Kraus sees these measures as crucial for proactive animal welfare. The fur ban, co-sponsored by Kraus and Strassburger, is not without its exceptions. It allows for the use of fur products for religious, tribal, cultural, or spiritual purposes and does not restrict the sale of used fur items. Unsplash In addition to the fur ban, Kraus is proposing a bill to prohibit horse-drawn carriages in the city. This bill seeks to expand upon existing legislation that regulates the treatment of wild and exotic animals in Pittsburgh. Kraus’s motivation for this bill stems from a personal encounter with a carriage horse in New Orleans, which left a lasting impression about the animal’s quality of life. “I looked him in the eyes and that horse was dead,” Kraus told TribLive. “I thought, what a horrible way to live your life, for your entertainment value.” The use of horse-drawn carriages has been a hotly debated topic in nearby New York City, where the carriages are still operated, mainly throughout Central Park. Animals can experience high levels of stress, dehydration, and malnutrition, among other issues. Last month, authorities in New York City filed charges against a horse handler in the 2022 collapse of a 26-year-old horse named Ryder, who was later euthanized. Authorities say the horse collapsed in the street in the Hell’s Kitchen neighborhood of Manhattan on a hot day in August 2022. His collapse was caught on video, which also showed the handler beating the dehydrated animal. Adobe The third bill, focusing on the sale of foie gras—a pâté made from goose or duck liver—would require vendors to prove that the animals were not force-fed, a practice commonly associated with the production of the delicacy. The process, as described in the legislation, involves force-feeding birds to enlarge their livers, a practice viewed by many as inhumane. If passed, Pittsburgh would join New York City and California in banning the sale of the delicacy. It is also banned in several EU countries including Austria, the Czech Republic, Denmark, Finland, Germany, Italy, Luxembourg, Norway, Poland, Turkey, and the United Kingdom. “It’s a thrill to see my hometown take such a serious look at animal welfare,” says Jill Ettinger, VegNews’ Director of Digital Content. “Pittsburghers are known for our city pride—we lift each other up like family because we are family. These commitments to animals will only underscore the city’s unmatched compassion and kindness.” While cities like Los Angeles and New York are recognized as premier vegan destinations, Pittsburgh has some noteworthy offerings, including Shadobeni, which serves up vegan Trinidadian cuisine, and the James Beard-nominated Apteka—the country’s only Polish-inspired vegan restaurant.","filter_flag":1}
{"title":"Oji Holdings' Paper Production Wields SDGs Ideals to Forge New Paths | NIKKEI ESG Management Forum - 日経BP","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi82My_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi82My_SAQA?oc=5","id":"CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi82My_SAQA","guidislink":false,"published":"Wed, 06 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=340, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi82My_SAQA?oc=5\" target=\"_blank\">Oji Holdings' Paper Production Wields SDGs Ideals to Forge New Paths | NIKKEI ESG Management Forum<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">日経BP<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Oji Holdings' Paper Production Wields SDGs Ideals to Forge New Paths | NIKKEI ESG Management Forum - 日経BP","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi82My_SAQA?oc=5\" target=\"_blank\">Oji Holdings' Paper Production Wields SDGs Ideals to Forge New Paths | NIKKEI ESG Management Forum<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">日経BP<\/font>","source.href":"https:\/\/project.nikkeibp.co.jp","source.title":"日経BP","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Of the approximately 500 companies the \"father of Japanese capitalism\" Ei'ichi Shibusawa was involved in founding or managing, it was following his leadership of Japan's first national bank the he called for the establishment of a Western-style paper manufacturer. Today, paper is sourced from renewable wood and waste paper, but back then it was made from recycled rags. In this sense, the paper industry, one of the first sectors in Japan's modernization program of industrialization, was in line with the very same concepts underpinning the United Nations Sustainable Development Goals (SDGs), right from its beginning. Utilizing Forest Resources for New Creations: Materials, Pharmaceuticals A number of my environmentally aware friends say, \"When I buy toilet paper or tissues, I only buy FSC certified products, even if they are a little more expensive.\" The FSC certificate is an internationally recognized document issued by the Forest Stewardship Council GmbH headquartered in Germany. It is granted in recognition of forest management practices that protect the environment. By purchasing products from these certified forests which are identifiable with the mark, consumers are supporting conservation activities that protect and nurture woodlands. Since 2011, Oji Holdings Corp. - Japan's leading paper firm in the industry that is also a top five global sector company in terms of revenue - has used FSC-certified paper for its Nepia line of home-use products. It owns and manages about 600,000 hectares of forest plantations known as Oji no Mori (Japanese for Oji Forests) in and outside of Japan, an area roughly two and a half times the area of Tokyo's Metropolitan expanse. The firm aims to have all its forests certified, including FSC certificates by 2030. Currently 96% of their plantations are certified. The company positions this as a contribution to \"Life on Land,\" Goal 15 of the SDGs. Oji Forest in Sarafutsu Village, Hokkaido. The Oji Group holds about 600,000 hectares of forest in Japan and around the world. Use of forest resources is not limited to paper only. The company has successfully applied the technology for making pulp - the raw material used to make paper that is gleaned from wood - to produce biomass plastic, a new material that can replace conventional petroleum-based plastic. Oji now aims to build a large-scale production system. The company also has another promising project that creates bio-ethanol from wood to be used as Sustainable Aviation Fuel (SAF). Domestic Japanese carriers, along with many of the world's airlines, have announced plans to use 10% SAF for flights by 2030. The use of biomass derived fuel gained from resources that do not compete with food production is expected to grow considerably in the future. A pilot manufacturing facility in Tokyo for producing wood-based ethanol. Oji Holdings is also focused on being active in pharmaceutical development. Hemicellulose is found in most plants and has been revealed to possess anti-inflammatory and anticoagulant effects, among others. The firm believes many medicines traditionally sourced from animals can be replaced with drugs derived from plants. Developing pharmaceutical products from hemicellulose, derived from plants. The company is framing these initiatives as \"creating new value from forest resources\" and is making this a key Group goal. This growth in innovative developments is being driven by the drop in demand for printing paper -- the firm's founding product -- caused by the increased focus on electronic technology. Reports for the term ended March 2022 show that over the last 17 years the share of printing paper as corporate revenue has dropped from 36% to just 14%. Oji Holdings traces its roots back to Japan's first Western-style paper manufacturer - Shoshi Kaisha - founded 150 years ago by Ei'ichi Shibusawa. Paper was an innovation at the time. using Western technology and establishing production techniques through trial and error development made it possible to realize this new method for high volume manufacturing. The company's product development for the next 5 to 10 years can be described as \"innovation that moves the times toward countermeasures against global warming\", a position that continues to draw deeply on the inspired DNA established a century and a half ago.","filter_flag":1}
{"title":"ESG Startups: Small steps towards a greater goal - krungsri.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmtydW5nc3JpLmNvbS9lbi9yZXNlYXJjaC9yZXNlYXJjaC1pbnRlbGxpZ2VuY2UvZXNnLXN0YXJ0dXBzLTIwMjPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmtydW5nc3JpLmNvbS9lbi9yZXNlYXJjaC9yZXNlYXJjaC1pbnRlbGxpZ2VuY2UvZXNnLXN0YXJ0dXBzLTIwMjPSAQA?oc=5","id":"CBMiTGh0dHBzOi8vd3d3LmtydW5nc3JpLmNvbS9lbi9yZXNlYXJjaC9yZXNlYXJjaC1pbnRlbGxpZ2VuY2UvZXNnLXN0YXJ0dXBzLTIwMjPSAQA","guidislink":false,"published":"Thu, 21 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=355, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmtydW5nc3JpLmNvbS9lbi9yZXNlYXJjaC9yZXNlYXJjaC1pbnRlbGxpZ2VuY2UvZXNnLXN0YXJ0dXBzLTIwMjPSAQA?oc=5\" target=\"_blank\">ESG Startups: Small steps towards a greater goal<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">krungsri.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ESG Startups: Small steps towards a greater goal - krungsri.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmtydW5nc3JpLmNvbS9lbi9yZXNlYXJjaC9yZXNlYXJjaC1pbnRlbGxpZ2VuY2UvZXNnLXN0YXJ0dXBzLTIwMjPSAQA?oc=5\" target=\"_blank\">ESG Startups: Small steps towards a greater goal<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">krungsri.com<\/font>","source.href":"https:\/\/www.krungsri.com","source.title":"krungsri.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"In 2015, the United Nations presented its vision for the Sustainable Development Goals (SDGs) to the world. These aim to ensure that by 2030, every nation is on the path to sustainable development, their societies are safe and at peace, and substantial progress is being made on reducing emissions of greenhouse gases, thus reducing risks arising from climate change.1\/ However, natural disasters continue to assail the world with ever greater frequency and severity, and surface temperatures trudge forward on their inexorable climb higher; indeed, in July 2023, an unwelcome landmark was reached when the instrumental record of global temperatures hit a new peak.2\/ With the stakes as high as ever but with many wondering whether it will be possible to achieve the SDGs, interest in issues around sustainability is taking on an ever more central role in societal discourse, and one especially important way that this is happening is through the burgeoning interest in ‘Environment, Social and Governance’, or ESG, issues. The three pillars of ESG are: (i) the Environment, with the focus here being on reducing emissions of greenhouse gases, cutting waste, increasing recycling rates, improving energy efficiency, and acting to develop strategies for addressing climate change; (ii) Social, or ensuring equality of employment opportunities, compensating employees fairly, maintaining workplace health and safety, providing employee benefits, and acting responsibly towards supply chains and the wider society; and (iii) Governance, which here refers to ensuring that business transactions are ethical, conducting activities with transparency and accountability, carrying out effective risk management, avoiding corruption or conflicts of interest, and maintaining the privacy of stakeholders’ data. Although at present, the criteria for judging ESG compliance are somewhat broad and ill-defined, the use of ESG metrics nevertheless provides a framework for managing organizations in a way that reflects the increasing desire for companies to be sustainable and environmentally friendly, and for their activities to be considered within the wider context of their societal impacts. However, the three legs of the ESG tripod do not carry the same weight, and across the public sector, the private sector, and the banking industry, it is the ‘E’ of ESG that is most talked-about. In particular, with the World Meteorological Organization (WMO) warning that the crucial 1.5-degree-Celsius guardrail may be breached within the next 5 years, it is efforts to reduce greenhouse gas emissions and so keep global warming below this crucial milestone that have attracted the most attention. However, the public and private sectors prioritize the ESG goals in somewhat different ways. For its part, the government’s attention is focused on accountability and transparency, or the ‘governance’ part of ESG; whereas the private sector typically uses the ESG indicators as a product or market differentiator. For example, companies leveraging digital technologies to build the circular economy3\/ or to facilitate the fair transition to a green economy4\/ may exploit the marketing potential of these moves since compliance with ESG goals may positively affect consumer purchasing decisions for higher-priced products. On the other hand, for the banking sector, ESG indicators are most important for their ability to illuminate a company’s financial sustainability, though the legal requirements governing disclosure relating to this may vary substantially from one jurisdiction to another. For example, the EU’s Sustainable Finance Disclosures Regulations (SFDRs) are very stringent and cover areas beyond the strictly financial, such as the company’s exposure to potential climate-related risks. Banks that fail to comply with these regulations are subject to fines and ratings downgrades. The ESG principles were first referenced in the 2004 report, ‘Who Cares Wins’, a joint undertaking by more than 20 global financial institutions and the UN Global Compact. The report proposed integrating the ESG issues into analysis, asset management and securities brokerage services with the twin goals of helping investors make better informed decisions about the sustainability of their investments and providing stakeholders with access to a richer information environment.5\/ These proposals enable businesses to communicate their long-term sustainability policies and goals, providing a data source for analyzing companies’ growth potential. In the case of Thailand, the Securities and Exchange Commission (SEC) and the Stock Exchange of Thailand (SET) have mandated sustainability reporting for companies registered in Thailand, with guidelines introduced in 2012.6\/ Currently, a 3-year plan is in effect (2022 to 2024) with the ESG indicators now used by the stock exchange to assess corporate sustainability. At the same time, the steady rush of technological innovation has transformed societies and economies, and as consumer behaviors have undergone revolutionary changes, companies have had to adapt to a ceaseless whirlwind of competition. Against this backdrop, consumer awareness of issues around sustainability has risen substantially, and this has then added to worries over the potential impacts of these digital technologies. The e-Conomy SEA 2022 report by Google, Temasek, and Bain & Company7\/ confirmed some of these fears, showing that in just 8 years between 2022 and 2030, growth in the digital economy in Southeast Asia will lead to a 3.3-fold increase in greenhouse gas emissions, this having a warming potential equivalent to 20 million tonnes of CO 2 equivalent (CO 2 e). The social impacts of economic growth are also significant and include issues such as unfair employment practices, in particular the worrying tendency of workers in fast fashion suppliers to be ‘underpaid and overworked’. Problems in this area were highlighted in Earth.Org’s October 2022 publication ‘Fast Fashion: The Danger of Sweatshops’. This showed that in countries that are centers of production for the fast fashion industry (e.g., Bangladesh, China and India), minimum wages generally cover only 20-50% of basic household expenses. Moreover, employees are often forced to work 14-16 hours per day, seven days a week, in environments that are poor, unhygienic, and unsafe while being subject to verbal and sometimes physical abuse from managers.8\/ Faced with this situation, companies of all sizes from major corporations to startups have increasingly recognized the importance of aligning with the ESG goals and of moving economic development to a much more sustainable basis. This process has been substantially accelerated by the insistence by regulatory authorities that alongside their annual financial report, companies are also required to release a sustainability report detailing their environmental and sustainability goals. Generally, companies have responded to shifting interest in sustainability in one of two ways. Companies may focus on their own impacts by overhauling their business processes, cutting their greenhouse gas emissions, and reducing their environmental impacts. Alternatively, they may bring new products and services to the market that help other companies or individuals reduce their own greenhouse gas emissions more rapidly and more effectively. Likewise, on the consumer side of the market, widespread changes in behavior are being seen as individuals and groups switch to purchases of environmentally friendly goods and services that have a beneficial impact on society. Demand-driven changes like these naturally present an opportunity for companies of all sizes to respond to consumer demand by supplying the market with their new ESG-oriented products and services, an alternative way to achieve the sustainability development goals. However, because startups are more agile and often have their roots in technological innovations and breakthroughs, they are well placed to use technology to amplify their business impacts and so grow very rapidly. This is why in this area, ‘ESG startups’ are making rapid inroads into the market, allowing them to take on an ever more important role. A positive trend in Europe As stated above, ESG issues have attracted attention in both the public and private sectors and at all levels of the economy down to that of startups. However, although there is a constant flood of new startups appearing worldwide, only a very few of those that have a business model that deals directly with ESG issues have risen to international prominence. Moreover, because these worries rose to prominence in Europe ahead of other parts of the world—especially when it comes to the climate and the environment—these startups have tended to be concentrated there. When it comes to raising funds, in addition to looking to the private sector, European startups also have the option of turning to public funds administered by the EU that have been established with the explicit intention of supporting startups operating in the environmental space. For example, the LIFE Programme has funding worth EUR 5.4 billion and supports work in the areas of environmental and biodiversity conservation, the circular economy, quality of life improvements, climate change mitigation and adaptation, and the clean energy transition. In addition, Horizon Europe manages EUR 95.5 billion in funding targeting research and innovation relating to sustainability, while the Innovation Fund manages another EUR 10 billion for investments into green startups and programs that aim to reduce greenhouse gas emissions.17\/ This kind of public-private cooperation has underpinned the success of a number of European ESG startups and in particular, this paper will look at the three companies Plan A, Verkor and Carbon Equity. Plan A Verkor 2 Plan A’s software helps companies record and analyze data relating to core activities that result in the release of CO2, and the program then generates suggestions on how these can be reduced. In addition to helping businesses cut their emissions, this service also assists companies with the preparation of sustainability reports and the production of ESG metrics. Since its founding, Plan A has collaborated with over 1,500 businesses and generated over 1,000 suggestions for ways to cut emissions. The company’s long-term vision is to facilitate cuts in global CO2e emissions totaling 1 gigatonne annually.The company also aims to green its supply chain all the way back to the mining and smelting of the metals used in battery production. One factor behind Verkor’s rapid success has been the company’s skill in securing funding, with EUR 100 million raised within a year of its founding.This has then been used to build a prototype factory and the Verkor Innovation Centre or ‘VIC’, which opened in June 2023 in Grenoble. This factory is capable of producing batteries with a net capacity of 150 MWh of battery cells per yearand thus qualifies as a ‘megafactory’. In addition to its skill in raising funding, Verkor has also proved to be successful in seeking out partners, and the company has formed a long-term relationship with the French auto manufacturer Renault under which it has agreed to supply the company with batteries for use in its EVs. Renault EVs should begin to run on Verkor batteries in 2025. Because metals (especially nickel, manganese, cobalt and lithium) are major inputs into the production of EV batteries, the EU authorities have issued regulations covering the labeling of all batteries with a capacity greater than 2 KWh, and these thus now have to clearly state the CO 2 emissions associated with all stages of the battery’s production. EU regulations also cover the durability and performance of EV batteries, while the ‘digital battery passport’ records the origin of recycled metals, how to deal with used batteries, and how far their components may be recycled. Verkor has been adept at responding to these regulations, and to this end, the company has developed software for tracking the usage of metals across its supply chain, thus keeping the company in line with the industry’s legal requirements and allowing it to meet its sustainability goals.22\/ The company now plans to open a gigafactory in Dunkirk in the north of France employing 1,200 staff and with a production capacity of 16 GWh per year, sufficient to supply 300,000 new EVs annually.23\/ If the factory opens as planned in 2030, it will likely be the world’s most modern and efficient EV battery production facility. Carbon Equity ESG Startups in Thailand and ASEAN The company’s success stems from the range of investment opportunities available to interested parties, which stretch across industry sectors, construction, food, agriculture, energy, transport, and data storage and analytics.Carbon Equity has invested in several companies including: (i) Kenoby, a Norwegian company sustainably manufacturing recyclable wood alternatives that are more durable than natural wood; (ii) Rondo, a US company producing industrial heat batteries that aims to achieve net zero and which is currently working with Thailand’s SCG to develop heat storage materials; and (iii) Funga, a US company that is developing the use of mushrooms and funguses to improve soil quality and sequester atmospheric carbon. At present, Carbon Equity manages funds on behalf of more than 500 investors, and both its client base and total assets under management have increased steadily between Q4 2021 and the present. Against the backdrop of this international review, Thailand’s efforts at sustainable development have resulted in 26 Thai listed companies being selected for inclusion in the Dow Jones Sustainability Index (DJSI),25\/ sufficient to keep Thailand in first place in the ASEAN rankings for 9 consecutive years for this (from 2014 to 2022).26\/ The Stock Exchange of Thailand (SET) has also raised the profile of sustainability issues by releasing the ESG Data Platform in October 2022. This collects and makes available data on ESG metrics for listed companies, though the platform focuses especially on information that is easy to analyze alongside other financial data.27\/ In the future, the SET plans to use data on ESG metrics to evaluate the sustainability of stocks through its Thailand Sustainability Investment (THSI) and as part of the Corporate Governance Report of Thai Listed Companies (CGR). It is hoped that this will then reduce problems connected to the duplication of reporting for listed companies.28\/","filter_flag":1}
{"title":"Councilor push ‘waste consciousness culture’ - Mindanao Times","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vbWluZGFuYW90aW1lcy5jb20ucGgvY291bmNpbG9yLXB1c2gtd2FzdGUtY29uc2Npb3VzbmVzcy1jdWx0dXJlL9IBTGh0dHBzOi8vbWluZGFuYW90aW1lcy5jb20ucGgvY291bmNpbG9yLXB1c2gtd2FzdGUtY29uc2Npb3VzbmVzcy1jdWx0dXJlL2FtcC8?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vbWluZGFuYW90aW1lcy5jb20ucGgvY291bmNpbG9yLXB1c2gtd2FzdGUtY29uc2Npb3VzbmVzcy1jdWx0dXJlL9IBTGh0dHBzOi8vbWluZGFuYW90aW1lcy5jb20ucGgvY291bmNpbG9yLXB1c2gtd2FzdGUtY29uc2Npb3VzbmVzcy1jdWx0dXJlL2FtcC8?oc=5","id":"CBMiSGh0dHBzOi8vbWluZGFuYW90aW1lcy5jb20ucGgvY291bmNpbG9yLXB1c2gtd2FzdGUtY29uc2Npb3VzbmVzcy1jdWx0dXJlL9IBTGh0dHBzOi8vbWluZGFuYW90aW1lcy5jb20ucGgvY291bmNpbG9yLXB1c2gtd2FzdGUtY29uc2Npb3VzbmVzcy1jdWx0dXJlL2FtcC8","guidislink":false,"published":"Tue, 05 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=5, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=339, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vbWluZGFuYW90aW1lcy5jb20ucGgvY291bmNpbG9yLXB1c2gtd2FzdGUtY29uc2Npb3VzbmVzcy1jdWx0dXJlL9IBTGh0dHBzOi8vbWluZGFuYW90aW1lcy5jb20ucGgvY291bmNpbG9yLXB1c2gtd2FzdGUtY29uc2Npb3VzbmVzcy1jdWx0dXJlL2FtcC8?oc=5\" target=\"_blank\">Councilor push ‘waste consciousness culture’<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mindanao Times<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Councilor push ‘waste consciousness culture’ - Mindanao Times","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vbWluZGFuYW90aW1lcy5jb20ucGgvY291bmNpbG9yLXB1c2gtd2FzdGUtY29uc2Npb3VzbmVzcy1jdWx0dXJlL9IBTGh0dHBzOi8vbWluZGFuYW90aW1lcy5jb20ucGgvY291bmNpbG9yLXB1c2gtd2FzdGUtY29uc2Npb3VzbmVzcy1jdWx0dXJlL2FtcC8?oc=5\" target=\"_blank\">Councilor push ‘waste consciousness culture’<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mindanao Times<\/font>","source.href":"https:\/\/mindanaotimes.com.ph","source.title":"Mindanao Times","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Councilor push ‘waste consciousness culture’ DEVELOPING a culture of waste consciousness is necessary to minimize the waste ending up at the sanitary landfill. Councilor Temujin “Tek” Ocampo, the committee on environment chair, stressed the city is still struggling to implement solid waste policies. “Here in Davao City, despite our Solid Waste Management Ordinance, waste segregation at source is still a problem,” he said in his privilege speech during Friday’s regular session. “This mounting waste, if disregarded, will have far-reaching consequences threatening not only our environment but also our health and well-being. Thus, we must take immediate action to implement effective waste management strategies,” Ocampo added. The environmental chair cited that garbage generated in the city averages around 600-650 tons daily during the onslaught of the pandemic as reported by the Davao City Environment and Natural Resources Office. The councilor recently attended a Solid Waste Management Training in Kitakyushu, Japan on Nov. 13-22, sponsored by the Japan International Cooperation Agency and the city government of Davao. Among the training highlights were a tour of the Waste to Energy (WTE) Plant, Pollution control, proper waste segregation at individual homes, and teaching the school children environmental conservation. “This is something that amazed me, how they make sure that at a young age, children are already taught the importance of proper waste disposal. It is really important to start educating children at school about this matter to achieve proper and efficient waste management,” he said. Ocampo said he is looking to model the circular economy policy of Japan to reduce pollution and address resource scarcity, as segregated wastes will be upscaled and developed into new products through circulating materials using “R strategies” such as reuse, remanufacture, recycle, and refurbish. The councilor said they will take advantage of the 60 million Euro grant that the city received from the EU for the Green Economy Program for circular waste economy improvement and climate change policies and reduce greenhouse gas (GHG) emissions, circular waste economy policy, circular waste reduction economy and to increase energy efficiency and renewable energy deployment. In his closing statement, he vowed to follow through with the said training, modeling the Kitakyushu here in the city. The councilor recognizes the significance of community engagement and is looking forward to the first-ever Barangay Solid Waste Management Summit this December 2023 to re-educate citizens on proper waste disposal and brainstorm techniques of possible inventions with the input of barangay functionaries. “We cannot expect that this will be an overnight solution to our problem. As the quote says, “slowly but surely,” we too can change the behavior and mindset of our people through massive awareness of proper waste disposal,” he added.","filter_flag":1}
{"title":"Capital market investment up by 8pc - Daily News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPGh0dHBzOi8vZGFpbHluZXdzLmNvLnR6L2NhcGl0YWwtbWFya2V0LWludmVzdG1lbnQtdXAtYnktOHBjL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPGh0dHBzOi8vZGFpbHluZXdzLmNvLnR6L2NhcGl0YWwtbWFya2V0LWludmVzdG1lbnQtdXAtYnktOHBjL9IBAA?oc=5","id":"CBMiPGh0dHBzOi8vZGFpbHluZXdzLmNvLnR6L2NhcGl0YWwtbWFya2V0LWludmVzdG1lbnQtdXAtYnktOHBjL9IBAA","guidislink":false,"published":"Fri, 22 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=356, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPGh0dHBzOi8vZGFpbHluZXdzLmNvLnR6L2NhcGl0YWwtbWFya2V0LWludmVzdG1lbnQtdXAtYnktOHBjL9IBAA?oc=5\" target=\"_blank\">Capital market investment up by 8pc<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Daily News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Capital market investment up by 8pc - Daily News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPGh0dHBzOi8vZGFpbHluZXdzLmNvLnR6L2NhcGl0YWwtbWFya2V0LWludmVzdG1lbnQtdXAtYnktOHBjL9IBAA?oc=5\" target=\"_blank\">Capital market investment up by 8pc<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Daily News<\/font>","source.href":"https:\/\/dailynews.co.tz","source.title":"Daily News","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"DAR ES SALAAM: THE value of capital market investments has grown by 7.6 per cent in a year, thanks to the country’s favourable investment environment. According to the Chief Executive Officer (CEO) of the Capital Market and Securities Authority (CMSA), Mr Nicodemus Mkama, the value has reached 36.13tri\/- by the end of last month, up from 33.59tri\/- recorded in November 2022. Mr Mkama argued that the sharp increase was due to the country’s favourable investment environment, brought about by inclusive business policies and laws implemented by the Sixth Phase Government under President Dr Samia Suluhu Hassan. “The government’s implementation of the economic diplomacy policy in pursuit of good multilateral relations has been the catalyst for local and foreign investment,” Mr Mkama said. He stated that the open economic policy has significantly boosted the investment value of the capital markets, attracting other countries to come and learn best practices in Tanzania. Mr Mkama revealed this on Wednesday when addressing delegates from Burundi’s Capital Markets Authority (CMA) who visited the CMSA to share experiences and learn from Tanzania’s capital markets operations. He said the Burundi CMA’s delegation included members of the board of directors, management, and a team of experts who visited Tanzania’s CMSA, Dar es Salaam Stock Exchange (DSE), investment companies, and other stakeholders in the capital markets. He added that the visit would enable the Burundi CMA delegates to effectively run their capital markets while identifying critical areas that can enable their country to have stable capital markets. “Stable capital markets are resilient and efficient enough to bring positive results in stimulating the development of the financial sector and the entire economy of Burundi, just as they do in Tanzania,” Mr Mkama said. He attributed the visit of the Burundi CMA delegation to the recent stunning returns from the CMSA, brought about by new products and innovations in the capital markets that attracted investment from both the public and private sectors. Mr Mkama mentioned the new products, including green bonds, social bonds and Sukuk bonds, stating that their presence positioned Tanzania on the world’s capital markets stage. The Sukuk bond is an Islamic financial certificate, similar to a bond in Western Finance, for instance, Europe, that complies with Islamic religious laws known as Sharia. He said Tanzania’s capital markets are among the best-performing markets in Africa in recent days due to the CMSA delivering in line with the government’s commitment to boosting investment. According to the World Bank (WB), Tanzania scored 157 per cent on the ranking of the East Africa Common Market Protocol Scorecard on the movement of capital, goods and services. The country scored 18 marks out of a total of 20 marks, emerging as the best- performing country in the East Africa Common Market Protocol Scorecard. “As of today, in Tanzania, there are no barriers for foreign investors to participate in the stock exchange, corporate bonds and investment funds,” Mr Mkama hinted. Furthermore, he said the CMSA has been utilising both local and foreign capital market opportunities by authorising Stock Exchange Rules to the Dar es Salaam Stock Exchange (DSE) in order to generate funds for Environmental, Social and Governance (ESG). He said the improvement has boosted sales and further facilitated companies and institutions in accessing funds for their business and overall development. Likewise, Mr Mkama said the CMSA has implemented a special strategy for providing Municipal and Subnational Bonds to Local Government Authorities (LGAs) and Public Institutions for various bankable projects that can bring returns. He said the introduction of bonds adhered to the government’s Alternative Project Financing Strategy, which was launched by the Minister for Finance Dr Mwigulu Nchemba to strengthen the availability of financial resources for building a competitive economy for people-centered development in Tanzania. “The new strategy has enabled the Tanga Urban Water Supply and Sanitation Authority (Tanga-UWASA) to be the first entity in the country to qualify for the requirements of providing the Sub- National Water Infrastructure Green Revenue Bond for the construction of critical water infrastructures and environmental conservation. In embracing the technology revolution, Mr Mkama said the CMSA approved smart tech systems known as Sim Invest and “Shares on the Hand” that allow the provision of services to the capital markets using Information Communication Technologies (ICTs). He said ICT has been used in buying and selling shares. “This move has increased the participation of rural and urban residents in investment funds and the stock market,” he said. On the other hand, he said the CMSA, in collaboration with all stakeholders, has prepared guidelines on coordinating crowdfunding to increase the availability of finance for start-ups, micro, small, and medium enterprises. Mr Mkama said the CMSA will continue to create a conducive climate for the effective participation of both the public and private sectors in capital markets, where they can secure funds through infrastructure bonds, green bonds, blue bonds and subnational bonds for development projects.","filter_flag":1}
