{"title":"Certified upcycled foods continue to gain traction with the category projected to reach $80b by 2032 - FoodNavigator-USA.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLXVzYS5jb20vQXJ0aWNsZS8yMDIzLzA3LzA1L0NlcnRpZmllZC11cGN5Y2xlZC1mb29kcy1jb250aW51ZS10by1nYWluLXRyYWN0aW9uLXdpdGgtdGhlLWNhdGVnb3J5LXByb2plY3RlZC10by1yZWFjaC04MGItYnktMjAzMtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLXVzYS5jb20vQXJ0aWNsZS8yMDIzLzA3LzA1L0NlcnRpZmllZC11cGN5Y2xlZC1mb29kcy1jb250aW51ZS10by1nYWluLXRyYWN0aW9uLXdpdGgtdGhlLWNhdGVnb3J5LXByb2plY3RlZC10by1yZWFjaC04MGItYnktMjAzMtIBAA?oc=5","id":"CBMimAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLXVzYS5jb20vQXJ0aWNsZS8yMDIzLzA3LzA1L0NlcnRpZmllZC11cGN5Y2xlZC1mb29kcy1jb250aW51ZS10by1nYWluLXRyYWN0aW9uLXdpdGgtdGhlLWNhdGVnb3J5LXByb2plY3RlZC10by1yZWFjaC04MGItYnktMjAzMtIBAA","guidislink":false,"published":"Wed, 05 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=186, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLXVzYS5jb20vQXJ0aWNsZS8yMDIzLzA3LzA1L0NlcnRpZmllZC11cGN5Y2xlZC1mb29kcy1jb250aW51ZS10by1nYWluLXRyYWN0aW9uLXdpdGgtdGhlLWNhdGVnb3J5LXByb2plY3RlZC10by1yZWFjaC04MGItYnktMjAzMtIBAA?oc=5\" target=\"_blank\">Certified upcycled foods continue to gain traction with the category projected to reach $80b by 2032<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator-USA.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Certified upcycled foods continue to gain traction with the category projected to reach $80b by 2032 - FoodNavigator-USA.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLXVzYS5jb20vQXJ0aWNsZS8yMDIzLzA3LzA1L0NlcnRpZmllZC11cGN5Y2xlZC1mb29kcy1jb250aW51ZS10by1nYWluLXRyYWN0aW9uLXdpdGgtdGhlLWNhdGVnb3J5LXByb2plY3RlZC10by1yZWFjaC04MGItYnktMjAzMtIBAA?oc=5\" target=\"_blank\">Certified upcycled foods continue to gain traction with the category projected to reach $80b by 2032<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator-USA.com<\/font>","source.href":"https:\/\/www.foodnavigator-usa.com","source.title":"FoodNavigator-USA.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Since the Upcycled Trade Association was founded in 2019 it has grown from nine companies to include 260 companies with 454 certified produces and ingredients in the market – helping to drive overall growth to expected $80b by 2032, the trade group’s CEO Angie Crone told FoodNavigator-USA. She attributed this fast growth in part to the group’s clear definition of upcycled food and its certification program, both of which protect against greenwashing and allegations of misleading consumers to ensure future stability in the marketplace. She explained that upcycled food is defined as ingredients that would have otherwise be wasted – such as going to the landfill or composted or used as animal feed – but are now being redirected for human consumption through a verified supply chain. Likewise, she explained, “the Upcycled Certified certification … is the first and only third-party certification for upcycled products, and it is a powerful tool to connect your buyers as well as your consumers to what you’re doing in the supply chain to have a positive impact.”​ Educating and reassuring consumers are keys to long-term growth​ She added the certification and clear definition also offer assurance to consumers who want to support products that are better for them and the planet but also who are increasingly skeptical of green claims. “We know that consumers more than ever have a distrust of company claims, and so it is very important that it’s third party verified. There’s a lot of integrity in that process, and there are clear requirements,”​ she added. The certification also is helping the group raise consumer awareness of upcycled food from less than 10% when the trade group launched to now upwards of 40% of mainstream consumers and 60% of natural shoppers, Crone said. “It is really impressive growth from where we started to where we are now,”​ she said. But, she added, “there’s still work to do.”​ The trade group is focused on consumer education and working with retailer and brands to communicate the value of upcycled foods and to better highlight them at retail. For example, Crone said, the association works with retailers to “get really creative, just like the products they are carrying​,” such as through in-store signage, end-caps and embedding the values of the certification into their sourcing standards. For brands, the group provides tools to educate consumers, such as a partnership with PlanetFWD, which can help companies assess their carbon footprint and find ways to reduce their impact. Looking forward, Crone said she expects to see more consumer education in the coming year as well as a targeted effort to create additional opportunities through the US Farm Bill, which is up for reauthorization.","filter_flag":1}
{"title":"Upcycled flour replacement introduced at IFT FIRST - BakingBusiness.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LmJha2luZ2J1c2luZXNzLmNvbS9hcnRpY2xlcy81OTU1MC11cGN5Y2xlZC1mbG91ci1yZXBsYWNlbWVudC1pbnRyb2R1Y2VkLWF0LWlmdC1maXJzdNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LmJha2luZ2J1c2luZXNzLmNvbS9hcnRpY2xlcy81OTU1MC11cGN5Y2xlZC1mbG91ci1yZXBsYWNlbWVudC1pbnRyb2R1Y2VkLWF0LWlmdC1maXJzdNIBAA?oc=5","id":"CBMiYGh0dHBzOi8vd3d3LmJha2luZ2J1c2luZXNzLmNvbS9hcnRpY2xlcy81OTU1MC11cGN5Y2xlZC1mbG91ci1yZXBsYWNlbWVudC1pbnRyb2R1Y2VkLWF0LWlmdC1maXJzdNIBAA","guidislink":false,"published":"Thu, 20 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=201, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LmJha2luZ2J1c2luZXNzLmNvbS9hcnRpY2xlcy81OTU1MC11cGN5Y2xlZC1mbG91ci1yZXBsYWNlbWVudC1pbnRyb2R1Y2VkLWF0LWlmdC1maXJzdNIBAA?oc=5\" target=\"_blank\">Upcycled flour replacement introduced at IFT FIRST<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BakingBusiness.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Upcycled flour replacement introduced at IFT FIRST - BakingBusiness.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LmJha2luZ2J1c2luZXNzLmNvbS9hcnRpY2xlcy81OTU1MC11cGN5Y2xlZC1mbG91ci1yZXBsYWNlbWVudC1pbnRyb2R1Y2VkLWF0LWlmdC1maXJzdNIBAA?oc=5\" target=\"_blank\">Upcycled flour replacement introduced at IFT FIRST<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BakingBusiness.com<\/font>","source.href":"https:\/\/www.bakingbusiness.com","source.title":"BakingBusiness.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"CHICAGO — Renewal Mill has debuted its 100% upcycled, total flour replacement blend at IFT FIRST, the Institute of Food Technologists' annual meeting and expo in Chicago at booth S3471CA. The company combined its individual upcycled ingredients into a flour blend that may be used as the sole flour in recipes and formulations, according to the company. RenewALL 100% Upcycled Blend may be a substitute for all of the all-purpose flour in a formulation or all of a conventional alternative gluten-free flour blend, the company said. The product offers more fiber and protein per serving than whole wheat flour. It is neutral tasting, pale tan flour that produces a golden tan crumb in applications like cakes, cookies, muffins and crackers, the company said. “This blend is truly revolutionary,” said Alice Medrich, R&D chef, Renewal Mills. “RenewALL 100% Upcycled Blend will shorten product development timelines and allow the industry to get more upcycled products into the market faster. It’s the holy grail — both simple to use and delicious.","filter_flag":1}
{"title":"Food product quality, environmental and personal characteristics affecting consumer perception toward food - Frontiers","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZzdWZzLjIwMjMuMTIyMjc2MNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZzdWZzLjIwMjMuMTIyMjc2MNIBAA?oc=5","id":"CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZzdWZzLjIwMjMuMTIyMjc2MNIBAA","guidislink":false,"published":"Mon, 31 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=212, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZzdWZzLjIwMjMuMTIyMjc2MNIBAA?oc=5\" target=\"_blank\">Food product quality, environmental and personal characteristics affecting consumer perception toward food<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Food product quality, environmental and personal characteristics affecting consumer perception toward food - Frontiers","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZzdWZzLjIwMjMuMTIyMjc2MNIBAA?oc=5\" target=\"_blank\">Food product quality, environmental and personal characteristics affecting consumer perception toward food<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","source.href":"https:\/\/www.frontiersin.org","source.title":"Frontiers","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Food industries are developing new processing technologies, resulting in the emergence of new product categories, including ready-to-eat meals, functional foods and beverages, and plant-based foods, etc. Rapid globalization, changes in lifestyle, consumer awareness, and perception toward food drive further technical advancements. However, consumer perception remains the prime factor for food marketing and technological development. Consumer perception is a trifecta of sensory properties, personal and environmental factors. Sensory and personal factors include consumer age, attitude, health condition, nutrition awareness, and religion which directly influence consumer choice. Whereas environmental factors consist of regional variation in the food process, national economic status, and consumer purchasing power. All these factors affect consumers’ decisions to accept or reject foods. Additionally, consumers are more willing to taste innovative food products that assure the safety and quality of the product. 1. Introduction To sustain life and promote well-being, the human body has a fundamental physiological requirement for food. Despite the importance of its nutrient content, the selection of food is subject to the influence of consumer perception. Apart from its fundamental role, food also provides a pleasant sensation, and this characteristic is predominantly taken into consideration when designing a food product (van Eck and Stieger, 2020). The exponential surge in global population, with a 98% increase from 1961 to 2000, directly influenced the demand for food. This demand will be further exacerbated by an additional 71% increase in population by 2050. The high population growth is inevitably leading toward Malthusian crisis (Cole et al., 2018; White and Gleason, 2022). While the increase in population challenges the harmony of food security, current scientific and technological advances in agriculture and food science have contributed to meeting the demand (Cole et al., 2018). The rise in income has created reciprocal interactions between the rural food system and the demands of modern urban life. The dynamics between food prices and income have increased accessibility, impacting food choice and consumer behavior, with both negative and positive implications (Ambikapathi et al., 2022). As basic food security gets assured and the availability of food is not an issue, the spectrum of food choice broadens. The phenomenon of choosing a certain food is the result of an intricate interaction between sensory inputs, perception, cognitive factors, and cultural acceptance. These factors can be divided into external and internal factors (Musso et al., 2022). External factors encompass various aspects, including demographic changes in social groups, lifestyle alteration due to economic prosperity, globalization of food markets, changes in the agrifood systems and the supply chain (such as modern retail, new food safety, and quality standards), all of which have had an impact on food availability and dietary choices (Cole et al., 2018). Consumer perception of food and intake also varies based on factors such as the accessibility of the food, eating locations, companions, the color of the food, and physical and sensory properties like temperature, lighting, smell, time of consumption, and sounds (Bartkiene et al., 2019). Additionally, individual factors such as gender, age, education level, emotional motivation, education level, income level, and understanding of food risk factors, additives, and contaminants have a significant influence on food choice (Bartkiene et al., 2019). Figure 1 represents various factors affecting consumers’ perception of food. FIGURE 1 Figure 1. Factors influencing consumer perception toward food. Erroneous perception of new technologies has an impact on food product preferences. For example, irradiated food reduces microbial load, increases shelf life, and reduces the occurrence of foodborne illness (Caputo, 2020). Foods that undergo irradiation require an international Radura logo to denote the treatment. Some consumers mistakenly believe that irradiation treatment diminishes the nutrient content of food content, degrades sensory quality, and in the worst case, could make food radioactive. The Radura logo has gained notoriety, prompting international agencies to revise the labeling system (e.g., adding a statement such as “Gamma-ray sterilization of food” or “Electron beam sterilization”; Caputo, 2020). This highlights how poor presentation and labeling could lead to misbranding of products, influencing consumer acceptance and their willingness to purchase. The urge to buy a product is unapologetically associated with the weight of a brand. For example, when comparing two fundamentally identical products from different brands (national brands and private label brands), consumer acceptance is skewed. Consumers exhibit more confidence in national brands, which highlights the significant impact branding can have on a product’s status in the consumer mindset (Musso et al., 2022). Sometimes, innovation creates hesitancy among consumers when it comes to making a purchase. It is essential for innovation in food processing and preservation technology to align with the characteristic flavors of food. This allows consumers to accept the product, while producers can take advantage of the new technologies. Red and processed meats are well-known for their association with non-communicable diseases, and reducing consumption is considered the best approach to counteract this issue (Bryant, 2019). To address this concern, numerous plant-based meat analogs\/substitutes derived from peas, soy, and beans have been developed and continue to be developed. However, these plant-based products do not fully replicate the sensory profile, particularly the meaty flavor, of their animal-based counterparts (Grasso et al., 2022). Studies of the factors influencing consumer perception of food and their impact on the food industry are limited. This review article explores multiple variables related to food, including sensory aspects, packaging, and personal and environmental factors such as religion, ethics, socio-demographic variables, consumer age, consumer health, and awareness. The article also examines consumer decision-making processes that impact the food industry and discusses consumer approaches to innovative food systems. Finally, the article concludes with remarks and future perspectives on various factors influencing consumer perception of food. 2. Variables in food acceptance 2.1. Food-related variables 2.1.1. Sensory attributes The selection of food is highly dependent on sensory properties of food products, which include taste, flavor, Odor, texture, and more. The acceptance of the food is considerably enhanced when a consumer is exposed to a food containing two distinctively different tastes. This may be due to the suppression of sensory desire beyond exposure to a similar taste profile, resulting in a lowered desire for similar-tasting food (Chaaban and Andersen, 2021). For example, combining two or more foods can create more appealing composite food. Specific foods possess distinctive properties, such as microscopic structure, homogeneity, and emulsion properties, which influence the sensory characteristics and nutritional constituency of the composite food (van Eck and Stieger, 2020). The perception of a flavor is the function of taste, texture, smell, visual and auditory cues. Acceptance of a particular sensory profile is a multisensory phenomenon, which is also heavily influenced by the emotional experience of the food (Figure 2), with less concern about its impact on health (Prahalathan et al., 2022). Brands are now focusing on creating product that evoke a strong emotional attachment from consumers. The sensory characteristics of these products are specifically designed to tap into the brand’s signature sensory recall, which is appealing to consumers (Crofton et al., 2019). When an optimum sensory profile is achieved, acceptance surges, leading to higher consumption of the food. FIGURE 2 Figure 2. Sensory attributes and their influence on consumer food perception. The influence of the sensory profile of food on its palatability can be optimized to quantitatively modulate calorie intake. It has been well established that palatability is not the only factor influencing food choice; the contextual aspects of the situation also have a significant impact on individuals’ choices (McCrickerd and Forde, 2016). The smell of food plays a crucial role in food choice as it is instantaneously perceived compared to other senses (visual, auditory, and tactile). However, it may not necessarily have a direct stimulatory effect on appetite and food choice (McCrickerd and Forde, 2016). Nonetheless, it has a strong affiliation with the emotional experience of food and can greatly influence consumers’ purchasing decisions (Maggioni et al., 2020). The textural properties and tactile feedback of food also have a significantly influence on the acceptability and consumer perception. Foods with harder, chewier, thicker, and creamier properties are associated with being nutritious and providing a higher sense of satiety. This is because increased chewing time and force elicit an optimum cephalic-phase preparatory response and enhances oro-sensory perception. Therefore, integrating and maintaining these characteristics can have a significant influence on food choices (McCrickerd and Forde, 2016). Taste is the most dynamic variable that strongly defines the nutritional relevance of food. For instance, the savory deliciousness of umami flavor is associated with the presence of protein in food, while sweetness is linked to the calorific abundance of the food (McCrickerd and Forde, 2016). On the other hand, visual cues directly influence the choice of meal portion size, and visual input information is extrapolated to compare newly introduced food with previous experiences (McCrickerd and Forde, 2016). Additionally, auditory feedback derived from chewing, drinking, or biting food should correspond to the nature of the food (Spence et al., 2019). The likeness of sensory attributes of a certain food product can be promptly determined by the degree of consumers’ acceptance. Hence, it is a strong determinant for estimating consumer demand. The physicochemical properties of food are the primary determinants of the resulting sensory attributes. In order to meet the perceived sensory requirements of a specific food, physicochemical properties, such as texture and flavor must be modulated to meet consumers’ expectations (van Eck and Stieger, 2020). 2.1.2. Packaging The packaging of food product protects it from the damages and spoilages that could be inflicted by physical, chemical, and microbial activity (Otto et al., 2021). Additionally, quality, and visual esthetics (graphics, colors, and images printed) of packaging materials, are attributed to be the overall quality of the product. Hence, steers the consumer preference of the product. The importance of packaging esthetics is more prominent in fast-moving consumer goods (FMCG) as it enhances product uniqueness above other brands (Rambabu and Porika, 2020; Figure 3). FIGURE 3 Figure 3. Food packaging and consumer attraction. Packaging and labeling are crucial for initial consumer-brand interaction which significantly influence product preference. The appearance of the food packaging goes beyond color, size, shape, images, and text, as it is also subconsciously assessed for the inclusion of logos beyond the brand logos, like healthy logo and nutrition information (Lindh et al., 2016). The functionality of the packaging materials, such as resealable, ease of opening, storage and transportation convenience, and disposability, significantly influences consumer acceptance. For example, the widespread use of tetra pack in perishable food packaging, such as milk and fruit juice, is primarily attributed to their non-refrigerated prolonged storage capability (Gómez et al., 2015). Consumers concerns arise regarding the environmental effects of glass, metal, paper, and various plastics (Otto et al., 2021), as they have limited usage time and poor recyclability (Geueke et al., 2018). The active and intelligent packaging concept is gaining attention due to its ability to extend shelf life (Müller and Schmid, 2019). Additionally, green packaging technology, which utilizes biodegradable plant-based materials derived from plant extracts and nanomaterials, has also been recognized for its innovation (Zhang and Sablani, 2021). The integration of these technologies (active, intelligent, and green packaging) can positively impact the overall quality and safety of food products while minimizing ecological impact, appealing to informed consumers (Han et al., 2018). 2.2. Environmental and personal 2.2.1. Regional variations The subjective decision-making process involved in choosing a particular food commodity is complex and influenced by multiple components. One significant factor is regional variation, which encompasses contrasting attitudes, values, literacy rates, generational differences, and economic status (Ngugi et al., 2020a). Two countries in proximity may exhibit similar consumer patterns, as is the case with North and South America. Conversely, despite the geographical distance, North America and European countries are economically comparable, resulting in shared patterns in consumer behavior. However, European Union consumers prioritize food loss and waste reduction, as well as the adoption of best practices to minimize food waste (Massari et al., 2022). The culture and norms specific to a region are passed down to the new generation, deeply rooted in the sentiments and values that create a sense of belonging to a group. However, modern Western society has embraced individualism, seeking to discover its own new horizon of food culture. Brands target advertising their product with the approach that is suitable to the culture of a region (Ngugi et al., 2020b). The attitude and choice of the consumer from western society is heavily influenced by environmental concerns, while neophobia counters the positive attitudes. Neophobia regarding new food and nascent food technology impacts consumer’s willingness to buy new food products (Coderoni and Perito, 2021). Despite the extensive application of new food technology, people are willing to buy upcycled foods if rational information is conveyed regarding the importance of a circular economy and frugality. This approach has been successful in different regions of the world. However, there is still a lack of extensive studies on perception toward upcycled food, depending on the country and food categories (Aschemann-Witzel et al., 2022). In some regions, taxation on sugar-sweetened beverages (SSB) is used to stunt the excessive consumption of the SSB (Fernandez and Raine, 2019), which could be replicated for other ultra-processed foods as the prevalence of obesity and other non-communicable diseases (NCD) caused by poor dietary intake increases. Such initiatives appear to have shown success in lowering the consumption of ultra-processed food in some regions (Inoue et al., 2018) Despite legislation aimed at regulating food labeling and advertising to promote healthy food choices (Koen et al., 2018), the influence of food prices has always been the primary factor in food product selection in underdeveloped countries. However, developed countries have country-specific legislation, such as the Nutrition Labeling and Education Act (NLEA) in the United States (Lewis and Jackson, 2014), R429 in South Africa (Department of Health, 2014), and EU regulation No. 1169\/2011 (European Union, 2011), which regulate labeling to eliminate false nutritional claims and guide consumers in choosing healthy food from a plethora of foods claimed to be healthy with limited evidence. Additionally, certain voluntary labeling trends, such as “Clean label,” focus on near-natural processing methods and healthy food ingredients (Asioli et al., 2017; Figure 4). On the contrary, the gluten-free diet has gained hype among the Western population, despite only about 1% of the total population being affected by coeliac disease and its unproven health benefits (Niland and Cash, 2018). FIGURE 4 Figure 4. Effect of location and economic status on consumer food selection and perception. A short food supply chain (SFSC) system promotes the utilization of endogenous resources and syncs with the processing entity to strengthen the local food system. This system works against prevalent food consumerism by enabling consumer to access fresh products, understand the transparency of the production process, and foster a closer relationship between consumers and brands. The current concept of Sustainable Development Goals (SDG) and its fulfillment by 2030 have diverted people’s attention toward SFSC and contributed to a sustainable local economy that has geographically regionalized food consumption (Hernández et al., 2021). In the present context, environmental policy is one of the prime factors that builds consumer confidence and eventually fosters positive attitudes toward certain food products and the process of food preparation. The policies governing food safety vary from country to country or region to region. Countries within the European Union have similar policies that influence people’s attitudes toward food and directly steer the region-specific characteristic of food consumerism (Lin et al., 2020). The trend of new eating habits has relegated healthy food to exclusivity, resulting in occasional consumption. Even Mediterranean populations, where healthy Mediterranean diets were extensively consumed, are shifting toward energy-dense diets containing a high number of proteins and fats (Filippo, 2022). 2.2.2. Religion and ethics One cannot render a conclusive picture of the food habits of any whole theological community. Factors such as individuals’ onerous sense toward their respective religion inhibit the generalized conclusion of food consumerism (Hamerman et al., 2019). Therefore, only an extensive study of the correlation between food and psychology could determine the inclusive perception of the community toward food and consumption behavior (Cohen, 2021). Religion and intensity of belief in religion affect the food system, as there is a specific system of beliefs and guidelines regarding the food that is allowed to be consumed or food that must be specifically processed with specified methods. Some foods are even forbidden to consume. For example, Hinduism supports a vegetarian diet and strongly restricts beef consumption, Judaism and Islam require food to be processed under specific guidelines, and Mormonism forbids the consumption of tea, coffee, and alcohol (Heiman et al., 2019). Different religions have requirements that must be followed when slaughtering an animal, and only certain meat products are deemed edible. Muslims follow “Halal laws” and Jews follow “Kosher laws” as per their respective scriptures, which have their own certification bodies to verify the authenticity of adherence to their respective laws (Corte et al., 2018). However, religiosity heavily influences the level of adherence to religious guidelines on food consumption (Heiman et al., 2019). On the contrary, an increasing number of people are deviating away from religious belief and religiosity, and with the rise of self-entitled spiritual leaders, there is a rise in the number of people declaring themselves as “Spiritual but Not Religious” (Michael and Claire, 2017). Spirituality is a pathway to transcendence and escape from the materialistic world. However, the recent inclination toward consumerism and branding and commercialization of spirituality has reshaped the FMCG market in India and religious products such as books, jewelry, and music in the Western world, but that has also jeopardized the very definition of spirituality (Arli et al., 2022; Figure 5). FIGURE 5 Figure 5. Ethical consideration behind food perception and selection. The ethical aspect of the consumer’s food habits is driven by multiple aspects of motivation. Ecological, political, and religious factors influence one’s attitudes toward food and food choices (Hielkema and Lund, 2022). Approximately 30% of worldwide greenhouse gas emission result from an inefficient food production and consumption system (van de Kamp et al., 2018). Therefore, sustainable diets are gaining attention. According to the United States Food and Drug Administration (2022), sustainable diets have a low environmental impact and carbon footprint and contribute to food and nutritional security. In comparison to plant-based food products, animal products have higher carbon emissions (Heller et al., 2018). Hence, consumers are inclined toward alternative meats. The theory of the theory of planned behavior suggests that the largest number of consumers are inclined toward meat alternatives due to health reasons, environmental impact, and their attitude driven by moral deliberation over the inhumane killing of animals and their wellbeing (Marcus et al., 2022). 2.2.3. Consumer age and attitude The age-related change in food perception may be brought on by age-dependent physiological and psychological factors, including olfactory function, oral tactile sensitivity, polypharmacy, and neophobia (Liu et al., 2022). Additionally, emotional considerations (e.g., sentiments, esthetic, and epistemic emotions) at different ages provoke sensory and emotional responses, leading to a change in food interest (Zhong and Moon, 2020). Moreover, the choice is driven by factors such as familiarity with food (Gotow et al., 2018), utilitarian and hedonistic norms (Shao and Li, 2021), and injunctive and descriptive norms (Melnyk et al., 2019), and each of these aspects has been discovered to be age-dependent (Musso et al., 2022). One of the factors influencing people’s perception of food is ongoing physiological change throughout life (Barragán et al., 2018). Olfactory function, a key age-related physiological change affecting food perception, is significantly impaired in the elderly (Murphy and Vertrees, 2017). It was also evident that a number of elderly people who take medications and have poor oral health and hygiene, which leads to a decline in sensory perception (mouthfeel, taste, chewiness, and smell) and a decrease in food interest (Barragán et al., 2018). Several studies have shown that as people age, their salivary flow rate, salivary composition, and tactile sensitivity of the tongue decline. Furthermore, it has been found that genetic variability, polypharmacy, and comorbidities are common with aging and are associated with how an individual perceives food (Regan et al., 2021). Such as, young adults have a positive attitude and are predisposed to fast process foods and beverages (Shaban and Alkazemi, 2019), which possibly shows the age-dependent physiological change governing the cohort’s perception and selection of foods. Although oronasal physiological and olfactory potency attenuates aging and influences consumers’ attitudes toward food, it is not always the case. Age-proportionate psychological changes are known to have an impact on how customers perceive food. Certain children’s and adults’ food perceptions are generally based on traditional thoughts, which are deeply connected with feelings, pleasure or displeasure, nostalgia, and behavioral responses (Kaneko et al., 2018); such reluctance to try healthy substitutes for familiar products (Laureati et al., 2018) results in food neophobia (FN). According to Hazley et al. (2022), food neophobia elevates with age from 1 to ∼6 years which gradually diminishes until they reach adulthood and remains stagnant until they become older adults (>54 years). Consequently, neophobic consumers show skeptical judgment concerning functional food, convenience food products, sugary beverages, and unhealthy ready-to-eat meals, while certain FN younger people prefer butter, soft drinks, red\/cured meat, and sweets. Age-dependent consumers’ perceptions and attitudes toward food vary according to their peers’ opinions, esthetic pleasure, epistemic emotions, and joyous emotions (Zhong and Moon, 2020). However, some of the factors are homogenous in all the age groups, such as value for money, and satisfaction on prior consumption. A concern in value for money, eco-friendliness of food, product quality, and traceability are more pronounced in older age customers. Younger age groups are more inclined toward factors such as promotion policies, fulfillment of the marketed benefits (health claims), and environmental consideration (Musso et al., 2022). Studies have shown that young children, adolescents, and young adults prefer instant food and are willing to try functional and convenience foods, sweets, and sugary beverages unless they are neophobic (Jezewska-Zychowicz and Plichta, 2021). Nonetheless, older adults and\/or the elderly have a positive attitude toward natural, organic (Rodríguez-Bermúdez et al., 2020), nutrient-dense, safe, and quality-assured, lower salt and sugar content foods (Szakos et al., 2020), and functional foods, which is driven by the elderly’s desire to address health problems. Thus, age and age-related changes govern consumer perception toward food both positively and negatively. 2.2.4. Consumer health condition and awareness In the modern era, consumers are increasingly cognizant of healthy eating (Requero et al., 2020), and consumers have a high perception and expectation of the salubrious eating and remedial effects of functional food and commercially formulated supplements (Ali and Rahut, 2019). These expectations clearly define why consumers, who have poor health status, gravitate toward commercial food options that claim health benefits and restoration (Moore et al., 2022). Obese consumers, for instance, showed positive attitudes toward healthy weight loss products, including nutraceuticals and supplements, abstaining from certain types of food (such as sugary beverages), or even fasting (Zhong et al., 2019; Carvalho-Ferreira et al., 2020). This could be because the olfactory function is negatively associated with body weight. According to Contreras-Rodriguez et al. (2020), obese patients have a positive perception and willingness to pay for functional food, and an examination of different levels of the brain using functional magnetic resonance imaging showed hyperactivation in the ventral posterior cingulate cortex and right angular gyrus, indicating internal goal-driven willingness. Contrary to the above observations, some studies revealed that obese\/overweight participants favored highly sweetened nectar\/juice, sugary and alcoholic beverages, high-calorie diets, and convenience foods, which could be a coping mechanism for diminished responses to non-food rewards (Zhang et al., 2022). Several studies investigate how consumers’ health conditions govern consumer perception toward food and its processing. These studies include: how consumers with diabetes perceive novel staple foods; consumers with metabolic syndrome on sweet taste perception of food (Fernández-Carrión and Sorlí, 2021); and hypertensive consumer perception of processed food consumption (Espejo et al., 2019). Patients with cancer expressed a greater demand for nutritional support, but the preference (especially for high-fat, high-protein, sweet, and savory products) decreased during chemotherapy, and then coincidentally returned to baseline by 6 months (de Vries et al., 2018), which was due to the impact on taste and\/or olfactory stimuli (Nolden and Hwang, 2019). Both non-communicable and communicable diseases, either acute or chronic, cause changes in consumer perception. Since psychology and health are related, it is logical that a wide range of patients experience some level of mental stress (Bahall, 2019) and are abstemious toward food. Thus, to overcome this, consumers perceive food that is organic, natural, fermented, unprocessed, low in fat, sodium, and carbohydrates, as well as esthetically pleasing and sensory palatable, which will aid in their recovery (Plasek et al., 2020). 3. Consumer acceptance and impact on the food industry Throughout the decade, it has been evident that consumer acceptance had a great impact on the food industry (Siegrist and Hartmann, 2020a). In many studies, researchers analyzed these influences using examples of various products, ingredients, innovation, and renovations with consumer behavior and purchase intention (Oliveira et al., 2020). Consumer acceptance is influenced by three factors. These factors include consumer characteristics, the purchasing situation, and product characteristics (Siddiqui et al., 2022). 3.1. Consumer characteristics Several studies have been conducted to analyze and identify the key variables affecting the purchase decision for health and wellness food products. There are four sets of independent variables likely to influence the level of health and wellness food purchase, namely, socio-demographic variables, product attributes, market attributes, and psychological factors (Kapoor and Munjal, 2019). For the impact of demographics on consumer behavior, the factors influencing are identified to be that gender, age, education, occupation, and income. Food preferences are associated with occupation and income. On the other hand, education and occupation were associated with purchasing and ordering fast food. Moreover, frequency and budget were revealed to be associated with age and occupation. The reason to buy was affected by product and place while brand preference was affected by promotion (Khaipetch, 2017). When a household purchases food, the primary consideration is largely focused on the impact of food on the health and wellness of the family, making information and awareness about quality, healthy and safe food products a key factor. Additionally, social prestige, based on socio-demographic hierarchy, is one of the key psychological variables that influence the decision (Ali et al., 2021). Food producers and marketers need to understand consumer characteristics during the process of food product development and marketing communications in order to meet consumers’ expectations and improve their acceptance. 3.2. Purchasing situation Purchasing situations are one of the factors that can affect consumer selection of food products (Nguyen et al., 2019). In recent decades, new shopping formats have emerged, and these formats have had a different impact on consumer behavior and perception as the consumers are expecting a new variety of shopping experiences (Tao et al., 2022). The shopping experience is influenced by numerous factors that are subjective to the product. Ali et al. (2021) determined market offers, shopping experiences, brand product availability, and market services as the major components of the shopping experience. The shopping experience can be diversified through assistance shopping services, display, diverse assortment of products, and market services, including store operation hours and home delivery service. During the COVID-19 pandemic, proper sanatory measures and cold chain of food systems have an impact on consumer acceptance and purchase decisions (Udimal et al., 2022). Besides this, product quality and price becomes the determining factor for the purchase of healthy food (Suharso, 2020). The factors and results from various studies have various findings because their concerns and rationale varied from each other. However, there were most common factors that have the same impact. The preferences of consumers were influenced by price, quality, variety, packaging, and non-seasonal availability. Cleanliness, convenience, additional services, attraction for children, amenities, and affordability were the major dependent factors of the preference factors of a consumer for their marketplace. For the products like fruits and vegetables with a perishable nature, the influence factor was freshness and cleanliness, therefore, the purchasing behavior changes more frequently (Ali et al., 2021). These results indicate that market attributes have a significant impact on consumer acceptance. 3.3. Product characteristics There are numerous product attributes that determines the consumers’ buying decision. Lancaster’s principle provides insights on consumer acceptance and insights to make a purchase decision based on the product’s characteristics (Limpo et al., 2018). The impression of a product by the consumer can be classified by their intrinsic and extrinsic cues. Intrinsic sources are the physical part of the product that can be assessed before consumption such as appearance, size, and sensory properties (Meiselman et al., 2022). The extrinsic cues of the product characteristics are the information displayed on the product such as brand name, and packaging (Meiselman et al., 2022). Whereas, extrinsic cues were least relevant on sojourners, instead, they were influenced by the nutrition and environmental impact aspects of the product. The rise in sojourner at current situation can add complexity to the overall views on consumerism. Tirelli and Martinez-Ruiz (2014) found that sojourners’ food choice were greatly influenced by the food attributes, such as nutritional, price, convenience, and environmental impact. The remaining indicators include nutritional content, hygiene, certification, and natural ingredients. Food labeling was the major factor for the purchase decision because of the appropriateness of food products for various reasons including a vegan diet, religious reasons and avoiding the risk of infectious diseases, and originality of food (Bandara et al., 2016). Moreover, expiration dates, nutrition factors, and legal requirements are also important. On the contrary, consumers’ major reasons to neglect food labels were based their brand loyalty, their lifestyles, and the complicated format of food labeling as well (Bandara et al., 2016). The findings suggest that product and shelf display strategies in the store can focus on attracting attention. According to the new regulations of the United States Food and Drug Administration (2022), the consumer perception of food product also affected by legal policy implications such as local FDA. From all the findings, product characteristics including brand name, ingredients, packaging, display strategies, label, and regulatory policies have an impact on consumer acceptance of food products. 4. Innovative food and consumer approach Globally, various innovative food products are formulated and produced with advanced concepts and modern processing technologies, intended to attract consumers. Some modern and innovative processing technologies (such as upcycling, lab-procured products, and 3D printing), preservation methods (including irradiation, modified atmosphere, high-pressure processing, and bio-preservation), and packaging techniques (such as smart packaging, edible packaging, and eco-friendly packaging) are employed to develop innovative food products (Bhatt et al., 2020; Martins et al., 2022; Yan et al., 2022). Exploration of novel food sources and their incorporation as ingredients is ongoing to feed the increasing population. Examples of novel protein sources available nowadays include alternative proteins like insect protein, yeast protein, and plant protein. In the food innovation sector, it has been reported that significant adaptive challenges may be faced, depending on consumer perceptions that are predominantly influenced by diverse predetermined factors mentioned earlier (Onwezen et al., 2021; Figure 6). FIGURE 6 Figure 6. Consumer approach toward an integrated and innovative food system. Insects as a protein source are well-known, but consumers in the Western world are wary of eating insects. However, Gmuer et al. (2016) have shown that consumers were more comfortable with processed insects being used as ingredients rather than consuming whole insect products. Critical appraisal of studies on innovative food and consumer perception indicates that younger individuals are inclined toward novel and innovative food products, such as cultured meat (Pakseresht et al., 2022), and alternative proteins (plants, fungi, algae, and insect-based protein; Onwezen et al., 2021), while older adults and the elderly are more favorable toward animal meat, poultry, and fish (Pakseresht et al., 2022). Considering ethics and environmental perspectives, consumers are willing to pay a surcharge for meat substitutes including plant-based, fungi-based, algae-based, and even insect-based protein, but not necessarily cultured meat. Thus, researchers concluded that consumer acceptance of these products was influenced by the availability of alternative options and product characteristics, such as cost and sensory attributes. Additionally, religion, demography, phobias, health concerns, and attitude have mixed effects. Factors like lack of awareness, perceived naturalness, and perception of risk related to food are behind consumers’ acceptance or rejection of cultured\/lab-procured meat (Siegrist and Hartmann, 2020b). Food with health information and benefits could enhance consumers’ sensory perception and boost acceptance. Although upcycled food is a great innovation of the era, consumer perception of upcycled food remains limited, particularly across food categories (Bhatt et al., 2020). In response to the increasing demand for food and food insecurity, several food companies are now producing upcycled foods using food waste and the valorization of leftover food. According to Yilmaz and Kahveci (2022), products such as plant-based, upcycled cocoa beverages, supplements from sea fish by-products, cereal bars, and biscuits, have been studied and consumers have reported a positive attitude toward these upcycled products. Additionally, consumers are drawn to such products if they are of high quality, protect the environment, and reduce food waste. Compared to conventional foods, consumers are willing to buy upcycled foods but expect to pay less for them (McCarthy et al., 2020). Therefore, the nature of the added component, manufacturer, food neophobia, communication, product specificity, and target group all play a role in influencing consumers’ attitudes toward products containing unconventional ingredients (Yilmaz and Kahveci, 2022). Consumer adaptation depends on both the technology itself and the individual’s experience and knowledge. Consumer empowerment, desired level of personalization, the state of development of 3D printed food, and consumer acceptance all go hand in hand (Caulier et al., 2020). Applied information strategies could convince even those consumers with food neophobia by emphasizing health and fun aspects (Feng et al., 2022). Similarly, consumers are very positive toward innovative edible packaging, as it is eco-sustainable. Information displayed on packaging influences consumer expectations and recyclability, beyond the fundamental role of protecting and preserving food products (Yan et al., 2022). Hence, most consumers are optimistic about innovative food products and willing to try them. As per the need of a country, laws and legislations are in effect to steer consumer choices toward heathy, safe, and sustainable food. However, in the case of neophobia regarding novel foods, even though they are deemed as safe, healthy, and sustainable, people cannot be compelled to choose them. Novel foods must earn trust, but before that, consumers must internalize their impact on sustainability and feel the need to adopt green consumerism. Therefore, it is essential to build a positive attitude and create consumer demand by educating them about the impact of novel foods on the environment, resources, community, culture, and economy (Sánchez-Bravo et al., 2020). Low education levels indicate less awareness, which could be magnified by low-income structures and old age (Clark et al., 2019). Educating consumers about the nutritional relevancy of food can enhance their understanding of its complex relation with disease (Das and Chakraborty, 2014). A similar phenomenon can be observed with novel foods (Metcalf et al., 2021) and food technologies (Chen et al., 2013). Therefore, designing age-specific programs to promote and raise awareness and restructure social influence toward pro-environmental behaviors could help counter neophobia toward novel foods. However, most importantly, novel foods must be affordable for the consumer of all income bracket. 5. Conclusion and future perspective Overall, several factors influence consumer perceptions and attitudes toward food. Therefore, increasing consumer acceptability and adaptation to specific food remains a challenge for food industrialists and scientists. Multifaceted sensory attributes are the driving factors behind food perception. Religion, on the other hand, has been observed to influence consumer perception, with devout individuals making distinct choices. One prospective dimension for future research is the impact of different religions and ethnic groups across countries on consumer perception regarding the acceptance of novel and innovative foods. We discovered that a lack of knowledge and information about new products was a major reason for people’s dislike of certain foods. Food producers must be able to define and implement an integrated approach to convey the intended information about the product and the technologies employed. Informed individuals from high income regions tend to gravitate toward novel eco-friendly foods, while those deprived of technology from low- and middle-income countries may not be inclined toward novel and diverse foods. Most studies on consumer perception toward novel and innovative foods have been conducted prior to the availability of the products on the market and are mainly limited to high income countries, especially in Europe and North America, where the food system is well-established, and individuals are literate. There is still a lack of such studies in the low- and middle-income countries of Africa, Asia, and South America. Lastly, research on innovative food has made significant progress in recent years, particularly in developed countries is linked to the search for sustainable sources and concerns over animal welfare. Extensive studies are needed to evaluate consumers’ perceptions toward novel foods and food systems, including innovative packaging, advanced preservation, modern processing, and novel food ingredients. Author contributions SR, PW, and PK were involved in data collection and writing the original draft. NN conceptualized the paper and supervise, writing—review, and editing of the draft. SB, RP, MN-K, and NM were involved in writing—review and editing the draft. All authors contributed to the article and approved the submitted version. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References Ali, T., Alam, A., and Ali, J. (2021). Factors affecting consumers’ purchase behavior for health and wellness food products in an emerging market. Glob. Bus. Rev. 22, 151–168. doi: 10.1177\/0972150918795368 CrossRef Full Text | Google Scholar Ali, A., and Rahut, D. B. (2019). Healthy foods as proxy for functional foods: consumers’ awareness, perception, and demand for natural functional foods in Pakistan. Int. J. Food Sci. 2019, 1–12. doi: 10.1155\/2019\/6390650 PubMed Abstract | CrossRef Full Text | Google Scholar Ambikapathi, R., Schneider, K. R., Davis, B., Herrero, M., Winters, P., and Fanzo, J. C. (2022). Global food systems transitions have enabled affordable diets but had less favourable outcomes for nutrition, environmental health, inclusion and equity. Nat. Food 3, 764–779. doi: 10.1038\/s43016-022-00588-7 PubMed Abstract | CrossRef Full Text | Google Scholar Arli, D., Gupta, N., Sardana, D., and Sharma, P. (2022). Demystifying the evaluation of brands endorsed by religious leaders in the emerging markets. Int. Market. Rev. 40, 155–175. doi: 10.1108\/IMR-08-2021-0258 CrossRef Full Text | Google Scholar Aschemann-Witzel, J., Asioli, D., Banovic, M., Perito, M. A., and Peschel, A. O. (2022). Communicating upcycled foods: frugality framing supports acceptance of sustainable product innovations. Food Qual. Prefer. 100:104596. doi: 10.1016\/j.foodqual.2022.104596 CrossRef Full Text | Google Scholar Asioli, D., Aschemann-Witzel, J., Caputo, V., Vecchio, R., Annunziata, A., Næs, T., et al. (2017). Making sense of the “clean label” trends: a review of consumer food choice behavior and discussion of industry implications. Food Res. Int. 99, 58–71. doi: 10.1016\/j.foodres.2017.07.022 PubMed Abstract | CrossRef Full Text | Google Scholar Bahall, M. (2019). Prevalence and associations of depression among patients with cardiac diseases in a public health institute in Trinidad and Tobago. BMC Psychiatry 19:4. doi: 10.1186\/s12888-018-1977-3 PubMed Abstract | CrossRef Full Text | Google Scholar Bandara, B. E. S., De Silva, D. A. M., Maduwanthi, B. C. H., and Warunasinghe, W. A. A. I. (2016). Impact of food labeling information on consumer purchasing decision: with special reference to Faculty of Agricultural Sciences. Proc. Food Sci. 6, 309–313. doi: 10.1016\/j.profoo.2016.02.061 CrossRef Full Text | Google Scholar Barragán, R., Coltell, O., Portolés, O., Asensio, E. M., Sorlí, J. V., Ortega-Azorín, C., et al. (2018). Bitter, sweet, salty, sour and umami taste perception decreases with age: sex-specific analysis, modulation by genetic variants and taste-preference associations in 18 to 80 year-old subjects. Nutrients 10:1539. doi: 10.3390\/nu10101539 PubMed Abstract | CrossRef Full Text | Google Scholar Bartkiene, E., Steibliene, V., Adomaitiene, V., Juodeikiene, G., Cernauskas, D., Lele, V., et al. (2019). Factors affecting consumer food preferences: food taste and depression-based evoked emotional expressions with the use of face Reading technology. BioMed. Res. Int. 2019, 1–10. doi: 10.1155\/2019\/2097415 PubMed Abstract | CrossRef Full Text | Google Scholar Bryant, C. J. (2019). We Can’t keep Meating like this: attitudes towards vegetarian and vegan diets in the United Kingdom. Sustain. For. 11:6844. doi: 10.3390\/su11236844 CrossRef Full Text | Google Scholar Caputo, V. (2020). Does information on food safety affect consumers' acceptance of new food technologies? The case of irradiated beef in South Korea under a new labelling system and across different information regimes. Aust. J. Agric. Resour. Econ. 64, 1003–1033. doi: 10.1111\/1467-8489.12393 CrossRef Full Text | Google Scholar Carvalho-Ferreira, J. P. D., da Cunha, D. T., Finlayson, G., Caldas, G., Jamar, G., Bandoni, D. H., et al. (2020). Differential impact of consuming foods perceived to be high or low in fat on subsequent food reward. Food Qual. Prefer. 85:103977. doi: 10.1016\/j.foodqual.2020.103977 CrossRef Full Text | Google Scholar Caulier, S., Doets, E., and Noort, M. (2020). An exploratory consumer study of 3D printed food perception in a real-life military setting. Food Qual. Prefer. 86:104001. doi: 10.1016\/j.foodqual.2020.104001 CrossRef Full Text | Google Scholar Chaaban, N., and Andersen, B. V. (2021). Sensory specific desires. The role of sensory taste exposure in desire for food with a similar or different taste profile. Foods 10:3005. doi: 10.3390\/foods10123005 PubMed Abstract | CrossRef Full Text | Google Scholar Chen, Q., Anders, S., and An, H. (2013). Measuring consumer resistance to a new food technology: a choice experiment in meat packaging. Food Qual. Prefer. 28, 419–428. doi: 10.1016\/j.foodqual.2012.10.008 CrossRef Full Text | Google Scholar Clark, R. A., Haytko, D. L., Hermans, C. M., and Simmers, C. S. (2019). Social influence on green consumerism: country and gender comparisons between China and the United States. J. Int. Consum. Mark. 31, 177–190. doi: 10.1080\/08961530.2018.1527740 CrossRef Full Text | Google Scholar Coderoni, S., and Perito, M. A. (2021). Approaches for reducing wastes in the agricultural sector. An analysis of millennials’ willingness to buy food with upcycled ingredients. Waste Manag. 126, 283–290. doi: 10.1016\/j.wasman.2021.03.018 PubMed Abstract | CrossRef Full Text | Google Scholar Contreras-Rodriguez, O., Mata, F., Verdejo-Román, J., Ramírez-Bernabé, R., Moreno, D., Vilar-Lopez, R., et al. (2020). Neural-based valuation of functional foods among lean and obese individuals. Nutr. Res. 78, 27–35. doi: 10.1016\/j.nutres.2020.03.006 CrossRef Full Text | Google Scholar Corte, V. D., Gaudio, G. D., and Sepe, F. (2018). Ethical food and the kosher certification: a literature review. Br. Food J. 120, 2270–2288. doi: 10.1108\/BFJ-09-2017-0538 CrossRef Full Text | Google Scholar Crofton, E. C., Botinestean, C., Fenelon, M., and Gallagher, E. (2019). Potential applications for virtual and augmented reality technologies in sensory science. Innovative Food Sci. Emerg. Technol. 56:102178. doi: 10.1016\/j.ifset.2019.102178 CrossRef Full Text | Google Scholar de Vries, Y. C., Winkels, R. M., van den Berg, M. M. G. A., de Graaf, C., Kelfkens, C. S., de Kruif, J. T. C. M., et al. (2018). Altered food preferences and chemosensory perception during chemotherapy in breast cancer patients: a longitudinal comparison with healthy controls. Food Qual. Prefer. 63, 135–143. doi: 10.1016\/j.foodqual.2017.09.003 CrossRef Full Text | Google Scholar Department of Health (2014). \"Regulations relating to the labelling and advertising of food: Amendement (R429)(No. 37695)\" Google Scholar Espejo, M., Magabo, S., Rivera-Castro, A., Faiz, M., Ramirez, L., Robles, C., et al. (2019). Qualitative study of knowledge, perception, and behavior related to hypertension and cardiovascular disease risk reduction among hypertensive African-Americans in urban Inner City of south Bronx, New York. J. Racial Ethn. Health Disparities 6, 197–206. doi: 10.1007\/s40615-018-0514-x PubMed Abstract | CrossRef Full Text | Google Scholar European Union (2011). \"Regulation (EU) no 1169\/2011 of the European Parliament and of the council.\" (ed.) J.o.t.E. Union. Google Scholar Feng, X., Khemacheevakul, K., De León Siller, S., Wolodko, J., and Wismer, W. (2022). Effect of labelling and information on consumer perception of foods presented as 3D printed. Foods 11:809. doi: 10.3390\/foods11060809 PubMed Abstract | CrossRef Full Text | Google Scholar Fernández-Carrión, R., and Sorlí, J. V. (2021). Sweet taste preference: relationships with other tastes, liking for sugary foods and exploratory genome-wide association analysis in subjects with metabolic syndrome. Biomedicine 10:79. doi: 10.3390\/biomedicines10010079 PubMed Abstract | CrossRef Full Text | Google Scholar Filippo, S. (2022). Consumer preferences for the Mediterranean diet: results of an empirical analysis. J. Agri. Food Res. 10, 100371–102022. doi: 10.1016\/j.jafr.2022.100371 CrossRef Full Text | Google Scholar Food and Drug Administration (2022). Changes to the nutrition facts label [online]. Available at: https:\/\/www.fda.gov\/food\/food-labeling-nutrition\/changes-nutrition-facts-label Google Scholar Geueke, B., Groh, K., and Muncke, J. (2018). Food packaging in the circular economy: overview of chemical safety aspects for commonly used materials. J. Clean. Prod. 193, 491–505. doi: 10.1016\/j.jclepro.2018.05.005 CrossRef Full Text | Google Scholar Gmuer, A., Nuessli Guth, J., Hartmann, C., and Siegrist, M. (2016). Effects of the degree of processing of insect ingredients in snacks on expected emotional experiences and willingness to eat. Food Qual. Prefer. 54, 117–127. doi: 10.1016\/j.foodqual.2016.07.003 CrossRef Full Text | Google Scholar Gómez, M., Martín-Consuegra, D., and Molina, A. (2015). The importance of packaging in purchase and usage behaviour. Int. J. Consum. Stud. 39, 203–211. doi: 10.1111\/ijcs.12168 CrossRef Full Text | Google Scholar Grasso, S., Rondoni, A., Bari, R., Smith, R., and Mansilla, N. (2022). Effect of information on consumers’ sensory evaluation of beef, plant-based and hybrid beef burgers. Food Qual. Prefer. 96:104417. doi: 10.1016\/j.foodqual.2021.104417 CrossRef Full Text | Google Scholar Hazley, D., Stack, M., Walton, J., McNulty, B. A., and Kearney, J. M. (2022). Food neophobia across the life course: pooling data from five national cross-sectional surveys in Ireland. Appetite 171:105941. doi: 10.1016\/j.appet.2022.105941 PubMed Abstract | CrossRef Full Text | Google Scholar Heiman, A., Gordon, B., and Zilberman, D. (2019). Food beliefs and food supply chains: the impact of religion and religiosity in Israel. Food Policy 83, 363–369. doi: 10.1016\/j.foodpol.2017.07.007 CrossRef Full Text | Google Scholar Hernández, P. A., Galli, F., Prosperi, P., Šūmane, S., Duckett, D., and Almaas, H. E. (2021). Do small food businesses enable small farms to connect to regional food systems? Evidence from 9 European regions. Glob. Food Sec. 29:100505. doi: 10.1016\/j.gfs.2021.100505 CrossRef Full Text | Google Scholar Hielkema, M. H., and Lund, T. B. (2022). A “vegetarian curry stew” or just a “curry stew”? - the effect of neutral labeling of vegetarian dishes on food choice among meat-reducers and non-reducers. J. Environ. Psychol. 84:101877. doi: 10.1016\/j.jenvp.2022.101877 CrossRef Full Text | Google Scholar Jezewska-Zychowicz, M., and Plichta, M. (2021). Food Neophobia among adults: differences in dietary patterns, food choice motives, and food labels Reading in poles. Nutrients 13:1590. doi: 10.3390\/nu13051590 PubMed Abstract | CrossRef Full Text | Google Scholar Kapoor, D., and Munjal, A. (2019). Self-consciousness and emotions driving femvertising: a path analysis of women’s attitude towards femvertising, forwarding intention and purchase intention. J. Mark. Commun. 25, 137–157. doi: 10.1080\/13527266.2017.1338611 CrossRef Full Text | Google Scholar Khaipetch, J. (2017). Factors affecting consumer behaviour of fast food in Pathum Thani. Glob. Bus. Account. Fin. Rev. 1, 50–62. Google Scholar Koen, N., Wentzel-Viljoen, E., and Blaauw, R. (2018). Price rather than nutrition information the main influencer of consumer food purchasing behaviour in South Africa: a qualitative study. Int. J. Consum. Stud. 42, 409–418. doi: 10.1111\/ijcs.12434 CrossRef Full Text | Google Scholar Laureati, M., Spinelli, S., Monteleone, E., Dinnella, C., Prescott, J., Cattaneo, C., et al. (2018). Associations between food neophobia and responsiveness to “warning” chemosensory sensations in food products in a large population sample. Food Qual. Prefer. 68, 113–124. doi: 10.1016\/j.foodqual.2018.02.007 CrossRef Full Text | Google Scholar Lewis, C. A., and Jackson, M. C. (2014). “Chapter 11—understanding medical foods under FDA regulations” in Nutraceutical and Functional Food Regulations in the United States and Around the World. ed. D. Bagchi. 2nd ed (San Diego: Academic Press), 169–182. Google Scholar Limpo, L., Rahim, A., and Hamzah, H.M. (2018). Effect of Product Quality, Price, and Promotion to Purchase Decision. Int. J. Advanced Sci. Educ. Religion 1, 9–22. doi: 10.33648\/ijoaser.v1i1.2 CrossRef Full Text | Google Scholar Lin, P., Tsai, H., and Ho, T. (2020). Food safety gaps between consumers’ expectations and perceptions: development and verification of a gap-assessment tool. Int. J. Environ. Res. Public Health 17:6328. doi: 10.3390\/ijerph17176328 PubMed Abstract | CrossRef Full Text | Google Scholar Lindh, H., Olsson, A., and Williams, H. (2016). Consumer perceptions of food packaging: contributing to or counteracting environmentally sustainable development? Packag. Technol. Sci. 29, 3–23. doi: 10.1002\/pts.2184 CrossRef Full Text | Google Scholar Liu, J., Cattaneo, C., Papavasileiou, M., Methven, L., and Bredie, W. L. P. (2022). A review on oral tactile sensitivity: measurement techniques, influencing factors and its relation to food perception and preference. Food Qual. Prefer. 100:104624. doi: 10.1016\/j.foodqual.2022.104624 CrossRef Full Text | Google Scholar Maggioni, E., Cobden, R., Dmitrenko, D., Hornbæk, K., and Obrist, M. (2020). SMELL SPACE: mapping out the olfactory design Space for novel interactions. ACM Trans. Comput. Hum. Interact. 27, 1–26. doi: 10.1145\/3402449 CrossRef Full Text | Google Scholar Marcus, N., Klink-Lehmann, J., and Hartmann, M. (2022). Exploring factors determining German consumers’ intention to eat meat alternatives. Food Qual. Prefer. 100:104610. doi: 10.1016\/j.foodqual.2022.104610 CrossRef Full Text | Google Scholar Martins, I. B. A., de Souza, C. R., de Alcantara, M., Rosenthal, A., Ares, G., and Deliza, R. (2022). How are the sensory properties perceived by consumers? A case study with pressurized tropical mixed juice. Food Res. Int. 152:110940. doi: 10.1016\/j.foodres.2021.110940 PubMed Abstract | CrossRef Full Text | Google Scholar Massari, S., Principato, L., Antonelli, M., and Pratesi, C. A. (2022). Learning from and designing after pandemics. CEASE: a design thinking approach to maintaining food consumer behaviour and achieving zero waste. Socio Econ. Plan. Sci. 82:101143. doi: 10.1016\/j.seps.2021.101143 CrossRef Full Text | Google Scholar McCarthy, B., Kapetanaki, A. B., and Wang, P. (2020). Completing the food waste management loop: is there market potential for value-added surplus products (VASP)? J. Clean. Prod. 256:120435. doi: 10.1016\/j.jclepro.2020.120435 CrossRef Full Text | Google Scholar Meiselman, H. L., Jaeger, S. R., Carr, B. T., and Churchill, A. (2022). Approaching 100 years of sensory and consumer science: developments and ongoing issues. Food Qual. Prefer. 100:104614. doi: 10.1016\/j.foodqual.2022.104614 CrossRef Full Text | Google Scholar Melnyk, V., van Herpen, E., Jak, S., and van Trijp, H. C. M. (2019). The mechanisms of social norms’ influence on consumer decision making: a meta-analysis. Z. Psychol. 227, 4–17. doi: 10.1027\/2151-2604\/a000352 CrossRef Full Text | Google Scholar Metcalf, D. A., Wiener, K. K. K., and Saliba, A. (2021). Comparing early hemp food consumers to non-hemp food consumers to determine attributes of early adopters of a novel food using the food choice questionnaire (FCQ) and the food Neophobia scale (FNS). Future Foods 3:100031. doi: 10.1016\/j.fufo.2021.100031 CrossRef Full Text | Google Scholar Michael, L., and Claire, G. (2017). More Americans Now Say They’re Spiritual But Not Religious. Available at: https:\/\/policycommons.net\/artifacts\/617729\/more-americans-now-say-theyre-spiritual-but-not-religious\/ Google Scholar Musso, F., Colamatteo, A., Bravi, L., Pagnanelli, M. A., Murmura, F., and Sansone, M. (2022). Analysis of factors affecting the purchase of private label products by different age consumers. Br. Food J. 124, 619–636. doi: 10.1108\/BFJ-03-2022-0256 CrossRef Full Text | Google Scholar Ngugi, I. K., O’Sullivan, H., and Osman, H. (2020a). “Consumer attitudes in food and drink,” in Consumer behaviour in food and healthy lifestyles: a global perspective. CABI International, 103–112. Google Scholar Ngugi, I. K., O’Sullivan, H., and Osman, H. (2020b). “Culture and subcultures in food and drink,” in Consumer behaviour in food and healthy lifestyles: a global perspective 113–127. Google Scholar Nguyen, N., Nguyen, H. V., Nguyen, P. T., Tran, V. T., Nguyen, H. N., Nguyen, T. M. N., et al. (2019). Some key factors affecting Consumers' intentions to purchase functional foods: a case study of functional yogurts in Vietnam. Foods 9:24. doi: 10.3390\/foods9010024 PubMed Abstract | CrossRef Full Text | Google Scholar Niland, B., and Cash, B. D. (2018). Health benefits and adverse effects of a gluten-free diet in non-celiac disease patients. Gastroenterol. Hepatol. 14, 82–91. PubMed Abstract | Google Scholar Oliveira, P., Araújo, J., Kaperavicsuz, A., Silva, L., and Banderó, F. (2020). Consumer behavior of bread and its influence on supply chain management an innovative approach. Brazil. J. Operat. Product. Manag. 17:e20201053. doi: 10.14488\/BJOPM.2020.045 CrossRef Full Text | Google Scholar Otto, S., Strenger, M., Maier-Nöth, A., and Schmid, M. (2021). Food packaging and sustainability – consumer perception vs. correlated scientific facts: a review. J. Clean. Prod. 298:126733. doi: 10.1016\/j.jclepro.2021.126733 CrossRef Full Text | Google Scholar Prahalathan, S. V., Baird, D., Hendrie, G. A., Rebuli, M. A., and Cox, D. N. (2022). Sensory swap: modelling the impact of swapping discretionary choices for similar tasting core foods on the energy, nutrients and sensory properties of Australian diets. Appetite 169:105866. doi: 10.1016\/j.appet.2021.105866 PubMed Abstract | CrossRef Full Text | Google Scholar Regan, E., Feeney, E. L., Hutchings, S. C., O'Neill, G. J., and O'Riordan, E. D. (2021). Exploring how age, medication usage, and dentures effect the sensory perception and liking of oral nutritional supplements in older adults. Food Qual. Prefer. 92:104224. doi: 10.1016\/j.foodqual.2021.104224 CrossRef Full Text | Google Scholar Rodríguez-Bermúdez, R., Miranda, M., Orjales, I., Ginzo Villamayor, M., Al-Soufi, W., and Lopez-Alonso, M. (2020). Consumer perception of and attitudes towards organic food in Galicia (northern Spain). Int. J. Consum. Stud. 44, 206–219. doi: 10.1111\/ijcs.12557 CrossRef Full Text | Google Scholar Shao, A., and Li, H. (2021). How do utilitarian versus hedonic products influence choice preferences: mediating effect of social comparison. Psychol. Mark. 38, 1250–1261. doi: 10.1002\/mar.21520 CrossRef Full Text | Google Scholar Siddiqui, S. A., Zannou, O., Karim, I., Kasmiati, A., Awad, N. M. H., Gołaszewski, J., et al. (2022). Avoiding food Neophobia and increasing consumer acceptance of new food trends—a decade of research. Sustain. For. 14:10391. doi: 10.3390\/su141610391 CrossRef Full Text | Google Scholar Siegrist, M., and Hartmann, C. (2020b). Perceived naturalness, disgust, trust and food neophobia as predictors of cultured meat acceptance in ten countries. Appetite 155:104814. doi: 10.1016\/j.appet.2020.104814 PubMed Abstract | CrossRef Full Text | Google Scholar Spence, C., Reinoso Carvalho, F., Velasco, C., and Wang, Q.J. (2019). Extrinsic auditory contributions to food perception & consumer behaviour: an interdisciplinary review. Multisens Res. 32, 275–318. doi: 10.1163\/22134808-20191403 CrossRef Full Text | Google Scholar Suharso, A. A. P. (2020). The effect of products and prices on purchasing decisions of health food. Manag. Econ. J. 4, 175–184. doi: 10.18860\/mec-j.v4i2.9209 CrossRef Full Text | Google Scholar Szakos, D., Ózsvári, L., and Kasza, G. (2020). Perception of older adults about health-related functionality of foods compared with other age groups. Sustain. For. 12:2748. doi: 10.3390\/su12072748 CrossRef Full Text | Google Scholar Tao, H., Sun, X., Liu, X., Tian, J., and Zhang, D. (2022). The impact of consumer purchase behavior changes on the business model Design of Consumer Services Companies over the course of COVID-19. Front. Psychol. 13:818845. doi: 10.3389\/fpsyg.2022.818845 PubMed Abstract | CrossRef Full Text | Google Scholar Tirelli, C., and Martinez-Ruiz, M. P. (2014). Influences of product attributes on sojourners' food purchase decisions. Br. Food J. 116, 251–271. doi: 10.1108\/BFJ-01-2012-0019 CrossRef Full Text | Google Scholar Udimal, T. B., Peng, Z., Luo, M., and Liu, Y. (2022). The impact of COVID-19 on consumers' eating and purchasing habits of agricultural products in China: key determinants and policy implications. Bull. Nat. Res. Centre 46:7. doi: 10.1186\/s42269-021-00694-9 PubMed Abstract | CrossRef Full Text | Google Scholar van de Kamp, M. E., Seves, S. M., and Temme, E. H. M. (2018). Reducing GHG emissions while improving diet quality: exploring the potential of reduced meat, cheese and alcoholic and soft drinks consumption at specific moments during the day. BMC Public Health 18:264. doi: 10.1186\/s12889-018-5132-3 PubMed Abstract | CrossRef Full Text | Google Scholar van Eck, A., and Stieger, M. (2020). Oral processing behavior, sensory perception and intake of composite foods. Trends Food Sci. Technol. 106, 219–231. doi: 10.1016\/j.tifs.2020.10.008 CrossRef Full Text | Google Scholar Yan, M. R., Hsieh, S., and Ricacho, N. (2022). Innovative food packaging, food quality and safety, and consumer perspectives. PRO 10:747. doi: 10.3390\/pr10040747 CrossRef Full Text | Google Scholar Yilmaz, E., and Kahveci, D. (2022). Consumers’ purchase intention for upcycled foods: insights from Turkey. Future Foods 6:100172. doi: 10.1016\/j.fufo.2022.100172 CrossRef Full Text | Google Scholar Zhang, H., and Sablani, S. (2021). Biodegradable packaging reinforced with plant-based food waste and by-products. Curr. Opin. Food Sci. 42, 61–68. doi: 10.1016\/j.cofs.2021.05.003 CrossRef Full Text | Google Scholar","filter_flag":1}
{"title":"Unveiling The Mind-Blowing Retail Trends Of 2050: An Investigative Adventure Into The Future Of… - DataDrivenInvestor","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL21lZGl1bS5kYXRhZHJpdmVuaW52ZXN0b3IuY29tL3VudmVpbGluZy10aGUtbWluZC1ibG93aW5nLXJldGFpbC10cmVuZHMtb2YtMjA1MC1hbi1pbnZlc3RpZ2F0aXZlLWFkdmVudHVyZS1pbnRvLXRoZS1mdXR1cmUtb2YtOTk2MGFlMTJlMzI50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL21lZGl1bS5kYXRhZHJpdmVuaW52ZXN0b3IuY29tL3VudmVpbGluZy10aGUtbWluZC1ibG93aW5nLXJldGFpbC10cmVuZHMtb2YtMjA1MC1hbi1pbnZlc3RpZ2F0aXZlLWFkdmVudHVyZS1pbnRvLXRoZS1mdXR1cmUtb2YtOTk2MGFlMTJlMzI50gEA?oc=5","id":"CBMikQFodHRwczovL21lZGl1bS5kYXRhZHJpdmVuaW52ZXN0b3IuY29tL3VudmVpbGluZy10aGUtbWluZC1ibG93aW5nLXJldGFpbC10cmVuZHMtb2YtMjA1MC1hbi1pbnZlc3RpZ2F0aXZlLWFkdmVudHVyZS1pbnRvLXRoZS1mdXR1cmUtb2YtOTk2MGFlMTJlMzI50gEA","guidislink":false,"published":"Fri, 07 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=188, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL21lZGl1bS5kYXRhZHJpdmVuaW52ZXN0b3IuY29tL3VudmVpbGluZy10aGUtbWluZC1ibG93aW5nLXJldGFpbC10cmVuZHMtb2YtMjA1MC1hbi1pbnZlc3RpZ2F0aXZlLWFkdmVudHVyZS1pbnRvLXRoZS1mdXR1cmUtb2YtOTk2MGFlMTJlMzI50gEA?oc=5\" target=\"_blank\">Unveiling The Mind-Blowing Retail Trends Of 2050: An Investigative Adventure Into The Future Of…<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">DataDrivenInvestor<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Unveiling The Mind-Blowing Retail Trends Of 2050: An Investigative Adventure Into The Future Of… - DataDrivenInvestor","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL21lZGl1bS5kYXRhZHJpdmVuaW52ZXN0b3IuY29tL3VudmVpbGluZy10aGUtbWluZC1ibG93aW5nLXJldGFpbC10cmVuZHMtb2YtMjA1MC1hbi1pbnZlc3RpZ2F0aXZlLWFkdmVudHVyZS1pbnRvLXRoZS1mdXR1cmUtb2YtOTk2MGFlMTJlMzI50gEA?oc=5\" target=\"_blank\">Unveiling The Mind-Blowing Retail Trends Of 2050: An Investigative Adventure Into The Future Of…<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">DataDrivenInvestor<\/font>","source.href":"https:\/\/medium.datadriveninvestor.com","source.title":"DataDrivenInvestor","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Unveiling The Mind-Blowing Retail Trends Of 2050: An Investigative Adventure Into The Future Of Shopping Fahri Karakas · Follow Published in DataDrivenInvestor · 16 min read · Jul 7, 2023 -- Share Photo by Heidi Fin on Unsplash How will the world of retail and shopping evolve by 2050? I hired artificial intelligence (GPT4) to make predictions about the future of shopping and retailing. Get ready to be transported into a future like no other, where the boundaries of retail and shopping have been shattered, and…","filter_flag":1}
