{"title":"Microgravity Manufacturing Inches Closer to Reality | ASSEMBLY - Assembly Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85NzkzMi1taWNyb2dyYXZpdHktbWFudWZhY3R1cmluZy1pbmNoZXMtY2xvc2VyLXRvLXJlYWxpdHnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85NzkzMi1taWNyb2dyYXZpdHktbWFudWZhY3R1cmluZy1pbmNoZXMtY2xvc2VyLXRvLXJlYWxpdHnSAQA?oc=5","id":"CBMiXmh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85NzkzMi1taWNyb2dyYXZpdHktbWFudWZhY3R1cmluZy1pbmNoZXMtY2xvc2VyLXRvLXJlYWxpdHnSAQA","guidislink":false,"published":"Fri, 04 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=4, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=216, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85NzkzMi1taWNyb2dyYXZpdHktbWFudWZhY3R1cmluZy1pbmNoZXMtY2xvc2VyLXRvLXJlYWxpdHnSAQA?oc=5\" target=\"_blank\">Microgravity Manufacturing Inches Closer to Reality | ASSEMBLY<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Assembly Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Microgravity Manufacturing Inches Closer to Reality | ASSEMBLY - Assembly Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85NzkzMi1taWNyb2dyYXZpdHktbWFudWZhY3R1cmluZy1pbmNoZXMtY2xvc2VyLXRvLXJlYWxpdHnSAQA?oc=5\" target=\"_blank\">Microgravity Manufacturing Inches Closer to Reality | ASSEMBLY<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Assembly Magazine<\/font>","source.href":"https:\/\/www.assemblymag.com","source.title":"Assembly Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Manufacturing\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"First came offshoring. Then, reshoring and nearshoring. Someday soon, manufacturers may also be debating the merits of “above shoring” or “off-planet manufacturing.” Manufacturing in space has been talked about for decades. In fact, some of the first issues of ASSEMBLY magazine back in the late 1950s featured articles that discussed the topic. Today, the concept of microgravity manufacturing or in-space production is still a few years away, but it’s much closer to fact than fiction. Several start-ups, such as Redwire Space, Space Forge Ltd. and Varda Space Industries, hope to ramp up activity over the next two years. Space Forge is a company based in Wales that recently set up an office in the United States. It’s also in the process of building a state-of-the-art factory here that will assemble small, relaunchable satellites. The strategic move is part of the company’s plan to strengthen its manufacturing partnerships, capitalizing on growing U.S. interest in super materials and semiconductors. Many engineers are intrigued by the optimal production environment in outer space, which is characterized by zero gravity, extreme temperatures and vacuum conditions that can new yield materials that are purer and have fewer defects. “The appetite for in-space manufacturing of semiconductors in particular is strong and growing, fueled by commercial and defense initiatives such as the AUKUS Alliance,” says Joshua Western, CEO of Space Forge. “As we field more interest in our ability to produce super materials, production capabilities in one of the world’s largest semiconductor markets is a logical next step.” According to Western, “the next industrial revolution isn’t on Earth.” Space Forge is pioneering the concept of microgravity-manufacturing-as-a-service with a relaunchable platform dubbed ForgeStar. The satellite features soft-descent and high-precision landing capabilities. ForgeStar, which is approximately the size of a small refrigerator, will be deployed in orbit for up to six months. It will initially be used to produce super alloys and semiconductor substrates. “This patented technology is more protective of payload returns than traditional ablative capsules used by competitors,” claims Western. “Both ForgeStar vehicles and payloads for U.S. customers will be manufactured in [our] new facility.” Out-of-This-World Benefits Outer space provides an ideal environment for manufacturing certain types of products. In particular, zero-gravity holds big potential for producing next-generation alloys, biopharmaceuticals and semiconductors. “The near-vacuum of space allows perfectly mixed and perfectly distributed substrates without any contaminants,” explains Andrew Parlock, managing director of Space Forge US. “The purity of the environment is also advantageous, because there’s very low amounts of nitrogen and oxygen. “In addition, space offers the benefit of having optimal hot or cold temperatures,” notes Parlock, a former executive at Lockheed Martin and Northrop Grumman. “It’s possible to face the sun and get high temperatures, or turn away from the sun and get consistently cold temperatures. “We’ve already pushed the limits of on-planet manufacturing for certain things, such as alloys,” warns Parlock. “Microgravity production will enable us to create thousands of new super alloys. “Unique conditions allow us to access and combine a large number of elements that are not available or feasible on Earth,” says Parlock. “It is based on a factorial calculation, which means that for each new element we add, the number of possible alloys increases by the factorial of the total number of elements. Since space gives us access to many more elements than Earth, the number of new alloys we can create is exponentially higher.” Super alloys produced in space could be beneficial in many down-to-earth applications, such as increasing the strength of bolts used to assemble wind turbine blades. “The main limitation of wind turbine efficiency is the blade length, which is constrained by road transportation capacity,” explains Parlock. “The obvious solution is to divide the blades into sections and assemble them on-site. “However, this connection point, where the individual blades connect to form longer and longer blades, is a point of such high stress. Today’s materials cannot manage the stresses effectively, causing the blades to break or deform,” Parlock points out. “This is where super alloys could come in handy,” claims Parlock. “We can create alloys in space that are strong enough to withstand the stress at the connection point, allowing us to build longer and more efficient wind turbine blades.” Space Forge’s mission statement follows a simple mantra: launch, forge, return and repeat. The first step has recently become feasible, due to the advent of commercial launch providers such as Blue Origin, SpaceX and United Launch Alliance. “To achieve a true economy of scale, you have to be able to reuse your platform at a competitive price point,” says Parlock. “The current economics of small satellite fabrication, launch and return now make it feasible to do things that weren’t cost-effective in the past. The cost of launch has dropped dramatically, thanks to a group of space entrepreneurs such as Jeff Bezos and Elon Musk. “Initially, we’ll ride share aboard SpaceX rockets,” notes Parlock. “Low-earth orbit (93 to 1,200 miles high) currently offers the best bang for the buck. Benefits include cheap launch costs, great ride-share opportunities and relatively low levels of radiation.” Resuable Re-Entry System Space Forge’s first platform, dubbed ForgeStar 1A, will be in operation by early next year. However, the company plans to establish a commercially viable weekly service by the end of this decade. To achieve that goal, ForgeStar will be equipped with soft-descent, high-precision landing capabilities that will protect sensitive payloads from damage. Space Forge engineers developed a reusable re-entry system that will enable the low cost and reliable return of satellites to Earth. Pridwen, named for King Arthur’s mythical shield, features a heat shield that folds and unfolds using origami-inspired technology. “Although the cost of launching satellites into space has become lower through the use of reusability, all current commercial space return vehicles use ablative heat shields which require replacement after every flight,” says Parlock. “Pridwen uses a high-temperature alloy that is large enough to radiate the heat of re-entry away without burning the material, making it fully reusable,” adds Parlock. “This shield is much larger than the vehicle and folds to fit inside the launcher using a modified origami technique.” Space Forge engineers spent more than four years developing the system, with funding provided by the UK Space Agency and the European Space Agency. They recently conducted a successful series of trials using plasma wind tunnel testing of shield samples, high-altitude balloon drops, origami deployment tests and sea survival. Because many space-made products will be vulnerable to the shock forces experienced during re-entry and landing, the engineers also developed a water-based hover net called Fielder. The uncrewed vehicle maneuvers itself underneath a re-entry vehicle to soften the landing and enable quick return to a port. “We want to be an advanced materials company that uses in-space manufacturing to its advantage,” says Parlock. “Initially, we’ll be producing crystalline structures that can be used to produce semiconductor substrates. This could eventually lead to microgravity chip fabrication.” But, before that long-time dream of science fiction writers becomes a reality, there are several big challenges that need to be addressed. One is a lack of standards related to in-space manufacturing. Another perplexing issue involves commercial air traffic control. “Each time a launch takes places today, there’s a massive amount of disruption to air traffic,” explains Parlock. “Now, we’re talking about bringing stuff back from space on a regular basis. There’s currently no regulation that pertains to returning payloads to Earth.” Watch the video to see how ForgeStar will work Learn about new products for aerospace assembly LaceLok Gains Popularity Among Harness Manufacturers Laser Wire Stripping Solutions from Schleuniger","filter_flag":1}
{"title":"Electrical Discharge Machines (EDM) Market Growth: Increasing Use of Complex Materials and Focus on Resource ... - GlobeNewswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi2QFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wOC8xMS8yNzIzMzY2LzI4MTI0L2VuL0VsZWN0cmljYWwtRGlzY2hhcmdlLU1hY2hpbmVzLUVETS1NYXJrZXQtR3Jvd3RoLUluY3JlYXNpbmctVXNlLW9mLUNvbXBsZXgtTWF0ZXJpYWxzLWFuZC1Gb2N1cy1vbi1SZXNvdXJjZS1FZmZpY2llbnQtUHJvY2Vzc2VzLURyaXZlLURlbWFuZC5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi2QFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wOC8xMS8yNzIzMzY2LzI4MTI0L2VuL0VsZWN0cmljYWwtRGlzY2hhcmdlLU1hY2hpbmVzLUVETS1NYXJrZXQtR3Jvd3RoLUluY3JlYXNpbmctVXNlLW9mLUNvbXBsZXgtTWF0ZXJpYWxzLWFuZC1Gb2N1cy1vbi1SZXNvdXJjZS1FZmZpY2llbnQtUHJvY2Vzc2VzLURyaXZlLURlbWFuZC5odG1s0gEA?oc=5","id":"CBMi2QFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wOC8xMS8yNzIzMzY2LzI4MTI0L2VuL0VsZWN0cmljYWwtRGlzY2hhcmdlLU1hY2hpbmVzLUVETS1NYXJrZXQtR3Jvd3RoLUluY3JlYXNpbmctVXNlLW9mLUNvbXBsZXgtTWF0ZXJpYWxzLWFuZC1Gb2N1cy1vbi1SZXNvdXJjZS1FZmZpY2llbnQtUHJvY2Vzc2VzLURyaXZlLURlbWFuZC5odG1s0gEA","guidislink":false,"published":"Fri, 11 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=223, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi2QFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wOC8xMS8yNzIzMzY2LzI4MTI0L2VuL0VsZWN0cmljYWwtRGlzY2hhcmdlLU1hY2hpbmVzLUVETS1NYXJrZXQtR3Jvd3RoLUluY3JlYXNpbmctVXNlLW9mLUNvbXBsZXgtTWF0ZXJpYWxzLWFuZC1Gb2N1cy1vbi1SZXNvdXJjZS1FZmZpY2llbnQtUHJvY2Vzc2VzLURyaXZlLURlbWFuZC5odG1s0gEA?oc=5\" target=\"_blank\">Electrical Discharge Machines (EDM) Market Growth: Increasing Use of Complex Materials and Focus on Resource ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Electrical Discharge Machines (EDM) Market Growth: Increasing Use of Complex Materials and Focus on Resource ... - GlobeNewswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi2QFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wOC8xMS8yNzIzMzY2LzI4MTI0L2VuL0VsZWN0cmljYWwtRGlzY2hhcmdlLU1hY2hpbmVzLUVETS1NYXJrZXQtR3Jvd3RoLUluY3JlYXNpbmctVXNlLW9mLUNvbXBsZXgtTWF0ZXJpYWxzLWFuZC1Gb2N1cy1vbi1SZXNvdXJjZS1FZmZpY2llbnQtUHJvY2Vzc2VzLURyaXZlLURlbWFuZC5odG1s0gEA?oc=5\" target=\"_blank\">Electrical Discharge Machines (EDM) Market Growth: Increasing Use of Complex Materials and Focus on Resource ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","source.href":"https:\/\/www.globenewswire.com","source.title":"GlobeNewswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Manufacturing\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Dublin, Aug. 11, 2023 (GLOBE NEWSWIRE) -- The \"Electrical Discharge Machines (EDM) - Global Strategic Business Report\" report has been added to ResearchAndMarkets.com's offering. The global market for Electrical Discharge Machines (EDM) estimated at US$6.2 Billion in the year 2022, is projected to reach a revised size of US$9.4 Billion by 2030, growing at a CAGR of 5.5% over the analysis period 2022-2030. Wire Cutting EDM, one of the segments analyzed in the report, is projected to record 5.9% CAGR and reach US$5.7 Billion by the end of the analysis period. Taking into account the ongoing post pandemic recovery, growth in the Small Hole EDM segment is readjusted to a revised 4.9% CAGR for the next 8-year period. The Electrical Discharge Machines (EDM) market in the U.S. is estimated at US$1.7 Billion in the year 2022. China, the world's second largest economy, is forecast to reach a projected market size of US$2.1 Billion by the year 2030 trailing a CAGR of 9.1% over the analysis period 2022 to 2030. Among the other noteworthy geographic markets are Japan and Canada, each forecast to grow at 1.9% and 5.9% respectively over the 2022-2030 period. Within Europe, Germany is forecast to grow at approximately 3% CAGR. Market Trends & Drivers The global Electrical Discharge Machines (EDM) market is poised for growth with several key trends and drivers shaping the industry. The recovery in Global Manufacturing PMI is encouraging assembly plants to invest in manufacturing equipment, especially with improving plant capacity utilization setting the stage for new equipment purchases. The advancements in Micro & Nano EDM are opening up opportunities in microfabrication applications, while the increasing use of complex materials is driving demand for EDM machines. Manufacturers' focus on resource-efficient processes is boosting preference for EDM technology. The global shortage of skilled labor is spurring the adoption of automated CNC EDM systems for increased productivity. Post-recession, market opportunities are shifting towards emerging countries. The stable medical device manufacturing sector is a positive indicator for market growth, with technology refinements in Wire EDM doubling productivity in this field. Aerospace production and steady automobile production are also driving demand for CNC EDM in their respective industries. Continuous technology improvements, high-end EDM technology demand, and the integration of advanced features like automatic wire threading, MTConnect communications protocol, in-process inspection systems, vision systems, and touchscreen controls are enhancing the EDM market's growth prospects. Research trends in EDM include electrode materials, rapid electrode production, automation, green manufacturing, and focus on micro and nano EDM. However, the rising popularity of ultrafast lasers poses a potential threat to the EDM market, while high-speed milling is also cannibalizing EDM demand in the mold & die industry. Overall, the EDM market remains dynamic and responsive to advancements in technology and industry demands. Report Scope The global Electrical Discharge Machines (EDM) market is analyzed comprehensively in terms of annual sales in US$ million from 2014 to 2030. The report includes tables which provide insights into recent past, current, and future trends for EDM in various geographic regions, including the USA, Canada, Japan, China, Europe, Asia-Pacific, Latin America, Middle East, and Africa. Additionally, specific subtypes and industries within the EDM market are examined, such as Wire Cutting EDM, Small Hole EDM, Die Sinking EDM, Automotive, Manufacturing, Aerospace & Defense, Healthcare, and Other End-Uses. These analyses highlight the market's growth potential, historical performance, and anticipated trends, emphasizing regional variations and key industry segments. Key Attributes: Report Attribute Details No. of Pages 188 Forecast Period 2022 - 2030 Estimated Market Value (USD) in 2022 $6.2 Billion Forecasted Market Value (USD) by 2030 $9.4 Billion Compound Annual Growth Rate 5.3% Regions Covered Global Key Topics Covered: 1. MARKET OVERVIEW World Market Trajectories Metal Shaping: A Key Process in Manufacturing Engineering Recent Market Activity Manufacturing Industry: The Sole Determinant of Demand for EDM Recession Deeply Impacts the Manufacturing Growth in Developed Economies Why the Recession Shock Impacted the EDM Market? A Reinvented Manufacturing Industry Promising GDP Growth to Usher New Era Challenges Facing Global Economy Factors Favoring Economic Growth Global Market Outlook Electrical Discharge Machines (EDM) - Global Key Competitors Percentage Market Share in 2022 (E) Competitive Market Presence - Strong\/Active\/Niche\/Trivial for Players Worldwide in 2022 (E) 2. FOCUS ON SELECT PLAYERS AAEDM Corp. AccuteX Technologies Co., Ltd. Beaumont Machine CHMER EDM Excetek Technologies Co., Ltd. GF Machining Solutions Management SA Kent Industrial USA, Inc. KNUTH Machine Tools Makino Milling Machine Co. Ltd. MC Machinery Systems, Inc. ONA Electroerosion S.A. Sodick, Inc. 3. MARKET TRENDS & DRIVERS Recovery in Global Manufacturing PMI to Encourage Spending on Manufacturing Equipment by Assembly Plants Improving Plant Capacity Utilization Sets Ground for New Equipment Purchases Developments in Micro & Nano EDM Spur Opportunities in Microfabrication Applications Increasing Use of Complex Materials Drives Demand for EDM Growing Focus on Resource Efficient Manufacturing Processes Drives Preference for EDM Global Shortage of Skilled Labor Spurs Demand for Automated CNC EDM Market Opportunities Rapidly Shift Towards Emerging Countries, Post-Recession A STable Medical Device Manufacturing Sector Bodes Well for Market Growth Technology Refinements in Wire EDM to Double Productivity in Medical Device Manufacturing Aerospace Production to Benefit Demand for EDM Steady Automobile Production Drives Demand for CNC EDM in Automotive Machining Continuous Technology Improvements to Spur Growth in the EDM Market Demand for High-End EDM Technology Spur Advancements in EDM Latest Technological Advancements in EDM Automatic Wire Threading Capabilities in One Single Machine to Minimize Accuracy Errors Integration of MTConnect Communications Protocol for Greater Accuracy and Repeatability In-Process Inspection Systems for Higher Accuracy and Efficiency Integration of Vision Systems Enhance Finished Product Quality Advanced Touchscreen Controls Automation Leads to Precise Predictability and Remarkable Repeatability Research Trends in EDM Research on Electrode Materials and Rapid Electrode Production Focus on Automation Spotlight on Green Manufacturing Research on Dry EDM Focus on Micro and Nano EDM Growing Popularity of Ultrafast Lasers: A Major Threat to the Growth of EDM High Speed Milling Cannibalizes Demand for EDM in the Mold & Die Industry 4. GLOBAL MARKET PERSPECTIVE For more information about this report visit https:\/\/www.researchandmarkets.com\/r\/zcya9x About ResearchAndMarkets.com ResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends. Attachment","filter_flag":1}
{"title":"The Toyota Production System: A Fresh Look - Assembly Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85Nzk4MS10aGUtdG95b3RhLXByb2R1Y3Rpb24tc3lzdGVtLWEtZnJlc2gtbG9va9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85Nzk4MS10aGUtdG95b3RhLXByb2R1Y3Rpb24tc3lzdGVtLWEtZnJlc2gtbG9va9IBAA?oc=5","id":"CBMiVGh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85Nzk4MS10aGUtdG95b3RhLXByb2R1Y3Rpb24tc3lzdGVtLWEtZnJlc2gtbG9va9IBAA","guidislink":false,"published":"Fri, 25 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=237, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85Nzk4MS10aGUtdG95b3RhLXByb2R1Y3Rpb24tc3lzdGVtLWEtZnJlc2gtbG9va9IBAA?oc=5\" target=\"_blank\">The Toyota Production System: A Fresh Look<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Assembly Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Toyota Production System: A Fresh Look - Assembly Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85Nzk4MS10aGUtdG95b3RhLXByb2R1Y3Rpb24tc3lzdGVtLWEtZnJlc2gtbG9va9IBAA?oc=5\" target=\"_blank\">The Toyota Production System: A Fresh Look<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Assembly Magazine<\/font>","source.href":"https:\/\/www.assemblymag.com","source.title":"Assembly Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Manufacturing\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"The Toyota Production System (TPS) revolutionized manufacturing worldwide. Today, its application goes beyond manufacturing, impacting transactional processes from healthcare services to software design. The TPS is, in fact, a multidisciplinary science that can be taught and applied more widely—not just to business haphazardly, but systematically to the broader aspects of our economies. I would argue that it offers solutions to the pervasive financial, socioeconomic and environmental contradictions in today’s society. Unfortunately, its technical and managerial innovations are inadequately understood and applied. Many leaders do not clearly grasp the full scope of benefits that TPS offers. Instead, they choose elements of it and apply them with limited financial, social and economic effects. By 1938, Toyota “inversed” industrial thinking amid the mass production system boom. It was decades ahead of the need to create a production system that is better adapted to a diversified economy of variety than a uniform economy of scale. And, it remains relevant today. Before the COVID-19 pandemic and the resulting parts shortages, Toyota had the foresight to safeguard against shortages of vehicle computer chips. Doing so is much easier and less expensive when manufacturers eliminate having to supply from inventory. To make a simple analogy, when you are not used to eating sugar, a little of it goes a long way. In 1998, Fujio Cho, then president of Toyota, announced the North American development of the new Toyota Sequoia SUV to compete against the best-selling Ford Explorer. Sales of SUVs were booming, gas was cheap, and global warming was not yet part of the public zeitgeist. Yet, one of Cho’s proudest moments was his championing of the launch of the first hybrid vehicle in Japan, the Toyota Prius. Today, the production of Toyota hybrid, electric, and hydrogen engines continues to align with the global need for clean energy. As Toyota continues to meet the business, social and economic needs of our changing world, it seems evident that something more is at work with TPS than just making cars. The TPS fuses the benefits of craftsmanship with the benefits of mass production, while eliminating the undesirable elements of both. Photo courtesy Toyota Motor Corp. Best of Both Worlds The TPS combines philosophical, technical and managerial principles that fuse the benefits of the old method of craftsmanship with the benefits of the newer mass production system, while leaving behind the undesirable elements of both. Craftsmanship is flexible but expensive. Until the late 1700s, craftsmanship was the production method. It aggregates processes, usually in one location with a few skillful experts. It delivers exactly what a customer wants when he wants it, but it was slow, expensive and not scalable. Mass production is less expensive, but inflexible. It favors disaggregating processes. Machines are designed and organized by function, instead of the flow of work. It aims to quickly produce large quantities of uniform products to increase revenue and reduce production and delivery costs through economies of scale. As Henry Ford famously said, “Any customer can have a car painted any color that he wants so long as it is black.” Today, companies offer many product varieties across many industries. Product variety creates value, but when it’s coupled with rigid mass production, it also creates waste and displaces other costs onto society because machines are less flexible than people. In other words, rigidity is imposed when a mass production system tries to maintain its prevailing goal of individual asset efficiency. Increasing product variety thus forces management to choose between stopping for equipment changeovers or running large batches. In batch production, we must choose between delaying deliveries or carrying inventory, since assets are tied up producing one variety while others are waiting. Unfortunately, neither delaying deliveries nor producing to forecast to compensate for long lead times demonstrates flexibility. The TPS takes the best of what each system has to offer. Toyota’s leadership understood the limitations of each method, so they engaged shop floor personnel early on to reconcile the conflicting objectives of achieving both flexibility and mass production. As a production system, TPS is an economic model that is conciliatory and humanitarian. Photo courtesy Toyota Motor Corp. Philosophical Elements of TPS Reconciling mass production and flexibility requires a different type of thinking and a consistent purpose that is not sustainable without clear economic principles. As a production system, TPS is an economic model that is conciliatory and humanitarian. It sits on a different philosophical principle of efficiency called “basic thinking”—so much so that the term “wrong thinking” became idiomatic in the TPS vernacular of my Toyota managers. While I was working at the Toyota Supplier Support Center in Erlanger, KY, in the late 1990s, nothing mattered more to my Toyota leaders than correcting my wrong thinking. Toyota’s basic thinking avoids favoring individual efficiency because it can lead to forced work and apparent efficiency. Individual asset efficiency for earned hours and revenue is forced work. This is a drastic departure from mass production thinking, which measures individual efficiency or how much an asset produces, regardless of when the customer needs it. However, producing anything outside of satisfying when and what the customer wants is overproduction, and overproduction is waste. Forced work leads to apparent efficiency. Forced work increases output and revenue, and it might reduce individual asset and production costs. However, the end result is apparent efficiency because the focus on individual efficiency leads to producing large runs of uniform products when alternating small runs of diversified products are needed instead. Large batches impose an operational rigidity that creates unnecessary direct costs and, most importantly, creates and displaces other indirect costs. The direct cost of unevenness in the schedule, as machines and workers operate to their own rhythm, results in planning irregularities and work detached from customer demand. The direct cost of waste comes from obsolete goods produced to forecasts, inventory stored in warehouses requiring conveyance, and unnecessary human activity. It ties up cash, hides defects, and compromises future revenue. Cumulatively, this type of poor resource allocation leads to the direct cost of overburden on people and machines. Even more concerning are the indirect costs to society, including unsustainable environmental pollution, which contributes to disease, biodiversity loss, soil death and climate change. With its relentless focus on eliminating waste, TPS offers solutions to the conflict between the need for profit and sensible environmental stewardship. Photo courtesy Toyota Motor Corp. The Economic Philosophy of TPS Instead, Toyota’s basic thinking focuses on three different principles of efficiency. The first addresses total efficiency. The second addresses eliminating unevenness in the schedule, waste in work, and overburdened assets. The third addresses true efficiency. Total efficiency encapsulates the goals of achieving the highest quality, the lowest cost, and the shortest lead time of products and services from order acceptance to delivery. Not one of these factors can be overly weighed against the others. Rather, all three must be achieved to their utmost. This means keeping to the philosophical discipline of not giving higher weight to any factor, the way mass production does with individual asset efficiency, earned hours and revenue. It also means applying science to eliminate “unevenness, waste and overburden” instead of forcing work and settling for compromises of apparent efficiency, like the economic order quantity method and oversimplified return of investment calculations. Apparent efficiency is the immediate perception of gain and benefit when, in fact, less visible costs are displaced or new costs are created with payment due later. Standards of living have improved worldwide, but is this true for everyone and will future generations have a planet to enjoy it? TPS eliminates layers of unevenness, waste and overburden by deploying the “stop and notify” method, a process designed to make problems visible early so they can be solved quickly. Photo courtesy Toyota Motor Corp. Technical Elements of TPS TPS brings together a series of industrial designs that, when applied together, eliminate the trade-off between the goals of high quality, low cost and short lead-time. Financially, it translates to simultaneously meeting the need for profit, as reported in the income statement, and the need for operating cash flow, as reported in the statement of cash flow. Indeed, generating a profit is only one of a business’s challenges. Another is to generate cash quickly enough to pay the bills on time! In mass production, those two requirements conflict because revenue and flexibility are at odds. To satisfy the need for profit and cash flow simultaneously, we must produce quality products and services to generate revenue from sales, we must reduce end-to-end value stream costs to increase profit margins, and we must shorten lead times to generate cash. TPS eliminates layers of unevenness, waste and overburden by deploying the “stop and notify” method, a process designed to make problems visible early so they can be solved quickly by experts when and where they occur. Ideally, this is done autonomously. Simultaneously, TPS requires one-piece continuous flow, a process designed to eliminate work stagnation. Together, these two procedures support each other in a symbiotic system to reduce the lead time and free the rate of supply to match the rate of pull. Shorter lead times make it possible to design and produce goods or services closer in time to actual customer needs, instead of relying on uneven and overburdening longer-range forecasts. Actual customer demand becomes the new shared operational data point, known as takt time. Knowing takt time enables management to determine how many people, machines and materials are needed to meet demand without wasting resources. Other principles of the TPS include jidokam just-in-time manufacturing and heijunka. Jidoka is the idea of building quality into the process. Just-in-time is the idea of enabling quick response to change by only building what is needed, when it is needed, in the amount needed. Together, jidoka and JIT eliminate unevenness in production schedules, overburden on assets, and waste in work. Heijunka is leveling the type and quantity of production over a fixed period of time. This enables production to efficiently meet customer demand. The TPS respects and honors humanity by cultivating meaningful, satisfying work to build self-worth. Photo courtesy Toyota Motor Corp. The Managerial Element of TPS The TPS requires a different managerial approach than the one offered by the mass production system. Specifically, Toyota worked to reconcile the creative nature of people with the repetitive and mundane requirements of industrial work. This requires developing workers who can work as a team while also becoming expert craftsmen at what they do. The TPS reintroduces craftsmanship into an industrial setting—not in the same way, to be sure, but with the same importance. In mass production, machines triumphed over labor. People took a back seat, and machines became the most valuable asset. At the time, mass production was the best we could do to meet the world’s seemingly unlimited demand for essential goods. At first, people benefited from the system by giving up their skills for increased living standards. Now, we realize the system’s limitations. Entering the age of artificial intelligence, humanity will continue to be tested in even more challenging ways. The TPS can continue to play a critical role in reconciling the needs of business and people by embracing worker expertise at all levels, instead of frittering it away. In the TPS, workers learn to leverage new thinking and techniques to perform quality work efficiently and anticipate problems before they happen. If problems do occur, workers can identify and solve them rapidly and efficiently through a shared framework and knowledge consistent with eliminating unevenness, overburden and waste. On the one hand, it takes expertise to spot problems; on the other, no one who acquires expertise likes to waste it. This symbiotic relationship between the work people do, and their expertise enables people to reach their full potential and contribute toward the meaningful goals of highest quality, lowest cost, and shortest lead time. Therefore, the TPS respects and honors humanity by cultivating meaningful, satisfying work to build self-worth. Chasing profit from economies of scale implies higher output and reduces individual asset costs. But a higher output of what is not needed is wasteful. Photo courtesy Toyota Motor Corp. Environmental Innovation With its relentless focus on eliminating waste, TPS has brought about a third innovation to the larger aspect of our economies. It offers robust solutions to the conflict between the need for profit and sensible environmental stewardship. Society has a moral responsibility and the economic imperative to teach that chasing revenue by favoring individual machine efficiency at the expense of everything else is obsolete way of making a profit. Chasing profit from economies of scale implies higher output and reduces individual asset costs. But a higher output of what is not needed is wasteful. To produce is to deplete resources and emit pollution. We must also remember that, sooner or later, the things we make are destined to be discarded or trashed. When this kind of wrong thinking remains unchecked, thinner margins impede profits over time because all products succumb to commodity pricing. Thinner margins force businesses to merge to keep revenue increasing and delocalize work to lower-wage markets to maintain a profit—places where the workforce must accept less-than-dignifying work, disconnected from the customer. Complex, expensive, fragile and polluting supply chains emerge, and services disappear, leaving consumers with few options and no competitive market forces to keep prices in check. Manufacturers must learn how to make only what is needed—and to do it with less. Photo courtesy Toyota Motor Corp. Reshoring and Economic Stability Before joining Toyota, I worked in Silicon Valley with many semiconductor manufacturing plants. Once, the U.S. was a leader in semiconductor manufacturing. Today, 75 percent of semiconductors are manufactured in Asia. Of course, it’s not just semiconductor industry that has moved offshore. Scores of companies across all industries have done so primarily because they lack the knowledge of how to operate efficiently. The erosion of a strong domestic manufacturing sector was a contributing factor to why the United States has endured two economic crises in the past 12 years. These crises required unprecedented institutional interventions to mitigate a rigid industrial economy that lacks resilience due to radical asset individualism and the waste it generates. Today, manufacturers are disconnected from demand. Suppliers are disconnected from their customers. Value has been disconnected from true wealth creation, and common sense has been disconnected from environmental stewardship. Instead of repeating the past, could there be a better way forward? We must learn how to make only what we need—and to do it with less. That is true cost reduction. Besides helping the balance sheet, it will generate significant socioeconomic benefits. It will free industries from overreliance on economies of scale to reduce cost and fuel economic growth, and it will eliminate the need to shift the undesirable costs of environmental pollution onto others. Producing only what we need, with fewer resources, can help us achieve true economic prosperity. A sound economic framework and the coherent relationship between TPS’s philosophical, technical and managerial elements are undeniably part of Toyota’s corporate culture. This culture has sustained the long-term organizational consistency of purpose necessary to design and produce quality, affordable products only when needed and as geographically close to the customer as possible. The result is a congruent relationship between the interests of the firm, the employee, the consumer, and the environment. Realizing such shared consistency of purpose and harmony between traditionally divergent interests is no small feat; it took thousands of years to achieve. Organizations cannot achieve Toyota-like levels of operational maturity overnight. But, they will never realize their full potential if TPS remains a collection of practices to help leaders to think only in terms of trade-offs instead of congruency. We don’t have to start solving our business and socioeconomic contradictions from scratch. The TPS has already solved key areas by rethinking how we design, organize and manage work. Editor’s note: Olivier Larue is a senior executive consultant and president at Ydatum Inc., which partners with public corporations and private equity clients in operation design and management. He has more than 30 years of hands-on experience with the TPS. He worked with the Toyota Supplier Support Center in North America, the Toyota Operations Management Consulting Division, and New United Motor Manufacturing before founding a consulting firm in the Bay Area focused on implementing TPS in a variety of industries. He is the author of the new book, The Toyota Economic System. He will present a free webinar on the TPS on Tuesday, Oct. 3. ASSEMBLY ONLINE For more information on Toyota’s manufacturing technologies and practices, read these articles: Toyota Unveils New Generative AI Technique for Vehicle Design Smart Technologies Aid Continuous Improvement Efforts Assessing the Current State","filter_flag":1}
{"title":"Battery Manufacturer Boosts Output With Automation | ASSEMBLY - Assembly Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85Nzk4Mi1iYXR0ZXJ5LW1hbnVmYWN0dXJlci1ib29zdHMtb3V0cHV0LXdpdGgtYXV0b21hdGlvbtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85Nzk4Mi1iYXR0ZXJ5LW1hbnVmYWN0dXJlci1ib29zdHMtb3V0cHV0LXdpdGgtYXV0b21hdGlvbtIBAA?oc=5","id":"CBMiXWh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85Nzk4Mi1iYXR0ZXJ5LW1hbnVmYWN0dXJlci1ib29zdHMtb3V0cHV0LXdpdGgtYXV0b21hdGlvbtIBAA","guidislink":false,"published":"Sat, 26 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=238, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85Nzk4Mi1iYXR0ZXJ5LW1hbnVmYWN0dXJlci1ib29zdHMtb3V0cHV0LXdpdGgtYXV0b21hdGlvbtIBAA?oc=5\" target=\"_blank\">Battery Manufacturer Boosts Output With Automation | ASSEMBLY<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Assembly Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Battery Manufacturer Boosts Output With Automation | ASSEMBLY - Assembly Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85Nzk4Mi1iYXR0ZXJ5LW1hbnVmYWN0dXJlci1ib29zdHMtb3V0cHV0LXdpdGgtYXV0b21hdGlvbtIBAA?oc=5\" target=\"_blank\">Battery Manufacturer Boosts Output With Automation | ASSEMBLY<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Assembly Magazine<\/font>","source.href":"https:\/\/www.assemblymag.com","source.title":"Assembly Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Manufacturing\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"To make the most of renewable energy sources, such as wind and solar, utilities must overcome the problem of intermittency. When the sun isn’t shining or the wind isn’t blowing, energy is not being generated. Moreover, the energy grid was designed to accept the constant, predictable output of fuel-burning power plants—not the sharp rise and fall produced by solar panels at dawn and dusk. To solve this problem, utilities need low-cost, large-scale, long-duration energy storage systems that bank energy when it’s being generated and provide energy when it’s needed. Now, energy start-up ESS Inc. of Wilsonville, OR, has developed a new technology that promises to meet that need. The company’s iron-flow battery systems—the Energy Warehouse and the Energy Center—are designed to meet the energy needs of customers ranging from small industrial facilities to large, utility-scale projects. The batteries rely on a mixture of iron and saltwater to store energy for hours longer than lithium-ion batteries. During the charging cycle, iron that is saturated in the saltwater electrolyte is deposited on the negative electrode. To discharge the battery, the polarity is reversed, and the iron dissolves back into the saltwater solution. By carefully managing this process, the iron-flow battery is able to achieve a significantly longer battery life of 20,000 cycles or more, compared to 3,000 to 4,000 cycles for lithium-ion batteries, without degrading over time. Compared with other energy storage technologies, iron-flow batteries are cleaner, safer, more environmentally sustainable, and more economical. They are also fully recyclable. Unlike typical batteries that are packaged as fixed cells or modules, a flow battery allows the power (the rate of electricity flow) to be decoupled from the capacity (the total amount of energy held). As a result, facilities have the flexibility to use the batteries for a variety of applications. The Energy Warehouse is built inside a standard 40-foot shipping container for easy transport and commissioning. It provides six to 12 hours of storage, with a nominal power of 75 kilowatts (kW), a peak energy capacity of 500 kilowatt-hours (kWh) and a rated energy capacity of 400 kWh. The system does not require cooling or air-conditioning, even in desert environments. The low-maintenance system can provide more than 20,000 cycles with no capacity fade throughout its 25-year design life. That makes it ideal for renewable energy and utility projects needing long life and unlimited cycling capability. In addition, the system’s quick-response power electronics can perform ancillary grid services, such as voltage and frequency support on microgrids. The Energy Center is larger. Designed for independent power producers and utility-scale projects, the Energy Center has the same iron-flow battery modules as the Energy Warehouse—just more of them. The batteries are housed in a building rather than a shipping container, so users can customize an energy storage system to meet their exact needs. ESS’s technology is already gaining interest around the world. For instance, the company is working on a project with Coldwell Solar, a major developer of renewable energy projects for California’s commercial, agricultural and utility sectors. The storage units will be integrated into solar energy systems at three wineries in Mendocino County. ESS has also delivered an Energy Warehouse to Amsterdam Airport Schiphol in The Netherlands, the second largest airport in mainland Europe. The system is being used in a pilot project to demonstrate the feasibility of retiring diesel generators at the airport, which supply electrical power to parked aircraft. And, last fall, ESS was selected by Consumers Energy, Michigan’s largest energy provider, to provide an Energy Warehouse for a solar energy system at a gas compression facility. Consumers Energy provides natural gas and electricity to two thirds of Michigan’s 10 million residents. The project will help the utility achieve goals laid out in the Energy Storage Roadmap for Michigan. Released in April 2022 by the Michigan Department of Environment, Great Lakes and Energy, the roadmap calls for 1,000 megawatts (MW) of energy storage by 2025 and 4,000 MW by 2040. The Energy Warehouse is built inside a standard 40-foot shipping container. It provides six to 12 hours of storage, with a nominal power of 75 kW and a peak energy capacity of 500 kWh. Photo courtesy ESS Inc. Better Batteries by Design To meet growing demand for its products, ESS has worked hard to boost output, starting with improving product design. Early versions of the company’s battery stack were assembled manually. “The bolts were tightened manually. The wiring was done manually,” recalls Eric Dresselhuys, CEO of ESS. Years of R&D and field testing eventually yielded a battery design that was not just more powerful, but also cleaner and easier to produce. “Our S200 design is a 50 kWh battery. It’s a welded design—much more manufacturable, much more durable,” says Dresselhuys. A similar evolution occurred with the other key component of the iron-flow battery, the proton pump. “The proton pump keeps the electrolytes in the system balanced. That allows effectively unlimited cycling of the unit, ensuring that the electrolyte is clean and clear and balanced for storing electricity,” explains Dresselhuys. “The original unit was manually built. It had a lot of connections. The second generation design is much cleaner with fewer connections. Everything is welded. It has a smaller footprint. it costs less, and it’s more reliable.” Another example of how ESS improved design and quality is with wiring. In the past, assemblers would manually connect hundreds of wire ends, point by point. “Now, we’ve consolidated all that into one harness that can be hooked up very quickly,” says Vince Canino, chief operating officer of ESS. “We affectionately call it the ‘octopus harness,’ because of all its tentacles. It has improved the reliability and quality of our builds, and it has reduced the amount of labor.” To facilitate communication, design engineers and manufacturing engineers work together on the shop floor. “I don’t want anyone wondering, ‘why did he put that bolt hole there?’” says Canino. The company has also benefited by developing collaborative relationships with suppliers. For example, the company worked with injection molding vendors to develop large, intricate plastic parts with precise tolerances. “Our suppliers are in business with us. We help them, and they help us. It’s not about squeezing a bunch of cost out,” says Canino. Software monitors every aspect of the automated assembly process. Photo courtesy ESS Inc. Getting Lean Another way the company has boosted throughput is by implementing lean manufacturing. When Canino joined ESS in November 2022, the company was applying lean, “but it wasn’t in our DNA,” he admits. So, Canino hired a leader to make lean part of the corporate culture, from the shop floor to commissioning systems in the field. “Finding and eliminating waste isn’t just a process that is taught—it’s a way of thinking,” Canino says. “We have worked to eliminate days, then hours, and then seconds out of every step of our manufacturing processes to allow our people to focus on just those steps that add value. “Lean is not rocket science, but when you’re building something new, you’d be surprised at how much you need to get back to basics,” he adds. Today, ESS is well along on its lean journey. Visual management is evident throughout the factory. Dashboards and progress meters communicate production metrics for all to see. Kanbans govern parts replenishment. A “moonshine shop” tests worker suggestions for improvement. ESS started by applying the principles of 5S. For example, the company reorganized its warehouse to streamline the process of picking parts for the production floor. This saved hours of time for workers by reducing the need to search for parts. Workstations were organized with boards that only hold the tools needed at that station. Outlines on the boards indicate where the tools should be kept, ensuring that technicians can quickly find what is needed and identify missing tools. To the 5S principles at the core of lean, ESS added a sixth S—safety. “Safety is central to everything we do and is complementary to lean,” says Canino. “Improving and standardizing practices is one of the best ways to ensure a safe and predictable work environment.” A safety dashboard is front and center in the lobby of the company’s headquarters, to remind visitors and employees alike of the importance of safety. “The moment you think, ‘this isn’t dangerous,’ that’s when injuries get you,” Canino says. A similar 5S transformation took place at the back of the factory, where workers install batteries, tanks, pumps, electronics and other subassemblies inside the shipping containers that are to become Energy Warehouses. In the past, subassemblies were simply deposited near the dock doors wherever there was space. “There was no rhyme or reason to how the area was organized,” Canino remembers. “Workers spent a lot of time looking for stuff.” After a healthy dose of lean, the area is much better. “Just that exercise alone took days out the manufacturing process,” Canino says. At some point, Canino hopes to do final integration of the shipping containers on a moving assembly line, instead of one by one at loading bays at the back of the factory. But for now, he’s pleased with the company’s progress. “If you could see a before and after picture, the transformation is amazing. Our workers feel so much better. They’ve got pep in their step,” he says. A laser welds metal parts for a battery. Photo courtesy ESS Inc. Automating Assembly Initially, ESS assembled products manually. As volumes grew, it implemented a semiautomatic assembly line. Workers manually assembled the stacks of materials that made up the positive and negative electrodes of the battery. Those stacks would then be handed off to robots to ensure that the seal between all the layers is done with great precision. Even on the semiautomatic line, control software is used to reduce idle time and improve utilization of key equipment. In December 2022, the company hit the start button a new, fully automated assembly line. Robots now ensure electrodes are precisely placed in every module. Lasers weld key parts quickly and precisely. Vision systems every part is in place. At the end of the line, completed battery stacks are put through thermal and pressure testing. “It’s a much more efficient, much less labor-intensive manufacturing process,” says Dresselhuys. “The bolting, dispensing, soldering, pressure testing...are all done in-line. This has had a dramatic impact, improving our labor productivity by three times and ensuring that we get great quality off the end of the line.” “As we were developing the automation, we were also enhancing our product designs,” adds Canino. “But that’s only natural with an emerging technology like this.” Thanks to automation, ESS built more units in the fourth quarter of 2022 than in the entire preceding year. The company can now produce more than 800 MWh of energy storage per year. Automation has improved productivity at ESS by a factor of three. Photo courtesy ESS Inc. ASSEMBLY ONLINE For more information on battery manufacturing, read these articles: Ultrasonic Welding of Copper Foils for EV Battery Assembly JOT Helps Battery Manufacturer Automate Assembly Water Could Help EV Batteries Get More Power","filter_flag":1}
