{"title":"Schneider Electric, Siemens, ABB, and Bosch Ranked Leaders in ABI Research's Global Industrial & Manufacturing ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiuwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy1zaWVtZW5zLWFiYi1hbmQtYm9zY2gtcmFua2VkLWxlYWRlcnMtaW4tYWJpLXJlc2VhcmNocy1nbG9iYWwtaW5kdXN0cmlhbC0tbWFudWZhY3R1cmluZy1zdXN0YWluYWJpbGl0eS1hc3Nlc3NtZW50LTMwMTc5OTY0Ny5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiuwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy1zaWVtZW5zLWFiYi1hbmQtYm9zY2gtcmFua2VkLWxlYWRlcnMtaW4tYWJpLXJlc2VhcmNocy1nbG9iYWwtaW5kdXN0cmlhbC0tbWFudWZhY3R1cmluZy1zdXN0YWluYWJpbGl0eS1hc3Nlc3NtZW50LTMwMTc5OTY0Ny5odG1s0gEA?oc=5","id":"CBMiuwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy1zaWVtZW5zLWFiYi1hbmQtYm9zY2gtcmFua2VkLWxlYWRlcnMtaW4tYWJpLXJlc2VhcmNocy1nbG9iYWwtaW5kdXN0cmlhbC0tbWFudWZhY3R1cmluZy1zdXN0YWluYWJpbGl0eS1hc3Nlc3NtZW50LTMwMTc5OTY0Ny5odG1s0gEA","guidislink":false,"published":"Tue, 18 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=108, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiuwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy1zaWVtZW5zLWFiYi1hbmQtYm9zY2gtcmFua2VkLWxlYWRlcnMtaW4tYWJpLXJlc2VhcmNocy1nbG9iYWwtaW5kdXN0cmlhbC0tbWFudWZhY3R1cmluZy1zdXN0YWluYWJpbGl0eS1hc3Nlc3NtZW50LTMwMTc5OTY0Ny5odG1s0gEA?oc=5\" target=\"_blank\">Schneider Electric, Siemens, ABB, and Bosch Ranked Leaders in ABI Research's Global Industrial & Manufacturing ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Schneider Electric, Siemens, ABB, and Bosch Ranked Leaders in ABI Research's Global Industrial & Manufacturing ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiuwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy1zaWVtZW5zLWFiYi1hbmQtYm9zY2gtcmFua2VkLWxlYWRlcnMtaW4tYWJpLXJlc2VhcmNocy1nbG9iYWwtaW5kdXN0cmlhbC0tbWFudWZhY3R1cmluZy1zdXN0YWluYWJpbGl0eS1hc3Nlc3NtZW50LTMwMTc5OTY0Ny5odG1s0gEA?oc=5\" target=\"_blank\">Schneider Electric, Siemens, ABB, and Bosch Ranked Leaders in ABI Research's Global Industrial & Manufacturing ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-efficiency\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"NEW YORK, April 18, 2023 \/PRNewswire\/ -- A new competitive ranking by global technology intelligence firm ABI Research provides an in-depth and unbiased examination of a representative set of 10 of the world's largest industrial manufacturing conglomerates that are leading the way toward sustainable manufacturing operations. These companies were evaluated and ranked based on their sustainability efforts across six categories: renewable energy use; material sourcing and eco-design; technology use and eco-efficiency; waste reduction and circularity; green buildings and vehicles; and reporting and governance. Within those categories, ABI Research further identified 30 action items to score each company in the index for specifically reducing carbon emissions, water use, and waste across the industrial sector. This assessment establishes the sustainability positioning of each profiled company—leaders, mainstream, and followers— and provides strategic recommendations for improvement. Sustainability Leaders: Schneider Electric, Siemens, ABB, and Bosch Sustainability Mainstream: Hitachi, General Electric, Honeywell, and LG Sustainability Followers: Mitsubishi Corporation and Rockwell Automation Kim Johnson, Sustainable Technologies Principal Analyst explains, \"Our assessment identified Schneider Electric, Siemens, ABB, and Bosch as the top four sustainability leaders. Schneider Electric integrates sustainability and energy management expertise into all its offerings, targeting carbon neutrality within its own operations by 2025, and 90% renewable energy use, 50% green material in its products, and 80% of revenue tied to its Green Premium standard by 2025. Siemens ranked in second place leading the index in industrial digital automation and green buildings and vehicles, while receiving solid scores for renewable energy use and reporting and governance. Siemens targets carbon neutrality by 2030. ABB was a leading technology implementer for industrial automation and robotics, and the group has set a target to reduce its customers' emissions by at least 100 megatons by 2030, equal to the annual emissions of around 30 million combustion vehicles, with carbon neutrality by 2030. Bosch achieved carbon neutrality for Scope 1 and Scope 2 emissions in 2020 and led the index in global renewable energy use. There are substantial differences in the value chain carbon emissions of companies like Mitsubishi producing heavy equipment, General Electric (GE) and Honeywell manufacturing aircraft engines and aerospace equipment, Hitachi producing construction machinery and transportation infrastructure, and Bosch manufacturing automotive parts and chips versus other companies with a higher percentage of digital automation solutions, software tools, and services. Some of the industrial companies in the index are still evaluating the full scale of their upstream and downstream Scope 3 emissions. \"Thus, the sustainability index is not a tool to directly compare the carbon footprints of the products and offerings of the conglomerate companies. Rather, the intent of the research is to discern several ambitious corporate sustainability programs and best practices to better understand what industrial sector leaders are doing to achieve their climate goals and reduce their environmental impact,\" Johnson concludes. These findings are from ABI Research's Sustainability Assessment: Large Industrial Solution Providers competitive ranking report. This report is part of the company's Sustainable Technologies research service, which includes research, data, and ABI Insights. Competitive Ranking reports offer comprehensive analysis of implementation strategies and innovation, coupled with market share analysis, to offer unparalleled insight into a company's performance and standing in comparison to its competitors. About ABI Research ABI Research is a global technology intelligence firm delivering actionable research and strategic guidance to technology leaders, innovators, and decision makers around the world. Our research focuses on the transformative technologies that are dramatically reshaping industries, economies, and workforces today. ABI Research是一家国际科技情报公司，为全球科技领袖、创新人士和决策者提供实用的市场研究和战略性指导。我们密切关注一切为各行各业、全球经济和劳动市场带来颠覆性变革的创新与技术。 For more information about ABI Research's services, contact us at +1.516.624.2500 in the Americas, +44.203.326.0140 in Europe, +65.6592.0290 in Asia-Pacific, or visit www.abiresearch.com. Contact Info: Global Deborah Petrara Tel: +1.516.624.2558 [email protected] SOURCE ABI Research","filter_flag":1}
