{"title":"Sustainability Guidelines - National Geographic Society","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3Lm5hdGlvbmFsZ2VvZ3JhcGhpYy5vcmcvc29jaWV0eS9zdXN0YWluYWJpbGl0eS1ndWlkZWxpbmVzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3Lm5hdGlvbmFsZ2VvZ3JhcGhpYy5vcmcvc29jaWV0eS9zdXN0YWluYWJpbGl0eS1ndWlkZWxpbmVzL9IBAA?oc=5","id":"CBMiRWh0dHBzOi8vd3d3Lm5hdGlvbmFsZ2VvZ3JhcGhpYy5vcmcvc29jaWV0eS9zdXN0YWluYWJpbGl0eS1ndWlkZWxpbmVzL9IBAA","guidislink":false,"published":"Fri, 20 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=293, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3Lm5hdGlvbmFsZ2VvZ3JhcGhpYy5vcmcvc29jaWV0eS9zdXN0YWluYWJpbGl0eS1ndWlkZWxpbmVzL9IBAA?oc=5\" target=\"_blank\">Sustainability Guidelines<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">National Geographic Society<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sustainability Guidelines - National Geographic Society","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3Lm5hdGlvbmFsZ2VvZ3JhcGhpYy5vcmcvc29jaWV0eS9zdXN0YWluYWJpbGl0eS1ndWlkZWxpbmVzL9IBAA?oc=5\" target=\"_blank\">Sustainability Guidelines<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">National Geographic Society<\/font>","source.href":"https:\/\/www.nationalgeographic.org","source.title":"National Geographic Society","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Prevention\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Last updated: October 20, 2023 Sustainability is development that meets the needs of the present without compromising the ability of future generations to meet their own needs.1 A sustainable organization must embrace a holistic way of thinking that considers how we can create social and environmental value through our actions, while limiting negative impacts from those actions on communities, wildlife or natural resources. For National Geographic, sustainability is an essential component of the brand and is reflected in our storytelling, products, brand activations and nonprofit work. The existence of the people, places, and wildlife that we explore and celebrate depend on our decisions and actions. To combat climate change, resource depletion, pollution and social inequities we will make conscious choices about who and what contribute to the creation of our products, experiences, and supplies and we will consider carefully the short- and long-term consequences of their creation, use, and disposal on communities and the environment. Any individual, organization or company collaborating with or doing business with National Geographic, such as service providers and manufacturing suppliers, must be evaluated for their commitment to social and environmental principles, and National Geographic products, activations and promotions must be evaluated for their potential social and environmental impacts. For clarity, “National Geographic” includes the Society, and its licensee, NGP\/Disney and their licensees. Consistent with our core values, National Geographic embraces sustainable development and continuously evaluates impacts that are most material to business activities, including: Preservation of cultures and habitats Protection of endangered species Mitigating climate change Minimizing the use of toxic materials and finite natural resources like oils, gasses, metals and plastics by finding alternatives Replacing, replanting and regenerating renewable resources like wood and water Prioritizing durability, reparability and recyclability in the products used and created in order to reduce waste Eliminating as much as possible the creation of pollutants and unrecoverable waste Potential sustainability risks for the National Geographic brand from a particular product, service, activity, or activation can stem from a wide range of social and environmental issues:","filter_flag":1}
{"title":"New Required Reporting on PFAS Defines New Regulatory Environment - EHS Today","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LmVoc3RvZGF5LmNvbS9lbnZpcm9ubWVudC9hcnRpY2xlLzIxMjc0NzMwL25ldy1yZXF1aXJlZC1yZXBvcnRpbmctb24tcGZhcy1kZWZpbmVzLW5ldy1yZWd1bGF0b3J5LWVudmlyb25tZW500gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LmVoc3RvZGF5LmNvbS9lbnZpcm9ubWVudC9hcnRpY2xlLzIxMjc0NzMwL25ldy1yZXF1aXJlZC1yZXBvcnRpbmctb24tcGZhcy1kZWZpbmVzLW5ldy1yZWd1bGF0b3J5LWVudmlyb25tZW500gEA?oc=5","id":"CBMid2h0dHBzOi8vd3d3LmVoc3RvZGF5LmNvbS9lbnZpcm9ubWVudC9hcnRpY2xlLzIxMjc0NzMwL25ldy1yZXF1aXJlZC1yZXBvcnRpbmctb24tcGZhcy1kZWZpbmVzLW5ldy1yZWd1bGF0b3J5LWVudmlyb25tZW500gEA","guidislink":false,"published":"Mon, 02 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=275, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LmVoc3RvZGF5LmNvbS9lbnZpcm9ubWVudC9hcnRpY2xlLzIxMjc0NzMwL25ldy1yZXF1aXJlZC1yZXBvcnRpbmctb24tcGZhcy1kZWZpbmVzLW5ldy1yZWd1bGF0b3J5LWVudmlyb25tZW500gEA?oc=5\" target=\"_blank\">New Required Reporting on PFAS Defines New Regulatory Environment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EHS Today<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New Required Reporting on PFAS Defines New Regulatory Environment - EHS Today","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LmVoc3RvZGF5LmNvbS9lbnZpcm9ubWVudC9hcnRpY2xlLzIxMjc0NzMwL25ldy1yZXF1aXJlZC1yZXBvcnRpbmctb24tcGZhcy1kZWZpbmVzLW5ldy1yZWd1bGF0b3J5LWVudmlyb25tZW500gEA?oc=5\" target=\"_blank\">New Required Reporting on PFAS Defines New Regulatory Environment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EHS Today<\/font>","source.href":"https:\/\/www.ehstoday.com","source.title":"EHS Today","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Prevention\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"There was a time when time itself was something offered to companies to help them comply with new regulations. Well, that time is over. A myriad of factors resulted in an announcement by the EPA on Sept. 29 that manufacturers are now required to report on the presence of 1,462 PFAS chemicals in their processes and products. And this reporting will need to go back 12 years. Information related to chemical identity, uses, volumes made and processed, byproducts, environmental and health effects, worker exposure, and disposal needs to be reported. Specifically these changes are being made to the Toxic Substances Control Act (TSCA) in Section 8 (a) (7) Reporting and Recordkeeping Requirements for PFAS chemicals. The timeline for manufacturers to comply with this final rule is 18 months, with an additional six months for reports from small businesses that are solely reporting data on importing PFAS contained in products. That timeframe is particularly quick given the very complex nature of PFAS as they are spread out far and wide in most companies’ supply chains and serve a variety of functions. New View of Managing Regulatory Compliance Both in the present case of PFAS and in future chemical regulation companies need to adjust their timelines. \"Getting ahead of what’s coming in terms of regulations by knowing what’s in our products and our supply chain is how companies can deal with these shortened times for regulatory compliance,” explains Cally Edgren, senior director of sustainability at Assent. Having worked at large manufacturing companies over the past two decades she has seen the change. “As soon as regulatory agencies start whispering about potential changes, we need to jump on the issue. Gone are the days of having a lot of time to comply.” The new PFAS regulation is a perfect example of the current complexity of compliance, and perhaps a blueprint for the future. The final ruling covers 1,400 substances, which is around 100 more chemicals than were first discussed in the proposed rule two years ago. And finding data from a long and sprawling supply chain is quite daunting. “Many organizations do not yet have the functional structure in place to gather and access supplier data,” notes Edgren. “This rule signals a more comprehensive approach to PFSA management, with an emphasis on gathering more detailed information about the larger list of substances and their impacts.” And that data is what the EPA is counting on. In the announcement on Sept. 28. “The data we’ll receive from this rule will be a game-changer in advancing our ability to understand and effectively protect people from PFAS,” said Assistant Administrator for the Office of Chemical Safety and Pollution Prevention Michal Freedhoff. “In order to effectively research, monitor, and regulate PFAS, EPA is taking action to better understand who is using PFAS, how they are being used, and in what quantities. This rule will produce actionable data that can be used by EPA, as well as state, local, and Tribal governments to craft policies and laws that protect people from dangerous “forever chemicals.” Sorting out PFAS Usage Addressing the dangerous angle of these chemicals can be a mixed bag, explains Edgren. Sometimes these chemicals are used as a safety chemical to prevent other known harmful chemicals from being released in manufacturing. “These chemicals are both the good guy and the bad guy, so sorting out how to keep workforces healthy is complicated.\" Finding substitutes for these chemicals is also tricky and the element of time shows up again. In December of 2020, 3M announced that as of 2025 it would no longer produce PFAS. This creates a huge hole in the market causing many companies to quickly regroup and find replacements which are not easily located and in some cases new products are being created to fill this gap. . Drivers of Current and Future Regulations A particularly interesting aspect of the regulation of PFAS is the many drivers of the change. Perhaps the trongest is consumer awareness of the adverse effects of these chemicals, based on public knowledge of how these chemicals are showing up in drinking water. According to a report, released in July of 2023, the United States Georgical Survey estimates that 45% of tap water could have one or more PFAS. That awareness is showing up in terms of customer demands to buy products free of PFAS. An example is REI, the clothing retailer. They announced in February of 2023 that by fall of 2024, none of the products it carries will have PFAS. Another driver is the insurance risk, notes Edgren. Since 2005 there have been 6,400 PFAS-related lawsuits. While the lawsuits have targeted companies who manufacture the chemicals the trend is moving toward companies that use the chemicals in their processes or products. Expanded EHS Role With the regulatory climate changing as a result of the PFAS issue, how EHS managers deal with compliance will have to change. “Compliance can’t be seen as an ad hoc function that it used to be. Companies need to have make compliance a permanent feature. Furthermore, there needs to be the understanding that product compliance is now a revenue driver as customers are making buying decisions based on compliance with regulations, as evidenced by the market for non-PFAS clothing, for example.’ Edgren advises companies to make sure that there are EHS representatives in strategy sessions. “A lot of the regulatory impact is moving over to the operations side, as opposed to the strictly product side it had been.” Moving in this direction will result in companies being better prepared for a future regulatory landscape. “Companies that proactively prepare to meet the new requirements and deploy the needed tools to capture, access and remove PFAS across their supply chain will position themselves to successfully navigate the evolving global regulatory environment” says Edgren.","filter_flag":1}
{"title":"Circular Fashion Revolution: Recycling Medical Scrubs for a Greener Future - EP Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vZXBvbmxpbmUuY29tL2FydGljbGVzLzIwMjMvMTAvMTAvY2lyY3VsYXItZmFzaGlvbi1yZXZvbHV0aW9uLXJlY3ljbGluZy1tZWRpY2FsLXNjcnVicy1mb3ItYS1ncmVlbmVyLWZ1dHVyZS5hc3B40gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vZXBvbmxpbmUuY29tL2FydGljbGVzLzIwMjMvMTAvMTAvY2lyY3VsYXItZmFzaGlvbi1yZXZvbHV0aW9uLXJlY3ljbGluZy1tZWRpY2FsLXNjcnVicy1mb3ItYS1ncmVlbmVyLWZ1dHVyZS5hc3B40gEA?oc=5","id":"CBMid2h0dHBzOi8vZXBvbmxpbmUuY29tL2FydGljbGVzLzIwMjMvMTAvMTAvY2lyY3VsYXItZmFzaGlvbi1yZXZvbHV0aW9uLXJlY3ljbGluZy1tZWRpY2FsLXNjcnVicy1mb3ItYS1ncmVlbmVyLWZ1dHVyZS5hc3B40gEA","guidislink":false,"published":"Tue, 10 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=283, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vZXBvbmxpbmUuY29tL2FydGljbGVzLzIwMjMvMTAvMTAvY2lyY3VsYXItZmFzaGlvbi1yZXZvbHV0aW9uLXJlY3ljbGluZy1tZWRpY2FsLXNjcnVicy1mb3ItYS1ncmVlbmVyLWZ1dHVyZS5hc3B40gEA?oc=5\" target=\"_blank\">Circular Fashion Revolution: Recycling Medical Scrubs for a Greener Future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EP Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Circular Fashion Revolution: Recycling Medical Scrubs for a Greener Future - EP Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vZXBvbmxpbmUuY29tL2FydGljbGVzLzIwMjMvMTAvMTAvY2lyY3VsYXItZmFzaGlvbi1yZXZvbHV0aW9uLXJlY3ljbGluZy1tZWRpY2FsLXNjcnVicy1mb3ItYS1ncmVlbmVyLWZ1dHVyZS5hc3B40gEA?oc=5\" target=\"_blank\">Circular Fashion Revolution: Recycling Medical Scrubs for a Greener Future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EP Magazine<\/font>","source.href":"https:\/\/eponline.com","source.title":"EP Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Prevention\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Circular Fashion Revolution: Recycling Medical Scrubs for a Greener Future By reusing products, reducing waste and recycling materials, the industry is transforming the way medical workwear is manufactured and used. Now there is a greater focus on sustainable practices within the healthcare industry. All stakeholders are becoming aware of the need to balance their environmental responsibilities with patient care needs. The primary agenda on the list is how to tackle waste management in healthcare, particularly how to recycle medical scrubs. The consensus among healthcare institutions, care providers, government authorities and non-governmental organizations is that the current practices in healthcare need to be reimagined. One way to do that is by approaching waste as a resource that can be recycled to bring down costs, improve patient well-being and reduce environmental impact. From Production to Disposal: Understanding the Environmental Impact of Scrubs While medical scrubs are crucial for maintaining hygiene, it’s important to also analyze their environmental impact. These are the main ways in which scrubs pose sustainability challenges from production to disposal. Fabrics Scrubs are usually made from a mixture of polyester and cotton. The latter is a water-intensive crop and its production can aggravate water scarcity in places where it’s grown. Polyester, a byproduct of petroleum, needs an enormous amount of energy in its manufacturing stage. Plus, it’s not biodegradable. Dyes Chemical dyes are needed to create colors in medical scrubs. Their use can release dangerous pollutants into the soil and waterways near the production facilities. Since these chemicals accumulate in the nearby ecosystems, they pose serious risks to humans, cattle, and other animals and birds. Transportation The transportation of medical scrubs also contributes to carbon emissions. Whether it’s from a production facility to a distribution center or from a healthcare facility to a laundry service, there are serious environmental challenges that the industry needs to be aware of. The problem is more severe since most manufacturing plants are situated overseas. Disposal Single-use scrubs usually end up in landfills, where it takes years for the synthetic fabrics used in their manufacturing to decompose. Landfills have been identified as “super emitters” of methane and the third-largest source of this greenhouse gas. The Importance of Closing the Loop in Healthcare Products According to the American Medical Association, one of the biggest challenges to sustainable medical care is the disposal of healthcare waste. Switching to reusable healthcare products can help reduce the environmental impact of the sector. The solution is to “close the loop.” Closing the loop involves manufacturing products that can be used, reused and recycled. Instead of a linear model where products invariably end up as waste, it relies on a circular process. This significantly reduces wastage and the strain on surrounding ecosystems and communities. In healthcare, closing the loop is a transformative and sustainable approach that can redefine how products are manufactured, transported, used and recycled. Exploring the Environmental Benefits of Circular Scrub Design Using the principles of the circular economy, circular scrub design creates products that are recyclable and regenerative. This is different from the traditional “take, make and dispose” philosophy in manufacturing. Circular scrub design is a holistic strategy of reusing and recycling that provides several key benefits. Less waste Circular scrub design minimizes waste generation in healthcare. Producers can minimize the amount of waste by creating products that can be reused and recycled. Certain products can even be upcycled, which will divert chemicals and fabrics from waste streams. This goes a long way in preserving natural ecosystems. Lower resource consumption One reason there’s greater interest in sustainable and ethical scrubs because the process of circular scrub design lowers resource consumption. When scrubs are designed to be repaired, disassembled, reused and repurposed, there’s reduced pressure to constantly source new raw materials. Smaller carbon footprint Circular scrub design can reduce the need for energy-intensive production processes and transportation. If products can be locally sourced and effectively recycled, there will be a significant reduction in the overall carbon footprint. Research has found that reusable hospital gowns can lower greenhouse gas emissions by 66 percent. The Future of Sustainable Healthcare: Innovative Recycling Techniques for Medical Scrubs Several recycling methods are redefining scrub usage in the healthcare industry. These are some of the most innovative. Biodegradable fabrics Plant-based fibers—including organic cotton, hemp and bamboo—are now being explored as alternatives to traditional materials. They decompose faster in landfills and reduce the collective reliance on petroleum-based products. Their decomposition also makes the soil richer, which makes the ecosystem healthier. Selective fiber recycling Using advanced technology, researchers are separating natural and synthetic fibers. Breaking down the fabrics makes it easy to recycle and reconstitute them into new materials and products. Importantly, these products don’t compromise on either performance or comfort. Microbial decomposition Microorganisms such as enzymes and bacteria can break down certain fabrics. This microbial degradation makes it easy to return these components to the ecosystem, instead of letting used garments and scrubs languish in landfills. On-demand production On-demand production technologies such as 3D printing allow healthcare institutions to create customized scrubs when they need them. There’s no need to order these in bulk, which will lead to waste. There’s also no need for storage or transport since it’s produced at the site. A Greener Future for Healthcare: How Circular Fashion Reshapes Medical Workwear The healthcare sector is consciously moving away from its reliance on single-use garments to circular fashion. By reusing products, reducing waste and recycling materials, the industry is transforming the way medical workwear is manufactured and used. The reusable system has a 31 percent lower impact on climate change when compared to the disposable alternative. Closed-loop systems in healthcare can not only foster sustainability but also lead to demonstrable cost savings. With reduced need for new garments, healthcare providers can redirect their resources towards enhancing patient outcomes. That’s how circular fashion is creating win-win scenarios for caregivers and care receivers.","filter_flag":1}
