{"title":"ESG exclusive 'club' puts pressure on agriculture - AgUpdate","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL2FndXBkYXRlLmNvbS9taWR3ZXN0bWVzc2VuZ2Vya3MvbmV3cy9zdGF0ZS1hbmQtcmVnaW9uYWwvZXNnLWV4Y2x1c2l2ZS1jbHViLXB1dHMtcHJlc3N1cmUtb24tYWdyaWN1bHR1cmUvYXJ0aWNsZV85OGFkN2E3NC1hNzFiLTExZWQtYmE2MC0xNzg0MGFmNmVmMWQuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL2FndXBkYXRlLmNvbS9taWR3ZXN0bWVzc2VuZ2Vya3MvbmV3cy9zdGF0ZS1hbmQtcmVnaW9uYWwvZXNnLWV4Y2x1c2l2ZS1jbHViLXB1dHMtcHJlc3N1cmUtb24tYWdyaWN1bHR1cmUvYXJ0aWNsZV85OGFkN2E3NC1hNzFiLTExZWQtYmE2MC0xNzg0MGFmNmVmMWQuaHRtbNIBAA?oc=5","id":"CBMioQFodHRwczovL2FndXBkYXRlLmNvbS9taWR3ZXN0bWVzc2VuZ2Vya3MvbmV3cy9zdGF0ZS1hbmQtcmVnaW9uYWwvZXNnLWV4Y2x1c2l2ZS1jbHViLXB1dHMtcHJlc3N1cmUtb24tYWdyaWN1bHR1cmUvYXJ0aWNsZV85OGFkN2E3NC1hNzFiLTExZWQtYmE2MC0xNzg0MGFmNmVmMWQuaHRtbNIBAA","guidislink":false,"published":"Fri, 10 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=41, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL2FndXBkYXRlLmNvbS9taWR3ZXN0bWVzc2VuZ2Vya3MvbmV3cy9zdGF0ZS1hbmQtcmVnaW9uYWwvZXNnLWV4Y2x1c2l2ZS1jbHViLXB1dHMtcHJlc3N1cmUtb24tYWdyaWN1bHR1cmUvYXJ0aWNsZV85OGFkN2E3NC1hNzFiLTExZWQtYmE2MC0xNzg0MGFmNmVmMWQuaHRtbNIBAA?oc=5\" target=\"_blank\">ESG exclusive 'club' puts pressure on agriculture<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AgUpdate<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ESG exclusive 'club' puts pressure on agriculture - AgUpdate","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL2FndXBkYXRlLmNvbS9taWR3ZXN0bWVzc2VuZ2Vya3MvbmV3cy9zdGF0ZS1hbmQtcmVnaW9uYWwvZXNnLWV4Y2x1c2l2ZS1jbHViLXB1dHMtcHJlc3N1cmUtb24tYWdyaWN1bHR1cmUvYXJ0aWNsZV85OGFkN2E3NC1hNzFiLTExZWQtYmE2MC0xNzg0MGFmNmVmMWQuaHRtbNIBAA?oc=5\" target=\"_blank\">ESG exclusive 'club' puts pressure on agriculture<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AgUpdate<\/font>","source.href":"https:\/\/agupdate.com","source.title":"AgUpdate","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Mitigation\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Most farmers don’t like to be told what to do or how to do it. As an agricultural producer, you may think your greatest threat is Mother Nature or the next wave of pestilence to infect your crop or livestock. However according to some, the greatest danger to your livelihood involves your freedom to farm: Environmental, Social and Governance (ESG). “ESG is one of the most important issues facing us today, if not the most important,” said Jack McPherrin. McPherrin is the research editor and a research fellow with The Heartland Institute, a nonprofit, Chicago-based research and education organization. He has done extensive research into ESG and has published multiple articles outlining the basics of ESG, as well as its relation to free market. He described ESG as “a social credit score.” ESG is a new method to assess risk of an entity, whether a country, state, company or individual. It involves the interest of investors and stakeholders. “The capitalist system historically in America evaluated companies based on traditional financial metrics—profit, loss, producing what consumers want,” said McPherrin. “Now ESG rates a company based on climate mitigation and social justice.” What is ESG? Harvard Law School breaks down ESG into its three categories: • Environmental: energy efficiencies, carbon footprints, greenhouse gas emissions, deforestation, biodiversity, climate change and pollution mitigation, waste management and water usage. • Social: labor standards, wages and benefits, workplace and board diversity, racial justice, pay equity, human rights, talent management, community relations, privacy and data protection, health and safety, supply-chain management and other human capital and social justice issues. • Governance: corporate board composition and structure, strategic sustainability oversight and compliance, executive compensation, political contributions and lobbying, bribery and corruption. How are ESG scores compiled? ESG scores are determined by a group of international organization asset managers, executives and regulatory authorities, said McPherrin. Essentially, those who are invested in companies with a lot of purchasing power dictate ESG standards and scores. “ESG standards are very subjective. There’s no objective global standard for ESG,” said Mark McHargue, president of Nebraska Farm Bureau (NEFB). Agriculture metrics revolve largely around the “environment” component of ESG. Agricultural industries and individual farms could be scored based on land use or ecological sensitivity. McPherrin also noted impacts can be scored, such as impacts of pollution, impacts of solid waste disposal and impacts of fresh water consumption and withdrawal. Nutrient or chemical application can influence ESG ratings, as well. “Farmers do use pesticides and herbicides, and if people don’t understand how we do that—in a judicious manner of keeping all labeling requirements—you could potentially, arbitrarily, be denied a loan because of a standard that doesn’t have anything to do with your financial health,” McHargue said. Some regulatory authorities utilize assessment tools such as Aladdin Climate, which translates risks and opportunities associated with climate change into terms investors can understand when analyzing portfolios. Another tool is implied temperature rise (ITR), a temperature-alignment metric to infer potential climate change. What do ESG scores represent? Each assessment tool compares a factor against a standard, which is set by the regulating authority. The metrics used to score ESG are extremely subjective and cannot be qualitatively measured, said McPherrin. However, some in the corporate sector view ESG differently. Katherine Collins is head of sustainable investing at Putnam Investments, a global company with $170 billion in assets under its management at the end of December 2022. She said that ESG ratings can be as simple as a checklist. For example, putting a woman on the board of directors or planting carbon offset trees can boost ESG scores. “There is a part of the ESG practice that is very report-cardy, based on scores and rankings and ratings, and there’s some utility in that, but it’s not important in and of itself,” Collins told Wailin Wong during an interview on a Planet Money podcast titled “Two Indicators: The fight over ESG investing” aired Dec. 21, 2022. In addition, there are discrepancies based on what is scored. For example, a company that owned its fleet of trucks had a skewed environmental ESG score as compared to a similar company that did not. Companies with practices ranking lower against ESG standards will be scored poorly, as in the truck example, resulting in reduced or terminated access to capital and credit. Conversely, higher scoring companies will greatly benefit from ESG ratings. Another name for ESG is the “impact investing movement.” Many companies are no longer concerned with only quarterly profit or loss statements; now their portfolios reflect their social purpose. This has been ongoing for over a decade but is gaining publicity in the past three to four years, McPherrin said. “If it has a good ESG score, investments flow to it—loans, preferential contracting, tax breaks. It’s an exclusive club companies get to belong to if they are deemed successful in their ESG efforts,” said McPherrin. Moreover, ESG regulations extend beyond financial decisions. ESG could control what type of herbicide is used by row crop producers or ban the use of chemicals completely for a producer who enters a contract with a stakeholder company. How does ESG influence company decisions? To better understand the rationale behind ESG, you must first enter the corporate world of BlackRock, one of the leading corporations in the ESG movement. As a global investment fiduciary, BlackRock oversees $8 trillion, as of December 2022. It “owns basically a part of every publicly traded company,” said Wong during the aforementioned podcast. Wong interviewed Tariq Fancy, BlackRock’s first global chief investment officer for sustainable investing who was hired in 2017. Two years later, he left the company. Fancy perceived that the private sector could not control the markets as he wished. He alluded that only government control can fix the problems, can “regulate away the undesirable.” BlackRock CEO Larry Fink does not share his former sustainability chief officer’s skepticism. He said BlackRock’s focus is sustainability not because they are environmentalists, but because they are capitalists and fiduciaries to their clients. In his 2021 annual letter to CEO’s, Fink urged companies to set targets for short-, medium-, and long-term greenhouse gas reductions for net zero emissions. “We believe the companies leading the transition present a vital investment opportunity for our clients, and driving capital toward these phoenixes will be essential to achieving a net zero world,” Fink wrote. Net zero goes beyond compensating carbon emissions to eliminate greenhouse gas emissions. “Net zero” may also mean net zero profits for any entity or individual that does not conform to the pressure of ESG standards. Thousands of global companies have either committed to or set a target date for adopting net zero emissions. Amongst those who have made net zero pledges are Ford Motor Co. and American Airlines. Nebraska Public Power District also announced its goal of achieving net zero carbon emissions by 2050. Why should agriculture producers care about ESG? Many farmers may consider themselves environmentally conscience already. However, the agriculture sector is under greatest scrutiny of ESG ideologies. “Most farmers and most agricultural industries affect the climate in some way,” McPherrin said. The estimated global cost to feed humans is $3 trillion; this figure factors in emissions from methane, as well as usage of pesticides, fertilizers and fresh water, as published June 2, 2022, in an article titled “The overlooked giant in ESG conversation? Agriculture” by Michael Gilbert. Gilbert also states that 17% of greenhouse gas emissions have come from the agriculture sector in recent years. He gives producers the benefit of the doubt that “the growth of populations and corresponding scale of food demand have weighed heavily on the environment” but that farmers can tap into technology to increase productivity and reduce environmental impact. Those actually scoring ESG will likely not be as gracious to farmers as Gilbert. Who is involved in the ESG movement? ESG is driven by governmental entities, primarily international bodies, said McPherrin. Amongst those he mentioned were the United Nations, World Economic Forum, World Monetary Fund and World Bank. Multinational companies are emphasizing the perceived need for ESG, including BlackRock, Bank of America and JP Morgan. Moreover, McPherrin said the Biden Administration is a “proponent to promote ESG in the terms of some of the actions they have taken and some of their agencies,” including the Securities and Exchange Commission (SEC) and Office of the Comptroller of the Currency (OCC). “If they can all ally together in a global system that they are in control of, the opportunities for power and wealth accumulation are endless,” McPherrin said. Should ESG be viewed as a political or corporate issue? ESG is being portrayed as a partisan issue, further dividing the right and the left. The Planet Money podcast begins by criticizing Republican leaders for “increasingly pushing back against what they often call ‘woke investing.’” States such as Florida, West Virginia and Louisiana have recalled millions of dollars invested in BlackRock against the premise of ideological investing. To McPherrin, ESG is not a political issue. “It’s about freedom versus slavery to these big corporate regulatory authorities,” he said. Recently, a new policy for ESG was passed at the American Farm Bureau meetings held in January at Puerto Rico. McHargue said the policy reads: “The use of nonfinancial factors to evaluate investment opportunities and creditworthiness has proliferated in the recent years, the most recent form being environmental, social and governance (ESG) factors.” NEFB has been involved in conversations about ESG in Washington, D.C., and is working to prevent ESG from becoming governmental. Without clear objective standards, ESG regulations within the looming 2023 farm bill or federal financial regulations could be of concern. “As we look at farm bill payments and crop insurance payments, there is a real risk of onerous subjective ESG standards being put into that language,” McHargue said. Farmers and ranchers had a sneak peek on what a potential ESG regulation within the federal government would look like when the SEC introduced regulations to require companies to submit supply chain greenhouse gas emissions reports within their typical financial disclosure paperwork. “The SEC rule requiring publicly traded companies submit the greenhouse gas emissions totals of their supply chains, including agricultural products, would have made farmers and ranchers subject to new and complex reporting requirements and potential new liabilities,” said McHargue. How could markets be influenced by ESG? Because of its subjective and sometimes arbitrary nature, ESG adds uncertainty to the market. Nearly all sectors within agriculture utilize forward contracts, and McHargue is concerned about the implications of ESG within these contracts. “We want to ensure that those contracts are not dictated by subjective ESG standards that don’t have any domestic or global standards,” he said. In essence, the governing bodies who complete the scoring will dictate supply and demand. This is why the ESG movement could reshape global capitalism; it has the potential to control markets and consumer preference. “If you can force a company to stop producing products with negative impact on climate, you also impact demand for those products because people will naturally be forced to buy different things because of limited availability,” said McPherrin. Collins disagrees. She compares investing and consumer shopping selections to a potluck supper, where you can choose a different dish if you do not like another offered. “Like any market where there’s a lot of new products in a short period of time, it’s true that you need to read the label to see what you’re buying,” Collins said. She added that new products have sprung up as a result of ESG regulations. While Collins paints a picture of a free market with consumer choices, McPherrin relates a contrasting view of ESG for individuals. He explained that on an individual level, someone who buys steak at the grocery store would incur a “ding” on his or her personal ESG score, whereas purchasing an item rated at lower environmental impact would boost the score. A higher ESG score equals more purchasing power, even for individuals. But everything impacts the environment somehow, said McPherrin. Corn yields would be greatly impaired without nitrogen fertilizer, yet nitrogen levels in groundwater are a concern. Weeds would overtake fields without intervention, yet opponents demean herbicide use and carbon emissions from mechanical control. How could agriculture be affected by ESG regulations? If you are skeptic about the realities of ESG, observe the current Netherlands farm crisis. Agriculture producers across Germany, Italy and Poland are mandated to reduce carbon emissions by 30%. Kenneth Rapoza illustrates what could happen in the United States if the ESG movement continues in his article “The SEC’s climate proposal sets table for Netherlands-style farm crisis in the U.S.” published in Forbes on Aug. 1, 2022: If enacted, the rule would require big food companies like Tyson and Smithfield Foods, owned by China, and JBS and Marfrig, both Brazilian, to report to the SEC how their farmers are impacting the environment. In other words: didn’t reduce fertilizer by 30 percent, for example? Sorry, can’t buy your beef. Too many bovines releasing methane into the air? Need a smaller herd. No loans from Bank of America for you. And sorry, your beef is a climate risk according to ESG adherent Rabobank. That means Rabobank might not provide the big agriculture exporters with trade finance as punishment for not being ESG enough. With multiple industries under its umbrella, agriculture could become “one of the most powerful ESG investments in the world,” Rapoza stated. The regulating authorities have different targets within agriculture. The meat industry would likely be hurt the most, said McPherrin. The livestock industry would also fall victim to ESG ratings. Stories circulate about how feedlot producers are not being loaned money because of environmentally related ideologies. If you think this is only in other countries, McHargue has news for you. “My understanding is this is actually happening at some financial institutions that don’t understand agriculture,” he said. Small to mid-sized farms will also suffer greatly. As Rapoza wrote, family farms will be affected much more than “corporate-controlled industrial farms that many environmentalists have long opposed.” Part of the problem derives from the solution. In an effort to decrease inputs of water, fertilizers, pesticides and carbon emissions, farming methods are becoming more “sustainable” and, therefore, more reliant on technology. “Indeed, some of the most significant ESG-related gains are coming from integration of new technology—better data—into large-scale commercial farming,” Rapoza stated. This intensive use of technology will reveal areas where a farm or operation may be lacking in environmental sustainability. Sensors and record-keeping platforms will “definitively quantify” the ESG impact and report back to the regulating authorities. Small farms may not be able to stay afloat and will likely lose funding sources. What happens if an entity does not comply with ESG practices? One theme resonates throughout all the ESG articles, podcasts and interviews: pressure. Companies will be pressured into compliance. Wong mentioned “peer pressuring companies” in the Planet Money podcast. If a company resists pressure to the metric system, its score will be downgraded and capital or credit lost. How can companies—or farms or individuals—deflate this pressure? McPherrin said that there are very few options for businesses without risking loss of capital, but legal action can be taken. Foremost, farmers must speak to their representatives, he said. “Work at the local and state level to apply pressure against ESG,” recommends McPherrin. McHargue advises producers to be vigilant when entering any contract. “Be very careful when reading your contracts and financial disclosures,” said McHargue. “Look at the statements. If the language is in there, know at that point it may limit your operation from doing things, primarily in the livestock sector.” He added that you may want to reevaluate your financial institution. Will ESG overtake the agriculture industry? Agriculture is not immune to ESG and is more likely a target. All agricultural producers must be aware of ESG and its potential consequences for farming practices, marketing and technology integration. Fink himself said, “There is no company whose business model won’t be profoundly affected by the transition to a net zero company…companies that are not quickly preparing themselves will see their businesses and valuations suffer.” Be prepared for the imminent pressure from ESG on the agricultural industry. Instead of worrying about corporate America’s coercion, follow Fink’s other advice regarding ESG: “Every company and every industry will be transformed by the transition to a net zero world. The question is, will you lead, or will you be led?” Additional Resources: NEFB ESG Sustainability Policy Guide: https:\/\/www.nefb.org\/08\/10\/2022\/esg-sustainability-policy-guide\/ American Farm Bureau: https:\/\/www.fb.org\/market-intel\/overreach-of-sec-proposed-climate-rule-could-hurt-agriculture","filter_flag":1}
