{"title":"Soil and water supervisor rallies against reliance on synthetic chemicals in public parks - Port City Daily","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimAFodHRwczovL3BvcnRjaXR5ZGFpbHkuY29tL2xhdGVzdC1uZXdzLzIwMjMvMDcvMDIvc29pbC1hbmQtd2F0ZXItc3VwZXJ2aXNvci1wdXNoZXMtY2l0eS1jb3VudHktdG8tcmVkdWNlLXJlbGlhbmNlLW9uLXN5bnRoZXRpYy1jaGVtaWNhbHMtaW4tcHVibGljLXBhcmtzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimAFodHRwczovL3BvcnRjaXR5ZGFpbHkuY29tL2xhdGVzdC1uZXdzLzIwMjMvMDcvMDIvc29pbC1hbmQtd2F0ZXItc3VwZXJ2aXNvci1wdXNoZXMtY2l0eS1jb3VudHktdG8tcmVkdWNlLXJlbGlhbmNlLW9uLXN5bnRoZXRpYy1jaGVtaWNhbHMtaW4tcHVibGljLXBhcmtzL9IBAA?oc=5","id":"CBMimAFodHRwczovL3BvcnRjaXR5ZGFpbHkuY29tL2xhdGVzdC1uZXdzLzIwMjMvMDcvMDIvc29pbC1hbmQtd2F0ZXItc3VwZXJ2aXNvci1wdXNoZXMtY2l0eS1jb3VudHktdG8tcmVkdWNlLXJlbGlhbmNlLW9uLXN5bnRoZXRpYy1jaGVtaWNhbHMtaW4tcHVibGljLXBhcmtzL9IBAA","guidislink":false,"published":"Sun, 02 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=183, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimAFodHRwczovL3BvcnRjaXR5ZGFpbHkuY29tL2xhdGVzdC1uZXdzLzIwMjMvMDcvMDIvc29pbC1hbmQtd2F0ZXItc3VwZXJ2aXNvci1wdXNoZXMtY2l0eS1jb3VudHktdG8tcmVkdWNlLXJlbGlhbmNlLW9uLXN5bnRoZXRpYy1jaGVtaWNhbHMtaW4tcHVibGljLXBhcmtzL9IBAA?oc=5\" target=\"_blank\">Soil and water supervisor rallies against reliance on synthetic chemicals in public parks<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Port City Daily<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Soil and water supervisor rallies against reliance on synthetic chemicals in public parks - Port City Daily","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimAFodHRwczovL3BvcnRjaXR5ZGFpbHkuY29tL2xhdGVzdC1uZXdzLzIwMjMvMDcvMDIvc29pbC1hbmQtd2F0ZXItc3VwZXJ2aXNvci1wdXNoZXMtY2l0eS1jb3VudHktdG8tcmVkdWNlLXJlbGlhbmNlLW9uLXN5bnRoZXRpYy1jaGVtaWNhbHMtaW4tcHVibGljLXBhcmtzL9IBAA?oc=5\" target=\"_blank\">Soil and water supervisor rallies against reliance on synthetic chemicals in public parks<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Port City Daily<\/font>","source.href":"https:\/\/portcitydaily.com","source.title":"Port City Daily","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"A pilot project at Olsen Park is testing the efficiency of synthetic-free land care, as soil and water conservation district supervisor Evan Folds pushes the county and city to use green alternatives to chemical-based pesticides and herbicides. (Port City Daily\/Amy Passaretti Willis) NEW HANOVER COUNTY — A pilot project is underway at a jointly owned public park, with the hopes of phasing out toxic herbicides and pesticides. New Hanover County Soil and Water Conservation District supervisor Evan Folds launched a petition urging the city and county to reconsider its land-use care practices. Currently, they both use a variety of chemicals, including glyphosate, a controversial ingredient in Roundup; the federal government is still undergoing research to determine its level of toxicity. But Folds wants to see a policy that explains how and why staff use the chemicals they do. Deciphering information from purchase receipts via a public records request, Folds found 13 herbicides and pesticides the city uses routinely and more than 50 from the county. Almost all are revealed to be harmful to aquatic life, birds and bees; some go so far as being possibly carcinogenic by the EPA, such as bifenthrin and Chlorothalonil. A few don’t have enough health data available to know the true risks of exposure. Folds called the list “the worst of the worst,” and noted using man-made materials in natural systems leads to weakened ecosystems. This creates a cycle of having to use more chemicals to create a healthy landscape, he added. “We minimize the use of fungicides and insecticides and continue to research and explore possible ‘green’ products — but it’s important that they provide satisfactory results that are needed,” New Hanover County Parks and Recreation Director Tara Duckworth said. “There isn’t just one solution to the challenge of pesticides and insecticides and the needs of our parks, but we will continue to work with others — like our turf specialist with NC State — to assist us in ensuring we have expert knowledge in our processes.” Folds started an awareness campaign in February that has 165 signatures of support to build landscaping budgets around healthier practices. “The hope of the moment is to show brass tax, it’s not more expensive to do the right thing,” Folds told Port City Daily on a call Tuesday. In 2020, Folds sought a grant from Stonyfield Organics, which was accepted and approved by the city for $10,000 in May 2021. It helped implement an organic land management pilot project at Olsen Park, a 60-acre space owned by both the City of Wilmington and New Hanover County. Effectively, the goal is to use compost and avoid chemicals to grow the soil on two of Olsen Park’s five ballfields. City staff, along with consultants Beyond Pesticides and Osbourn Organics, will then compare results: the soil health on two softball fields for effectiveness of a synthetic-free program versus three fields that received the “traditional” method of landscape care. “We’re not trying to replace pesticides [with green alternatives] but mitigating the need for them over time,” Folds explained. Crews first gathered a baseline on the property being tested, with pictures and soil tests in 2022. The report was delivered to city staff in August 2022 and showed municipal fields are low in organic matter, according to city community services assistant director Sally Thigpen. The use of only organic methods on the two ballfields officially began in April 2023. “Anecdotally, staff are seeing similar turf performance as the other fields at this time,” Thigpen said. She also relayed the city’s consultants estimate it could take up to three years to build the organic matter in the soil and reap the benefits. The success rate cannot be visually perceived, Folds said; knowing if the program is working can only be derived from the health of soil — meaning more organic matter — not being exposed to toxic pesticides and herbicides. “We turn the herbicide pump off and weeds start growing in the ballfield, we think ‘it’s not working,’” Folds said. “But it’s how it’s supposed to work.” Part of the vision is phasing out pesticides and herbicides, such as 2,4-D, widely used and leads to severe eye irritation. It can also cause nervous system damage, coughing, dizziness, nausea, and blood, liver and kidney toxicity, according to the EPA. Dogs are more susceptible to side effects when exposed, including vomiting, lethargy, convulsions and diarrhea. The main aim for Folds is to establish a protocol for land care in the city and county. “It’s not about banning things,” he added. Except for maybe glyphosate — a common ingredient in Roundup — used by both the city and county. According to reports from the Centers for Disease Control and Prevention, the substance can now be found in 80% of urine samples of people nationwide. In 2020, the U.S. Environmental Protection Agency reported there were no health risks linked to glyphosate when used according to its label. Two years later, a federal court ordered the agency to reevaluate its findings. A judge determined the EPA did not have adequate research to back up its determination that glyphosate was not toxic and not a carcinogen. Research is still ongoing at this time. However, in 2015, the World Health Organization listed it as “a probable human carcinogen.” Glyphosate is particularly dangerous because it’s water soluble, meaning trace residues could occur in food products. Though the chemical is not often applied directly to crops being grown for human consumption. The city treats broadleaf weeds — such as poison ivy, invasive English ivy competing with native vegetation and nutsedge in ornamental landscapes — impacting infrastructure and public use areas, such as sidewalks and parks. “Targeted spot treatment is typical,” Thigpen said. “[Staff] are required to follow the product label for timing and rates.” According to Folds’ research, the city spent $7,652 on pesticides and herbicides from July 2019 to December 2020, with $644 of that on 16 gallons of glyphosate. In fiscal year 2022, the county budgeted $40,000 for chemicals and pesticides for the 2,900 acres of public space it manages. It uses glyphosate on landscape beds and sidewalk cracks but not on athletic turf fields. “The takeaway on cost is that once you sync on the reality of the chemicals being used and their connection to chronic disease, we don’t really spend enough on pesticides to be worried about the cost,” Folds said. As a separate initiative, he is partnering with Thigpen to find safe alternatives to glyphosate. “My aim is to ensure our decision makers are knowledgeable enough on the subject to make sure our priorities are in the right place,” Folds said. “How much is spraying poison on playgrounds worth?” He also said Thigpen was facing pushback about the price of switching from glyphosate. “She is facing the reality that the glyphosate replacement is ‘twice as much,’ and she has no budget to work with, and more critically, not enough staff to do things differently,” Folds said. Contact Organics, Folds’ recommended alternative, costs $175 per gallon versus a $40 2.5-gallon jug of Ranger Pro, containing glyphosate. Thigpen said, in general, the city follows Integrated Pest Management practices — supported by the EPA and USDA — and employs qualified, licensed applicators. They use “many tools” to tackle pests and weed pressures in public spaces, she said. “Herbicides are just one tool, and our team uses a whole host of cultural and mechanical practices, like mulching, mowing, hand weeding and planting native plants that are less susceptible to pests,” Thigpen explained. “The city does periodically test new products that could reduce impacts to the environment, the public and staff.” The county, co-owner of Olsen Park, is also actively following the outcomes of the pilot plan. Duckworth said the county will continue to work to “find a balance” between what is needed on public spaces — such as field recovery from high-demand usage, mitigating fire ants, and controlling invasive weeds — and the impact to the end user. A lifelong entrepreneur in natural approaches to lawn care and self-proclaimed “soil doctor,” Folds said he’s urging local leaders to think “critically” and outside the box. “We need to find a way to tell the larger story to get the city and county on board in the same direction,” he added. To assist with creating a more universal policy around natural land care, Folds recommends initiating a committee. “Given the potential complexity of the subject, I think the best way is a task force that can capture public and professional input into best practices for a comprehensive approach to sustainability,” he said. Tips or comments? Email amy@localdailymedia.com. Want to read more from PCD? Subscribe now and then sign up for our morning newsletter, Wilmington Wire, and get the headlines delivered to your inbox every morning.","filter_flag":1}
{"title":"Kohler Co. Outlines Strategy, Ambitions, and Progress in 2022 ESG Report - Contractor Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5jb250cmFjdG9ybWFnLmNvbS9iYXRoLWtpdGNoZW4vYXJ0aWNsZS8yMTI2OTU1MS9rb2hsZXItY28tb3V0bGluZXMtc3RyYXRlZ3ktYW1iaXRpb25zLWFuZC1wcm9ncmVzcy1pbi0yMDIyLWVzZy1yZXBvcnTSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5jb250cmFjdG9ybWFnLmNvbS9iYXRoLWtpdGNoZW4vYXJ0aWNsZS8yMTI2OTU1MS9rb2hsZXItY28tb3V0bGluZXMtc3RyYXRlZ3ktYW1iaXRpb25zLWFuZC1wcm9ncmVzcy1pbi0yMDIyLWVzZy1yZXBvcnTSAQA?oc=5","id":"CBMigQFodHRwczovL3d3dy5jb250cmFjdG9ybWFnLmNvbS9iYXRoLWtpdGNoZW4vYXJ0aWNsZS8yMTI2OTU1MS9rb2hsZXItY28tb3V0bGluZXMtc3RyYXRlZ3ktYW1iaXRpb25zLWFuZC1wcm9ncmVzcy1pbi0yMDIyLWVzZy1yZXBvcnTSAQA","guidislink":false,"published":"Thu, 13 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=194, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5jb250cmFjdG9ybWFnLmNvbS9iYXRoLWtpdGNoZW4vYXJ0aWNsZS8yMTI2OTU1MS9rb2hsZXItY28tb3V0bGluZXMtc3RyYXRlZ3ktYW1iaXRpb25zLWFuZC1wcm9ncmVzcy1pbi0yMDIyLWVzZy1yZXBvcnTSAQA?oc=5\" target=\"_blank\">Kohler Co. Outlines Strategy, Ambitions, and Progress in 2022 ESG Report<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Contractor Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Kohler Co. Outlines Strategy, Ambitions, and Progress in 2022 ESG Report - Contractor Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5jb250cmFjdG9ybWFnLmNvbS9iYXRoLWtpdGNoZW4vYXJ0aWNsZS8yMTI2OTU1MS9rb2hsZXItY28tb3V0bGluZXMtc3RyYXRlZ3ktYW1iaXRpb25zLWFuZC1wcm9ncmVzcy1pbi0yMDIyLWVzZy1yZXBvcnTSAQA?oc=5\" target=\"_blank\">Kohler Co. Outlines Strategy, Ambitions, and Progress in 2022 ESG Report<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Contractor Magazine<\/font>","source.href":"https:\/\/www.contractormag.com","source.title":"Contractor Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"KOHLER, WI – Kohler Co. released its 2022 Environmental, Social and Governance (ESG) report with key metrics of the company’s Believing in Better philosophy outlining ambitions and progress across environmental sustainability; diversity, equity and inclusion (DEI); and social impact initiatives. “Over the past year, we made substantial progress advancing Kohler’s environmental sustainability, DEI, and social impact strategies. We established targets for relevant Scope 3 emissions, conducted a climate risk assessment, and continued to innovate new products that conserve water and materials,” says David Kohler, Chair and CEO, Kohler Co. “We increased investment in Kohler WasteLAB to advance the company’s circularity strategy and acquired businesses like Heila Technologies and Curtis Instruments to strengthen our clean energy offerings.” In 2022, Kohler intensified the operationalization of its environmental practices around energy, water, and waste; continued to advance its diversity hiring; engaged more associates to give back to their communities; and expanded programs and partnerships that positively impact lives through arts, education, health, and wellbeing support. Highlights From the 2022 Report: GHG, water, and waste intensity reductions : Achieved 16% reduction in GHG emissions, 10 percent reduction for water, and 23 percent reduction in waste, respectively Global operational energy use intensity reduction : Saw a 41% reduction since 2008, an increase from 30 percent in 2021 Water savings and products : Contributed 88 billion gallons of water saved in 2022, and over 560 billion gallons saved since 2007, with Kohler WaterSense-labeled products Diverse hiring : Exceeded 2022 goal for diverse hiring with 53 percent of new hires, permanent and exempt, in the US representing diverse backgrounds Associate engagement: Hosted over 300 associate-led global community engagement activities, up from 80 in 2021, and increased the number of Business Resource Groups (BRGs) available to associates to 10 – including Bold Ability (creating a disability friendly workplace) and ARK (Asian Resources of Kohler) Lives impacted: Positively impacted over 1 million lives in 2022 and more than 17.1 million since 1990 through Kohler Safe Water for All, educational, and arts and industries programs Innovative, Inclusive, Sustainable “We’re proud of the progress we’ve made to bring more innovative, inclusive, and environmentally sustainable solutions to more people, in addition to providing safe water and sanitation for communities that lack equitable access,” says Laura Kohler, Chief Sustainability and DEI Officer. “Our passionate associates and leadership are integrating our Believing in Better philosophy into business strategies and operations which generates ideas and actions for improvement across the organization.” In 2022, Kohler also expanded its efforts to promote energy resiliency and resource conservation, as well as innovations in renewable and clean energy solutions. Kohler Kitchen and Bath continued to lead in U.S. EPA WaterSense-labeled offering by certifying 85 new products across toilets, bathroom faucets and showerheads. Continued expansion of global EPD and Declare label product transparency offerings. The company’s in house innovation incubator for products with a social purpose, Innovation for Good, launched a porcelain pour flush toilet (Kohler Rinse) for communities without access to piped water and electricity. Kohler’s subsidiary, Mira, launched HeatCapture™ which is a double wall stainless steel heat exchanger to help specifiers and new build developers in the UK comply with new reduced emissions regulations. Meanwhile, Kohler’s Clarke Energy was part of a consortium that won the 2022 Water Breakthrough Challenge sponsored by Ofwat to support the demonstration of an innovative carbon capture and conversion system at the Severn Trent wastewater treatment site in England. Additionally, Kohler partnered with Polar explorer Robert Swan on his excursion through Antarctica to the Geographic South Pole where he relied only on renewable energy sources. Kohler equipped him with a customized KOHLER generator that utilized a KOHLER diesel engine fueled by hydrotreated vegetable oil (HVO). The off-grid sustainable system provided the energy needed to operate Swan's base camp and provide battery charge to his mobile equipment. To read more on Kohler’s progress and impact, you can access the 2022 ESG Report here: https:\/\/www.kohlercompany.com\/social-impact\/believing-in-better\/","filter_flag":1}
{"title":"'You don't have to be an activist': Here's how your simple actions can help protect the Earth - The Economic Times","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbmV3cy9ob3ctdG8veW91LWRvbnQtaGF2ZS10by1iZS1hbi1hY3RpdmlzdC1oZXJlcy1ob3cteW91ci1zaW1wbGUtYWN0aW9ucy1jYW4taGVscC1wcm90ZWN0LXRoZS1lYXJ0aC9hcnRpY2xlc2hvdy8xMDIxNDIyNDIuY21z0gGeAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9uZXdzL2hvdy10by95b3UtZG9udC1oYXZlLXRvLWJlLWFuLWFjdGl2aXN0LWhlcmVzLWhvdy15b3VyLXNpbXBsZS1hY3Rpb25zLWNhbi1oZWxwLXByb3RlY3QtdGhlLWVhcnRoL2FtcF9hcnRpY2xlc2hvdy8xMDIxNDIyNDIuY21z?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbmV3cy9ob3ctdG8veW91LWRvbnQtaGF2ZS10by1iZS1hbi1hY3RpdmlzdC1oZXJlcy1ob3cteW91ci1zaW1wbGUtYWN0aW9ucy1jYW4taGVscC1wcm90ZWN0LXRoZS1lYXJ0aC9hcnRpY2xlc2hvdy8xMDIxNDIyNDIuY21z0gGeAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9uZXdzL2hvdy10by95b3UtZG9udC1oYXZlLXRvLWJlLWFuLWFjdGl2aXN0LWhlcmVzLWhvdy15b3VyLXNpbXBsZS1hY3Rpb25zLWNhbi1oZWxwLXByb3RlY3QtdGhlLWVhcnRoL2FtcF9hcnRpY2xlc2hvdy8xMDIxNDIyNDIuY21z?oc=5","id":"CBMimgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbmV3cy9ob3ctdG8veW91LWRvbnQtaGF2ZS10by1iZS1hbi1hY3RpdmlzdC1oZXJlcy1ob3cteW91ci1zaW1wbGUtYWN0aW9ucy1jYW4taGVscC1wcm90ZWN0LXRoZS1lYXJ0aC9hcnRpY2xlc2hvdy8xMDIxNDIyNDIuY21z0gGeAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9uZXdzL2hvdy10by95b3UtZG9udC1oYXZlLXRvLWJlLWFuLWFjdGl2aXN0LWhlcmVzLWhvdy15b3VyLXNpbXBsZS1hY3Rpb25zLWNhbi1oZWxwLXByb3RlY3QtdGhlLWVhcnRoL2FtcF9hcnRpY2xlc2hvdy8xMDIxNDIyNDIuY21z","guidislink":false,"published":"Wed, 26 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=207, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbmV3cy9ob3ctdG8veW91LWRvbnQtaGF2ZS10by1iZS1hbi1hY3RpdmlzdC1oZXJlcy1ob3cteW91ci1zaW1wbGUtYWN0aW9ucy1jYW4taGVscC1wcm90ZWN0LXRoZS1lYXJ0aC9hcnRpY2xlc2hvdy8xMDIxNDIyNDIuY21z0gGeAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9uZXdzL2hvdy10by95b3UtZG9udC1oYXZlLXRvLWJlLWFuLWFjdGl2aXN0LWhlcmVzLWhvdy15b3VyLXNpbXBsZS1hY3Rpb25zLWNhbi1oZWxwLXByb3RlY3QtdGhlLWVhcnRoL2FtcF9hcnRpY2xlc2hvdy8xMDIxNDIyNDIuY21z?oc=5\" target=\"_blank\">'You don't have to be an activist': Here's how your simple actions can help protect the Earth<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Economic Times<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"'You don't have to be an activist': Here's how your simple actions can help protect the Earth - The Economic Times","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbmV3cy9ob3ctdG8veW91LWRvbnQtaGF2ZS10by1iZS1hbi1hY3RpdmlzdC1oZXJlcy1ob3cteW91ci1zaW1wbGUtYWN0aW9ucy1jYW4taGVscC1wcm90ZWN0LXRoZS1lYXJ0aC9hcnRpY2xlc2hvdy8xMDIxNDIyNDIuY21z0gGeAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9uZXdzL2hvdy10by95b3UtZG9udC1oYXZlLXRvLWJlLWFuLWFjdGl2aXN0LWhlcmVzLWhvdy15b3VyLXNpbXBsZS1hY3Rpb25zLWNhbi1oZWxwLXByb3RlY3QtdGhlLWVhcnRoL2FtcF9hcnRpY2xlc2hvdy8xMDIxNDIyNDIuY21z?oc=5\" target=\"_blank\">'You don't have to be an activist': Here's how your simple actions can help protect the Earth<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Economic Times<\/font>","source.href":"https:\/\/m.economictimes.com","source.title":"The Economic Times","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-07-01+before:2023-07-31","text":" (You can now subscribe to our (You can now subscribe to our Economic Times WhatsApp channel The health and sustainability of our planet, Earth , is in danger due to human activities. Numerous human-produced challanges like climate change , pollution, deforestation, and resource depletion are posing a serious threat to the delicate balance of nature.The current heat waves across the globe are an indicator of what's wrong with the planet and what worse can happen in future. Researchers have warned that the deadly hot spells in the American Southwest and Southern Europe could not have happened without the continuing buildup of warming gases in the air.Amidst these critical problem that can threaten the very survival of human beings, it's crucial to recognize that individuals can make a substantial impact when they adopt environmentally conscious habits and make eco-friendly choices.“You don't have to become an activist to mitigate the ill effects of climate changes. We can achieve that the simple actions by every individual. The climate emergency warrants action by every single individual. The actions of every single individual matter and can make a difference when it comes to avert the challenge of climate change. Everyone should take charge of the carbon emissions they are responsible for and actively works towards mitigating them,” said, GS Jaisal, Global Head of Government & Corporate Affairs, Save Earth Mission With efforts of every individual we can limit or slow down the harmful effects on our planet. If you also always think of contributing to Earth conservation but don't know where to start, here are some simple actions that can help protect the Earth without burdening our daily lives.The timeless mantra of \"Reduce, Reuse, Recycle\" holds true today more than ever. Embracing waste reduction by opting for products with minimal packaging and avoiding single-use items is a step in the right direction. Choose reusable water bottles, coffee cups, and shopping bags to reduce plastic waste. Don't forget to recycle materials like paper, glass, and plastic to conserve resources and prevent them from polluting oceans or ending up in landfills.“There is a need to adopt a plastic-free lifestyle and work towards decarbonising our future. As an individual and dedicated efforts by civil society we can conserve our environment. As part of a global community of over 10 million people in 68 countries, we are proud of our efforts for environment conservation,” said Sandeep Choudhary, Global Founder, Save Earth Mission said..Water, being a precious resource, requires careful conservation for the health of our planet. Simple actions such as fixing leaky faucets, using a broom instead of a hose for outdoor cleaning, and installing water-saving showerheads can significantly reduce water consumption. Additionally, practicing mindfulness in everyday tasks like washing dishes or brushing teeth can help in water conservation.The transportation sector contributes significantly to greenhouse gas emissions. Whenever possible, consider eco-friendly alternatives like walking, cycling, carpooling, or using public transportation. With electric vehicles becoming more accessible, making the switch to zero-emission vehicles can greatly reduce your carbon footprint.Transitioning to renewable energy sources like solar, wind, and hydroelectric power plays a vital role in reducing greenhouse gas emissions. If feasible, think about installing solar panels on your property or supporting local and national efforts to invest in renewable energy infrastructure.Mindful purchasing choices can have a positive impact on the environment. Opt for products made from sustainable materials and support businesses that prioritize eco-friendly practices and ethical sourcing. Participating in clothing swaps or buying second-hand items can help reduce the demand for new products and limit waste generation.Trees serve as natural carbon sinks, absorbing carbon dioxide from the atmosphere. Engage in tree-planting initiatives or support organizations focusing on reforestation efforts. Additionally, advocate for the preservation of green spaces in your community, as they provide crucial habitats for wildlife and contribute to cleaner air.Reducing energy consumption is essential in minimizing environmental impact. Utilize energy-efficient appliances, turn off lights when not in use, and ensure proper home insulation. Simple actions like adjusting your thermostat and utilizing natural light can lead to significant energy savings over time.The earth is the only home we have and we must do everything in our power to save it. “There is an important need for collective action to safeguard the planet. There is only one way to address the unprecedented environmental challenges, and that is through community efforts. Everyone needs to come together and work together to protect planet Earth and ensure it can sustain humans and other life forms,” Amit Tiwari, Global Admin Head, Save Earth Mission, said.Protecting the Earth is a collective responsibility that extends beyond governments and large corporations. Each individual possesses the power to effect positive change through daily actions. By incorporating simple, eco-friendly habits into our lives, we can work together towards a more sustainable and thriving planet. Remember that even small contributions, when multiplied globally, can create a significant impact. Let us unite to safeguard the Earth for future generations and foster a healthier and more resilient world.","filter_flag":1}
{"title":"NextGen Summit 2023 to strategize on R&D, Green Chemistry, and Sustainability Goals - Indian Chemical News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5pbmRpYW5jaGVtaWNhbG5ld3MuY29tL3N1c3RhaW5hYmlsaXR5L25leHRnZW4tc3VtbWl0LTIwMjMtdG8tc3RyYXRlZ2l6ZS1vbi1yZC1ncmVlbi1jaGVtaXN0cnktYW5kLXN1c3RhaW5hYmlsaXR5LWdvYWxzLTE4MTA40gGNAWh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vc3VzdGFpbmFiaWxpdHkvbGl0ZS9uZXh0Z2VuLXN1bW1pdC0yMDIzLXRvLXN0cmF0ZWdpemUtb24tcmQtZ3JlZW4tY2hlbWlzdHJ5LWFuZC1zdXN0YWluYWJpbGl0eS1nb2Fscy0xODEwOA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5pbmRpYW5jaGVtaWNhbG5ld3MuY29tL3N1c3RhaW5hYmlsaXR5L25leHRnZW4tc3VtbWl0LTIwMjMtdG8tc3RyYXRlZ2l6ZS1vbi1yZC1ncmVlbi1jaGVtaXN0cnktYW5kLXN1c3RhaW5hYmlsaXR5LWdvYWxzLTE4MTA40gGNAWh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vc3VzdGFpbmFiaWxpdHkvbGl0ZS9uZXh0Z2VuLXN1bW1pdC0yMDIzLXRvLXN0cmF0ZWdpemUtb24tcmQtZ3JlZW4tY2hlbWlzdHJ5LWFuZC1zdXN0YWluYWJpbGl0eS1nb2Fscy0xODEwOA?oc=5","id":"CBMiiAFodHRwczovL3d3dy5pbmRpYW5jaGVtaWNhbG5ld3MuY29tL3N1c3RhaW5hYmlsaXR5L25leHRnZW4tc3VtbWl0LTIwMjMtdG8tc3RyYXRlZ2l6ZS1vbi1yZC1ncmVlbi1jaGVtaXN0cnktYW5kLXN1c3RhaW5hYmlsaXR5LWdvYWxzLTE4MTA40gGNAWh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vc3VzdGFpbmFiaWxpdHkvbGl0ZS9uZXh0Z2VuLXN1bW1pdC0yMDIzLXRvLXN0cmF0ZWdpemUtb24tcmQtZ3JlZW4tY2hlbWlzdHJ5LWFuZC1zdXN0YWluYWJpbGl0eS1nb2Fscy0xODEwOA","guidislink":false,"published":"Mon, 10 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=191, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5pbmRpYW5jaGVtaWNhbG5ld3MuY29tL3N1c3RhaW5hYmlsaXR5L25leHRnZW4tc3VtbWl0LTIwMjMtdG8tc3RyYXRlZ2l6ZS1vbi1yZC1ncmVlbi1jaGVtaXN0cnktYW5kLXN1c3RhaW5hYmlsaXR5LWdvYWxzLTE4MTA40gGNAWh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vc3VzdGFpbmFiaWxpdHkvbGl0ZS9uZXh0Z2VuLXN1bW1pdC0yMDIzLXRvLXN0cmF0ZWdpemUtb24tcmQtZ3JlZW4tY2hlbWlzdHJ5LWFuZC1zdXN0YWluYWJpbGl0eS1nb2Fscy0xODEwOA?oc=5\" target=\"_blank\">NextGen Summit 2023 to strategize on R&amp;D, Green Chemistry, and Sustainability Goals<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Chemical News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"NextGen Summit 2023 to strategize on R&D, Green Chemistry, and Sustainability Goals - Indian Chemical News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5pbmRpYW5jaGVtaWNhbG5ld3MuY29tL3N1c3RhaW5hYmlsaXR5L25leHRnZW4tc3VtbWl0LTIwMjMtdG8tc3RyYXRlZ2l6ZS1vbi1yZC1ncmVlbi1jaGVtaXN0cnktYW5kLXN1c3RhaW5hYmlsaXR5LWdvYWxzLTE4MTA40gGNAWh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vc3VzdGFpbmFiaWxpdHkvbGl0ZS9uZXh0Z2VuLXN1bW1pdC0yMDIzLXRvLXN0cmF0ZWdpemUtb24tcmQtZ3JlZW4tY2hlbWlzdHJ5LWFuZC1zdXN0YWluYWJpbGl0eS1nb2Fscy0xODEwOA?oc=5\" target=\"_blank\">NextGen Summit 2023 to strategize on R&amp;D, Green Chemistry, and Sustainability Goals<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Chemical News<\/font>","source.href":"https:\/\/www.indianchemicalnews.com","source.title":"Indian Chemical News","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Indian Chemical News (ICN) is organising a Session on R&D, Green Chemistry, and Sustainability Goals during its Third Edition of the NextGen Chemicals & Petrochemicals Summit on July 13-14, 2023 at Hotel Novotel, Mumbai International Airport, Mumbai. The main theme of the Summit is \"Innovation, Self-reliance & Sustainability”. The panel discussion on R&D, Green Chemistry, and Sustainability Goals session will be held on July 14, 2023. Rupark Sarswat, CEO, India Glycols is the Moderator for the session and the Speakers are: Pavneet S. Mumick, Global Vice President, Technology & Innovation, Huntsman Corporation; Belur Krishnamurthy Sethuram, Managing Director, Celanese India; Dr. Mayukh G. Warawdekar, Vice President, Fine Organic Industries; Dr. Alok Khullar, Vice President - R&D, Hindusthan Speciality Chemicals; Dr. Sanjay P. Kamble, Senior Principal Scientist, CSIR-NCL; and Dr. Ashvini Shete, Senior Scientist, Praj Matrix. R&D (Research & Development) is a vital component of any company's growth and success. It involves the identification and creation of new products or processes that can drive innovation and profitability. Many companies today focus their R&D efforts on achieving sustainable development goals, such as sustainable products, reducing greenhouse gas emissions, water conservation, reducing waste, and deploying renewable energy. Green chemistry is a key part of the sustainability journey for chemical industries. It aims to reduce chemical related impact on human health and virtually eliminate contamination of the environment through dedicated and sustainable prevention measures. One of the key components of Green Chemistry is Environment Technology, also referred to as `green’ or `clean’ technology and it aims to conserve, monitor and reduce the negative impact of technology on the environment and the consumption of resources. Sustainable chemistry cannot be conducted in the absence of green chemistry, and it focuses on utilizing more environmentally friendly production methods and materials. The use of green chemistry can decrease the reliance on non-renewable resources and reduce emissions of pollutants and hazardous waste. Overall, R&D, green chemistry, and sustainability goals are interconnected and crucial for businesses and society to achieve long-term success while preserving the environment. A collaborative effort by industry, academia, and government is needed to promote the adoption of the green chemistry technologies necessary to achieve a sustainable society. Key discussion points during panel discussion are: Green chemistry and technology; Emphasis on sustainable product portfolio; Green separation techniques; Waste management and recycling; CO2 capture, storage, and utilization; Green solvents for energy conversion; Cleaner production and green nanotechnologies; and Future challenges in green chemistry and engineering.","filter_flag":1}
{"title":"Retail India News: Farmley Unveils ‘Healthy Ko Rakhe Healthy’ Campaign with Rahul Dravid - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3JldGFpbC1pbmRpYS1uZXdzLWZhcm1sZXktdW52ZWlscy1oZWFsdGh5LWtvLXJha2hlLWhlYWx0aHktY2FtcGFpZ24tcmFodWwtZHJhdmlk0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3JldGFpbC1pbmRpYS1uZXdzLWZhcm1sZXktdW52ZWlscy1oZWFsdGh5LWtvLXJha2hlLWhlYWx0aHktY2FtcGFpZ24tcmFodWwtZHJhdmlk0gEA?oc=5","id":"CBMidGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3JldGFpbC1pbmRpYS1uZXdzLWZhcm1sZXktdW52ZWlscy1oZWFsdGh5LWtvLXJha2hlLWhlYWx0aHktY2FtcGFpZ24tcmFodWwtZHJhdmlk0gEA","guidislink":false,"published":"Thu, 20 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=201, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3JldGFpbC1pbmRpYS1uZXdzLWZhcm1sZXktdW52ZWlscy1oZWFsdGh5LWtvLXJha2hlLWhlYWx0aHktY2FtcGFpZ24tcmFodWwtZHJhdmlk0gEA?oc=5\" target=\"_blank\">Retail India News: Farmley Unveils ‘Healthy Ko Rakhe Healthy’ Campaign with Rahul Dravid<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Retail India News: Farmley Unveils ‘Healthy Ko Rakhe Healthy’ Campaign with Rahul Dravid - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3JldGFpbC1pbmRpYS1uZXdzLWZhcm1sZXktdW52ZWlscy1oZWFsdGh5LWtvLXJha2hlLWhlYWx0aHktY2FtcGFpZ24tcmFodWwtZHJhdmlk0gEA?oc=5\" target=\"_blank\">Retail India News: Farmley Unveils ‘Healthy Ko Rakhe Healthy’ Campaign with Rahul Dravid<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Retail India News: Juicy Chemistry and Mommy Shots by Amrita Unveil 'Scars are Beautiful' In honor of Women’s Day, Juicy Chemistry and Mommy Shots by Amrita join forces for the 'Scars are Beautiful' campaign, shedding light on the beauty of postpartum bodies and stretch marks. The campaign, launched on March 5th, 2024, features 11 mothers proudly displaying their bodies and sharing their motherhood experiences to inspire other women to embrace their bodies and change societal perceptions. Era Vashishta, mother of a 2.5-year-old shares her story “ I was diagnosed with chronic PCOD when I was 28, which got me very scared as to whether or not I would ever get pregnant or have a baby. I never thought of motherhood before this. Because of the PCOD it made me want to be a mom, because I thought maybe I might not happen. After which, I became a mom and everything changed. As soon as I met my baby that’s when I knew this is someone I want to protect for the rest of my life, the love is unconditional. It was so scary and overwhelming, but once you hang on to all these feelings you wouldn’t have it any other way, I’d never not want to be a mom. My scars are my tiger stripes, because I think I draw a lot of power from them. I’m a mom and this body gave birth to a life, which is what makes me bigger, it makes me a tiger.” Megha Asher, the Co-Founder and COO of Juicy Chemistry said, “At Juicy Chemistry, we believe in promoting self-love and body positivity, and we are thrilled to partner with Mommy Shots for this unique campaign. Through this powerful photo series, we hope to inspire and empower women to embrace their bodies, and scars not just physical but emotional ones as well, and celebrate their unique journeys of motherhood. As mothers ourselves, we understand the challenges that come with motherhood and the impact it can have on a woman's body and self-perception. We hope that this campaign will help shift the narrative and encourage women to see their bodies as beautiful and strong, no matter their shape or size. Together, we can create a more inclusive and diverse representation of beauty and promote self-love and acceptance for all women.\" Amrita Samant, Founder and CEO Mommyshots said, “In my world of photography, motherhood, babies and art, creating something meaningful that helps change the world obsessed with perfection was very close to my heart. We want to redefine beauty with every line and every scar that spells resilience strength and a unique journey, we want to go beyond the surface with this campaign. They’re more than blemishes, they’re badges of honor, they are tender and timeliness. I am super proud of the 11 women who came forward to normalize what the society has for far too long considered unsightly.” Sonia Chandrakumar, one of the 11 mothers who posed and actively participated in the shoot said, “The journey of motherhood is very different for me, I had a really tough time the first 6 months. I had all kinds of nausea, I could not brush my teeth and I had a lot of body changes that took place. My husband was my greatest support because he constantly reminded me that there’s something beautiful coming out of this and if you want something beautiful in life you need to cope with the changes that take place in your body or yourself. So I kept reminding myself and dealing with the challenges. I’d describe my marks as Caleb’s wonderful art palette that I have around my stomach. I would not want to get rid of my marks, I want to keep it as a memory.” Motherhood scars, resembling intricate battle scars, symbolize the strength and resilience embedded in a woman's journey. Each mark narrates a story of endurance and courage, celebrating the remarkable strength of women. In honoring these scars, we acknowledge the transformative power of motherhood, inspiring women to embrace their bodies and celebrate their unique journeys. #scarsarebeautiful ","filter_flag":1}
{"title":"Hindustan Unilever: Empowering Consumers For 90 Years - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi9idXNpbmVzcy9oaW5kdXN0YW4tdW5pbGV2ZXItZW1wb3dlcmluZy1jb25zdW1lcnMtZm9yLTkwLXllYXJzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi9idXNpbmVzcy9oaW5kdXN0YW4tdW5pbGV2ZXItZW1wb3dlcmluZy1jb25zdW1lcnMtZm9yLTkwLXllYXJzL9IBAA?oc=5","id":"CBMiWmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi9idXNpbmVzcy9oaW5kdXN0YW4tdW5pbGV2ZXItZW1wb3dlcmluZy1jb25zdW1lcnMtZm9yLTkwLXllYXJzL9IBAA","guidislink":false,"published":"Sat, 01 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=182, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi9idXNpbmVzcy9oaW5kdXN0YW4tdW5pbGV2ZXItZW1wb3dlcmluZy1jb25zdW1lcnMtZm9yLTkwLXllYXJzL9IBAA?oc=5\" target=\"_blank\">Hindustan Unilever: Empowering Consumers For 90 Years<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Hindustan Unilever: Empowering Consumers For 90 Years - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi9idXNpbmVzcy9oaW5kdXN0YW4tdW5pbGV2ZXItZW1wb3dlcmluZy1jb25zdW1lcnMtZm9yLTkwLXllYXJzL9IBAA?oc=5\" target=\"_blank\">Hindustan Unilever: Empowering Consumers For 90 Years<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Hindustan Unilever Limited (HUL) is a renowned Indian consumer goods company that has left an indelible mark on the country’s economic landscape. With a history spanning over eight decades, HUL has firmly established itself as a leader in the fast-moving consumer goods (FMCG) sector, offering a diverse range of products that touch the lives of millions of Indians every day. From soaps and detergents to personal care items and packaged foods, HUL’s portfolio encompasses an extensive array of well-known and trusted brands. Founded in 1933, HUL has continually evolved and adapted to changing consumer needs, market dynamics, and societal trends. The company’s unwavering commitment to innovation, quality, and sustainability has been the cornerstone of its success. As a subsidiary of the global consumer goods giant, Unilever, HUL combines the strength of a multinational corporation with a deep understanding of the local Indian market, allowing it to cater to the unique preferences and demands of Indian consumers. HUL’s journey began with a focus on manufacturing and selling Vanaspati, or vegetable oil, under the name Hindustan Vanaspati Manufacturing Company. However, the company soon diversified its product range to meet the evolving needs of Indian households. Over the years, HUL has introduced numerous iconic brands that have become household names, synonymous with quality and trust. Lux, Lifebuoy, Dove, Sunsilk, Surf Excel, Rin, Pepsodent, and Knorr are just a few examples of HUL’s widely recognized brands. Beyond its commitment to providing high-quality products, HUL also places great emphasis on sustainable and responsible business practices. The company actively engages in initiatives aimed at environmental conservation, community development, and improving the livelihoods of marginalized communities. HUL’s initiatives in water conservation, sanitation, and rural development have garnered widespread acclaim and reflect its dedication to being a responsible corporate citizen. As HUL continues to innovate, expand its product offerings, and explore new market opportunities, it remains deeply rooted in its mission of making sustainable living commonplace. With a focus on customer-centricity, HUL strives to deliver products that enhance the well-being and quality of life for consumers across the country. Through its continued growth and impactful initiatives, Hindustan Unilever remains at the forefront of the FMCG industry in India, embodying a legacy of excellence, innovation, and social responsibility. Foundation and Founders: Hindustan Unilever Limited (HUL) traces its roots back to the summer of 1888 when crates filled with Sunlight soap bars arrived at the Kolkata harbor. These bars, proudly bearing the inscription ‘Made in England by Lever Brothers,’ marked the beginning of a new era in the marketing of branded Fast Moving Consumer Goods (FMCG). This marked the entry of Lever Brothers, the founders of HUL, into the Indian market. Following the success of Sunlight soap, Lever Brothers introduced other iconic brands like Lifebuoy in 1895, Pears, Lux, and Vim. The launch of Vanaspati in 1918 and the introduction of the renowned Dalda brand in 1937 further solidified the company’s position in the Indian market. In 1931, Unilever, the global consumer goods powerhouse, established its first subsidiary in India called Hindustan Vanaspati Manufacturing Company. Lever Brothers India Limited was formed in 1933, followed by United Traders Limited in 1935. The three companies merged in November 1956 to create Hindustan Unilever Limited (HUL). Notably, HUL became the first foreign subsidiary to offer 10% of its equity to the Indian public. Unilever currently holds 52.10% equity in HUL, while the remaining shares are distributed among approximately 360,675 individual shareholders and financial institutions. This strategic merger and the subsequent public offering cemented HUL’s position as a critical player in the Indian FMCG sector, the stage for its remarkable growth and success in the years to come. 2. Early Years and Initial Products: During its early years, Hindustan Unilever, initially known as Hindustan Vanaspati Manufacturing Company, focused on manufacturing and selling Vanaspati, a vegetable oil product. However, the company quickly expanded its product range to include a diverse array of consumer goods, such as soaps, detergents, personal care products, and packaged foods. The objective behind starting this business was to meet the growing demands of Indian households and improve the quality of life for consumers. Hindustan Unilever aimed to provide high-quality products that would enhance hygiene standards and cater to the evolving needs of Indian consumers. The founders, Lever Brothers and the Tata Group envisioned a business that would not only contribute to the economic development of the country but also have a positive social impact. By diversifying its product portfolio, Hindustan Unilever aimed to establish a strong foundation for future growth and become a trusted brand in the Indian market. The company sought to offer products that would bring convenience, cleanliness, and well-being to consumers’ lives, thereby creating a lasting impact on Indian households. This objective has remained central to Hindustan Unilever’s business philosophy throughout its journey of over nine decades. 3. Early Hindrances and Challenges: During its early years, Hindustan Unilever faced several hindrances and challenges that tested the company’s resilience. One of the primary obstacles was the competitive market landscape. The consumer goods industry in India was already saturated with established players, making it difficult for a new entrant like Hindustan Unilever to carve out a space for itself. The company had to differentiate its products and build brand awareness among consumers to gain a competitive edge. Another significant challenge came in the form of establishing trust and credibility. Hindustan Unilever was an unfamiliar name in the Indian market, and consumers hesitated to switch from traditional products to those offered by the company. Overcoming this skepticism required consistent efforts in quality assurance, extensive marketing, and targeted promotional campaigns. Furthermore, the company had to navigate through the turbulent period of World War II, which significantly impacted business operations. Resources were scarce, and sourcing raw materials became a formidable challenge. The war disrupted supply chains and distribution networks, leading to production constraints and difficulties in reaching consumers. However, despite these obstacles, Hindustan Unilever managed to adapt and find innovative solutions to ensure continuity and meet the evolving needs of its customers. 4. Current Ownership and Name: Hindustan Unilever Limited (HUL) is currently majority-owned by Unilever, a global consumer goods company. Unilever acquired a controlling stake in HUL in the 1950s and has been instrumental in the company’s growth and success. Under Unilever’s ownership, HUL has expanded its product portfolio, strengthened its market presence, and continued to deliver value to its consumers. At the helm of HUL’s leadership, Nitin Paranjpe serves as the Non-Executive Chairman, providing strategic guidance and oversight to the company. With his wealth of experience and industry knowledge, Paranjpe contributes to shaping HUL’s long-term vision and objectives. Sanjiv Mehta has been the CEO and Managing Director of HUL, responsible for driving the company’s growth, implementing key strategies, and leading its day-to-day operations. Mehta has played a crucial role in steering HUL towards sustained success, fostering innovation, and strengthening the company’s position in the market. Furthermore, effective from June 27, 2023, Rohit Jawa will take over as the new CEO and Managing Director of HUL. Jawa’s appointment brings fresh perspectives and expertise to lead the company into its next phase of growth. With a focus on leveraging digital technologies and embracing emerging trends, Jawa aims to further enhance HUL’s competitiveness and market leadership. The seamless transition in leadership from Sanjiv Mehta to Rohit Jawa signifies HUL’s commitment to continuity and sustained excellence in its operations. As HUL continues to thrive under their guidance, the company remains dedicated to delivering high-quality products and driving positive change in the consumer goods industry. 5. Products and Services: Hindustan Unilever offers a wide range of products and services that cater to the diverse needs of consumers across various categories. Under the umbrella of Hindustan Unilever, numerous renowned brands operate in different sectors, ensuring consumers access to high-quality and reliable products. In the beauty and wellbeing category, Hindustan Unilever boasts brands such as Clinic Plus, Dove, Elle 18, Lakme, Pond’s, Pepsodent, Sunsilk, Tresemme, Vaseline, and many more. These brands provide a comprehensive range of beauty and personal care products, including shampoos, conditioners, skincare solutions, hair care products, and oral care items. In the personal care segment, Hindustan Unilever offers popular brands like Axe, Close Up, Lux, Lifebuoy, Rexona, Pears, and more. These brands focus on personal hygiene and provide products such as soaps, shower gels, deodorants, and toothpaste, catering to different consumer preferences and needs. Hindustan Unilever’s home care category comprises brands like Surf Excel, Sunlight, Rin, Vim, Domex, and others. These brands offer a range of home cleaning solutions, laundry detergents, dishwashing products, and surface cleaners, ensuring household cleanliness and hygiene. When it comes to nutrition, Hindustan Unilever provides popular brands such as Horlicks, Hellmann’s, Bru, Kissan, Lipton, Knorr, and more. These brands offer a variety of food and beverage options, including health drinks, sauces, soups, tea, coffee, and culinary products, catering to the nutritional needs and tastes of consumers. In addition to the above categories, Hindustan Unilever also has a presence in the ice cream sector with brands like Cornetto, Kwality Wall’s, and Magnum. These brands offer a delightful assortment of ice cream products, including cones, sticks, and tubs, providing a refreshing indulgence for consumers. Through its diverse portfolio of products and brands, Hindustan Unilever ensures that consumers can access a wide range of choices in beauty and wellbeing, personal care, home care, nutrition, and ice cream. These brands exemplify Hindustan Unilever’s commitment to delivering high-quality products that enhance consumers’ lives and cater to their evolving needs. 6. Expansion into Global Markets: Hindustan Unilever Limited (HUL) has emerged as a global force, expanding its operations beyond the borders of India to become a significant player in the worldwide consumer goods market. With a relentless focus on innovation, quality, and consumer satisfaction, HUL has penetrated over 190 countries, establishing a formidable presence worldwide. Driven by its commitment to meeting diverse consumer needs, HUL strategically entered international markets, leveraging its substantial brand equity and deep understanding of consumer preferences. By adapting its product offerings to local tastes and preferences, HUL has established a strong foothold in various regions across the globe. The company’s expansion into international markets has not only allowed it to tap into new consumer segments but also provided an opportunity for cross-cultural exchange and learning. HUL’s global operations encompass many markets, including neighboring South Asian countries, Africa, the Middle East, and Southeast Asia. Through its global expansion, HUL has been able to showcase the adaptability and relevance of its product portfolio in diverse markets. By localizing its offerings while maintaining the high standards of quality and innovation, HUL has successfully gained the trust and loyalty of consumers worldwide. As HUL continues to expand its global footprint, it remains committed to its core values and principles. The company’s global presence not only contributes to its own growth and profitability but also strengthens its position as a leading player in the global consumer goods industry. With its widespread reach and unwavering dedication to excellence, Hindustan Unilever is poised to continue making a significant impact on the lives of consumers around the world. 7. Key Performance Indicators (KPIs): Key Performance Indicators (KPIs) play a crucial role in assessing the performance and success of a company like Hindustan Unilever. Here are five key KPIs that are instrumental in measuring the company’s performance: Revenue Growth: Revenue growth is a fundamental KPI for Hindustan Unilever, reflecting the company’s ability to generate increased sales and expand its market share. Consistent and sustainable revenue growth indicates the company’s competitiveness, customer loyalty, and effectiveness in capturing market opportunities. Market Share: Hindustan Unilever closely monitors its market share as a key KPI. It provides insights into the company’s position within the industry and its ability to outperform competitors. Maintaining or increasing market share demonstrates the effectiveness of HUL’s marketing strategies, brand strength, and customer preference for its products. Brand Equity: Building and nurturing strong brand equity is a critical KPI for Hindustan Unilever. It measures the value and perception of the company’s brands in the market. Strong brand equity enhances customer loyalty, enables premium pricing, and facilitates introduction of new products or extensions. Profitability: Profitability is a key financial KPI that assesses the efficiency of Hindustan Unilever’s operations and its ability to generate profits. Key indicators such as gross profit margin, operating profit margin, and net profit margin are monitored to ensure sustainable profitability and effective cost management. Customer Satisfaction: Hindustan Unilever significantly emphasises customer satisfaction as a KPI. It measures the level of customer happiness, loyalty, and advocacy. By regularly evaluating customer satisfaction through surveys, feedback mechanisms, and customer retention rates, HUL can identify areas for improvement and enhance customer-centric strategies. These five KPIs collectively provide valuable insights into the performance, competitiveness, and growth trajectory of Hindustan Unilever, allowing the company to make informed decisions and drive continuous improvement in its operations. 8. Lawsuits\/Scams: Hindustan Unilever Limited (HUL) has had its fair share of legal challenges, including lawsuits and scams that have garnered media attention. One such instance was a case in which HUL was fined for misleading customers. In a verdict, the company was directed to pay Rs 27 lakh as compensation for deceptive advertising practices. The lawsuit alleged that HUL had made false claims regarding the effectiveness of its products, misleading consumers and compromising their trust. Another notable legal dispute involved HUL’s parent company, Unilever, which settled a dispute over mercury poisoning in India. The case revolved around a thermometer factory operated by Hindustan Unilever in the past. The factory was accused of improper waste disposal, leading to mercury contamination in the surrounding areas and causing health issues for local residents. Unilever settled the case, agreeing to compensate affected individuals and undertake remediation efforts to address the environmental impact. These incidents highlight the importance of adherence to ethical business practices and regulatory compliance. While lawsuits and scams can pose reputational and financial risks, companies like HUL strive to address such issues promptly and responsibly. They demonstrate a commitment to maintaining consumer trust, rectifying any shortcomings, and implementing measures to prevent similar incidents in the future. Such experiences serve as valuable lessons for companies to continuously improve their operations and uphold their social and environmental responsibilities. 9. Financial Overview: Hindustan Unilever Limited (HUL) has consistently demonstrated strong financial performance, solidifying its position as a leading player in the Indian consumer goods industry. With a market capitalization of approximately 6.21 trillion INR, the company showcases its robust market presence and investor confidence. In terms of net sales or income from operations, HUL recorded an impressive figure of 14,638.00 crores INR. This substantial revenue reflects the company’s ability to effectively cater to the evolving needs and preferences of Indian consumers across various product categories. On a standalone basis, HUL witnessed a 10 percent growth in profit, reaching Rs 2,552 crore. This demonstrates the company’s strong profitability and efficient management of its operations. However, the Ebitda margin for the quarter stood at 23.7 percent, experiencing a slight decline of 90 basis points. Despite this marginal decrease, HUL continues to maintain a healthy profit margin, highlighting its ability to generate sustainable returns on investment. HUL’s consistent financial performance reaffirms its position as a financially robust and successful company in the consumer goods sector. With a strategic focus on innovation, brand equity, and operational excellence, the company continues to drive growth, deliver value to its stakeholders, and navigate the dynamic business landscape in India. 10. Additional Insights: Several noteworthy achievements and milestones have marked HUL’s journey. The company has pioneered innovative products tailored to Indian consumers’ preferences, addressing social and environmental challenges and promoting sustainable business practices. It has also made significant contributions to society through various initiatives in the areas of education, healthcare, water conservation, and rural development. Conclusion Hindustan Unilever Limited has come a long way since its inception, evolving into one of India’s most successful and influential consumer goods companies. With a strong commitment to innovation, quality, and sustainability, HUL continues to shape the Indian market and positively impact the lives of millions of consumers. As the company moves forward, it remains dedicated to its founding principles and its vision of making sustainable living commonplace.","filter_flag":1}
