{"title":"The Chemistry is Always Greener…","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfd3cd24d0f9808894c5ffccf2d&url=https%3a%2f%2fwww.acs.org%2feducation%2fstudents%2fgraduate%2fthe-chemistry-is-always-greener.html&c=2204668962635288340&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfd3cd24d0f9808894c5ffccf2d&url=https%3a%2f%2fwww.acs.org%2feducation%2fstudents%2fgraduate%2fthe-chemistry-is-always-greener.html&c=2204668962635288340&mkt=en-us","summary":"Green chemistry is guided by 12 principles that focus a chemist’s thinking when designing new products and processes ... The shift from fossil-based fuels to more sustainable energy sources that are ...","published":"Sun, 25 Dec 2022 03:10:00 GMT","published_parsed":"time.struct_time(tm_year=2022, tm_mon=12, tm_mday=25, tm_hour=3, tm_min=10, tm_sec=0, tm_wday=6, tm_yday=359, tm_isdst=0)","news_source":"C&EN","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Chemistry is Always Greener…","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Green chemistry is guided by 12 principles that focus a chemist’s thinking when designing new products and processes ... The shift from fossil-based fuels to more sustainable energy sources that are ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Sustainable Energy\" \"new products\"&format=rss","text":"Green chemistry is our discipline’s unique contribution to sustainability, which is commonly defined as “meeting the needs of the present without compromising the ability of future generations to meet their own needs.” Only by designing chemical products and processes that are beneficial to the planet will we be able to meet the material needs of the expanding global population. Much of the world’s population lacks safe drinking water and is in desperate need of a portable, low-cost water purification system. The shift from fossil-based fuels to more sustainable energy sources that are less damaging to the environment is a national research priority. Higher food production can be realized using pesticides that minimize harm to beneficial organisms. Meeting these global challenges depends upon chemistry and upon chemists who recognize the environmental impacts of their work and are able to design and implement cleaner products and processes.","filter_flag":1}
{"title":"Creating a Net-Zero World","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfd3cd24d0f9808894c5ffccf2d&url=https%3a%2f%2fwww.theatlantic.com%2fsponsored%2fshell-2022%2fcreating-a-net-zero-world%2f3758%2f&c=17746862279529896422&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfd3cd24d0f9808894c5ffccf2d&url=https%3a%2f%2fwww.theatlantic.com%2fsponsored%2fshell-2022%2fcreating-a-net-zero-world%2f3758%2f&c=17746862279529896422&mkt=en-us","summary":"“The innovation, the creativity, the agility of small business is so important to get us aware of new products ... want to prioritize developing sustainable energy sources like wind and solar ...","published":"Wed, 05 Oct 2022 21:34:00 GMT","published_parsed":"time.struct_time(tm_year=2022, tm_mon=10, tm_mday=5, tm_hour=21, tm_min=34, tm_sec=0, tm_wday=2, tm_yday=278, tm_isdst=0)","news_source":"The Atlantic","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Creating a Net-Zero World","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"“The innovation, the creativity, the agility of small business is so important to get us aware of new products ... want to prioritize developing sustainable energy sources like wind and solar ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Sustainable Energy\" \"new products\"&format=rss","text":"The coming decade may be the most consequential in human history, as the world continues to diversify its energy sources and reduce its carbon emissions. This is how we can achieve the promise—and profits—of a cleaner energy future. Illustrations by Allison Vu In July, a team from the U.S. Department of Commerce visited an innovation hub for the future of sustainability—a collection of small businesses in Brooklyn. Touring the Brooklyn Navy Yard, a former shipbuilding yard in World War II that is now a manufacturing center and an incubator for cross-industry collaboration, U.S. Deputy Secretary of Commerce Don Graves met with a range of businesses creating sustainable technologies, including a zero-emission ammonia start-up and a resilient energy collective focused on powering New York City. The Navy Yard is a working model for how business, government, and everyday citizens (through partnerships with community groups) can unite to innovate new ways to achieve net-zero emissions by 2050, the goal inspired by the Paris Agreement. That aim is part of a wider ambition to cap global warming to 1.5 degrees Celsius above preindustrial levels, the threshold at which climate change can lead to compounding, irreversible effects. The Navy Yard is also an example of how renewable, sustainable ideas can spark new industry and growth along the way. Achieving net zero—when the amount of greenhouse gasses produced is equal to the amount removed from the atmosphere—is the challenge of our time. No single technology, company, or nation can do it alone. It will require innovative solutions for some of the most complex issues of the modern era, not to mention cooperation and coordination across industries and nations. It will also be expensive: Achieving net zero could require a 60 percent increase in spending on physical assets like infrastructure, amounting to $9.2 trillion a year. But this investment may also yield immense opportunities, including a potential $12 trillion in annual sales of net-zero technologies by 2030. A transition of this magnitude presents a wide range of obstacles and uncertainties. Fossil fuels are integrated into almost every industry, large and small, so significantly reducing their use will inevitably create new issues across the world. Yet some of the world’s largest corporations are already problem-solving ways to transform the energy system and create more robust economies in the process. Maersk, the global shipping company, plans to deliver net-zero supply chains to customers by 2040, which will help other corporations around the world reduce their own supply-chain emissions. Microsoft made news for pledging to become carbon negative by 2030, remove historic carbon emissions by 2050, and create a $1 billion climate innovation fund. An innovator in energy, Shell has defined short-, medium-, and long-term targets to become a net-zero emissions energy business by 2050, including investing up to $3 billion a year in the near term in renewable energies like hydrogen. Achieving net zero is the challenge of our time. No single technology, company, or nation can do it alone. For more than 50 years, Shell’s Scenarios team—a working group of specialists, academics, and thought leaders dedicated to envisioning the future of energy—has taken cross-sector and cross-industry factors, challenges, and opportunities under consideration in order to imagine various possibilities for our collective futures. The Sky scenario, for example, outlines how innovations in sustainable technologies can hold global warming to less than 2 degrees Celsius. In the team’s U.S. Scenario Sketch, which outlines a potential pathway for the country to achieve net zero, three primary actions must be prioritized at the same time: accelerating clean technologies, increasing energy-efficient and low-carbon choices, and removing carbon emissions from the air. These actions will require both new types of large-scale innovations and wide-reaching collaboration. The challenges are immense, but so are the opportunities.","filter_flag":1}
{"title":"The Next Phase of Business Sustainability","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfd3cd24d0f9808894c5ffccf2d&url=https%3a%2f%2fssir.org%2farticles%2fentry%2fthe_next_phase_of_business_sustainability&c=8307171710527897039&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfd3cd24d0f9808894c5ffccf2d&url=https%3a%2f%2fssir.org%2farticles%2fentry%2fthe_next_phase_of_business_sustainability&c=8307171710527897039&mkt=en-us","summary":"Instead of tinkering around the edges of the market with new products and services ... a wind farm and calling itself sustainable makes no empirical sense. A more sustainable energy system ...","published":"Fri, 24 Mar 2023 17:29:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=24, tm_hour=17, tm_min=29, tm_sec=0, tm_wday=4, tm_yday=83, tm_isdst=0)","news_source":"ssir.org","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Next Phase of Business Sustainability","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Instead of tinkering around the edges of the market with new products and services ... a wind farm and calling itself sustainable makes no empirical sense. A more sustainable energy system ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Sustainable Energy\" \"new products\"&format=rss","text":"(Illustration by James O'Brien) Business sustainability has come a long way. From the dawn of the modern environmental movement and the establishment of environmental regulations in the 1970s, it has become a strategic concern driven by market forces. Today, more than 90 percent of CEOs state that sustainability is important to their company’s success, and companies develop sustainability strategies, market sustainable products and services, create positions such as chief sustainability officer, and publish sustainability reports for consumers, investors, activists, and the public at large. This trend will not abate anytime soon. Surveys show that 88 percent of business school students think that learning about social and environmental issues in business is a priority, and 67 percent want to incorporate environmental sustainability into their future jobs. To meet this demand, the percentage of business schools that require students to take a course dedicated to business and society increased from 34 percent in 2001 to 79 percent in 2011, and specific academic programs on business sustainability can now be found in 46 percent of the top 100 US master of business administration (MBA) programs. For all this interest, we should expect the world to become more sustainable. But problems such as climate change, water scarcity, species extinction, and many others continue to worsen. Sustainable business is reaching the limits of what it can accomplish in its present form. It is slowing the velocity at which we are approaching a crisis, but we are not changing course. Instead of tinkering around the edges of the market with new products and services, business must now transform it. That is the focus of the next phase of business sustainability, and we can see signs that it is emerging. The first phase of business sustainability, what we at the University of Michigan’s Erb Institute call “enterprise integration,” is founded on a model of business responding to market shifts to increase competitive positioning by integrating sustainability into preexisting business considerations. By contrast, the next phase of business sustainability, what we call “market transformation,” is founded on a model of business transforming the market. Instead of waiting for a market shift to create incentives for sustainable practices, companies are creating those shifts to enable new forms of business sustainability. Enterprise integration is geared toward present-day measures of success; market transformation will help companies create tomorrow’s measures. The first is focused on reducing unsustainability; the second is focused on creating sustainability.1 The first attends to symptoms; the second attends to causes. The first focuses primarily inward toward the health and vitality of the organization; the second expands that focus to look outward toward the health and vitality of the market and society in which the organization operates. The first will help future leaders get a job in today’s marketplace; the second will help them develop a target for a lifelong career. The first is incremental, the second transformational. Changing the way we do business is essential to addressing the challenges of environmental degradation. The market is the most powerful institution on earth, and business is the most powerful entity within it. Business transcends national boundaries, and it possesses resources that exceed those of many nation-states. Business is responsible for producing the buildings we live and work in, the food we eat, the clothes we wear, the automobiles we drive, the energy that propels them, and the next form of mobility that will replace them. This does not mean that only business can generate solutions, but with its unmatched powers of ideation, production, and distribution, business is best positioned to bring the change we need at the scale we need it. Sustainable Business 1.0: Enterprise Integration In its first incarnation, business sustainability represents a market shift. Market pressures bring sustainability to business attention through core management channels and functions. This began with Nixon-era government regulation and grew to include insurance companies, investors, consumers, suppliers, buyers, and others through the 1980s and 1990s.2 Such market pressures can emerge from numerous sources: coercive drivers—from domestic and international regulations and the courts; resource drivers—from suppliers, buyers, shareholders, investors, banks, and insurance companies; market drivers—from consumers, trade associations, competitors, and consultants; and social drivers—from nonprofit organizations, activist groups, the press, religious institutions, and academia.3 While corporate social responsibility (CSR) is one response to such pressures, companies have sought to improve competitive positioning by linking sustainability and corporate strategy. This involves translating the issue into the core language of business management: operational efficiency, capital acquisition, strategic direction, and market growth. In each case, the firm has an established model that it can use to conceptualize the issue and formulate a response. In this way, sustainability becomes much like any other business threat, where market expectations change and technological developments advance, leaving certain industries to adapt or face demise while others rise to fill their place. For example, when insurance companies apply sustainability pressures on the firm, the issue becomes one of risk management. When competitors apply such pressures, it becomes an issue of strategic direction. When investors and banks do so, it becomes an issue of capital acquisition and cost of capital. When suppliers and buyers do so, it becomes an issue of supply-chain logistics. When consumers do so, it becomes an issue of market demand. Framed in such terms, much of the specific language of sustainability recedes and is replaced by standard business logic. Therefore, companies can remain agnostic about the science of particular issues (such as climate change) but still recognize their importance as business concerns. The successful company can perform this translation process and integrate sustainability into its existing structures and strategies. Take Whirlpool, for example: It has improved appliance energy efficiency because it has watched energy efficiency move from number 12 in consumer priorities in the 1980s to number three, just behind cost and performance, today. Whirlpool and others expect those concerns to continue to grow.4 One signal of this growth is the LOHAS consumers (Lifestyles of Health and Sustainability), a segment that considers environmental attributes in purchasing decisions and was estimated to be a $355 billion market in the United States in 2016 and a $546 billion market worldwide. Another signal comes from impact investors, who consider environmental, social, and governance (ESG) factors in their investment criteria. The sector reached $8.72 trillion of professionally managed assets in the United States in 2016, or one-fifth of all investment under professional management. But it is not just a specialized sector; this past May, financial advisory firms BlackRock, Vanguard, and State Street cast votes in opposition to ExxonMobil management and called for the company to disclose its climate change impacts. These are all signs that the market has shifted and continues to shift. Today, consumers can buy sustainable products, stay in sustainable hotels, eat sustainable foods, and use sustainable cleaning products. While this greening of the market is a good thing, it is not actually solving the root problems it was meant to address. Our world continues to become less, not more, sustainable. Sustainable Business 2.0: Market Transformation While business sustainability has been going mainstream, the world has witnessed unprecedented human impacts on the natural environment that threaten the viability of life on Earth. To mark this shift, scientists have proposed that we have left the Holocene and are now entering the Anthropocene, a new geologic epoch that acknowledges the enormous influence of the world’s 7.5 billion people (to be nearly 10 billion by 2050) on the planet.5 To measure that influence, they have identified nine “planetary boundaries” that represent “thresholds below which humanity can safely operate and beyond which the stability of planetary-scale systems cannot be relied upon.”6 These are what Lancaster University management professor Gail Whiteman has called the “key performance indicators” (KPIs) of the planet, many of which are not doing so well. While one (ozone depletion) is on the mend, scientists believe we have overshot the boundaries of three: climate change, biodiversity loss, and biogeochemical flows (nitrogen and phosphorus cycles). Further indicators are also blinking red, such as ocean acidification, freshwater use, and deforestation. The remaining two boundaries—chemical pollution and atmospheric particle pollution—require more data to assess. All of these disruptions are the result of system failures created largely by our market institutions. They will have to be remedied by those institutions. Fortunately, capitalism can be quite malleable. It is designed by human beings in the service of human beings, and it can evolve to meet the changing needs of human beings. This has happened throughout its history to address issues such as monopoly power, collusion, and price-fixing. Today’s pressing need is sustainability—particularly to address climate change—and legislators are not the only ones who can shift course. Many companies recognize this challenge and are pushing for new market models. In the words of Unilever CEO Paul Polman, “We are entering a very interesting period of history where the responsible business world is running ahead of the politicians” and taking on a broader role to “serve society.” The next phase of business sustainability calls for a transformation of the market, discarding such outdated notions as treating the environment as a limitless source of materials and sink for waste, seeing economic value as the only measure of nature’s worth, encouraging unbridled consumption, and considering perpetual economic growth as even possible. Corporate decision makers have a key role to play in facilitating this transition. Instead of accepting the rules of the market as given, they must change them to incorporate the planet’s KPIs. For example, to turn around the KPI of climate change, the market must go carbon neutral and eventually go carbon negative. We don’t yet know how to do that, but we know that it cannot be done by one company or one product. It requires a change in the overall market. Real sustainability is a property of a system.7 For example, the notion of an energy company installing a wind farm and calling itself sustainable makes no empirical sense. A more sustainable energy system incorporates the whole grid, encompassing generation, transmission, distribution, use, and mobility. We can already see signals of this change happening as new energy sources, distributed energy, demand-side management, smart appliances, and smart meters are beginning to transform our conceptions of energy. Already, jobs in the clean energy sector have exceeded those in oil drilling. But the energy renaissance goes further. Electric vehicles have the potential to change the grid, leveling the electricity demand curve by charging at night and providing storage capacity during the day for intermittent energy sources like wind and solar. Already, a Nissan Leaf automobile owner in Japan can buy a transformer to power the house off the battery pack during a power failure. Research is under way to scale this concept and allow consumers to rent their batteries to utilities while their car is parked. Electric vehicles are also transforming the auto industry. Who could have predicted 20 years ago that new entrants like Tesla would enjoy a larger market capitalization than General Motors? And as the shift to driverless cars continues, IT companies such as Apple and Alphabet have entered the fray, shifting success factors in the auto sector from hardware to software, and with them our conceptions of personal mobility. For example, as incumbents such as Ford Motor seek to become mobility providers, they must learn to operate like the airline industry, where profits increase when their cars spend minimal time idling. Given that today’s personal car is parked 95 percent of the time, driverless cars can result in fewer cars on the road (at least in urban centers) as people purchase mobility services rather than own cars. Fewer cars on the road means repurposing unneeded roads, parking lots, garages, and service stations. Systemic Corporate Strategies As we see with the energy and transportation sectors, the potential scope of market transformation is vast. To help flesh this out, we can conceive this sustainability revolution as proceeding from two initial phases. First, corporations rethink their business strategies to play a stronger role in guiding the sustainability of the systems of which they are a part. Second, the business model itself undergoes reconceptualization. The first phase includes at least four new ways of conceiving their approach to operations, partnerships, government engagement, and transparency. New conceptions of operations | Market transformation calls for optimizing supply-chain logistics to reduce risks from numerous factors such as disruptions due to increased storm severity caused by climate change; current and future resource availability and price volatility; accelerating emissions and concerns for public health and the environment; and the future resilience of business and civil society. These risks can directly affect assets and operations, availability and costs of inputs, regulation of sourcing and distribution, workforce availability and productivity, and stakeholder reputation. For instance, Nestlé, Coca-Cola, Cargill, and General Mills have all faced threats to supply chains due to the decreased availability of water, a once-plentiful resource now scarcer because of climate change and overconsumption. To better manage such operational systems, companies are moving away from linear models in which items are created, used, and disposed of once they reach their end of serviceable life, and toward circular models, where items are created, used, and then either restored or reprocessed to recover energy or materials that can be used again. One key to this new vision of a circular economy is that it is regenerative by design; it is organized to keep products, components, and materials at their highest utility and value at all times. For example, industrial and consumer products company Ricoh has concluded that by 2050, there will be an insufficient supply of many reasonably priced raw materials to support its manufacturing needs. As a result, the company is revising its business model using life-cycle analysis as the basis for decision making and establishing a series of what it calls “Resource Smart Solutions” for product design and manufacturing, reuse, collection, maintenance, and materials recovery. To change the system around it, the company is also helping its customers reduce energy use, carbon footprint, and virgin material use while also expanding its own opportunities for product refurbishing, recycling, and new designs. Targets include reducing virgin resource use by 25 percent by 2020 and 87.5 percent by 2050. In adopting circular economy thinking, Ricoh is striving to move beyond incremental efficiency goals to more ambitious “net zero impact” business operations.8 New conceptions of partnerships | Going beyond the supply chain, companies also look to novel partnerships outside standard modes of shifting the market, including nonprofit organizations, the government, competitors, and seemingly unrelated companies. For example, as Ford increased its research and development in hybrid and electric drivetrains, it saw an opportunity in how customers would live more electrified lifestyles overall. Together with Infineon, SunPower, Whirlpool, and Eaton, Ford developed the MyEnergi Lifestyle program, exploring ways in which hybrid electric vehicles, solar power systems, energy-efficient appliances, and home design can be integrated to reduce the total carbon footprint. Similarly, Toyota Motor is seeking a broad array of partnerships to achieve its goal of going “beyond zero environmental impact” by eventually eliminating CO2 emissions from vehicle operation, manufacturing, materials production, and energy sources by 2050. New conceptions of government engagement | Very few business schools offer courses on collaborative and constructive lobbying. Indeed, the public perceptions of lobbying are generally negative. But lobbying is basic to democratic politics as governments seek guidance on how to set the rules of the market and usher reforms as needed. Forward-thinking companies are looking for ways to participate constructively in policy formation. For example, Intel was instrumental in calling attention to the horrors of tin, tantalum, tungsten, and gold mining in the Democratic Republic of Congo. While the company could have simply stopped sourcing such conflict minerals from the region, it did not want to create additional hardship for legal mining operations. Instead, it helped create provisions in the Dodd-Frank Act that require the tracking and disclosure of such mineral sourcing within the broader electronics industry. This is not unusual. Companies are also working with governments to phase out heat-trapping HFC chemicals and setting new efficiency standards on trucks. The Paris Agreement on climate change would not have been possible without the powerful business interests that helped broker a deal. In each of these examples, business took a responsible position in bringing about a sustainable shift in the market through policy. New conceptions of transparency | The only way that market transformation will be successful is through trust, and trust can be gained only through greater transparency. The expansion of corporate influence in society, particularly as it relates to government, will make some justifiably uneasy. But robust reporting mechanisms can help allay those fears and also help protect companies from the effects of misconduct, including legal liability and penalties. To be sure, companies are already disclosing numerous sustainability indicators through established standards, such as the globally recognized Global Reporting Initiative or Carbon Disclosure Project. But transparency goes further as companies face increasing demands for data, for both internal management and external validation, under the watchful eye of activists, investors, suppliers, buyers, employees, and customers. The gathering and dissemination of such information can open up new awareness of supply-chain risks and opportunities. For example, IBM and partner companies are experimenting with blockchain technology to transform visibility and traceability in complex, often opaque, global supply chains. In 2017, IBM piloted supplychain blockchain with Walmart to address food safety in its global supply and distribution network and plans to roll it out further with nine global agricultural companies. In another example, Nestlé conducted an internal investigation of its Thai fish supply chains in 2014 and found forced labor and brutal treatment of workers. But in a dramatic shift from standard practices of privacy and nondisclosure, the company posted the report online, imposed new requirements on suppliers, and commissioned outside auditors to assure compliance. This public disclosure compelled other companies that source fish in Thailand to follow suit, shifting the competitive dynamics of supply-chain logistics. New Ways of Doing Business Market transformation not only compels more systemic business strategies but also challenges traditional ways of conceiving business itself. It demands new conceptions of corporate purpose, notions of consumption, and models and metrics of business success. New conceptions of the corporation’s purpose | The dominant idea of the purpose of the corporation as simply to make money for its shareholders took hold within business in the 1970s and 1980s. But the narrow pursuit of shareholder value leads to excessively short time horizons for investment planning and measures of success. It also leads to a focus on only the type of shareholder who is less interested in sustainability efforts and, in the words of Cornell Law School professor Lynn Stout, is “shortsighted, opportunistic, willing to impose external costs, and indifferent to ethics and others’ welfare.”9 New ideas of corporate purpose are beginning to grow within business practice and education. For example, benefit corporations are one type of innovation that seeks to integrate a broader array of objectives than simply profits into its forms of organizing, governance, and legal statement of purpose. And other companies are watching closely, sometime mimicking them. This trend has caught on among MBA students who challenge conventional thinking around capitalism and corporate purpose. At the Harvard Business School, an immensely popular course called “Reexamining Capitalism” explores “the evolution, power, and limitations of our current capitalist systems” and “how the ‘rules of the game’ by which capitalism is structured should change” to address the social and environmental issues of our day. New conceptions of consumption | Is “sustainable consumption” an oxymoron? The World Business Council for Sustainable Development doesn’t think so, calling on businesses to “abandon the existing consumption paradigm” and move toward “transformations in mainstream lifestyles and consumption patterns.”10 Several businesses and activists have sought to put such an idea into practical use. For example, Patagonia, through its Common Threads Initiative, encourages people to buy used Patagonia products on eBay before going to the store to buy them new. Adbusters has long promoted its “Buy Nothing Day,” what it calls a “24-hour moratorium on consumer spending” as a counterpoint to the Black Friday spending spree that traditionally follows the holiday of Thanksgiving. The outdoor lifestyle retailer and co-op Recreational Equipment (REI) closes its 149 stores on Black Friday as part of its “#OptOutside” program. In 2016, Subaru, Google, Meetup, Upworthy, and competing outdoor brands such as Burton, Keen, Yeti, and Prana chose to partner with the effort. In the end, resource use must be reduced at the source, and that means developing new models of consumption. New conceptions of business models and metrics | Market transformation requires a compelling new business model to replace traditional ones that dominate business thinking. For example, neoclassical economics and agency theory employ dismally simplified models of human beings as driven primarily by selfishness, where those running the company (agents) will shirk or even steal from the owner (principal) if they do the work and the owner gets the profits. But behavioral economists have argued that real humans don’t behave as neoclassical economics suggests we do, and legal scholars argue that managerial motivations are far more complex than a simple principal\/agent relationship and instead involve thousands of shareholders, executives, and directors with more socially positive motivations. And new models have arisen, such as positive organizational scholarship and appreciative inquiry, that move beyond standard cynical conceptions of human behavior to understand how and why people are motivated to devote their work toward improving the world around them and learn how to create the organizational conditions that will foster that activity. These models are gaining increasing interest in business teaching, research, and practice as a way to create a more committed and effective organization. Other models are also beginning to gain recognition. Doughnut economics11 is a model of economic growth that links social justice to efforts to stay within the planetary boundaries of the Anthropocene epoch. Shared value is aimed at redefining capitalism by arguing that the competitiveness of a company is closely tied to the health of the communities in which it is embedded.12 Conscious capitalism is a model of business that serves the interests of all major stakeholders—customers, employees, investors, communities, suppliers, and the environment. And regenerative capitalism reimagines capitalism in terms that are self-organizing, naturally self-maintaining, and highly adaptive to produce lasting social and economic vitality for global civilization as a whole. Each of these models is seeking an amended form of capitalism that is sensitive to the constraints of the Anthropocene. Closely related to models of business behavior are the metrics used to define success, many of which lead to unsustainable outcomes. For example, discount rates are used to capture the time value of money—the fact that a dollar today is worth more than a dollar tomorrow. But a common discount rate of 5 percent leads to a conclusion that everything 20 years out and beyond is worthless. When gauging the response to climate change, is that an outcome that anyone—particularly anyone with children or grandchildren—would consider ethical? London School of Economics professor Nicholas Stern answered no with an argument that used an unusually low discount rate when calculating the future costs and benefits of climate change mitigation and adaptation.13 Another problematic metric is gross domestic product (GDP). This measure of national economic health fails to distinguish between financial transactions that add to the well-being of a country and those that diminish it. Any activity in which money changes hands will register as GDP growth, even money spent on recovery from natural disasters and pollution cleanup. To examine alternatives, former French president Nicolas Sarkozy created a commission, headed by Nobel laureates Joseph Stiglitz and Amartya Sen. Their 2010 report recommended a shift in economic emphasis from the production of goods to a broader measure of overall well-being that would include measures for categories such as health, education, security, and sustainability.14 Reshaping Politics to Reshape the Market A discussion of market transformation and the corporation’s shifting role in society cannot be complete without a discussion of the current political and social climate and what impact it has on this agenda going forward. The Trump administration denies the science of climate change and has embarked on an agenda of loosening the regulatory environment to stimulate economic growth. This is a similar script to that employed by President Ronald Reagan more than 35 years ago when he appointed Ann Gorsuch Burford to lead the US Environmental Protection Agency, James Watt to head the US Department of the Interior, and Rita Lavelle to run Superfund, the program for cleaning up the country’s most polluted sites. Reagan’s appointments set about slowing or stopping environmental enforcement, but they ultimately led to scandals and created a critical public backlash: In 1983, all three were removed from office, and in subsequent years, Congress went on to strengthen numerous environmental regulations, and environmental groups increased membership and budgets. In the words of former Sierra Club executive director Carl Pope, Reagan “reinvented the environmental movement by his contempt for it.” While President Trump’s approach to the environment bears similarities to Reagan’s attempts to roll back environmental regulations and likely faces a similar backlash, there are several key differences. First, some of the backlash this time will come from businesses that are leading on greenhouse gas reductions and not fighting government-led environmental policies, as they did in the 1980s. Indeed, recent surveys show that 85 percent of business executives believe that climate change is real (well above the national average of 64 percent), and many see the associated market risks and benefits. General Mills CEO Ken Powell was not alone when he told the Associated Press, “We think that human-caused greenhouse gas causes climate change and climate volatility, and that’s going to stress the agricultural supply chain.” Cargill executive director Greg Page warns of food shortages if we do not act. Such concerns represent a strong and growing perspective within the corporate sector that we have a problem and government inaction will only make it worse. While those who lose in a carbon-constrained world (such as fossil fuel interests) will continue to resist acknowledging climate change, most companies see the long-term trajectory of this issue and do not see the current administration’s position as the long-term future. The market is shifting with or without the US government, as other national governments as well as many US state and city governments continue to set policies. Many companies are part of global markets and see the US withdrawal from the Paris Agreement as ceding US leadership but not stopping the market transformation that is under way. Some markets may slow, but some may just move to other parts of the globe, such as Germany, India, and China, where heavy investments in renewable energy and alternative drivetrains (such as electric and hybrid) are viewed as the future of the energy and mobility sectors. The public is also moving in favor of sustainability. Already, public opinion polls show that an increasing number of Americans believe climate change is real. Some even show that a majority of Republicans—including 54 percent of self-described conservative Republicans—now believe that the world’s climate is changing and that human beings play some role in the change. This is a marked shift from 2009, when just 35 percent of Republicans believed that climate change was real. The truth is that many Republican politicians, congressional aides, lobbyists, and staff believe in the science of climate change as well but are waiting for the right political cover to voice their views. Concern for the environment is a long-term interest of the American public, one that is more latent than urgent and top of mind. While surveys show that it ranks low on election issue topics—number 12 in one poll, behind the economy, terrorism, foreign policy, and health care—it is also driven by saliency, and it will awaken when threatened. That awakening can be triggered by any number of levers. If history is any indication, smart business leadership will read these signs, anticipate the market shift, and seek to take advantage. Support SSIR’s coverage of cross-sector solutions to global challenges. Help us further the reach of innovative ideas. Donate today. Read more stories by Andrew J. Hoffman.","filter_flag":1}
{"title":"Worthington Enterprises Reports Fourth Quarter Fiscal 2024 Results","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfd3cd24d0f9808894c5ffccf2d&url=https%3a%2f%2fmarkets.businessinsider.com%2fnews%2fstocks%2fworthington-enterprises-reports-fourth-quarter-fiscal-2024-results-1033505384&c=8293898711742171103&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfd3cd24d0f9808894c5ffccf2d&url=https%3a%2f%2fmarkets.businessinsider.com%2fnews%2fstocks%2fworthington-enterprises-reports-fourth-quarter-fiscal-2024-results-1033505384&c=8293898711742171103&mkt=en-us","summary":"Sustainable Energy Solutions’ net sales totaled $39.9 million ... customer initiatives, new businesses, new products and new markets; expectations for Company and customer inventories, jobs and orders ...","published":"Tue, 25 Jun 2024 09:15:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=25, tm_hour=9, tm_min=15, tm_sec=0, tm_wday=1, tm_yday=177, tm_isdst=0)","news_source":"Business Insider","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Worthington Enterprises Reports Fourth Quarter Fiscal 2024 Results","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Sustainable Energy Solutions’ net sales totaled $39.9 million ... customer initiatives, new businesses, new products and new markets; expectations for Company and customer inventories, jobs and orders ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Sustainable Energy\" \"new products\"&format=rss","text":"COLUMBUS, Ohio, June 25, 2024 (GLOBE NEWSWIRE) -- Worthington Enterprises, Inc. (NYSE: WOR) reported net sales of $318.8 million and a net loss from continuing operations of $31.5 million, or $(0.64) per diluted share, for its fiscal 2024 fourth quarter ended May 31, 2024. This compares to net sales of $368.8 million and net earnings from continuing operations of $50.1 million, or $1.01 per diluted share, in the fourth quarter of fiscal 2023. On a non-GAAP basis, adjusted net earnings from continuing operations totaled $37.5 million for the fourth quarter of fiscal 2024, or $0.74 per diluted share, compared to $59.0 million, or $1.19 per diluted share, in the prior year comparable quarter. Reported results reflect the controlling interest portion of continuing operations and were impacted by certain items, as summarized in the table below. (U.S. dollars in millions, except per share amounts) 4Q 2024 4Q 2023 After-Tax Per Share After-Tax Per Share Net earnings (loss) from continuing operations $ (31.5 ) $ (0.64 ) $ 50.1 $ 1.01 Corporate costs eliminated at Separation(1) - - 8.0 0.16 Impairment and restructuring charges 57.0 1.14 - - Separation costs 0.1 - 2.5 0.05 Impairment of investment in notes receivable 11.1 0.22 - - Pension settlement charge in equity income 0.8 0.02 - - Sale-leaseback gain in equity income - - (1.6 ) (0.03 ) Adjusted net earnings from continuing operations $ 37.5 $ 0.74 $ 59.0 $ 1.19 (1) References in this release to the “Separation” are to the Company’s separation of its former steel processing business into Worthington Steel, Inc. on December 1, 2023. Financial highlights, on a continuing operations basis, for the fiscal 2024 periods and prior year comparative periods are as follows: (U.S. dollars in millions, except per share amounts) 4Q 2024 4Q 2023 12M 2024 12M 2023 Net sales $ 318.8 $ 368.8 $ 1,245.7 $ 1,418.5 Operating income (loss) (56.1 ) 15.3 (73.5 ) 29.8 Adjusted operating income 5.8 28.6 20.9 77.9 Net earnings (loss) from continuing operations (31.5 ) 50.1 35.2 125.8 Adjusted EBITDA from continuing operations 63.2 93.7 251.0 306.0 EPS from continuing operations - diluted (0.64 ) 1.01 0.70 2.55 Adjusted EPS from continuing operations - diluted $ 0.74 $ 1.19 $ 2.84 $ 3.60 “We finished our fiscal year with a respectable fourth quarter delivering adjusted earnings per share of $0.74,” said Worthington Enterprises President and CEO Andy Rose. “Building Products had a solid quarter benefiting from strong contributions from WAVE and our water business but was offset by lower contributions from ClarkDietrich which faced some margin compression. Consumer Products performed well despite headwinds due to volume being pulled ahead into the previous quarter and some softening in consumer spending. While both segments saw lower volumes, the overall health of the company is good. Our employees continue to deliver, and I could not be more proud of the focus and hard work they carry out every day.” Consolidated Quarterly Results Net sales for the fourth quarter of fiscal 2024 were $318.8 million, a decrease of $50.0 million, or 13.6%, from the prior year quarter, driven primarily by lower volume across all segments. The operating loss of $56.1 million for the fourth quarter was unfavorable to the $15.3 million of operating income in the prior year quarter, due to significantly higher impairment and restructuring charges stemming from the deconsolidation of the former Sustainable Energy Solutions segment, effective May 29, 2024, as discussed below under Recent Business Developments. On an adjusted basis, operating income was $5.8 million, down $22.8 million from the prior year quarter, on lower volumes in Consumer Products combined with increased operating losses in Sustainable Energy Solutions. Equity income decreased $10.9 million from the prior year quarter to $40.4 million, driven by lower contributions from ClarkDietrich which was down $13.8 million from the near record results in the prior year quarter, partially offset by strong contributions from WAVE which increased $3.3 million compared to the prior year quarter. Miscellaneous expense was unfavorable by $11.1 million from the prior year quarter due to the write-down of an investment in a note receivable as a result of a change in business strategy in the Sustainable Energy Solutions business, while net interest expense was favorable $2.6 million over the prior year quarter due to lower average debt levels. Income tax expense was $5.0 million in the fourth quarter of fiscal 2024 compared to $13.8 million in the prior year quarter. The decrease was driven by lower pre-tax earnings and discrete items related to the deconsolidation of the Sustainable Energy Solutions business. Tax expense in the fourth quarter of fiscal 2024 reflects an annual effective rate of 52.6% compared to 21.5% in the prior year. On an adjusted basis, the annual effective tax rate was 23.5% compared to 21.9% in the prior year. Balance Sheet Total debt was $298.1 million at the end of fiscal 2024, down approximately $391.8 million from May 31, 2023, due to the early redemption of the senior unsecured notes set to mature on August 10, 2024, and April 15, 2026, both of which were paid off earlier in the fiscal year. The Company ended the fourth quarter of fiscal 2024 with cash of $244.2 million, of which, $83.8 million was used after the quarter ended to fund the remaining purchase price of Hexagon Ragasco, as discussed below under Recent Business Developments. Quarterly Segment Results Consumer Products generated net sales of $125.3 million during the fourth quarter of fiscal 2024, down $23.5 million, or 16%, from the prior year quarter on lower volume. Adjusted EBITDA was down $12.5 million to $17.1 million, driven by the impact of lower volume, and to a lesser extent, a $2.4 million increase in SG&A expense due to higher benefit related costs and increased marketing spend. Building Products generated net sales of $153.6 million during the fourth quarter of fiscal 2024, down $21.0 million, or 12%, from the prior year quarter due to lower volume and an unfavorable shift in product mix. Adjusted EBITDA decreased $13.1 million from the prior year quarter to $51.6 million on the combined impact of lower contributions of equity income from ClarkDietrich and unfavorable mix. Sustainable Energy Solutions’ net sales totaled $39.9 million, down 12.0%, or $5.5 million, from the prior year quarter due to lower average selling prices and lower volume. Adjusted EBITDA was $1.2 million, down $3.1 million from the prior year quarter as lower average selling prices compressed gross profit. During the quarter, the Company sold an interest in the Sustainable Energy Solutions business to Hexagon Composites ASA (“Hexagon”), creating a new unconsolidated joint venture, in which the Company retained a 49% noncontrolling interest, as discussed below under Recent Business Developments. Historical results for Sustainable Energy Solutions are reported as part of Unallocated Corporate and Other, while future results, starting with the first quarter of fiscal 2025, will flow through equity income within Unallocated Corporate and Other. Recent Developments On May 29, 2024, the Company formed a new unconsolidated joint venture with Hexagon, comprised of the former Sustainable Energy Solutions segment. Pursuant to the transaction, Hexagon acquired a 49% stake in the joint venture for approximately $10 million plus closing cash. The Company retained a 49% noncontrolling interest in the joint venture, with the remaining 2% held by the executive management team of Sustainable Energy Solutions. On June 3, 2024, the Company acquired Hexagon Ragasco, a leading manufacturer of composite propane cylinders. The total purchase price was approximately $98 million, subject to closing adjustments, $11.4 million of which was deposited into escrow at fiscal year end. On June 25, 2024, the Company’s Board of Directors declared a quarterly dividend of $0.17 per common share payable on September 27, 2024, to shareholders of record at the close of business on September 13, 2024, a 6.25% increase or $0.01 per share, compared to the prior quarter. Outlook “We are optimistic heading into our new fiscal year having recently completed the acquisition of Hexagon Ragasco along with the formation of our Sustainable Energy Solutions joint venture,” Rose said. “We have market leading brands, a rock-solid balance sheet that will enable us to take advantage of growth opportunities as they arise, and a team focused on driving long-term profitable growth for Worthington Enterprises.” Upcoming Investor Events Raymond James Industrial and Energy Showcase, August 8, 2024 CG 44th Annual Growth Conference, August 14, 2024 2024 Seaport Research Partners Annual Summer Investor Conference, August 21, 2024 Jefferies Industrials Conference, September 5, 2024 Conference Call The Company will review fiscal 2024 fourth quarter results during its quarterly conference call on June 26, 2024, at 8:30 a.m., Eastern Time. Details regarding the conference call can be found on the Company website at www.WorthingtonEnterprises.com. About Worthington Enterprises Worthington Enterprises (NYSE: WOR) is a designer and manufacturer of market-leading brands that help enable people to live safer, healthier and more expressive lives. The Company operates with two segments: Building Products and Consumer Products. Worthington’s emphasis on innovation and transformation extends to building products including heating and cooling solutions, water systems, architectural and acoustical grid ceilings and metal framing and accessories, and consumer products in tools, outdoor living and celebrations categories sold under brand names Coleman®, Bernzomatic®, Balloon Time®, Level5 Tools®, Mag Torch®, Well-X-Trol®, General®, Garden-Weasel®, Pactool International®, HALO™ and Hawkeye™. The Company serves the growing global hydrogen ecosystem through on-board fueling systems and gas containment solutions. Headquartered in Columbus, Ohio, Worthington Enterprises employs approximately 4,000 people throughout North America and Europe. Founded in 1955 as Worthington Industries, Worthington Enterprises follows a people-first Philosophy with earning money for its shareholders as its first corporate goal. Worthington Enterprises achieves this outcome by empowering its employees to innovate, thrive and grow with leading brands in attractive markets that improve everyday life. The Company engages deeply with local communities where it has operations through volunteer efforts and The Worthington Companies Foundation, participates actively in workforce development programs and reports annually on its corporate citizenship and sustainability efforts. For more information, visit worthingtonenterprises.com. Safe Harbor Statement Selected statements contained in this release constitute “forward-looking statements,” as that term is used in the Private Securities Litigation Reform Act of 1995 (the “Act”). The Company wishes to take advantage of the safe harbor provisions included in the Act. Forward-looking statements reflect the Company’s current expectations, estimates or projections concerning future results or events. These statements are often identified by the use of forward-looking words or phrases such as “believe,” “expect,” “anticipate,” “may,” “could,” “should,” “would,” “intend,” “plan,” “will,” “likely,” “estimate,” “project,” “position,” “strategy,” “target,” “aim,” “seek,” “foresee” and similar words or phrases. These forward-looking statements include, without limitation, statements relating to: future or expected cash positions, liquidity and ability to access financial markets and capital; outlook, strategy or business plans; the anticipated benefits of the separation of the Company’s Steel Processing business (the “Separation”); the expected financial and operational performance of, and future opportunities for, the Company following the Separation; the Company’s performance on a pro forma basis to illustrate the estimated effects of the Separation on historical periods; the tax treatment of the Separation transaction; future or expected growth, growth potential, forward momentum, performance, competitive position, sales, volumes, cash flows, earnings, margins, balance sheet strengths, debt, financial condition or other financial measures; pricing trends for raw materials and finished goods and the impact of pricing changes; the ability to improve or maintain margins; expected demand or demand trends for the Company or its markets; additions to product lines and opportunities to participate in new markets; expected benefits from transformation and innovation efforts; the ability to improve performance and competitive position at the Company’s operations; anticipated working capital needs, capital expenditures and asset sales; anticipated improvements and efficiencies in costs, operations, sales, inventory management, sourcing and the supply chain and the results thereof; projected profitability potential; the ability to make acquisitions and the projected timing, results, benefits, costs, charges and expenditures related to acquisitions, joint ventures, headcount reductions and facility dispositions, shutdowns and consolidations; projected capacity and the alignment of operations with demand; the ability to operate profitably and generate cash in down markets; the ability to capture and maintain market share and to develop or take advantage of future opportunities, customer initiatives, new businesses, new products and new markets; expectations for Company and customer inventories, jobs and orders; expectations for the economy and markets or improvements therein; expectations for generating improving and sustainable earnings, earnings potential, margins or shareholder value; effects of judicial rulings; the ever-changing effects of the novel coronavirus (“COVID-19”) pandemic and the various responses of governmental and nongovernmental authorities thereto on economies and markets, and on our customers, counterparties, employees and third-party service providers; and other non-historical matters. Because they are based on beliefs, estimates and assumptions, forward-looking statements are inherently subject to risks and uncertainties that could cause actual results to differ materially from those projected. Any number of factors could affect actual results, including, without limitation, those that follow: the uncertainty of obtaining regulatory approvals in connection with the Separation, including rulings from the Internal Revenue Service; the Company’s ability to successfully realize the anticipated benefits of the Separation; the risks, uncertainties and impacts related to the COVID-19 pandemic – the duration, extent and severity of which are impossible to predict, including the possibility of future resurgence in the spread of COVID-19 or variants thereof – and the availability, effectiveness and acceptance of vaccines, and other actual or potential public health emergencies and actions taken by governmental authorities or others in connection therewith; the effect of national, regional and global economic conditions generally and within major product markets, including significant economic disruptions from COVID-19, the actions taken in connection therewith and the implementation of related fiscal stimulus packages; the effect of conditions in national and worldwide financial markets, including inflation, increases in interest rates and economic recession, and with respect to the ability of financial institutions to provide capital; the impact of tariffs, the adoption of trade restrictions affecting the Company’s products or suppliers, a United States withdrawal from or significant renegotiation of trade agreements, the occurrence of trade wars, the closing of border crossings, and other changes in trade regulations or relationships; changing oil prices and\/or supply; product demand and pricing; changes in product mix, product substitution and market acceptance of the Company’s products; volatility or fluctuations in the pricing, quality or availability of raw materials (particularly steel), supplies, transportation, utilities, labor and other items required by operations (especially in light of the COVID-19 pandemic and Russia’s invasion of Ukraine); effects of sourcing and supply chain constraints; the outcome of adverse claims experience with respect to workers’ compensation, product recalls or product liability, casualty events or other matters; effects of facility closures and the consolidation of operations; the effect of financial difficulties, consolidation and other changes within the steel, automotive, construction and other industries in which the Company participates; failure to maintain appropriate levels of inventories; financial difficulties (including bankruptcy filings) of original equipment manufacturers, end-users and customers, suppliers, joint venture partners and others with whom the Company does business; the ability to realize targeted expense reductions from headcount reductions, facility closures and other cost reduction efforts; the ability to realize cost savings and operational, sales and sourcing improvements and efficiencies, and other expected benefits from transformation initiatives, on a timely basis; the overall success of, and the ability to integrate, newly-acquired businesses and joint ventures, maintain and develop their customers, and achieve synergies and other expected benefits and cost savings therefrom; capacity levels and efficiencies, within facilities, within major product markets and within the industries in which the Company participates as a whole; the effect of disruption in the business of suppliers, customers, facilities and shipping operations due to adverse weather, casualty events, equipment breakdowns, labor shortages, interruption in utility services, civil unrest, international conflicts (especially in light of Russia’s invasion of Ukraine), terrorist activities or other causes; changes in customer demand, inventories, spending patterns, product choices, and supplier choices; risks associated with doing business internationally, including economic, political and social instability (especially in light of Russia’s invasion of Ukraine), foreign currency exchange rate exposure and the acceptance of the Company’s products in global markets; the ability to improve and maintain processes and business practices to keep pace with the economic, competitive and technological environment; the effect of inflation, interest rate increases and economic recession, which may negatively impact the Company’s operations and financial results; deviation of actual results from estimates and\/or assumptions used by the Company in the application of its significant accounting policies; the level of imports and import prices in the Company’s markets; the impact of environmental laws and regulations or the actions of the United States Environmental Protection Agency or similar regulators which increase costs or limit the Company’s ability to use or sell certain products; the impact of increasing environmental, greenhouse gas emission and sustainability regulations and considerations; the impact of judicial rulings and governmental regulations, both in the United States and abroad, including those adopted by the United States Securities and Exchange Commission and other governmental agencies as contemplated by the Coronavirus Aid, Relief and Economic Security (CARES) Act, the Consolidated Appropriations Act, 2021, the American Rescue Plan Act of 2021, and the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010; the effect of healthcare laws in the United States and potential changes for such laws, especially in light of the COVID-19 pandemic, which may increase the Company’s healthcare and other costs and negatively impact the Company’s operations and financial results; the effects of tax laws in the United States and potential changes for such laws, which may increase the Company’s costs and negatively impact the Company’s operations and financial results; cyber security risks; the effects of privacy and information security laws and standards; and other risks described from time to time in the Company’s filings with the United States Securities and Exchange Commission, including those described in “Part I – Item 1A. – Risk Factors” of the Company’s Annual Report on Form 10-K for the fiscal year ended May 31, 2023. Forward-looking statements should be construed in the light of such risks. The Company notes these factors for investors as contemplated by the Act. It is impossible to predict or identify all potential risk factors. Consequently, readers should not consider the foregoing list to be a complete set of all potential risks and uncertainties. Readers are cautioned not to place undue reliance on any forward-looking statements, which speak only as of the date made. The Company does not undertake, and hereby disclaims, any obligation to update any forward-looking statements, whether as a result of new information, future developments or otherwise, except as required by applicable law. WORTHINGTON ENTERPRISES, INC. CONSOLIDATED STATEMENTS OF EARNINGS (LOSS) (In thousands, except per share amounts) Three Months Ended Twelve Months Ended May 31, May 31, 2024 2023 2024 2023 Net sales $ 318,801 $ 368,802 $ 1,245,703 $ 1,418,496 Cost of goods sold 239,802 274,642 960,684 1,094,908 Gross profit 78,999 94,160 285,019 323,588 Selling, general and administrative expense 73,210 75,910 283,471 287,118 Impairment of goodwill and long-lived assets 32,975 - 32,975 484 Restructuring and other expense (income), net 28,624 (13 ) 29,327 (367 ) Separation costs 240 2,961 12,705 6,534 Operating income (loss) (56,050 ) 15,302 (73,459 ) 29,819 Other income (expense): Miscellaneous expense, net (11,145 ) - (17,129 ) (4,497 ) Loss on extinguishment of debt - - (1,534 ) - Interest income (expense), net 9 (2,609 ) (1,587 ) (18,298 ) Equity in net income of unconsolidated affiliates 40,388 51,257 167,716 153,262 Earnings (loss) before income taxes (26,798 ) 63,950 74,007 160,286 Income tax expense 4,986 13,825 39,027 34,535 Net earnings (loss) from continuing operations (31,784 ) 50,125 34,980 125,751 Net earnings (loss) from discontinued operations (265 ) 84,038 82,841 143,419 Net earnings (loss) (32,049 ) 134,163 117,821 269,170 Net earnings (loss) attributable to noncontrolling interests (263 ) 4,260 7,197 12,642 Net earnings (loss) attributable to controlling interest $ (31,786 ) $ 129,903 $ 110,624 $ 256,528 Amounts attributable to controlling interest: Net earnings (loss) from continuing operations $ (31,521 ) $ 50,125 $ 35,243 $ 125,751 Net earnings (loss) from discontinued operations (265 ) 79,778 75,381 130,777 Net earnings (loss) attributable to controlling interest $ (31,786 ) $ 129,903 $ 110,624 $ 256,528 Earnings (loss) per share from continuing operations - basic $ (0.64 ) $ 1.03 $ 0.72 $ 2.59 Earnings (loss) per share from discontinued operations - basic (0.01 ) 1.64 1.53 2.69 Net earnings (loss) per share attributable to controlling interest - basic $ (0.65 ) $ 2.67 $ 2.25 $ 5.28 Earnings (loss) per share from continuing operations - diluted $ (0.64 ) $ 1.01 $ 0.70 $ 2.55 Earnings (loss) per share from discontinued operations - diluted (0.01 ) 1.60 1.50 2.64 Net earnings (loss) per share attributable to controlling interest - diluted $ (0.65 ) $ 2.61 $ 2.20 $ 5.19 Weighted average common shares outstanding - basic 49,437 48,643 49,195 48,566 Weighted average common shares outstanding - diluted 49,437 49,779 50,348 49,386 Cash dividends declared per share $ 0.16 $ 0.31 $ 0.96 $ 1.24 CONSOLIDATED BALANCE SHEETS WORTHINGTON ENTERPRISES, INC. (In thousands) May 31, 2024 2023 Assets Current assets: Cash and cash equivalents $ 244,225 $ 422,268 Receivables, less allowances of $343 and $803 at May 31, 2024 and May 31, 2023, respectively 199,798 224,863 Inventories Raw materials 66,040 91,988 Work in process 11,668 19,189 Finished products 86,907 83,322 Total inventories 164,615 194,499 Income taxes receivable 17,319 1,681 Prepaid expenses and other current assets 47,936 46,301 Current assets of discontinued operations - 978,725 Total current assets 673,893 1,868,337 Investment in unconsolidated affiliates 144,863 138,041 Operating lease assets 18,667 24,686 Goodwill 331,595 336,178 Other intangibles, net of accumulated amortization of $83,242 and $73,308 at May 31, 2024 and May 31, 2023, respectively 221,071 230,851 Other assets 21,342 14,339 Property, plant and equipment: Land 8,657 12,120 Buildings and improvements 123,478 139,514 Machinery and equipment 321,836 403,885 Construction in progress 24,504 24,779 Total property, plant and equipment 478,475 580,298 Less: accumulated depreciation 251,269 323,883 Total property, plant and equipment, net 227,206 256,415 Non-current assets of discontinued operations - 782,071 Total assets $ 1,638,637 $ 3,650,918 Liabilities and equity Current liabilities: Accounts payable $ 91,605 $ 126,743 Accrued compensation, contributions to employee benefit plans and related taxes 41,974 46,782 Dividends payable 9,038 18,330 Other accrued items 29,061 37,801 Current operating lease liabilities 6,228 6,682 Income taxes payable 470 8,918 Current maturities of long-term debt - 264 Current liabilities associated of discontinued operations - 472,038 Total current liabilities 178,376 717,558 Other liabilities 62,243 71,766 Distributions in excess of investment in unconsolidated affiliate 111,905 117,297 Long-term debt 298,133 689,718 Noncurrent operating lease liabilities 12,818 18,326 Deferred income taxes 84,150 82,346 Non-current liabilities of discontinued operations - 132,279 Total liabilities 747,625 1,829,290 Shareholders' equity - controlling interest 888,879 1,696,011 Noncontrolling interests 2,133 125,617 Total equity 891,012 1,821,628 Total liabilities and equity $ 1,638,637 $ 3,650,918 WORTHINGTON ENTERPRISES, INC. CONSOLIDATED STATEMENTS OF CASH FLOWS (In thousands) Three Months Ended Twelve Months Ended May 31, May 31, 2024 2023 2024 2023 Operating activities: Net earnings (loss) $ (32,049 ) $ 134,163 $ 117,821 $ 269,170 Adjustments to reconcile net earnings (loss) to net cash provided by operating activities: Depreciation and amortization 12,423 28,292 80,704 112,800 Impairment of goodwill and long-lived assets 32,975 1,800 34,377 2,596 Provision for (benefit from) deferred income taxes 1,919 4,670 2,762 (15,528 ) Impairment of investment in note receivable 11,170 - 11,170 - Loss on extinguishment of debt - - 1,534 - Bad debt expense (income) (21 ) (1,678 ) (450 ) 2,108 Equity in net income of unconsolidated affiliates, net of distributions 2,552 (4,545 ) 5,722 79,870 Net loss (gain) on sale of assets 29,329 530 28,980 (4,458 ) Stock-based compensation 3,394 5,420 16,688 19,178 Changes in assets and liabilities, net of impact of acquisitions: Receivables 342 (17,386 ) 50,078 143,089 Inventories 8,597 (6,843 ) 63,596 160,116 Accounts payable (5,866 ) 45,089 (65,401 ) (150,400 ) Accrued compensation and employee benefits 2,498 10,206 468 (23,226 ) Other operating items, net (22,094 ) 29,516 (58,073 ) 30,049 Net cash provided by operating activities 45,169 229,234 289,976 625,364 Investing activities: Investment in property, plant and equipment (11,336 ) (17,651 ) (83,527 ) (86,366 ) Acquisitions, net of cash acquired (12,315 ) - (42,035 ) (56,088 ) Proceeds from sale of assets, net of selling costs 28 108 865 35,653 Investment in note receivable - - (14,900 ) - Investment in non-marketable equity securities (681 ) (500 ) (2,296 ) (770 ) Net proceeds from sale of investment in ArtiFlex - - - 35,795 Excess distributions from unconsolidated affiliate - - 1,085 - Net cash used by investing activities (24,304 ) (18,043 ) (140,808 ) (71,776 ) Financing activities: Dividend from Worthington Steel at Separation - - 150,000 - Distribution to Worthington Steel at Separation - - (218,048 ) - Net proceeds (repayments) from short-term borrowings(1) - (791 ) 172,187 (45,183 ) Principal payments on long-term obligations - (776 ) (393,890 ) (6,685 ) Proceeds from issuance of common shares, net of tax withholdings 3,961 1,631 (11,399 ) (1,780 ) Payments to noncontrolling interests - (8,475 ) (1,920 ) (20,235 ) Dividends paid (7,911 ) (15,078 ) (56,819 ) (59,244 ) Net cash used by financing activities (3,950 ) (23,489 ) (359,889 ) (133,127 ) Increase (decrease) in cash and cash equivalents 16,915 187,702 (210,721 ) 420,461 Cash and cash equivalents at beginning of period 227,310 267,244 454,946 34,485 Cash and cash equivalents at end of period(2) $ 244,225 $ 454,946 $ 244,225 $ 454,946 (1) Net proceeds in fiscal 2024 consisted of borrowings under Worthington Steel’s short-term credit facilities assumed by Worthington Steel in conjunction with the Separation. (2) The cash flows related to discontinued operations have not been segregated in the periods presented herein. Accordingly, the consolidated statements of cash flows include the results from continuing and discontinued operations. WORTHINGTON ENTERPRISES, INC. NON-GAAP FINANCIAL MEASURES \/ PRO FORMA FINANCIAL DATA (In thousands, except units and per share amounts) The following provides a reconciliation of non-GAAP financial measures, including adjusted operating income (loss), adjusted earnings before income taxes, adjusted income tax expense (benefit), adjusted net earnings (loss) from continuing operations attributable to controlling interest, adjusted earnings per diluted share from continuing operations attributable to controlling interest and adjusted effective tax rate, from their most comparable GAAP measure for the three and 12 months ended May 31, 2024, and May 31, 2023. Refer to the Use of Non-GAAP Measures and Definitions section herein and non-GAAP footnotes below for further information on these measures . Three Months Ended May 31, 2024 Operating Income Earnings Before Income Taxes Income Tax Expense (Benefit) Net loss from Continuing Operations(1) Diluted EPS - Continuing Operations Effective Tax Rate GAAP $ (56,050 ) $ (26,798 ) $ 4,986 $ (31,521 ) (0.64 ) (18.8 %) Impairment of goodwill and long-lived assets 32,975 32,975 - 32,975 0.66 Restructuring and other expense, net 28,624 28,624 (4,609 ) 24,015 0.48 Separation costs 240 240 (81 ) 159 - Non-cash charges in miscellaneous expense 11,077 7 11,084 0.22 Pension settlement charge in equity income - 1,040 (244 ) 796 0.02 Non-GAAP $ 5,789 $ 47,158 $ 9,913 $ 37,508 $ 0.74 20.9 % Three Months Ended May 31, 2023 Operating Income Earnings Before Income Taxes Income Tax Expense (Benefit) Net Earnings from Continuing Operations(1) Diluted EPS - Continuing Operations Effective Tax Rate GAAP $ 15,302 $ 63,950 $ 13,825 $ 50,125 $ 1.01 21.6 % Corporate costs eliminated at Separation 10,370 10,370 (2,375 ) 7,995 0.16 Restructuring and other income, net (13 ) (13 ) (1 ) (14 ) - Separation costs 2,961 2,961 (424 ) 2,537 0.05 Sale-leaseback gain in equity income - (2,063 ) 472 (1,591 ) (0.03 ) Non-GAAP $ 28,620 $ 75,205 $ 16,153 $ 59,052 $ 1.19 21.5 % Twelve Months Ended May 31, 2024 Operating Income (Loss) Earnings Before Income Taxes Income Tax Expense (Benefit) Net Earnings from Continuing Operations(1) Diluted EPS - Continuing Operations Effective Tax Rate GAAP $ (73,459 ) $ 74,007 $ 39,027 $ 35,243 $ 0.70 52.6 % Corporate costs eliminated at Separation 19,343 19,343 (4,643 ) 14,700 0.29 Impairment of goodwill and long-lived assets 32,975 32,975 - 32,975 0.65 Restructuring and other expense, net 29,327 29,327 (4,737 ) 24,590 0.49 Separation costs 12,705 12,705 (3,049 ) 9,656 0.19 Non-cash charges in miscellaneous expense - 19,180 (1,922 ) 17,258 0.34 Loss on extinguishment of debt - 1,534 (368 ) 1,166 0.02 Gain on sale of assets in equity income - (2,780 ) 662 (2,118 ) (0.04 ) Pension settlement charge in equity income - 1,040 (244 ) 796 0.02 One-time tax effects of Separation - - 9,197 9,197 0.18 Non-GAAP $ 20,891 $ 187,331 $ 44,131 $ 143,463 $ 2.84 23.5 % Twelve Months Ended May 31, 2023 Operating Income Earnings Before Income Taxes Income Tax Expense (Benefit) Net Earnings from Continuing Operations(1) Diluted EPS - Continuing Operations Effective Tax Rate GAAP $ 29,819 $ 160,286 $ 34,535 $ 125,751 $ 2.55 21.5 % Corporate costs eliminated at Separation 41,479 41,479 (9,499 ) 31,980 0.65 Impairment of long-lived assets 484 484 (111 ) 373 0.01 Restructuring and other income, net (367 ) (367 ) 84 (283 ) (0.01 ) Separation costs 6,534 6,534 (1,496 ) 5,038 0.11 Pension settlement charge - 4,774 (1,093 ) 3,681 0.07 Loss on sale of investment in Artiflex - 16,059 (3,678 ) 12,381 0.25 Sale lease-back gain in equity income - (2,063 ) 472 (1,591 ) (0.03 ) Non-GAAP $ 77,949 $ 227,186 $ 49,856 $ 177,330 $ 3.60 21.9 % (1) Excludes the impact of noncontrolling interest To further assist in the analysis of segment results for the three and twelve months ended May 31, 2024, and May 31, 2023, the following supplemental information has been provided. Reconciliations of adjusted EBITDA from continuing operations and adjusted EBITDA margin from continuing operations to the most comparable GAAP measures, earnings (loss) before income taxes and earnings (loss) before income taxes margin. Three Months Ended Twelve Months Ended May 31, May 31, (in thousands) 2024 2023 2024 2023 Volume Consumer Products 15,660 19,070 66,632 74,137 Building Products 3,579 3,787 14,157 14,630 Total reportable segments 19,239 22,857 80,789 88,767 Other 160 163 523 574 Consolidated 19,399 23,020 81,312 89,341 Net sales Consumer Products $ 125,336 $ 148,831 $ 495,259 $ 555,309 Building Products 153,551 174,533 618,973 717,069 Total reportable segments 278,887 323,364 1,114,232 1,272,378 Other 39,914 45,438 131,471 146,118 Consolidated $ 318,801 $ 368,802 $ 1,245,703 $ 1,418,496 Adjusted EBITDA from continuing operations Consumer Products $ 17,061 $ 29,523 $ 69,598 $ 97,370 Building Products 51,628 64,737 210,128 222,197 Total reportable segments 68,689 94,260 279,726 319,567 Other (5,521 ) (525 ) (28,727 ) (13,542 ) Consolidated $ 63,168 $ 93,735 $ 250,999 $ 306,025 Adjusted EBITDA margin from continuing operations Consumer Products 13.6 % 19.8 % 14.1 % 17.5 % Building Products 33.6 % 37.1 % 33.9 % 31.0 % Consolidated 19.8 % 25.4 % 20.1 % 21.6 % Equity income by unconsolidated affiliate WAVE(1) $ 27,534 $ 24,252 $ 103,298 $ 85,933 ClarkDietrich(1) 11,560 25,365 59,827 80,494 Other(2) 1,294 1,640 4,591 (13,165 ) Consolidated $ 40,388 $ 51,257 $ 167,716 $ 153,262 (1) Equity income contributed by Worthington Armstrong Venture (“WAVE”) and ClarkDietrich is associated with our Building Products segment (2) Other includes the Company’s share of the equity earnings of Taxi Workhorse, LLC and ArtiFlex Manufacturing, LLC, on a historical basis through August 2, 2022. A reconciliation from net earnings (loss) before income taxes from continuing operations to the non-GAAP financial measure of adjusted EBITDA from continuing operations for the each of the periods presented is provided below. For periods prior to the Separation, the Company has also included adjusted EBITDA from continuing operations and adjusted EBITDA margin from continuing operations, on a pro forma basis, to illustrate estimated effects of the post-Separation relationship between the Company and Worthington Steel under the parties’ transition services agreement and long-term steel supply agreement. This pro forma financial information assumes the Separation occurred on June 1, 2022, the first day of our fiscal 2023. For further information on this pro forma presentation, refer to the Use of Non-GAAP Measures and Definitions section included herein. Three Months Ended Twelve Months Ended May 31, May 31, May 31, May 31, (in thousands) 2024 2023 2024 2023 Earnings (loss) before income taxes (GAAP) $ (26,798 ) $ 63,950 $ 74,007 $ 160,286 Less: net loss attributable to noncontrolling interest (263 ) - (263 ) - Net earnings (loss) before income taxes attributable to controlling interest (26,535 ) 63,950 74,270 160,286 Interest expense (income), net (9 ) 2,609 1,587 18,298 EBIT (subtotal) (26,544 ) 66,559 75,857 178,584 Corporate costs eliminated at Separation(1) - 10,370 19,343 41,479 Impairment of goodwill and long-lived assets 32,975 - 32,975 484 Restructuring and other expense (income), net 28,624 (13 ) 29,327 (367 ) Separation costs 240 2,961 12,705 6,534 Non-cash charges in miscellaneous expense(2) 11,077 - 19,180 4,774 Loss on investment in ArtiFlex(3) - - - 16,059 Loss on extinguishment of debt(4) - - 1,534 - Gain on sale of assets in equity income(5) - (2,063 ) (2,780 ) (2,063 ) Pension settlement charge in equity income(6) 1,040 - 1,040 - Adjusted EBIT (subtotal) 47,412 77,814 189,181 245,484 Depreciation and amortization 12,424 11,773 48,663 45,975 Stock-based compensation 3,332 4,148 13,155 14,566 Adjusted EBITDA from continuing operations (non-GAAP) $ 63,168 $ 93,735 $ 250,999 $ 306,025 Earnings (loss) before income taxes margin (8.4 %) 17.3 % 5.9 % 11.3 % Non-GAAP adjusted EBITDA margin from continuing operations 19.8 % 25.4 % 20.1 % 21.6 % Pro forma adjusted EBITDA from continuing operations n\/a $ 92,868 $ 249,399 $ 302,357 Pro forma adjusted EBITDA margin from continuing operations n\/a 25.2 % 20.0 % 21.3 % Non-GAAP Footnotes: (1) Reflects reductions in certain corporate overhead costs that no longer exist post-Separation. These costs were included in continuing operations as they represent general corporate overhead that was historically allocated to the Company’s former steel processing business but did not meet the requirements to be presented as discontinued operations. (2) Reflects the following non-cash charges in miscellaneous expense: Pre-tax charges of $8,010 and $4,774 from separate pension lift-out transaction completed in February 2024 and August 2022, respectively, to transfer the pension benefit obligation under The Gerstenslager Company Bargaining Unit Employees’ Pension Plan to third-party insurance companies. A pre-tax charge of $11,170 during the current year quarter due to the write-down of an investment in notes receivable that was determined to be other than temporarily impaired. (3) On August 3, 2022, the Company sold its 50% noncontrolling equity investment in ArtiFlex Manufacturing, LLC, resulting in a pre-tax loss of $16,059 in equity income related to the sale. (4) Reflects a pre-tax loss of $1,534 realized in connection with the July 28, 2023, early redemption of the 2026 Notes. The loss resulted primarily from unamortized issuance costs and discount included in the carrying amount of the 2026 Notes and the acceleration of the remaining unamortized loss in equity related to a treasury lock derivative instrument executed in connection with the issuance of the 2026 Notes. (5) Reflects the following activity within equity income associated with the sale or divestiture of assets at Taxi Workhorse Holdings, LLC: A net gain of $2,780 associated with the divestiture of the Brazilian operations. A net gain of $2,063 related to a sale-leaseback transaction during the three months ended May 31, 2023. (6) Reflects the settlement of certain participant balances within the pension plan maintained by WAVE. WORTHINGTON ENTERPRISES, INC. USE OF NON-GAAP MEASURES AND DEFINITIONS NON-GAAP MEASURES. These materials include certain financial measures that are not calculated and presented in accordance with accounting principles generally accepted in the United States (“GAAP”). The non-GAAP financial measures typically exclude items that management believes are not reflective of, and thus should not be included when evaluating the performance of the Company’s ongoing operations. Management uses the non-GAAP financial measures to evaluate the Company’s performance, engage in financial and operational planning, and determine incentive compensation. Management believes these non-GAAP measures provide useful supplemental information and additional perspective on the performance of the Company’s ongoing operations and should not be considered as an alternative to the comparable GAAP measure. Additionally, management believes these non-GAAP measures allow for meaningful comparisons and analysis of trends in the Company’s businesses and enables investors to evaluate operations and future prospects in the same manner as management. The following provides an explanation of each non-GAAP measure presented in these materials: Adjusted operating income is defined as operating income (loss) excluding the items listed below, to the extent naturally included in operating income (loss). Adjusted net earnings from continuing operations is defined as net earnings from continuing operations attributable to controlling interest (“net earnings from continuing operations”) excluding the after-tax effect of the excluded items outlined below. Adjusted earnings per diluted share from continuing operations (“Adjusted EPS from continuing operations”) – is defined as adjusted net earnings from continuing operations divided by diluted weighted-average shares outstanding. Adjusted EBITDA – Adjusted EBITDA is defined as Adjusted Earnings Before Interest, Taxes, Depreciation, and Amortization. EBITDA is calculated by adding or subtracting, as appropriate, interest expense, net, income tax expense, depreciation, and amortization to\/from net earnings from continuing operations attributable to controlling interest, which is further adjusted to exclude impairment and restructuring charges (gains) as well as other items that management believes are not reflective of, and thus should not be included when evaluating the performance of its ongoing operations, as outlined below. Adjusted EBITDA also excludes stock-based compensation due to its non-cash nature, which is consistent with how management assesses operating performance. At the segment level, adjusted EBITDA includes expense allocations for centralized corporate back-office functions that exist to support the day-to-day business operations. Public company and other governance costs are held at the corporate-level. Adjusted EBITDA margin is calculated by dividing adjusted EBITDA by net sales. Exclusions from Non-GAAP Financial Measures Management believes it is useful to exclude the following items from the non-GAAP measures presented in this report for its own and investors’ assessment of the business for the reasons identified below: Impairment charges are excluded because they do not occur in the ordinary course of our ongoing business operations, are inherently unpredictable in timing and amount, and are non-cash, which we believe facilitates the comparison of historical, current and forecasted financial results. are excluded because they do not occur in the ordinary course of our ongoing business operations, are inherently unpredictable in timing and amount, and are non-cash, which we believe facilitates the comparison of historical, current and forecasted financial results. Restructuring activities , which can result in both discrete gains and\/or losses, consist of established programs that are not part of our ongoing operations, such as divestitures, closing or consolidating facilities, employee severance (including rationalizing headcount or other significant changes in personnel), and realignment of existing operations (including changes to management structure in response to underlying performance and\/or changing market conditions). These items are excluded because they are not part of the ongoing operations of our underlying business. , which can result in both discrete gains and\/or losses, consist of established programs that are not part of our ongoing operations, such as divestitures, closing or consolidating facilities, employee severance (including rationalizing headcount or other significant changes in personnel), and realignment of existing operations (including changes to management structure in response to underlying performance and\/or changing market conditions). These items are excluded because they are not part of the ongoing operations of our underlying business. Separation costs , which consist of direct and incremental costs incurred in connection with the completed Separation are excluded as they are one-time in nature and are not expected to occur in period following the Separation. These costs include fees paid to third-party advisors, such as investment banking, audit and other advisory services as well as direct and incremental costs associated with the Separation of shared corporate functions. Results in the current fiscal year also include incremental compensation expense associated with the modification of unvested short and long-term incentive compensation awards, as required under the employee matters agreement executed in conjunction with the Separation. , which consist of direct and incremental costs incurred in connection with the completed Separation are excluded as they are one-time in nature and are not expected to occur in period following the Separation. These costs include fees paid to third-party advisors, such as investment banking, audit and other advisory services as well as direct and incremental costs associated with the Separation of shared corporate functions. Results in the current fiscal year also include incremental compensation expense associated with the modification of unvested short and long-term incentive compensation awards, as required under the employee matters agreement executed in conjunction with the Separation. Loss on early extinguishment of debt is excluded because it does not occur in the normal course of business and may obscure analysis of trends and financial performance. Additionally, the amount and frequency of this type of charge is not consistent and is significantly impacted by the timing and size of debt extinguishment transactions. is excluded because it does not occur in the normal course of business and may obscure analysis of trends and financial performance. Additionally, the amount and frequency of this type of charge is not consistent and is significantly impacted by the timing and size of debt extinguishment transactions. Pension settlement charges are excluded because due to their non-cash nature and the fact that they do not occur in the normal course of business and may obscure analysis of trends and financial performance. These transactions typically result from the transfer of all or a portion of the total projected benefit obligation to third-party insurance companies. PRO FORMA FINANCIAL INFORMATION. These materials include certain financial data and operating metrics that are presented on a pro forma basis to illustrate the estimated effects of the Separation of Worthington Steel from the historical combined company, which was consummated on December 1, 2023, and to give effect to divested operations historically presented within Other. Management believes these pro forma measures provide investors with useful supplemental financial information regarding the performance of the Company’s continuing operations after reflecting the Separation. This pro forma financial information has been prepared based upon the best available information and management estimates and is subject to assumptions and adjustments described in the accompanying footnotes. They are not intended to be a complete presentation of the Company’s financial position or results of operations had the Separation occurred as of and for the periods indicated. In addition, the pro forma financial information is being provided for informational purposes only and is not necessarily indicative of the Company’s future results of operations or financial condition had the Separation and related transactions been completed on the dates assumed. Management believes these assumptions and estimates are reasonable, given the information available on the date of this release. Sonya L. Higginbotham Senior Vice President Chief of Corporate Affairs, Communications and Sustainability 614.438.7391 sonya.higginbotham@wthg.com Marcus A. Rogier Treasurer and Investor Relations Officer 614.840.4663 marcus.rogier@wthg.com 200 West Old Wilson Bridge Rd. Columbus, Ohio 43085 WorthingtonEnterprises.com","filter_flag":1}
{"title":"Spectaire’s Advanced AireCore Technology to be Integrated into American Ag Energy’s Biomass-to-Fuel Reactors","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfd3cd24d0f9808894c5ffccf2d&url=https%3a%2f%2fmarkets.businessinsider.com%2fnews%2fstocks%2fspectaire-s-advanced-airecore-technology-to-be-integrated-into-american-ag-energy-s-biomass-to-fuel-reactors-1033465371&c=18176257609171448488&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfd3cd24d0f9808894c5ffccf2d&url=https%3a%2f%2fmarkets.businessinsider.com%2fnews%2fstocks%2fspectaire-s-advanced-airecore-technology-to-be-integrated-into-american-ag-energy-s-biomass-to-fuel-reactors-1033465371&c=18176257609171448488&mkt=en-us","summary":"Initial purchase order and delivery of AireCore units completed in May 2024Integration of AireCore units enables precise tuning of American Ag ...","published":"Mon, 10 Jun 2024 05:26:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=10, tm_hour=5, tm_min=26, tm_sec=0, tm_wday=0, tm_yday=162, tm_isdst=0)","news_source":"Business Insider","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Spectaire’s Advanced AireCore Technology to be Integrated into American Ag Energy’s Biomass-to-Fuel Reactors","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Initial purchase order and delivery of AireCore units completed in May 2024Integration of AireCore units enables precise tuning of American Ag ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Sustainable Energy\" \"new products\"&format=rss","text":"Initial purchase order and delivery of AireCore units completed in May 2024 Integration of AireCore units enables precise tuning of American Ag Energy’s reactors to expand market share in $91 Billion Biomass Energy Market Collaboration expands Spectaire’s market reach into a new industry vertical WATERTOWN, Mass., June 10, 2024 (GLOBE NEWSWIRE) -- Spectaire Holdings Inc. (NASDAQ: SPEC) (“Spectaire”), a leading innovator in mass spectrometry solutions, is pleased to announce a purchase order and delivery of its advanced AireCore units to American Ag Energy, a Boston-based high-efficiency biomass-to-fuel reactor company. American Ag Energy specializes in transforming agricultural waste into gaseous fuel for existing gas-fired equipment. Their cutting-edge biomass reactors are designed for optimal fuel production from diverse feedstocks, with a real-time closed-loop system that adjusts parameters based on sensor feedback. The integration of Spectaire's AireCore mass spectrometers into American Ag Energy's product gas analysis loop marks a significant advancement in their technology. Spectaire’s miniature mass spectrometers provide detailed insights into the fuel gas composition, enabling precise tuning of reactor operating parameters for maximum fuel production and efficiency. Spectaire's technology can simultaneously measure expected product gases, delivering a comprehensive overview of gas composition. \"We are proud to support American Ag Energy with our AireCore units,\" said Brian Semkiw, CEO of Spectaire. \"Our mass spectrometers will deliver the detailed analytical capabilities needed to optimize their reactors, enhancing fuel output and operational efficiency. This collaboration underscores our commitment to advancing sustainable energy solutions through innovative technology.\" American Ag Energy's innovative approach to biomass conversion offers a sustainable solution for agricultural waste while contributing to the broader goal of reducing carbon emissions. By leveraging Spectaire's mass spectrometry technology, they are set to achieve unprecedented levels of efficiency and performance. \"Integrating Spectaire's mass spectrometers into our reactors is a game-changer for us,\" said Dr. Richard Rosen, CEO of American Ag Energy. \"The detailed analysis provided by AireCore will allow us to fine-tune our processes and maximize fuel production from various feedstocks. This partnership is a significant step forward in our mission to create efficient, sustainable energy solutions.\" For more information about American Ag Energy and their groundbreaking biomass-to-fuel technology, please visit American Ag Energy's website . About Spectaire Spectaire (NASDAQ: SPEC) is a leading provider of mass spectrometry solutions, committed to delivering innovative and precise analytical instruments for various industries. Our cutting-edge technologies enable businesses to achieve higher efficiency, better performance, and sustainability. About American Ag Energy American Ag Energy is a Boston-based startup dedicated to developing high-efficiency biomass-to-fuel reactors. Utilizing agricultural waste as feedstock, their reactors produce gaseous fuel for use in existing gas-fired equipment, promoting sustainable energy and reducing carbon emissions. For additional information, contact: IR@spectaire.com Dave Gentry RedChip Companies, Inc. 1-800-733-2447 1-407-644-4256 SPEC@redchip.com Forward-Looking Statements This release contains certain forward-looking statements within the meaning of the federal securities laws. These forward-looking statements generally are identified by the words “believe,” “project,” “expect,” “anticipate,” “estimate,” “intend,” “strategy,” “future,” “opportunity,” “plan,” “may,” “should,” “would,” “will continue,” “will likely result” and similar expressions. The forward-looking statements are based on the current expectations of the management of Spectaire and are inherently subject to uncertainties and changes in circumstances and their potential effects and speak only as of the date of such statement. There can be no assurance that future developments will be those that have been anticipated. Forward-looking statements reflect material expectations and assumptions, including, without limitation, expectations, and assumptions. Such expectations and assumptions are inherently subject to uncertainties and contingencies regarding future events and, as such, are subject to change. Forward-looking statements involve a number of risks, uncertainties or other factors that may cause actual results or performance to be materially different from those expressed or implied by these forward-looking statements. These risks and uncertainties include, but are not limited to, those discussed and identified in public filings made by Spectaire with the U.S. Securities and Exchange Commission (the “SEC”) and the following: Spectaire’s ability to operate as a going concern; Spectaire’s requirement of significant additional capital; Spectaire’s limited operating history; Spectaire’s history of losses; Spectaire’s ability to attract qualified management; Spectaire’s ability to adapt to rapid and significant technological change and respond to introductions of new products in order to remain competitive; the loss of, or nonperformance by, one or more significant customers; disruptions of Spectaire’s manufacturing operation; changes in governmental regulations reducing demand for Spectaire’s products or increasing Spectaire’s expenses; the effects of global health crises on Spectaire’s business plans, financial condition and liquidity; changes or disruptions in the securities markets; legislative, political or economic developments; Spectaire’s failure to obtain any necessary permits or comply with laws and regulations and other regulatory requirements; accidents, equipment breakdowns, labor disputes or other unanticipated difficulties or interruptions; potential cost overruns or unanticipated expenses in development programs; potential legal proceedings; and Spectaire’s failure to obtain or maintain insurance covering all of Spectaire’s operations. Should one or more of these risks or uncertainties materialize or should any of the assumptions made by the management of Spectaire prove incorrect, actual results may vary in material respects from those projected in these forward-looking statements. All subsequent written and oral forward-looking statements concerning matters addressed herein and attributable to Spectaire or any person acting on its behalf are expressly qualified in their entirety by the cautionary statements contained or referred to herein. Except to the extent required by applicable law or regulation, Spectaire undertakes no obligation to update these forward-looking statements to reflect events or circumstances after the date hereof to reflect the occurrence of unanticipated events. No Offer This communication is for informational purposes only and shall neither constitute an offer to sell nor the solicitation of an offer to buy any securities, nor shall there be any sale of securities in any jurisdiction in which the offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such jurisdictions. No offering of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the Securities Act or an exemption therefrom.","filter_flag":1}
{"title":"PCIM roundup: Power ICs address efficiency and power density","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfd3cd24d0f9808894c5ffccf2d&url=https%3a%2f%2fwww.electronicproducts.com%2fpcim-roundup-power-ics-address-efficiency-and-power-density%2f&c=9153815327619493125&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfd3cd24d0f9808894c5ffccf2d&url=https%3a%2f%2fwww.electronicproducts.com%2fpcim-roundup-power-ics-address-efficiency-and-power-density%2f&c=9153815327619493125&mkt=en-us","summary":"At PCIM Europe, power IC manufacturers showcased their latest SiC, GaN and Si power ICs that deliver performance, size and cost improvements.","published":"Wed, 12 Jun 2024 19:41:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=12, tm_hour=19, tm_min=41, tm_sec=0, tm_wday=2, tm_yday=164, tm_isdst=0)","news_source":"Electronic Products","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"PCIM roundup: Power ICs address efficiency and power density","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"At PCIM Europe, power IC manufacturers showcased their latest SiC, GaN and Si power ICs that deliver performance, size and cost improvements.","news_image":"http:\/\/www.bing.com\/th?id=OVFT.RFfZWM_yMV06Q89oSsPP_i&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":696.0,"news_imagemaxheight":392.0,"query":"https:\/\/www.bing.com\/news\/search?q=\"Sustainable Energy\" \"new products\"&format=rss","text":"At PCIM Europe 2024, power semiconductor manufacturers unveiled their latest innovations and advances in wide-bandgap (WBG) technologies, including silicon carbide (SiC) and gallium nitride (GaN), and silicon (Si) power devices. While Si power devices still dominate the power electronics market, there is significant adoption of SiC and GaN power ICs in a variety of applications, including e-mobility, data centers, industrial control and renewable energy. Many of these new products address the power designers’ most important objectives in component selection: efficiency, cost, reliability, size and operating temperature range. A newly released Power Electronics Survey, conducted by Power Electronics News, finds that the most critical objective is efficiency, according to 81% of respondents, followed by cost (76%), reliability (69%), size (54%) and operating temperature range (47%). Many of these products also tackle the power designers’ biggest pain points—thermal management, electromagnetic interference (EMI), high-voltage design and power density. The survey finds the biggest challenge is thermal management, according 71% of survey respondents. This is followed by EMI (68%), control system design (50%), circuit layout (47%) power density (46%) and high-voltage design (45%). Over the next decade, power designers overwhelmingly expect higher power density to be the most important power electronics trend, according to 35% of respondents, followed by integration with other technologies, e.g., IoT and smart grid, (20%), higher efficiency (17%) and adoption of WBG semiconductors (15%). When asked about emerging megatrends having the biggest impact on power electronics in the next five years, renewable energy\/infrastructure and EVs were the clear winners. Renewable energy\/energy infrastructure topped the list, according to 36% of survey respondents, followed by EVs (34%), AI (17%) and IoT\/IIoT (11%). Renewable energy like solar and wind power requires highly reliable and advanced power electronics for efficient energy conversion, grid integration and energy storage solutions. For EVs, the demand is driving the need for more efficient power electronics, including advanced battery management systems, high-efficiency chargers and powertrain components. Although silicon MOSFETs and IGBTs are commonly used by power designers, the adoption of GaN and SiC continues to grow. According to the survey, 20% of respondents use SiC devices and 16% use GaN (5% for <400 V, 5% for >800 V and 6% for 650-800 V). At PCIM Europe, WBG semiconductors take center stage, especially SiC power devices, with a wide range of new product launches. Here is a selection of power semiconductors launched at the conference, starting with SiC devices. WBG power semiconductors at PCIM SiC power ICs Alpha and Omega Semiconductor Limited (AOS) has expanded its surface-mount and module package portfolio options for the second generation 650-V to 1,200-V αSiC MOSFETs. These devices can be used in a range of applications, including xEV charging, solar inverters and industrial power supplies. The new packages give designers the added flexibility of multiple system optimization options to further maximize system efficiency while streamlining their manufacturing process, AOS said. The first new surface-mount package is available for the AOBB040V120X2Q 1,200 V\/40-mΩ αSiC MOSFET in a standard D2PAK-7L package. Replacing traditional through-hole packages, this AEC-Q101-qualified product is suited for applications such as on-board chargers (OBCs) where efficient cooling can be provided by vias and backside PCB heat sinks, simplifying the assembly flow and maximizing the power density, AOS said. AOS is also releasing its GTPAK surface-mount package with top-side cooling features. In designs where a top-side-mounted heat sink is viable, the direct heat path from the GTPAK minimizes thermal resistance and enables higher power dissipation for more effective PCB routing, the company. The first AOS product in GTPAK is the AOGT020V120X2 1,200 V\/20-mΩ αSiC MOSFET for high-efficiency solar inverter and industrial power supply applications. The new AOH010V120AM2 1,200 V\/10 mΩ half-bridge αSiC module is the first product in the company’s new AlphaModule high power baseplate-less module family. Featuring press-fit pins and an integrated thermistor, it is a standard footprint module that enables the replacement of multiple discrete devices. It also simplifies both the mechanical and electrical design by providing a clear separation of electrical and cooling paths, AOS said. Single modules are suitable for residential solar inverters, while several modules in parallel will scale to power levels required for fast DC charging stations. AOS will showcase the expanded package options in hall 9, booth #519. With the launch of its 400-V CoolSiC MOSFETs, Infineon Technologies AG extends the portfolio to voltages below 650 V. The new CoolSiC MOSFET 400-V family, based on the second generation (G2) CoolSiC technology introduced earlier this year , targets the AC\/DC stage of AI servers. They also are suited for solar and energy storage systems (ESS), inverter motor control, industrial and auxiliary power supplies (SMPS) as well as solid-state circuit breakers for residential buildings. Implemented in a multi-level PFC, the AC\/DC stage of the AI server power supply unit (PSU) can achieve a power density of more than 100 W\/in³ and 99.5% efficiency, which is an improvement of 0.3 percentage points over solutions using 650-V SiC MOSFETs. It also leverages the company’s CoolGaN transistors in the DC\/DC stage. The combination of high-performance MOSFETs and transistors enables the power supply to deliver more than 8 kW with an increase in power density by a factor of more than three compared to current solutions, Infineon said. The new MOSFET portfolio is comprised of 10 products: five R DS(on) classes from 11 to 45 mΩ in Kelvin-source TOLL and D²PAK-7 packages with .XT package interconnect technology. The CoolSiC technology in combination with the .XT interconnect enables the devices to handle power peaks and transients caused by sudden changes in the power requirements of the AI processor. They also deliver high performance under operating conditions with higher junction temperatures. Engineering samples of the CoolSiC MOSFET 400-V portfolio are now available. Production will start in October 2024. Infineon is exhibiting its Si and SiC-based solutions in hall 7, booth #740 and GaN products in the adjacent booth #169. Microchip Technology Inc. has launched a new on-board charger (OBC) solution that simplifies OBC designs, by providing automotive-qualified digital, analog, connectivity and power devices, including the dsPIC33C digital signal controller (DSC), the MCP14C1 isolated SiC gate driver and mSiC MOSFETs, in an industry-standard D2PAK-7L XL package. Leveraging the benefits of each of these components, the solution delivers higher system efficiency and reliability. The higher efficiency and reliability are thanks to the dsPIC33 DSC’s advanced control functions, the MCP14C1 gate driver’s high-voltage reinforced isolation with robust noise immunity and the mSiC MOSFETs’ reduced switching losses and improved thermal management capabilities, according to the company. The key technologies in the solution support the other functions of an OBC, including communication interfaces, security, sensors, memory and timing. The programmable solution provides ready-to-use software modules for power factor correction (PFC), DC\/DC conversion, communication and diagnostic algorithms. The software modules in the dsPIC33 DSC are designed to optimize performance, efficiency and reliability, while offering customization to meet specific OEM requirements. The key components in the OBC solution include the following AEC-Q100-qualified devices. The dsPIC33C DSC featuresa high-performance DSP core, high-resolution pulse-width modulation (PWM) modules and high-speed analog-to-digital converters (ADCs), making it suited for power conversion applications. It is functional-safety ready and supports the AUTOSAR ecosystem. The MCP14C1 isolated SiC gate driver is available in a SOIC-8 wide-body package supporting reinforced isolation and SOIC-8 narrow-body supporting basic isolation. The MCP14C1 is optimized to drive mSiC MOSFETs via undervoltage lockout (UVLO) for V GS = 18-V gate drive split output terminals. Microchip said this simplifies implementation and eliminates the need for an external diode. The device also offers high noise immunity and high common-mode transient immunity (CMTI). The mSiC MOSFET is housed in a D2PAK-7L XL surface-mount package. It includes five parallel source sense leads to reduce switching losses, increase current capability and decrease inductance, Microchip said. This device supports 400-V and 800-V battery voltages. The dsPIC33C DSC, the MCP14C1 isolated SiC gate driver and the mSiC MOSFET are now available. Microchip is exhibiting in hall 7, booth #640. Navitas Semiconductor has launched its Gen-3 ‘Fast’ (G3F) 650-V and 1,200-V SiC MOSFETs, which are optimized for fast switching, high efficiency and increased power density in applications such as AI data-center power supplies, OBCs, fast electric vehicle (EV) roadside super-chargers and solar\/ESS. Optimized for high-speed switching, the G3F family offers a 40% improvement to hard-switching figures-of-merits (FOMs) compared to the competition in CCM TPPFC systems, according to Navitas. This will enable an increase in the wattage of next-generation AI power PSUs up to 10 kW, and power per rack from 30 kW to 100-120 kW. Based on a proprietary “trench-assisted planar” technology, the G3F GeneSiC MOSFETs are reported to offer better-than-trench MOSFET performance, while also providing higher robustness, manufacturability and cost than the competition. “The trench-assisted planar technology enables an extremely low R DS(ON) increase versus temperature, which results in the lowest power losses across the complete operating range and offers up to 20% lower R DS(ON) under real-life operation at high temperatures compared to competition,” Navitas said. In addition, the high speed performance with high efficiency enables up to 25°C lower case temperature, and up to 3× longer life than competitive SiC products, the company said. Navitas also noted that the GeneSiC MOSFETs have the highest-published 100%-tested avalanche capability, 30% longer short-circuit withstand time and tight threshold voltage distributions for easy paralleling. One product example cited is the 1,200-V\/34-mΩ (G3F34MT12K) G3F FETs for the EV market. These devices enable Navitas’ new 22-kW, 800-V bidirectional OBC and 3-KW DC\/DC converter to achieve a power density of 3.5 kW\/L and a peak efficiency of 95.5%. The G3F devices are available in industry-standard packages from D2PAK-7 to TO-247-4, designed for high-power and high-reliability applications. Parts are available now to qualified customers. Navitas is exhibiting in hall 9, booth #544. Nexperia’s 650-V SiC diode portfolio now meets automotive and a wider range of industrial applications. The company has announced that its 650-V, 10-A SiC Schottky diode is now automotive qualified (PSC1065H-Q​) and available in real-two-pin (R2P) DPAK (TO-252-2) packaging, making it suited for a variety of applications in EVs and other automobiles. The company also added industrial-grade devices with current ratings of 6 A, 16 A and 20 A in TO-220-2, TO-247-2, and D2PAK-2 packaging. These diodes target high-voltage and high-current applications including switched-mode power supplies, AC\/DC and DC\/DC converters, battery-charging infrastructure, motor drives and UPS as well as photovoltaic (PV) inverters for sustainable energy production. The merged PiN Schottky (MPS) structure of these devices is reported to offer advantages over similar competing SiC diodes, including “outstanding” robustness against surge currents. This eliminates the need for additional protection circuitry, reducing system complexity and enabling hardware designers to achieve higher efficiency with smaller form factors in rugged high-power applications, the company said. Nexperia said its “thin SiC” technology delivers a thinner substrate (one-third of its original thickness), which reduces the thermal resistance from the junction to the back-side metal. This results in lower operating temperature, higher reliability and device lifetime, higher surge current capability and lower forward voltage drop, the company said. Nexperia is exhibiting in hall 9, booth #412. Qorvo has claimed the industry’s first 4-mΩ SiC junction field effect transistor (JFET) in a TOLL package. It was designed for circuit-protection applications including solid-state circuit breakers, where low resistance, superior thermal performance, small size and reliability are critical. The UJ4N075004L8S offers the industry’s lowest on-resistance, with an R DS(on) of 4-mΩ in the 650-V to 750-V class of power devices in standard discrete packages, Nexperia said. The low R DS(on) helps reduce heat generation, and when coupled with a compact TOLL package, enables a solution size that is 40% smaller than competing devices in TO-263 packages. The company said the 750-V 4-mΩ SiC JFET will revolutionize circuit breakers by supporting the space limitations of electromechanical protection devices and operating without the need for sophisticated cooling systems. It also is expected to help accelerate the transition to semiconductor-based solid-state circuit breakers (SSCBs). The JFETs provide the ability to turn off at very high inrush currents during circuit faults and the new JFET can also withstand high instantaneous junction temperatures without degradation or parametric drift, the company said. Samples are available, followed by full production in the fourth quarter of 2024, including additional JFET options (750 V with 5-mΩ and 1,200 V with 8- mΩ ratings in TO-247 packaging). The company is exhibiting in hall 7, booth #406. Rohm Semiconductor has unveiled four new models as part of the TRCDRIVE pack series with 2-in-1 SiC molded modules, which will reduce the size of EV inverters. The new devices include two 750-V-rated BSTxxxD08P4A1x4 and two 1,200-V-rated BSTxxxD12P4A1x1 devices, optimized for xEV traction inverters. The TRCDRIVE pack supports up to 300 kW and features high power density and a unique terminal configuration, which solves some of the biggest challenges—miniaturization, higher efficiency and fewer person-hours—of traction inverters, the company said. Rohm said the TRCDRIVE pack solves a difficult challenge for SiC power devices, which is achieving low loss in a small size. The TRCDRIVE pack reduces size by using a unique structure that maximizes heat dissipation area. When combined with Rohm’s 4th generation SiC MOSFETs with low ON resistance, the devices offer a power density 1.5 times higher than that of general SiC molded modules, which contributes to the miniaturization of xEV inverters. The modules also feature control signal terminals using press-fit pins, enabling easy connection to reduce installation time. The low inductance (5.7 nH) is achieved by maximizing the current path and using a two-layer bus-bar structure for the main wiring, contributing to lower losses during switching. The company said it has established a mass production system similar to discrete products, making it possible to increase production capacity by 30 times compared to conventional SiC case-type modules. The TRCDRIVE pack is scheduled to be launched by March 2025 with a lineup of 12 models in different package sizes and mounting patterns. Rohm is developing a 6-in-1 product with a built-in heat sink that is expected to speed up traction inverter design and a model rollout that is tailored to a variety of design specifications. The company is exhibiting in hall 9, booth #304. SemiQ Inc. has added 1,700-V SiC Schottky discrete diodes and dual diode packs to its QSiC product line. The new devices target a range of demanding applications including switched-mode power supplies, UPS, induction heaters, welding equipment, DC\/DC converters, solar inverters and EV charging stations. Featuring zero reverse recovery current and near-zero switching loss, SemiQ’s 1,700-V SiC Schottky diode technologies offer enhanced thermal management that reduces the need for cooling. For engineers, this translates into high-performance designs that minimize system heat dissipation and allow the use of smaller heat sinks for cost and space savings. All of the new products support fast switching across operating junction temperatures (Tj) of -55°C to 175°C. The GP3D050B170X (bare die) and GP3D050B170B (TO-247-2L package) discrete diode are rated for maximum forward currents of 110 A and 151 A, respectively. The GHXS050B170S-D3 and GHXS100B170S-D3 dual diode packs are rugged modules supplied in a SOT-227 package, with maximum forward currents of 110 A and 214 A, respectively. They offer high performance at high frequencies with low loss and low EMI operation, delivering high energy efficiency and reliability by minimizing interference. Other features include low stray inductance, high junction temperature operation, rugged and easy mounting and an internally isolated package for optimal insulation and thermal conductivity. In addition, the low junction-to-case thermal resistance enables efficient heat dissipation, ensuring stability under high-power conditions and the modules can be easily connected in parallel due to the positive temperature coefficient (Tc) of the forward voltage (Vf), the company said. All parts have been tested at voltages exceeding 1,870 V and have undergone avalanche testing up to 1,250 mJ. The devices are showcased at SemiQ’s stand at Alfatec’s booth in hall 7, booth #418. SemiQ also unveiled the latest additions to its QSIC family of MOSFET half-bridge modules in the S3 package. These 1,200-V modules feature industry-standard 62-mm footprints with a height of 26.3 mm. The new power modules address the size, weight and power demands of challenging applications, including induction heaters, welding equipment, UPS, photovoltaic and wind inverters, ESS, high-voltage DC\/DC converters and EV battery charging systems. They are available in 600-A (GCMX003A120S3B1-N) and 400-A (GCMX005A120S3B1-N) variants. WeEn Semiconductors has launched new families of SiC MOSFETs and Schottky barrier diodes (SBDs) in TSPAK packages. This package with enhanced thermal performance is designed to improve power density and reliability. The TSPAK MOSFET and SBD devices target power management in applications ranging from automotive charging and OBC applications to PV inverters and high-power-density PSUs. These SiC modules offer a variety of configuration options for design flexibility. Advanced feature options include synchronized chip current sharing, integrated temperature sensors, top-side cooling and the latest clip-bond technologies. Originally developed for automotive applications, TSPAK devices combine top-side cooling capability with low thermal impedance for enhanced thermal performance. By removing the PCB thermal resistance from the thermal dissipating path, the junction-ambient thermal resistance improves by 16-19%, the company said. This supports high reliability by enabling a greater number of power cycles than conventional packaging and providing the increased power densities needed in compact system designs. Other features include low circuit inductance and low EMC noise to help improve performance and reduce filtering requirements. The TSPAK MOSFETs are available in 650-V, 750-V and 1,200-V options with resistances ranging from 12 mΩ to 150 mΩ. TSPAK SBDs are available with current ratings of 10 to 40 A in 650-V, 750-V, and 1,200-V variants. The company is exhibiting in hall 9, booth #538. Recommended PCIM preview: Demos, sneak peeks and new products Gan power ICs Efficient Power Conversion Corp. (EPC) has introduced its 50-V, 8.5-mΩ EPC2057 GaN FET in a tiny 1.5 × 1.2-mm footprint, specifically designed for high-power USB-C devices including those used in consumer electronics, in-car charging and e-mobility. The small footprint enables more efficient power adapters and chargers. The 50-V GaN FET with ultra-low on-resistance of 8.5 mΩ is reported to significantly reduce power losses and enhance overall efficiency. In addition, the GaN technology enables faster switching speeds, improving power density and reducing the size of passive components for more compact and lightweight designs. The EPC90155 development board is available in a half bridge featuring the EPC2057 GaN FET. It is designed for 40-V maximum operating voltage and 10-A maximum output current. The 2 × 2-inch (50.8 × 50.8 mm) board contains all critical components. The EPC2057 is priced at $0.67 each in quantities of 2,500. The EPC90155 development board is priced at $200.00 each. EPC is exhibiting in hall 9, booth #318. Infineon also unveiled two new CoolGaN product technologies: the CoolGaN bidirectional switch (BDS) and CoolGaN Smart Sense. The CoolGaN BDS family offers bidirectional switches available at 40 V, 650 V and 850 V. Applications include mobile device USB ports, battery management systems, inverters and rectifiers. Targeting consumer USB-C charger and adapter applications, the CoolGaN Smart Sense products offer lossless current sensing, simplifying design and further reducing power losses. They also integrate transistor switch functions in one package. The CoolGaN BDS high voltage will be available at 650 V and 850 V and feature a true normally-off monolithic bidirectional switch with four modes of operation, Infineon said. Based on the gate injection transistor (GIT) technology, the high-voltage devices have two separate gates with substrate terminal and independent isolated control and offer high performance under repetitive short-circuit conditions. One BDS can be used instead of four conventional transistors, delivering higher efficiency, density and reliability as well as cost savings. They can optimize performance by replacing back-to-back switches in single-phase H4 PFC and HERIC inverters and three-phase Vienna rectifiers and also can be implemented in single-stage AC power conversion in AC\/DC or DC\/AC topologies. Optimized to replace back-to-back MOSFETs used as disconnect switches in battery-powered consumer products, the CoolGaN BDS 40 V is a normally-off, monolithic bidirectional switch based on the company’s in-house Schottky Gate GaN technology. In this application, the new device offers a 50-75 percent PCB savings and more than 50 percent reduction in power losses. The first 40-V CoolGaN BDS product has a 6 mΩ R DS(on) . More products will follow. The CoolGaN Smart Sense products offer 2-kV electrostatic discharge withstand and can connect to controller current sense for peak current control and overcurrent protection. The current sense response time is ~200 ns, which is equal or less than common controller blanking time, Infineon said. Engineering samples of the CoolGaN BDS 40 V are available now for 6 mΩ, followed by 4 mΩ and 9 mΩ samples in the third quarter of 2024. Samples of the CoolGaN BDS 650 V will be available in the fourth quarter of 2024, and 850 V will follow in early 2025. CoolGaN Smart Sense samples will be available in August 2024. Infineon is exhibiting its Si and SiC-based solutions in hall 7, booth #740 and GaN products in the adjacent booth #169. Texas Instruments Inc. (TI) has launched its first intelligent power module (IPM) and the industry’s first 650-V three-phase GaN IPM for 250-W motor drive applications. The DRV7308 GaN IPM addresses the key challenges—efficiency, size and cost—that engineers typically face when designing major home appliances and heating, ventilation and air-conditioning (HVAC) systems. The integrated device enables more than 99% inverter efficiency by integrating TI’s GaN technology. In addition, the high integration, combined with its efficiency, can reduce solution size by up to 55%, eliminating the need for an external heat sink. It also offers optimized acoustic performance and lowers system costs, TI said. Addressing the need to meet worldwide efficiency standards for appliances and HVAC systems such as SEER, MEPS, Energy Star and Top Runner, the DRV7308 helps engineers meet these standards to deliver more than 99% efficiency and improve thermal performance, with 50% reduced power losses compared to existing solutions, according to TI. Thanks to GaN technology, the new GaN IPM delivers high power density in a 12 × 12-mm QFN package, claiming the industry’s smallest IPM for 150-W to 250-W motor-drive applications. The DRV7308 also is reported to deliver industry-low dead time and low propagation delay, both less than 200 ns, enabling higher pulse-width modulation (PWM) switching frequencies that reduce audible noise and system vibration. Together, in combination with the higher power efficiency and integration, the DRV7308 also reduces motor heating, which can improve reliability and extend the lifetime of the system. Pre-production quantities of the DRV7308 GaN IPM, available in a 12 × 12-mm, 60-pin QFN package, are available for purchase now on TI.com. Pricing starts at $5.50 in quantities of 1,000. TI has additional GaN IPMs under development to meet the needs of higher and lower power applications. An evaluation module and a 250-W motor inverter reference design are available. The DRV7308EVM evaluation module is priced at $250. TI is exhibiting in hall 7, booth #652. Si MOSFETS and IGBTs at PCIM Silicon MOSFETs and IGBTs are commonly used power semiconductor devices. According to the Power Electronics Survey, 21% of survey respondents use IGBTs and 38% use silicon MOSFETs in their designs. A few key reasons: silicon-based MOSFETs are cost effective, widely available and suit a range of applications, while IGBTs are widely used in medium-to-high power applications, such as motor control and industrial equipment, thanks to their high breakdown voltage and low saturation voltage. Complementing its WBG semiconductor portfolio, Infineon also introduced the 600-V CoolMOS 8 high-voltage SJ MOSFET product family, aimed at advanced power supply applications. Enabling cost-effective Si-based solutions, these devices feature an integrated fast body diode, making them suitable for a range of applications such as server and industrial SMPS, EV chargers and micro-solar. The new family delivers several improvements over the CoolMOS CFD7 and CoolMOS P7 series. At 10 V, the 600-V CoolMOS 8 SJ MOSFET family offers an 18 percent lower gate charge (Q g ) than the CFD7 and 33 percent lower than the P7. At 400 V, the product family offers a 50 percent lower output capacitance C OSS than the CFD7 and the P7. The turn-off losses (E oss ) also have been reduced by 12 percent compared to the CFD7 and the P7 and the reverse recovery charge (Q rr ) is three percent lower compared to the CFD7. In addition, the family offers a 14 to 42 percent improvement in thermal performance, compared to the previous generation. Infineon claims the new devices offer the lowest reverse recovery time (t rr ) on the market, and together, these features deliver high efficiency and reliability in soft-switching topologies such as LLC and ZVS phase-shift full-bridge as well as high performance in PFC, TTF and other hard-switching topologies. The 600-V CoolMOS 8 SJ MOSFETs come in SMD QDPAK, TOLL and ThinTOLL 8 × 8 packages. Samples are now available. Infineon is exhibiting its Si and SiC-based solutions in hall 7, booth #740 and GaN products in the adjacent booth #169. Onsemi’s new 7th generation 1,200-V QDual3 IGBT power modules are designed for renewable energy applications, offering increased power density and delivering up to 10% more output power than other available competing products, according to the company. Based on the latest Field Stop 7 (FS7) IGBT technology, the 800-A QDual3 module delivers high efficiency to reduce system costs and simplify designs. Onsemi said in a 150-KW inverter, the QDual3 module will dissipate 200 W less in losses compared to the closest competition, which significantly reduces heat-sink size. The QDual3 is designed to operate in harsh conditions and is suited for high-power electronics converters such as central inverters in solar farms, ESS, commercial agricultural vehicles (CAVs) and industrial motor drives. Two new products—the NXH800H120L7QDSG and SNXH800H120L7QDSG— are available. Using the QDual3 modules, manufacturers can build a solar inverter and ESS that output more power in the same system size, enabling more efficient energy management and storage capabilities, and allowing for a smoother integration of solar power into the grid, onsemi said. In addition, the modules mitigate the intermittency of solar energy by storing excess power in an ESS to ensure a reliable and consistent energy flow. For large systems, the modules can be paralleled to increase the output power up to a couple of MWs. The QDual3 IGBT module features an 800-A half-bridge configuration that integrates the latest Gen7 trench FS IGBT and diode technology using onsemi’s advanced packaging techniques to reduce switching and conduction losses. With FS7 technology, the die size is reduced by 30%, allowing more die per module. This increases the power density to enable the maximum current capacity up to 800 A or higher, the company said, and with an IGBT Vce(sat) as low as 1.75 V (175°C) and low E off , the 800-A QDual3 module dissipates 10% lower energy losses than the closest alternative. Onsemi is exhibiting in hall 9, booth #332. Joining the company’s new families of SiC MOSFETs and Schottky barrier diodes (SBDs), WeEn Semiconductors also has announced a new range of high-performance and rugged IGBTs. The new 650-V and 1,200-V devices incorporate a fast recovery anti-parallel diode and claim extremely low leakage currents and exceptional conduction and switching characteristics at both high and low junction temperatures. Based on an advanced fine trench gate FS technology, the new IGBTs provide a more uniform electric field within the chip, support higher breakdown voltages and offer improved dynamic control, WeEn said. They also offer an optimized trade-off between conduction and switching losses, as well as an enhanced EMI design, maximizing efficiency in a variety of mid- to high-switching-frequency power conversion designs. The IGBTs offer ratings of 650 V\/75 A, 1,200 V\/40 A and 1,200 V\/75 A and are supplied in TO247 or TO247-4L packages depending on the selected device. All of the devices will operate with a maximum junction temperature (T j ) of 175°C and have undergone high-voltage H3TRB (high-humidity, high-temperature and high-voltage reverse bias) and 100%-biased HTRB (high-temperature reverse bias) tests up to this maximum. The IGBTs are available in bare die, discrete and module product variants to meet a variety of applications. These include solar inverters, motor control systems, UPS and welding. A positive temperature coefficient simplifies parallel operation in applications where higher performance is required.","filter_flag":1}
{"title":"8 Best Quantum Computing Stocks to Buy in 2024","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfd3cd24d0f9808894c5ffccf2d&url=https%3a%2f%2fmoney.usnews.com%2finvesting%2farticles%2fbest-quantum-computing-stocks-to-buy&c=16111967692830689408&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfd3cd24d0f9808894c5ffccf2d&url=https%3a%2f%2fmoney.usnews.com%2finvesting%2farticles%2fbest-quantum-computing-stocks-to-buy&c=16111967692830689408&mkt=en-us","summary":"Global governments are pouring billions into the sector, as are companies in major industries like banking, pharmaceuticals and sustainable energy ... time developing new products, knowing ...","published":"Wed, 07 Jun 2023 07:31:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=7, tm_hour=7, tm_min=31, tm_sec=0, tm_wday=2, tm_yday=158, tm_isdst=0)","news_source":"U.S. News & World Report","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"8 Best Quantum Computing Stocks to Buy in 2024","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Global governments are pouring billions into the sector, as are companies in major industries like banking, pharmaceuticals and sustainable energy ... time developing new products, knowing ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Sustainable Energy\" \"new products\"&format=rss","text":"While the financial markets are consumed with all things artificial intelligence, many investors are missing the boat on the next massive technology breakthrough – quantum computing. Quantum computers handle scientific calculations that otherwise could take millions of years to solve using traditional computers. The technology's growth rate is impressive. The quantum computing market is valued at $1.3 billion in 2024 and is expected to rise to $5.3 billion by 2029, according to Markets and Markets. That's a compound annual growth rate of 32.7%. The industry is in the midst of a giant sea change, as quantum computing morphs from a sheer numbers enterprise to prioritize qubit quality, complicated problem solving and error corrections. Global governments are pouring billions into the sector, as are companies in major industries like banking, pharmaceuticals and sustainable energy. \"Quantum technology could create value worth trillions of dollars within the next decade,\" consulting firm McKinsey stated in a recent study. \"Accelerating technological breakthroughs, increasing investment flows, startup proliferation and promises of capable quantum systems by 2030 signal it's time for business leaders to begin planning their quantum computing strategies.\" With abundant promise in the sector, which quantum computing stocks offer the most growth potential in 2024? These eight technology companies are in the mix: QUANTUM COMPUTING STOCK YTD RETURN AS OF MAY 14 Microsoft Corp. (ticker: MSFT) 11.0% International Business Machines Corp. (IBM) 3.3% Nvidia Corp. (NVDA) 84.4% Alphabet Inc. (GOOG, GOOGL) 21.9% Honeywell International Inc. (HON) -2.6% Amazon.com Inc. (AMZN) 23.1% Intel Corp. (INTC) -37.8% Taiwan Semiconductor Manufacturing Co. Ltd. (TSM) 46.7% Microsoft Corp. (MSFT) Microsoft shares are up by 11% year to date through May 14, as the technology titan remains on the leading edge of quantum computing innovation. The company has partnered with the U.S. Defense Advanced Research Projects Agency (DARPA) to use Microsoft Azure Quantum technology to develop a utility-scale quantum computer modeled on topological qubits, which scientists believe to be more stable than other qubits, mainly because they're easier to store securely. The company also recently announced a big step forward in its partnership with private quantum computing developer Quantinuum (formed by the merging of Honeywell Quantum Solutions and Cambridge Quantum) to make advanced computers more reliable, which would aid in commercializing quantum computing. Microsoft also says its new error-correction algorithm can run up to 14,000 individual experiments without errors, about 800 times better than any previous quantum computing algorithm. Both companies believe the breakthrough will chop about two years off quantum computing development, which is good news for the industry and Microsoft investors. International Business Machines Corp. (IBM) IBM is only up 3.3% against the S&P 500's 10% gain on a year-to-date basis, but it delivers a robust 4% dividend yield and a solid quantum computing storyline. Big Blue has made it clear it sees the quantum computing journey as having three phases – the era of emergence, the era of utility and quantum of scale. The company says quantum technology is in the second phase in mid-2024, as quantum computers can now solve complex data problems that go light years beyond classical computing. IBM has planted itself squarely in the journey, having installed quantum processors across the globe with its Quantum Computation Centers in New York; Fraunhofer, Germany; the University of Tokyo in Japan; and at the Ohio-based Cleveland Clinic. An IBM Quantum System One computer recently went online at Rensselaer Polytechnic Institute in New York, and there are plans for quantum computing centers at Yonsei University in South Korea in 2024 and at the Basque Foundation for Science in Spain in 2025. IBM rolled out its new quantum computers last year, allowing the generation of specific results at a scale of 100-plus qubits (that's the sweet spot for quantum computing, scientists say) and putting IBM exactly where it wants to be: at the head of the line, ahead of classical supercomputing approaches. Toss in IBM's higher dividend, which pays out $1.67 per share every quarter, and a new target price of $185 (it's at $167.36 per share as of May 14) from analyst firm Bernstein, and IBM is making an excellent case for itself as a quantum computing pioneer and a dependable stock play. Nvidia Corp. (NVDA) Nvidia shares continue their historic run, up 84.4% year to date and 215.6% over the past year as of May 14. While Nvidia has made its reputation in technology hotspots like artificial intelligence and machine learning, it also plays a considerable role in the quantum computing market, as it's one of the leading providers of graphics processing units, or GPUs, used to power faster computing performance. The company's DGX Quantum represents the first computing system to merge GPUs and quantum computing. The company reinforced its commitment to quantum technology with a March announcement touting its new Quantum Cloud data center, which will \"incorporate artificial intelligence chips and systems that work together to simulate a quantum computer,\" the company stated in a news release. While Nvidia doesn't build quantum computers, it plans to provide easy access to third-party quantum systems in the near future. The company's new \"bridging technology\" will offer companies an open-source platform for integrating and programming quantum processing units (QPUs), GPUs and CPUs in one system via its Nvidia CUDA-Q open programming model. Nvidia is also engaged in two real-world quantum computing initiatives: one with Rolls-Royce Holdings PLC (OTC: RYCEY) to develop more efficient jet engines and the other with FZJ, a research institution in Germany, to construct a new laboratory specializing in classical quantum supercomputer systems. Given its high price (at $913.56 per share) and the long runway required for a quantum computing payoff, investors will need deep pockets and even deeper patience with Nvidia – but that's a price prepared investors are likely happy to pay. Alphabet Inc. (GOOG, GOOGL) Alphabet's stock is up 21.9% so far in 2024, soundly thrashing the S&P 500's return as of May 14. Known for its industry-leading web search engine technology, Alphabet-owned Google has also been developing quantum computing solutions since 2006. Commercially, Google is creating a software suite that helps technology companies build quantum algorithms via its Google Quantum AI initiative. It's also in the quantum processing business with its Alphabet 72-qubit quantum processor, which reduces data-testing error rates while working seamlessly with the software applications and control electronics needed to operate in the quantum sector. Google is having some fun with its quantum computing strategy. In March, the company also announced a new three-year, $5 million worldwide quantum computing competition in partnership with the XPRIZE Foundation and the Geneva Science and Diplomacy Anticipator Foundation. The competition, which targets the expanding quantum technology supplier and early user communities, will award cash prizes to developers who generate the best quantum computing algorithms and applications that solve real-world problems. Cost-cutting measures and solid revenue growth should continue boosting Alphabet until its big bets on AI and quantum computing start paying off. Honeywell International Inc. (HON) Honeywell shares are down 2.6% in 2024, but its quantum computing investments – at about $300 million – are beginning to bear fruit. The aforementioned Honeywell Quantinuum, formed in 2021, is a solid player in the quantum computing sector. Its quantum hardware and software computing power is used extensively in industries such as chemicals, pharmaceuticals and manufacturing. The company was recently valued at $5 billion. In April, Quantinuum became the first company to clear the so-called \"three nines\" dilemma, which it describes as \"an iconic, inherent 99.9% 2-qubit physical gate fidelity – at which point many of the error-correcting codes required for universal fault-tolerant quantum computing would successfully be able to squeeze errors out of the system.\" Quantinuum solved the three-nines problem via a demonstration of 99.914(3)% 2-qubit gate fidelity, which showed \"repeatable performance across all qubit pairs\" on the company's H1-1 system. \"This demonstrates what will fast become the expected standard for the entire quantum computing sector,\" Quantinuum noted. Honeywell should continue to profit from its big investment in quantum computing. Robert W. Baird analyst Peter Arment has issued a \"buy\" rating on HON stock and set a $223 price target. Trading at $203.21 per share as of May 14, HON also offers a decent forward dividend yield of 2.1%. Amazon's stock price is up 23.1% on a year-to-date basis, and it is making significant progress in rapidly expanding its presence in the quantum computing sector. Its cornerstone is the AWS Center for Quantum Networking, which opened in 2022. The center is taking a long-term approach to developing quantum network solutions and its Amazon Quantum Solutions Lab. Amazon also recently rolled out Amazon Braket, a cloud-based quantum computing service that researches and develops new quantum computing technologies. The retail giant is also making strides on the microchip side of the quantum computing business. In November 2023, the company rolled out a new quantum computer chip focused on enhancing error correction. Amazon built the prototype in-house, marking another major step for Amazon Web Services as a chip fabrication facilitator. The company noted the chip could suppress bit flip mistakes 100 times faster than current error correction times using a \"passive error correction approach.\" \"We've shown that we can theoretically achieve quantum error correction six times more efficiently than with standard error correction approaches,\" AWS senior vice president Peter DeSantis said at a conference in Las Vegas in November. Amazon is yet another deep-pocketed player that can take its time developing new products, knowing that its massive revenue base can help. It breezed through its first-quarter earnings period, with Q1 sales up 13% to $143.3 billion, higher than the estimated $142.5 billion pegged by analysts. Amazon expects to keep that rolling in Q2, estimating revenues of up to $149 billion in an April 30 conference call. Intel Corp. (INTC) Intel's stock has been on a downward spiral in 2024, and shares have shed an alarming 37.8% so far this year. The slide came after the company cited new restrictions on semiconductor sales to China-based Huawei Technologies. Sales for the quarter ended in March rose 9% on an annual basis and the stock has seen a slight recovery from its lows, but Intel's guidance for the current quarter fell short of analyst expectations. However, a 31% rise in PC chip sales and a moderate boost in data center chips were buried in the Q1 numbers, suggesting Intel is on the right track with its Core Ultra processors. Now, Intel is leaning on its chipmaking prowess to get an edge in scalable silicon-based quantum processors. In early May, the company announced a breakthrough in the quantum chipmaking market, as company researchers unveiled a 300-millimeter cryogenic probing process. The system \"collects high-volume data on the performance of spin qubit devices across whole wafers using complementary metal oxide semiconductor (CMOS) manufacturing techniques,\" the company stated in a May 1 white paper. That development could help speed up quantum computing efforts, allowing industry researchers to gather more data to analyze uniformity, an \"important step needed to scale up quantum computers.\" The company also released Tunnel Falls, its newest quantum computing chip, in 2023. The 12-qubit silicon chip should contribute to quantum research and help make executing quantum algorithms and applications faster and more efficient. Taiwan Semiconductor Manufacturing Co. Ltd. (TSM) TSM stock is up significantly in 2024, with a 46.7% gain through May 14, as the company continues its industry-leading chip foundry work with high-profile clients like Apple Inc. (AAPL) and Nvidia. The company manufactures approximately 90% of all global advanced chips for artificial intelligence and quantum computing applications, giving it a big leg up as both sectors expand commercially in 2024. The Taiwan-based company has laid the groundwork for its quantum computing efforts with a five-year strategic partnership with Taiwan's Ministry of Science and Technology. That partnership is the tentpole in TSM's plan to use its new cloud computing platform to develop quantum computing applications that will one day be commercially available.","filter_flag":1}
{"title":"UL Solutions Acquires Germany-Based Battery Testing and Simulation Company BatterieIngenieure","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfd3cd24d0f9808894c5ffccf2d&url=https%3a%2f%2fwww.businesswire.com%2fnews%2fhome%2f20240521327052%2fen%2fUL-Solutions-Acquires-Germany-Based-Battery-Testing-and-Simulation-Company-BatterieIngenieure&c=12896509185800076988&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfd3cd24d0f9808894c5ffccf2d&url=https%3a%2f%2fwww.businesswire.com%2fnews%2fhome%2f20240521327052%2fen%2fUL-Solutions-Acquires-Germany-Based-Battery-Testing-and-Simulation-Company-BatterieIngenieure&c=12896509185800076988&mkt=en-us","summary":"“The global transition to sustainable energy has increased demand for expertise ... We help our customers innovate, launch new products and services, navigate global markets and complex supply ...","published":"Wed, 22 May 2024 01:30:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=5, tm_mday=22, tm_hour=1, tm_min=30, tm_sec=0, tm_wday=2, tm_yday=143, tm_isdst=0)","news_source":"Business Wire","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"UL Solutions Acquires Germany-Based Battery Testing and Simulation Company BatterieIngenieure","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"“The global transition to sustainable energy has increased demand for expertise ... We help our customers innovate, launch new products and services, navigate global markets and complex supply ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Sustainable Energy\" \"new products\"&format=rss","text":"NORTHBROOK, Ill.--(BUSINESS WIRE)--UL Solutions Inc. (NYSE:ULS), a global leader in applied safety science, today announced our acquisition of BatterieIngenieure GmbH, a battery testing company based in Aachen, Germany, with expertise in specialized performance testing of cell, small modules and battery systems used in electric vehicles and other applications. The acquisition augments UL Solutions’ global battery testing footprint with a laboratory in Europe. BatterieIngenieure provides comprehensive testing, simulation and failure analysis of battery technologies, with distinctive expertise in battery life expectancy estimation. The company employs more than 50 people, including leading battery researchers. “ The global transition to sustainable energy has increased demand for expertise in battery performance and safety testing,” said Jennifer Scanlon, president and CEO of UL Solutions. “ This acquisition expands our capabilities and allows us to meet our customers where they are, creating new business opportunities as we pursue our mission of working for a safer world.” Founded in 2015, BatterieIngenieure operates a laboratory in Aachen and has an office in Bilbao, Spain. Prompted by increasing demand for its services, the company is currently building a larger laboratory in Aachen to replace the existing facility and add testing and simulation capacity. BatterieIngenieure has cultivated strong business relationships with leading European automotive manufacturers and original equipment manufacturers, and brings unique science and academic credentials to UL Solutions. In addition to electric vehicles, the cell, small modules and battery systems tested by BatterieIngenieure are used in stationary energy storage systems and other applications. The acquisition complements other UL Solutions battery testing capabilities and facilities, including our E-Mobility and Energy Laboratory in Changzhou, China; the Korea Advanced Battery Laboratory in Pyeongtaek, South Korea; and the North America Advanced Battery Laboratory under construction in Auburn Hills, Michigan. “ UL Solutions’ global testing, inspection and certification capabilities for product safety and its significant investments globally to support battery innovation make it the ideal partner for our company,” said Dr. Dominik Schulte, managing director and a founder of BatterieIngenieure. “ Likewise, BatterieIngenieure will contribute unique technical expertise, customer and industry relationships, and expanded capacity to UL Solutions. We are excited to join the organization’s more than 15,000 employees working for a safer world.” The transaction closed on May 22, 2024. Terms of the transaction are not being disclosed at this time. About UL Solutions A global leader in applied safety science, UL Solutions (NYSE: ULS) transforms safety, security and sustainability challenges into opportunities for customers in more than 100 countries. UL Solutions delivers testing, inspection and certification services, together with software products and advisory offerings, that support our customers’ product innovation and business growth. The UL Mark serves as a recognized symbol of trust in our customers’ products and reflects an unwavering commitment to advancing our safety mission. We help our customers innovate, launch new products and services, navigate global markets and complex supply chains, and grow sustainably and responsibly into the future. Our science is your advantage.","filter_flag":1}
{"title":"Governor Proclaims June 3 UL Solutions Day in Illinois","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfd3cd24d0f9808894c5ffccf2d&url=https%3a%2f%2fwww.businesswire.com%2fnews%2fhome%2f20240602662151%2fen%2fGovernor-Proclaims-June-3-UL-Solutions-Day-in-Illinois&c=13065461157968209144&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfd3cd24d0f9808894c5ffccf2d&url=https%3a%2f%2fwww.businesswire.com%2fnews%2fhome%2f20240602662151%2fen%2fGovernor-Proclaims-June-3-UL-Solutions-Day-in-Illinois&c=13065461157968209144&mkt=en-us","summary":"Every day, around the world, our expertise impacts more than 35 industries, including sustainable energy, building products ... customers innovate, launch new products and services, navigate ...","published":"Mon, 03 Jun 2024 02:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=3, tm_hour=2, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=155, tm_isdst=0)","news_source":"Business Wire","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Governor Proclaims June 3 UL Solutions Day in Illinois","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Every day, around the world, our expertise impacts more than 35 industries, including sustainable energy, building products ... customers innovate, launch new products and services, navigate ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Sustainable Energy\" \"new products\"&format=rss","text":"NORTHBROOK, Ill.--(BUSINESS WIRE)--UL Solutions (NYSE: ULS), a global leader in applied safety science, has been honored with a proclamation declaring June 3 UL Solutions Day in Illinois. The proclamation, signed by Illinois Gov. J.B. Pritzker, reads, in part, that “ UL Solutions was founded in the city of Chicago in 1894 and for 130 years has worked for a safer world through its vast testing, inspection and certification operations.” The proclamation also recognizes that the company serves “ as a trusted science-based safety, security and sustainability partner” to customers around the world. UL Solutions delivers testing, inspection and certification services, along with software products and advisory offerings, that support customers’ product innovation and business growth. The iconic UL Mark — a recognized symbol of trust — appears on billions of consumer and industrial products worldwide. “ We are thrilled that June 3, 2024, is UL Solutions Day in Illinois,” said Jennifer Scanlon, president and CEO of UL Solutions. “ This celebratory day is a wonderful opportunity to highlight our mission of working for a safer world. Every day, around the world, our expertise impacts more than 35 industries, including sustainable energy, building products, consumer technology and automotive and new mobility, just to name a few.” UL Solutions’ history dates back to the World’s Fair in Chicago, when founder William Henry Merrill Jr. was assigned to assess fire risks associated with electricity. This work led Merrill to form Underwriters’ Electrical Bureau, with its first testing laboratory in Chicago in 1894. The iconic Underwriters Laboratories was incorporated in 1901. Today, UL Solutions has more than 15,000 mission-driven employees around the globe. About UL Solutions A global leader in applied safety science, UL Solutions (NYSE: ULS) transforms safety, security and sustainability challenges into opportunities for customers in more than 110 countries. UL Solutions delivers testing, inspection and certification services, together with software products and advisory offerings, that support our customers’ product innovation and business growth. The UL Mark serves as a recognized symbol of trust in our customers’ products and reflects an unwavering commitment to advancing our safety mission. We help our customers innovate, launch new products and services, navigate global markets and complex supply chains, and grow sustainably and responsibly into the future. Our science is your advantage.","filter_flag":1}
