{"title":"New Liquid Chromatography Columns and Accessories: What to Know for 2023 - LCGC Chromatography Online","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmNocm9tYXRvZ3JhcGh5b25saW5lLmNvbS92aWV3L25ldy1saXF1aWQtY2hyb21hdG9ncmFwaHktY29sdW1ucy1hbmQtYWNjZXNzb3JpZXMtd2hhdC10by1rbm93LWZvci0yMDIz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmNocm9tYXRvZ3JhcGh5b25saW5lLmNvbS92aWV3L25ldy1saXF1aWQtY2hyb21hdG9ncmFwaHktY29sdW1ucy1hbmQtYWNjZXNzb3JpZXMtd2hhdC10by1rbm93LWZvci0yMDIz0gEA?oc=5","id":"CBMicWh0dHBzOi8vd3d3LmNocm9tYXRvZ3JhcGh5b25saW5lLmNvbS92aWV3L25ldy1saXF1aWQtY2hyb21hdG9ncmFwaHktY29sdW1ucy1hbmQtYWNjZXNzb3JpZXMtd2hhdC10by1rbm93LWZvci0yMDIz0gEA","guidislink":false,"published":"Mon, 01 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=121, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmNocm9tYXRvZ3JhcGh5b25saW5lLmNvbS92aWV3L25ldy1saXF1aWQtY2hyb21hdG9ncmFwaHktY29sdW1ucy1hbmQtYWNjZXNzb3JpZXMtd2hhdC10by1rbm93LWZvci0yMDIz0gEA?oc=5\" target=\"_blank\">New Liquid Chromatography Columns and Accessories: What to Know for 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">LCGC Chromatography Online<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New Liquid Chromatography Columns and Accessories: What to Know for 2023 - LCGC Chromatography Online","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmNocm9tYXRvZ3JhcGh5b25saW5lLmNvbS92aWV3L25ldy1saXF1aWQtY2hyb21hdG9ncmFwaHktY29sdW1ucy1hbmQtYWNjZXNzb3JpZXMtd2hhdC10by1rbm93LWZvci0yMDIz0gEA?oc=5\" target=\"_blank\">New Liquid Chromatography Columns and Accessories: What to Know for 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">LCGC Chromatography Online<\/font>","source.href":"https:\/\/www.chromatographyonline.com","source.title":"LCGC Chromatography Online","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"We present our annual review of new liquid chromatography (LC) columns and accessories. This article covers liquid chromatography (LC) columns and accessories commercially released after Pittcon 2022 through the 2023 conference held in Philadelphia. As in the past, LCGC sent out a survey in late 2022 and early 2023 asking vendors to supply information on products launched over the past year. Note that new products for gas chromatography (GC), LC instrumentation and software, and sample preparation are covered elsewhere. Information for this article was obtained over the course of many months; thus, it is possible that some information has been missed or misinterpreted. The reader is encouraged to check with specific vendor sites for additional product releases as well as more detailed information on product usage and attributes. Links to vendor sites are provided where applicable. The vendors that responded to the survey and their new liquid chromatography (LC) products are listed in Table I. Initial categorization of the products into small and large molecule analyses as done in recent reviews (1–3) was difficult this year because of the number of product line launches that included columns designed for both. The most reasonable segregation this year seemed to be oriented more toward the column technology the product lines were based on rather than their intended use. Many of the products and product lines released this year were based on recent, but established technologies, such as superficially porous particle (SPP) substrates. Many others were extensions of existing product lines with new surface chemistry or bonding processes. Products that fit into these descriptions as well as new chiral and size-exclusion chromatography (SEC) columns were placed in the first category entitled, “New Product Lines and Product Line Extensions.” A second category based on column hardware format was also deemed appropriate. Products in this category that were designated “Nontraditional Column Formats” include the recently introduced 1.5-mm internal diameter (i.d.), capillary, and pillar array columns. The final column-based category includes a number of product lines that have been introduced based on inert column hardware, continuing a major trend from last year (4). Accessories are also an important component to any LC system. That is why the last section is devoted to “non-column” new products that also contribute to successful liquid separations. New Product Lines and Product Line Extensions Chromanik Technologies Inc. released two new stationary phases for small molecule analysis. The SunShell C18 is built on a 90 Å, 3.5 μm SPP surface. A “unique end-capping” process using high temperature and hexamethyldichlorotrisiloxane as the end-capping reagent is reported to result in an extended pH range of 1.5–10. The company also launched Sunniest PFP & C18, a mixed pentafluorophenylpropyl and octadecyl phase on a 120 Å, 5-μm fully porous particle (FPP). The mixed phase is more hydrophobic and more stable than the PFP stationary phase alone. More information can be found on the Chromanik website. Fortis Technologies Ltd. introduced a new line of columns (Evosphere) based on monodisperse, FPP architecture. Monodispersity is reported to “add a new layer efficiency,” while retaining high capacity for increased loading (as in preparative chromatography). According to the company, this is an alternative approach to gaining efficiency compared to using SPP-based phases. The new line is based on a 100 Å pore size that is available in 1.7-, 3-, and 5-μm particle sizes. Numerous surface chemistries are available, including C18 AR (C18 and aromatic mixed bonding), C18\/PFP, diphenyl, phenyl-hexyl, AQUA (proprietary polar alkyl blend), C12, RP18-amide, and PFP. For more information see Evosphere on the Fortis Technologies website. GL Sciences introduced a new SPP-based C18 column branded as InertCore Plus C18. According to the company, the InertCore Plus C18 columns are subjected to rigorous internal quality control (QC), resulting in superior reproducibility because of shell layer homogeneity. More information can be found at the GL Sciences website. The company also launched InertSustain PFP, a column based on 1.9 μm, 100 Å, and FPP architecture. The column is recommended for highly polar molecules. Nacalai Tesque, Inc. introduced the Cosmosil RNA-RP1 column for the separation of large ribonucleic acid (RNA), messenger RNA (mRNA), and deoxyribonucleic acid (DNA) analytes, a major area of focus for the analytical community over the past few years. The column is based on a 5 μm, “super wide” fully porous silica particle modified with C18. More information can be found at the Nacalai Tesque website. A new entrant this year, Scion Instruments, released Scion Hysil columns to the market. With both a C8 and C18 surface chemistry, the Hysil phases use a “hybrid” substrate that has a particle size of 5 μm and a 120 Å pore. The company reports a pH range of 1–12 and notes that the columns are versatile for reversed-phase (RP) applications. It is also conveyed that the C18 is compatible with fully aqueous mobile phases. More information can be found on the Scion Instruments website. United Chemical Technologies released a line of their own SPP-based columns over the past year. The columns are based on a 2.7 μm, 90 Å particle that includes C18, pentafluorophenylpropyl (PFPP; note that the PFP designation may or not include the propyl spacer), and DA surface chemistries. The C18 is noted as being suitable for most acidic, neutral and basic compounds. In addition to reversed-phase applications, the PFPP can be used in both normal phase and HILIC separations and provides excellent retention and selectivity of amine-containing compounds as well as charged bases. The DA phase is described as a proprietary polyaromatic phase suitable for aromatic, conjugated and unsaturated analytes. It is also noted that the DA phase has the ability to analyze compounds that are difficult to resolve on C18. For more information, please refer to the United Chemicals website. Chiral Columns ColumnTek, LLC continued to build their portfolio by introducing Enantiocel AA (L). The column is intended for the enantioseparation of amino acids, hydroxy acids, and amino alcohols via a ligand-exchange mechanism using copper ion interaction. This is a silica-based column that has been modified with (L) penicillamine and is available in 3 and 5 μm particle sizes. Daicel launched the Chiralpak IM column, an immobilized cellulose tris (3-chloro-4-methylphenylcarbamate) based on fully porous silica. The company notes that this is an immobilized version of their Chiralcel OZ phase and that it provides expanded solvent compatibility. The columns, available in both 3 and 5 μm particle sizes, are suitable for SFC, normal phase, reversed-phase and polar organic high performance LC (HPLC) and ultrahigh-pressure LC (UHPLC) modes. For more information, please visit the Daicel website. Regis Technologies, Inc also introduced a new set of columns over the past year. The Whelk-O1 Core columns are built on a 2.7-μm SPP silica with their Whelk-O1 chiral stationary phase (based on 1-(3,5-dinitrobenzamido)- 1,2,3,4,-tetrahydrophenanthrene), which results in faster and more efficient separations compared to similar conventional fully porous silica columns. It is also notable that the phase is available in both R,R and S,S forms should specific elution order be required. More details may be found at the Regis Technologies website. SEC Columns To go with their newly released RP columns for oligonucleotide analyses, Nacalai Tesque Inc. also launched Cosmosil RNA-SEC-1000 and Cosmosil RNA-SEC-2000 for the separation of RNA molecules based on size. The company notes that the 5-μm FPP columns are modified with a “hydrophilic functional group.” For more information on these and related products, please visit the Nacalai Tesque website. Shodex launched a new SEC column called Protein LW-403 4D. The column is described as a 1.9-μm SPP phase with a hydrophilic surface that is suitable for analyzing proteins with high molecular weight. For additional details, please visit the Shodex website. Tosoh Bioscience recently commercialized the TSKgel UP-SW3000-LS SEC column. The 2 μm, 250 Å, diol-modified FPP silica-based column is intended for the analysis of biomolecules with size-exclusion chromatography–multiangle light scattering (SEC-MALS) and SEC–mass spectrometry (SEC-MS). The column features fast equilibration times, high robustness, and lot-to-lot reproducibility. Low “shedding” reduces noise in MALS applications. For more information, please visit the Tosoh Bioscience website. Nontraditional Column Formats Advanced Materials Technology, Inc. introduced the Halo 1.5 column line of columns for both small molecules, peptides and proteins based on their 2.0- and 2.7-μm SPP technology. The 1.5-mm i.d. columns are reported to provide increased sensitivity from conventional UHPLC systems, higher ionization efficiencies from LC–MS systems, and higher efficiencies compared to 1-mm i.d. columns on UHPLC systems, while reducing solvent consumption (50% compared to 2.1-mm i.d.). According to the company, it is an “easy to implement” microflow solution. The columns are available in multiple surface chemistries for small molecules including C18, LPH (a sterically-protected C18), and AQ-C18 (aqueous compatible C18) in their 90 Å pore size material. For peptides, an ES-C18 chemistry is available in the 160 Å format. A C4 and a diphenyl phase are also available for protein analyses utilizing a 1000 Å pore size. Additional information may be found at the Halo Columns website. Focusing more on peptide and protein analyses, MilliporeSigma also introduced a line of 1.5-mm i.d. columns under the name BIOshell 1.5-mm i.d. UHPLC columns. The company notes that the 1.5-mm i.d. geometry enables the chromatographer to operate at lower flow rates (saving solvent) without compromising efficiency or sensitivity. The SPP structure, combined with wide pore diameters, enables rapid and high efficiency separations of peptides, monoclonal antibodies (mAbs), bispecific antibodies, and antibody–drug conjugates (ADCs). This line of columns includes C18 (160 Å), C4, and diphenyl (both 1000 Å) surfaces on a 2.7-μm SPP substrate. For additional information, please visit the MilliporeSigma website. Bruker Scientific LLC developed three new capillary columns geared toward peptide analyses. The columns are based on 1.5 μm, 100 Å fully porous C18 and endcapped particles that differ in dimensions. PepSep Max dimensions are 25 cm (length) x 75 μm (i.d.), whereas the PepSep Ultra and the PepSep Xtreme are 15 cm x 150 μm and 25 cm x 150 μm, respectively. The columns also feature “interchangeable tips,” which reportedly offer robust “twist on and off” connections. More information can be found at the Bruker website. Thermo Fisher Scientific introduced the μPAC Neo HPLC columns described as micromachined 2.5-μm diameter, C18-modified pillars in a silicon wafer. Columns are available in 50 cm and 110 cm lengths and are intended for nanoLC–MS proteomics. Please visit the Thermo Fisher Scientific website for more information. Inert Column Hardware Shimadzu launched a large number of columns under the name Shim-pack Scepter Claris over the past year. The commonalities are a bioinert coating applied to the column body and frits as well as a wide pH range feature. A variety of pore sizes (80, 120, and 300 Å) as well as a number of particle sizes (1.9, 3, and 5 μm) are available. Surface chemistry options include C18, HD-C18 (high density), C4, C8, Diol-HILIC, PFPP, and phenyl. For which phases are available on given supports, please visit the Shimadzu website. The company recommends the columns for analyzing metal-coordinating analytes and hydrophobic compounds such as nucleic acids, proteins, and lipids that adsorb to stainless steel surfaces. Waters Corporation launched a number of new lines of columns with their metal-passivated column hardware termed MaxPeak High Performance Surface technology. Common to each of these newly branded columns is the Premier designation. Under the Acquity and XBridge Premier BEH banners (hybrid particles 1.7 and 2.5 μm, 130 Å) C8, phenyl and hydrophilic interaction liquid chromatography (HILIC) (bare BEH particles) phases were developed. The C8 is noted as being less retentive than standard C18 phases and exhibiting high pH stability. The phenyl phase provides complementary selectivity to C18 phases, especially for polyaromatic compounds and exhibits the same high pH stability as its C8 kin. The HILIC phase also shows pH stability and is used for highly polar compounds. Under the name Acquity and XSelect Premier HSS columns, both a C18 and a PFP phase were launched. The columns are built on 1.8 and 2.5 μm, 100 Å FPPs with high coverage noted. The C18 exhibits high retention and exceptional peak shapes for bases, whereas the PFP provides alternative selectivity to C18 and separation of closely related compounds with sharp peaks for bases. On the Cortecs Premier line (1.6 and 2.7 μm, 90 Å or 120 Å SPP supports), three chemistries were released, including C18, C18+, and T3. The C18 is described as a “full coverage C18 phase with endcapping,” and it is intended for general use. The C18+ adds a weak anion-exchange character to the C18 that produces excellent peak shapes for bases when using formic acid or other low ionic strength acidic mobile phases. The T3 is noted as a “mid-coverage C18 phase, with endcapping.” The column is recommended for both nonpolar and moderately polar molecules, and it is 100% water-wettable. More details can be found on the Waters website. For large molecules, Waters released the Acquity Premier and XBridge Premier Protein BEH C4 columns. The pH-stable hybrid particle columns are available in 1.7- and 2.5-μm particle sizes with a 300 Å pore size. The C4 surface chemistry, combined with the particle and column technology, results in a column line suitable for intact mass and sub-unit analysis of proteins, including those that are phosphorylated. See the Waters website for additional details. YMC Co., Ltd. introduced their own line of bioinert columns labeled YMC-Accura Triart. The columns are built on inert hybrid silica particles (1.9, 3, and 5 μm and 120 or 300 Å pore sizes) and packed in hardware (columns and frits) deactivated with a bioinert coating. The columns are noted for their high pH and temperature stability and are recommended for oligonucleotides, (phospho)peptides, (phospho)lipids and other coordinating substances. Stationary phases include C18, C18 ExRS (extended pH and stability), Bio C18, Bio C4, phenyl, PFP, and a diol phase for HILIC separations. For additional information, please visit the YMC website. Accessories and Kits Knauer released a new line of column heating devices with varying capacities and features. Two channel systems for heating of the eluent is noted. For further details, please visit the Knauer website. MicroSolv Technology Corporation introduced a line of polyetheretherketone (PEEK) column hardware. According to the MicroSolv website, their all-PEEK HPLC column hardware is extruded from Victrex PEEK for maximum reproducibility and the finest chromatography. A small amount of graphite (20%) is added to the formulation in order to achieve a black surface sheen. There are no other chemical or physical treatments added to the process making these columns more biocompatible. Columns, frits and end-fittings are available in 2, 4, and 7.5-mm i.d. formats. Optimize Technologies released EXP Ti-REX fittings, a new hand-tight tip-sealing solution. The reusable fittings are used for connecting PEEKsil and fused silica tubing and are rated to 20,000 psi. Restek Corporation launched the Sidewinder LC column heater. According to the company, the unique design completely encloses any LC analytical column up to 25 cm in length. Two lengths of heater jackets are available where the short column holder accommodates columns up to 10 cm in length, whereas the long column holder holds columns up to 25 cm in length. The control module provides optimum heating performance (accuracy to within 1 °C) and stability to within 0.1 °C. The Sidewinder controller has fast 10 Hz sampling for improved responsiveness. The RS232 control allows external programming. For additional information, visit the Restek website. Novilytic developed a new proteomics kit that works with your existing HPLC system. The Proteometer-L kit is designed for rapid analyses of intact IgG and IgG fragments containing the Fc region in a harvested cell-Free culture filtrate (CFF). The kit measures (mAb) titer and relative aggregate content without the need for sample purification. According to the company, the kit offers the following advantages over existing methods for determining mAb titer and aggregate content: two critical quality attributes in one assay as critical quality attributes can be directly analyzed in crude culture filtrate (no additional purification needed), linear response from 0.5–16 mg\/mL mAb, very small sample volume is required (minimum 0.5 μL), and fast (10 min) runtime. For more information, please visit the Novilytic website. Conclusions Many of the new products and product lines introduced for LC over the past year are either new product line extensions (new chemical surfaces for existing brands) or whole new series based on advanced particle technologies, column hardware developments, or both. Some of the released lines are new to the companies, but they are based on established particle designs (SPP, for example). In another case, a new product line has been launched based on a new monodisperse, fully porous particle. Other new product lines are the result of new or newer technology combinations. For example, there are a few cases where SPP technology and hybrid particle designs are being combined to form improved or alternative column lines. In other products, new column formats are being combined with advanced particle technologies. It is also noted that the trend toward more inert column hardware continues to be significant based on the several collections of columns that have emerged. It is clear that LC vendors continue to put emphasis into new particle and column hardware technologies as well as efforts to best combine these advances to tackle an assortment of separation challenges. References (1) Bell, D. S. New Chromatography Columns and Accessories for 2020. LCGC North Am. 2020, 38 (4), 211–219. (2) Bell, D. S. New Liquid Chromatography Columns and Accessories for 2021. LCGC North Am. 2021, 39 (5), 214–227. (3) Bell, D. S., New Liquid Chromatography Columns and Accessories for 2022. LCGC North Am. 2022, 40 (5), 210–215. DOI: 10.56530\/lcgc.na.sx2967r4 (4) Muraco, C. E.; Bell, D. S. Highlights from the 50th International Symposium on High Performance Liquid Phase Separations and Related Techniques (HPLC 2022). LCGC North Am. 2022, 40 (9), 417–423. DOI: 10.56530\/lcgc.na.ws5783s4 ABOUT THE AUTHOR","filter_flag":1}
{"title":"LABVOLUTION 2023: A Sneak Peek into the Future of Laboratory Technology - DirectIndustry e-Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vZW1hZy5kaXJlY3RpbmR1c3RyeS5jb20vMjAyMy8wNS8wOC9sYWJ2b2x1dGlvbi0yMDIzLWEtc25lYWstcGVlay1pbnRvLXRoZS1mdXR1cmUtb2YtbGFib3JhdG9yeS10ZWNobm9sb2d5L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vZW1hZy5kaXJlY3RpbmR1c3RyeS5jb20vMjAyMy8wNS8wOC9sYWJ2b2x1dGlvbi0yMDIzLWEtc25lYWstcGVlay1pbnRvLXRoZS1mdXR1cmUtb2YtbGFib3JhdG9yeS10ZWNobm9sb2d5L9IBAA?oc=5","id":"CBMicmh0dHBzOi8vZW1hZy5kaXJlY3RpbmR1c3RyeS5jb20vMjAyMy8wNS8wOC9sYWJ2b2x1dGlvbi0yMDIzLWEtc25lYWstcGVlay1pbnRvLXRoZS1mdXR1cmUtb2YtbGFib3JhdG9yeS10ZWNobm9sb2d5L9IBAA","guidislink":false,"published":"Mon, 08 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=128, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vZW1hZy5kaXJlY3RpbmR1c3RyeS5jb20vMjAyMy8wNS8wOC9sYWJ2b2x1dGlvbi0yMDIzLWEtc25lYWstcGVlay1pbnRvLXRoZS1mdXR1cmUtb2YtbGFib3JhdG9yeS10ZWNobm9sb2d5L9IBAA?oc=5\" target=\"_blank\">LABVOLUTION 2023: A Sneak Peek into the Future of Laboratory Technology<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">DirectIndustry e-Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"LABVOLUTION 2023: A Sneak Peek into the Future of Laboratory Technology - DirectIndustry e-Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vZW1hZy5kaXJlY3RpbmR1c3RyeS5jb20vMjAyMy8wNS8wOC9sYWJ2b2x1dGlvbi0yMDIzLWEtc25lYWstcGVlay1pbnRvLXRoZS1mdXR1cmUtb2YtbGFib3JhdG9yeS10ZWNobm9sb2d5L9IBAA?oc=5\" target=\"_blank\">LABVOLUTION 2023: A Sneak Peek into the Future of Laboratory Technology<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">DirectIndustry e-Magazine<\/font>","source.href":"https:\/\/emag.directindustry.com","source.title":"DirectIndustry e-Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"LABVOLUTION is a trade show that presents the latest trends and advancements in laboratory technology, analytics, and biotechnology. The three-day event will take place from May 9th to May 11th in Hannover, Germany. Just a few weeks after Hannover Messe, we had the opportunity to catch up with the Chairman, Dr. Jochen Köckler, to discuss what we can expect from the upcoming fair. Founded in 2015, LABVOLUTION is held every two years at the Hannover Exhibition Grounds, in Germany and is organized by Deutsche Messe AG, just like Hannover Messe. The event is a leading European trade fair for innovative laboratory equipment. This year’s event will focus on digitalization, automation, innovative laboratory technologies, and solutions, as well as artificial intelligence and sustainability. Prior to the show, Deutsche Messe Chairman Dr. Jochen Köckler shared with us exciting insights about what to expect from the fair. Starting tomorrow, the future of laboratories will be on full display at LABVOLUTION. We’re excited to hear your thoughts on what groundbreaking insights the event will offer regarding digitalization, artificial intelligence, and sustainability. Dr. Jochen Köckler: “Today’s laboratory infrastructures consist of many highly specialized devices from a wide range of manufacturers. Different interfaces and data formats make it difficult to connect these devices, let alone integrate them into existing IT infrastructures. However, this is a crucial requirement for end-to-end digitalization, automation, and the optimization of workflows. The success of tomorrow’s laboratories will hinge on how well the various pieces of equipment perform in connected scenarios. The connected laboratory is the only way forward and how this may look like, can be experienced at our special display – our very own lab of the future – the smartLAB. Digitalization is generating enormous amounts of data. Industry 4.0 already demonstrates how the obtained data can be used effectively. Data is connected in order to monitor processes and recognize trends, which allows us to react to changes early on. These advantages can be transferred to laboratories alike. In the future, AI will be used in laboratories to combine and analyze large amounts of data in a very short time – faster than any human would ever be able to. One of the institutions presenting itself on the topic of artificial intelligence is the KIWI Biolab from Berlin. The aim of the Biolab is to link AI with biotechnology and to enable computers to plan and optimize laboratory experiments independently. Sustainability is increasingly influencing all areas of our lives – and of course, research and laboratories too. This is why we will conduct a LAB Sustainability Summit in cooperation with the Freiburg-based NIUB sustainability consultancy. Exhibitors and experts will provide inspiration and solutions for a more sustainable laboratory world. However, sustainability also plays a crucial role in other conference sessions. Speakers from the fields of molecular cell biology and genome editing will bring the latest facts and potential for shaping more sustainable agriculture. Alongside the supporting program, visitors can also expect to discover sustainable innovations, such as Green Elephant Biotech’s CellScrew, a new cell culture system made from plant-based PLA.” LABVOLUTION’s focus on workflow optimization, communication standards, innovative laboratory equipment, and automation is set to revolutionize the laboratory industry. With such a broad scope of cutting-edge topics, what new products can we anticipate seeing at the fair? Dr. Jochen Köckler: “Given the advent of automation and the widespread deployment of sensors and interconnected equipment, visitors can also expect to see a rise of smart laboratory containers, instruments, and equipment to be operated and monitored using tablets and smartphones. Start-ups too play an important role as they push innovation forward within the various laboratory technology segments. This year twelve young companies will present their products, technologies, and applications. MagBio Genomics develops and distributes magnetic beads for isolating and cleaning liquid biopsies in genomic research. develops and distributes magnetic beads for isolating and cleaning liquid biopsies in genomic research. Better Basics strive to create order at laboratory workstations to improve efficiency and safety with their modular 3D-printed organization system. strive to create order at laboratory workstations to improve efficiency and safety with their modular 3D-printed organization system. ARXUM aims to increase digital safety with its blockchain infrastructure. The start-up enables laboratories through its first-of-its-kind turnkey middleware to exchange data securely and fully automatically, including immutable documentation and traceability for maximum data security.” Will there be any premiere? if yes, can you give us more details? Dr. Jochen Köckler: “At LABVOLUTION, many companies traditionally launch their latest products and services. However, I cannot spoil the fun by revealing all premieres in advance, can I? Let me introduce just three of them as an appetizer. Taiwan-based GeneDireX will celebrate the premiere of its μBLooK LED transilluminator at this year’s LABVOLUTION. Unlike conventional transilluminators, which work with UV light, the μBLooK LED transilluminator uses LED light, which is said to be less harmful to DNA. will celebrate the premiere of its μBLooK LED transilluminator at this year’s LABVOLUTION. Unlike conventional transilluminators, which work with UV light, the μBLooK LED transilluminator uses LED light, which is said to be less harmful to DNA. Korea-based company Curiosis Inc . will present their Celloger Mini Plus, a live cell imaging system, which operates even in hot and humid environments. Thus, enabling researchers and scientists to observe and analyze living cells in an incubator over a long period. . will present their Celloger Mini Plus, a live cell imaging system, which operates even in hot and humid environments. Thus, enabling researchers and scientists to observe and analyze living cells in an incubator over a long period. The German Industry Association for Optics, Photonics, Analytical, and Medical Technology SPECTARIS will launch a new communication standard called LADS (Laboratory & Analytical Device Standard), which is based on OPC UA. The goal of LADS is to create a manufacturer-independent, open standard for analytical and laboratory equipment that comprehensively reflects the different customer industries and their respective workflows while meeting future requirements of digitalization and automation.” Can you give us more details about the smartLAB? Dr. Jochen Köckler: “Since 2015, smartLAB has been showcasing pioneering examples of the smart laboratory of the future. This year, together with our partner Smartlab Solutions GmbH from Dresden and 14 other exhibiting companies, we will be presenting new solutions for laboratory automation and digitalization in four use cases and a VR area. In addition to Smartlab Solutions GmbH, the smartLAB partners in 2023 are Eppendorf AG, 2mag AG, Better Basics Laborbedarf GmbH, Düperthal Sicherheitstechnik, Essentim GmbH, Kreativraum GmbH, INTEGRIS LIMS GmbH, Labforward GmbH, Berner International GmbH, Institut für Umwelt & Energie, Technik & Analytik e. V. (IUTA), Fraunhofer IPA, Amensio GmbH, smartAct GmbH and INTEGRA Biosciences GmbH. All use cases are completely new and have never been shown anywhere before! LADSvolution is all about holistic mapping, controlling, and monitoring laboratory processes. It is an intelligent solution for the automated and quality-assured consolidation of all the process information in one laboratory management system (LIMS). Testing the activity and efficacy of chemicals is a frequent question in the laboratory. In the workflow Smart Quality Inventory visitors can observe in real-time how a dye solution is tested for its thermochromic dye content. Investigations of product quality, especially in pharmaceuticals, are standardized control processes, as fluctuating product qualities of pharmaceutical products can be detrimental to health. Smart Safety Cabinet gives insights on how to support analysis by automation and process control. Especially in the field of cell culture technology, experimenters encounter an increased risk of contamination. The workflow Smart Cell Handling And Imaging (Smart CHAI), demonstrates how the integration of innovative tools can partially or fully automate the process of cell culture handling – thus reducing user interaction and the risk of contamination. In addition to the four use cases, the smartLAB also presents an innovative mixed reality experience in the so-called Meta-Lab. The virtual lab offers those interested an insight into modern laboratory environments and new ways of collaboration, communication, and intuitive knowledge transfer. Visitors are invited to try out the all use cases live on-site in the smartLAB in hall 20 at booth C40.” What new discoveries can we expect from panel discussions on genome editing and green chemistry? Dr. Jochen Köckler: “New genomic techniques (NGT) such as CRISPR\/Cas make it possible to modify and adapt the genetic material of crop plants in a targeted and precise manner. Scientists see these innovative methods as an important building block to complement classical breeding in the future. Their application makes it possible to overcome the limitations of classical plant breeding and thus contribute in many ways to more sustainable agriculture adapted to the consequences of climate change. So far, the use of NGT has been bound by the strict rules of European genetic engineering law, which dates back to 2001. However, the EU Commission sees very great sustainability potential in NGT – and is seeking to reform the regulation of these techniques.” How many people are you expecting and how many exhibitors?","filter_flag":1}
{"title":"Bisera Lozanovska enters the world of cosmetics and beauty through biochemistry - Fairleigh Dickinson University","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmZkdS5lZHUvbmV3cy9iaXNlcmEtbG96YW5vdnNrYS1lbnRlcnMtdGhlLXdvcmxkLW9mLWNvc21ldGljcy1hbmQtYmVhdXR5LXRocm91Z2gtYmlvY2hlbWlzdHJ5L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmZkdS5lZHUvbmV3cy9iaXNlcmEtbG96YW5vdnNrYS1lbnRlcnMtdGhlLXdvcmxkLW9mLWNvc21ldGljcy1hbmQtYmVhdXR5LXRocm91Z2gtYmlvY2hlbWlzdHJ5L9IBAA?oc=5","id":"CBMiaWh0dHBzOi8vd3d3LmZkdS5lZHUvbmV3cy9iaXNlcmEtbG96YW5vdnNrYS1lbnRlcnMtdGhlLXdvcmxkLW9mLWNvc21ldGljcy1hbmQtYmVhdXR5LXRocm91Z2gtYmlvY2hlbWlzdHJ5L9IBAA","guidislink":false,"published":"Wed, 10 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=130, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmZkdS5lZHUvbmV3cy9iaXNlcmEtbG96YW5vdnNrYS1lbnRlcnMtdGhlLXdvcmxkLW9mLWNvc21ldGljcy1hbmQtYmVhdXR5LXRocm91Z2gtYmlvY2hlbWlzdHJ5L9IBAA?oc=5\" target=\"_blank\">Bisera Lozanovska enters the world of cosmetics and beauty through biochemistry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fairleigh Dickinson University<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bisera Lozanovska enters the world of cosmetics and beauty through biochemistry - Fairleigh Dickinson University","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmZkdS5lZHUvbmV3cy9iaXNlcmEtbG96YW5vdnNrYS1lbnRlcnMtdGhlLXdvcmxkLW9mLWNvc21ldGljcy1hbmQtYmVhdXR5LXRocm91Z2gtYmlvY2hlbWlzdHJ5L9IBAA?oc=5\" target=\"_blank\">Bisera Lozanovska enters the world of cosmetics and beauty through biochemistry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fairleigh Dickinson University<\/font>","source.href":"https:\/\/www.fdu.edu","source.title":"Fairleigh Dickinson University","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"By Rebecca Maxon May 10, 2023 — Bisera Lozanovska’s time at FDU helped the international honors student develop her interest in cosmetic science, test her knowledge in the field and formulate her plans for the future. Lozanovska came to FDU from Macedonia. “I attended the Metropolitan Campus and was able to make friends right away,” she says. “During my junior year, I joined the undergraduate research team. They felt like my own community, and they made my years at FDU so much fun!” Lozanovska will celebrate her undergraduate degree in biochemistry at the May 17, 2023, Commencement ceremony at MetLife Stadium in East Rutherford, N.J. From there, she will embark on her full-time professional journey with Cosmax USA. She plans to return to FDU to complete her studies in the 4 + 1 B.S.\/M.S. program in biochemistry and cosmetic science. “In Macedonia, life is more slow-paced and more relaxed. People prioritize leisure time,” she says. “In the U.S., people tend to focus more on their career advancement, education and planning for their futures, which I personally like better.” Lozanovska’s interest in cosmetic science started in high school as she looked into different products and ingredients that would be good for her skin. “I am passionate about science, and I like skin care products and makeup, so cosmetic science is perfect for me as it is the field where these two passions meet,” she says. Lozanovska has learned a lot from her Cosmax co-workers. “As a chemist and a researcher, I get to be at the forefront of this dynamic field, working with a team of experts to develop new products and meet the needs and desires of consumers,” she says. “It’s a fascinating career path that allows me to combine my love of science and research with my passion for creativity and aesthetics.” While at FDU, Lozanovska received support through the Gregory Olsen Scholarship for Academic Excellence and the Maria Avallone and Malcolm Sturchio Scholarships for Successful Research at FDU, which she says motivates her to continue pursuing academic and research goals. She started working part-time at Cosmax in January, after finding the company on Indeed.com. “I got a full-time offer as a junior cosmetic chemist in January, but since I was still in school, they accommodated me as a part-time employee until I graduate,” she says. “I was lucky to get a job in the industry and division I wanted.” Her work at the company includes researching and analyzing the properties of active ingredients and raw materials; developing, formulating and testing cosmetic products; and investigating and resolving stability issues with existing products. At FDU, “Under the mentorship of Mihaela Leonida [professor of chemistry and physics and pre-professional\/graduate school adviser], I developed invaluable research skills and was able to push my limits academically,” Lozanovska says. “She trained me well in the laboratory and taught me a lot about working with data and analysis. Without her guidance, motivation and support, I would not be where I am today.” In addition to her research, Lozanovska was a member of the Society of Cosmetic Chemists and the National Society of Collegiate Scholars and participated in FDU’s Pre-health Society. Among her accomplishments is co-authoring a study published in the International Journal of Biological Macromolecules with Leonida and Alice Benzecry, professor of biology and microbiology, and co-presenting it for the Nanotek 2023 nanotechnology conference held in London, England, via Zoom. “Seeing our work recognized and valued by experts in the field is an incredible feeling. I am grateful for the support and guidance of my mentors and colleagues who have encouraged me every step of the way.” She also co-authored “Ionic Liquids Used to Enhance Catalase,” which will be presented by Zoom at the Third International Conference on Green Chemistry and Renewable Energy in Tokyo, Japan, later in May. Lozanovska sees herself continuing to pursue research throughout her career. “There is still so much to discover and explore in my field, and I am excited to be a part of that journey.”","filter_flag":1}
{"title":"Top 10 Best Speciality Chemicals Companies In India In 2023 - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvc3BlY2lhbGl0eS1jaGVtaWNhbHMtY29tcGFuaWVzLTIwMjMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvc3BlY2lhbGl0eS1jaGVtaWNhbHMtY29tcGFuaWVzLTIwMjMv0gEA?oc=5","id":"CBMiR2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvc3BlY2lhbGl0eS1jaGVtaWNhbHMtY29tcGFuaWVzLTIwMjMv0gEA","guidislink":false,"published":"Wed, 03 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=123, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvc3BlY2lhbGl0eS1jaGVtaWNhbHMtY29tcGFuaWVzLTIwMjMv0gEA?oc=5\" target=\"_blank\">Top 10 Best Speciality Chemicals Companies In India In 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 10 Best Speciality Chemicals Companies In India In 2023 - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvc3BlY2lhbGl0eS1jaGVtaWNhbHMtY29tcGFuaWVzLTIwMjMv0gEA?oc=5\" target=\"_blank\">Top 10 Best Speciality Chemicals Companies In India In 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"INTRODUCTION India is one of the world’s leading countries in producing speciality chemicals, with many leading companies operating in the sector. The country has a wide range of manufacturers specialising in different areas, such as pharmaceuticals, agrochemicals, dyes and intermediates. These companies are well-known for their high-quality products and commitment to innovation. As of 2023, there are over 150 speciality chemical companies in the Indian market, providing various products for industrial and commercial applications. Some of the leading names in this field include Hindustan Organic Chemicals, Aarti Industries, UPL Limited, Bayer CropScience, Atul Ltd, Gharda Chemicals, and PI Industries. All these companies offer advanced technologies and solutions tailored to individual customer needs. They also have comprehensive safety procedures and standards for handling hazardous or toxic substances. In addition, many of these companies are also involved in research and development activities, offering new and improved products for the industry. IMPORTANCE Speciality chemicals companies in India have become increasingly important in 2023. In a country with diverse climates, geography and industry needs, speciality chemicals can provide solutions for specific applications. Speciality chemicals companies in India produce products used in paints, coatings, inks, lubricants, additives and other industries. They also serve as raw materials for pharmaceuticals and cosmetics. The demand for speciality chemicals is growing as the Indian economy expands, allowing more and more companies to fulfil their customers’ needs. As a result, speciality chemicals companies in India are creating new opportunities for growth and innovation. The Indian government has taken steps to promote the development of speciality chemicals companies, including financial incentives and tax breaks. The industry is also supported by research and development initiatives, which allow them to develop innovative products and technologies. As consumer demands continue to grow, speciality chemicals companies are adopting new strategies to meet customer requirements. In addition, speciality chemicals companies in India are focusing on exports. Export markets are providing an avenue for international growth and development. Exports are helping these companies to expand their presence in foreign markets, thus generating employment opportunities and economic benefits for the country. Overall, speciality chemicals companies in India play an essential role in the country’s growth and development in 2023. With the right strategies, these companies can continue to be successful and contribute to the advancement of the Indian economy. Here are the top 10 best speciality chemicals companies in India in 2023 BASF India – BASF India is a subsidiary of BASF SE, the world’s leading chemical company. Based in Mumbai, India, the company has been active in the country since 1998 and serves many industries, including automotive, construction, home care, healthcare, personal care, nutrition, and crop protection. The company produces many products, such as petrochemical intermediates, speciality chemicals, performance materials, and agrochemicals. It utilizes advanced technologies, such as biotechnology and nanotechnology, to develop innovative solutions for its customers. BASF India also offers services for research & development, manufacturing, and supply chain management. It is committed to providing tailored solutions that meet customer needs and fulfil local requirements. The company is focused on contributing to sustainable development in India by investing in energy efficiency and reducing water consumption. It is developing multi-disciplinary partnerships with universities, research institutes, and other organizations in India to promote innovation. BASF India is committed to advancing environmental protection, social responsibility, and economic development through its sustainability initiatives. It is actively involved in activities like promoting healthy ecosystems, driving a circular economy, and creating green chemistry solutions. Additionally, the company runs training programs and seminars to create awareness about sustainability among its employees and business partners. In conclusion, BASF India is a global leader in the chemical industry, committed to providing innovative solutions for its customers and promoting sustainability in India through its initiatives. Dow Chemical International Pvt. Ltd. – Dow Chemical International Pvt. Ltd. is a global leader in chemical manufacturing, committed to providing innovative solutions that have the power to help transform industries and improve lives. With over 9,000 employees worldwide and operations in more than 150 countries, the company strives to stay ahead of the curve with sustainable solutions for customers and communities. Dow Chemical produces chemicals, plastics, agricultural products, and consumer products, with products ranging from agrochemicals to automotive components to electronics. The company has established a strong presence in India, with offices in nine major cities nationwide. Dow Chemical International Pvt. Ltd. is committed to working closely with customers to develop custom solutions that solve their most pressing needs. The company is also dedicated to improving India’s environment and empowering the country’s economy by creating jobs and providing training opportunities to local communities. Dow Chemical International Pvt. Ltd. is a leader in sustainability and innovation, leveraging its years of experience and expertise to create products and solutions that help improve the world. Clariant Chemicals India Ltd. – Clariant Chemicals India Ltd is a subsidiary of Clariant AG, a world leader in speciality chemicals. Based in Mumbai, the company produces a range of chemicals and materials for various industries, including agriculture, textiles, automotive and personal care products. Clariant Chemicals India Ltd has over 20 manufacturing sites nationwide, with more than 2,000 employees working in its production facilities. Its products include active ingredients, colourants, surfactants, emulsifiers, polymers, speciality chemicals, biocides, and solvents. It also provides services such as custom synthesis and contract manufacturing. The company is committed to sustainability and actively works towards reducing its carbon footprint. Its “Green & Clean” program focuses on water and energy conservation, waste reduction and pollution control. Clariant Chemicals India Ltd has also earned ISO 9001:2015 certification for its quality management system. Clariant Chemicals India Ltd has a strong presence in the Indian market, with numerous collaborations with leading customers in the country. The company strives to make its products safe, efficient, and sustainable to meet the needs of both local and global markets. In addition, it invests heavily in research and development of new products, technologies and processes to ensure customer satisfaction. Atul Ltd. – Atul Ltd is a multinational corporation based in India that specializes in chemicals, crop protection products, and industrial machinery. Founded in 1954, it has grown to become one of the largest chemical manufacturers in the world, with over 20,000 employees. Atul Ltd offers a wide range of services and products in various categories, including fine chemicals, crop protection products, agrochemicals, speciality chemicals, pharmaceuticals, and engineering products. The company also has its own research and development teams and works with leading universities and research institutions around the world. Atul Ltd has a strong presence in all major markets globally, with offices in more than 50 countries. Its core focus is on developing innovative solutions to serve customer needs and promote sustainable growth. They are committed to delivering quality products and services while minimizing environmental impact. The company also strives to ensure social responsibility by engaging in diverse business practices which respect the rights of their workers and communities. Atul Ltd is a trusted name in the industry for its quality products, customer service, and superior technology. Sud-Chemie India Pvt. Ltd. – Sud-Chemie India Pvt. Ltd. is a leading speciality chemical company based in Mumbai, India. Founded in 1992, the company manufactures and supplies a wide range of chemicals and ingredients to meet the needs of a variety of industries. The company has grown over the years and currently operates four production facilities located in Gujarat, Maharashtra, and Uttar Pradesh. Sud-Chemie India specializes in producing high-quality additives for a variety of industries, including plastics, rubber, textile, paper, paint, coatings, pharmaceuticals, and personal care. Their products also extend to agricultural chemicals such as fertilizers and insecticides, as well as speciality chemicals for the automotive, defence, and food industries. The company works closely with their customers to develop customized solutions for them. With the help of their experienced research & development team, they are able to provide innovative products which are tailored to each individual customer’s specific requirements. This helps them to maintain the highest standards of quality. Sud-Chemie India also offers technical support services to their customers. These services include product consultation, application engineering, process optimization, and troubleshooting. They also have an extensive library of raw materials and formulations that can be used to create new products or improve existing ones. The company is committed to providing products that are safe, sustainable, and environmentally friendly. All their products comply with international standards and regulations. Sud-Chemie India is also certified under ISO 9001:2008 for quality management systems and ISO 14001:2004 for environmental management systems. Overall, Sud-Chemie India Pvt. Ltd. is a reliable partner in providing superior quality chemicals and ingredients for a variety of industries. Through their commitment to quality and innovation, they strive to exceed the expectations of their customers around the world. Evonik Industries AG – Evonik Industries AG is a global leader in speciality chemicals, with over 33,000 employees in more than 100 countries. The company produces a wide range of products, including paints and coatings, nutrition and health products, and performance materials. Evonik’s products are used in virtually every industry, from automotive to construction, personal care, and agriculture. It has a long history of innovation, with several of its products setting benchmark standards in the industry. Its R&D capabilities help it capitalize on trends and anticipate customer needs. Evonik has strong sustainability credentials, committing to reduce its carbon footprint by 30% by 2030. In 2020, it achieved almost 10% reduction in absolute CO2 emissions compared to 2019. Evonik has an extensive global presence, with operations stretching from North America to Europe, Asia Pacific and Central and Latin America. It is also dedicated to corporate social responsibility, regularly supporting local projects, tackling climate change and promoting diversity and inclusion. To further illustrate its dedication, in 2021, the company announced plans to achieve carbon neutrality by 2040. In conclusion, Evonik is a well-known name in the speciality chemicals industry, with a diversified portfolio, a strong commitment to innovation and sustainability, and a global reach. Gujarat Alkalies and Chemicals Ltd. – Gujarat Alkalies and Chemicals Ltd. (GACL) is a leading Indian company engaged in the manufacture and marketing of alkalis and other chemicals. The company was established in 1973 and is headquartered in Vadodara, Gujarat. GACL is one of the largest manufacturers of caustic soda, chlorine and other related products in India. It also produces speciality chemicals such as chloro-sulphonic acid, hydrochloric acid, bleaching powder and liquid chlorine. GACL has three manufacturing plants located at Vadodara, Dahej and Vilayat. Its plant at Vadodara manufactures caustic soda, chlorine, sodium hypochlorite, hydrochloric acid, sulphuric acid and chloro-sulphonic acid. The Dahej plant produces chlorine, caustic lye and hydrochloric acid. The Vilayat plant manufactures mainly caustic soda. The company has a well-developed infrastructure for handling various chemicals safely, with safety and environmental protection being given the highest priority. GACL has received many awards and recognitions over the years, including a national award from the Ministry of Chemicals & Fertilizers in 2008. In addition to its manufacturing business, GACL also provides engineering services, including design, construction and commissioning of chemical plants. GACL is committed to providing quality products and excellent customer service, which helps it maintain its position as one of the leading companies in the Indian chemical industry. With its expansive production capacity and reliable supply chain, GACL has consistently met customer expectations in terms of product quality and delivery schedule. SCG Performance Chemicals India Pvt. Ltd. – SCG Performance Chemicals India Pvt. Ltd. is a subsidiary of Thai-based SCG Chemicals, a global leader in the chemical industry. The company specializes in the production and supply of industrial chemicals for the automotive, construction, manufacturing, and oil & gas industries. Located in Ahmedabad, Gujarat, the company has a state-of-the-art infrastructure to manufacture and deliver quality products that meet the needs of its customers. The company is ISO 9001 certified for its production process and quality standards. SCG Performance Chemicals India Pvt. Ltd. offers a wide range of products such as resins, dispersions, dispersants, pigments, additives, and more. Their products are used in industries like automotive, construction, packaging, coatings, leather, paints, adhesives, etc. The company invests heavily in R&D and provides customized solutions to its customers. The company has built a strong network of distributors across the country, offering fast and reliable delivery times. The technical team offers extensive support with product selection and application advice. They also provide guidance on product safety, product regulations, formulation, and performance testing. SCG Performance Chemicals India Pvt. Ltd. is committed to providing high-quality products with low environmental impact. They focus on sustainable development by using clean energy sources such as solar and wind power. They use only eco-friendly raw materials and ensure minimal wastage throughout the production process. The company values customer satisfaction above all else and follows ethical practices for better business returns. SCG Performance Chemicals India Pvt. Ltd. is a reliable partner for your chemical requirements. Gujarat Narmada Valley Fertilizers & Chemicals Ltd. – Gujarat Narmada Valley Fertilizers & Chemicals Ltd. (GNFC) is a leading chemical and fertilizer company in India, headquartered in the city of Bharuch in Gujarat. The company was founded in 1976 and is part of the Indian Government’s Department of Fertilizers. GNFC produces a wide range of products including fertilizers, agrochemicals, industrial chemicals and speciality chemicals. The company has a strong presence in India and exports to more than 40 countries around the world. GNFC has five production plants located at Bharuch, Ankleshwar, Surat and Dahej. Its flagship plant, Bharuch, is the largest fertilizer manufacturing unit in India and one of the largest single-site ammonia urea complexes in the world. GNFC is also the first fertilizer manufacturer to introduce the use of natural gas for its production process. GNFC has been awarded several prestigious awards for its corporate social responsibility initiatives, such as “The Best Corporate Citizen Award” and “Best Company of the Year” by the Government of India. The company is also renowned for its environmental stewardship and has implemented a number of environment-friendly measures to reduce its eco-footprint. In addition, GNFC has also launched several innovative initiatives to contribute to the community and has taken steps to reduce water consumption and promote sustainable agriculture. GNFC has also established itself as a leader in research and development, conducting several projects related to agrotechnology, biotechnology and industrial biotechnology. The company is committed to making quality products while maintaining an efficient and cost-effective production system. GNFC’s commitment to providing solutions to meet the needs of farmers has made it one of the most sought-after companies in the agrochemical industry. Lotte Chemical India Pvt. Ltd. – Lotte Chemical India Pvt. Ltd. is a part of the Lotte Group, a multinational conglomerate based in South Korea. The company specializes in the production of petrochemicals and plastics. It offers products such as polyethene, polypropylene, polystyrene, engineering plastics and elastomers. The company has its headquarters in Mumbai and operates three manufacturing plants in Manali, Tamil Nadu; Dahej, Gujarat and Rupnagar, Punjab. The company’s core strengths include an experienced management team and modern production facilities, allowing it to provide high-quality products with consistent performance. Its products are used in a variety of applications, including automotive, consumer packaging, building and construction, electrical and electronics and health care. Lotte Chemical India has established strong relationships with suppliers, customers and government agencies. It is committed to environmental protection and sustainability through the reduction of energy consumption and waste generation, as well as water and air pollution control measures. The company also meets global standards for product safety, quality, reliability and efficiency. Additionally, Lotte Chemical India focuses on research and development to develop new products and technologies that meet customer needs. Through continuous innovation and development, the company strives to increase its competitive advantage in the plastic industry. CONCLUSION In 2023, speciality chemicals companies in India are expected to continue growing at a rapid pace. The industry is expected to benefit from the country’s booming economy, increasing purchasing power and favourable government policies. Companies are also investing heavily in research and development, as well as in new technologies and processes, to gain a competitive edge in the market. Additionally, the sector is set to benefit from higher demand for speciality products within India and abroad. As such, more and more companies are entering the market, resulting in increased competition. However, the industry still faces some challenges, such as rising costs of raw materials, regulatory risks, and shortages of skilled labour. Nevertheless, with proper strategies and investments, speciality chemicals companies in India are expected to remain profitable in 2023.","filter_flag":1}
{"title":"Top 50 Most Innovative Companies Of The World In 2023 - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLTUwLW1vc3QtaW5ub3ZhdGl2ZS1jb21wYW5pZXMtb2YtdGhlLXdvcmxkLWluLTIwMjMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLTUwLW1vc3QtaW5ub3ZhdGl2ZS1jb21wYW5pZXMtb2YtdGhlLXdvcmxkLWluLTIwMjMv0gEA?oc=5","id":"CBMiWWh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLTUwLW1vc3QtaW5ub3ZhdGl2ZS1jb21wYW5pZXMtb2YtdGhlLXdvcmxkLWluLTIwMjMv0gEA","guidislink":false,"published":"Mon, 29 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=149, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLTUwLW1vc3QtaW5ub3ZhdGl2ZS1jb21wYW5pZXMtb2YtdGhlLXdvcmxkLWluLTIwMjMv0gEA?oc=5\" target=\"_blank\">Top 50 Most Innovative Companies Of The World In 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 50 Most Innovative Companies Of The World In 2023 - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLTUwLW1vc3QtaW5ub3ZhdGl2ZS1jb21wYW5pZXMtb2YtdGhlLXdvcmxkLWluLTIwMjMv0gEA?oc=5\" target=\"_blank\">Top 50 Most Innovative Companies Of The World In 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"The most innovative companies around the world in 2023, which have reached new heights in spite of all the uncertain economic times, have build an advantage and resilience through innovation. The Boston Consulting Group (BCG) has published its annual report on the top 50 most innovative companies across the globe, and noticed about 79 per cent of companies prioritizing innovation among their top three prime concerns. These companies have undefinably outperformed the Morgan Stanley Capital International (MSCI) World Index by 3.3 per cent points per year on shareholder returns. Below are all the 50 companies which hold the list as innovative global leaders, starting from the top-most. Appealing to note is the striking revelation that holds a common base in all these innovative giants which is about finding out the solution to some major tricky problems or pain points faced by the humankind, and developing a sustainable product as an ideal answer to the world’s needs. 1. Apple Apple steals the show to be the #1 innovative companies in the world, with innovation to be its DNA, the people first approach to be its heart, and customers to be its jewels. Apple hires smart people who tell them what to do and not the converse. From Macintosh to iPod to iPhone, Apple uses a proactive innovation strategy that is all about creating and monopolizing out of reinvention followed by a fierce journey of refinement. 2. Tesla Tesla bags #2 with its fan-focused innovation strategy, aiming to transform the auto industry as a whole with its solar roofing, electric cars, autonomous vehicles, and fast charging sustainable batteries. Tesla avoids hierarchy in its organizational roots and allows free-flow communications for open source innovation, whilst putting real money where its mouth is and a belief in market adjacencies. 3. Amazon Amazon turns up #3 with its radical innovation, offering its customers convenience, choice and great deals, relentlessly focusing on their wants and then moving backwards. Amazon beholds the Day – 1 innovative strategy, that marks constant reinvention and dynamism mixed with a bit of adventure. Amazon Go, a grocery store with no cashier queues, apart from Prime Air fleet for delivery are among their many innovative ideas. 4. Alphabet Alphabet, the holding company of Google, is driven by a 10x forward thinking internal startup cultural innovation, while ambidexterity governs most of Alphabet’s digital innovation strategies that include plethora of successful subsidiaries as well as beta status apps such as Android, Gmail, Google Maps, Google Calendar, Chrome. 5. Microsoft Microsoft in the computing industry has depicted its time-to-market acceleration and cross-boundary innovative strategies with partnership and alliances as well as mergers and acquisitions such as OpenAI, Nuance, LinkedIn among others. 6. Moderna Moderna has stood the test of times to become the pioneer in the AI-driven innovation in the fight against cancer along side the development of therapeutics and vaccines. ‘Going digital’ is one of the success attributes of Moderna, with the cloud handling most of its manufacturing processes and drug discovery. 7. Samsung Samsung focuses on a component-level technology innovation, investing heavily in R&D which makes it the largest non-US R&D spender. Samsung’s innovation engines include smart home products, virtual assistance, robotics, medical equipment, 5G connectivity, and connected cars, while its patent portfolio crossed 6,300 in 2022. 8. Huawei Huawei goes from aggressive technology-driven and customer-centric innovation to invention with its cooperation with other corporations and wolf-culture organization. Huawei’s long term research and investment also dwells into the 6G, AI-enabled video-coding and Wi-Fi 7. 9. BYD Company BYD works through a green mobility innovative strategy, also called as 7+4 strategy, delivering New Energy Vehicles (NEV), proven iron-phosphate battery technology, game-changing blade battery, and bi-directional charging and discharging of electric vehicles. 10. Siemens Siemens manifests an open innovative strategy by creating, scouting and investing in startups, simultaneously focusing on its mergers and acquisitions with Varian Medical Systems being one of top partner acquisitions. 11. Pfizer Pfizer positions itself as a clinical sustainable digital innovation, ranging from its breakthrough treatments to upswing in affordable access to cures with a direct-to-patient marketing evolution. 12. J&J Johnson & Johnson practices early-stage open healthcare innovation with its hefty investments on internal and external research and development wings. J&J also acquired Abiomed with answers to heart recovery issues and Biosense Webster offering treatment and diagnosis for atrial fibrillation, and tailored JLabs as an external innovation center hosting more than 500 companies. 13. SpaceX SpaceX is propelled by a cutting-edge cost and design disruptive innovative model, where failure is embraced with a culture of learning, and increasing profits is not the only goal. With its reusable launch development program, SpaceX has created significantly historical step forward in space travel. 14. NVIDIA Nvidia unleashes the arsenal of AI innovation, defying the rules of valuation by accelerating the product design innovation and reshaping the future of innovative technology. Nvidia has captured the realistic virtual world and digital humans with a set of cloud-native AI model called NVIDIA Omniverse Avatar Cloud Engine, apart from a 3D open metaverse with Universal Scene Description (USD). 15. ExxonMobil Technology under its belt, ExxonMobil advances in clean energy innovation with low-emission sustainable energy solutions such as algae biofuels and e-fuels consisting of captured carbon dioxide and hydrogen. The lubrication technology innovation of ExxonMobil showcases digital reliability solutions with a new-age fluid, turning wood waste into biofuel. 16. Meta Facebook’s Meta showcases a responsible challenge-based innovation with the launch of Meta Quest Pro, XR Startup program, and Meta Quest 2, whilst leaping into the metaverse, VR and AR domains besides its alliances with digital tech giants such as Zoom, Adobe, Microsoft among others. 17. Nike From crisis to sustainable technological innovations, Nike has come with Lunarlite foam cushioning, free footwear new generations, Nike Flywire support system and Hyperdunk basketball shoe, by relying on its sports research lab advancements. Nike’s notable range lies in the Nike Grind process of transforming plastic bottles into running shoes, and ColorDry system easing fabric dye technology without the use of water. 18. IBM IBM focuses on automation innovation, giving away a 127-qubit processor as a massive quantum breakthrough, revolutionizing teaching of AI to code with Project CodeNet, enabling a safer world with QRadar XDR Suite, and captaining the cloud computing and solar energy driven Mayflower Autonomous ship. 19. 3M 3M applies collaborative and scientific innovation with R&D as its heartbeat and dwelling on trans sector leadership, offering its services ranging from Scotch tape to Post-it Notes to Ace bandages. 20. Tata Group The only Indian company to beat it to the list, Tata Group believes on collaborative business without boundaries in innovation, leading to the establishment of Tata Chemical Innovation Centre focusing on green chemistry, R&D T in Tata Steel Europe, Tata Motors European Technical Center, and TCS Innovation Lab. 21. Roche Roche opted strategic partnerships to drive its innovation to transform its healthcare ecosystem worldwide in pharmacy with its Entrepreneurship program, Caring program, and the Global Movement Health 2030. 22. Oracle Oracle facilitates itself on a continuous innovative model with automation and fusion analytics by offering intelligent business applications such as HCM, ERP, CX cloud, LCM; selective adoption plans for upgrades; and exadata and autonomous database cloud with a lift-and-shift ability. 23. BioNTech BioNTech, a new entrant at #23, focuses at medical innovation with revolutionizing vaccine breakthrough of COVID-19 vaccine, developing tools for cancer medicine driven by AI & ML, and partnering with world-class healthcare organizations. 24. Shell The Shell way to openly innovate is approached with clean energy, digitalization and meaningful collaborations with startups and research ecosystem. Shell GameChanger helps innovators from different fields approach them with project proposals enabling robust innovations in their business framework. 25. Schneider Electric Schneider Electric puts forward next-generation automated innovation which support sustainability, green production, energy management and equates digitization with electrification. The heart of Schneider form the collaboration to tackle energy crisis. 26. P&G Proctor & Gamble infuses the startup spirit into the global corporation, and avidly supports its early-bird innovative marketed products with novel modifications like Tide pods, Head & Shoulders shampoos, Pampers Diapers, Oral Bio electric toothbrushes, heated razor by Gillette labs, among many others. 27. Nestle Unlocking the power of food, Nestle sparks budget-friendly innovation whilst crowdsourcing ideas with streamlined startup collaborations, plant-based investing, animal-free dairy, and working on its Popularly Positioned Products. 28. General Electric GE boasts of a heritage energy innovation that would shortly come about as GE Digital, GE Power, GE Renewable Energy, and GE Healthcare, including hybrid electric planes and sustainable energy fuels in GE Aviation. 29. Xiaomi With open innovation, Xiaomi comes about with smartphone renovations such as Air Charge Technology, camera under panel display, while its ecosystem also includes the Xiaomi Mi TV sticks, Powerbanks, fitness band among many others. 30. Honeywell New entrant, Honeywell, came into the market trend during the pandemic season with its outburst of N-95 respirators along with its innovation in quantum computing, advanced recycling of plastic waste, carbon capturing and storage, urban air mobility and next generation avionics with hydrogen fuel-cell propulsion. 31. Sony Sony follows an open end innovation model and became a mainstream success with its gaming PlayStations, music entertainer walkman, robotic dog Aibo, humanoid robot Qrio, Ultra-HD 4K television, and startup acceleration programs. 32. Sinopec Sinopec, as a 4th new entrant, functions as a market-oriented, future-oriented, and development oriented sci-tech innovative company, by driving energy cooperation and nurturing cultural exchange, and has even won the innovation award for National Poverty Alleviation. 33. Hitachi Hitachi moves forward with an social innovative plan that gives off green and digital solutions via simulation technology, autonomous compaction system, autonomous operation at mines, research collaborations, solar chemical system, and solve social issues in a data-driven manner. 34. McDonald’s Working on people, planet and profit principal, McDonald has turned up with its digital innovation scheme as a restaurant of the future. Featuring its One Meal, One Napkin McRecycle, drive-thru order strategy, and Mc Cafe apart from culinary innovations brought McDonanld back to the list of top innovative firms in 2023. 35. Merck Merck follows a give-and-take open innovation policy with its curious minds dedicated to human progress and industrial partnership collaborations, and has brought out the Merck Innovation Cup, Merck Research Grants, and the Future Insight Prize. 36. ByteDance Known by its hit short video application Tik-Tok, ByteDance has also entered the medical segment through Amcare hospitals chain, VR through Pico, gaming startups and studios, and launching its edtech Dali, and is expanding its innovative strategies through mergers and acquisitions. 37. Bosch Bosch showcases a strong culture of innovation with its upfront hand in R&D and targeted acquisitions to support segments with high priority, along side giving mobility support towards automated driving through its FiveAI. 38. Dell Dell accelerates its innovative methodologies with collaborative approaches to data and applications, apart from handing out ConnectAI for customer support, GenerativeAI as a fast paced digital transformation, next-gen OptiPlex desktops, DevOps for data protection, among others. 39. Glencore Glencore celebrates pioneering smelting innovation and other major projects such as Regenere research chair, VELOX pilot project, noranda convertor, metal recycling, and is noted to head onto battery manufacturing waste management along with Li-Cycle. 40. Stripe Stripe comes into action with its launch as carbon-removal industry via Stripe Climate, its travel and trucking digital innovation, and its financial innovation through online payments company such as Steps and Ramp. 41. Saudi Aramco Saudi Aramco comes up about as global energy innovative company to meet the world’s energy demands, hydrocarbon solutions, digital prototyping, machine learning, robotics, subsurface geology and many others. 42. Coca-Cola Coca-Cola displays an action-oriented experimental innovation with its mobile coca-cola vending machine, Coke Studio for the deaf, Ice bottle coca-cola, Coca-cola freestyle machine, sparkling water AHA, and drink innovations such as Ginger Coke. 43. Mercedes-Benz Group Mercedes-Benz Group upholds intelligent product innovation, shaping the future of efficiency with luxury, electric vehicles, and electro mobility enhanced with simplified charging, besides following smart moves such as chemical recycling. 44. Alibaba Alibaba displays an open innovative technology by strategizing on its process and product innovations, and is driven by automation, cloud computing, green technologies and sustainability. 45. Walmart Walmart focusses on a technology-centric innovative model with a strong patent portfolio besides integrations and acquisitions, robotic automation, sustainable packing, voice search AI, AR, VR, drone delivery, cloud computing, blockchain, and IoT. 46. PetroChina PetroChina dwells on the model of clean energy innovations with its focus on R&D, patents and sustainable green developments, as well as effective usage of traditional fossil energy. 47. NTT NTT pursues the open innovative strategy by co-innovative engagements and partnerships with world-class universities. NTT Data promises innovative DNA generation with Inncub3, smart knowledge management with Knowler, service innovation InnaaS, AI-powered market inttrend, innovation hub Living Lab, low-code solution Dedalow, and social initiatives CLOQQ and girlsgonna. 48. Lenovo Lenovo opts for a smart technology innovation, such as rollable form factor innovation for laptop PC and smartphones, Lenovo Freestyle App for better productivity, Supplier 360 AI solutions, ThinkEdge series of servers, aside from upholding a vision for net-zero emissions by 2050. 49. BMW BMW drives through interior open innovation and digitalization by enhancing its 3D development with mixed and virtual reality, BMW Welt for young kids as robotics to teach them sustainability and electro-mobility, thoroughbred electric cars, and BMW Lab portal for ConnectedDrive services such as automating the switching on of outdoor light of the house when the car approaches. 50. Unilever Unilever delivers impactful innovation with a stronger funnel for biggest brands such as Rexona a patented technology in deodorants, Knorr zero-salt stock cube for healthier diet, Dove body wash for better skin care, Hellmann’s vegan mayonnaise for plant-based ingredients, Prestige beauty business Hourglass Red 0 as a color pigment, Dove hair therapy for premium hair, and TRESemme sulphate-free hair care, among the rest. Innovation Fuelled By Downturns These 50 companies are positioning innovation front and center to upscale their future growth agendas, in a bid to potentially drive real business value. Breakthrough innovations are being taken place by companies allocating more than one-third of their total expenditure into fruitful and incremental innovations. The innovation-ready leaders are consistently establishing new revenue streams, entering new markets and delivering new products by using tools such as artificial intelligence, portfolio planning and mergers and acquisitions to outpace others in the global market. Whereas, laggards are struggling to make any headway beyond incremental improvements, perhaps that is why most companies are witnessing their downfall, whilst the innovation-ready companies use every downturn as an opportunity to introduce new innovations in the market, maintaining customer satisfaction and creating employee value. Proofread & Published By Naveenika Chauhan","filter_flag":1}
