{"title":"NIR test program reveals factors affecting flexible packaging sorting - Labels and Labeling","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwOi8vd3d3LmxhYmVsc2FuZGxhYmVsaW5nLmNvbS9ldXJvcGUvbmV3cy9zdXN0YWluYWJpbGl0eS9uaXItdGVzdC1wcm9ncmFtLXJldmVhbHMtZmFjdG9ycy1hZmZlY3RpbmctZmxleGlibGUtcGFja2FnaW5nLXNvcnRpbmfSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwOi8vd3d3LmxhYmVsc2FuZGxhYmVsaW5nLmNvbS9ldXJvcGUvbmV3cy9zdXN0YWluYWJpbGl0eS9uaXItdGVzdC1wcm9ncmFtLXJldmVhbHMtZmFjdG9ycy1hZmZlY3RpbmctZmxleGlibGUtcGFja2FnaW5nLXNvcnRpbmfSAQA?oc=5","id":"CBMigQFodHRwOi8vd3d3LmxhYmVsc2FuZGxhYmVsaW5nLmNvbS9ldXJvcGUvbmV3cy9zdXN0YWluYWJpbGl0eS9uaXItdGVzdC1wcm9ncmFtLXJldmVhbHMtZmFjdG9ycy1hZmZlY3RpbmctZmxleGlibGUtcGFja2FnaW5nLXNvcnRpbmfSAQA","guidislink":false,"published":"Sun, 17 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=17, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=351, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwOi8vd3d3LmxhYmVsc2FuZGxhYmVsaW5nLmNvbS9ldXJvcGUvbmV3cy9zdXN0YWluYWJpbGl0eS9uaXItdGVzdC1wcm9ncmFtLXJldmVhbHMtZmFjdG9ycy1hZmZlY3RpbmctZmxleGlibGUtcGFja2FnaW5nLXNvcnRpbmfSAQA?oc=5\" target=\"_blank\">NIR test program reveals factors affecting flexible packaging sorting<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Labels and Labeling<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"NIR test program reveals factors affecting flexible packaging sorting - Labels and Labeling","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwOi8vd3d3LmxhYmVsc2FuZGxhYmVsaW5nLmNvbS9ldXJvcGUvbmV3cy9zdXN0YWluYWJpbGl0eS9uaXItdGVzdC1wcm9ncmFtLXJldmVhbHMtZmFjdG9ycy1hZmZlY3RpbmctZmxleGlibGUtcGFja2FnaW5nLXNvcnRpbmfSAQA?oc=5\" target=\"_blank\">NIR test program reveals factors affecting flexible packaging sorting<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Labels and Labeling<\/font>","source.href":"http:\/\/www.labelsandlabeling.com","source.title":"Labels and Labeling","query":"https:\/\/news.google.com\/rss\/search?q=\"Design for recycling\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"The initiative clarifies exactly how a NIR sorting device sees flexible packaging, understands a range of material structures, and classifies them into different recycling streams, with data illustrating how to enhance design for recycling guidance, improve design decisions, and optimize the sorting of flexible plastic packaging with NIR. CEFLEX worked with stakeholders from across the value chain to assemble the extensive set of packaging material samples for testing. Academic partners and respected test centers in Germany and the Netherlands collaborated to deliver the program, co-funded by UK Research & Innovation’s Smart Sustainable Plastic Packaging Challenge and delivered by Innovate UK. The report provides new data to boost circular design decisions based on industrial-scale testing of a unique set of 240 samples and over 100 structures. The principal results and data are now available in an open-source report for public download from the CEFLEX website. ‘NIR is an established key technology for sorting plastics across Europe, so rigorous, independent data of exactly what it can – and cannot – achieve is essential,’ said project coordinator and managing director of CEFLEX, Graham Houlder. ‘As a result of this research, specific cases or thresholds where materials and elements of the packaging structure can disrupt sorting are established. ‘These insights are being shared openly to boost industry knowledge and will enhance our ‘Designing for a Circular Economy’ (D4ACE) guidelines. Designers of flexible packaging now have a new level of detail on exactly how to achieve the best outcomes.’ CEFLEX design lead Liz Morrish added, ‘In addition to establishing exactly how NIR sees packaging structures, the data shows how orientation, layer sequence, and opaque and reflective materials – such as carbon black, metallization, aluminum, paper – can affect the sorting outcomes and at what thresholds.’ Testing demonstrated that, for many multi-material, multi-layer structures, the NIR spectrum contains information about all layers of the structure. The report also reveals that thin layers such as adhesives, coatings, and most inks generally do not influence the sorting results. The publication is part of an extensive testing program with a network of leading laboratories, universities, and industry experts to generate open-source, robust and independent data to strengthen flexible packaging design guidance across the board. Future results assess the impact of size and shape on sorting and mechanical recyclability of flexible packaging structures.","filter_flag":1}
