{"title":"Why Some Companies Are Ahead in the Race to Net Zero - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LXNvbWUtY29tcGFuaWVzLWFyZS1haGVhZC1pbi10aGUtcmFjZS10by1uZXQtemVyby1hbmQtcmVkdWNpbmctZW1zc2lvbnPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LXNvbWUtY29tcGFuaWVzLWFyZS1haGVhZC1pbi10aGUtcmFjZS10by1uZXQtemVyby1hbmQtcmVkdWNpbmctZW1zc2lvbnPSAQA?oc=5","id":"CBMicGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LXNvbWUtY29tcGFuaWVzLWFyZS1haGVhZC1pbi10aGUtcmFjZS10by1uZXQtemVyby1hbmQtcmVkdWNpbmctZW1zc2lvbnPSAQA","guidislink":false,"published":"Thu, 16 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=16, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=320, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LXNvbWUtY29tcGFuaWVzLWFyZS1haGVhZC1pbi10aGUtcmFjZS10by1uZXQtemVyby1hbmQtcmVkdWNpbmctZW1zc2lvbnPSAQA?oc=5\" target=\"_blank\">Why Some Companies Are Ahead in the Race to Net Zero<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why Some Companies Are Ahead in the Race to Net Zero - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LXNvbWUtY29tcGFuaWVzLWFyZS1haGVhZC1pbi10aGUtcmFjZS10by1uZXQtemVyby1hbmQtcmVkdWNpbmctZW1zc2lvbnPSAQA?oc=5\" target=\"_blank\">Why Some Companies Are Ahead in the Race to Net Zero<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable product design\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Challenges Faced Only 10% of companies reported comprehensively measuring all their emissions, revealing no improvement relative to our 2022 survey. More concerning, only 14% of companies indicated reducing emissions in line with their ambitions, down 3pp from those reporting the same in 2022. Companies indicated that their reduction efforts have been obstructed by several challenges, most notably difficult macroeconomic conditions and capital constraints. Signs of Progress Despite these discouraging results at a global level, there are bright spots to highlight. On Scope 3, for example, companies have taken steps to significantly improve the coverage of their emissions measurement and reporting. The number of respondents indicating partial measurement and reporting of Scope 3 emissions has increased by 19pp since 2021, from 34% to 53%. In tandem, more respondents said they have set Scope 3 reduction targets—up 12pp since 2021, from 23% to 35%—with the most common areas of focus being waste management and purchased goods and services. According to the CDP, supply chain emissions (Scope 3) are, on average, 11.4 times greater than operational emissions (Scopes 1 and 2). Hence, the reported increase in Scope 3 measurement and reporting is encouraging, as increased collaboration along the supply chain is essential to attaining net zero. In addition, some regions have demonstrated a clear improvement in emissions measurement during the past two years. Since 2021, the number of Asia-Pacific respondents comprehensively reporting Scopes 1, 2, and 3 emissions increased by 7pp, while the number of South American and North American respondents comprehensively reporting their internal emissions—Scopes 1 and 2—grew by 9pp and 5pp, respectively. To drive more robust emissions accounting, countries have started to implement regulations related to climate-related disclosure and reporting. Many of these regulations initially call on large, publicly listed companies to report emissions and other climate impacts; in follow-on phases, the regulations will be expanded to smaller entities. Such regulations will likely spur more comprehensive reporting of Scopes 1, 2, and 3 emissions over the next few years, once they are fully in effect. Competitive Advantage Decarbonization provides a host of financial and nonfinancial rewards to businesses. A growing number of companies recognize this, citing the following as top benefits: reputational value, lower operating costs, greater regulatory compliance, higher valuations, increased revenues, the improved attraction and retention of talent, and tax savings. When asked to quantify, 40% of respondents estimated an annual financial benefit of at least $100 million for meeting emissions reduction targets, a 3pp increase compared with last year’s survey. Businesses that have made decarbonization progress are capturing these wide-ranging benefits and gaining a competitive edge over their peers. To catch up, laggards will need to accelerate their emissions reduction in the near term, even as their measurement and reporting are still maturing. A Path Forward When we compare companies that report reducing their emissions in line with their ambitions and those that do not, we find that the former disproportionately display four notable traits: They collaborate with suppliers and customers on emissions measurement and reduction. They calculate emissions at the product level. They harness the power of digital technology in the emissions management process. They consider emissions-reporting regulations to be a key enabler of reduction. Collaborating with Suppliers and Customers. As indicated above, companies globally have made strides in expanding their Scope 3 coverage and establishing reduction targets over the past two years. Businesses reported that, in their efforts to meet these new targets, they have benefited significantly from robust partnerships with both suppliers and customers. Indeed, 75% of companies that cut emissions in line with their ambition have joint reduction initiatives with most of their suppliers, and 54% have similar initiatives with most of their customers. Schneider Electric, a global energy technology company, is an example of an organization unifying its supply chain in a broad emissions reduction effort. In 2021, the company launched partnerships with more than 1,000 of its suppliers to calculate, report, and set goals on emissions reduction. Through workshops and educational webinars, the company catalyzed nearly 900 suppliers to begin reporting and actively decreasing emissions, driving progress beyond the gates of its own operations. Calculating Emissions at the Product Level. We find that 75% of companies attempt to measure emissions for at least some of their products from cradle to gate, that is, from raw materials to distribution. To be most effective, these product-level assessments require regular supplier input and accurate attribution of emissions to each product. Reckitt, a multinational consumer goods company, sees its product-level approach as critical to meeting its sustainability targets, including emissions reduction. Fabrice Beaulieu, the company’s chief marketing, sustainability, and corporate affairs officer, adds, “Consumers expect brands to meet their needs, while also using less plastic and emitting less carbon. Our playbook for sustainable product innovation leverages the power of product-level data to meet these expectations and drive more sustainable product design.” As consumers drive demand for new or upgraded products, the company deploys its internal Sustainable Innovation Calculator to compare the footprints of various product designs, evaluating the impact that different compositions, packaging, transport modes, and other factors have on a product’s overall sustainability score. Reckitt uses these assessments to innovate and develop new products that have lower environmental impact compared with the products they replace. Fabrice highlights, “We innovate to create value for consumers, meet their evolving demands, and lower our environmental impact. The scientific precision of our tools helps us create more sustainable and attractive products, fulfilling these goals.” Reckitt also seeks to use product-level innovation to improve sustainability in consumer behaviors. For example, Reckitt’s dishwashing brand, Finish, is innovating to meet the UN’s Sustainability Development Goal focused on clean water and sanitation. The brand reformulated Finish dishwashing products to eliminate the need for prerinsing, enabling customers to save water in their everyday use of the product. This type of innovation allows Reckitt to engage consumers, persuade them to act differently, and, in doing so, reduce their own environmental footprint. Klöckner & Co is one of the largest producer-independent distributors of steel and metal products and one of the leading steel service companies worldwide, with more than 90,000 customers. As a pioneer in the sustainable steel industry, Klöckner & Co developed a proprietary Product Carbon Footprint (PCF) calculation engine, the Nexigen PCF Algorithm, which has calculated more than 200,000 PCFs. (Nexigen is a trademark of Klöckner & Co.) Each PCF calculated is accompanied by a TÜV SÜD certificate that is available to Klöckner & Co’s customers with each green material purchased. Taking its Nexigen PCF Algorithm a step further, Klöckner & Co developed a solution, Nexigen Data Services, that enables customers to see the carbon footprint of their past purchases and offers greener alternatives for future purchases. Felix Schmitz, CEO of Klöckner & Co subsidiary Kloeckner Metals Germany, comments, “Green steel is the way forward, and we arm our customers with decision-useful product-level data. This information enables customers to make green purchase decisions, and it sends a demand signal back through the whole supply chain.” As a result, Klöckner & Co’s customers are empowered by knowing the exact carbon footprint of each product and can easily choose greener alternatives. Harnessing the Power of Digital Technology. Technology solutions improve accuracy and efficiency when assessing emissions and can help identify innovative ways to reduce them. Our survey finds that companies with automated digital solutions for measurement are 2.5 times more likely to measure their emissions comprehensively. In addition, surveyed companies listed technology adoption and use as the leading strategic enabler for improving emissions reduction in their organization. As an example, The Economist Group, a global media and information services company, deploys CO2 AI’s data platform, an end-to-end sustainability platform that helps large, complex organizations manage their sustainability goals by measuring and reducing emissions at scale. The decision to use a technology solution such as CO2 AI came from The Economist Group’s focus on a science-based and data-driven approach. “The Economist Group is known for the rigor and accuracy of both its reporting and its business-intelligence products and services, and we wanted to ensure that this was reflected in our [sustainability] approach,” says Emily Jackson, SVP Sustainability. CO2 AI–enabled automation of measurement also generates efficiency for the company. “Measuring emissions is key for monitoring our progress and for KPI and disclosure reporting—but it is a highly repetitive process. It made good business sense to use an automated tool to do this on a monthly or quarterly basis, rather than tie up team resources,” remarks Jackson. Most important, The Economist Group uses the platform in translating measurement into actual reduction. The company has identified hot spots, found new reduction levers, and used key tool outputs to engage top-emitting suppliers in new joint reduction initiatives. “Emissions heat maps have opened up transparent conversations on reduction with our suppliers where we didn’t have them before,” Jackson adds. As AI matures, digital technology solutions will continue to improve accuracy, efficiency, and decision making in emissions management. Companies recognize this potential. Of those surveyed, about 30% plan to expand deployment of AI-powered tools in the next three years across a variety of functions, including predictive modeling and supply chain tracking. Viewing Regulations Positively. Companies that are reducing their emissions in line with their ambition are twice as likely to view emissions-reporting regulations as helpful guidance to their emissions measurement approach and twice as likely to view the regulations as an enabler of emissions reduction. These findings suggest that, in addition to the internal company practices highlighted above, external reporting mechanisms can play a pivotal role in advancing emissions reduction. Through collaboration, product-level assessments, and digital technology, companies can find the data and strategies they need to close the gap between their actions and their ambitions in reducing emissions. Progress in these areas will not only alleviate the burden of climate change but also deliver a boost to the bottom line. The authors thank Laurent Acharian, Juliette Callahan, Jack Higham, Heather Nowaczyk, Joe Vasquez, and Eva Wilde for their contributions to the analysis and writing of this report. This research was a collaboration between BCG and CO2 AI, an enterprise sustainability management platform that helps companies master their end-to-end net zero journey.","filter_flag":1}
{"title":"Arcade Beauty Acquires TruEssence® from ORLANDI - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvYXJjYWRlLWJlYXV0eS1hY3F1aXJlcy10cnVlc3NlbmNlLWZyb20tb3JsYW5kaS0zMDE5OTk4NzkuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvYXJjYWRlLWJlYXV0eS1hY3F1aXJlcy10cnVlc3NlbmNlLWZyb20tb3JsYW5kaS0zMDE5OTk4NzkuaHRtbNIBAA?oc=5","id":"CBMiZmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvYXJjYWRlLWJlYXV0eS1hY3F1aXJlcy10cnVlc3NlbmNlLWZyb20tb3JsYW5kaS0zMDE5OTk4NzkuaHRtbNIBAA","guidislink":false,"published":"Tue, 28 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=332, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvYXJjYWRlLWJlYXV0eS1hY3F1aXJlcy10cnVlc3NlbmNlLWZyb20tb3JsYW5kaS0zMDE5OTk4NzkuaHRtbNIBAA?oc=5\" target=\"_blank\">Arcade Beauty Acquires TruEssence® from ORLANDI<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Arcade Beauty Acquires TruEssence® from ORLANDI - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvYXJjYWRlLWJlYXV0eS1hY3F1aXJlcy10cnVlc3NlbmNlLWZyb20tb3JsYW5kaS0zMDE5OTk4NzkuaHRtbNIBAA?oc=5\" target=\"_blank\">Arcade Beauty Acquires TruEssence® from ORLANDI<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable product design\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"NEW YORK, Nov. 28, 2023 \/PRNewswire\/ -- Arcade Beauty, a leading global provider of end-to-end beauty solutions, is excited to announce the successful acquisition of ORLANDI's TruEssence® business. The transaction includes the acquisition of laboratory and slurry production equipment and the related intellectual property of TruEssence®. As a result, on January 1, 2024, ORLANDI will be exiting the category of scented strips and its TruEssence® product line while maintaining its other sampling product offerings. Arcade Beauty pioneered ScentStrip® in 1979, which still remains the most cost-effective way to deliver a quality rendition of fine fragrance. Scented strips have a multifaceted application strategy, where brands can showcase fine fragrance in magazines, catalog inserts, direct mail and at retail. \"We are excited that we were able to come to this arrangement with ORLANDI,\" said Jorge Garcia, Arcade Beauty's Executive Vice President and CFO. \"This acquisition creates a necessary synergy that will protect this category for our customer base in the years to come.\" \"We see this as a win-win for ORLANDI, our customers and the beauty industry as a whole,\" said Sven Dobler, CEO of ORLANDI. Adding, \"this transaction corrects a significant overcapacity in the entire industry supply chain for scented strips.\" \"Divesting the TruEssence® product line is a strategic re-alignment that will increase ORLANDI's focus and investments in our other sampling technologies and scented retail product lines,\" said ORLANDI's Senior Vice President, Per Dobler. Simultaneously, Arcade Beauty has entered into a strategic Lease Agreement for the facility located at 7026 Discovery Drive, Chattanooga, TN 37416 (\"Discovery Drive\") to consolidate and relocate its existing laboratory and slurry production processes supporting Arcade Beauty's scented strips and label technologies. \"Discovery Drive is a key asset in this acquisition, and its addition to Arcade Beauty's portfolio enhances our ability to optimize operations for our customers while providing an excellent location for continued innovation and operational excellence,\" said Carl Allain, President and CEO of Arcade Beauty. \"The facility is ideally situated to support Arcade Beauty's strategic objectives.\" \"This acquisition underscores Arcade Beauty's dedication to support our brand partners,\" said Carl Allain. \"Arcade Beauty looks forward to the opportunities that lie ahead and is committed to delivering exceptional value to all stakeholders.\" As part of the acquisition, Arcade Beauty and ORLANDI will be working closely to ensure a smooth transition for employees, customers, and suppliers. About Arcade Beauty Arcade Beauty is a leading global provider of end-to-end beauty solutions. With over a century of expertise and continuous investment in innovation with sustainable packaging and formulation capabilities, we deliver strategic, custom retail and sampling solutions for our partners, worldwide. Arcade Beauty is headquartered in NYC and provides an unparalleled offering with over 30 technologies in its product portfolio supporting over 400 international beauty brands and a global footprint operating 12 facilities worldwide. To learn more, visit https:\/\/arcadebeauty.com\/ About ORLANDI: ORLANDI, is an international supplier of many different fragrance and cosmetic sampling solutions to the beauty and consumer products sector, as well as a leader in contract packaging, design and the manufacture of scented retail products for home and air care applications. ORLANDI is family owned and operated, with roots dating to 1865, and continues to build value for its many long-term employees and customers through excellence in research, innovation, sustainable product design, superior quality and customer service. ORLANDI is headquartered in Farmingdale NY USA and has operational facilities and laboratories in the United States, France and Brazil. To learn more, visit https:\/\/orlandi-usa.com SOURCE Arcade Beauty","filter_flag":1}
