{"title":"ReSeed and FoodChain ID Announce Ground-Breaking Partnership That Promotes Transparency for Sustainable ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMizgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3Jlc2VlZC1hbmQtZm9vZGNoYWluLWlkLWFubm91bmNlLWdyb3VuZC1icmVha2luZy1wYXJ0bmVyc2hpcC10aGF0LXByb21vdGVzLXRyYW5zcGFyZW5jeS1mb3Itc3VzdGFpbmFibGUtcHJhY3RpY2VzLWluLXRoZS1nbG9iYWwtYWdyaS1mb29kLXN1cHBseS1jaGFpbi0zMDE5OTc5MjcuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMizgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3Jlc2VlZC1hbmQtZm9vZGNoYWluLWlkLWFubm91bmNlLWdyb3VuZC1icmVha2luZy1wYXJ0bmVyc2hpcC10aGF0LXByb21vdGVzLXRyYW5zcGFyZW5jeS1mb3Itc3VzdGFpbmFibGUtcHJhY3RpY2VzLWluLXRoZS1nbG9iYWwtYWdyaS1mb29kLXN1cHBseS1jaGFpbi0zMDE5OTc5MjcuaHRtbNIBAA?oc=5","id":"CBMizgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3Jlc2VlZC1hbmQtZm9vZGNoYWluLWlkLWFubm91bmNlLWdyb3VuZC1icmVha2luZy1wYXJ0bmVyc2hpcC10aGF0LXByb21vdGVzLXRyYW5zcGFyZW5jeS1mb3Itc3VzdGFpbmFibGUtcHJhY3RpY2VzLWluLXRoZS1nbG9iYWwtYWdyaS1mb29kLXN1cHBseS1jaGFpbi0zMDE5OTc5MjcuaHRtbNIBAA","guidislink":false,"published":"Mon, 27 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=331, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMizgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3Jlc2VlZC1hbmQtZm9vZGNoYWluLWlkLWFubm91bmNlLWdyb3VuZC1icmVha2luZy1wYXJ0bmVyc2hpcC10aGF0LXByb21vdGVzLXRyYW5zcGFyZW5jeS1mb3Itc3VzdGFpbmFibGUtcHJhY3RpY2VzLWluLXRoZS1nbG9iYWwtYWdyaS1mb29kLXN1cHBseS1jaGFpbi0zMDE5OTc5MjcuaHRtbNIBAA?oc=5\" target=\"_blank\">ReSeed and FoodChain ID Announce Ground-Breaking Partnership That Promotes Transparency for Sustainable ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ReSeed and FoodChain ID Announce Ground-Breaking Partnership That Promotes Transparency for Sustainable ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMizgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3Jlc2VlZC1hbmQtZm9vZGNoYWluLWlkLWFubm91bmNlLWdyb3VuZC1icmVha2luZy1wYXJ0bmVyc2hpcC10aGF0LXByb21vdGVzLXRyYW5zcGFyZW5jeS1mb3Itc3VzdGFpbmFibGUtcHJhY3RpY2VzLWluLXRoZS1nbG9iYWwtYWdyaS1mb29kLXN1cHBseS1jaGFpbi0zMDE5OTc5MjcuaHRtbNIBAA?oc=5\" target=\"_blank\">ReSeed and FoodChain ID Announce Ground-Breaking Partnership That Promotes Transparency for Sustainable ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"PITTSBURGH and FAIRFIELD, Iowa, Nov. 27, 2023 \/PRNewswire\/ -- FoodChain ID , a pioneer in global sustainability certification, and ReSeed , the first provider of full lifecycle carbon credit traceability, have announced a partnership to increase transparency in measurement and verification of sustainable practices in the agri-food supply chain. With the goal to support a healthy planet, the partnership will leverage each company's unique, world-class expertise to incentivize, measure and verify the progress of carbon sequestration through regenerative agriculture practices under a new carbon credit verification standard. FoodChain ID The food and agriculture industry currently contributes over one-third of the total global greenhouse gas emissions, according to the United Nations. However, less than 1% of carbon credits on the market are sourced from agriculture.1 As consumer awareness of the industry's role in accelerating global warming has grown, food companies have responded with more sustainable products and product claims. In fact, on-pack carbon emission contribution claims for new products grew at 33% CAGR between July 2018 and June 2023,2 making such claims one of the fastest growing sustainability claim categories in food and beverage. In response to the claim proliferation, the carbon credit verification partnership is designed to increase measurement transparency and accountability for sustainability progress and carbon credit offsets in the agri-food supply chain. Additionally, the carbon credit verification partnership incentivizes farmers to invest more in regenerative agriculture practices while complying with European Union deforestation-free regulatory requirements (EUDR). Finally, by combining the program with other farm-level audits, such as Organic (EU, USDA and others), GLOBALG.A.P., RTRS, RSPO, Bonsucro or ProTerra, the program offers efficiencies for farmers. The first joint programs have launched with close to a thousand farmers in Brazil to implement deforestation-free, regenerative practices. ReSeed, with its AI-powered digital ledger transparency platform, will collect and process data for carbon credit measurement protocols to allow monetization and incentivization for farmers deploying sustainable practices in the field. ReSeed's team will also leverage their legal and technical knowledge to validate carbon estimates under international standards and provide field technical assistance to sort eligible farmers based on sustainability standards for farming activities. FoodChain ID, with over 25 years of experience in global sustainability certifications, will serve as the exclusive verifier for the carbon credit partnership under ISO 14065 accreditation. FoodChain ID's independent technical experts will perform yearly audits of farm practices under international sustainability standards, adding third-party credibility to the measurement of carbon sequestration in soil. Dr. Heather Secrist, Senior Vice President, Technical Services Americas at FoodChain ID, comments: \"FoodChain ID is proud to partner with ReSeed as the exclusive third-party verifier for this breakthrough partnership which incentivizes the agri-food supply chain to adopt more sustainable practices. Together with the recent launch of our new global standard for Regenerative Agriculture Certification , today's announcement affirms our commitment to contribute to a sustainable and healthy planet, while supporting the livelihood of farmers and a transparent agri-food supply chain.\" Zak Zaidman, Co-Founder and President of Partnerships of ReSeed, comments: \"Incentivizing and supporting farmers to steward carbon through regenerative farming practices is crucial in the pursuit of a healthy planet. The carbon credit verification partnership announced today with FoodChain ID as the exclusive, independent, third-party verifier increases transparency and trust across the global agri-food supply chain. ReSeed will continue to work closely with global brands and their supply chain to invest in sustainable and regenerative practices to secure the future of both their business and the planet.\" Ivy S. So, Barbara K. Haya, Micah Elias . May 2023 . Voluntary Registry Offsets Database, Berkeley Carbon Trading Project, University of California, Berkeley . Innova Insights\/Nutrition Insights, July 2018 to June 2023 . About FoodChain ID FoodChain ID is a trusted provider to over 30,000 companies across the global supply chain, with technology-enabled solutions and technical expertise to keep the food supply chain safe, compliant and transparent. Service areas include sustainability certification and verification, food safety and product certification, regulatory compliance, testing and product development. Visit www.foodchainid.com for more information. About ReSeed PBC ReSeed is a nature-based services provider, bringing carbon credits directly from smallholder farmers to the market. We fight climate change at scale by financing and incentivizing these farmers to steward carbon through regenerative farming practices. ReSeed is the first company to combine environmental and social impact metrics with traceable carbon credits from farms, bringing to market a data set that increases accountability and fosters clean supply chains. Learn more at ReSeed.farm . Contact: ReSeed Kate Laursen [email protected] (203) 610-5879 FoodChain ID Ceci Snyder FoodChain ID [email protected] +1 515-491-5173 SOURCE ReSeed","filter_flag":1}
{"title":"Survey: 90 Percent of Dietitians Want to Promote Sustainable Diets. What's Stopping Them? - VegNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vdmVnbmV3cy5jb20vZGlldGl0aWFucy1zdXN0YWluYWJsZS1kaWV0cy1iYXJyaWVyc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vdmVnbmV3cy5jb20vZGlldGl0aWFucy1zdXN0YWluYWJsZS1kaWV0cy1iYXJyaWVyc9IBAA?oc=5","id":"CBMiOWh0dHBzOi8vdmVnbmV3cy5jb20vZGlldGl0aWFucy1zdXN0YWluYWJsZS1kaWV0cy1iYXJyaWVyc9IBAA","guidislink":false,"published":"Tue, 21 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=325, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vdmVnbmV3cy5jb20vZGlldGl0aWFucy1zdXN0YWluYWJsZS1kaWV0cy1iYXJyaWVyc9IBAA?oc=5\" target=\"_blank\">Survey: 90 Percent of Dietitians Want to Promote Sustainable Diets. What's Stopping Them?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Survey: 90 Percent of Dietitians Want to Promote Sustainable Diets. What's Stopping Them? - VegNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vdmVnbmV3cy5jb20vZGlldGl0aWFucy1zdXN0YWluYWJsZS1kaWV0cy1iYXJyaWVyc9IBAA?oc=5\" target=\"_blank\">Survey: 90 Percent of Dietitians Want to Promote Sustainable Diets. What's Stopping Them?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","source.href":"https:\/\/vegnews.com","source.title":"VegNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"A global shift toward plant-based food systems can do a lot of good for human and planetary health. One recent Oxford University study found that diets rich in plant-based foods reduced greenhouse gas emissions, land use, and water pollution by 75 percent compared to high meat-consuming diets. This research complements a study published around the same time by the Harvard T.H. Chan School of Public Health found that individuals following an environmentally sustainable diet were 25 percent less likely to die during a follow-up period of more than 30 years than those with less sustainable diets. And dietitians across the United States, a new survey found, are ready to put these changes in motion. Getty The 2023 Sustainability and Food Insights Survey, jointly conducted by Food + Planet and Today’s Dietitian, revealed a profound eagerness among dietitians to embrace sustainability in their professional practices. A staggering 90 percent of dietitians acknowledge the need to be involved in advocating for sustainable food systems, yet they encounter significant barriers that hinder their ability to effectively do so. “We know that dietitians are trusted voices in their communities, so they have great opportunities to educate people about making sustainable food choices,” Planet + Food Co-Founder Sharon Palmer said in a statement. “This could result in a tremendous impact on planetary and human health.” Barriers to advocating for sustainable diets Planet + Food was founded in 2020 by four registered dietitians—Palmer, Sherene Chou, Kate Geagan, and Chris Vogliano—to empower healthcare professionals to be leaders in promoting sustainable food systems. “As co-founders, we really came together around this idea that sustainability was vitally important to the future of our profession, our food system and our collective well being as a planet,” Geagan tells VegNews. “And we believed there was an opportunity (and a hunger from many, especially those coming up in the profession now) to catalyze open access resources, learning, and collaborative exchange to help our profession meet this moment,” Geagan says. Marko Jan\/Getty Despite this recognized potential, the survey, which gathered insights from 1,161 registered dietitians (RDs) across the US, indicates a gap between dietitians’ aspirations and their current practices. While a resounding 95 percent believe their profession should be actively involved in advocating for sustainable food systems, 42 percent report not incorporating sustainability into their work consistently. The primary obstacles? The survey found that an overwhelming 98 percent of RDs encounter barriers to advancing sustainable food systems in their practice, with 30 percent citing lack of access and affordability as the top barriers. Information gaps are also significant, with 21 percent acknowledging a lack of knowledge as a barrier. “In addition, the survey showed that dietitians are not up to speed on some of the evidence-based factors related to sustainable diets,” Palmer said. “It is clear that empowering dietitians with sustainability training is a key strategy for advancing sustainable food systems that nourish both people and the planet.” Adobe Confidence in providing sustainability guidance is another concern. More than two-thirds (69 percent) of RDs do not feel confident or are neutral about advising on sustainable food choices. Specific areas where RDs feel least knowledgeable include agriculture practices and environmental impacts of food choices, ethical labor and climate justice, and culturally inclusive guidance. Empowering dietitians to be sustainability leaders Interestingly, nearly two-thirds (62 percent) of RDs believe that sustainability should be formally integrated into the USDA Dietary Guidelines for Americans. Getty However, there exists a disparity between RDs’ beliefs on sustainable diet practices and evidence-based global food-based dietary guidelines, particularly in ranking the impact of various sustainable practices. “RDs bring so many skills that are needed for this great transition we are in, and are ideally situated across many sectors to be powerful levers for change—at the community, healthcare, retail, CPG, innovation, policy, media, research levels and more,” Geagan says. As the scientific community continues to publish research that points to the health and environmental advantages of promoting a plant-based diet, Gegan and her team are working to close these gaps for dietitians in moving the needle forward. “Our mission is to empower one million health professionals with sustainability by 2025,” Geagan says. “And a key part of this is shining a light on the RDs who are doing great work in this space: from culinary dietitians to community leaders, from RDs designing global sustainability wellness policies for foodservice companies to those tackling community food waste or food justice.”","filter_flag":1}
{"title":"Don't Believe What Consumers Say When It Comes to Sustainability - The Business of Fashion","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJ1c2luZXNzb2ZmYXNoaW9uLmNvbS9vcGluaW9ucy9zdXN0YWluYWJpbGl0eS9zdXN0YWluYWJpbGl0eS1zdXJ2ZXlzLWZhc2hpb24tY29uc3VtZXJzLWJsYWNrLWZyaWRheS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJ1c2luZXNzb2ZmYXNoaW9uLmNvbS9vcGluaW9ucy9zdXN0YWluYWJpbGl0eS9zdXN0YWluYWJpbGl0eS1zdXJ2ZXlzLWZhc2hpb24tY29uc3VtZXJzLWJsYWNrLWZyaWRheS_SAQA?oc=5","id":"CBMicGh0dHBzOi8vd3d3LmJ1c2luZXNzb2ZmYXNoaW9uLmNvbS9vcGluaW9ucy9zdXN0YWluYWJpbGl0eS9zdXN0YWluYWJpbGl0eS1zdXJ2ZXlzLWZhc2hpb24tY29uc3VtZXJzLWJsYWNrLWZyaWRheS_SAQA","guidislink":false,"published":"Fri, 24 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=24, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=328, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJ1c2luZXNzb2ZmYXNoaW9uLmNvbS9vcGluaW9ucy9zdXN0YWluYWJpbGl0eS9zdXN0YWluYWJpbGl0eS1zdXJ2ZXlzLWZhc2hpb24tY29uc3VtZXJzLWJsYWNrLWZyaWRheS_SAQA?oc=5\" target=\"_blank\">Don't Believe What Consumers Say When It Comes to Sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Business of Fashion<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Don't Believe What Consumers Say When It Comes to Sustainability - The Business of Fashion","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJ1c2luZXNzb2ZmYXNoaW9uLmNvbS9vcGluaW9ucy9zdXN0YWluYWJpbGl0eS9zdXN0YWluYWJpbGl0eS1zdXJ2ZXlzLWZhc2hpb24tY29uc3VtZXJzLWJsYWNrLWZyaWRheS_SAQA?oc=5\" target=\"_blank\">Don't Believe What Consumers Say When It Comes to Sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Business of Fashion<\/font>","source.href":"https:\/\/www.businessoffashion.com","source.title":"The Business of Fashion","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"One of the world’s biggest shopping holidays takes place this week: Black Friday, a frenzy of heavily discounted excess consumption. The shopping hauls serve to spotlight one of many contradictions in the world of sustainable fashion: while consumers increasingly say they want more sustainable products, they’re not shopping like that way. Indeed, even as survey after survey reveals increasing investor and consumer preference for eco-conscious and socially responsible garments, companies like Shein continue to grow market share by selling $12 synthetic halter tops with short life spans. A survey of more than 20,000 people published by consultancy Bain & Company earlier this month reached the conclusion that consumers around the world are willing to pay 12 percent more for sustainable products. Another recent survey from NYU Stern Centre for Sustainable Business asserted that sustainable brands are growing at twice the rate of traditional labels. And a Harvard Business Review article written by Deloitte consultants concluded that retail is “fast approaching [a] tipping point” where shifts in consumption patterns give truly sustainable brands a real edge. But as they do every year, shoppers are expected to drop billions on new stuff this Friday, hunting down bargains with little care for sustainability credentials, making clear that the reality on the ground bears no resemblance to the sunny findings that populate consumer surveys. ADVERTISEMENT The following are five factors that explain the chasm between surveys and actual consumption. Poorly Constructed Surveys Consumer surveys are useful tools for surfacing basic information. For example, do you own a backpack? How old is your backpack? How much did you pay for your backpack? Questionnaires that seek to understand consumer motivations are far less helpful — people rarely give illuminating, or even truthful, answers to questions looking to understand why and how they shop. According to brand consultant and professor Mark Ritson, this is “partly because they will give you a false answer to impress you; partly because it depends on the other tradeoffs that they might have to make; partly because by question 42 you might as well be asking them in Klingon. But mostly because they simply don’t know the degree to which it influences them.” Intention vs Action In brief, people don’t do what they say. There is a clear intention versus action gap when it comes to consumer sustainability purchasing surveys. Indeed, according to Kantar, a global data insights and consultancy, 92 percent of people say they want to live a sustainable life, but only 16 percent are actively changing their behaviours in order to do so. When it comes to fast fashion, the intention versus action gap persists. More than half of the 46 percent of the British population who say that they avoid buying fast-fashion products bought something from a fast-fashion retailer last year. An Ill-Defined Concept Even for consumers who legitimately seek to align their purchasing with their intentions, buying “sustainably” can be next to impossible. After all, how would one determine what constitutes a “sustainable” shirt or pair of shoes? Is a product’s sustainability based on durability, wears per garment, water usage, carbon emissions or eutrophication? How should each of these factors be weighted? Is the data that underlies claims reliable? Just last year, the Norwegian Consumer Council sanctioned Norrøna and H&M for using the fashion industry’s most accepted assessment tool, the Higg Index, in their consumer communications, causing an industry kerfuffle. In turn, US, UK and EU government agencies are working to tighten regulations governing “green claims.” Even so, the underlying complexities (including industry reliance on a multi-tiered, global, shared, opaque supplier base) and tradeoffs inherent in fashion production conspire to make a simple definition of sustainable fashion elusive. ADVERTISEMENT Vested Interests The authors of surveys touting the ascension of sustainability have commercial interests that benefit from their findings. For example, between 2019 and 2020, Bain & Company completed over 500 consulting projects for clients that were focused on sustainability. They also own (or are equity holders in) a bevy of related sustainability service providers, including Persefoni (carbon accounting), Ecovadis (ratings), Sylvera (carbon offsets) and Jupiter (carbon risk analytics). New York University’s Stern Center for Sustainable Business receives some funding from corporations that promote sustainability or have their own sustainability practices. Like Bain, Deloitte has a sustainability consulting service and a growing practice focused on disclosure and reporting of environmental, social and governance data. A Flawed Premise Finally, the selling of sustainability has become so pervasive that the proposition itself often goes unquestioned. That is a mistake. How is it that buying ever more “sustainable” fashion products will ever result in a planet that is more sustainable? Where did we get the idea that “sustainable” practices such as resale or circularity will slow the purchases of new products, especially when brands are in the business of pushing new dopamine-induced satisfaction? Different from the declaration of the Deloitte consultants, I see evidence of tipping points related to planetary boundaries far more clearly than tipping points in consumer behaviour. Kenneth P. Pucker is a professor of practice at the Tufts Fletcher School. Ken worked at Timberland for 15 years and served as chief operating officer from 2000 to 2007.","filter_flag":1}
{"title":"How the Sustainable Coconut Partnership addresses unsustainable practices in coconut supply chain - FoodNavigator.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMTEvMjIvaG93LXRoZS1zdXN0YWluYWJsZS1jb2NvbnV0LXBhcnRuZXJzaGlwLWFkZHJlc3Nlcy11bnN1c3RhaW5hYmxlLXByYWN0aWNlcy1pbi1jb2NvbnV0LXN1cHBseS1jaGFpbtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMTEvMjIvaG93LXRoZS1zdXN0YWluYWJsZS1jb2NvbnV0LXBhcnRuZXJzaGlwLWFkZHJlc3Nlcy11bnN1c3RhaW5hYmxlLXByYWN0aWNlcy1pbi1jb2NvbnV0LXN1cHBseS1jaGFpbtIBAA?oc=5","id":"CBMikgFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMTEvMjIvaG93LXRoZS1zdXN0YWluYWJsZS1jb2NvbnV0LXBhcnRuZXJzaGlwLWFkZHJlc3Nlcy11bnN1c3RhaW5hYmxlLXByYWN0aWNlcy1pbi1jb2NvbnV0LXN1cHBseS1jaGFpbtIBAA","guidislink":false,"published":"Wed, 22 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=326, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMTEvMjIvaG93LXRoZS1zdXN0YWluYWJsZS1jb2NvbnV0LXBhcnRuZXJzaGlwLWFkZHJlc3Nlcy11bnN1c3RhaW5hYmxlLXByYWN0aWNlcy1pbi1jb2NvbnV0LXN1cHBseS1jaGFpbtIBAA?oc=5\" target=\"_blank\">How the Sustainable Coconut Partnership addresses unsustainable practices in coconut supply chain<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How the Sustainable Coconut Partnership addresses unsustainable practices in coconut supply chain - FoodNavigator.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMTEvMjIvaG93LXRoZS1zdXN0YWluYWJsZS1jb2NvbnV0LXBhcnRuZXJzaGlwLWFkZHJlc3Nlcy11bnN1c3RhaW5hYmxlLXByYWN0aWNlcy1pbi1jb2NvbnV0LXN1cHBseS1jaGFpbtIBAA?oc=5\" target=\"_blank\">How the Sustainable Coconut Partnership addresses unsustainable practices in coconut supply chain<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","source.href":"https:\/\/www.foodnavigator.com","source.title":"FoodNavigator.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Coconuts grow in tropical climates, with more than 70% of global coconut oil production coming out of the Philippines and Indonesia. But unlike other foods grown in the tropics such as palm oil, coffee and cocoa, coconut trees are not associated with the same level of deforestation. That is not to say that coconut production is free from unsustainable practices. Coconut plantations have been linked to biodiversity loss, and according to Gregory Bardies, executive director of the Sustainable Coconut Partnership, farmers are ‘trapped in a vicious cycle of poverty’. The recently launched Partnership is on a mission to wipe out unsustainable practices in coconut production by establishing best practices, impact programmes, and harmonising industry requirements for supply chain partners. An industry-led partnership for social and environmental sustainability ​ The Partnership was founded by food and beverage majors ranging from Barry Callebaut to Nestlé, Unilever, Ferrero, AAK and Upfield. Affiliate members include NGOs Earthworm Foundation, Kaleka and Proforest, as well as traceability tech company Satelligence. Coconut is a versatile fruit, with food and beverage brands using its water, milk, oil and flesh in products ranging from chocolate​ to coconut water. More than 60m metric tons of coconut are estimated to be produced every year, much of which is for coconut oil. Although the Partnership officially launched this year, the initiative was first discussed back in 2019 while Bardies was working in sustainability at Barry Callebaut. Beginning to investigate sustainable practices in coconut production, Bardies noted there was ‘very little’ public information about other companies’ methods. “There was also very little sustainable certified product,” ​he told FoodNavigator. Conducting due diligence exercises revealed signs of an ‘impending crisis’ in coconut supply chains, particularly in social sustainability. Most coconut farmers are smallholders, and at an advanced age. The next generation wants to move off the farm for a perceived easier life, explained Bardies. “Because farmers are not rejuvenating their farms, they’re trapped in a vicious cycle of poverty. They’re amongst the poorest farmers, especially in Asia.”​ Most of the world's coconut oil from from the Philippines and Indonesia. GettyImages\/Everyday better to do everything you love And its not just about social sustainability. Potential environmental sustainability risks also exist, with research​ suggesting coconut production poses a threat to biodiversity, particularly to vertebrates, arthropods, molluscs, and plants. “Potential environmental risks are much, much less than for some of the other supply chains like palm oil. But nevertheless, they are things to consider and monitor.​ “It’s absolutely worthwhile and valuable for the sustainability of the industry and the wellbeing of millions of people in the environment to advance on sustainability. That’s how it started.”​ The Sustainable Coconut Partnership became a formal entity in 2021, with the platform officially launching earlier this year. Deforestation: Why is there less in coconut than palm oil?​ So why, if produced in a similar tropical climate to other foods linked to deforestation such as palm oil, cocoa and coffee, is associated deforestation significantly less for coconuts? One reason coconut production is considered more sustainable lies in its farming structure, whereby the vast majority (up to 98%) is smallholder driven. Smallholder coconut farmers own between two and four hectares of land, meaning their approach to farming is less intensive and industrialised compared to some other supply chains, Bardies told this publication. Another reason more directly linked to deforestation is that coconut trees are considered more productive over an extended period, suggested the executive director. Oil palms are productive for around 25 years, whereas coconut trees can be productive for more than 60 years, we were told. “In palm oil…there is a constant need for more, more, more. In coconut, there is much less of this.”​ That is not to say that demand for coconut is not growing, it is. Production is ‘barely keeping pace’, stressed Bardies. And not just for the food industry: coconut is used to produce soap, laundry detergent and cosmetics, as well as biodiesel. Coconut by-products – notably the husk – can also be used in other projects, for example to product charcoal or construction materials. A vasty majority (98%) of coconut farming is driven by smallholders. GettyImages\/cherrybeans Bardies does not see greater biodiversity risk in coconut cultivation compared to other crops, and actually sees opportunity for more​ sustainable practices given cultivation practices. “In coconut production you can spread out the trees and grow forestry much more easily than in other supply chains…​ “[As to] biodiversity, we cannot say there is zero risk. We are quantifying a number of those risks, but the common understanding is that [unsustainable nature of coconut production is mostly linked to] farmer poverty and social issues.”​ Partnership upgrades charter with assurance scheme​ In improving the sustainability of coconut production, the Partnership has set out three main impact areas: increasing smallholder farmers’ income; enhancing supply chain traceability; and preventing deforestation & climate change. In 2020, the Partnership received more than 100 inputs from various stakeholders engaged directly or indirectly in coconut supply chains to develop an industry-wide Sustainable Coconut Charter. The ambition was to set a global benchmark for sustainable coconut origins. The first charter set out principles and ambitions for sustainability programmes, explained Bardies. “It was a guidance for sustainability programmes. We were seeing that a number of sustainability programmes in coconut were targeting a little bit of traceability, maybe a little bit of environment, but not comprehensively addressing all the pain points and issues in the supply chain.” ​While the first charter sought to change that, it offered guidance only. Upon realising there remained ‘holes in the racket’, the charter has been revised to be ‘much more comprehensive’. Unveiled this year, the charter now includes an assurance scheme. “We are also looking at creating market transformation, which the first charter didn’t allow,” ​explained Bardies. Looking to supply chains, for example, the charter not only offers guidance for companies to act on the ground, but also for ways to act as a ‘responsible company’ to create enabling conditions for change. Through these new principles and ambitions – covering guidance, chain of custody, traceability, reporting, and implementation – the Partnership aims to build out a new assurance system, which Bardies described as a ‘stepwise approach to existing certification schemes that aren’t showing any signs of picking up in the market’. The decision came from consultations with stakeholders: 75% of those offering input consider it crucial the charter have a new, coconut specific assurance system. The Partnership’s assurance system is designed to be more ‘inclusive’ than others on the market, which include certification, to encourage as many industry players to join as possible. The assurance system is designed to publicly recognise Members’ progress in sustainability. As to whether the assurance system could also lead to eco-labelling opportunities to help better promote companies’ work in sustainability, the jury is still out. When coconut often makes up less than 5% of a finished food product, it will have to be decided whether communicating that it was responsibly sourced, on-pack, is worthwhile.","filter_flag":1}
{"title":"CSRWire - 5 Examples of Sustainable Packaging Solutions for the Industry That Contribute to the Circular Economy - CSRwire.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4ODA3MS01LWV4YW1wbGVzLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1zb2x1dGlvbnMtaW5kdXN0cnktY29udHJpYnV0ZS1jaXJjdWxhctIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4ODA3MS01LWV4YW1wbGVzLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1zb2x1dGlvbnMtaW5kdXN0cnktY29udHJpYnV0ZS1jaXJjdWxhctIBAA?oc=5","id":"CBMidWh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4ODA3MS01LWV4YW1wbGVzLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1zb2x1dGlvbnMtaW5kdXN0cnktY29udHJpYnV0ZS1jaXJjdWxhctIBAA","guidislink":false,"published":"Thu, 09 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=9, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=313, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4ODA3MS01LWV4YW1wbGVzLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1zb2x1dGlvbnMtaW5kdXN0cnktY29udHJpYnV0ZS1jaXJjdWxhctIBAA?oc=5\" target=\"_blank\">CSRWire - 5 Examples of Sustainable Packaging Solutions for the Industry That Contribute to the Circular Economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CSRwire.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CSRWire - 5 Examples of Sustainable Packaging Solutions for the Industry That Contribute to the Circular Economy - CSRwire.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4ODA3MS01LWV4YW1wbGVzLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1zb2x1dGlvbnMtaW5kdXN0cnktY29udHJpYnV0ZS1jaXJjdWxhctIBAA?oc=5\" target=\"_blank\">CSRWire - 5 Examples of Sustainable Packaging Solutions for the Industry That Contribute to the Circular Economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CSRwire.com<\/font>","source.href":"https:\/\/www.csrwire.com","source.title":"CSRwire.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Published 11-09-23 Submitted by Henkel In this story, you'll learn: Produce, use, reuse – by 2025, we want to design and develop 100 percent of Henkel's packaging so that it can be reused or recycled as completely as possible.1 This is because we want to continuously contribute to ensuring that all packaging waste is properly disposed of and recycled, and thus does not end up in the environment. To this end, our experts are working on optimizing secondary and transport packaging and the associated logistics. We want to replace the linear economic model of \"produce, use, dispose\" and keep materials in the material cycle for longer. ₁ With the exception of products where components or residues may affect recyclability or contaminate recycling streams. We are convinced that we need strong partnerships to drive sustainable development. It's not just about making our business more sustainable, but helping our customers and stakeholders comply with regulatory requirements and achieve their own sustainability goals. That's why we work with customers and suppliers in strategic partnerships along the entire value chain to jointly design and develop efficient sustainable solutions. Pernille Lind Olsen, CSVP Packaging & Consumer Goods at Henkel For a sustainable economy, the recyclability of packaging is an important lever for making resources reusable several times over and transferring them to new products. After all, eliminating packaging completely is not a solution either – it protects the quality and performance of our products and enables safe use and disposal. In line with the 12th Sustainability Development Goal (SDG), which calls for sustainable consumption and production patterns, our experts at Henkel are rethinking packaging concepts along the circular value chain – for Henkel and for the industry. Our packaging expertise reaches back to 1922 when we first started producing paper, cardboard and packaging adhesives for our own use. What started small, has since developed into a global success story, shaping industries and consumers’ lives through the decades. Today we are applying our know-how to enable intelligent packaging design for the circular economy and to reduce both packaging material and waste with the help of sustainable solutions. Here we show how Henkel Adhesive Technologies creates sustainable industrial solutions and thus contributes to the circular economy, using five examples. 1. Debonding for recycling processes appropriate to the material Establishing sustainable practices is important at home and in industry – and can start with proper waste separation. Products and packaging can only be recycled in a material-friendly way if we separate the individual materials from one another – at home, for example, this means separating the aluminum lid from the plastic yogurt pot before throwing both into the recycling can. But separating different materials is not always quite as simple as with the yogurt pot. Multilayer flexible packaging in particular presents a challenge. This is where the so-called debonding process helps in waste processing. Debonding makes it possible to separate different materials that are not suitable for joint recycling and thus provides the basis for reusing and recycling product parts. Together with the start-up Saperatec, our experts at Henkel Adhesive Technologies have developed the Loctite Liofol solution specifically for recycling to enable debonding at the end of the value chain. In combination with the Saperatec process, this solution allows multilayer packaging to be separated from one another again, so that after separation the individual materials made of PE, aluminum and PET can be sorted and returned to the value chain as recyclable materials. EPIX technology gives shipping bags increased functionality by using lightweight cushioning material instead of bubble wrap to create an impact-resistant package without increasing the weight of the product. 2. More paper, less plastic – with EPIX and KeelClipTM Plastic packaging is often preferred to paper packaging because it is more robust against environmental influences and thus better protects sensitive products. Our experts at Henkel Adhesive Technologies have made it their business to design adhesive solutions that replace plastic and promote sustainable packaging alternatives – such as EPIX and KeelClipTM. From shipping bags to paper straws to food packaging, EPIX technology makes paper a true alternative to plastic for popular disposable materials. EPIX extends the functionality of paper by adding features to paper products such as barrier properties, thermal insulation, and resistance to mechanical impact. For example, paper packaging with EPIX is better protected against water and grease penetration. The improved thermal insulation properties also make the technology highly suitable in the production of takeaway beverage cups: Double-walled cups offer higher temperature resistance for both hot and cold beverages thanks to EPIX. Best of all, paper packaging with EPIX can still be recycled. KeelClipTM, a solution developed by Graphic Packaging International (GPI) using adhesive technologies from Henkel Adhesive Technologies, also proves that it doesn't always have to be plastic. KeelClipTM represents a sustainable option for the outer packaging of beverage cans. The technology not only reduces plastic, but also saves CO 2 emissions in the life cycle of the packaging. Unlike plastic films or plastic rings that otherwise hold beverage cans together, with KeelClip this task is performed by recycled and recyclable cardboard – supported by our adhesive solutions. KeelClipTM can replace plastic film and plastic rings in the multi-packaging of beverage cans, increasing the recyclability of the packaging and reducing plastic waste. 3. Bio-based adhesives for more environmentally friendly food packaging Functional, safe and sustainable – that's how we want packaging in the food industry to be. The Technomelt Supra Eco hotmelt adhesive developed by our adhesives experts not only meets the strict packaging guidelines for food, but also has a significantly reduced carbon footprint. The adhesive solutions in the range are made from up to 98% biomass and can be used for a wide range of packaging. The carbon footprint of the Technomelt Supra Eco range and its raw material sourcing are also fully traceable. This helps not only us, but also our customers to keep track of their CO 2 emissions, so that together we can drive a sustainable industry. And without compromising on the performance of the adhesive product. A win-win solution for the packaging industry and sustainability. 4. Gluing instead of wrapping In logistics, it is common for goods to be stacked in large paper cartons on wooden pallets to be prepared for transport and storage. To ensure that the goods can be transported safely within the supply chain, the cartons are often wrapped with a plastic film. This prevents the goods from falling off the pallet during transport or storage. Our adhesives experts have found a solution to reduce this film consumption in palletizing by up to 90%. The Technomelt Supra PS Hotmelts adhesive solution from Henkel Adhesive Technologies can be used to secure cartons to each other and to the pallet – making safe transport and storage no problem. Only 0.15 grams per carton is required and the adhesive remains stable even in very hot or cold conditions – ideal for temperature differences in supply chains. This eliminates the need for conventional stretch film, which is usually wrapped around the cartons on the pallet and saves a lot of plastic. Another advantage? Subsequent depalletizing is not only easier, but also takes far less time. In addition to cartons, the adhesive is also suitable for PET bottles, metal cans and many other goods, making it a real gamechanger in the packaging industry. Our adhesive solution Technomelt Supra PS Hotmelts is a sustainable alternative to stretch film and can reduce film consumption in palletizing by 90%. 5. Achieving goals together – with the cyclos-htp institute Together with our strategic partners, we achieve our sustainability ambitions much faster. One example is our partnership with the cyclos-htp Institute (CHI). The partnership enables us to link two critical components of the packaging and consumer goods value chain: Adhesives and coatings, and recycling expertise. CHI specializes in testing, evaluating and certifying packaging for recyclability. CHI's certification process determines the recyclability of packaging based on the amount of recovered recycled material (paper fiber) available to produce the starting material (new paper). Building on the generally accepted CHI test methods, it acts as a neutral testing and certification body and, through its partnership with Henkel, can offer its services to a broader customer base. CHI's rigorous evaluation and certification thereby supports the performance and sustainability of product concepts. With the institute's expertise and advice, we can further improve our packaging and adhesive solutions, integrate the recyclability of our products and solutions earlier in the design process, and strengthen sustainability in the industry together with our customers.","filter_flag":1}
{"title":"The Power of Provenance - ARCHITECT Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LmFyY2hpdGVjdG1hZ2F6aW5lLmNvbS9wcmFjdGljZS90aGUtcG93ZXItb2YtcHJvdmVuYW5jZV9v0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LmFyY2hpdGVjdG1hZ2F6aW5lLmNvbS9wcmFjdGljZS90aGUtcG93ZXItb2YtcHJvdmVuYW5jZV9v0gEA?oc=5","id":"CBMiRGh0dHBzOi8vd3d3LmFyY2hpdGVjdG1hZ2F6aW5lLmNvbS9wcmFjdGljZS90aGUtcG93ZXItb2YtcHJvdmVuYW5jZV9v0gEA","guidislink":false,"published":"Mon, 20 Nov 2023 13:46:55 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=20, tm_hour=13, tm_min=46, tm_sec=55, tm_wday=0, tm_yday=324, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LmFyY2hpdGVjdG1hZ2F6aW5lLmNvbS9wcmFjdGljZS90aGUtcG93ZXItb2YtcHJvdmVuYW5jZV9v0gEA?oc=5\" target=\"_blank\">The Power of Provenance<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ARCHITECT Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Power of Provenance - ARCHITECT Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LmFyY2hpdGVjdG1hZ2F6aW5lLmNvbS9wcmFjdGljZS90aGUtcG93ZXItb2YtcHJvdmVuYW5jZV9v0gEA?oc=5\" target=\"_blank\">The Power of Provenance<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ARCHITECT Magazine<\/font>","source.href":"https:\/\/www.architectmagazine.com","source.title":"ARCHITECT Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Iwan Baan, Courtesy MASS Design Group Architects and builders find themselves at the forefront of a transformative moment–where provenance which delves into the origins and narratives encapsulated within the materials and products deployed in construction, presents itself with a profound opportunity to weave ethical, sustainable, and deeply meaningful choices into the very fabric of our built environment. Traditionally applied to art ownership, the concept of provenance also uniquely resonates within the realms of architecture and construction. Christel Force, associate research curator at the Metropolitan Museum of Art, beautifully articulates the essence of provenance as the collective biography of lives of objects and their owners, wrapped into one. “Objects have a life from the time they are created,” she says. “With provenance tracing their biography.” Provenance challenges architects to not only envision the finished product but to also consider the origins and narratives entwined within the material selection process. The repercussions of overlooking provenance in architecture reverberate in the contemporary landscape. This places a responsibility on the architect to avoid the use of materials and processes whose provenance encodes violence and degradation in our built environment. It emphasizes the importance of material choices and labor practices that will yield beautiful architecture while simultaneously catalyzing positive transformation for people and planet. Ethical Sourcing and Labor Rights: A Moral Imperative At the heart of this architectural evolution lies a crucial mandate—to ensure that the materials used are untainted by forced labor. The Design For Freedom initiative, spearheaded by Sharon Prince and Grace Farms, and of which MASS Design Group is a working group member, underscores this critical dimension. Designers, manufacturers, and builders must be acutely aware of the human cost embedded in building materials, recognizing that without a conscientious approach, they risk perpetuating a legacy of abuse within the very materiality of their constructions. James Kitchin, our Performance & Provenance Director, aptly notes that \"Simpler products have simpler stories.\" To untangle the complexity of modern building components, we must demand greater transparency in product sourcing, including detailed ingredient lists and material origins. Initiatives leveraging blockchain and synthetic DNA could emerge as powerful tools supporting traceability and empowering stakeholders to unravel the intricate journey of each construction element. Social and Environmental Impacts: A Holistic Perspective Adobe Stock\/Tupangato Inextricably linked to the discussion of provenance are the social and environmental impacts of architectural decisions. Carrara marble, a globally recognized example, serves as a cautionary tale. Although it has been quarried since Roman times and cherished by the likes of Michelangelo, the region of Carrara is today one of Italy's poorest areas. The marble quarries, controlled by a handful of family businesses, witnessed a precipitous increase in extraction, and the toll of this is apparent in the local erosion of mountains, pollution of rivers, frequent destructive flooding, and decline in biodiversity. Additionally, while the region was once the site of not just extraction, but immense craftsmanship in transforming the marble, most of those skilled roles have been globalized, further commodifying the material and diminishing the economic value that was once retained in the region. Once a symbol of artistic elegance, the region's exploitation for marble extraction has left scars—environmental degradation, economic decline, and a loss of local craftsmanship. A holistic view of marble sourcing makes evident that with our material choices, architects must evaluate each decision as an opportunity for a restorative and regenerative future. While reducing the carbon footprint through low embodied carbon materials is undeniably crucial, it is only a fraction of the broader ethical imperative we face. Championing Craftsmanship: A Cultural Shift Iwan Baan, Courtesy MASS Design Group Craftsmanship, often overshadowed when we only look at the variables of cost and performance, emerges as a beacon in the provenance narrative. Understanding the origins, energy invested, and the human touch throughout the material's lifecycle catalyzes a cultural shift. More than harm reduction, but a cultural shift in celebrating the stories within materials and products, and acknowledging human ingenuity. To transcend moral imperatives, we must celebrate provenance. By narrating the stories embedded within the materials and products we employ and by championing their craftsmanship, cultural significance, and ecological stewardship, we can define a new architectural value proposition. In MASS's inaugural project, the Butaro Hospital in northern Rwanda, the abundant but typically overlooked scoria volcanic stone became a testament to the power of provenance and craftsmanship. It was a material ubiquitous in the region but undervalued, and piled on the sides of the road where it was a nuisance and impediment to farming. During the process of adapting it for use as a facade, we met Anne Marie Nyiranshimiyimana, a trailblazing woman in the male-dominated construction industry. Her mastery of working with the stone in this way led her to form a cooperative that has since replicated and refined this approach in various projects across the country, where she now trains and mentors other women and men masons. Through her expertise, she is responsible for training and inspiring the next generation of masons and is improving the local material and construction supply chain in her county. Here we see the use of local materials providing an opportunity to unlock potential to provide both a unique sense of place and inspire great value due to the craft of their assemblage. Towards a Provenance-Driven Future: Crafting Spaces with Purpose Iwan Baan, Courtesy MASS Design Group Provenance invites us to engage with our surroundings, honor local cultures while creating new livelihoods, and champion sustainable practices. It empowers us to design spaces that transcend superficial aesthetics, embody ethics, and foster planetary restoration. Good provenance has expansive meaning and across disciplines it includes responsible material extraction that respects planetary boundaries, leverages the use of native species to promote biodiversity in our landscapes, and maximizes the potential of adaptive reuse for our existing buildings. In MASS’s largest project to date, the Rwanda Institute for Conservation Agriculture , sourced regenerative materials locally meant 90 percent of the budget was spent within 500 miles of the site. Building with earth, stone, timber, terra cotta fired with agricultural waste, and a variety of fibers minimized embodied carbon, while working with over 85 different cooperatives and artisans allowed most of the building materials and furniture to be built with the same principles of provenance. Chris Schwagga, Courtesy of MASS Design Group Centering provenance is a paradigm shift. By caring deeply about the origins of our materials and products, we can create spaces that resonate with the values of our time. Provenance reminds us that architecture encompasses more than structures; it encapsulates stories, cultures, and the legacy we bequeath to future generations. Demanding good provenance is a manifestation of the commitment to a just, beautiful, and sustainable future. The views and conclusions from this author are not necessarily those of ARCHITECT magazine or of The American Institute of Architects. Read more:The latest from MASS Design Group includes Learning from Poughkeepsie.","filter_flag":1}
{"title":"Avocado grower branches out to produce premium avocado oil - FreshPlaza.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LmZyZXNocGxhemEuY29tL2xhdGluLWFtZXJpY2EvYXJ0aWNsZS85NTc0OTk0L2F2b2NhZG8tZ3Jvd2VyLWJyYW5jaGVzLW91dC10by1wcm9kdWNlLXByZW1pdW0tYXZvY2Fkby1vaWwv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LmZyZXNocGxhemEuY29tL2xhdGluLWFtZXJpY2EvYXJ0aWNsZS85NTc0OTk0L2F2b2NhZG8tZ3Jvd2VyLWJyYW5jaGVzLW91dC10by1wcm9kdWNlLXByZW1pdW0tYXZvY2Fkby1vaWwv0gEA?oc=5","id":"CBMidGh0dHBzOi8vd3d3LmZyZXNocGxhemEuY29tL2xhdGluLWFtZXJpY2EvYXJ0aWNsZS85NTc0OTk0L2F2b2NhZG8tZ3Jvd2VyLWJyYW5jaGVzLW91dC10by1wcm9kdWNlLXByZW1pdW0tYXZvY2Fkby1vaWwv0gEA","guidislink":false,"published":"Tue, 07 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=311, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LmZyZXNocGxhemEuY29tL2xhdGluLWFtZXJpY2EvYXJ0aWNsZS85NTc0OTk0L2F2b2NhZG8tZ3Jvd2VyLWJyYW5jaGVzLW91dC10by1wcm9kdWNlLXByZW1pdW0tYXZvY2Fkby1vaWwv0gEA?oc=5\" target=\"_blank\">Avocado grower branches out to produce premium avocado oil<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FreshPlaza.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Avocado grower branches out to produce premium avocado oil - FreshPlaza.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LmZyZXNocGxhemEuY29tL2xhdGluLWFtZXJpY2EvYXJ0aWNsZS85NTc0OTk0L2F2b2NhZG8tZ3Jvd2VyLWJyYW5jaGVzLW91dC10by1wcm9kdWNlLXByZW1pdW0tYXZvY2Fkby1vaWwv0gEA?oc=5\" target=\"_blank\">Avocado grower branches out to produce premium avocado oil<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FreshPlaza.com<\/font>","source.href":"https:\/\/www.freshplaza.com","source.title":"FreshPlaza.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Queensland avocado grower Cherry Creek Estate currently grows over 300 hectares of avocados, this year after a robust R&D process they started producing avocado oil. “Our harvest season is May to November in Queensland and we are currently exporting to all of the major Asian markets with the hope to expand on export in the coming 12 months as we look for partners with a shared vision. Partners that only wish to trade in premium grade fruit as our seconds are utilised for oil in the business model,” explains Angelo Leonardi Director and founder of Cherry Creek Estate. “The domestic market is in oversupply and will be for years to come as is frequently the case in the fresh produce category in Australia, positive growing conditions and high margins tend to bring in investment creating oversupply. We feel this is an opportunity for us to work on innovation and our quality in order to consistently achieve the best outcomes. By choosing to innovate our way through this period we are looking to become leaders in our own niche’ categories. Supporting our retailers through innovating new products allows us to de-risk the wider group and maintain strong relationships with our major stakeholders as new products made with renewables in a sustainable process are what consumers are increasingly expecting on shelves.” Angelo hopes to expand the orchards and plant the first hectares of a special variety that will only be used for avocado oil. Although their own production is seasonal, Australia has year-round supply and so too does Cherry Creek’s value add supply chain. Representing a new development for industry where products can get shelf space and reliably maintain supply. “Our oil is cold pressed through centrifuge and only utilises the mesocarp of the fruit. Our yields are varying region to region as we learn the national crops oil production nuances’ our nutrient grade and density combined with sensory board results is something to rival the most delicate oils in the premium market. We aim to offer a premium range of edible oils that must achieve high smoke points. Only through a cold pressed process is both the sensory and versatility achieved together in the processing of Avocado oil. Good virgin grade avocado oil must emit a grassy\/mushroom taste much similar to the avocado itself and with emerald green colouring in the oil body.” Avocado oil production was tried in Australia not long after the turn of the century however with a lack of volume to support a commercial scale production it has taken over 20yrs for Australia to grow the orchards needed to sustain year-round supply. “At this stage we are the only producer at scale however with two more close behind we won’t be the only entrant to the category. With a global shortage in edible oil and the capacity for the oil to remove the lower grade fruit from the market it is a perfect hedge not just for us but all major growing regions in Australia. In 2024 we are aiming to ramp up to 500k\/L per annum. We have achieved a better than expected penetration to domestic supply chains. Access to markets in Australia can be very difficult for local products due to a limited competitive landscape in the grocery sector. Our market being small presents an extra barrier that can make an ROI that much harder as starting slowly in a small market with limited access is a profound risk to any potential processor. We are supporting a slow and steady development of the local market but our main focus is the export for our premium oils. Export presents with existing market demand being unmet and creating opportunity as the consumer is very mature in awareness of healthy eating habits, naturally giving Avocado oil an edge’. “We have created a biomass energy system that allows the cost of production to remain competitive and utilise fruit that otherwise would not have made it to markets. Fruit that is more cost effective to be sent to the oil plant rather that exacerbate the oversupply by adding lower quality fruits to the markets. We are aiming to prove our model of premium grade fruit only, supporting our retail partners with campaigns that define a brand built on sustainable practices and most importantly guarantees of the highest quality products as it is financially more viable for us to operate this way rather than the traditional method of dumping all fruit on the market together.” ‘Cherry Creek Estate is looking to further push the boundaries of innovation through a range of Avocado oil infusions that will come to market in early 2024 and challenge the creativity of chefs with an oil capable of maintain versatility at high temperatures and infusing rich flavours at the same time’. Exciting times are still ahead for Australian Avocados’ For more information: Angelo Leonardi [email protected]","filter_flag":1}
{"title":"Kyndryl Bridge: Revolutionizing IT Management with AI, Cost Savings, Multi-Cloud Agility, and Sustainable Practices - CXOToday.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL2N4b3RvZGF5LmNvbS9pbnRlcnZpZXdzL2t5bmRyeWwtYnJpZGdlLXJldm9sdXRpb25pemluZy1pdC1tYW5hZ2VtZW50LXdpdGgtYWktY29zdC1zYXZpbmdzLW11bHRpLWNsb3VkLWFnaWxpdHktYW5kLXN1c3RhaW5hYmxlLXByYWN0aWNlcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL2N4b3RvZGF5LmNvbS9pbnRlcnZpZXdzL2t5bmRyeWwtYnJpZGdlLXJldm9sdXRpb25pemluZy1pdC1tYW5hZ2VtZW50LXdpdGgtYWktY29zdC1zYXZpbmdzLW11bHRpLWNsb3VkLWFnaWxpdHktYW5kLXN1c3RhaW5hYmxlLXByYWN0aWNlcy_SAQA?oc=5","id":"CBMikAFodHRwczovL2N4b3RvZGF5LmNvbS9pbnRlcnZpZXdzL2t5bmRyeWwtYnJpZGdlLXJldm9sdXRpb25pemluZy1pdC1tYW5hZ2VtZW50LXdpdGgtYWktY29zdC1zYXZpbmdzLW11bHRpLWNsb3VkLWFnaWxpdHktYW5kLXN1c3RhaW5hYmxlLXByYWN0aWNlcy_SAQA","guidislink":false,"published":"Fri, 10 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=314, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL2N4b3RvZGF5LmNvbS9pbnRlcnZpZXdzL2t5bmRyeWwtYnJpZGdlLXJldm9sdXRpb25pemluZy1pdC1tYW5hZ2VtZW50LXdpdGgtYWktY29zdC1zYXZpbmdzLW11bHRpLWNsb3VkLWFnaWxpdHktYW5kLXN1c3RhaW5hYmxlLXByYWN0aWNlcy_SAQA?oc=5\" target=\"_blank\">Kyndryl Bridge: Revolutionizing IT Management with AI, Cost Savings, Multi-Cloud Agility, and Sustainable Practices<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CXOToday.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Kyndryl Bridge: Revolutionizing IT Management with AI, Cost Savings, Multi-Cloud Agility, and Sustainable Practices - CXOToday.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL2N4b3RvZGF5LmNvbS9pbnRlcnZpZXdzL2t5bmRyeWwtYnJpZGdlLXJldm9sdXRpb25pemluZy1pdC1tYW5hZ2VtZW50LXdpdGgtYWktY29zdC1zYXZpbmdzLW11bHRpLWNsb3VkLWFnaWxpdHktYW5kLXN1c3RhaW5hYmxlLXByYWN0aWNlcy_SAQA?oc=5\" target=\"_blank\">Kyndryl Bridge: Revolutionizing IT Management with AI, Cost Savings, Multi-Cloud Agility, and Sustainable Practices<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CXOToday.com<\/font>","source.href":"https:\/\/cxotoday.com","source.title":"CXOToday.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"CXOToday has engaged in an exclusive interview with Arvind S Shetty, Kyndryl Leader – Global Development, CTO Org. How does Kyndryl Bridge utilize AI and operational data to provide real-time insights for managing complex IT estates? Kyndryl Bridge is an open-integration services platform that seamlessly integrates artificial intelligence (AI), operational data, and our extensive expertise to derive real-time insights. It encompasses a single marketplace, an operational management console, and an AI and ML analytics engine. As a global leader in infrastructure services, Kyndryl incorporates AI and machine learning at scale into critical systems and ensure its delivery across IT estates through extensive partnerships with our technology alliance partners. Could you elaborate on how Kyndryl Bridge has contributed to significant cost savings for early adopters? More than 500 global enterprise customers have leveraged this platform, with projections indicating over 1,000 customers by the fiscal year’s end. Kyndryl Bridge has enabled early adopters to realize substantial cost savings, avoiding over $1 billion in annual costs. This achievement is attributed to its advanced application of AI and machine learning at scale for incident prevention. The platform utilizes cutting-edge algorithms and methodologies to proactively identify and address potential incidents before they escalate leading to an annualized cost avoidance of $670 million, and an additional $370 million as a result of reduction in maintenance windows. The results not only underscores the platform’s effectiveness but also emphasizes its pivotal role in reshaping the management of complex technology estates. Can you explain how Kyndryl Bridge addresses the challenge of multi-cloud management in today’s dynamic business landscape? Kyndryl Bridge provides a centralized hub for overseeing both on-premises and cloud-based resources, offering businesses comprehensive control over their technology operations. By leveraging automation it streamlines the process of application development and deployment, enabling businesses to respond promptly to market changes. Through advanced AI and machine learning, the platform optimizes resource usage, enhancing operational efficiency and tailoring resource consumption to meet specific user needs. Kyndryl Bridge employs FinOps practices to help organizations effectively manage and allocate their cloud expenses, ensuring resources are used judiciously and within budget. The platform seamlessly integrates with various public cloud services, allowing businesses to leverage different cloud environments while maintaining centralized oversight. Additionally, Kyndryl Bridge places a strong emphasis on data security and compliance, implementing robust measures to protect sensitive information and ensure compliance with industry regulations. This ensures that businesses can confidently operate in multi-cloud environments while adhering to the highest standards of security and regulatory requirements. How has Kyndryl Bridge been received by global enterprise customers, and what are the key advantages they have experienced in adopting this open integration platform? Kyndryl Bridge has got a strong, positive response from global enterprise customers with over 500 companies operationalized on this innovative platform. It acts as a catalyst for digital transformations, enabling customers to leverage AI-driven services that unlock new opportunities, manage and model data, and deliver industry-specific outcomes such as smart industry 4.0 manufacturing practices and reducing production quality risks. The platform introduces new services that optimize an organization’s security investments. This involves integrating data to prevent cyber threats, managing security incident workflows, and adhering to local and global data compliance requirements. In what ways does Kyndryl Bridge support companies in adapting to market changes and working towards achieving net-zero goals, and can you provide any notable success stories in this regard? Kyndryl Bridge integrates with other platforms to provide customers with complete visibility into their technology estate, enabling them to make faster decisions and identify and address potential problems before they cause disruptions. This enables enterprises to adapt to market changes faster, improve operational efficiency and reduce costs. By automating tasks, streamlining processes, and optimizing resource utilization, companies can free up resources to be focused on more strategic initiatives, such as developing new products and services or expanding into new markets. Kyndryl Bridge extends its value by introducing services like the AI-powered Sustainability Intelligence and Carbon Footprint Assessment Calculator. These tools provide real-time energy consumption and emission data, enabling customers to measure and improve their energy efficiency, a crucial step toward achieving net-zero emissions goals. Bridge doesn’t just manage existing services but also facilitates the deployment of new offerings from partners like AWS, SAP, and Red Hat. This agility in adopting and integrating new technologies helps companies stay at the forefront of industry developments and derive immediate value.","filter_flag":1}
{"title":"Why biophilic design is more than just a trend - Architecture and Design","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvZmVhdHVyZXMvZmVhdHVyZXMtYXJ0aWNsZXMvd2h5LWJpb3BoaWxpYy1kZXNpZ24taXMtbW9yZS10aGFuLWp1c3QtYS10cmVuZNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvZmVhdHVyZXMvZmVhdHVyZXMtYXJ0aWNsZXMvd2h5LWJpb3BoaWxpYy1kZXNpZ24taXMtbW9yZS10aGFuLWp1c3QtYS10cmVuZNIBAA?oc=5","id":"CBMicmh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvZmVhdHVyZXMvZmVhdHVyZXMtYXJ0aWNsZXMvd2h5LWJpb3BoaWxpYy1kZXNpZ24taXMtbW9yZS10aGFuLWp1c3QtYS10cmVuZNIBAA","guidislink":false,"published":"Thu, 30 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=30, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=334, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvZmVhdHVyZXMvZmVhdHVyZXMtYXJ0aWNsZXMvd2h5LWJpb3BoaWxpYy1kZXNpZ24taXMtbW9yZS10aGFuLWp1c3QtYS10cmVuZNIBAA?oc=5\" target=\"_blank\">Why biophilic design is more than just a trend<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Architecture and Design<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why biophilic design is more than just a trend - Architecture and Design","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvZmVhdHVyZXMvZmVhdHVyZXMtYXJ0aWNsZXMvd2h5LWJpb3BoaWxpYy1kZXNpZ24taXMtbW9yZS10aGFuLWp1c3QtYS10cmVuZNIBAA?oc=5\" target=\"_blank\">Why biophilic design is more than just a trend<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Architecture and Design<\/font>","source.href":"https:\/\/www.architectureanddesign.com.au","source.title":"Architecture and Design","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Biophilic design aims to enhance our innate biological connection with nature by bringing natural elements into the built environment. This can be achieved by selecting natural materials such as wood and stone, using organic and biomorphic shapes and forms, incorporating plants, adding earthy textures and colours, and maximising natural lighting and ventilation. It can also take the form of indoor spaces being designed so they are connected to the outdoors and nature. Biophilic design is an ever-evolving concept that can extend beyond aesthetics and material choice to sustainable practices, energy-efficient technologies, and sustainable materials. Ultimately, a built environment that offers a connection to the earth and nature has been shown time and time again to have a positive impact on wellbeing. A La Natural Sustainable thermowood specialists Thermory see incorporating natural materials like thermally modified wood as one of the easiest ways to put biophilic design principles into practice. Thermory’s Content Marketing Specialist, Kerttu Raie, says humans evolved in the natural environment, not a human-engineered one, which is why we have an understandable inclination towards nature. “To counterbalance, we have started using biophilic design principles in urban planning, architecture and interior design as a means to restore our connection with the natural environment,” she says. Thermory uses thermal modification as a way of naturally enhancing wood. The chemical-free heat treatment makes the wood extremely durable and stable for both indoor and outdoor use, giving it a beautifully deep shade and bringing out its natural beauty. Unlike chemical impregnation, Thermory’s thermal modification enhances the wood throughout, not just the outer surface. When used for interior spaces the wood even enhances the acoustic properties of the room. Thermory’s Benchmark ash cladding was chosen for Maidla Nature Resort, a small luxury cabin inspired by wild nature, set in the middle of a forest near a manor house in Estonia. Mari Hunt from b210 Architects designed the cabin in keeping with the natural environment surrounding it. No trees were felled, and the cabin is on stilts due to local floods in springtime. The form of the cladding and the overall look of the building was based on the character of the site. The house is clad with durable thermally modified wooden cladding boards from Thermory, which are perfectly suited for houses exposed to rain, winds and falling leaves and preserve the intended look for a long time. Thermory ash boards were selected as the architect liked its brownish shade, which was emphasised by treating the material with oil. The facade of the building was clad with vertical boards, while the same material was also requested for use horizontally on the terrace. This worked to create the feeling that the house was simply covered with decking. Thermory wood has also been used for the interior, covering the floor of the bedroom and all the ceilings in the house. Using the same material for the ceilings and the facade ties the individual parts of the building together as a united whole, where the architecture and interior architecture are completely entwined. Connecting with Mother Nature Another leading producer of thermowood, Novawood, also recommends thermowood products as a perfect fit for biophilic design. Novawood’s heat treated products originate from sustainably managed forests, emphasising their commitment to ethical sourcing and environmental responsibility. Novathermowood products are sustainable, strong, long lasting, and environmentally friendly. The range includes exterior cladding which helps the building fit in better with its natural surroundings, decking and flooring: The unique colours and patterns achieved through the thermal modification process can mimic the aesthetic of forest floors, creating a grounding and calming effect in the environment. Novathermowood also comes as interior wall cladding, ceiling panels, doors, windows, partitions and screens. The use of heat-treated wood in interior spaces can complement the presence of indoor plants, reinforcing the connection to nature and creating a harmonious environment. Timber manufacturer Big River Group also point to the warmth timber adds to biophilic design and the way it can bring a sense of nature and wellbeing into the built environment. “The materials surrounding us on a daily basis that offer a deeper connection to earth and nature, such as the natural beauty and uniqueness of wood are being embraced by designers,” Sales and Marketing Manager, Panels, at Big River Group Stuart McGonagle says. “According to a recent study, those in environments featuring natural wooden surfaces, reported higher personal mood, clarity, confidence and optimism on average”. He says Big River Group has seen a rise in the use of decorative timbers on walls and ceilings. “There’s a myriad of timbers with different textures and colours available, that can be utilised to improve the ambience of a venue. What’s more, due to its natural insulation timber reduces internal heat gain in summer and loss of warmth in winter and can store and release moisture which helps to regulate humidity and air quality in an indoor environment”. Warrnambool Library \/ Big River Group Seeing the wood and the trees A smart choice for cabinetry and joinery applications that achieves a natural aesthetic is Big River’s ArmourCab, a new generation of engineered Australian decorative wood panelling. Available in Blackbutt, Spotted Gum and Hoop Pine timber finishes, each with its own natural colour and markings, ArmourCab adds harmonious design and plays an important role in marrying the indoor and outdoor spaces. Big River’s decorative plywood known as Armourpanel is another popular choice for biophilic design thanks to its distinctly natural appeal. “In maintaining the natural characteristics of the selected wood species, every Armourpanel sheet offers an individual and natural look, with the species’ unique grain structures being preserved so no two sheets look alike,” McGonagle notes. Also available in a range of native species including Blackbutt, Flooded Gum, Spotted Gum and Sydney Blue Gum, its durability makes it ideal for use in hardwearing areas, including flooring, wall panelling, screening, cabinetry, ceiling linings and joinery. Big River’s wood panels were specified for Warrnambool Library and Learning Centre in regional Victoria. Designed by Kosloff Architecture, the space aims to bring education, community, and the arts to the city in a warm and inviting environment. The interior is punctuated by a dramatic timber staircase, which leads up the three levels through a circular void and has been clad in Big River Group’s premium plywood products ArmourPanel and Armourfloor in Blackbutt. “The warmth of the Big River Blackbutt products with rich tones provides a sense of comfort and connection to nature within the interiors of the project,” Associate Director of Kosloff Architecture Lance Van Maanen says. Scultpform's Australian Ash biophillic design by click-on batten Wood in the workplace High quality timber is recommended for biophillic design by click-on batten, cladding and screens specialists Sculptform. Scultpform says getting the quality right with timber is key for biophilic design as showing off the natural features of timber helps to improve the atmosphere within a space. Scultpform’s battens, screens and tongue and groove cladding can all be made from timber. All can be applied on interiors and exteriors and are perfect to cover walls, and ceilings and create screening within spaces. They offer three species of timber, Australian Ash, Spotted Gum and American Oak, and a range of profiles and coatings to enhance the look of the material. Scultform’s Ash timber click-on battens and tongue and groove cladding feature throughout the multilevel ceilings at The Workshop by Milligan Group, a campus-style business hub in Sydney’s Pyrmont. Designed by Bates Smart, The Workshop showcases a new era of workplace design with 19,000 square metres of office space, seven boutique offices and substantial onsite amenities including retail outlets, childcare, a gym with bike storage and an infrared sauna, a café and a restaurant. A full-height atrium in the centre of the Workshop creates an open, light-filled environment and visual connectivity between floors Biophilic design is also incorporated with gleaming planter halos suspended at differing levels throughout the void, bringing a sensory element to the interior and emphasising the benefits of indoor\/outdoor connections in the design. The design achieved the highest-level Green Star Rating (6 Stars), through its careful choice of building materials. Another way to bring biophilic design to life is by incorporating the architecturally designed timber wall and ceiling panels by SUPAWOOD. These can be produced in natural and concept woodgrains, as well as textured and natural-coloured finishes. The panels can also be customised and shaped to mimic natural elements like leaves. Castle Towers Shopping Centre \/ SUPAWOOD The footage is grainy SUPAWOOD’s custom-shaped and grooved SUPALINE panels, for example, brought a natural feel to levels 2 and 3 of the podium retail spaces at Castle Towers shopping centre in Sydney. The designer, Buchan, engaged SUPAWOOD to create a decorative but complex paved effect on the ceilings. The panels form a crazy paving design on the ceilings over the thoroughfares on each level. The parts of the ceilings nearer the shop fronts are lined with SUPALINE in a neutral matt SUPACOLOUR finish. The areas on the outer edge are slightly raised and in a SUPALINE custom-grooved pattern reminiscent of the veins of leaves. These outer areas are finished in a woodgrain laminate. Raw unfinished backing boards were used as a base under the shaped panels. To frame the inner perimeter, custom curved MAXI BEAM lightweight beams have been applied. These have been tastefully contrasted with the other finishes in a metallic brushed finish. Follow the pattern Flooring specialists GH Commerical design many of their products with biophilia in mind, purposefully incorporating colours, textures and patterns found in the natural environment. Their Lichen 1.5 and Lichen Community collections exemplify biophilic design. “Inspired by the idea of ‘nature’s carpet’, the design team looked at natural assemblages of rich multi-hued, multi-textured lichens from extreme climates as the foundation for the collection, particularly how they grew on rock and bark. GH Commercial used their Pattern Perfect tufting technology to produce textures and forms on the surface of the carpet, which look authentic and capture nature’s impact on our senses and wellbeing. When the team at New Zealand commercial interior design business, Outline, needed to create a learning space that was both beautiful and inspiring for Saint Kentigern Schools, they chose GH Commercial’s Lichen Community collections for the flooring. The brief for the project was to achieve an interior vision based on sustainability and the wellbeing benefits of biophilic design. The light-filled central atrium with its ‘social staircase’ links two floors of classrooms, collaborative learning zones, and a staff room that also serves as a professional development area and function space. Below: Saint Kentigern Schools \/ GH Commercial The Lichen 1.5 Collection of carpet planks presented ideal flooring to meet the brief, with the selection of Micro and Macro Bloom 1.5 in an array of colour offering a distinctive pattern with complementary pops of yellow, purple, blue, aqua, and white. Teamed with neutral Groundcover 1.5 in 949 Rock face, the overall effect was cohesive while also creating wayfinding paths and distinguishing separate learning zones. Biophilia in the interior For interior specialists, Baresque, Wallcoverings play a central role in biophilic design as they can artfully replicate the textures, colours, and patterns found in natural materials like wood, stone, and water. These designs capture the gentle flow of fluid motions through deep texture, intricate patterns, and geometries. Nature plays a central part in the design of the recently refurbished IDES restaurant, a cool and innovative fine dining venue in Melbourne. The food and dishes at IDES take their cues from the local environment and seasons, with the fit out of the original restaurant also echoing this theme. It’s no surprise then that nature played a huge part in influencing the design vision for the new project, with earthly finishes such as wood, stone and linens all featuring. Like all bustling venues, addressing the acoustics of the space was also high on the priority list to ensure an intimate experience for diners. In the private dining room, Baresque’s fabricated acoustic wallcovering Zintra Sticks was selected in Merbau, a colourway inspired by real woodgrain. The covering which features on the walls and ceilings complements the original timber elements and adds a sense of warmth and intimacy. In keeping with the theme of natural finishes, Baresque’s Cork Cobra wallcovering which is inspired by snakeskin was installed on the adjacent walls. This decorative wallcovering features gold highlights which are beautifully accented by the wall lights. Overall, the newly refurbished IDES is a moody, intimate space with elegance and connection to nature expressed in both the aesthetics and gastronomic experience. Designers and manufacturers of facade systems, Fairview, say they have seen an increased focus on incorporating natural elements, materials, and patterns into designs to create spaces that foster wellbeing, productivity, and a sense of harmony with nature. “We have also seen an increase in the integration and usage of nature analogues, certainly specific to woodgrain finishes. Powder on powder technology allows architects and designers a choice of finishes that mimic not only the natural patterns, but also textures of wood,” Head of Marketing at Fairview Kristy Welsh says. She says Fairview see biophilic design as extending much more broadly beyond aesthetics and material choice. “It is an area that is ever evolving as new sustainable practices, energy-efficient technologies and sustainable materials continue to emerge. It is an exciting space to be in, and for Fairview we are committed to contributing to biophilic design and ultimately the circular economy – not only in terms of how our products are manufactured and with what, but also in terms of their lifecycle and end-of-life use. It is a constant learning curve”. Fairview collaborated with builder and installer, Northpoint Residential Projects to complete the exterior facade of 1 Pretoria Parade Hornsby. This project features more than 7,220 of Argeton’s Argelite terracotta tiles in Salmon Pastel and a large range of accessories. Biophilic design becomes sophisticated Argeton’s Argelite panel is a product made of natural clay, preferred for its stylish simplicity and low weight. Argeton is a natural terracotta facade system, available in a wide range of colours, textures, profiles, and glaze options for exquisite and unique designs. With sunscreen and rainscreen properties, frost and moisture resistance, impact, weather, and UV resistance, Argeton is an eco-friendly option that allows for creativity while ensuring resilience to harsh environmental conditions. Australia’s largest supplier of certified engineered bamboo and rattan House of Bamboo see biophilic design as much more than just a trend, but “an essential part of sustainable and emotionally resonant architecture”. “In 2023, biophilic design has become more innovative, sophisticated and integrated into architectural practice. Thankfully it has become an essential element of sustainable architecture, as it not only enhances the quality of life for people but also aligns with the growing focus on environmental stewardship and holistic wellbeing in the design and construction industry,” House of Bamboo’s Marketing Manager Ash Guven says. By incorporating biophilic design with House of Bamboo materials, architects and designers are well positioned to achieve Green Star ratings, particularly in the Indoor Environment Quality and Management categories. For projects targeting LEED certification, their products can contribute to achieving high levels, ranging from Gold to Platinum. Feeling WELL The biophilic materials also play an important role in projects aiming for WELL Building Standard and can secure valuable credits for UK-based BREEAM certification, particularly in categories like Health and Wellbeing, Materials, and Land Use and Ecology. House of Bamboo has a wide selection of products available to suit biophillic designs from stylish and sustainable Cross Laminated Bamboo panels to woven bamboo decking, featuring natural bamboo heat-treated for improved hardness and durability. Made without toxic glues or plastics and pre-oiled with premium Woca oil. Ultimately, biophilic design isn’t just a trend but a timeless way of designing that taps into our innate connection to the natural world. It is about bringing the feel of mother nature into our built environments to create a welcoming and nurturing atmosphere evoking a sense of calmness to those that using the space. Image: Thermory’s Benchmark ash cladding was chosen for Maidla Nature Resort, a small luxury cabin inspired by wild nature, set in the middle of a forest near a manor house in Estonia. Suppliers Thermory Novawood Big River Group Sculptform SUPAWOOD GH COMMERCIAL BARESQUE Fairview House of Bamboo","filter_flag":1}
{"title":"Rohit Dev Sethi | Managing Director | ColossusTex Private Limited - Fibre2fashion.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvY29sb3NzdXN0ZXgtcHJpdmF0ZS1saW1pdGVkL3JvaGl0LWRldi1zZXRoaS8xMzc4Ni0x0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvY29sb3NzdXN0ZXgtcHJpdmF0ZS1saW1pdGVkL3JvaGl0LWRldi1zZXRoaS8xMzc4Ni0x0gEA?oc=5","id":"CBMia2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvY29sb3NzdXN0ZXgtcHJpdmF0ZS1saW1pdGVkL3JvaGl0LWRldi1zZXRoaS8xMzc4Ni0x0gEA","guidislink":false,"published":"Sat, 11 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=11, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=315, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvY29sb3NzdXN0ZXgtcHJpdmF0ZS1saW1pdGVkL3JvaGl0LWRldi1zZXRoaS8xMzc4Ni0x0gEA?oc=5\" target=\"_blank\">Rohit Dev Sethi | Managing Director | ColossusTex Private Limited<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2fashion.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Rohit Dev Sethi | Managing Director | ColossusTex Private Limited - Fibre2fashion.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvY29sb3NzdXN0ZXgtcHJpdmF0ZS1saW1pdGVkL3JvaGl0LWRldi1zZXRoaS8xMzc4Ni0x0gEA?oc=5\" target=\"_blank\">Rohit Dev Sethi | Managing Director | ColossusTex Private Limited<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2fashion.com<\/font>","source.href":"https:\/\/www.fibre2fashion.com","source.title":"Fibre2fashion.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"We aspire to be a game-changer and trendsetter in the textile industry ColossusTex is a trailblazer in the textile supply chain sector, renowned for its sustainable and efficient solutions that propel the industry forward. Boasting over 25 years of expertise and a robust global footprint spanning 7 countries, ColossusTex excels in delivering top-tier sourcing, logistics, and strategic marketing services. In an interview with Fibre2Fashion, Managing Director Rohit Dev Sethi talks about digitalisation and transformation of supply chain in the textile industry. What are the current trends and innovations in textile manufacturing and design that you find most exciting or promising? Some of the most exciting trends and innovations in textile manufacturing and design include sustainable and eco-friendly practices. This involves the use of recycled materials, waterless dyeing techniques, and biodegradable fabrics. Additionally, the integration of smart textiles, which can monitor health or change colour based on environmental factors, is captivating. 3D printing in textiles is also gaining momentum, enabling customised, intricate designs. Moreover, digital design tools and artificial intelligence are streamlining the creative process, while fashion tech innovations like augmented reality shopping experiences offer new ways for consumers to interact with textiles. These advancements promise a future where fashion and textiles are more sustainable, personalised, and technologically integrated. How has the textile industry evolved in response to growing environmental concerns, and what sustainable practices or materials are becoming more prevalent? The textile industry has undergone significant evolution in response to growing environmental concerns, aiming to reduce its ecological footprint. Several sustainable practices and materials are becoming more prevalent to address these issues. •Recycled and Upcycled Materials: The use of recycled fibres, like PET bottles transformed into polyester, and upcycled fabrics from post-consumer waste, helps divert waste from landfills while reducing the need for virgin resources. •Organic and Natural Fibres: Organic cotton, hemp, and linen are becoming more popular due to their reduced pesticide and water usage, and the absence of harmful chemicals in their production. •Dyeing and Printing Innovations: Eco-friendly dyeing techniques, such as waterless dyeing and digital printing, are gaining prominence as they consume less water and generate less pollution. •Circular Fashion: The textile industry is increasingly adopting circular economy principles, promoting the repair, reuse, and recycling of clothing, which extends the lifespan of products. •Reducing Water and Energy Consumption: Manufacturers are investing in more energy-efficient machinery and water recycling systems, minimising resource usage in production. •Transparency and Certification: Brands are providing more information about their supply chains, while certifications like GOTS and OEKO-TEX ensure compliance with environmental and ethical standards. •Slow Fashion: A shift towards quality over quantity is encouraging the creation of durable, timeless garments that reduce overconsumption. These practices and materials signify a broader commitment to sustainability in the textile industry, as it aligns with the global imperative to mitigate climate change and minimise environmental harm. Can you discuss the impact of global supply chain challenges on the textile industry and how businesses are adapting to ensure a consistent flow of materials and products? Global supply chain challenges have significantly impacted the textile industry. Issues like shipping delays, raw material shortages, and increased costs have disrupted production. Businesses are adapting by diversifying suppliers, stockpiling critical materials, and embracing digital technology for better visibility. Reshoring and nearshoring are gaining traction to reduce dependence on distant suppliers. Furthermore, sustainable practices and circular economy principles are being adopted to minimise waste and increase resource efficiency. In sum, textile businesses are resiliently adjusting their strategies to secure a consistent flow of materials and products in this challenging environment. In what ways is technology, such as automation and digitalisation, reshaping the textile production process and the overall industry landscape? Technology, including automation and digitalisation, is revolutionising the textile industry. Automation streamlines manufacturing, enhancing efficiency and reducing labour costs. Robotics and AI-driven systems are replacing manual tasks like cutting and sewing, resulting in increased production speed and consistency. Digitalisation allows for the design, production, and distribution to be interconnected, reducing lead times and minimising waste. Additionally, technologies like 3D printing and digital textile printing enable customisable and sustainable production. Overall, technology is reshaping the textile industry by optimising processes, reducing environmental impact, and adapting to consumer demand for fast, personalised, and eco-friendly products. What are some of the key challenges and opportunities facing the textile industry in the coming years, and how can businesses prepare to thrive in this changing environment? The textile industry faces several challenges and opportunities in the coming years. Challenges include sustainability concerns, evolving consumer preferences, and supply chain disruptions. To thrive, businesses can invest in sustainable practices, adopt digital technologies for agile production, and engage in circular economy initiatives. Meeting the demand for eco-friendly products and reducing waste can open new markets. Collaborating with partners in the supply chain, embracing automation, and staying attuned to consumer trends will be crucial. Additionally, fostering innovation in materials and production methods will help textile companies stay competitive and adapt to the changing landscape of the industry. What inspired you to start ColossusTex, and what was the initial vision for the company? After dedicating more than 12 years to the textile industry, with experience spanning various sectors such as yarn spinning, fabric manufacturing, garment production, and distribution, I came to realise that many companies in this field face a common set of challenges. These challenges have kept the textile industry as a low-margin business with substantial uncertainties. My inspiration draws from the success of new-generation mobile app solutions in more complex sectors like transportation, food delivery, and finding specialised technicians. I firmly believe that if we can provide a swift and effective solution to mitigate these challenges for companies and employees in the textile industry, it will significantly enhance the industry’s global performance. Our vision is to create a robust model that fosters sustainable trade practices, deploys effective marketing strategies, and facilitates global access to unique textile products. With our tagline, ‘Revolutionizing Textiles for the Future’, we aspire to be a game-changer and trendsetter, ushering in a new era to replace traditional trade practices in the textile industry. Could you describe the core products or services that ColossusTex offers and what sets them apart in the market? ColossusTex is a forward-thinking company that aims to revolutionise the textile industry through a comprehensive range of services. We offer a diverse set of solutions to address various aspects of the textile business, including consulting, logistics, information provision, and marketing. Global presence, extensive network, and a focus on maximising the potential and profitability of textile organisations is what sets us apart from other players operating in this sphere. Here’s a brief overview of our core products and services: •ColossusFind: ColossusFind is your go-to marketplace app. Buyers can easily post their requirements, while sellers can effortlessly publish their products for sale. It is a platform where the entire buying and selling process is made seamless. •ColossusGrow: ColossusGrow is all about nurturing innovation. Companies can showcase their innovative products, and we provide the growth they need. Our network and free subscriptions are the keys to propelling their business forward. •ColossusDeal: ColossusDeal is your solution for dealing with non-moving stocks, idle machinery, and unutilised resources. We help you liquidate these assets, turning them into value for your business. •ColossusMove: It simplifies logistics. Customers can easily obtain rates and confirm logistics contracts with our platform. ColossusMove is the solution provider for all things logistics. •ColossusMind: ColossusMind keeps you updated with industry news, global policies, and price trends. It is the source for brands to stay informed, so that they can make well-informed business decisions. •ColossusTech: It provides technical assistance to global clients, helping them reduce wastage and improve inspection processes. •ColossusMeet: ColossusMeet is a platform where business leaders share their professional journeys, and the community exchanges views for maximising and streamlining business. It is the place to connect, learn, and grow. •ColossusCare: It is a talent acquisition partner. Through ColossusCare, companies can find appropriate talent and connect with experts to meet their business needs. These services collectively provide a comprehensive solution for textile businesses, enabling them to improve their operations, connect with the right partners, and stay competitive in a rapidly evolving industry. •ColossusEDGE: It is an innovative and forward-thinking financial platform that offers a range of services aimed at enhancing B2B trade and supporting the financial needs of businesses. One of its core features is the seamless onboarding of B2B partners, simplifying the process and allowing for efficient collaboration. Additionally, it empowers businesses by providing generous credit lines of up to 330 days, fostering flexibility and liquidity. This extended credit period is particularly advantageous for MSMEs and mid-sized corporations, enabling them to leverage the sanctioned CTMONEY for their raw material procurement and other necessary purchases. ColossusEDGE is driving financial inclusivity and efficiency, making it a valuable partner for businesses of all sizes in their trade endeavours. Can you share some examples of how the company has contributed to making businesses more sustainable in the long term? The flow of information within the textile industry has historically been constrained by traditional trade practices, with certain cities or countries specialising in specific products while the rest of the world imports these items. This setup often limits the growth of these products because the pricing of imported goods becomes more expensive due to customs barriers. Our strategy is to promote the local production of innovative products in every city or country, provided they have access to the necessary raw materials and technological expertise. For instance, in India, the production of sports shoes was limited due to the unavailability of crucial raw materials for creating shoe uppers. We took an innovative approach by maintaining local inventories in various parts of the country and globally, which has contributed to India becoming the world’s second-largest producer of shoes. We are replicating this successful model in Turkiye and Peru. Moreover, we are applying a similar approach to the blanket and carpet segments, introducing new products that are used in other parts of the world but are rarely seen in other markets. We do not just supply raw materials; we offer comprehensive services, including consulting, execution, and assistance in finding target markets for finished products. By providing these services, we aim to make these businesses sustainable and encourage them to continuously innovate their products, fostering a vision of ongoing improvement. What role does technology play in your supply chain management solutions, and how has it evolved over time? Technology plays a pivotal role in modern supply chain management solutions, and its evolution has been transformative over time. Initially, supply chains relied on manual processes and paper-based systems, leading to inefficiencies and limited visibility. However, with the advent of digital technology, supply chain management has undergone a significant evolution. In the early stages, technology introduced basic automation with the use of spreadsheets and basic software for inventory tracking and order management. The evolution continued with the implementation of Enterprise Resource Planning (ERP) systems that integrated various functions within the supply chain, enabling better coordination and data sharing. The most profound transformation came with the rise of advanced technologies like Internet of Things (IoT), big data analytics, artificial intelligence (AI), and blockchain. IoT sensors provide real-time visibility into the movement and condition of goods, optimising logistics and reducing the risk of disruptions. AI-driven algorithms enhance demand forecasting, route optimisation, and inventory management, leading to cost savings and improved customer service. Blockchain ensures transparency and security in supply chain transactions. Furthermore, cloud computing and Software as a Service (SaaS) solutions have made supply chain management more accessible and scalable. Mobile apps and digital platforms allow for real-time collaboration among stakeholders across the globe. Technology in supply chain management has evolved from manual processes to highly sophisticated, data-driven, and interconnected systems. This evolution has enabled companies to streamline operations, reduce costs, enhance customer service, and respond more effectively to dynamic market demands. The future promises even more advancements as technology continues to shape the supply chain landscape. Could you elaborate on the global presence of ColossusTex and how it has impacted the company’s growth and strategy? ColossusTex has established its own offices in key locations such as China, Vietnam, Uzbekistan, Turkiye, and Singapore. With exports to over 35 countries, we have cultivated a network of partner agents in each destination to represent our products. We are actively involved in major textile events and exhibitions worldwide to enhance ColossusTex’s global presence. Additionally, we operate warehousing facilities in three countries, ensuring convenient access to value-added and specialised products for local customers. Our presence in Singapore, a prominent financial hub in Asia, enables us to provide long-term support to our customers. ColossusTex’s approach revolves around global accessibility, sustainable trade practices, and proactive marketing. With our expanding global footprint, we aim to raise the bar each year. How does ColossusTex differentiate itself from other players in the textile supply chain management industry? By employing state-of-the-art technology, effective sourcing and assertive marketing, our experts strive to provide companies with the best outputs in these experientially led times. Over the collective experience of 25 years, our team has built niche across various verticals of the textile industry. With global establishments in 7 countries and clientele in more than 35 nations, we stand tall with a close-knit community of manufacturing partners, buyers and service providers. While we provide exemplary services, we have obtained empowering customer testimonials. Our promise is to deliver high end quality, robust logistics management and cost optimisations that channelise into an unforgettable consumer journey. Our key USPs that differentiate us from other players are as follows - •Effective Sourcing: We offer effective sourcing of raw materials and finished products. We have a well-established network and the ability to find the best sources for our clients, potentially resulting in cost savings and quality improvements. •Expertise: ColossusTex team has 25 years of collective experience in the textile industry, which includes working across various verticals. This expertise helps us to provide valuable insights and solutions to the clients’ specific needs. •Global Presence: With establishments in 7 countries and clients in more than 35 nations, ColossusTex emphasises its global reach. This widespread presence allows us to tap into diverse markets and resources, potentially offering unique advantages to our clients. •Transparency: Our commitment to transparent trade policies and the use of advanced analytics showcases a dedication to accountability. This is an attractive feature for our clients who want clear and reliable business partnerships. •Sustainability: ColossusTex also underscores its commitment to sustainability. This is a growing concern in many industries, including textiles, and our company’s ability to provide sustainable goods and services sets us apart from competitors. •Cost Optimisation: The promise of cost optimisation is an important factor for clients looking to reduce expenses and improve profitability. Our emphasis is on cost-effectiveness focused on delivering value to the clients. •Robust Logistics Management: Our robust logistics management system highlights our capability to efficiently manage the movement of materials and products, which is crucial in the textile supply chain. Could you share your thoughts on the challenges and opportunities presented by the digital transformation of the textile supply chain? The digital transformation of the textile supply chain brings forth a host of challenges and opportunities that have a profound impact on the industry. Challenges: •Complexity and Integration: The textile supply chain is multifaceted, involving various stakeholders, from raw material suppliers to manufacturers and retailers. Coordinating this complex web of players can be a challenge. •Data Security and Privacy: With increased digitisation comes the risk of data breaches, especially when dealing with sensitive information like designs, intellectual property, and customer data. •Cost and Accessibility: Smaller players in the industry may struggle with the initial investment required for digital technologies. Additionally, ensuring equal access to these tools can be a challenge. Opportunities: •Efficiency and Transparency: Digital technologies enable real-time tracking, reducing delays and wastage. Transparency is improved, as stakeholders can access information on the status of orders and inventory. •Sustainability: The textile industry is under scrutiny for its environmental impact. Digitalisation can aid in better resource management, reduced waste, and improved sustainability through data-driven decisions. •Personalisation: With digital tools like AI and big data, companies can better understand customer preferences and offer more personalised products and experiences. While the digital transformation of the textile supply chain presents complex challenges, it offers significant advantages in terms of efficiency, sustainability, and customer satisfaction. To navigate this transformation successfully, companies must invest in the right technology, prioritise data security, and ensure accessibility and inclusivity across the supply chain. What advice would you give to aspiring entrepreneurs looking to enter the textile industry or start their own businesses? My suggestions to all new entrepreneurs who aspires to start a venture in the textile industry would be: •Address a problem you have personally encountered as a consumer. •Introduce fresh concepts at least twice a year to stay innovative. •Place a greater emphasis on functional textiles. •Dedicate relentless effort until you attain your goals. Lastly, what is your vision for the future of ColossusTex, and what goals do you hope to achieve in the coming years?","filter_flag":1}
{"title":"TheCSRUniverse Interview with Eric Ou, Country Head, ASUS India: “We envision achieving a global recycling rate of ... - The CSR Universe","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL3RoZWNzcnVuaXZlcnNlLmNvbS9hcnRpY2xlcy9pbnRlcnZpZXctd2l0aC1lcmljLW91LWNvdW50cnktaGVhZC1hc3VzLWluZGlhLXdlLWVudmlzaW9uLWFjaGlldmluZy1hLWdsb2JhbC1yZWN5Y2xpbmctcmF0ZS1vZi0yMC1mb3Itb3VyLXByb2R1Y3RzLWJ5LTIwMjUt0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL3RoZWNzcnVuaXZlcnNlLmNvbS9hcnRpY2xlcy9pbnRlcnZpZXctd2l0aC1lcmljLW91LWNvdW50cnktaGVhZC1hc3VzLWluZGlhLXdlLWVudmlzaW9uLWFjaGlldmluZy1hLWdsb2JhbC1yZWN5Y2xpbmctcmF0ZS1vZi0yMC1mb3Itb3VyLXByb2R1Y3RzLWJ5LTIwMjUt0gEA?oc=5","id":"CBMioAFodHRwczovL3RoZWNzcnVuaXZlcnNlLmNvbS9hcnRpY2xlcy9pbnRlcnZpZXctd2l0aC1lcmljLW91LWNvdW50cnktaGVhZC1hc3VzLWluZGlhLXdlLWVudmlzaW9uLWFjaGlldmluZy1hLWdsb2JhbC1yZWN5Y2xpbmctcmF0ZS1vZi0yMC1mb3Itb3VyLXByb2R1Y3RzLWJ5LTIwMjUt0gEA","guidislink":false,"published":"Thu, 23 Nov 2023 09:17:58 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=23, tm_hour=9, tm_min=17, tm_sec=58, tm_wday=3, tm_yday=327, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL3RoZWNzcnVuaXZlcnNlLmNvbS9hcnRpY2xlcy9pbnRlcnZpZXctd2l0aC1lcmljLW91LWNvdW50cnktaGVhZC1hc3VzLWluZGlhLXdlLWVudmlzaW9uLWFjaGlldmluZy1hLWdsb2JhbC1yZWN5Y2xpbmctcmF0ZS1vZi0yMC1mb3Itb3VyLXByb2R1Y3RzLWJ5LTIwMjUt0gEA?oc=5\" target=\"_blank\">TheCSRUniverse Interview with Eric Ou, Country Head, ASUS India: “We envision achieving a global recycling rate of ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The CSR Universe<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"TheCSRUniverse Interview with Eric Ou, Country Head, ASUS India: “We envision achieving a global recycling rate of ... - The CSR Universe","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL3RoZWNzcnVuaXZlcnNlLmNvbS9hcnRpY2xlcy9pbnRlcnZpZXctd2l0aC1lcmljLW91LWNvdW50cnktaGVhZC1hc3VzLWluZGlhLXdlLWVudmlzaW9uLWFjaGlldmluZy1hLWdsb2JhbC1yZWN5Y2xpbmctcmF0ZS1vZi0yMC1mb3Itb3VyLXByb2R1Y3RzLWJ5LTIwMjUt0gEA?oc=5\" target=\"_blank\">TheCSRUniverse Interview with Eric Ou, Country Head, ASUS India: “We envision achieving a global recycling rate of ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The CSR Universe<\/font>","source.href":"https:\/\/thecsruniverse.com","source.title":"The CSR Universe","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Did you know e-waste is the fastest-growing solid waste stream in the world? According to the Central Pollution Control Board (CPCB), e-waste generated in Indiaduring the financial year 2021-22 was estimated at 16,01,155.36 tonnes, with lead being one of the common substances released into the environment.Renowned global agencies like the International Labour Organization (ILO) and the World Health Organization (WHO) have estimated thatmillions of women and child labourers engaged in the informal recycling sector may be at risk of e-waste exposure. With a commitment to ensure a greener tomorrow, ASUS India announced its new initiative #DiscardResponsibly with an aim to evoke a sense of accountability in society. It’s a step towards building a sustainable environment by disposing of e-waste sensibly. In an interview with TheCSRUniverse, Eric Ou, Country Head of India, President and Director, ASUS India, discusses this new initiative which not only encourages responsible e-waste disposal but also aims to foster a broader conversation about the importance of handling electronics with care to maximize their lifespan. He also talks about the company’s ambitious goal of recycling 20% of its products by 2025 along with the broader sustainability goals. Read the full interview below to learn about ASUS India’s commitment to be the harbinger of change when it comes to environmental protection. Q&A Q. ASUS recently launched the #DiscardResponsibly campaign. Please tell us a little more about how this initiative was conceptualized and what it entails. A. As we are progressing towards a more technologically evolved future, it is also imperative that we step towards setting the premise for a more sustainable technology and future that is built on a well-functional circular economy to curb e-waste. ASUS, since its inception, has been the harbinger of change, be it in terms of introducing state-of-the-art technology or harnessing sustainable solutions beyond manufacturing. Our attempt to reduce the mounting e-waste in the country and globally led to the inception of our #DiscardResponsibly campaign. As the name suggests, this campaign is an attempt to drive awareness amongst our customers to discard their e-waste in a responsible manner. Not just pertaining to creating conversations, we have also initiated a collection service that can be availed when phoning the toll-free number or visiting the ASUS exclusive\/selectstore. ASUS envisions achieving a global recycling rate of 20% for its products by 2025 and we need support from our consumers to achieve this target. With the broader theme of “You can recycle anything with a plug, battery, or cable!\" we are certain that we will be able to take a meaningful step towards building India’s circular e-waste economy Q. What are the challenges you are anticipating with this initiative and how do you plan to address them? A. While we embark on this CSR initiative, we are fully aware of the challenges that lie ahead. Our commitment to responsible business practices goes beyond mere tokenism, and we understand that scepticism from the public is one of the primary challenges we may face. Many may perceive CSR efforts as mere marketing tactics or greenwashing, which is why our foremost measure to combat this scepticism is to demonstrate authenticity and transparency in every activity we undertake. We will engage in open and honest communication, ensuring that our intentions are clear, and that we demonstrate the tangible impact of our initiatives towards society and the environment. Stakeholder engagement is another vital aspect of our efforts. It's not just about what we do; it's about how we involve our customers, suppliers, and local communities through our initiatives. We value our stakeholders'inputs, involve them in the decision-making process, and demonstrate unwavering transparency in our social impactendeavours. By ensuring that our stakeholders are not just informed but actively participating, we aim to build a stronger, more effective, and more transparent ecosystem. Q. ASUS plans to have 20% of its products recycled by 2025. How far do you think this campaign would contribute to achieving that goal? What are the other steps you are taking in that direction? A. ASUS's ambitious goal of recycling 20% of its products by 2025 is a commendable sustainability initiative. To achieve this, the company is implementing a multifaceted approach that includes product design, recycling programs, and consumer engagement. 1. Product Design: ASUS comes with incorporating eco-friendly design principles, making products more easily recyclable and using materials with a lower environmental footprint. Design modifications that consider disassembly, material recovery, and sustainable sourcing play a crucial role. Ex – The recently launched ASUS Zenbook S 13 OLED laptop is one of the most environmentally conscious devices available in the Indian market. This product embraces recycled materials in its chassis, employing a high percentage of post-industrial-recycled (PIR) aluminium and magnesium-aluminium alloy in its metal parts. 2. Consumer Participation: Engaging our consumers in the recycling process is key to success. ASUS launches various awareness campaigns, offers incentives for recycling old products, and provides accessible drop-off points for e-waste. The participation of consumers in returning old products is a significant factor. 3. Circular Economy Initiatives: Asus promotes a circular economy approach, where products are repaired, refurbished, or repurposed, which can extend the lifecycle of ASUS products. This not only reduces waste but also minimises the need for new resources. Below are the additional significant measures taken by ASUS to ensure a sustainable future: - RE100 Participation: RE100 is an international initiative launched in 2014 by the Climate Group and the Carbon Disclosure Project (CDP). ASUS is part of RE100, with a goal to use 100% renewable energy in Taiwan by 2030 and globally by 2035. - Task Force on Climate-related Financial Disclosures (TCFD) Initiative: ASUS is a founding member of the \"Taiwan Climate Partnership,\" where it aims to identify major climate risks and opportunities, and measure the impact on operations and finances under different scenarios, so as to set management goals, formulate response countermeasures and actions, and systematically disclose the progress and results of response actions. - SBTi Commitment: SBTi (Science Based Target Initiative) is a joint initiative of the UN Global Compact, the World Resources Institute, the World Wide Fund for Nature, and the Carbon Disclosure Project (CDP). ASUS is dedicated to science-based carbon reduction targets aligned with a 1.5°C pathway. - RBA Membership: ASUS became a full member of the Responsible Business Alliance (RBA) in 2018 to take on greater responsibilities as the producer. Asus includes the PAS7000 and SA8000 standards and sets the ASUS Supplier Code of Conduct to strengthen the protection of young and female employees. Q. E-waste disposal is becoming a global challenge. In your opinion, how are Indian companies progressing on this front and what more can they do to address this issue? A. In the fiscal year 2020-2021, India grappled with the daunting task of managing a staggering 3.4 lakh tonnes of e-waste. This challenge is further exacerbated when considering the data from the Central Pollution Control Board (CPCB), which reveals a concerning annual increase of 3% in plastic waste generation. Even more alarming is the escalating generation of e-waste, which reached a colossal 7.1 lakh tonnes in 2018-19 and surged to an astonishing 10.14 lakh tonnes in 2019-20, showing a relentless annual growth rate of 31%. Drawing from the CPCB's report, it is evident that we face a monumental challenge. As conscientious corporate citizens, we fully grasp the urgency of advancing sustainable technology. Thus, our \"Discard Responsibly\" initiative is meticulously crafted to engage and sensitize major stakeholders. It underscores the vital need for a collective effort in shaping a greener future. Importantly, this responsibility cannot be the sole burden of a single organisation; it necessitates a united commitment across the entire supply chain, encompassing every stakeholder in the nation. One of the most formidable hurdles is inspiring action among the general populace and fostering a positive environmental impact. Therefore, our objective with \"Discard Responsibly\" is to actively involve and sensitize people to the mounting waste challenges, ultimately leading to more responsible and sustainable practices. Q. What are the broader sustainability goals for ASUS in India and what are the key steps that the company plans to take in this direction in the near future? A. ASUS India's sustainability goals are in line with our dedication towards inculcating sustainable practices that help create a lasting impact. We understand the importance of delivering shared value to society while contributing to the UN's Sustainable Development Goals (SDGs). We have charted down our sustainability goals for India and the key steps include the following: Climate Action: 1. Reducing Carbon Emissions: By 2030, we aim to reduce carbon emissions from ASUS global operations centres by 50%. 2. Renewable Energy Adoption: Our objective is to transition to 100% renewable energy usage in Taiwan-based operations centres by 2030, further extending this practice to our global operations centres by 2035. 3. Energy Efficiency: Each year, we are committed to ensuring that our key products exceed energy efficiency standards by 30% above the Energy Star benchmark. 4. Supplier Collaboration: We are actively working with key suppliers to achieve a 30% reduction in carbon intensity by 2025, reflecting our efforts to create a sustainable and environmentally conscious supply chain. Circular Economy: 5. Sustainable Procurement: We aim to promote sustainable procurement and enhance the utilization of environmentally friendly materials in our products and packaging, with the goal of achieving a 100% increase. 6. Eco Labels: To enhance our green competitiveness, we intend to boost the proportion of Eco Labels in our revenue by more than 50%. 7. Information Security: We are dedicated to strengthening information security in our R&D system, ensuring 100% coverage of international information security standards by 2025. 8. Recycling Rate: As part of our commitment to a circular economy, we aspire to achieve a global recycling rate of 20% for ASUS products, contributing to the responsible management of electronic waste. Responsible Manufacturing: 9. Supply Chain Information Security: We are actively working towards enhancing information security across our supply chain, with a specific focus on ensuring key suppliers' compliance with information security regulations. These goals and steps underscore our firm belief in sustainability, environmental protection, and our responsibility to address global challenges while promoting positive change and innovation. We are committed to making significant contributions to both, the environment and society. Q. Tell us more about your home-collection drive. Also, which locations are contributing the most when it comes to e-waste collection? A. As part of our commitment to responsible e-waste management, ASUS India has established a toll-free helpline accessible at (1800-2090-365), and a dedicated portal at https:\/\/asus.in\/discardresponsibly\/. Through these platforms, consumers can access essential information on e-waste disposal and easily schedule pick-up slots for collection. Our ASUS representatives stand ready to swiftly retrieve the e-waste from the designated locations. We have implemented a comprehensive e-waste collection initiative, focusing on our ASUS stores as key collection points. Moreover, our commitment to raising awareness and fostering a culture of responsible e-waste management is evident through an extensive on-ground campaign that spans over 40 ASUS stores. Within these stores, our dedicated employees play a pivotal role in educating customers on the critical steps to reduce e-waste. They provide insights into minimizing electronic waste generation and actively involve customers in our eco-friendly initiative. As an additional incentive, customers purchasing laptops from ASUS stores are honoured with a symbolic gesture: a jute bag and a plant. This token serves as a pledge to actively participate in waste reduction efforts and promote sustainability. The initiative's success is further exemplified by the enthusiastic participation of specific locations that have contributed the most towards this vital cause - . These notable contributions emphasize the collective effort we are making to curb e-waste and protect our environment, reflecting our commitment to a greener and more sustainable future. Q. How do you see the role of innovation and technology in pushing responsible e-waste disposal? A. ASUS believes that sustainable management of a business should not be limited to the business itself, but we should also properly address the indirect environmental and social impacts that may be caused by the supply chain. Therefore, while launching the new products, we keep in mind the organisational governance, human rights, labour practices, environment, fair operation, customer issues, community engagement and development, and their relationship with different stages of the value chain from raw materials, manufacturing, transportation, use, to disposal, we map out our management actions by identifying major sustainability risks to human rights and the environment. Q. How have your company’s focus areas for CSR evolved over the last 4-5 years? A. Over the last 4-5 years, our company's focus area for CSR has significantly evolved with a greater emphasis on sustainability and environmental responsibility. While we have maintained our commitment to education, we have placed a stronger emphasis on environmental initiatives, particularly in the realm of responsible e-waste disposal. To address the pressing issue of e-waste, we introduced the #DiscardResponsibly campaign, a testament to our dedication to sustainable practices. This campaign centres around the theme, \"You can recycle anything with a plug, battery, or cable!\" It seeks to raise awareness among end users about the adverse consequences of improper electronic waste disposal while empowering individuals to take accountability for their e-waste disposal practices. At ASUS, we have always been at the forefront of technological innovation and positive change. We firmly believe in the urgent need to adopt sustainable practices and contribute to the establishment of a circular e-waste economy. As part of our commitment to this cause, we have set a bold target: by 2025, we aim to achieve a global recycling rate of 20% for ASUS products. However, we recognize that this goal can only be realized with the unwavering support of our customers, who have placed their trust in us day in and day out. Our vision is encapsulated in the phrase \"my responsibility, discard responsibly.\" We are excited to announce the #DiscardResponsibly-2023 campaign in India, which not only encourages responsible e-waste disposal but also aims to foster a broader conversation about the importance of handling electronics with care to maximize their lifespan. We are confident that this initiative will inspire and engage ASUS users in building India's e-waste circular economy, contributing to a greener and more sustainable future for our planet.","filter_flag":1}
{"title":"Technology and AI Based Insurance Solutions - Express Computer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmV4cHJlc3Njb21wdXRlci5pbi9ndWVzdC1ibG9ncy90ZWNobm9sb2d5LWFuZC1haS1iYXNlZC1pbnN1cmFuY2Utc29sdXRpb25zLzEwNTY4MC_SAWJodHRwczovL3d3dy5leHByZXNzY29tcHV0ZXIuaW4vYW1wL2d1ZXN0LWJsb2dzL3RlY2hub2xvZ3ktYW5kLWFpLWJhc2VkLWluc3VyYW5jZS1zb2x1dGlvbnMvMTA1NjgwLw?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmV4cHJlc3Njb21wdXRlci5pbi9ndWVzdC1ibG9ncy90ZWNobm9sb2d5LWFuZC1haS1iYXNlZC1pbnN1cmFuY2Utc29sdXRpb25zLzEwNTY4MC_SAWJodHRwczovL3d3dy5leHByZXNzY29tcHV0ZXIuaW4vYW1wL2d1ZXN0LWJsb2dzL3RlY2hub2xvZ3ktYW5kLWFpLWJhc2VkLWluc3VyYW5jZS1zb2x1dGlvbnMvMTA1NjgwLw?oc=5","id":"CBMiXmh0dHBzOi8vd3d3LmV4cHJlc3Njb21wdXRlci5pbi9ndWVzdC1ibG9ncy90ZWNobm9sb2d5LWFuZC1haS1iYXNlZC1pbnN1cmFuY2Utc29sdXRpb25zLzEwNTY4MC_SAWJodHRwczovL3d3dy5leHByZXNzY29tcHV0ZXIuaW4vYW1wL2d1ZXN0LWJsb2dzL3RlY2hub2xvZ3ktYW5kLWFpLWJhc2VkLWluc3VyYW5jZS1zb2x1dGlvbnMvMTA1NjgwLw","guidislink":false,"published":"Wed, 15 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=15, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=319, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmV4cHJlc3Njb21wdXRlci5pbi9ndWVzdC1ibG9ncy90ZWNobm9sb2d5LWFuZC1haS1iYXNlZC1pbnN1cmFuY2Utc29sdXRpb25zLzEwNTY4MC_SAWJodHRwczovL3d3dy5leHByZXNzY29tcHV0ZXIuaW4vYW1wL2d1ZXN0LWJsb2dzL3RlY2hub2xvZ3ktYW5kLWFpLWJhc2VkLWluc3VyYW5jZS1zb2x1dGlvbnMvMTA1NjgwLw?oc=5\" target=\"_blank\">Technology and AI Based Insurance Solutions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Express Computer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Technology and AI Based Insurance Solutions - Express Computer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmV4cHJlc3Njb21wdXRlci5pbi9ndWVzdC1ibG9ncy90ZWNobm9sb2d5LWFuZC1haS1iYXNlZC1pbnN1cmFuY2Utc29sdXRpb25zLzEwNTY4MC_SAWJodHRwczovL3d3dy5leHByZXNzY29tcHV0ZXIuaW4vYW1wL2d1ZXN0LWJsb2dzL3RlY2hub2xvZ3ktYW5kLWFpLWJhc2VkLWluc3VyYW5jZS1zb2x1dGlvbnMvMTA1NjgwLw?oc=5\" target=\"_blank\">Technology and AI Based Insurance Solutions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Express Computer<\/font>","source.href":"https:\/\/www.expresscomputer.in","source.title":"Express Computer","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"By Tabrej Khan, CTO, Anand Rathi Insurance Brokers Ltd. Technology has been instrumental in shaping the post-COVID world, enabling businesses and individuals to adapt to new ways of working and living. The pandemic expedited the adoption of digital technologies across all sectors, ushering in lasting changes. The Insurance Regulatory Authority of India (IRDAI) has taken significant strides to promote and integrate technology into the insurance sector. They’ve established a sandbox environment for insurers to experiment with new technologies, with a clear focus on enhancing efficiency, customer-centricity, and inclusivity. Technology and AI are revolutionising insurance solutions, making the industry more efficient, customer-oriented, and innovative. This transformation facilitates outreach to underserved populations, offering them accessible and affordable insurance products. Customers now enjoy a seamless insurance experience across various platforms, thanks to technological omnipresence. Furthermore, technology and AI are pivotal in enhancing cybersecurity measures, safeguarding both insurance companies and their customers against cyber threats. By leveraging technology, the insurance industry is contributing to a more sustainable future, creating new products and services centred around sustainability, and educating customers on sustainable practices. The latest sensation Generative AI (GenAI) is a type of artificial intelligence that can create new content, such as text, images, and code. It is trained on massive datasets of existing data, which it uses to learn patterns and generate new content that is like training data. In today’s landscape, there is a plethora of insurance solutions powered by Technology and AI. Here are some specific examples: – Underwriting & value-added services AI analyses vast datasets, including historical claims, telematics, medical, lifestyle, and social media data, to accurately assess and price risk, resulting in more personalised coverage for customers. Predictive analytics employs machine learning to identify patterns and trends, predicting customer risk and fraud. This information guides precise policy pricing and fraud prevention. Insurers are increasingly utilising IoT devices to collect data, enhancing underwriting, claims processing, and risk prevention. For example, IoT devices monitor the condition of insured items, identifying potential issues before they escalate. Similarly, wearable devices can measure health vitals, and if any abnormalities are detected, a trigger can be initiated to inform the insured and extend support. Tasks that once took hours or days are now executed in seconds through AI-powered processes, such as computer vision technology for instant policy issuance & claim admissibility. Telematics devices track driving behaviour, allowing insurers to offer discounts to safe drivers and identify higher-risk drivers. – Claims Processing and Customer Service AI automates various claims processing tasks, expediting the process, and reducing costs for insurers. Computer vision and algorithms enable immediate liability assessments through uploaded accident vehicle pictures. Claim admissibility based on policy coverage is now prompted by the system. Pre-authorisation approvals for health claims in hospitals are made instantly. AI also identifies and prevents fraudulent claims, examining images of damaged property for potential fraud. – Product Development AI assists insurers in creating innovative products tailored to evolving customer needs. Personalised insurance products based on individual risk profiles improve overall health outcomes, reducing the need for costly interventions later in life. AI-driven parametric insurance pays out predetermined amounts based on specific events, such as natural disasters or supply chain disruptions. AI is used to develop cyber insurance products that are tailored to the specific needs of individual customers. Farmers Insurance is using AI to help customers detect and prevent water damage to their homes. – Cybersecurity and Regulatory Compliance Technology ensures compliance with evolving regulations. AI systems monitor policies and procedures for legal adherence. Insurance companies use these technologies to respond to cyber threats, safeguarding networks, and systems swiftly and effectively 24\/7. Technology aids insurance companies in identifying and mapping all personal data, crucial for compliance with data protection regulations. Encryption is used to protect data at rest (stored on a disk or other storage device) and in transit (being transmitted over a network). Network segmentation can help to improve security by isolating sensitive data from the rest of the network. – Sustainability Insurers reduce paper consumption by digitising applications, policy documents, and claims forms, saving resources and costs. Online self-service options reduce the need for physical visits, conserving energy and reducing emissions. Cloud computing further aids in reducing energy consumption and emissions. In conclusion, the integration of technology and AI in insurance solutions represents a significant leap forward in revolutionising the industry. These advancements not only enhance operational efficiency but also empower insurers to offer more personalised and accessible services to their clients. As we move forward, the continued evolution of these technologies promises even greater innovation and value in the insurance landscape.","filter_flag":1}
{"title":"Sustainability in co-working: Environmentally-friendly initiatives in shared workspaces - Cyprus Mail","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vY3lwcnVzLW1haWwuY29tLzIwMjMvMTEvMjIvc3VzdGFpbmFiaWxpdHktaW4tY28td29ya2luZy1lbnZpcm9ubWVudGFsbHktZnJpZW5kbHktaW5pdGlhdGl2ZXMtaW4tc2hhcmVkLXdvcmtzcGFjZXMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vY3lwcnVzLW1haWwuY29tLzIwMjMvMTEvMjIvc3VzdGFpbmFiaWxpdHktaW4tY28td29ya2luZy1lbnZpcm9ubWVudGFsbHktZnJpZW5kbHktaW5pdGlhdGl2ZXMtaW4tc2hhcmVkLXdvcmtzcGFjZXMv0gEA?oc=5","id":"CBMiemh0dHBzOi8vY3lwcnVzLW1haWwuY29tLzIwMjMvMTEvMjIvc3VzdGFpbmFiaWxpdHktaW4tY28td29ya2luZy1lbnZpcm9ubWVudGFsbHktZnJpZW5kbHktaW5pdGlhdGl2ZXMtaW4tc2hhcmVkLXdvcmtzcGFjZXMv0gEA","guidislink":false,"published":"Wed, 22 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=326, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vY3lwcnVzLW1haWwuY29tLzIwMjMvMTEvMjIvc3VzdGFpbmFiaWxpdHktaW4tY28td29ya2luZy1lbnZpcm9ubWVudGFsbHktZnJpZW5kbHktaW5pdGlhdGl2ZXMtaW4tc2hhcmVkLXdvcmtzcGFjZXMv0gEA?oc=5\" target=\"_blank\">Sustainability in co-working: Environmentally-friendly initiatives in shared workspaces<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cyprus Mail<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sustainability in co-working: Environmentally-friendly initiatives in shared workspaces - Cyprus Mail","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vY3lwcnVzLW1haWwuY29tLzIwMjMvMTEvMjIvc3VzdGFpbmFiaWxpdHktaW4tY28td29ya2luZy1lbnZpcm9ubWVudGFsbHktZnJpZW5kbHktaW5pdGlhdGl2ZXMtaW4tc2hhcmVkLXdvcmtzcGFjZXMv0gEA?oc=5\" target=\"_blank\">Sustainability in co-working: Environmentally-friendly initiatives in shared workspaces<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cyprus Mail<\/font>","source.href":"https:\/\/cyprus-mail.com","source.title":"Cyprus Mail","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Are you interested in working in a sustainable and environmentally-friendly environment? Look no further than co-working spaces! With energy-efficient lighting, green building certifications, and waste reduction programs, these shared workspaces are leading the way in sustainability. They also incorporate sustainable materials and furniture, renewable energy sources, and even community gardens. By using eco-friendly cleaning products and partnering with local environmental organizations, co-working spaces are creating a positive impact on the planet. Join the movement towards sustainability and enjoy a greener work environment. Energy-efficient lighting and appliances You can save energy and reduce costs by using energy-efficient lighting and appliances in your shared workspace. Switching to LED lights is a simple yet effective way to make your workspace more energy-efficient. LED lights use up to 75% less energy than traditional incandescent bulbs and can last up to 25 times longer. This means not only will you be saving money on your energy bills, but you will also be reducing the amount of waste generated from constantly replacing bulbs. Additionally, consider investing in energy-efficient appliances such as refrigerators, microwaves, and printers. Look for appliances with an ENERGY STAR rating, as they are designed to use less energy without sacrificing performance. By making these small changes in your shared workspace, you can make a big impact on your energy consumption and carbon footprint. Plus, you will be setting a positive example for others and encouraging them to follow suit. So, go ahead and make the switch to energy-efficient lighting and appliances to create a more sustainable and cost-effective workspace. Green building certifications and standards To ensure that shared workspaces meet environmentally-friendly standards, it is important to regularly seek green building certifications and adhere to sustainable building standards. Green building certifications, such as LEED (Leadership in Energy and Environmental Design) and BREEAM (Building Research Establishment Environmental Assessment Method), provide a framework for evaluating and recognizing buildings that are designed, constructed, and operated with sustainability in mind. These certifications assess various aspects of a building’s sustainability, including energy efficiency, water conservation, waste management, and indoor environmental quality. By pursuing and achieving these certifications, co-working spaces can demonstrate their commitment to reducing their environmental impact and providing a healthier and more sustainable work environment for their occupants. In addition to certifications, shared workspaces should also adhere to sustainable building standards. These standards, such as the International Green Construction Code (IgCC) and the Living Building Challenge, provide guidelines and requirements for sustainable building practices. By following these standards, co-working spaces can ensure that their building design, construction, and operation align with the highest levels of sustainability. Waste reduction and recycling programs By implementing waste reduction and recycling programs, shared workspaces can significantly reduce their environmental impact and promote a more sustainable work environment. One of the most effective ways to achieve this is by setting up a comprehensive waste management system. This involves providing clearly labeled recycling bins for different types of waste, such as paper, plastic, and glass. Additionally, shared workspaces can encourage employees and members to minimize waste by using digital documents instead of printing, bringing reusable water bottles and coffee cups, and using refillable ink cartridges for printers. Furthermore, shared workspaces can establish partnerships with local recycling facilities to ensure that waste is properly sorted and processed. This can help divert a significant amount of waste from landfills and contribute to the circular economy by turning waste materials into new products. Additionally, shared workspaces can organize educational workshops and training sessions to raise awareness about the importance of waste reduction and recycling among their members. To further reduce waste, shared workspaces can implement measures such as switching to digital billing and communication, using eco-friendly cleaning products, and providing composting facilities for food waste. By taking these steps, shared workspaces can play a crucial role in reducing waste generation and promoting a more sustainable work culture. Sustainable materials and furniture Using sustainable materials and furniture is essential for creating an environmentally-friendly workspace that minimizes its ecological footprint. When designing a co-working space, it is important to consider the materials and furniture used in order to promote sustainability and reduce environmental impact. Opting for sustainable materials means choosing materials that are sourced responsibly, have a low carbon footprint, and can be recycled or reused at the end of their lifecycle. For example, using reclaimed wood for desks and tables not only adds a unique aesthetic to the space, but also reduces the demand for new timber and helps prevent deforestation. Additionally, using furniture made from recycled or upcycled materials can significantly reduce the environmental impact. For instance, chairs made from recycled plastic or fabric made from upcycled materials are great options. These materials not only divert waste from landfills, but also require less energy to produce compared to virgin materials. Furthermore, it is important to choose furniture that is durable and long-lasting. This reduces the need for frequent replacements, ultimately reducing waste. Investing in high-quality, well-designed furniture made from sustainable materials ensures that it will withstand the test of time. Renewable energy sources Consider implementing renewable energy sources in your co-working space to reduce its carbon footprint and promote sustainability. By harnessing the power of renewable energy, you can make a significant positive impact on the environment. Here are three reasons why embracing renewable energy sources is a great choice for your co-working space: Environmental Stewardship : By using renewable energy sources such as solar panels or wind turbines, you can significantly decrease your co-working space’s reliance on fossil fuels. This reduces greenhouse gas emissions, helping combat climate change and preserving our planet for future generations. : By using renewable energy sources such as solar panels or wind turbines, you can significantly decrease your co-working space’s reliance on fossil fuels. This reduces greenhouse gas emissions, helping combat climate change and preserving our planet for future generations. Cost Savings : Renewable energy sources may require an initial investment, but in the long run, they can lead to substantial cost savings. By generating your own energy, you can reduce your reliance on expensive utility bills, ultimately saving money for both you and your co-working members. : Renewable energy sources may require an initial investment, but in the long run, they can lead to substantial cost savings. By generating your own energy, you can reduce your reliance on expensive utility bills, ultimately saving money for both you and your co-working members. Community Engagement: Embracing renewable energy sources can inspire and engage your community. By showcasing your commitment to sustainability, you can attract like-minded individuals and businesses who value eco-friendly practices. This fosters a sense of belonging and creates a positive environment for collaboration and networking. Incorporating renewable energy sources in your co-working space not only benefits the environment but also provides financial savings and community engagement opportunities. Take the leap towards sustainability and make a difference today. Water conservation measures To ensure responsible water usage in your co-working space, regularly assess and implement water conservation measures, such as installing low-flow faucets and toilets. These measures can significantly reduce the amount of water consumed within your workspace, ultimately contributing to a more sustainable environment. Low-flow faucets are designed to limit the flow rate of water without compromising functionality. By reducing the amount of water coming out of the faucet, you can save a significant amount of water over time. Similarly, installing low-flow toilets can drastically reduce the amount of water used for flushing, as they use less water per flush compared to conventional toilets. Another effective water conservation measure is the installation of sensor-activated faucets and toilets. These devices only release water when they detect motion, ensuring that water is not wasted when not in use. Additionally, promoting awareness among employees about responsible water usage can further contribute to water conservation efforts. Encouraging simple actions like turning off faucets tightly and reporting any leaks promptly can make a significant difference. Regularly monitoring water usage and conducting audits can help identify areas where water conservation measures can be implemented. By taking these steps, you can not only reduce your environmental footprint but also inspire others in the co-working community to adopt water conservation practices. Together, we can make a positive impact on the sustainability of our shared workspaces. Indoor air quality and ventilation systems Improve the indoor air quality of your co-working space by implementing proper ventilation systems. Good ventilation is essential for creating a healthy and comfortable working environment. Here are three reasons why investing in ventilation systems is a smart move: Enhanced Productivity : Fresh air promotes better cognitive function and productivity. Proper ventilation can help reduce the concentration of pollutants and prevent the build-up of stale air, ensuring that you and your co-workers can stay focused and energized throughout the day. : Fresh air promotes better cognitive function and productivity. Proper ventilation can help reduce the concentration of pollutants and prevent the build-up of stale air, ensuring that you and your co-workers can stay focused and energized throughout the day. Health Benefits : Indoor air can be filled with pollutants like dust, allergens, and volatile organic compounds (VOCs) from cleaning products, furniture, and office equipment. These pollutants can lead to various health problems, including allergies, respiratory issues, and headaches. Installing ventilation systems can help remove these pollutants and improve the overall health and well-being of everyone in the workspace. : Indoor air can be filled with pollutants like dust, allergens, and volatile organic compounds (VOCs) from cleaning products, furniture, and office equipment. These pollutants can lead to various health problems, including allergies, respiratory issues, and headaches. Installing ventilation systems can help remove these pollutants and improve the overall health and well-being of everyone in the workspace. Comfort and Satisfaction: Adequate ventilation ensures a comfortable temperature and humidity level, preventing the space from becoming stuffy and unpleasant. When the air quality is good and the temperature is just right, people are generally happier and more satisfied with their working environment. Investing in proper ventilation systems not only helps create a healthier and more comfortable co-working space but also contributes to the overall sustainability and well-being of the environment. So, prioritize the air quality in your shared workspace and reap the benefits of a healthier and happier co-working community. Bike-friendly amenities and facilities For a more sustainable and convenient co-working experience, embrace bike-friendly amenities and facilities available in your workspace. Many co-working spaces are recognizing the importance of promoting cycling as a means of transportation and are implementing various initiatives to cater to bike commuters. One such initiative is the provision of secure bike storage facilities. These facilities not only ensure the safety of your bike but also encourage more people to choose cycling as a mode of transportation. Additionally, some co-working spaces offer bike repair stations equipped with tools and pumps, allowing you to perform basic maintenance on your bike. This eliminates the need for you to travel to a separate bike shop, saving both time and money. Furthermore, bike-friendly workspaces may also provide shower and changing facilities, allowing you to freshen up after your ride. This is especially beneficial if you have a long commute or if the weather conditions are unfavorable. By embracing bike-friendly amenities and facilities in your workspace, you not only contribute to the sustainability of the environment but also promote a healthier and more active lifestyle. Promoting sustainable transportation options Consider incorporating sustainable transportation options into your daily commute and help reduce your carbon footprint. By making simple changes to how you travel to work, you can contribute to a more sustainable future. Here are three ways you can promote sustainable transportation options: Carpooling: Share your ride with colleagues or neighbors who live nearby. Carpooling not only helps reduce traffic congestion but also lowers carbon emissions by maximizing the use of vehicles. Share your ride with colleagues or neighbors who live nearby. Carpooling not only helps reduce traffic congestion but also lowers carbon emissions by maximizing the use of vehicles. Public Transportation: Opt for buses, trains, or trams to get to your co-working space. Public transportation systems are designed to accommodate large numbers of people, resulting in fewer cars on the road and less pollution. Opt for buses, trains, or trams to get to your co-working space. Public transportation systems are designed to accommodate large numbers of people, resulting in fewer cars on the road and less pollution. Active Commuting: Consider walking or cycling to work if your co-working space is within a reasonable distance. Not only will this help you stay active and improve your health, but it will also significantly reduce your carbon footprint. Community gardens and urban agriculture initiatives Grow your own fresh produce and foster a sense of community by participating in community gardens and urban agriculture initiatives. By creating community gardens within shared workspaces, individuals have the opportunity to grow their own fruits, vegetables, and herbs, reducing their carbon footprint and supporting a more sustainable lifestyle. Fact: These initiatives are gaining popularity in shared spaces in Miami as a way to promote sustainability and provide healthy, locally grown food for members. Community gardens not only provide an opportunity for individuals to grow their own food, but they also create a sense of community and connection among co-workers. Working together to maintain the garden, sharing tips and knowledge, and enjoying the fruits of their labor can strengthen relationships and create a positive work environment. Urban agriculture initiatives take community gardening a step further by utilizing underutilized spaces within urban areas, such as rooftops or vacant lots, to grow food. These initiatives can have a significant impact on the environment by reducing the need for transportation of food from distant locations and minimizing the use of pesticides and herbicides. In addition to the environmental benefits, community gardens and urban agriculture initiatives can also contribute to the well-being of individuals. Gardening has been shown to reduce stress, improve mental health, and provide a sense of accomplishment. By participating in these initiatives, co-workers can take a break from their work and engage in a rewarding and productive activity. Eco-friendly cleaning products and practices You can easily maintain a clean and sustainable workspace by using eco-friendly cleaning products and practices. Making the switch to these environmentally-friendly alternatives not only benefits the planet but also promotes a healthier and more productive work environment for you and your co-workers. Here are three reasons why you should consider using eco-friendly cleaning products and practices: Protecting your health : Traditional cleaning products often contain harmful chemicals that can cause respiratory problems, skin irritations, and other health issues. By using eco-friendly alternatives, you can reduce your exposure to these toxins and create a safer space for everyone. : Traditional cleaning products often contain harmful chemicals that can cause respiratory problems, skin irritations, and other health issues. By using eco-friendly alternatives, you can reduce your exposure to these toxins and create a safer space for everyone. Reducing environmental impact : Conventional cleaning products often contain ingredients that are harmful to the environment. By choosing eco-friendly options, you can minimize water pollution, reduce waste, and support sustainable manufacturing practices. : Conventional cleaning products often contain ingredients that are harmful to the environment. By choosing eco-friendly options, you can minimize water pollution, reduce waste, and support sustainable manufacturing practices. Creating a positive work environment: Using eco-friendly cleaning products and practices shows that you care about the well-being of your co-workers and the planet. It fosters a sense of community and encourages others to adopt sustainable habits. Education and awareness campaigns on sustainability One effective way to promote sustainability in co-working spaces is by implementing educational workshops and awareness campaigns. These initiatives are crucial in fostering a culture of sustainability among co-workers and encouraging them to adopt eco-friendly practices. Educational workshops provide an opportunity for co-workers to learn about the importance of sustainability and how their actions can make a positive impact on the environment. These workshops can cover a wide range of topics, such as energy conservation, waste management, and sustainable transportation options. By equipping co-workers with knowledge and practical tips, they can make informed choices and contribute towards a greener workspace. In addition to workshops, awareness campaigns are another powerful tool to promote sustainability. These campaigns can include posters, newsletters, and social media posts that highlight the importance of eco-friendly practices. They can also showcase success stories of co-workers who have implemented sustainable initiatives, inspiring others to follow suit. By creating a buzz around sustainability, these campaigns generate interest and encourage co-workers to actively participate in green initiatives. Moreover, education and awareness campaigns can help co-workers understand the environmental benefits of sustainable practices, such as reducing carbon emissions, conserving resources, and preserving natural habitats. By highlighting the connection between individual actions and global sustainability goals, these initiatives motivate co-workers to make conscious choices and contribute towards a more sustainable future. Collaboration with local environmental organizations By partnering with local environmental organizations, you can enhance the sustainability efforts of your co-working space. Collaborating with these organizations not only shows your commitment to the environment but also allows you to tap into their expertise and resources. Here are three ways in which this collaboration can benefit your co-working space: Access to knowledge and guidance : Local environmental organizations have a wealth of knowledge and expertise when it comes to sustainable practices. By partnering with them, you can gain access to valuable information and guidance on how to make your workspace more environmentally friendly. They can provide insights on energy efficiency, waste management, and other sustainability initiatives that can help you reduce your carbon footprint. : Local environmental organizations have a wealth of knowledge and expertise when it comes to sustainable practices. By partnering with them, you can gain access to valuable information and guidance on how to make your workspace more environmentally friendly. They can provide insights on energy efficiency, waste management, and other sustainability initiatives that can help you reduce your carbon footprint. Networking opportunities : Collaborating with local environmental organizations can open doors to valuable networking opportunities. Through these partnerships, you can connect with like-minded individuals and businesses who share your commitment to sustainability. This can lead to potential collaborations, partnerships, and even new business opportunities. : Collaborating with local environmental organizations can open doors to valuable networking opportunities. Through these partnerships, you can connect with like-minded individuals and businesses who share your commitment to sustainability. This can lead to potential collaborations, partnerships, and even new business opportunities. Community engagement: By working with local environmental organizations, you can actively engage with your community and make a positive impact. This collaboration allows you to participate in local environmental initiatives, such as clean-up events or educational campaigns. By involving your co-working space in these activities, you not only contribute to a cleaner and greener environment but also build a stronger sense of community among your members. Partnering with local environmental organizations is a win-win situation. It not only enhances the sustainability efforts of your co-working space but also allows you to make a meaningful difference in your community. Frequently asked questions How can co-working spaces promote sustainable transportation options? You can promote sustainable transportation options in co-working spaces by offering incentives for using public transportation or biking, providing bike racks and showers, and implementing carpooling or ride-sharing programs. What are some examples of eco-friendly cleaning products and practices used in shared workspaces? Some examples of eco-friendly cleaning products and practices used in shared workspaces include using non-toxic cleaners, implementing recycling programs, and using microfiber cloths. These initiatives help reduce environmental impact and promote sustainability. How do co-working spaces collaborate with local environmental organizations to promote sustainability? Co-working spaces collaborate with local environmental organizations to promote sustainability by organizing events, workshops, and campaigns. You can join these initiatives to learn about eco-friendly practices and contribute to making the workspace more environmentally friendly. What are some indoor air quality and ventilation systems implemented in co-working spaces? Some co-working spaces use advanced indoor air quality and ventilation systems to provide you with clean and fresh air. These systems help remove pollutants and maintain a comfortable working environment for you. How do co-working spaces educate and raise awareness about sustainability among their members? Co-working spaces educate and raise awareness about sustainability among their members through various initiatives. They organize workshops and events, provide educational materials, and promote eco-friendly practices to encourage a greener and more environmentally-conscious work environment. Conclusion Overall, co-working spaces are embracing sustainability through various environmentally-friendly initiatives. From energy-efficient lighting and appliances to waste reduction and recycling programs, these spaces are making conscious choices to reduce their environmental impact. Incorporating sustainable materials and furniture, utilizing renewable energy sources, and promoting community gardens and urban agriculture initiatives are further steps towards a greener future. By collaborating with local environmental organizations and raising awareness through education campaigns, co-working spaces are creating a more sustainable and eco-friend","filter_flag":1}
{"title":"Newsroom - Blackpool Council","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmJsYWNrcG9vbC5nb3YudWsvbmV3cy9ibGFja3Bvb2wtYnVzaW5lc3MtYWNhZGVtaWVzLWxhdW5jaGVkLXRvLXByb21vdGUtc3VzdGFpbmFibGUtZ3Jvd3RoLmFzcHg_ZGF0ZT0wMS0xMS0yMDIz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmJsYWNrcG9vbC5nb3YudWsvbmV3cy9ibGFja3Bvb2wtYnVzaW5lc3MtYWNhZGVtaWVzLWxhdW5jaGVkLXRvLXByb21vdGUtc3VzdGFpbmFibGUtZ3Jvd3RoLmFzcHg_ZGF0ZT0wMS0xMS0yMDIz0gEA?oc=5","id":"CBMiemh0dHBzOi8vd3d3LmJsYWNrcG9vbC5nb3YudWsvbmV3cy9ibGFja3Bvb2wtYnVzaW5lc3MtYWNhZGVtaWVzLWxhdW5jaGVkLXRvLXByb21vdGUtc3VzdGFpbmFibGUtZ3Jvd3RoLmFzcHg_ZGF0ZT0wMS0xMS0yMDIz0gEA","guidislink":false,"published":"Wed, 01 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=305, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmJsYWNrcG9vbC5nb3YudWsvbmV3cy9ibGFja3Bvb2wtYnVzaW5lc3MtYWNhZGVtaWVzLWxhdW5jaGVkLXRvLXByb21vdGUtc3VzdGFpbmFibGUtZ3Jvd3RoLmFzcHg_ZGF0ZT0wMS0xMS0yMDIz0gEA?oc=5\" target=\"_blank\">Newsroom<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Blackpool Council<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Newsroom - Blackpool Council","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmJsYWNrcG9vbC5nb3YudWsvbmV3cy9ibGFja3Bvb2wtYnVzaW5lc3MtYWNhZGVtaWVzLWxhdW5jaGVkLXRvLXByb21vdGUtc3VzdGFpbmFibGUtZ3Jvd3RoLmFzcHg_ZGF0ZT0wMS0xMS0yMDIz0gEA?oc=5\" target=\"_blank\">Newsroom<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Blackpool Council<\/font>","source.href":"https:\/\/www.blackpool.gov.uk","source.title":"Blackpool Council","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The Blackpool Growth Business Academy and the Blackpool Net Zero Business Academy are new business support programmes set to play a crucial role in supporting the growth and sustainability of local firms. The Blackpool Growth Business Academy will play a pivotal role in fostering entrepreneurial spirit, helping new start businesses to chart their future success. It will also provide advice and mentoring for more established growth ambitious businesses to expand their operations, scale their impact, and drive innovation and job creation. The Blackpool Net Zero Business Academy will assist local businesses in their journey to net zero, assessing their carbon footprint and creating detailed plans to reduce carbon emissions, drive down energy costs and develop sustainable business practices. The £850k initiative is funded by the UK Government's Shared Prosperity Fund (SPF) and is led by the council’s Business Growth Team. It forms part of Blackpool’s £5.7m SPF investment programme to March 2025. The academy programmes will be promoted via the Blackpool Unlimited gateway, the Business Growth Team’s website and alert service that has been signposting relevant advice, funding support and regeneration news to local businesses for over 15 years. The council has secured a wide range of specialist advisors and mentors to help deliver the academy offer. Councillor Mark Smith, Blackpool Council’s Cabinet Member for Levelling Up – Place with responsibilities for business growth, recognises the remarkable entrepreneurial talent of new and established businesses in Blackpool. He said:","filter_flag":1}
{"title":"Canadian consumption changes due to climate crisis - CityNews Vancouver","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vdmFuY291dmVyLmNpdHluZXdzLmNhLzIwMjMvMTEvMTUvY2xpbWF0ZS1jaGFuZ2UtY29uc3VtcHRpb24taW5mbGF0aW9uL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vdmFuY291dmVyLmNpdHluZXdzLmNhLzIwMjMvMTEvMTUvY2xpbWF0ZS1jaGFuZ2UtY29uc3VtcHRpb24taW5mbGF0aW9uL9IBAA?oc=5","id":"CBMiTmh0dHBzOi8vdmFuY291dmVyLmNpdHluZXdzLmNhLzIwMjMvMTEvMTUvY2xpbWF0ZS1jaGFuZ2UtY29uc3VtcHRpb24taW5mbGF0aW9uL9IBAA","guidislink":false,"published":"Wed, 15 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=15, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=319, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vdmFuY291dmVyLmNpdHluZXdzLmNhLzIwMjMvMTEvMTUvY2xpbWF0ZS1jaGFuZ2UtY29uc3VtcHRpb24taW5mbGF0aW9uL9IBAA?oc=5\" target=\"_blank\">Canadian consumption changes due to climate crisis<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CityNews Vancouver<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Canadian consumption changes due to climate crisis - CityNews Vancouver","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vdmFuY291dmVyLmNpdHluZXdzLmNhLzIwMjMvMTEvMTUvY2xpbWF0ZS1jaGFuZ2UtY29uc3VtcHRpb24taW5mbGF0aW9uL9IBAA?oc=5\" target=\"_blank\">Canadian consumption changes due to climate crisis<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CityNews Vancouver<\/font>","source.href":"https:\/\/vancouver.citynews.ca","source.title":"CityNews Vancouver","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Climate change and inflation are increasingly seeping into the minds and wallets of Canadian consumers. A new survey by accounting firm Ernst and Young finds Canadians are buying less and changing the way they eat due to rising concerns about the environment and rising prices of food. The EY Future Consumer Index Survey found 84 per cent have rising concerns about climate change and 96 per cent of Canadians have deepening concerns about inflation. Monica Chadha, EY Canada retail leader, says these concerns will be reflected in the coming festive months when consumption normally ticks up. “As we head into the holiday season and beyond, we’ll see more shoppers take control and do their research to optimize for both economic and environmental benefits,” Chadha said. In an effort to help the environment, 38 per cent of consumers indicate they’re planning to buy less, the survey found. Fashion accessories were the most popular product category in which consumers are planning to buy less, followed by toys and gadgets, clothing, footwear, and cosmetics. “Consumer products companies can’t ignore the large percentages of Canadians who are changing their lifestyles and consumption habits in response to climate change and affordability concerns,” said Elliot Morris, EY Canada grocery and consumer packaged goods leader. Not only is climate change impacting consumers’ fashion choices, it’s also heavily impacting their grocery bills. Nearly one-third of Canadians surveyed have had to change the food they eat due to climate change impacting prices and availability. Almost half of consumers say they’re planning to order less — a 15 per cent increase from last year — and about 40 per cent of consumers say they’re planning to transition meals with friends to at-home dinner parties. Different generations, different actions Both Baby Boomers and Gen Z are taking personal actions with the planet in mind — but their methods of impact differ. The survey notes while the older Baby Boomer generation is more likely to act sustainably, the Gen Z generation is more likely to spend sustainably. In the survey, Baby Boomers stood out as the best at bringing reusable bags to the store and recycling or reusing packaging. Meanwhile, the younger generations are more likely to pay for sustainable goods and services, as well as check a company’s sustainable practices online. “People are more informed now about what sustainability means and have better access to information to assess whether a brand is living up to its promises,” said Morris. “Companies need to get ahead and respond now by creating new products or reformulating existing ones to make them healthier and more sustainable, so they can protect their profitability and the brand experience.”","filter_flag":1}
{"title":"Navigating the ever-evolving FMCG landscape: The imperative of innovation - The Financial Express","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9idXNpbmVzcy9pbmR1c3RyeS1uYXZpZ2F0aW5nLXRoZS1ldmVyLWV2b2x2aW5nLWZtY2ctbGFuZHNjYXBlLXRoZS1pbXBlcmF0aXZlLW9mLWlubm92YXRpb24tMzMxMTY5MS_SAYkBaHR0cHM6Ly93d3cuZmluYW5jaWFsZXhwcmVzcy5jb20vYnVzaW5lc3MvaW5kdXN0cnktbmF2aWdhdGluZy10aGUtZXZlci1ldm9sdmluZy1mbWNnLWxhbmRzY2FwZS10aGUtaW1wZXJhdGl2ZS1vZi1pbm5vdmF0aW9uLTMzMTE2OTEvbGl0ZS8?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9idXNpbmVzcy9pbmR1c3RyeS1uYXZpZ2F0aW5nLXRoZS1ldmVyLWV2b2x2aW5nLWZtY2ctbGFuZHNjYXBlLXRoZS1pbXBlcmF0aXZlLW9mLWlubm92YXRpb24tMzMxMTY5MS_SAYkBaHR0cHM6Ly93d3cuZmluYW5jaWFsZXhwcmVzcy5jb20vYnVzaW5lc3MvaW5kdXN0cnktbmF2aWdhdGluZy10aGUtZXZlci1ldm9sdmluZy1mbWNnLWxhbmRzY2FwZS10aGUtaW1wZXJhdGl2ZS1vZi1pbm5vdmF0aW9uLTMzMTE2OTEvbGl0ZS8?oc=5","id":"CBMihAFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9idXNpbmVzcy9pbmR1c3RyeS1uYXZpZ2F0aW5nLXRoZS1ldmVyLWV2b2x2aW5nLWZtY2ctbGFuZHNjYXBlLXRoZS1pbXBlcmF0aXZlLW9mLWlubm92YXRpb24tMzMxMTY5MS_SAYkBaHR0cHM6Ly93d3cuZmluYW5jaWFsZXhwcmVzcy5jb20vYnVzaW5lc3MvaW5kdXN0cnktbmF2aWdhdGluZy10aGUtZXZlci1ldm9sdmluZy1mbWNnLWxhbmRzY2FwZS10aGUtaW1wZXJhdGl2ZS1vZi1pbm5vdmF0aW9uLTMzMTE2OTEvbGl0ZS8","guidislink":false,"published":"Mon, 20 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=20, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=324, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9idXNpbmVzcy9pbmR1c3RyeS1uYXZpZ2F0aW5nLXRoZS1ldmVyLWV2b2x2aW5nLWZtY2ctbGFuZHNjYXBlLXRoZS1pbXBlcmF0aXZlLW9mLWlubm92YXRpb24tMzMxMTY5MS_SAYkBaHR0cHM6Ly93d3cuZmluYW5jaWFsZXhwcmVzcy5jb20vYnVzaW5lc3MvaW5kdXN0cnktbmF2aWdhdGluZy10aGUtZXZlci1ldm9sdmluZy1mbWNnLWxhbmRzY2FwZS10aGUtaW1wZXJhdGl2ZS1vZi1pbm5vdmF0aW9uLTMzMTE2OTEvbGl0ZS8?oc=5\" target=\"_blank\">Navigating the ever-evolving FMCG landscape: The imperative of innovation<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Financial Express<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Navigating the ever-evolving FMCG landscape: The imperative of innovation - The Financial Express","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9idXNpbmVzcy9pbmR1c3RyeS1uYXZpZ2F0aW5nLXRoZS1ldmVyLWV2b2x2aW5nLWZtY2ctbGFuZHNjYXBlLXRoZS1pbXBlcmF0aXZlLW9mLWlubm92YXRpb24tMzMxMTY5MS_SAYkBaHR0cHM6Ly93d3cuZmluYW5jaWFsZXhwcmVzcy5jb20vYnVzaW5lc3MvaW5kdXN0cnktbmF2aWdhdGluZy10aGUtZXZlci1ldm9sdmluZy1mbWNnLWxhbmRzY2FwZS10aGUtaW1wZXJhdGl2ZS1vZi1pbm5vdmF0aW9uLTMzMTE2OTEvbGl0ZS8?oc=5\" target=\"_blank\">Navigating the ever-evolving FMCG landscape: The imperative of innovation<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Financial Express<\/font>","source.href":"https:\/\/www.financialexpress.com","source.title":"The Financial Express","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"– By Vidya Sen In today’s dynamic marketplace, industries constantly find themselves in a whirlwind of change and adaptation. Amidst this landscape of perpetual transformation, the fast-moving consumer goods (FMCG) sector serves as a prime example of relentless development and adaptability. Its success is tightly woven with a resolute commitment to innovation, a driving force behind its consistent growth and relevance in the global market. In this era, innovation is not just a choice but an essential driver for FMCG companies. These companies face ever-evolving consumer preferences, demands, and market trends that necessitate constant adaptation and evolution. Innovation within the FMCG sector extends beyond the creation of new products — it embodies a holistic transformation of processes, an elevation of customer experiences, and a dedication to sustainable practices. Let’s understand why innovation matters. According to NIQ BASES Innovation Measurement System for FMCG, conducted globally, it has been observed that FMCG companies that record growth in innovation-led sales are 1.8 times more likely to grow overall sales, as compared to companies whose innovation sales are either stagnant or declining. This gap is amplified in home care and personal care categories. Also, food and beverages segments have higher innovation proliferation, making it much more important to stay relevant. Also Read Realty has Rs 14 trillion finance opportunity between 2024-26, says report Residential sales on the decline in IT hubs Coal India gets Finmin nod to list arms BCCL and CMPDI Kalpataru Projects receives orders worth Rs 2333 crore Also Read The Big Picture: Zomato serves a turnaround recipe The FMCG industry’s ability to remain relevant in a fiercely competitive environment is rooted in its responsiveness to consumer needs. Understanding consumers deeply through data analytics, social media insights, and direct feedback has become crucial for the development of products and services that genuinely resonate. Meeting the rising demand for sustainability, environmentally conscious practices, and products has become a significant focal point for these companies. Integrating eco-friendly materials and sustainable practices throughout their supply chains to reduce environmental impact has become imperative. The infusion of digitalization and technology is shaping the future of FMCG operations. The emergence of e-commerce, mobile platforms, and AI has transformed how companies engage with consumers. It enables personalised marketing, optimised supply chains, and enriched customer experiences. Health and wellness have become paramount as consumers seek products that contribute positively to their well-being. FMCG companies are innovating with natural ingredients, additional nutrients, and personalized nutrition plans to meet these evolving demands. Also, the push for convenience and personalization is driving the creation of single-serve options, user-friendly packaging, and tailored product recommendations, aligning with individual preferences and fast-paced lifestyles. Many FMCG companies are setting new benchmarks through innovative approaches in product development, marketing, and sustainability. Notably, there is a surge in the demand for plant-based alternatives to traditional meat and dairy products. Pioneering companies like Beyond Meat and Impossible Foods have introduced revolutionary plant-based products that replicate the taste and texture of animal-based products, appealing to the growing vegan and flexitarian consumer base. This shift towards sustainable and ethical food choices aligns with the evolving values of today’s consumers. The utilization of technology to deliver personalized nutrition solutions is also gaining traction. Industry giants such as Nestle and Unilever are employing artificial intelligence and data analytics to craft tailored nutrition plans and products that cater to individual preferences. This personalized approach is reshaping how consumers perceive their dietary needs and overall well-being. Moreover, sustainability is a top priority for FMCG leaders such as Coca-Cola and PepsiCo, dedicated to reducing their environmental impact through sustainable packaging solutions using recycled materials, designing refillable containers, and minimizing packaging waste. Innovation remains the key to success for FMCG companies as consumer expectations evolve and technological advancements unfold. Companies should aim to innovate both at the top and bottom of the price pyramid – to grow portfolio penetration. In 2023, super-premium products (commanding 1.6 – 2 times of average price) have grown at a healthy 17% growth rate – which is similar to the growth rate of mass products (less than 0.8 times of average price). Clearly, there is a possibility of growth at both ends of the pyramid. Moreover, when it comes to premium innovations, brands launching such innovations are 1.3 times more likely to grow overall distribution compared to others – so clearly even retailers seem to love the premium innovations. To maintain a competitive edge, companies must remain agile and adaptable, emphasizing hyper-personalization, and sustainability, leveraging AI and data analytics, embracing new technologies, and collaborating with startups and innovators. By embracing innovation and staying attuned to consumer trends, FMCG companies can adeptly navigate the ever-evolving landscape of consumer goods, ensuring they retain a prominent and competitive position. (Vidya Sen is Nielsen IQ Bases Lead, South Asia.) (Disclaimer: Views expressed are personal and do not reflect the official position or policy of Financial Express Online. Reproducing this content without permission is prohibited.)","filter_flag":1}
{"title":"Grab Malaysia Introduces AI-Driven Reverse Vending Machines to Encourage Sustainable Practices - SME Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vc21lLmFzaWEvZ3JhYi1tYWxheXNpYS1pbnRyb2R1Y2VzLWFpLWRyaXZlbi1yZXZlcnNlLXZlbmRpbmctbWFjaGluZXMtdG8tZW5jb3VyYWdlLXN1c3RhaW5hYmxlLXByYWN0aWNlcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vc21lLmFzaWEvZ3JhYi1tYWxheXNpYS1pbnRyb2R1Y2VzLWFpLWRyaXZlbi1yZXZlcnNlLXZlbmRpbmctbWFjaGluZXMtdG8tZW5jb3VyYWdlLXN1c3RhaW5hYmxlLXByYWN0aWNlcy_SAQA?oc=5","id":"CBMicGh0dHBzOi8vc21lLmFzaWEvZ3JhYi1tYWxheXNpYS1pbnRyb2R1Y2VzLWFpLWRyaXZlbi1yZXZlcnNlLXZlbmRpbmctbWFjaGluZXMtdG8tZW5jb3VyYWdlLXN1c3RhaW5hYmxlLXByYWN0aWNlcy_SAQA","guidislink":false,"published":"Thu, 02 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=306, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vc21lLmFzaWEvZ3JhYi1tYWxheXNpYS1pbnRyb2R1Y2VzLWFpLWRyaXZlbi1yZXZlcnNlLXZlbmRpbmctbWFjaGluZXMtdG8tZW5jb3VyYWdlLXN1c3RhaW5hYmxlLXByYWN0aWNlcy_SAQA?oc=5\" target=\"_blank\">Grab Malaysia Introduces AI-Driven Reverse Vending Machines to Encourage Sustainable Practices<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SME Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Grab Malaysia Introduces AI-Driven Reverse Vending Machines to Encourage Sustainable Practices - SME Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vc21lLmFzaWEvZ3JhYi1tYWxheXNpYS1pbnRyb2R1Y2VzLWFpLWRyaXZlbi1yZXZlcnNlLXZlbmRpbmctbWFjaGluZXMtdG8tZW5jb3VyYWdlLXN1c3RhaW5hYmxlLXByYWN0aWNlcy_SAQA?oc=5\" target=\"_blank\">Grab Malaysia Introduces AI-Driven Reverse Vending Machines to Encourage Sustainable Practices<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SME Magazine<\/font>","source.href":"https:\/\/sme.asia","source.title":"SME Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Grab Malaysia, in partnership with industry leaders KLEAN, Fraser & Neave Holdings Bhd (F&N), and Malaysian Research Accelerator for Technology and Innovation (MRANTI), has launched 18 AI-driven Reverse Vending Machines (RVMs) strategically placed across the Klang Valley. This initiative, part of Grab’s pilot project, aims to drive sustainable change, promote recycling, and support Grab’s goal of achieving zero packaging waste in nature by 2040. The RVMs make it easier for consumers to contribute to a greener Malaysia by allowing them to deposit rinsed plastic food containers, aluminum cans, and Polyethylene terephthalate (PET) bottles. These items will be collected by Asasrama Sdn Bhd, a certified processor, to recycle into raw materials for various purposes, including new products like apparels and furniture fillings. This collaboration underscores Grab’s commitment to proactively seek sustainable solutions and use technology for environmental good. The pilot project, running for six months, aims to encourage greater recycling of plastic waste, aligning with Malaysia’s Plastics Sustainability Roadmap 2021-2030. Grab’s efforts have already led to substantial waste reduction, saving more than 23,800 tonnes of waste and 898 million sets of cutlery weighing 8,088 tonnes in 2022 alone by offering consumers the choice to exclude single-use cutlery from their food delivery orders since 2019. The findings from this pilot initiative will further support Grab’s development of reverse logistics mechanisms, fostering recycling habits and increasing recycling rates among its users.","filter_flag":1}
{"title":"Retail India News: Shree Krishna Paper Mills Earns Best Sustainability Innovator Award 2023 for \"Eco-friendly ... - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vbmV3cy9yZXRhaWwtaW5kaWEtbmV3cy1zaHJlZS1rcmlzaG5hLXBhcGVyLW1pbGxzLWVhcm5zLWJlc3Qtc3VzdGFpbmFiaWxpdHktaW5ub3ZhdG9yLWF3YXJkLTIwMjMtZWNv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vbmV3cy9yZXRhaWwtaW5kaWEtbmV3cy1zaHJlZS1rcmlzaG5hLXBhcGVyLW1pbGxzLWVhcm5zLWJlc3Qtc3VzdGFpbmFiaWxpdHktaW5ub3ZhdG9yLWF3YXJkLTIwMjMtZWNv0gEA?oc=5","id":"CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vbmV3cy9yZXRhaWwtaW5kaWEtbmV3cy1zaHJlZS1rcmlzaG5hLXBhcGVyLW1pbGxzLWVhcm5zLWJlc3Qtc3VzdGFpbmFiaWxpdHktaW5ub3ZhdG9yLWF3YXJkLTIwMjMtZWNv0gEA","guidislink":false,"published":"Sun, 05 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=309, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vbmV3cy9yZXRhaWwtaW5kaWEtbmV3cy1zaHJlZS1rcmlzaG5hLXBhcGVyLW1pbGxzLWVhcm5zLWJlc3Qtc3VzdGFpbmFiaWxpdHktaW5ub3ZhdG9yLWF3YXJkLTIwMjMtZWNv0gEA?oc=5\" target=\"_blank\">Retail India News: Shree Krishna Paper Mills Earns Best Sustainability Innovator Award 2023 for \"Eco-friendly ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Retail India News: Shree Krishna Paper Mills Earns Best Sustainability Innovator Award 2023 for \"Eco-friendly ... - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vbmV3cy9yZXRhaWwtaW5kaWEtbmV3cy1zaHJlZS1rcmlzaG5hLXBhcGVyLW1pbGxzLWVhcm5zLWJlc3Qtc3VzdGFpbmFiaWxpdHktaW5ub3ZhdG9yLWF3YXJkLTIwMjMtZWNv0gEA?oc=5\" target=\"_blank\">Retail India News: Shree Krishna Paper Mills Earns Best Sustainability Innovator Award 2023 for \"Eco-friendly ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Retail India News: HanesBrands to Sell 'Champion' business to Authentic Brands Group HanesBrands, a global leader in iconic apparel brands, has entered into a definitive agreement to sell the intellectual property and certain operating assets of the Company’s global Champion business to Authentic Brands Group (“Authentic”) for a transaction value of $1.2 billion, with the potential to reach up to $1.5 billion through an additional contingent cash consideration of up to $300 million based on achievement of performance thresholds. This agreement, which has been unanimously approved by the HanesBrands Board of Directors, is the successful conclusion of the Company’s previously announced evaluation of a range of strategic options for the global Champion business. HanesBrands has made significant progress in recent years to reignite its innerwear business, increase market share, attract younger consumers, and strengthen its operating model. Upon completion of the transaction, the Company intends to focus on extending its leadership position in the innerwear category and generating above-market growth through continued consumer-centric product innovation and increased investment across its portfolio of leading brands, including Hanes, Bonds, Maidenform, and Bali. Bill Simon, Chairman of the Board said, “Following a thorough review of options for the global Champion business with the support of our financial and legal advisors, we are pleased to have reached this agreement with Authentic Brands Group that we believe maximizes value for Champion and best positions HanesBrands for long-term success. Importantly, we believe this transaction will enable the Company to accelerate its debt reduction while positioning HanesBrands to deliver consistent growth and cash flow generation through a focused strategy on advancing its leading innerwear brands and optimizing its world-class supply chain.” Steve Bratspies, CEO stated, “Today’s announcement is the culmination of significant effort by our teams to position all of our brands on the optimal path for the future. Over the past three years, we have taken necessary actions to enhance the Company’s operations and financial performance – returning to historical gross margins, reducing our cost structure, lowering our debt levels, and generating consistent cash flow. The successful completion of this transaction further simplifies our business, deleverages our balance sheet, and enhances the Company’s operations and financial performance. As we begin the next chapter for HanesBrands, we believe we’re in an even stronger position to further extend our leadership in innerwear, pursue new cost reduction opportunities as we ensure we have the right operating structure in place, and advance our multi-year flywheel to drive strong shareholder returns.” The transaction remains subject to customary closing conditions and is expected to be completed in the second half of 2024. Subsequent to the closing, HanesBrands will provide certain transition services for Champion, including operating the business in select regions through a transition period. HanesBrands expects net proceeds from the transaction of approximately $900 million, including working capital adjustments and other customary transaction costs and excluding the contingent cash consideration. In line with HanesBrands’ commitment to debt reduction, the Company will utilize all net proceeds from the transaction to accelerate its reduction of debt and expects meaningful deleveraging on a net debt-to-adjusted EBITDA basis. On a trailing 12-month basis as of the end of the first quarter of 2024, the global Champion business generated approximately $75 million of adjusted EBITDA, which is net of approximately $60 million of stranded costs. The Company has specific plans to remove all stranded costs within a year of the transaction closing as it completes the transition of the business. The Company intends to classify Champion as discontinued operations in the second quarter of 2024 and as a result, expects to update its full-year 2024 guidance in conjunction with the release of its second-quarter earnings results. Goldman Sachs & Co. LLC and Evercore are serving as financial advisors to HanesBrands, and Kirkland & Ellis LLP and Jones Day are serving as their legal advisors.","filter_flag":1}
{"title":"Achieving zero construction and demolition waste to landfill - Victoria's Big Build","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vYmlnYnVpbGQudmljLmdvdi5hdS9hYm91dC9lY29sb2dpcS9uZXdzL25ld3MtaXRlbXMvYWNoaWV2aW5nLXplcm8tY29uc3RydWN0aW9uLWFuZC1kZW1vbGl0aW9uLXdhc3RlLXRvLWxhbmRmaWxs0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vYmlnYnVpbGQudmljLmdvdi5hdS9hYm91dC9lY29sb2dpcS9uZXdzL25ld3MtaXRlbXMvYWNoaWV2aW5nLXplcm8tY29uc3RydWN0aW9uLWFuZC1kZW1vbGl0aW9uLXdhc3RlLXRvLWxhbmRmaWxs0gEA?oc=5","id":"CBMid2h0dHBzOi8vYmlnYnVpbGQudmljLmdvdi5hdS9hYm91dC9lY29sb2dpcS9uZXdzL25ld3MtaXRlbXMvYWNoaWV2aW5nLXplcm8tY29uc3RydWN0aW9uLWFuZC1kZW1vbGl0aW9uLXdhc3RlLXRvLWxhbmRmaWxs0gEA","guidislink":false,"published":"Wed, 01 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=305, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vYmlnYnVpbGQudmljLmdvdi5hdS9hYm91dC9lY29sb2dpcS9uZXdzL25ld3MtaXRlbXMvYWNoaWV2aW5nLXplcm8tY29uc3RydWN0aW9uLWFuZC1kZW1vbGl0aW9uLXdhc3RlLXRvLWxhbmRmaWxs0gEA?oc=5\" target=\"_blank\">Achieving zero construction and demolition waste to landfill<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Victoria's Big Build<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Achieving zero construction and demolition waste to landfill - Victoria's Big Build","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vYmlnYnVpbGQudmljLmdvdi5hdS9hYm91dC9lY29sb2dpcS9uZXdzL25ld3MtaXRlbXMvYWNoaWV2aW5nLXplcm8tY29uc3RydWN0aW9uLWFuZC1kZW1vbGl0aW9uLXdhc3RlLXRvLWxhbmRmaWxs0gEA?oc=5\" target=\"_blank\">Achieving zero construction and demolition waste to landfill<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Victoria's Big Build<\/font>","source.href":"https:\/\/bigbuild.vic.gov.au","source.title":"Victoria's Big Build","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The South Road upgrade is kicking goals when it comes to sustainability, with the project team diverting 100% of construction and demolition waste from landfill. The team’s sustainable practices mean all construction waste is being taken to recycling facilities where it is processed to produce new products and materials. In addition to diverting all waste from landfill, the team is using asphalt containing recycled material for the Nepean Highway, Bignell Road and East Boundary Road intersection upgrades. Up to 40% recycled asphalt is being used in some layers of the road, and the drainage pipes are made from 100% recycled plastic, demonstrating the Victorian Government’s Recycled First Policy in action. In Melbourne’s southeast, existing landfill sites are expected to reach capacity in 5 years so finding environmentally friendly alternatives is a priority for us, along with Negri Contractors who are working in partnership to deliver the project. Find out more about the South Road Upgrade.","filter_flag":1}
{"title":"Retail India News: Allied Blenders and Distillers Ltd Expands Distillery Capacity with Sustainable Practices - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vbmV3cy9yZXRhaWwtaW5kaWEtbmV3cy1hbGxpZWQtYmxlbmRlcnMtYW5kLWRpc3RpbGxlcnMtbHRkLWV4cGFuZHMtZGlzdGlsbGVyeS1jYXBhY2l0eS1zdXN0YWluYWJsZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vbmV3cy9yZXRhaWwtaW5kaWEtbmV3cy1hbGxpZWQtYmxlbmRlcnMtYW5kLWRpc3RpbGxlcnMtbHRkLWV4cGFuZHMtZGlzdGlsbGVyeS1jYXBhY2l0eS1zdXN0YWluYWJsZdIBAA?oc=5","id":"CBMigAFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vbmV3cy9yZXRhaWwtaW5kaWEtbmV3cy1hbGxpZWQtYmxlbmRlcnMtYW5kLWRpc3RpbGxlcnMtbHRkLWV4cGFuZHMtZGlzdGlsbGVyeS1jYXBhY2l0eS1zdXN0YWluYWJsZdIBAA","guidislink":false,"published":"Tue, 14 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=318, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vbmV3cy9yZXRhaWwtaW5kaWEtbmV3cy1hbGxpZWQtYmxlbmRlcnMtYW5kLWRpc3RpbGxlcnMtbHRkLWV4cGFuZHMtZGlzdGlsbGVyeS1jYXBhY2l0eS1zdXN0YWluYWJsZdIBAA?oc=5\" target=\"_blank\">Retail India News: Allied Blenders and Distillers Ltd Expands Distillery Capacity with Sustainable Practices<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Retail India News: Allied Blenders and Distillers Ltd Expands Distillery Capacity with Sustainable Practices - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vbmV3cy9yZXRhaWwtaW5kaWEtbmV3cy1hbGxpZWQtYmxlbmRlcnMtYW5kLWRpc3RpbGxlcnMtbHRkLWV4cGFuZHMtZGlzdGlsbGVyeS1jYXBhY2l0eS1zdXN0YWluYWJsZdIBAA?oc=5\" target=\"_blank\">Retail India News: Allied Blenders and Distillers Ltd Expands Distillery Capacity with Sustainable Practices<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Retail India News: HanesBrands to Sell 'Champion' business to Authentic Brands Group HanesBrands, a global leader in iconic apparel brands, has entered into a definitive agreement to sell the intellectual property and certain operating assets of the Company’s global Champion business to Authentic Brands Group (“Authentic”) for a transaction value of $1.2 billion, with the potential to reach up to $1.5 billion through an additional contingent cash consideration of up to $300 million based on achievement of performance thresholds. This agreement, which has been unanimously approved by the HanesBrands Board of Directors, is the successful conclusion of the Company’s previously announced evaluation of a range of strategic options for the global Champion business. HanesBrands has made significant progress in recent years to reignite its innerwear business, increase market share, attract younger consumers, and strengthen its operating model. Upon completion of the transaction, the Company intends to focus on extending its leadership position in the innerwear category and generating above-market growth through continued consumer-centric product innovation and increased investment across its portfolio of leading brands, including Hanes, Bonds, Maidenform, and Bali. Bill Simon, Chairman of the Board said, “Following a thorough review of options for the global Champion business with the support of our financial and legal advisors, we are pleased to have reached this agreement with Authentic Brands Group that we believe maximizes value for Champion and best positions HanesBrands for long-term success. Importantly, we believe this transaction will enable the Company to accelerate its debt reduction while positioning HanesBrands to deliver consistent growth and cash flow generation through a focused strategy on advancing its leading innerwear brands and optimizing its world-class supply chain.” Steve Bratspies, CEO stated, “Today’s announcement is the culmination of significant effort by our teams to position all of our brands on the optimal path for the future. Over the past three years, we have taken necessary actions to enhance the Company’s operations and financial performance – returning to historical gross margins, reducing our cost structure, lowering our debt levels, and generating consistent cash flow. The successful completion of this transaction further simplifies our business, deleverages our balance sheet, and enhances the Company’s operations and financial performance. As we begin the next chapter for HanesBrands, we believe we’re in an even stronger position to further extend our leadership in innerwear, pursue new cost reduction opportunities as we ensure we have the right operating structure in place, and advance our multi-year flywheel to drive strong shareholder returns.” The transaction remains subject to customary closing conditions and is expected to be completed in the second half of 2024. Subsequent to the closing, HanesBrands will provide certain transition services for Champion, including operating the business in select regions through a transition period. HanesBrands expects net proceeds from the transaction of approximately $900 million, including working capital adjustments and other customary transaction costs and excluding the contingent cash consideration. In line with HanesBrands’ commitment to debt reduction, the Company will utilize all net proceeds from the transaction to accelerate its reduction of debt and expects meaningful deleveraging on a net debt-to-adjusted EBITDA basis. On a trailing 12-month basis as of the end of the first quarter of 2024, the global Champion business generated approximately $75 million of adjusted EBITDA, which is net of approximately $60 million of stranded costs. The Company has specific plans to remove all stranded costs within a year of the transaction closing as it completes the transition of the business. The Company intends to classify Champion as discontinued operations in the second quarter of 2024 and as a result, expects to update its full-year 2024 guidance in conjunction with the release of its second-quarter earnings results. Goldman Sachs & Co. LLC and Evercore are serving as financial advisors to HanesBrands, and Kirkland & Ellis LLP and Jones Day are serving as their legal advisors.","filter_flag":1}
{"title":"Top 10 Best Paper Manufacturing Companies In India 2024 - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvcGFwZXItbWFudWZhY3R1cmluZy1pbmRpYS0yMDI0L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvcGFwZXItbWFudWZhY3R1cmluZy1pbmRpYS0yMDI0L9IBAA?oc=5","id":"CBMiQmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvcGFwZXItbWFudWZhY3R1cmluZy1pbmRpYS0yMDI0L9IBAA","guidislink":false,"published":"Wed, 08 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=312, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvcGFwZXItbWFudWZhY3R1cmluZy1pbmRpYS0yMDI0L9IBAA?oc=5\" target=\"_blank\">Top 10 Best Paper Manufacturing Companies In India 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 10 Best Paper Manufacturing Companies In India 2024 - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvcGFwZXItbWFudWZhY3R1cmluZy1pbmRpYS0yMDI0L9IBAA?oc=5\" target=\"_blank\">Top 10 Best Paper Manufacturing Companies In India 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"India’s paper manufacturing industry has emerged as a significant contributor to the country’s economic growth, fueled by rising demand for paper-based products across various sectors. In 2024, the landscape of paper manufacturing in India continues to evolve, witnessing the establishment of technologically advanced companies that have pushed the boundaries of innovation and sustainability. As the nation strives for economic development, these top 10 paper manufacturing companies have cemented their positions as leaders in the industry, driving growth, efficiency, and environmental consciousness. The demand for paper products remains steady in India, with industries such as packaging, education, publishing, and communication heavily relying on paper-based materials. However, in recent years, environmental concerns have driven the need for sustainable and eco-friendly practices in the paper manufacturing sector. As the Indian government enforces stringent regulations to minimize environmental impact, companies have been compelled to adopt greener practices, resulting in a surge of eco-conscious manufacturing processes and products. In this dynamic landscape, the top 10 paper manufacturing companies in India have not only adapted to changing market demands but have also excelled in creating a balance between economic viability and environmental stewardship. These companies have invested significantly in research and development to innovate their manufacturing techniques, focusing on minimizing waste, reducing energy consumption, and incorporating recycled materials. The advent of digital technology has posed challenges to the paper industry, but the companies featured in this list have demonstrated their resilience by embracing digital transformation. By integrating technology into their operations, they have streamlined processes, enhanced supply chain management, and optimized resource utilization. This comprehensive list of India’s top 10 paper manufacturing companies in 2024 is a testament to their unwavering commitment to quality, innovation, sustainability, and customer satisfaction. Through their relentless efforts, these companies have not only shaped the future of the paper industry but have also contributed significantly to India’s economic development and environmental preservation. In the following sections, we will delve into the details of each company, exploring its unique strengths, product portfolios, technological advancements, sustainability initiatives, and market influence. Join us on this journey as we uncover the pioneers that are driving India’s paper manufacturing sector forward into a promising and eco-friendly future. The paper manufacturing industry has been a crucial pillar of the global economy for centuries, providing a wide range of products that cater to various sectors. As technology and sustainability become increasingly important in the modern world, the growth prospects of paper manufacturing companies will inevitably evolve. This essay delves into the potential strategies and factors that can propel a paper manufacturing company’s growth in the coming years. Embrace Sustainability and Eco-Friendly Practices In the face of growing environmental concerns, the paper manufacturing industry must pivot towards sustainability and eco-friendly practices. Adopting sustainable sourcing of raw materials, utilizing renewable energy, and implementing efficient waste management systems are essential steps for long-term growth. Customers are increasingly inclined to support environmentally responsible companies, providing an opportunity for paper manufacturers to distinguish themselves in the market. Technological Advancements and Digital Transformation Integration of advanced technologies like artificial intelligence, the Internet of Things (IoT), and big data analytics can significantly enhance productivity and efficiency in paper manufacturing processes. Smart automation and digitalization can streamline operations, reduce costs, and improve product quality. Moreover, digital transformation enables the creation of innovative paper products tailored to modern needs, such as specialty papers for packaging and electronic applications. Diversification of Product Portfolio To foster growth, paper manufacturing companies must expand their product portfolios to meet diverse market demands. Exploring niche markets and producing high-value specialty papers can open new revenue streams. For example, developing papers suitable for sustainable packaging, biodegradable materials, or even functional papers with integrated technology can offer a competitive advantage. Global Market Penetration Expanding into new geographical regions can fuel growth and provide access to untapped markets. Developing economies often exhibit rising demand for paper products due to increased literacy rates, education, and economic development. Companies must invest in understanding regional preferences, cultural nuances, and regulatory environments to successfully penetrate and thrive in foreign markets. Focus on Research and Development Investing in research and development (R&D) is paramount to the future growth of paper manufacturing companies. R&D efforts can lead to the development of cutting-edge technologies, sustainable practices, and innovative paper grades, thereby maintaining a competitive edge in the industry. 1. ITC PSPD ITC PSPD, short for ITC Paperboards and Specialty Papers Division, is a pioneering force in the paper manufacturing industry. With a rich legacy and unwavering commitment to excellence, ITC PSPD has emerged as a prominent player in the market. The company’s relentless pursuit of innovation and sustainability has set new benchmarks in the paper sector. One of the key pillars of ITC PSPD’s success lies in its advanced manufacturing processes and cutting-edge technologies. The company leverages state-of-the-art machinery to produce high-quality paperboards and specialty papers, catering to a diverse range of industries and applications. From packaging solutions to graphic printing, ITC PSPD’s products have found widespread acclaim. Sustainability is deeply ingrained in ITC PSPD’s business philosophy. The company actively promotes eco-friendly practices and responsibly sourced raw materials. By adopting sustainable forestry and recycling practices, ITC PSPD reduces its environmental footprint, making it an environmentally conscious choice for consumers. ITC PSPD’s unwavering focus on research and development has led to continuous improvements in product quality and performance. Their team of dedicated experts works tirelessly to create innovative solutions that cater to the evolving needs of the market. As a result, ITC PSPD has earned accolades for its excellence in innovation and design. In addition to its commitment to quality and sustainability, ITC PSPD also prioritizes social responsibility. The company actively engages in community development initiatives, promoting education, healthcare, and livelihood opportunities for local communities. In conclusion, ITC PSPD stands tall as a transformative force in the paper manufacturing sector. With a strong emphasis on innovation, sustainability, and community engagement, the company has carved a distinct niche for itself in the market, setting an exemplary standard for others to follow. 2. Ballarpur Industries Limited Ballarpur Industries Limited, popularly known as BILT, boasts a rich legacy of excellence in the paper manufacturing domain. As one of India’s largest paper companies, BILT has played a crucial role in shaping the country’s paper industry landscape. Established several decades ago, BILT has continuously evolved and adapted to the changing market dynamics. The company’s robust manufacturing infrastructure equipped with modern technologies enables it to produce a diverse range of paper products. From writing and printing paper to industrial-grade paper, BILT caters to both domestic and international markets. Quality is the cornerstone of BILT’s success. The company adheres to stringent quality control measures at every stage of production, ensuring that its products meet the highest standards. This unwavering commitment to quality has earned BILT a loyal customer base and a stellar reputation in the industry. BILT’s commitment to sustainable practices is commendable. The company has taken significant strides in conserving natural resources, reducing waste, and promoting responsible forestry. By investing in eco-friendly technologies and implementing green initiatives, BILT aims to minimize its environmental impact and contribute to a greener planet. The company’s customer-centric approach is evident through its focus on innovation and customization. BILT collaborates closely with its clients to develop tailor-made solutions that address their specific requirements effectively. This customer-centric strategy has helped BILT build strong and enduring partnerships with its clients. In conclusion, Ballarpur Industries Limited continues to be a trailblazer in the paper manufacturing industry. With its commitment to quality, sustainability, and customer satisfaction, BILT remains a leading player in the market, leaving a lasting impact on the world of paper. 3. JK Paper Limited JK Paper Limited is a leading player in the paper industry in India, renowned for its premium-quality papers that are synonymous with excellence. With over six decades of experience, the company has grown to become a trusted name in the market. JK Paper’s product offerings cater to a wide spectrum of needs, including office documentation, packaging, and specialty papers. Their emphasis on product development and innovation has resulted in an extensive range of eco-friendly papers, reflecting their commitment to sustainability. The company’s manufacturing units are equipped with advanced technology, ensuring efficient production processes and superior product quality. JK Paper has consistently been recognized for its efforts in promoting eco-friendly practices and reducing waste generation. As a customer-focused organization, JK Paper prioritizes customer satisfaction by providing reliable and timely services. Their distribution network spans across the country, ensuring their products reach every corner of the nation. 4. Tamilnadu Newsprint & Papers Limited Tamilnadu Newsprint & Papers Limited (TNPL) is a prominent player in the paper manufacturing industry, based in Tamil Nadu, India. Established in the early 1980s, TNPL has emerged as a leading manufacturer of high-quality paper products, catering to both domestic and international markets. TNPL’s state-of-the-art paper manufacturing plants boast cutting-edge technology and adhere to eco-friendly practices, emphasizing sustainable production. The company specializes in producing a wide range of paper products, including newsprint, writing and printing paper, and packaging paper. Their commitment to quality has earned them several certifications, ensuring their products meet global standards. With a strong emphasis on research and development, TNPL continuously strives to innovate and introduce new products to meet the evolving demands of the paper industry. Their dedication to sustainability is evident through their responsible sourcing of raw materials and efficient energy utilization, minimizing their environmental footprint. In addition to being a major paper producer, TNPL actively contributes to social development and community welfare initiatives. They support educational programs, healthcare facilities, and environmental conservation projects, showcasing their commitment to corporate social responsibility. 5. Century Pulp & Paper Century Pulp & Paper is a renowned name in the paper manufacturing sector, known for its high-quality products and consistent growth. As a leading player in the industry, Century Pulp & Paper operates multiple manufacturing facilities across India, equipped with advanced machinery to produce an extensive range of paper and pulp products. The company’s dedication to innovation has led them to develop specialty papers catering to various industries such as packaging, textiles, and printing. Their papers are known for their superior strength, durability, and versatility, making them a preferred choice for businesses worldwide. With a focus on sustainability, Century Pulp & Paper emphasizes responsible forest management and promotes the efficient use of resources during the production process. This commitment has been acknowledged through various certifications, affirming their eco-friendly practices. Century Pulp & Paper’s commitment to social welfare is evident through their engagement with local communities, supporting skill development programs, healthcare initiatives, and promoting women’s empowerment. Their efforts in corporate social responsibility have gained them recognition as a responsible and caring organization. 6. The Andhra Pradesh Paper Mills Limited The Andhra Pradesh Paper Mills Limited (APPM) holds a prominent position in the paper manufacturing landscape in India. With a history dating back several decades, APPM has consistently grown and diversified its product portfolio. APPM specializes in producing a wide array of paper products, including fine papers used in stationery, writing, and printing. Additionally, the company is known for manufacturing packaging boards, meeting the demands of diverse industries like pharmaceuticals, FMCG, and more. Dedicated to environmental stewardship, APPM focuses on sustainable forest management practices and has implemented measures to reduce water and energy consumption during the paper manufacturing process. Their commitment to eco-friendly operations has earned them various environmental certifications. As a responsible corporate entity, APPM actively engages in philanthropic endeavors, contributing to the development of nearby communities. Their initiatives include supporting education, healthcare, and vocational training programs, aimed at uplifting the lives of the underprivileged. 7. West Coast Paper Mills Limited West Coast Paper Mills Limited is a prominent player in the paper manufacturing industry, renowned for its high-quality products and sustainable practices. Established several decades ago, the company has grown into a leading name in the paper sector, both domestically and internationally. The company’s commitment to innovation and technological advancement sets it apart from its competitors. With state-of-the-art machinery and cutting-edge production processes, West Coast Paper Mills ensures efficient and eco-friendly paper production. Their diverse range of products cater to various industries, including printing, publishing, packaging, and more. In addition to its emphasis on quality and innovation, West Coast Paper Mills Limited prioritizes environmental responsibility. They have implemented sustainable forestry practices and maintain responsible sourcing of raw materials to minimize their ecological footprint. This commitment to sustainability has earned them numerous accolades and certifications, making them a preferred choice for environmentally conscious customers. 8. Abhishek Industries Limited As a leading player in the paper manufacturing sector, Abhishek Industries Limited has garnered a reputation for its exceptional product quality and customer-centric approach. With a rich history of excellence, the company has continuously expanded its product portfolio and market presence. Abhishek Industries Limited specializes in producing a wide range of paper products, from fine writing paper to industrial-grade packaging materials. Their advanced manufacturing facilities ensure consistent and reliable output to meet the demands of diverse industries. One of the key strengths of Abhishek Industries Limited lies in its focus on customer satisfaction. The company prides itself on delivering tailored solutions to meet specific client requirements. This customer-oriented approach has helped them build lasting relationships and establish a loyal clientele. Furthermore, the company’s commitment to social responsibility and community development sets it apart as an industry leader. They actively engage in various CSR initiatives, including educational programs and environmental conservation projects, showcasing their dedication to the betterment of society. 9. Shree Rama Newsprint & Papers Limited Shree Rama Newsprint & Papers Limited is a well-established player in the paper manufacturing sector, renowned for its high-quality newsprint and paper products. With a strong presence in the domestic and international markets, the company has become a trusted name in the industry. The company’s production facilities are equipped with advanced technology to ensure efficient and cost-effective paper production. Their product range includes newsprint, writing and printing paper, and packaging materials, catering to the diverse needs of their clients. Shree Rama Newsprint & Papers Limited places a strong emphasis on sustainability and environmental conservation. They have adopted eco-friendly practices and responsibly sourced raw materials to reduce their impact on the environment. This commitment aligns with the growing demand for environmentally conscious paper products. Moreover, the company’s dedication to research and development enables them to stay ahead of market trends and meet changing customer preferences effectively. Their continuous innovation ensures that they remain competitive and relevant in the dynamic paper industry. 10. Tamil Nadu Paper Corporation Tamil Nadu Paper Corporation is a significant state-owned enterprise playing a crucial role in the paper manufacturing landscape of the region. Established to promote the growth of the paper industry in Tamil Nadu, the corporation has achieved commendable success over the years. The company produces a diverse range of paper products, including copier paper, newsprint, and packaging materials, serving both commercial and government sectors. Their products are known for their consistent quality and affordability, making them a preferred choice for various businesses and institutions. Tamil Nadu Paper Corporation’s commitment to social responsibility and sustainable practices reflects the government’s vision for a greener and more equitable future. By adopting eco-friendly production methods and promoting forest conservation, the corporation actively contributes to environmental protection. Additionally, the corporation’s role in generating employment and supporting local communities further solidifies its position as a responsible corporate entity. As the paper industry continues to evolve, Tamil Nadu Paper Corporation remains steadfast in its mission to foster growth, development, and sustainability in the region.","filter_flag":1}
{"title":"Top 10 Best Textile Companies In India In 2024 - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiOmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdGV4dGlsZS1jb21wYW5pZXMtMjAyNC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiOmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdGV4dGlsZS1jb21wYW5pZXMtMjAyNC_SAQA?oc=5","id":"CBMiOmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdGV4dGlsZS1jb21wYW5pZXMtMjAyNC_SAQA","guidislink":false,"published":"Thu, 09 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=9, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=313, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdGV4dGlsZS1jb21wYW5pZXMtMjAyNC_SAQA?oc=5\" target=\"_blank\">Top 10 Best Textile Companies In India In 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 10 Best Textile Companies In India In 2024 - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdGV4dGlsZS1jb21wYW5pZXMtMjAyNC_SAQA?oc=5\" target=\"_blank\">Top 10 Best Textile Companies In India In 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Introduction: The textile industry in India has a rich history and remains a significant contributor to the country’s economy. As we enter the year 2024, the Indian sector is poised for further growth and success. Marketing in this industry plays a crucial role in promoting brands, products, and innovation to reach a wider audience and remain competitive in the market. Textile companies in India employ various marketing strategies to enhance their visibility, attract customers, and drive sales. Some of the key marketing approaches used by these companies in India include: Branding and Advertising: Textile companies invest in branding and advertising campaigns to create brand awareness and showcase their product range. They use various channels such as print, television, digital media, and social media platforms to reach their target audience effectively. Product Launches and Promotions: These companies frequently introduce new products and collections to attract customer attention. They use promotions, discounts, and offers to entice consumers and boost sales during festive seasons and special occasions. Retail Presence: Many companies have a robust retail network, including exclusive brand outlets, franchise stores, and multi-brand outlets. They focus on store aesthetics and customer experience to attract footfall and encourage repeat purchases. Digital Marketing: In the era of e-commerce, these companies leverage digital marketing to reach a wider audience. They use social media, search engine optimization (SEO), email marketing, and online advertising to engage with customers and drive online sales. CSR Initiatives: They also employ marketing strategies to promote their corporate social responsibility (CSR) initiatives. By showcasing their efforts towards sustainability, ethical sourcing, and community development, they build trust and loyalty among customers. Effective marketing strategies enable these companies in India to stay ahead of the competition, connect with their target audience, and drive brand loyalty and engagement. Benefits of textile companies in India Textile companies play a vital role in the economy and society, providing various benefits that contribute to overall development and well-being. Here are five key benefits: Economic Growth: Textile companies are significant contributors to the national economy, generating employment opportunities and fostering economic growth. These companies create jobs at various levels, from skilled labor in manufacturing to management and marketing roles. Additionally, this sector often involves ancillary industries, further boosting economic activities and income generation. Export Earnings: These companies contribute substantially to a country’s export earnings. With a strong presence in the global market, these companies export textiles and apparel to various countries, generating foreign exchange and strengthening the balance of trade. Sustainable Development: Many companies are adopting sustainable practices, such as recycling, water conservation, and the use of eco-friendly materials. By embracing sustainable manufacturing processes, these companies reduce their environmental impact and contribute to the goal of sustainable development. Fashion and Style: These companies play a crucial role in shaping fashion trends and providing consumers with a wide array of apparel options. Through continuous innovation and creativity, these companies cater to diverse consumer preferences and contribute to the evolving fashion industry. Social Impact: These companies often engage in corporate social responsibility (CSR) initiatives, supporting community development, education, healthcare, and environmental conservation. By actively participating in social programs, these companies positively impact the lives of people in the communities they operate in, fostering goodwill and social progress. In conclusion, these companies are essential drivers of economic growth, export earnings, sustainable development, fashion innovation, and social impact. Their contributions go beyond business profits, extending to societal progress and environmental stewardship, making them valuable players in the global marketplace. Here we will explore the top 10 best textile companies in India in 2024, based on their reputation, market presence, product quality, and contribution to the industry. Reliance Industries Limited (RIL): Reliance Industries Limited (RIL) stands as one of India’s largest and most diversified conglomerates, with a significant presence in the industry through its subsidiary, Reliance Textiles. Established in 1973 by visionary entrepreneur Dhirubhai Ambani, RIL has grown into a global powerhouse, operating across various sectors, including petrochemicals, refining, telecommunications, and retail. In this segment, RIL has demonstrated a strong commitment to innovation, sustainability, and product quality. The company is a leading manufacturer of synthetic fibers, yarns, fabrics, and home textiles, catering to both domestic and international markets. RIL’s textile division is equipped with state-of-the-art facilities and a robust supply chain, ensuring efficiency and reliability. With a focus on research and development, RIL constantly seeks to introduce new and eco-friendly textiles, meeting the evolving demands of consumers. Additionally, the company emphasizes sustainable practices, minimizing environmental impact, and promoting responsible manufacturing processes. As a flagship entity of the Reliance Group, RIL’s textile business contributes significantly to the conglomerate’s overall success and helps bolster India’s position in the global industry. Through continuous innovation, strategic expansion, and unwavering commitment to excellence, RIL remains a dominant force in the Indian textile landscape. Aditya Birla Fashion and Retail (ABFRL): Aditya Birla Fashion and Retail (ABFRL) is a prominent player in India’s fashion and textile industry, operating as a subsidiary of the Aditya Birla Group. Established in 2007, ABFRL has emerged as a leading fashion conglomerate with a diverse portfolio of well-known brands catering to various consumer segments. The company boasts an impressive array of fashion labels, including Allen Solly, Van Heusen, Peter England, Pantaloons, and many others. These brands offer a wide range of apparel, footwear, and accessories, covering both formal and casual wear. ABFRL’s success lies in its ability to stay ahead of fashion trends, providing consumers with innovative and trendy designs. The company maintains a strong retail presence through exclusive brand outlets, multi-brand stores, and online platforms, ensuring accessibility to customers across the country. Moreover, ABFRL emphasizes sustainability and ethical practices in its supply chain, aligning with the global shift toward responsible fashion. This commitment to sustainability strengthens ABFRL’s reputation as a socially conscious and environmentally responsible fashion player. With its vast brand portfolio, retail expertise, and commitment to fashion innovation and sustainability, ABFRL continues to hold a prominent position in India’s fashion industry, shaping trends and meeting the ever-changing demands of fashion-conscious consumers. Arvind Limited: Arvind Limited, established in 1931, is a well-established and respected name in India’s apparel industry. With a rich legacy of nearly a century, Arvind Limited has evolved into a diversified conglomerate with a strong focus on textile manufacturing, denim production, and retail. The company is renowned for its expertise in denim manufacturing, catering to both domestic and international markets. Arvind Limited’s denim division is known for its high-quality products, cutting-edge technology, and innovative designs, making it a preferred choice for leading global fashion brands. Arvind Limited also holds a significant presence in the retail segment with a portfolio of popular brands like Flying Machine, Arrow, and US Polo Assn. The company operates a vast retail network, providing consumers with a wide range of fashionable apparel options. With a keen eye on sustainability, Arvind Limited has undertaken various eco-friendly initiatives, promoting water conservation, renewable energy, and responsible sourcing. These efforts have earned the company accolades for its commitment to environmental stewardship. Arvind Limited’s relentless pursuit of excellence, coupled with its commitment to innovation and sustainability, cements its position as one of the leading players in India’s apparel industry. With a customer-centric approach and a strong focus on quality, the company continues to drive growth and maintain its reputation as a trusted and reliable textile brand. Welspun India Limited: Welspun India Limited is a leading player in the home textiles segment, known for its exceptional quality and innovative products. Established in 1985, the company has earned a reputation as a global leader in home textiles, catering to renowned international brands and retailers. Welspun India’s product portfolio includes a diverse range of home textile products, such as bed linens, bath linens, rugs, and carpets. The company’s commitment to cutting-edge technology and design has allowed it to deliver premium and sustainable products that meet the evolving needs of customers worldwide. With a strong focus on sustainability, Welspun India is committed to environmentally responsible practices. The company has implemented various initiatives, including water and energy conservation, waste reduction, and responsible sourcing of raw materials. Welspun India’s vertical integration and robust supply chain ensure efficiency and quality throughout the manufacturing process. Its dedication to customer satisfaction and innovation has helped the company maintain a competitive edge in the home textiles market. As a trailblazer in the industry, Welspun India continues to be recognized for its premium products, sustainability efforts, and global reach, solidifying its position as a leading home textiles player in India and beyond. Vardhman Textiles Limited: Vardhman Textiles Limited is a well-established and reputed player in India’s textile industry, with a rich history dating back to 1962. Over the years, Vardhman Textiles has evolved into a vertically integrated conglomerate, encompassing various segments, including yarn, fabric, sewing thread, and garments. The company’s robust manufacturing capabilities, state-of-the-art technology, and focus on innovation have positioned it as a leading supplier of high-quality textiles to domestic and international markets. Vardhman Textiles is recognized for its commitment to excellence, timely deliveries, and customer-centric approach. With a diverse product portfolio, Vardhman Textiles caters to various industries, including apparel, home furnishings, and industrial applications. The company’s products are known for their consistency, durability, and sustainability. Vardhman Textiles places a strong emphasis on sustainable practices and social responsibility. The company actively promotes eco-friendly initiatives, waste reduction, and community development programs, making it a socially conscious and environmentally responsible player. With a solid reputation for quality, reliability, and customer satisfaction, Vardhman Textiles Limited continues to hold a significant position in India’s textile industry, contributing to the growth and success of the country’s textile sector. Raymond Limited: Raymond Limited, established in 1925, is a well-known and iconic name in India’s apparel industry. With a legacy spanning nearly a century, Raymond has become synonymous with quality fabrics and fine craftsmanship. The company is a leading manufacturer of premium suiting fabrics, catering to a discerning customer base both in India and abroad. Raymond’s suiting fabrics are renowned for their elegance, comfort, and impeccable finish, making them a preferred choice for those seeking sophisticated attire. In addition to suiting fabrics, Raymond also offers a diverse range of apparel, including ready-to-wear garments under brands like Park Avenue, ColorPlus, and Parx. The company’s fashion-forward designs and attention to detail have earned it a strong presence in the retail market. Raymond is also known for its commitment to sustainability and social responsibility. The company’s efforts in water conservation, energy efficiency, and waste reduction align with its ethos of responsible manufacturing. With its dedication to craftsmanship, innovation, and sustainable practices, Raymond Limited continues to be a respected and trusted name in India’s apparel industry, upholding its legacy of delivering quality and style to generations of customers. Trident Limited: Trident Limited, established in 1990, is a prominent player in India’s textile and home textile industry. The company is renowned for its expertise in manufacturing a wide range of home textile products, including towels, bed sheets, bathrobes, and rugs. Trident’s home products are known for their superior quality, luxurious feel, and elegant designs, catering to both domestic and international markets. The company’s state-of-the-art manufacturing facilities and advanced technology ensure that its products meet global standards of excellence. Apart from home textiles, Trident Limited also has a significant presence in the yarn and paper segments, adding to its diversified portfolio. The company’s focus on continuous innovation, research, and development has enabled it to remain at the forefront of the industry. Trident Limited places a strong emphasis on sustainability and social responsibility, implementing various eco-friendly initiatives and community development programs. With a commitment to excellence, quality, and sustainability, Trident Limited continues to thrive as a leading player in India’s home textile sector, serving as a benchmark for high-quality and luxurious home textiles. Sutlej Textiles and Industries Limited: Sutlej Textiles and Industries Limited, established in 2005, is a prominent and diversified player in India’s textile industry. The company specializes in manufacturing a wide range of products, including synthetic yarns, and technical textiles. Sutlej Textiles’ yarn division is known for its high-quality synthetic yarns, catering to various industries, including apparel, automotive, and home furnishings. The company’s advanced manufacturing facilities and strict quality control ensure consistent and reliable products. In the home textiles segment, Sutlej Textiles offers a diverse range of products, including bed linens, curtains, and towels. The company’s home textiles are favored for their innovative designs, durability, and softness, appealing to consumers globally. Moreover, Sutlej Textiles also produces technical textiles, serving industries such as automotive, filtration, and geotextiles. The company’s technical textiles are engineered to meet specific performance requirements, making them a preferred choice for various applications. Sutlej Textiles’ commitment to sustainability and environmental stewardship is evident through its eco-friendly practices and responsible sourcing of raw materials. With its diverse product offerings, technological expertise, and focus on sustainability, Sutlej Textiles, and Industries Limited continues to be a significant player in India’s textile industry, contributing to the nation’s economic growth and exports. Grasim Industries Limited: Grasim Industries Limited, a part of the Aditya Birla Group, is a leading player in India’s textile and fashion industry. Established in 1947, Grasim Industries has evolved into a diversified conglomerate with a strong presence in various sectors, including textiles, cement, chemicals, and more. In this segment, Grasim Industries is renowned for its diverse range of fabrics and apparel brands. The company’s division caters to both domestic and international markets, offering a wide array of high-quality textiles, including suiting fabrics, shirting fabrics, and dress materials. Grasim Industries also boasts a portfolio of popular apparel brands such as Grasim, Linen Club, and Van Heusen. These brands are synonymous with style, sophistication, and quality, catering to fashion-conscious consumers. The company’s focus on sustainable practices and responsible manufacturing further enhances its reputation as an environmentally conscious player. Grasim Industries actively promotes eco-friendly initiatives and is committed to reducing its carbon footprint. With a strong legacy, commitment to quality, and sustainable practices, Grasim Industries Limited continues to be a trusted and respected name in India’s textile industry, upholding the values of the Aditya Birla Group and contributing to the nation’s economic growth and fashion landscape. KPR Mill Limited: KPR Mill Limited, founded in 1984, is a leading integrated textile company in India. The company has established itself as a prominent player in the industry, specializing in the manufacturing of yarn, fabric, and ready-to-wear garments. KPR Mill’s yarn division is known for its high-quality and eco-friendly yarn products, catering to both domestic and international markets. The company’s state-of-the-art spinning mills ensure the production of consistent and premium-quality yarn. In addition to yarn, KPR Mill has a strong presence in the fabric segment. The company offers a diverse range of fabrics, including denim, knitted, and woven fabrics, meeting the demands of various industries and consumers. KPR Mill’s garment division produces a wide range of ready-to-wear apparel, known for its fashionable designs, comfort, and durability. The company’s garment division serves both domestic and international markets, offering a variety of products for men, women, and children. The company’s commitment to sustainability is evident through its eco-friendly practices, water conservation, and energy-efficient manufacturing processes. With a strong focus on quality, sustainability, and innovation, KPR Mill Limited continues to be a major player in the industry, contributing to the nation’s textile exports and reinforcing its position as a trusted and reliable textile brand. Conclusion: The Indian textile industry is poised for significant growth in 2024, and these top 10 best textile companies play a crucial role in shaping the sector’s future. Through their commitment to quality, innovation, and sustainability, these companies have established themselves as leaders in the Indian textile market, catering to both domestic and international customers. As the industry continues to evolve and embrace new technologies, these companies will likely remain at the forefront of the textile sector, driving its progress and success in the years to come.","filter_flag":1}
{"title":"Top 10 Best Food Production Companies In India 2024 - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvZm9vZC1wcm9kdWN0aW9uLTIwMjQv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvZm9vZC1wcm9kdWN0aW9uLTIwMjQv0gEA?oc=5","id":"CBMiOGh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvZm9vZC1wcm9kdWN0aW9uLTIwMjQv0gEA","guidislink":false,"published":"Thu, 16 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=16, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=320, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvZm9vZC1wcm9kdWN0aW9uLTIwMjQv0gEA?oc=5\" target=\"_blank\">Top 10 Best Food Production Companies In India 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 10 Best Food Production Companies In India 2024 - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvZm9vZC1wcm9kdWN0aW9uLTIwMjQv0gEA?oc=5\" target=\"_blank\">Top 10 Best Food Production Companies In India 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"India, a land known for its diverse cuisine and rich culinary traditions, is witnessing remarkable growth in the food production industry. In 2024, the country is set to showcase a thriving ecosystem of food production companies that have captured the hearts and taste buds of millions. From household names that have been serving generations to emerging players revolutionizing the market with innovative offerings, the Indian food production sector is brimming with talent, creativity, and unwavering commitment to quality. This food production blog takes you on a delectable journey through the top 10 food production companies in India, shining a spotlight on their remarkable achievements, exceptional product ranges, and their impact on the ever-evolving Indian food landscape. Each food production company has carved a unique niche for itself, leveraging innovation, technology, and an understanding of consumer preferences to create an indelible mark in the industry. These food production companies not only cater to the vast domestic market but also export their culinary delights to various corners of the globe, proudly representing the diverse flavors and tastes of India. Their products range from traditional staples to contemporary gourmet offerings, encompassing everything from spices, grains, and pulses to snacks, dairy products, and ready-to-eat meals. As we delve into the profiles of these food production companies, you will discover their remarkable journeys, the philosophy driving their success, and the various factors that have propelled them to the top of the food production industry in India. Whether you are a food enthusiast, a discerning consumer, or simply curious about the fascinating world of food production, this blog is your gateway to exploring the culinary treasures and trailblazers that define the Indian food landscape in 2024. So fasten your seatbelts, prepare your taste buds, and get ready for an appetizing adventure! 1. Nestlé India Nestlé India, one of the leading food production companies in India, continues to hold its prominent position in 2024. With a legacy of over a century, Nestlé India has established itself as a trusted brand in the country’s food and beverage industry. The company’s commitment to quality, innovation, and consumer satisfaction has propelled its success over the years. Nestlé India boasts a diverse product portfolio that caters to various consumer preferences and dietary needs. From dairy products such as milk, yogurt, and cheese to culinary products like noodles, sauces, and soups, Nestlé India offers a wide range of choices for Indian consumers. The company’s popular brands like Maggi, Nescafé, KitKat, and Nestlé Milkmaid have become household names, enjoying immense popularity and loyalty among consumers. In line with changing consumer preferences, Nestlé India has been focusing on developing healthier and more sustainable food options. The company has made significant strides in fortifying its products with essential nutrients, reducing sodium and sugar content, and incorporating locally sourced ingredients. This commitment to nutrition and sustainability has helped Nestlé India stay relevant in a rapidly evolving market. 2. Hindustan Unilever In 2024, one of the top food production companies in India continues to be Hindustan Unilever Limited (HUL). HUL is a renowned conglomerate with a rich history and a strong presence in the Indian market. The company has established itself as a trusted name in the food industry by consistently delivering high-quality products that cater to the diverse tastes and preferences of Indian consumers. HUL boasts an extensive portfolio of food brands that have become household names across the country. From packaged foods to culinary aids, their offerings cover a wide range of categories. Popular brands under the HUL umbrella include Knorr, Kissan, Annapurna, and Kwality Wall’s, which are known for their superior quality and taste. The company’s commitment to innovation and consumer-centric approach has been key to its success. HUL constantly strives to introduce new products that align with evolving consumer needs and preferences. With a strong focus on health and wellness, the company has also made significant efforts to enhance the nutritional value of its products by incorporating healthier ingredients and reducing the use of artificial additives. In addition to its product range, HUL has also established a robust distribution network that enables its products to reach every nook and corner of the country. This widespread presence has contributed to the company’s strong market position and popularity among consumers. Furthermore, HUL actively engages in sustainability initiatives and has made notable progress in areas such as responsible sourcing, waste reduction, and environmental conservation. Such efforts have not only strengthened the company’s reputation but also resonate with consumers who prioritize ethical and sustainable practices. 3. ITC Limited In 2024, one of the top food production companies in India continues to be ITC Limited. Established in 1910, ITC has emerged as a major player in the Indian food industry, renowned for its diverse range of products and commitment to quality. With its wide presence across the country, ITC Limited has established a strong foothold in various food segments, catering to the diverse tastes and preferences of Indian consumers. ITC Limited’s food division encompasses multiple popular brands that have become household names. From packaged snacks like Bingo! and Yippee noodles to staple foods like Aashirvaad atta and Sunfeast biscuits, ITC offers a comprehensive portfolio of food products. The company’s commitment to innovation and consumer-centricity has enabled it to introduce new and exciting offerings that resonate with the changing needs of the Indian market. Furthermore, ITC Limited is known for its emphasis on sustainable and responsible practices in its food production operations. The company has made significant strides in adopting environmentally friendly practices and sourcing ingredients from local farmers, thereby supporting rural communities. ITC’s commitment to sustainable agriculture and responsible sourcing has not only contributed to its success but also earned it accolades as a socially responsible corporation. 4. Parle Products As of 2024, Parle Products stands as one of the top food production companies in India, with a rich legacy and a strong foothold in the market. Parle Products has been a trusted name for decades, known for its wide range of quality food products that cater to diverse consumer preferences. Established in 1929, Parle Products has continuously evolved and expanded its product portfolio, making it a household name across India. The company offers a plethora of popular and beloved brands, including Parle-G, KrackJack, Monaco, Hide & Seek, and many more. These brands have become synonymous with taste, quality, and affordability, resonating with consumers of all age groups. One of the key factors contributing to Parle Products’ success is its unwavering commitment to maintaining high-quality standards. The company uses advanced manufacturing techniques and adheres to stringent quality control measures, ensuring that its products meet the highest levels of safety and consistency. Parle Products has also demonstrated a strong emphasis on innovation, regularly introducing new flavors, variants, and packaging designs to keep up with changing consumer preferences. Furthermore, Parle Products has a robust distribution network that reaches even the most remote corners of the country. Its widespread availability and competitive pricing have helped the company capture a significant market share, making it a dominant player in the Indian food production industry. 5. Amul Amul, a prominent brand in the Indian food industry, continues to be one of the top food production companies in India in 2024. With a rich legacy dating back to 1946, Amul has carved a niche for itself as a trusted and preferred choice for dairy products across the country. As a cooperative society, Amul represents millions of farmers, making it a symbol of rural empowerment and self-sufficiency. Amul’s success can be attributed to its strong commitment to quality, innovation, and customer satisfaction. The company operates an extensive network of milk collection centers, ensuring a steady supply of high-quality milk from dairy farmers across India. This strong sourcing capability has enabled Amul to maintain its position as the leading producer of dairy products in the country. In addition to its flagship product, Amul Butter, the company offers a diverse range of products including milk, cheese, ice cream, yogurt, and infant nutrition products. Amul’s product portfolio caters to the varying tastes and preferences of consumers, from traditional dairy products to contemporary offerings. Amul’s success can also be attributed to its effective marketing strategies. The iconic “Amul Girl” advertising campaign, featuring witty and thought-provoking advertisements, has become an integral part of India’s popular culture. This campaign has helped Amul establish a strong brand identity and connect with consumers across different age groups. 6. Britannia Industries In 2024, Britannia Industries continues to establish itself as one of the top food production companies in India. With a rich history dating back to 1892, Britannia has consistently delivered high-quality food products and built a strong reputation among consumers. As a leading player in the Indian food industry, Britannia offers a wide range of products that cater to diverse consumer preferences. From biscuits and cakes to dairy products and bread, Britannia has successfully captured the taste buds of millions across the country. The company’s commitment to innovation and product development has allowed it to stay ahead of the competition and maintain its market leadership. Britannia Industries places great emphasis on quality control and food safety, ensuring that each product meets the highest standards. This dedication to quality has earned the trust and loyalty of consumers, making Britannia a household name in India. Additionally, the company’s focus on sustainability and responsible sourcing further enhances its reputation among environmentally conscious consumers. 7. PepsiCo India In 2024, PepsiCo India continues to be one of the top food production companies in India. With a strong presence and a diverse range of products, PepsiCo India has established itself as a leading player in the Indian food industry. The company is known for its commitment to quality, innovation, and sustainability. PepsiCo India offers a wide array of popular food and beverage brands that cater to the diverse tastes and preferences of the Indian market. Its product portfolio includes iconic brands such as Lay’s, Kurkure, Doritos, Tropicana, Quaker, and Pepsi, among others. These brands have gained immense popularity among consumers and have become household names in the country. One of the key factors contributing to PepsiCo India’s success is its focus on innovation. The company constantly strives to introduce new and exciting products that appeal to the evolving consumer demands. It invests in research and development to develop healthier and more sustainable options, ensuring that it stays ahead in the market. PepsiCo India is also actively engaged in promoting sustainable practices throughout its value chain. It has implemented initiatives to conserve water, reduce greenhouse gas emissions, and promote responsible sourcing of raw materials. The company’s commitment to sustainability aligns with the growing environmental consciousness among consumers, making it a preferred choice for those seeking environmentally friendly food options. 8. Dabur India Dabur India Limited, founded in 1884, is one of the leading food production companies in India. With over a century of experience in the market, Dabur has established itself as a household name and a trusted brand. In 2024, Dabur continues to be a prominent player in the Indian food industry, known for its wide range of high-quality products and commitment to health and wellness. Dabur offers an extensive portfolio of food products that cater to diverse consumer preferences. From juices and beverages to culinary pastes and cooking oils, Dabur ensures that its offerings are not only delicious but also nutritious. The company emphasizes the use of natural ingredients and traditional recipes, which resonates with health-conscious consumers. One of Dabur’s standout products is its Real fruit juices, which are made from 100% real fruit and contain no added preservatives. These juices have gained immense popularity for their authentic taste and health benefits. Dabur has also ventured into the organic food segment, offering a range of organic honey, spices, and other products to cater to the growing demand for organic and sustainable options. 9. ITC Foods ITC Foods is one of the top food production companies in India, continuing to maintain its position in 2024. Known for its diverse range of food products, ITC Foods has been catering to the taste buds of millions of consumers across the country. The company has established a strong presence in various food segments, including snacks, biscuits, instant noodles, ready-to-eat meals, and beverages. One of the key factors contributing to ITC Foods’ success is its commitment to quality and innovation. The company emphasizes stringent quality control measures and constantly introduces new and exciting products to keep up with changing consumer preferences. With a dedicated team of research and development professionals, ITC Foods focuses on creating unique flavors and healthy options to meet the evolving needs of its customers. ITC Foods has also been at the forefront of sustainability and social responsibility. The company actively supports local farmers and sources ingredients from sustainable and environmentally friendly sources. ITC Foods’ responsible sourcing practices not only ensure the quality of its products but also contribute to the overall development of rural communities. In addition to its focus on quality and sustainability, ITC Foods has a robust distribution network that reaches every nook and corner of the country. The company’s products are available in a wide range of retail outlets, including supermarkets, convenience stores, and online platforms, ensuring easy accessibility for consumers. 10. Patanjali Ayurved In 2024, one of the leading food production companies in India is expected to be Patanjali Ayurved. Founded by Baba Ramdev and Acharya Balkrishna, Patanjali Ayurved has gained immense popularity and established a strong presence in the Indian market over the years. Known for its emphasis on natural and ayurvedic products, the company has successfully tapped into the growing demand for healthy and organic food options. Patanjali Ayurveda offers a wide range of food products, including staples like rice, wheat flour, pulses, and spices, as well as snacks, beverages, and dairy products. The company prides itself on utilizing traditional methods of preparation and sourcing ingredients from organic farms across India. This commitment to quality and authenticity has earned the trust and loyalty of millions of consumers. Furthermore, Patanjali Ayurved’s aggressive marketing strategies, coupled with competitive pricing, have played a significant role in its success. The company has effectively leveraged its association with yoga guru Baba Ramdev to promote its products and reach a wider audience. In addition, Patanjali Ayurved has expanded its distribution network, making its products easily accessible across urban and rural areas. Conclusion In conclusion, the food production industry in India is experiencing significant growth and transformation, with several top companies leading the way in providing quality, diverse, and innovative food products. The top 10 food production companies in India in 2024 reflect the changing preferences and demands of consumers, who are increasingly seeking healthy, organic, and sustainable options. These food production companies have successfully adapted to the evolving market trends and have established themselves as key players in the industry. They have achieved this through a combination of factors, including strong brand presence, extensive distribution networks, robust quality control measures, and innovative product development. The top 10 food production companies in India in 2024 are not only catering to the domestic market but are also expanding their presence globally, showcasing the country’s potential in the food industry on a global scale. Their commitment to quality, authenticity, and affordability has earned them the trust and loyalty of consumers.","filter_flag":1}
