{"title":"Can Semiconductor Chips be Recycled?","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d1bda2f48db95a69a0980dbfc18&url=https%3a%2f%2fwww.azonano.com%2farticle.aspx%3fArticleID%3d6764&c=7769358327941345376&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d1bda2f48db95a69a0980dbfc18&url=https%3a%2f%2fwww.azonano.com%2farticle.aspx%3fArticleID%3d6764&c=7769358327941345376&mkt=en-us","summary":"Advancements in semiconductor recycling aim to reduce e-waste and environmental impact, with innovative separation and recovery techniques.","published":"Mon, 24 Jun 2024 04:38:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=24, tm_hour=4, tm_min=38, tm_sec=0, tm_wday=0, tm_yday=176, tm_isdst=0)","news_source":"AZoNano","news_image":"http:\/\/www.bing.com\/th?id=OVFT.l676XgKzjebEGMZfjA2yuy&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700,"news_imagemaxheight":314,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Can Semiconductor Chips be Recycled?","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Advancements in semiconductor recycling aim to reduce e-waste and environmental impact, with innovative separation and recovery techniques.","query":"https:\/\/www.bing.com\/news\/search?q=\"Recycling Practices\" \"new products\"&format=rss","text":"Semiconductor chips, made primarily from silicon or germanium, are tiny electronic devices that form the basic building blocks of most electronic circuits. These chips power devices ranging from smartphones to computers and enable functionalities like GPS, smart cards, and data communications.1 Image Credit: jiang jie feng\/Shutterstock.com Innovative methods, such as open-loop recycling and integrated circuit reuse, have been developed to minimize environmental impact and optimize resource use. These advancements highlight the crucial role of recycling in sustaining the growth of the semiconductor industry and ensuring environmental protection. Semiconductor Chips in Modern Technology As semiconductor chips become more integral to modern technology, concerns over electronic waste (e-waste) grow due to the environmental and health risks posed by toxic materials. Recycling e-waste, including semiconductors, is essential for mitigating these risks, offering sustainable solutions like refurbishment, reuse, and material recovery.2,3 However, recycling semiconductors presents unique challenges due to their complex composition, requiring innovative approaches in both design and infrastructure.4 The semiconductor industry is at a critical point where advancements in recycling technologies and increased eco-conscious consumer demand drive the need for sustainable practices and regulatory compliance. From stringent laws to eco-friendly manufacturing initiatives, the journey towards semiconductor circularity involves both environmental stewardship and technological innovation.5,6 Environmental Risks Posed by the Semiconductor Industry The semiconductor industry has substantial environmental impacts throughout its lifecycle, from manufacturing to disposal.7 Research highlights high energy consumption, water usage, and greenhouse gas emissions, particularly with nanoscale integrated circuits that escalate resource usage.8 Hazardous chemicals employed in manufacturing pose health risks for workers, amplifying occupational safety concerns. Improper disposal further compounds these issues, as semiconductor chips in landfills can leach toxic substances into ecosystems, endangering both wildlife and human health.2 The complexity of semiconductor recycling compounds these challenges. Although strides are being made in sustainable manufacturing practices and recycling infrastructure, achieving circularity remains a significant task.9 Designing for recyclability and implementing efficient recycling methods are critical steps toward mitigating environmental impacts. Regulatory measures and consumer demand for eco-conscious products further compel semiconductor manufacturers to prioritize sustainability.5 Collaborative efforts between industry, academia, and policymakers are essential for fostering innovation and implementing sustainable practices.5 Through collective action, the semiconductor industry can minimize its ecological footprint while continuing to drive technological advancement. Current Recycling Techniques Current recycling techniques for semiconductor chips aim to maximize resource recovery while minimizing environmental impact. Methods such as direct ionic vaporization delicately reclaim semiconductor workpieces while preserving substrate purity and enabling the removal of unsuccessful conductive columns and layers.10,11 Techniques for recycling semiconductor packages on circuit boards involve polishing, solder ball removal, and the formation of new solder balls on a gold plating layer.12 Innovative recycling devices, such as those employing breaking treatments and detection mechanisms, efficiently separate semiconductors in products, streamlining the recycling process.4 Additionally, open-loop recycling, a process where materials are recycled into new products of lower quality, and integrated circuit reuse, which involves repurposing chips for other applications, offer promising avenues for maximizing resource utilization.13,14 Concurrent advancements in electronics design prioritize recyclability, with manufacturers increasingly incorporating sustainable materials and processes into semiconductor production. Case studies like Samsung's recycled semiconductor trays and Infineon's greenhouse gas reduction plans underscore the industry's commitment to sustainability. However, challenges persist, demanding ongoing research and investment to realize semiconductor circularity.15.16 As regulations tighten and consumer demand for eco-conscious products rises, the impetus for recycling innovation intensifies, positioning the semiconductor industry on the cusp of a greener future. Innovations in Recycling Technology Innovations in recycling technology within the semiconductor industry are critical for achieving sustainability and circular economy goals. Researchers have developed advanced recycling devices that efficiently separate semiconductors within products.4 Furthermore, the utilization of self-reducing briquettes derived from steel sludge in cupola furnace charge has been explored, emphasizing the vital role of minimizing CO2 emissions through recycling.17 In developing countries, innovative techniques for managing solid waste, including recycling and composting, promise significant breakthroughs in waste reduction and the creation of valuable products. These strides contribute to reducing waste volume and greenhouse gas emissions while offering new economic opportunities through sustainable recycling practices. As consumer demand for eco-conscious products grows and global regulations on electronics sustainability tighten, semiconductor manufacturers must invest in research to drive recycling innovations forward.6 The rapid advancement in recycling technologies and electronics design, coupled with consumer demand and regulatory pressures, brings the goal of recycled semiconductors increasingly within reach. More from AZoNano: Nanowires: Definition, Properties, and Applications References and Further Reading [1] Shuchen, H., et al. (2023) Assessing the contribution of semiconductors to the sustainable development goals (SDGs) from 2017 to 2022. Heliyon. doi: 10.1016\/j.heliyon.2023.e21306 [2] Xianglan, Z., et al. (2023) Emission and occupational health risk assessment of harmful contaminants in various processes in a typical semiconductor manufacturing industry building. Indoor and Built Environment. doi: 10.1177\/1420326X231161807. [3] Qi, W., et al. (2023) Environmental data and facts in the semiconductor manufacturing industry: An unexpected high water and energy consumption situation. Water Cycle. doi: 10.1016\/j.watcyc.2023.01.004. [4] Nazia, P., et al. (2020) Innovations in Recycling for Sustainable Management of Solid Wastes. Innovative Wate Management Technologies for Sustainable Development. doi: 10.4018\/978-1-7998-0031-6.ch010. [5] Mélanie, D., et al. (2021) Achieving Circular and Efficient Production Systems: Emerging Challenges from Industrial Cases. Advances in Production Management Systems. doi: 10.1007\/978-3-030-85910-7_55. [6] José, A., et al. (2021) Recycling Technology Innovation as a Source of Competitive Advantage: The Sustainable and Circular Business Model of a Bicentennial Company. Sustainability. doi: 10.3390\/su13147723. [7] Sunbal, S., et al. (2019) History and Major Types of Pollutants in Electronic Waste Recycling. Electronic Waste Production. doi: 10.1007\/978-3-030-26615-8_1. [8] Eleanor, M., et al. (2021) Green Nanofabrication Opportunities in the Semiconductor Industry: A Life Cycle Perspective. Nanomaterials. doi: 10.3390\/nano11051085. [9] Veena, S., et al. (2023) Rethinking circular economy for electronics, energy storage, and solar photovoltaics with long product life cycles. MRS Bull. doi: 10.1557\/s43577-023-00519-2. [10] Zheng, G., et al. (2021) Layer-Scale and Chip-Scale Transfer Techniques for Functional Devices and Systems: A Review. Nanomaterials. doi: 10.3390\/nano11040842. [11] Beers, A., et al. (2024) Reclamation and recycling of semiconductor workpieces. [Online] Justia. Available at: https:\/\/patents.justia.com\/inventor\/andrew-beers [12] Bingbing, W. (2017) Review of solid state recycling of aluminum chips. Resour Conserv Recycl. doi: 10.1016\/j.resconrec.2017.06.004. [13] Katrina, K., et al. (2023) Circular plastics technologies: open loop recycling of waste plastics into new chemicals. Physical Sciences Reviews. doi: 10.1515\/psr-2022-0178. [14] Kwame, N., et al. (2023) Building Trust in Microelectronics: A Comprehensive Review of Current Techniques and Adoption Challenges. Electronics. doi: 10.3390\/electronics12224618. [15] Samsung. (2024) Samsung Semiconductor: technologies for a sustainable future. [Online] Samsung. Available at: https:\/\/semiconductor.samsung.com\/sustainability\/environment\/ [16] Infineon. (2024) Environmental sustainability and climate protection. [Online] Infineon. Available at: https:\/\/www.infineon.com\/cms\/en\/about-infineon\/sustainability\/Environmental-Sustainability-and-Climate-Protection\/gases\/ [17] Silvie, B., et al. (2019) Innovated Technologies of Recycling of Metallic Wastes – Modification of Existing Industrial Processes. New Trends in Production Engineering. doi: 10.2478\/ntpe-2019-0100. Disclaimer: The views expressed here are those of the author expressed in their private capacity and do not necessarily represent the views of AZoM.com Limited T\/A AZoNetwork the owner and operator of this website. This disclaimer forms part of the Terms and conditions of use of this website.","filter_flag":1}
{"title":"JOHNSON CONTROLS HITACHI AIR CONDITIONING MALAYSIA SDN BHD CELEBRATES 35 YEARS OF BUILDING A LEGACY IN MALAYSIA","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d1bda2f48db95a69a0980dbfc18&url=https%3a%2f%2ffinance.yahoo.com%2fnews%2fjohnson-controls-hitachi-air-conditioning-045200843.html&c=11656630323838262908&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d1bda2f48db95a69a0980dbfc18&url=https%3a%2f%2ffinance.yahoo.com%2fnews%2fjohnson-controls-hitachi-air-conditioning-045200843.html&c=11656630323838262908&mkt=en-us","summary":"Johnson Controls Hitachi Air Conditioning Malaysia Sdn Bhd, the leading manufacturer of Hitachi air conditioners, recently celebrated its 35th anniversary in Malaysia. The celebration at its ...","published":"Mon, 17 Jun 2024 21:52:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=17, tm_hour=21, tm_min=52, tm_sec=0, tm_wday=0, tm_yday=169, tm_isdst=0)","news_source":"YAHOO!Finance","news_image":"http:\/\/www.bing.com\/th?id=OVFT.unfOTtE9Z0Vyhxxe7hJdOi&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":400,"news_imagemaxheight":267,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"JOHNSON CONTROLS HITACHI AIR CONDITIONING MALAYSIA SDN BHD CELEBRATES 35 YEARS OF BUILDING A LEGACY IN MALAYSIA","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Johnson Controls Hitachi Air Conditioning Malaysia Sdn Bhd, the leading manufacturer of Hitachi air conditioners, recently celebrated its 35th anniversary in Malaysia. The celebration at its ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Recycling Practices\" \"new products\"&format=rss","text":"- Continuous development of new products and technology upgrades at the manufacturing factory in Bandar Baru Bangi BANDAR BARU BANGI, Malaysia, June 18, 2024 \/PRNewswire\/ -- Johnson Controls Hitachi Air Conditioning Malaysia Sdn Bhd, the leading manufacturer of Hitachi air conditioners, recently celebrated its 35th anniversary in Malaysia. The celebration at its manufacturing factory in Bandar Baru Bangi was attended by Yang Berbahagia Dato' Ts. Dr. Hj. Aminuddin Bin Hassim. Secretary General at the Ministry of Science, Technology and Innovation (MOSTI), and David W. Budzinski, President, Residential & Light Commercial Solutions, Johnson Controls and Chief Executive Officer, Johnson Controls-Hitachi Air Conditioning. Johnson Controls Hitachi Air Conditioning Malaysia Sdn Bhd, celebrated its 35th anniversary in Malaysia. The celebration at its manufacturing factory in Bandar Baru Bangi was attended by Yang Berbahagia Dato' Ts. Dr. Hj. Aminuddin Bin Hassim. Secretary General at the Ministry of Science, Technology and Innovation (MOSTI), and David W. Budzinski, President, Residential & Light Commercial Solutions, Johnson Controls and Chief Executive Officer, Johnson Controls-Hitachi Air Conditioning. Throughout its 35 years of manufacturing operations in Malaysia, Johnson Controls Hitachi Air Conditioning Malaysia Sdn Bhd has manufactured more than 15 million units with a diverse product portfolio of 2,900 models across multiple categories, including window, multi-splits, wall-mounted, ducted, and ceiling units. The manufacturing factory currently exports 99.5% of the Hitachi air conditioners to 39 locations across North America, Europe, Southeast Asia, Japan, Australia and New Zealand. Over the years, Johnson Controls Hitachi Air Conditioning Malaysia Sdn Bhd has continuously invested in new product development and technology upgrades, ensuring it is well-positioned to meet future industry needs. Budzinski said, \"For decades this facility has played a crucial role in contributing to the success of our high-quality air conditioning solutions worldwide. We remain dedicated to innovation and excellence and will continue to leverage our advanced technologies and sustainable practices to meet the evolving needs of our customers. We will move forward with the same spirit of excellence and commitment that has brought us to this milestone.\" Senthil Kumar Subramaniam, Managing Director of Johnson Controls Hitachi Air Conditioning Malaysia Sdn Bhd shared, \"Our Malaysian workforce is second to none, bringing incredible expertise and skill to the work while deepening our ties to the Malaysian community we've called home for the past 35 years. As we look toward the future, we see that their continued dedication and skill set will drive further growth and innovation. We remain committed to investing in technology and product development to remain a global air conditioning market leader.\" In 2024, Johnson Controls Hitachi Air Conditioning Malaysia Sdn Bhd launched the Construction Industry Development Board (CIDB) Certified Brazing Training and Assessment Facility Room, offering hands-on installation, safety and quality control training. This commitment to employee development and deep-rooted expertise translates into a significant advantage—the ability to consistently deliver high-quality products that meet stringent global standards. Story continues Sustainability, a Responsibility for the Future Johnson Controls Hitachi Air Conditioning Malaysia Sdn Bhd is also dedicated to minimising its environmental impact and contributing to a sustainable future. Johnson Controls-Hitachi Air Conditioning Malaysia Sdn Bhd is actively pursuing several initiatives, including a transition to environmentally friendly refrigerants. Other efforts include a goal of zero-landfill by implementing robust recycling practices and wastewater management treatment systems. Solar panel installation at Johnson Controls Hitachi Air Conditioning Malaysia Sdn Bhd is expected to be completed by end of year, generating 30% of electricity needs through solar power, reducing reliance on fossil fuels and lowering emissions. Innovation for the Future Johnson Controls Hitachi Air Conditioning Malaysia Sdn Bhd will continue innovating by developing new products that cater to changing regulations and market demands. The manufacturing factory in Malaysia has a full-fledged research and development centre and diagnosis centre for quality assurance, including a sound, electrical, and environmental testing room (ETR) that can simulate the cycle of four seasons. \"We are incredibly excited about the future,\" Senthil added. \"With our exceptional workforce, unwavering focus on sustainability and continuous product innovation, we are confident that Johnson Controls Hitachi Air Conditioning Malaysia Sdn Bhd will continue to be at the forefront of the air conditioning industry for years to come as our manufacturing factory is well-prepared to adapt to evolving regulations, with new products readily available to meet potential changes in the global market.\" Editor note: The entity in Malaysia is known as Johnson Controls Hitachi Air Conditioning Malaysia Sdn Bhd, while the global entity is known as Johnson Controls-Hitachi Air Conditioning. About Johnson Controls-Hitachi Air Conditioning Johnson Controls-Hitachi Air Conditioning is a global air conditioning manufacturer established in October 2015 as a joint venture between Johnson Controls and Hitachi Appliances, Inc. (now Hitachi Global Life Solutions, Inc.). Approximately 15,000 employees have offered high-quality residential and commercial products, services, and solutions to our customers. We have released the most diverse HVAC products in the global market including ductless solutions, chillers and residential air conditioning solutions that exceed customer expectations at all times. Cision View original content to download multimedia:https:\/\/www.prnewswire.com\/apac\/news-releases\/johnson-controls-hitachi-air-conditioning-malaysia-sdn-bhd-celebrates-35-years-of-building-a-legacy-in-malaysia-302175044.html SOURCE Johnson Controls-Hitachi Air Conditioning Malaysia","filter_flag":1}
