{"title":"Philips and sustainability at COP28 - News - Philips","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiuAFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMTEzMC1jb3AyOC10ZWFtaW5nLXVwLWZvci1zdXN0YWluYWJsZS1hbmQtYWNjZXNzaWJsZS1oZWFsdGhjYXJlLXdpdGgtcGFydG5lcnMtYWNyb3NzLXRoZS12YWx1ZS1jaGFpbi5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiuAFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMTEzMC1jb3AyOC10ZWFtaW5nLXVwLWZvci1zdXN0YWluYWJsZS1hbmQtYWNjZXNzaWJsZS1oZWFsdGhjYXJlLXdpdGgtcGFydG5lcnMtYWNyb3NzLXRoZS12YWx1ZS1jaGFpbi5odG1s0gEA?oc=5","id":"CBMiuAFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMTEzMC1jb3AyOC10ZWFtaW5nLXVwLWZvci1zdXN0YWluYWJsZS1hbmQtYWNjZXNzaWJsZS1oZWFsdGhjYXJlLXdpdGgtcGFydG5lcnMtYWNyb3NzLXRoZS12YWx1ZS1jaGFpbi5odG1s0gEA","guidislink":false,"published":"Thu, 30 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=30, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=334, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiuAFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMTEzMC1jb3AyOC10ZWFtaW5nLXVwLWZvci1zdXN0YWluYWJsZS1hbmQtYWNjZXNzaWJsZS1oZWFsdGhjYXJlLXdpdGgtcGFydG5lcnMtYWNyb3NzLXRoZS12YWx1ZS1jaGFpbi5odG1s0gEA?oc=5\" target=\"_blank\">Philips and sustainability at COP28 - News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philips<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Philips and sustainability at COP28 - News - Philips","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiuAFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMTEzMC1jb3AyOC10ZWFtaW5nLXVwLWZvci1zdXN0YWluYWJsZS1hbmQtYWNjZXNzaWJsZS1oZWFsdGhjYXJlLXdpdGgtcGFydG5lcnMtYWNyb3NzLXRoZS12YWx1ZS1jaGFpbi5odG1s0gEA?oc=5\" target=\"_blank\">Philips and sustainability at COP28 - News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philips<\/font>","source.href":"https:\/\/www.philips.com","source.title":"Philips","query":"https:\/\/news.google.com\/rss\/search?q=\"Improved energy efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"On December 3, COP28 will host its first ever dedicated Health Day, addressing growing and urgent worldwide concern about the impact of climate change on people’s health. In the run-up to COP28, we spoke with Robert Metzke, Global Head of Sustainability, on how Philips has continued to make steps to embed sustainability and climate action in healthcare delivery. With its Scope 1 (internal) and Scope 2 (energy sourcing) emissions firmly under control, the company has turned its sights on partnering to reduce its Scope 3 emissions – those beyond its direct control – to ensure end-to-end value chain sustainability. In early 2023, Philips became the first health technology company to have its entire value-chain CO₂ emissions reduction targets approved by the Science Based Targets initiative (SBTi). What is Philips’ focus at COP28? Robert Metzke: One of the best parts of my job is engaging with inspiring thinkers - from international organizations, governments, business companies and civil society - to learn from each other’s expertise, share our own experience, embrace new ways of thinking and operating, and galvanize shared action to tackle global challenges. Our focus at COP28 is extending our sustainability impact with the healthcare industry by engaging with governments and partner stakeholders. In the healthcare industry, there’s strong global momentum – a huge number of care providers recognize that they need to tackle their impact on the environment, in terms of both carbon emissions and beyond. In our conversations with hospitals, they tell us they want to commit to become carbon neutral. We can help them start and scale with our decades of experience, our in-house expertise, successful case studies and best practices. In healthcare, the main share of carbon emissions (71%) are indirect emissions caused by the production and transportation of goods and services that hospitals purchase, such as medicines, food, equipment, clothing, and waste treatment [1]. Reducing these is a big opportunity. The good news is that suppliers are also focused on this topic, where increasingly a combination of legislation, transparency, reporting pressure, and employees who prefer to work for sustainable companies is driving change. The critical part is the capability to act. Philips builds capabilities with its customer and suppliers, providing very practical help. What capabilities does Philips have to contribute the improving sustainability in healthcare? Robert: Underpinned by innovation, digitalization and collaboration, Philips’ efforts to drive sustainable healthcare are based on 1) Energy efficiency within the company’s own operations and across our product portfolio, with an added focus on reducing the amount of energy its products consume when in use; 2) Resource efficiency to maximize the value of our products and solutions over their lifetime, while minimizing material and resource use and reducing waste; 3) Care pathway optimization by co-creating new (digital and circular) health solutions that reduce healthcare’s carbon footprint and enable the delivery of quality care to those who need it, especially in medically underserved communities. What approaches is Philips taking to achieve its energy and resource efficiency goals? Robert: Since 2020 our global operation is carbon neutral, using 100% renewable electricity. We continue to build new partnerships for renewable electricity.” An example is the consortium led renewable energy power purchase agreements (PPAs) through which Philips and global brewing company HEINEKEN agreed to purchase the output of energy company Cero Generation’s new 70MW Pontinia agrivoltaic solar farm project in Lazio, Italy. The agricultural element of the project will also provide crop-growing experience and training to vulnerable and socially excluded people in the Lazio region. ","filter_flag":1}
{"title":"Apple 'Scary Fast' Mac Event: Revving Up the Tech World - Daily Investor Hub","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vZGFpbHlpbnZlc3Rvcmh1Yi5jb20vYXBwbGUtc2NhcnktZmFzdC1tYWMtZXZlbnQtcmV2dmluZy11cC10aGUtdGVjaC13b3JsZC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vZGFpbHlpbnZlc3Rvcmh1Yi5jb20vYXBwbGUtc2NhcnktZmFzdC1tYWMtZXZlbnQtcmV2dmluZy11cC10aGUtdGVjaC13b3JsZC_SAQA?oc=5","id":"CBMiUmh0dHBzOi8vZGFpbHlpbnZlc3Rvcmh1Yi5jb20vYXBwbGUtc2NhcnktZmFzdC1tYWMtZXZlbnQtcmV2dmluZy11cC10aGUtdGVjaC13b3JsZC_SAQA","guidislink":false,"published":"Wed, 01 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=305, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vZGFpbHlpbnZlc3Rvcmh1Yi5jb20vYXBwbGUtc2NhcnktZmFzdC1tYWMtZXZlbnQtcmV2dmluZy11cC10aGUtdGVjaC13b3JsZC_SAQA?oc=5\" target=\"_blank\">Apple 'Scary Fast' Mac Event: Revving Up the Tech World<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Daily Investor Hub<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Apple 'Scary Fast' Mac Event: Revving Up the Tech World - Daily Investor Hub","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vZGFpbHlpbnZlc3Rvcmh1Yi5jb20vYXBwbGUtc2NhcnktZmFzdC1tYWMtZXZlbnQtcmV2dmluZy11cC10aGUtdGVjaC13b3JsZC_SAQA?oc=5\" target=\"_blank\">Apple 'Scary Fast' Mac Event: Revving Up the Tech World<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Daily Investor Hub<\/font>","source.href":"https:\/\/dailyinvestorhub.com","source.title":"Daily Investor Hub","query":"https:\/\/news.google.com\/rss\/search?q=\"Improved energy efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Apple recently held its highly anticipated “Scary Fast” Mac event, where it unveiled its latest line of Mac products. The event, which was held online, showcased the company’s new M3 chips, which are said to offer significant improvements in performance and speed. Among the products unveiled at the event were the M3-equipped iMac, as well as the 14- and 16-inch MacBook Pro models that come with the M3 Pro and M3 Max chips. These new products are expected to be a major hit with consumers who are looking for high-performance computing devices that can handle even the most demanding tasks. The “Scary Fast” event was eagerly anticipated by Apple fans and industry experts alike, as it promised to showcase some of the most advanced computing technology available today. With the launch of these new products, Apple has once again cemented its position as a leader in the technology industry, offering cutting-edge devices that are sure to impress even the most discerning users. The ‘Scary Fast’ Mac Event On October 30, 2023, Apple held its highly anticipated ‘Scary Fast’ Mac event, where it unveiled its latest lineup of custom-made processors and new Mac models. The event was streamed online and attended by tech enthusiasts and industry insiders alike. One of the biggest announcements of the event was the introduction of the M3 chip, which promises to deliver unparalleled speed and performance. The M3 chip comes in three versions: M3, M3 Pro, and M3 Max, each designed to cater to different user needs. Apple also introduced the next-generation iMac and MacBook Pro models and iPhone 15 series, which are now even faster and more powerful than their predecessors. The new iMac comes equipped with the M3 chip and features a stunning 24-inch Retina display, while the MacBook Pro models come in 14-inch and 16-inch sizes and are available with either the M3 Pro or M3 Max chip. In addition to the hardware updates, Apple also announced several software updates, including the latest version of macOS, which is optimized to take full advantage of the M3 chip’s capabilities. The new macOS features improved performance, new security features, and enhanced compatibility with other Apple devices. Overall, the ‘Scary Fast’ Mac event was a huge success for Apple, showcasing the company’s commitment to innovation and excellence in the tech industry. With its latest lineup of Mac models and custom-made processors, Apple has once again raised the bar for performance and user experience. Key Announcements Apple’s ‘Scary Fast’ Mac event made headlines with several key announcements on October 30, 2023. The event showcased the latest products, including new MacBook Pro models, the M3 chip family, and an iMac powered by the M3 chip. Here are the key announcements from the event: New MacBook Pro Models Apple introduced the new 14- and 16-inch MacBook Pro models, which are equipped with the M3 Pro and M3 Max chips. The new MacBook Pro models feature a redesigned keyboard, a larger trackpad, and a high-resolution Retina display. The M3 chip family provides faster performance, improved battery life, and enhanced graphics capabilities. M3 Chip Family Apple also unveiled the M3 chip family, which includes the M3, M3 Pro, and M3 Max chips. The M3 chip family is designed to provide faster performance, improved battery life, and enhanced graphics capabilities. The M3 chip family is built on a 5nm process and features up to 32 CPU cores and up to 128 GPU cores. See also What is Artificial Intelligence, Features and Best Tools iMac with M3 Chip Apple also launched a new iMac powered by the M3 chip. The new iMac features a 27-inch Retina display, a redesigned keyboard, and a Magic Mouse. The M3 chip provides faster performance, improved battery life, and enhanced graphics capabilities. Overall, Apple’s ‘Scary Fast’ Mac event was a significant milestone in the company’s history. The new MacBook Pro models, M3 chip family, and iMac with M3 chip demonstrate Apple’s commitment to innovation and excellence in the technology industry. New Mac Models At the ‘Scary Fast’ Mac event, Apple unveiled several new Mac models. These models come with custom-made processors that are designed to deliver exceptional performance, speed, and efficiency. Here are some of the new Mac models that were announced: MacBook Pro Apple introduced two new MacBook Pro models – the 14-inch and 16-inch MacBook Pro. These models come with the M3 Pro and M3 Max chips, respectively. According to Apple, these chips are designed to deliver up to 50% faster CPU performance and up to 70% faster graphics performance than the previous generation. The MacBook Pro models also come with a new Liquid Retina XDR display that delivers stunning visuals and sharp text. Mac Mini The new Mac Mini is a compact desktop computer that is designed for power users and professionals. It comes with the M3 chip and can deliver up to 3x faster CPU performance and up to 6x faster graphics performance than the previous generation. The Mac Mini also features a new design with a magnetic power connector, two Thunderbolt 4 ports, and two USB 4 ports. iMac Apple also unveiled a new iMac model that comes with a 27-inch Retina 5K display. The iMac is powered by the M3 chip and can deliver up to 2x faster CPU performance and up to 4x faster graphics performance than the previous generation. The iMac also features a new design with a slim profile, a new Magic Keyboard with Touch ID, and a new Magic Mouse with Touch ID. Overall, the new Mac models are designed to deliver exceptional performance, speed, and efficiency. They come with custom-made processors that are optimized for specific tasks, and they feature sleek designs that are both functional and aesthetic. Whether you’re a professional, a power user, or a casual user, there’s a new Mac model that’s right for you. Performance Enhancements At Apple’s ‘Scary Fast’ Mac event, the company announced a range of performance enhancements to its line of Mac products. These improvements are designed to make Apple’s devices faster, more efficient, and more powerful than ever before. One of the most significant performance enhancements announced at the event is the introduction of the M3 chip family. This chip family is set to replace Intel chips in the next generation of MacBook Pro devices, continuing Apple’s trend of moving away from Intel technology. The M3 chip family promises to deliver faster performance, better battery life, and improved graphics capabilities. In addition to the M3 chip family, Apple also announced a range of other performance enhancements. These include improvements to the iMac’s cooling system, which should help to prevent the device from overheating during intensive tasks, and faster storage options for the Mac Pro. See also Artificial Intelligence: a new support for memory loss Overall, these performance enhancements should help to cement Apple’s position as a leading provider of high-performance computing devices. With faster, more efficient, and more powerful devices, Apple is well-positioned to meet the needs of professionals and power users who demand the very best from their computing hardware. Software Updates At the ‘Scary Fast’ Mac event, Apple announced several software updates that will be available for Macs. These updates include macOS Monterey, Final Cut Pro, and Logic Pro. macOS Monterey macOS Monterey is the latest version of the Mac operating system. It features a redesigned Safari browser, new Focus modes, and improved FaceTime capabilities. One of the most notable new features is Universal Control, which allows users to control multiple Apple devices with a single keyboard and mouse. Final Cut Pro Apple also announced updates to Final Cut Pro, its professional video editing software. The new version includes improved performance, new effects, and support for ProRes RAW files. Additionally, Final Cut Pro now includes a feature called Object Tracking, which allows users to track moving objects in their videos. Logic Pro Apple also announced updates to Logic Pro, its professional audio editing software. The new version includes several new features, including a redesigned interface, new effects, and support for Spatial Audio. Additionally, Logic Pro now includes a feature called Live Loops, which allows users to create music in a nonlinear, loop-based environment. Overall, these software updates demonstrate Apple’s commitment to providing powerful and innovative tools for creative professionals. Event Highlights Apple’s ‘Scary Fast’ Mac event was highly anticipated, and it did not disappoint. The event showcased several new products, including the M3-equipped iMac, 14- and 16-inch MacBook Pro models that come with the M3 Pro and M3 Max chips, and more. Here are some of the event highlights: M3 Chips The most significant announcement of the event was the introduction of the new M3 chips. Apple announced M3, M3 Pro, and M3 Max, which will be included in Apple’s new 24-inch iMac and MacBook Pros. These chips are custom-made by Apple and are designed to provide faster performance, better battery life, and improved graphics capabilities. iMac Apple also unveiled a new iMac with a larger display. The new iMac comes with a 30-inch display, which is significantly larger than the previous model’s 24-inch display. The new iMac also features a new design with thinner bezels and a more compact footprint. MacBook Pro Apple also introduced new MacBook Pro models with the M3 Pro and M3 Max chips. The new MacBook Pros come with a 14-inch and 16-inch display, with the latter being the largest display ever on a MacBook Pro. The new MacBook Pros also feature a new design with a flatter keyboard and thinner bezels. Other Announcements Apple also announced several other products at the event, including a new AirPods Pro with improved noise cancellation and a longer battery life. The company also announced a new version of its operating system, macOS Monterey, which includes several new features like Universal Control, which allows users to control multiple devices with a single mouse and keyboard. See also Meta announces a subscription to use Facebook and Instagram without ads in Europe Overall, Apple’s ‘Scary Fast’ Mac event was a significant success, with several new products and features that are sure to excite Apple fans. Future Implications The ‘Scary Fast’ Mac event has significant implications for the future of Apple’s hardware and software offerings. Here are some potential implications that could shape the company’s future direction: Increased Adoption of Apple Silicon Apple’s transition to its own custom-designed silicon has been in the works for several years, and the ‘Scary Fast’ event showcased the latest advancements in this area. The M3 chip, which powers the new iMac, is a significant improvement over its predecessors, offering faster performance and improved energy efficiency. With Apple continuing to invest in its silicon team, it’s likely that we’ll see more devices powered by custom-designed chips in the future. Continued Focus on Privacy and Security Apple has long positioned itself as a leader in privacy and security, and the ‘Scary Fast’ event was no exception. The company highlighted several new features aimed at protecting user data, including improved encryption and enhanced security protocols. As privacy concerns continue to grow, it’s likely that Apple will continue to prioritize these features in its hardware and software offerings. Expansion of Apple Services Apple has been steadily expanding its services offerings in recent years, and the ‘Scary Fast’ event hinted at further expansion in this area. The new iMac, for example, comes with a free year of Apple TV+ and Apple Arcade, two of the company’s subscription services. With Apple continuing to invest in services like Apple Music, Apple Pay, and iCloud, it’s likely that we’ll see more bundled offerings in the future. Overall, the ‘Scary Fast’ Mac event showcased Apple’s continued commitment to innovation and excellence. As the company looks to the future, it’s clear that it will continue to push the boundaries of what’s possible in hardware and software, while maintaining its focus on privacy, security, and user experience.","filter_flag":1}
