{"title":"Rosti: Bringing Excellent Services for Sustainable Growth of the Automotive Industry - The Korea Herald","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiNmh0dHBzOi8vd3d3LmtvcmVhaGVyYWxkLmNvbS92aWV3LnBocD91ZD0yMDIzMTIyMDAwMDc5NdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiNmh0dHBzOi8vd3d3LmtvcmVhaGVyYWxkLmNvbS92aWV3LnBocD91ZD0yMDIzMTIyMDAwMDc5NdIBAA?oc=5","id":"CBMiNmh0dHBzOi8vd3d3LmtvcmVhaGVyYWxkLmNvbS92aWV3LnBocD91ZD0yMDIzMTIyMDAwMDc5NdIBAA","guidislink":false,"published":"Wed, 20 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=20, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=354, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNmh0dHBzOi8vd3d3LmtvcmVhaGVyYWxkLmNvbS92aWV3LnBocD91ZD0yMDIzMTIyMDAwMDc5NdIBAA?oc=5\" target=\"_blank\">Rosti: Bringing Excellent Services for Sustainable Growth of the Automotive Industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Korea Herald<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Rosti: Bringing Excellent Services for Sustainable Growth of the Automotive Industry - The Korea Herald","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNmh0dHBzOi8vd3d3LmtvcmVhaGVyYWxkLmNvbS92aWV3LnBocD91ZD0yMDIzMTIyMDAwMDc5NdIBAA?oc=5\" target=\"_blank\">Rosti: Bringing Excellent Services for Sustainable Growth of the Automotive Industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Korea Herald<\/font>","source.href":"https:\/\/www.koreaherald.com","source.title":"The Korea Herald","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Manufacturing\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"SHANGHAI, Dec. 20, 2023 \/PRNewswire\/ -- Rosti Groups commitment to sustainability runs through the entire organisation. Recently, Rosti was proud to announced the first stage launch of thier Energy Efficiency Programme in Europe. As Rosti Group continues to champion sustainable practices, the Global Energy Efficiency Programme will be rolled out across the US and Asia in 2024. This is a significant step and demonstration of Rosti's commitment achieving the environmental goals, creating a sustainable business for Rosti's people, customers and the communities they operate in. Sustainable Growth of the Automotive Industry Plastics play an important role in automotive manufacturing. With the gradual popularization of energy conservation and emission reduction in automobiles, the lightweighting trend of replacing metal with plastic in automotive parts has become one of the most effective measures to reduce automotive emissions and improve combustion efficiency. In this aspect, injection moulding technology can also realize the integrated manufacturing of automotive parts, thereby improving the production efficiency in the automobile sector. As competition in the automotive market becomes increasingly fierce, companies are gradually accelerating product iterations to keep up with market demand for unique innovations. This places intense pressure on the design and R&D capabilities of manufacturers of precision structural parts, etc., prompting moulding technologies such as injection moulding to develop towards enhanced precision, high-speed, greater stability, and high-performance material applications. Furthermore, the rapid development of new energy vehicles has accelerated the trend of lightweighting since endurance mileage is a core pain point for new energy vehicle users, and body weight is one of the critical factors affecting endurance mileage. Statistics show that global sales of new energy vehicles reached 10.0912 million in 2022, accounting for 14% of the overall market; in China, the number of new energy vehicles also exceeded 10 million in 2022, and it is expected to reach 19 million in 2023. In the era of electrification, intelligent production and green manufacturing, new injection moulding technology plays a significant role in promoting the sustainable development of the automotive industry. A technologically leading precision injection moulding company and contract manufacturer with 79 years of history, Rosti provides services to numerous automotive manufacturers across the world and continuously develops new businesses in the new energy vehicle field with high-end precision equipment and excellent sustainable operating philosophy. Rosti's Innovations in Precision Injection Moulding and Additive Manufacturing Headquartered in Malmö, Sweden, Rosti is a technology-leading precision injection moulding company and contract manufacturer with 12 manufacturing plants and five innovative R&D centres in Europe, Asia and the Americas. With 26 years of injection moulding experience in the automotive field, its products are widely used in structural and decorative parts for Mercedes-Benz, BMW, Land Rover, Volkswagen, Volvo, BYD, etc. In recent years, with the development of new energy vehicles, Rosti's injection moulded parts and components have expanded into areas related to charging piles and battery equipment. With innovative, recyclable and sustainable solutions, Rosti becomes the preferred partner of its customers. How can it serve clients with a 72-hour turnaround from concept design to mass manufacturing? In addition to highly automated equipment and a quality-focused team, the benefits of technological innovation cannot be ignored. For example, traditional injection moulding takes longer cycle time and higher investment, but today's automotive industry has overly much higher requirements for the development speed of new products. Some parts cannot be manufactured through injection moulding, so additive manufacturing has become another problem-solving idea. Based on digital model files, additive manufacturing uses adhesive materials such as powdered plastics to manufacture plastic parts. The objects are constructed by printing layer by layer without opening moulds. By reducing costs and accelerating the process of product development and time to market, it is increasingly favoured by automotive manufacturers. Under these circumstances, it is crucial to find long-term cooperative suppliers who can quickly print samples, conduct verification, and speed up development. Rosti has successfully introduced the M3 printer from American 3D printing company Carbon and becomes the first injection moulding manufacturer in Asia to use Carbon's latest cutting-edge M3 printer. End-use parts can be quickly printed and mass-produced, widely used in consumer, industrial, automotive, medical and other fields, thus helping partners win a broader market. Moreover, today's automobiles are becoming more like fashionable products. The aesthetics of appearance and interiors are increasingly valued and high requirements for the convenience of use are asserted by consumers. Rosti's technologies, such as thermal sublimation technology, RHCM technology, IMD (in-mould film technology), IME (in-mould electronic technology) and so on, can fully meet the needs of end customers. The pursuit of sustainability Currently, under the thrust to achieve global sustainable development and the guidance of China's double carbon goal, sustainable development is becoming a required course for enterprises, and carbon footprint is becoming an invisible green trade barrier for multinational enterprises. Rosti has 12 production bases around the world, pursuing a common mission of protecting the environment, aiming to ensure no plastic particles remain in the production process. By closely monitoring and controlling inputs and outputs in all aspects of the company's operation, Rosti works to eliminate waste and takes action to reduce environmental impact; applying lean tools and techniques to enable an understanding of the performance of current operations. Continuous improvement activities are carried out to expand sustainable business with long-term development vision; moreover, the scrap reuse rate of Rosti Group is about 75%. At present, Rosti has achieved good results in green resin utilization, as well as sustainable design, recycling, and operations, etc. In 2022, the use of six varieties of green resins in Rosti accounted for 10% of the total utilization, and the air purification product customers of the Suzhou plant use 500 tons of PCR plastic particles every year. A good result has been achieved in product lightweighting, design simplification and recyclability. Recyclable solutions for customers have been found, such as the refurbishment and reuse of decoder casings. In 2022, the group recycled 75% of the waste. Each production base saves more than 200,000 euros in energy every year, reducing CO 2 emissions by more than 10%, and 57% of the energy in the production base comes from renewable energy, of which Poland, Sweden, and Romania have achieved 100% renewable energy use. It is worth mentioning that the RHCM technology successfully developed by Rosti enables parts to achieve high gloss on the product surface without a secondary surface treatment, thereby reducing assembly, improving scratch and wear resistance, and helping customers avoid spraying while meeting the requirements of aesthetic, design and process improvements of their products. Compared with traditional coated injection moulded parts, using RHCM technology, CO 2 emissions can be reduced by more than 40%; when combined with recycled resin, the CO 2 reduction can reach more than 80%. All these reflect how Rosti is committed to meeting the system requirements of customers in different industries and the relevant legal and regulatory requirements for environmental protection. By applying appropriate standards for systematic management and ensuring business continuity by maintaining system certification, Rosti provides guaranteed excellent services to customers in different industries in pursuit of sustainable production.","filter_flag":1}
{"title":"2023 Capital Spending Survey: Assemblers Continue to Invest - Assembly Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85ODE3Mi0yMDIzLWNhcGl0YWwtc3BlbmRpbmctc3VydmV5LWFzc2VtYmxlcnMtY29udGludWUtdG8taW52ZXN00gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85ODE3Mi0yMDIzLWNhcGl0YWwtc3BlbmRpbmctc3VydmV5LWFzc2VtYmxlcnMtY29udGludWUtdG8taW52ZXN00gEA?oc=5","id":"CBMiZWh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85ODE3Mi0yMDIzLWNhcGl0YWwtc3BlbmRpbmctc3VydmV5LWFzc2VtYmxlcnMtY29udGludWUtdG8taW52ZXN00gEA","guidislink":false,"published":"Mon, 04 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=4, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=338, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85ODE3Mi0yMDIzLWNhcGl0YWwtc3BlbmRpbmctc3VydmV5LWFzc2VtYmxlcnMtY29udGludWUtdG8taW52ZXN00gEA?oc=5\" target=\"_blank\">2023 Capital Spending Survey: Assemblers Continue to Invest<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Assembly Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"2023 Capital Spending Survey: Assemblers Continue to Invest - Assembly Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85ODE3Mi0yMDIzLWNhcGl0YWwtc3BlbmRpbmctc3VydmV5LWFzc2VtYmxlcnMtY29udGludWUtdG8taW52ZXN00gEA?oc=5\" target=\"_blank\">2023 Capital Spending Survey: Assemblers Continue to Invest<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Assembly Magazine<\/font>","source.href":"https:\/\/www.assemblymag.com","source.title":"Assembly Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Manufacturing\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"✕ In September, Accelera, a zero-emissions business unit of Cummins, Daimler Trucks, and PACCAR announced that they had formed a joint venture to manufacture lithium-iron-phosphate (LFP) batteries in the United States. Daimler, Accelera and PACCAR will each own 30 percent of the joint venture, which will initially focus on LFP technology for battery-electric commercial trucks. The joint venture will invest as much as $3 billion to build the new factory, which is expected to create enough batteries to power 80,000 medium-duty trucks a year or 40,000 electric buses. A location for the new factory has not been announced, but Cummins is reportedly looking at sites in Indiana, where it already operates multiple assembly plants. “This planned joint venture will enable economies of scale beyond Daimler Truck,” says Martin Daum, CEO of Daimler Truck. The Cummins project is just the latest in a wave of new manufacturing construction projects in the United States. Indeed, the country has experienced a striking surge in construction spending for manufacturing facilities during the past two years. According to a new report from the Treasury Department, real manufacturing construction spending has doubled since the end of 2021. The surge comes in a supportive policy environment for manufacturing construction: the Infrastructure Investment and Jobs Act (IIJA), Inflation Reduction Act (IRA), and CHIPS Act each provided direct funding and tax incentives for public and private manufacturing construction. The boom is principally driven by construction for computer, electronic and electrical manufacturing—a relatively small share of manufacturing construction over the past few decades, but now a dominant component. Since the beginning of 2022, real spending on construction for that specific type of manufacturing has nearly quadrupled. Importantly, the boom in this segment has not been offset by reduced spending on other manufacturing construction segments, which are largely consistent with long-term levels. In fact, construction for chemical, transportation, and food and beverage manufacturing is also up from 2022, albeit less than the computer and electronics sector. The Midwest will account for more spending in 2024 than any other region. The Midwest has held that distinction for all but two years in our survey. (Click the map to enlarge.) This rise in the spending began in the months before the CHIPS Act passed, as many factors beyond policy contribute to construction spending. Still, the legislation has played a critical part in continuing and expanding this trend. In particular, private sector analysts have recognized the connection between the growth in construction for electronics manufacturing and the CHIPS Act. For example, Bank of America notes this rise came “potentially on the back of ongoing construction of semiconductor factories as part of the CHIPS Act.” According to Deutsche Bank Research, 18 new chip-making facilities will have started construction between 2021 and 2023. The Semiconductor Industry Association reports that more than 50 new semiconductor ecosystem projects have been announced in the wake of the CHIPS Act. Companies have announced nearly 200 new projects totaling more than $110 billion of investment in America’s clean-energy economy. Those projects include the following: Maxeon Solar Technologies Ltd. plans to spend $1.2 billion to build the biggest U.S. factory for polysilicon solar panels. Construction on the plant in Albuquerque is set to start in the first quarter of 2024, with production expected to begin in 2025. The facility will be able to produce as much as 3 gigawatts of solar panels annually, doubling Maxeon’s manufacturing capacity. First Solar Inc. is investing up to $1.1 billion to construct a new solar panel assembly plant in Iberia Parish, LA. It will be the company’s fifth U.S. factory. Hanon Systems, a South Korean manufacturer of thermal and energy management technology for electric vehicles, plans to invest $170 million to build a new assembly plant in Loudon County, TN. The company’s fourth U.S. factory is expected to create 600 jobs. Canadian company Heliene will spend $145 million to build a new factory in the Minneapolis-St. Paul area to make solar panels and solar cells. The factory will have an annual capacity of about 1 gigawatt of modules and 1.5 gigawatts of cells. The company already makes panels in Minnesota and Ontario, Canada. 2024 Spending Equipment Category % of plants to buy 2024 % of total spending 2024 Estimated total spending 2024 % change in spending 2023-24 Dispensing 26 3 210.4 7 Multistation systems 21 15 936.9 -2 Single-station machines 49 17 1068.3 -2 Parts feeders 26 2 101.9 3 Conveyors & MH 40 3 168.8 18 Power tools 38 4 264.8 15 Bar coding & auto ID 36 4 242.5 1 Motion control 20 3 171.8 15 Welding, brazing, soldering 19 3 170 -15 Robots 38 13 799.4 11 PCB assembly 8 1 60.1 -13 Computers & software 55 9 574.2 7 Test equipment 35 4 259.4 -18 Inspection equipment 51 6 395.5 24 Wire processing 8 1 85 -4 Workstations 35 2 102.2 3 Packaging 39 4 226.2 19 Tooling 49 2 120.3 9 Additive manufacturing 30 3 185.3 -5 Other 4 1 37 3 Total 100 6180 3 IMI Sales Leads provides further evidence of robust investment in North American manufacturing in 2023. The consulting firm tracks industrial capital projects in the U.S. and Canada, including facility expansions, new plant construction, and modernization projects. The firm’s latest data show 161 new projects in October, compared with 150 in September 2023 and 130 in October 2022. IMI Sales Leads reported 441 new projects in the third quarter of 2023, down slightly from the 450 projects reported in the third quarter of 2022. Spending on new manufacturing construction isn’t the only thing that’s growing. Manufacturing jobs are also increasing. Just under 13 million people were employed in manufacturing in September 2023—the highest number since November 2008. Manufacturing employment has increased 14 percent since April 2020, the low point of the COVID pandemic. Will manufacturers continue to put money into people, plants and equipment in 2024? The results of our 28th annual Capital Equipment Spending Survey point to an increase in investments next year. Fifty-one percent of assemblers will invest in vision systems and other inspection technology next year, the highest percentage in five years. Photo courtesy Zebra Technologies Spending to Increase Some 34 percent of respondents will spend more on assembly technology next year than they did this year. That compares with 37 percent in last year’s survey, and it’s the 10th straight year in which that figure has topped 30 percent. In fact, in the 28-year history of the survey, the “spend more” ratio has been 30 percent or less just seven times. Conversely, 22 percent of respondents will spend less in 2024 than they did 2023. That figure has topped 20 percent just four times in the past 10 years, and one of those was the COVID year of 2021. Forty-four percent will spend the same in 2024 as they did in 2023. Of those plants that will spend more, the average budget increase is 22 percent. Of those that plan to spend less, the average budget decrease is 25 percent. That’s not to say, however, that overall spending will increase that much. Our data indicate that U.S. assembly plants will spend $6.18 billion on new equipment in 2024, an increase of 3 percent from the $5.98 billion projected to be spent in 2023. On average, manufacturers will spend $1,970,582 on assembly technology in 2024. That compares with $1,905,175 in 2023, and it’s the highest average in survey history. The median budget total is $200,000, which is significantly more than the $125,000 figure in 2023. In fact, it’s the second largest median budget in survey history. Aggregate budget data indicate growth in spending. For example, 38 percent of plants have 2024 capital budgets of at least $500,000. That percentage has now exceeded 30 percent for six straight years. At the same time, 27 percent will spend between $100,000 and $499,999, the same ratio as in 2023. Only 35 percent will spend less than $100,000 on assembly technology in 2024. That percentage has been under 40 percent in five of the past six years. Companies with more than 250 employees will account for 87 percent of total spending on assembly technology in 2024. It’s the third time in the past 10 years in which that ratio has exceeded 85 percent. The automotive industry will account for 64 percent of all spending next year. That’s the highest share for this industry in survey history. Assemblers of products larger than a 6-foot cube will account for 18 percent of total spending next year, the lowest percentage since 2020. Click on any of the graphs to enlarge Automotive Continues to Lead On Nov. 15, EV start-up Rivian gained approval to start construction on a new assembly plant near Atlanta. Rivian was granted final approval for the project by the Georgia Department of Economic Development and the Joint Development Authority of Jasper, Morgan, Newton and Walton counties. The approval gives Rivian long-term rights to construct a factory in the Stanton Springs industrial area east of Atlanta, after the plans were first set in motion in 2021. The factory will be Rivian’s second assembly plant, joining its first in Normal, IL, which produces the R1T pickup and the R1S SUV. The facility is expected to bring as many as 7,500 jobs to the area, and Rivian will spend $5 billion to build and equip the facility. Rivian is targeting 2026 for initial production, and the company eventually expects to reach an annual volume production of around 400,000 vehicles. With news like that, it’s hardly surprising that the automotive industry is leading the way in capital investment. In fact, the industry will account for 63 percent of all spending next year. That’s more than any other industry, and it’s the highest share for this industry in survey history. On average, automotive assemblers will spend $7,786,111 on capital equipment next year—almost four times the national average. Some 44 percent of automotive assemblers will spend more in 2024 than they did in 2023. Compared with other industries, automotive manufacturers are less concerned about increasing capacity (22 percent vs. 48 percent for all U.S. plants) and replacing old or worn-out equipment (33 percent vs. 49 percent for all U.S. plants). But, they are more concerned about assembling new products (56 percent vs. 33 percent for all U.S. plants), which makes sense given the industry’s transition to EVs. Warranty costs continue to be an issue for the auto industry. Some 22 percent of automakers are targeting warranty and service costs for investment in 2024—more than double the 10 percent figure for the nation as a whole. That’s not surprising. Automakers issued 1,050 recalls in 2022, the third time in the past five years in which the number of recalls for the year has exceeded 1,000, according to the National Highway and Transportation Safety Administration. 2023 could be just as bad. Through the first six months of this year, there have already been 515 recalls involving 16.7 million vehicles. U.S. assembly plants will spend $6.18 billion on new equipment in 2024, an increase of 3 percent from 2023 spending. Middling Machinery Industry After accounting for more than 30 percent of total equipment spending in each of the past two years, machinery manufacturers (NAIC 333) will represent just 2 percent of spending in 2024. That’s the lowest percentage for this industry in survey history. Only 29 percent of plants in this industry will spend more in 2024 than they did in 2023, while another 29 percent will spend less. On average, machinery makers will spend $306,523 on new equipment next year. That’s the lowest average budget for this industry since 2016. In 2023, 28 percent of plants in this industry spent at least $1 million on assembly technology. In 2024, just 13 percent will do so, the smallest percentage since 2018. On average, machinery manufacturers will spend $306,523 on capital equipment in 2024—the lowest average for the industry in at least 10 years. Photo courtesy Caterpillar Inc. One reason for the lack of investment may be that this industry is already at capacity. Some 39 percent of machinery makers are looking to increase capacity next year, compared with 48 percent for the nation as a whole. Still, there are some bright spots. In August, for example, Deere & Co. announced that it will build a 115,000-square-foot assembly plant in Kernersville, NC, to increase production of its Kreisel Electric brand of batteries and charging equipment for electric tractors and off-road vehicles. Construction is scheduled to begin this fall, and production is estimated to begin in 2025. Deere is also investing in additional production equipment at its battery manufacturing facility in Saran, France, the primary manufacturing location for Deere engines in Europe. Some 49 percent of plants will spend at least $250,000 on assembly technology next year. It’s the sixth straight year in which that ratio has been 40 percent or more. Largest Companies Drive Investment Looking at budgets by company size, our data indicate that our largest manufacturers will once again dominate capital spending. Some 39 percent of companies with more than 250 employees will spend more next year than they did this year, while just 16 percent will spend less. Conversely, only 29 percent of companies with up to 100 employees will spend more in 2024 than they did in 2023, while 28 percent will spend less. Looking at actual budget figures, companies with more than 250 employees will spend, on average, $5,093,385 on assembly technology next year—a record high and $1 million more than the 2023 average. Conversely, the average budget for companies with fewer than 25 employees is $122,154, up from $71,692 in 2023. As a group, companies with more than 250 employees will account for 87 percent of total spending on assembly technology in 2024, marking the third time in the past 10 years in which that ratio has exceeded 85 percent. At the opposite end of the spectrum, companies with up to 100 employees will represent just 5 percent of spending in 2024. It’s the fourth straight year in which that ratio has been below 10 percent. Some 34 percent of respondents will spend more on assembly technology next year than they did this year. It’s the 10th straight year in which that figure has topped 30 percent. Spending by Region The Midwest has traditionally been the epicenter of U.S. manufacturing, and next year will be no exception. The region will account for 52 percent of spending in 2024, more than any other part of the country and the most for the region since 2018. The Midwest has held the lion’s share of spending for all but two years in our survey. On average, Midwestern manufacturers will spend $3,105,449 on assembly technology next year. That’s up from $2,013,337 in 2023, and it’s the highest average in at least a decade. There is ample evidence to support predictions of higher spending in the Midwest. In October, for example, Ford Motor Co. agreed to invest $400 million in its Chicago Assembly Plant and another $30 million in its Chicago Stamping Plant as part of the new four-year contract agreement with the United Auto Workers union. That same month, LG Energy Solution that it will invest $3 billion to expand its assembly plant in Holland, MI, to produce battery cells and modules for Toyota. The expansion is expected to add 1,000 jobs and quintuple output at the factory. Work on the plant is slated to be completed in 2025. The factory will initially supply battery modules to a Toyota plant in Kentucky that is slated to build a new EV starting in 2025. While the Midwest continues to dominate manufacturing, there’s little doubt that manufacturing investment is increasingly shifting to the South. The region will account for 30 percent of total spending next year, marking the sixth straight year the region has accounted for at least 30 percent of capital spending in the U.S. On average, Southern assemblers will spend $2,982,100 on assembly technology next year. In fact, the average capital budget in the South has topped $1 million in four of the past five years. Much of that spending can be attributed to increased spending in EV production, but it’s not the only source of investment. In May, for example, Siemens Mobility, the largest manufacturer of passenger train cars in the U.S., said it will build a $220 million advanced manufacturing and rail services facility in Lexington, NC. The factory will create more than 500 new jobs. With the increased production capacity, Siemens Mobility will meet the growing demand for passenger trains in the North America. The Bipartisan Infrastructure Law is enabling American rail and transit operators to make critically needed investments in infrastructure that will position the country to meet the transportation needs for future generations. Some 42 percent of assemblers—a record high—are currently using collaborative robots or plan to within the next year. Another 15 percent expect to deploy the technology in the next two to three years. Robots Remain Popular Robots continue to be deployed at a record pace. According to the International Federation of Robotics (IFR), an all-time high of 553,052 new robots were installed in factories around the world in 2022, a 5 percent increase over 2022. Most of those installations (73 percent) were in Asia, followed by Europe (15 percent) and the Americas (10 percent). “The world record of 500,000 units was exceeded for the second year in succession,” says Marina Bill, president of IFR and group vice president for robotics and discrete automation at ABB Inc. “In 2023, the industrial robot market is expected to grow by 7 percent to more than 590,000 units worldwide.” On average, aerospace manufacturers will spend $647,593 on capital equipment next year—just one-third of the average for all U.S. assembly plants. Photo courtesy Boeing Our survey indicates that demand for robots will continue unabated next year. We expect sales of six-axis robots, SCARAs, grippers and other robotic technology to increase 11 percent, from $720 million in 2023 to $799.4 million in 2024. Thirty-eight percent of plants will purchase robots next year, a record high. Demand for robots should be particularly strong in the automotive, aerospace and electronics industries. A driving force behind the spike in demand for robots is the continued popularity of collaborative robots. Some 42 percent of assemblers—a record high—are currently using the technology or plan to within the next year. Another 15 percent expect to deploy the technology in the next two to three years. In 2020, 60 percent of assemblers—a record high—were investing in capital equipment to increase capacity. That percentage has been steadily decreasing ever since. Conveyors Keep Moving Another technology that should see an uptick in sales next year is conveyors and material handling equipment. Some 40 percent of assembly plants will invest in conveyors next year. That ties a the record high set in 2018. Demand for conveyors will be particularly strong in the automotive, medical device and electrical equipment industries. All totaled, sales of conveyors will increase 18 percent, from $143 million in 2023 to $168.8 million in 2024. “2023 has been good year,” says Mark Dinges, product manager for assembly automation at Bosch Rexroth. “We expect pallet-based assembly conveyance to continue to grow in 2024 and 2025, but not at an 18 percent growth rate—maybe 5 percent. That growth will continue to be driven by EV and battery-related applications.” Quality is more of a concern in some industries than others. For example, one-third of automotive assemblers will buy equipment next year to increase quality—twice the national percentage. In contrast, only 7 percent of manufacturers in the electrical equipment industry will do so. Fastening Tools Tighten Up Sales of fastening tools should increase next year. Some 38 percent of assemblers will purchase DC electric nutrunners, pneumatic screwdrivers, cordless rivet setters and other tools next year, about the same percentage as in 2023. Demand will be particularly strong in the medical device, electrical equipment, and electronics industries. All totaled, assemblers will spend $264.8 million on fastening tools next year, up 13 percent from 2023 sales. “2023 was a record year for Desoutter. We experienced a lot of growth around the EV market,” says Russ Hughes, senior product marketing manager at Desoutter Industrial Tools. “Our brand recognition has been increasing year over year. With the partnership we have with BNP media and the ASSEMBLY Show and ASSEMBLY Show South, we expect continued growth throughout 2024. “We have been having a lot of success around our data analytics software DeMeter and our process control software Pivotware. Manufacturers are realizing the advantages of the full Desoutter ecosystem. “With the expected new product launches we have planned for 2024, we are planning on continuing to see double-digit growth in 2024.” Survey Methodology ASSEMBLY magazine is sent to 47,234 assembly professionals, 92 percent of whom are in the U.S. The survey was conducted in conjunction with Clear Seas Research, an affiliate of BNP Media, ASSEMBLY magazine’s parent company. Clear Seas is a full service, B-to-B market research company. Custom research products include brand positioning, new product development, customer experiences and marketing effectiveness solutions. Clear Seas offers a broad portfolio of primary, syndicated research reports and powers the leading B-to-B panel for corporate researchers, myCLEARopinion Panel, in the architecture, engineering, construction, food, beverage, manufacturing, packaging and security industries. Learn more at clearseasresearch.com. Questionnaires were e-mailed in mid-August to a random sample of 15,955 subscribers in management positions. Thirty-six percent of respondents were engineers; 43 percent were management; 15 percent were in quality assurance; and 6 percent were classified as purchasing or “other.” The cutoff date for returning the surveys was Aug. 23. Some 222 surveys were returned for a response rate of 1 percent. The survey was sent to manufacturers in the following industries: aerospace, electronics, appliances, fabricated metal products, furniture, machinery, medical devices, plastics and rubber products, automotive, energy and miscellaneous manufacturing. Geographically, 17 percent of respondents were located in the Northeast, 49 percent were in the Midwest, 21 percent were in the South, and 13 percent were in the West. Sixteen percent of respondents had 25 employees or less. In addition, 23 percent had 26 to 100 employees, 13 percent had 101 to 250 employees, and 48 percent had more than 250 employees. Twenty-one percent of respondents assemble products that can fit inside a 12-inch cube, 17 percent make products that can fit inside a 24-inch cube, 20 percent make products that fit inside a 36-inch cube, 23 percent make products that fit inside a 6-foot cube, and 19 percent make products that are larger than a 6-foot cube.","filter_flag":1}
{"title":"What Positions TCL CSOT to Come out on Top? - LEDinside","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiNmh0dHBzOi8vd3d3LmxlZGluc2lkZS5jb20vbmV3cy8yMDIzLzEyLzIwMjNfMTJfMTlfMDEwMdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiNmh0dHBzOi8vd3d3LmxlZGluc2lkZS5jb20vbmV3cy8yMDIzLzEyLzIwMjNfMTJfMTlfMDEwMdIBAA?oc=5","id":"CBMiNmh0dHBzOi8vd3d3LmxlZGluc2lkZS5jb20vbmV3cy8yMDIzLzEyLzIwMjNfMTJfMTlfMDEwMdIBAA","guidislink":false,"published":"Tue, 19 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=19, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=353, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNmh0dHBzOi8vd3d3LmxlZGluc2lkZS5jb20vbmV3cy8yMDIzLzEyLzIwMjNfMTJfMTlfMDEwMdIBAA?oc=5\" target=\"_blank\">What Positions TCL CSOT to Come out on Top?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">LEDinside<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"What Positions TCL CSOT to Come out on Top? - LEDinside","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNmh0dHBzOi8vd3d3LmxlZGluc2lkZS5jb20vbmV3cy8yMDIzLzEyLzIwMjNfMTJfMTlfMDEwMdIBAA?oc=5\" target=\"_blank\">What Positions TCL CSOT to Come out on Top?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">LEDinside<\/font>","source.href":"https:\/\/www.ledinside.com","source.title":"LEDinside","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Manufacturing\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Amid the wave of digitalization and intellectualization, the market landscape of global display industry has been reshaped with most production capacities concentrating on Chinese market. Among the key players worldwide, TCL CSOT has burgeoned into one of the bellwethers in the arena of next-generation display technologies. The company has a proved track record in marketing, exemplified by a group of data collected by 3Q23 as follows: 8K high-end TV panels have secured the 1st place globally. In the field of commercial displays, TCL CSOT ranks 2nd in global shipments. In the high-end e-sports products segment, TCL CSOT maintains the leading market share globally. The shipments of LTPS laptop panels ranked 2nd globally. LTPS tablet PC panels secured the 2nd place worldwide. The shipments of LTPS vehicle-mounted panels and LTPS mobile phone panels came 5th and 3rd globally respectively. Here comes the question: how does TCL CSOT distinguish itself in next-generation display industry? TCL CSOT’s All-Round Strengths Following a thorough factory tour of TCL CSOT, LEDinside, a brand of TrendForce, got the answers. The company’s achievements are tied to three aspects: technical competence, sufficient production capacity, and highly-efficient cost management. Technical competence: TCL CSOT boasts a broad range of state-of-the-art display technologies, encompassing Mini\/Micro LED, FMM-OLED, IJP (Ink-jet Printing) OLED, etc, and it has been zeroing in on low-carbon, energy-saving and eye-care products based on these technologies with the hope of driving a sustainable and connected future with innovative technologies. Take Mini\/Micro LED technologies for example. TCL CSOT introduced that it takes a two-step approach, with one focusing on Mini LED backlight technology and the other on MLED self-emissive technologies. For Mini LED backlight technology, TCL CSOT has recently achieved the industrialization of the combination of Mini LED backlight and LCD technology and developed the AM Mini LED backlight based on LTPS, which features better performance and cost advantages in ultra-high zone number. For Mini LED and Micro LED technologies technology, TCL CSOT adopts the technical route of combining AM MLED display and LTPS backplane technologies, enabling ultra-high brightness and extremely small pitch, in line with higher market demands. Given the thriving development of vehicle and wearable displays, TCL CSOT will probably channel more efforts to realize the mass production of AM MLED display technology based on LTPS backplane for products in these fields. Notably, in the field of Micro LED where cutting-edge technologies, sophisticated processes and efficient cost management capability are required, TCL CSOT has had the foresight to cooperate with its upstream partners amidst the megatrend of integrated industrial value chain. For instance, TCL CSOT works together with San’an in accelerating the commercialization and marketization process of Micro LED technology. It’s learned that the cooperation between the two parties has gradually yielded results, and they will fully expand their business in this field, covering materials, techniques, equipment, production line, intellectual property, and the establishment of a total solution for Micro LED commercial scale mass production. Production capacity: In reaction to the increasing demands for next-generation display products, TCL CSOT progressively set up new lines to expand production. The company currently operates 9 panel production lines and 5 module bases, and each factory maintains stable production capacity. Among the production lines, 8.5th generation new TV production line, know as “TCL CSOT Shenzhen t2 Project”, is the most efficient, innovative and environmentally friendly 8.5th generation production line, which is capable of generating 155,000 panels per month. TCL COST Shenzhen also runs the 8.5th TV panel production line ( t1 Project ), the first domestic LCD panel production line built entirely through independent innovation, with a monthly capacity of 160,000 panels. Of all the products rolled out from TCL CSOT Shenzhen production lines, the 75-inch MLED Starlight display panel integrating over 20,000 Mini LED chips is the most striking achievement, so to speak. It delivers not only a remarkable display performance that matches self-emissive products but also a more competitive cost advantage, setting a benchmark for the Mini LED backlight industry. When it comes to the latest emerging technologies, 8.6th generation oxide new display production line, known as the \"TCL CSOT Guangzhou t9 Project,\" catches the spotlight. With an impressive capacity of 180,000 display panels per month, t9 Project is the only high-generation panel production line in the world that is compatible for the production of LCD, Micro LED and IJP OLED. With the construction of t9 project being in high gear, TCL CSOT commenced large-scale production and customer delivery at this production line in April 2023. Moreover, the company newly unveiled two new products from this plant, integrating TCL CSOT's independently developed HFS technology, which addresses the market's strong demand for low-power display technology. Cost management: TCL CSOT also stands out in bringing down production costs. Aside from delivering products with greater material utilization efficiency and lower production costs, TCL CSOT has achieved full-process automation in production execution, addressing the final stages of the production chain. This enables full-stack automation of TFT production process, reducing human errors, and enhancing production efficiency and quality. Other approaches are also at play in this aspect, like the application of 5G+AR remote collaborative guidance in factories. As a part of the TCL COST Shenzhen factory tour, the manufacturing factory visit gave a direct impression of how intelligent and automatic the process is. The processes from the yellow light zone, glass handling zone to the white light zone are efficiently collaborative. Such a clean, high-tech, precise and smart factory allows TCL CSOT Shenzhen to maximize production efficiency while minimizing cost. Overall, TCL CSOT is well-positioned to embrace new opportunities and quickly response to new demands from the emerging and ever-changing markets. Lifelong Mission to Empower a Greener Planet Far beyond a profit-driven enterprise, TCL CSOT aims to be a contributor to the whole society. As an integral part of TCLGreen campaign, the company has been committed to establishing a greener planet for the benefit of all human beings, from green industry, green manufacturing, green products, to green values and culture. The implementation of renewable energy and pure recycling water systems can be regarded as a typical example for the TCLGreen deeds. In 2022, TCL CSOT has been actively generating clean energy through distributed rooftop PV solar systems with an installed capacity of 81MW. The Shenzhen CSOT factory that LEDinside visited installed a total capacity of 3.83 MW of rooftop PV solar systems, with an annual power generation capacity of 4 million kWh. The current total capacity of PV systems at the base has reached 48 MW, capable of generating 50 million kWh of electricity per year. Noticeably, the project was awarded the title of \"Smart PV Demonstration Project\". In terms of water recycle, the Shenzhen CSOT factory recovers a total of 34.6 million cubic meters of pure water per year and saves approximately USD 23.9 million in tap water costs by introducing a pure water recycling system, which recycle the pure water used for post-production cleaning, with the recovery rate of pure water reaching over 75%. Green endeavors can also find expression in the company’s green value and culture. With the concept of a paperless office, TCL CSOT has transitioned 83 processes within the company to this digital approach to date. And in 2022, the company saved paper to the tune of 2.68 million sheets annually through its paperless checkpoint system. By facilitating green education and awareness within the company, TCL CSOT promises that it will always on its way to conduct green practices. Summary Both business achievements and environmental-friendly accomplishments are a testaments to TCL CSOT’s leading market and social positions. Down the road, TCL CSOT will continue to empower a more advanced, connected and healthy future with “display everywhere”. ( Author: Janice Chan \/ LEDinside of TrendForce)","filter_flag":1}
{"title":"‘Our ambition is to make Tamil Nadu the R&D capital of India, if not Asia’: Dr TRB Rajaa - Autocar Professional","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vZmVhdHVyZS9vdXItYW1iaXRpb24taXMtdG8tbWFrZS10YW1pbC1uYWR1LXRoZS1yZC1jYXBpdGFsLW9mLWluZGlhLWlmLW5vdC1hc2lhLWRyLXRyYi1yYWphYS0xMTgxNzHSAYIBaHR0cHM6Ly93d3cuYXV0b2NhcnByby5pbi9mZWF0dXJlL291ci1hbWJpdGlvbi1pcy10by1tYWtlLXRhbWlsLW5hZHUtdGhlLXJkLWNhcGl0YWwtb2YtaW5kaWEtaWYtbm90LWFzaWEtZHItdHJiLXJhamFhLTExODE3MT9hbXA9MQ?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vZmVhdHVyZS9vdXItYW1iaXRpb24taXMtdG8tbWFrZS10YW1pbC1uYWR1LXRoZS1yZC1jYXBpdGFsLW9mLWluZGlhLWlmLW5vdC1hc2lhLWRyLXRyYi1yYWphYS0xMTgxNzHSAYIBaHR0cHM6Ly93d3cuYXV0b2NhcnByby5pbi9mZWF0dXJlL291ci1hbWJpdGlvbi1pcy10by1tYWtlLXRhbWlsLW5hZHUtdGhlLXJkLWNhcGl0YWwtb2YtaW5kaWEtaWYtbm90LWFzaWEtZHItdHJiLXJhamFhLTExODE3MT9hbXA9MQ?oc=5","id":"CBMifGh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vZmVhdHVyZS9vdXItYW1iaXRpb24taXMtdG8tbWFrZS10YW1pbC1uYWR1LXRoZS1yZC1jYXBpdGFsLW9mLWluZGlhLWlmLW5vdC1hc2lhLWRyLXRyYi1yYWphYS0xMTgxNzHSAYIBaHR0cHM6Ly93d3cuYXV0b2NhcnByby5pbi9mZWF0dXJlL291ci1hbWJpdGlvbi1pcy10by1tYWtlLXRhbWlsLW5hZHUtdGhlLXJkLWNhcGl0YWwtb2YtaW5kaWEtaWYtbm90LWFzaWEtZHItdHJiLXJhamFhLTExODE3MT9hbXA9MQ","guidislink":false,"published":"Sun, 10 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=344, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vZmVhdHVyZS9vdXItYW1iaXRpb24taXMtdG8tbWFrZS10YW1pbC1uYWR1LXRoZS1yZC1jYXBpdGFsLW9mLWluZGlhLWlmLW5vdC1hc2lhLWRyLXRyYi1yYWphYS0xMTgxNzHSAYIBaHR0cHM6Ly93d3cuYXV0b2NhcnByby5pbi9mZWF0dXJlL291ci1hbWJpdGlvbi1pcy10by1tYWtlLXRhbWlsLW5hZHUtdGhlLXJkLWNhcGl0YWwtb2YtaW5kaWEtaWYtbm90LWFzaWEtZHItdHJiLXJhamFhLTExODE3MT9hbXA9MQ?oc=5\" target=\"_blank\">‘Our ambition is to make Tamil Nadu the R&amp;D capital of India, if not Asia’: Dr TRB Rajaa<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Autocar Professional<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"‘Our ambition is to make Tamil Nadu the R&D capital of India, if not Asia’: Dr TRB Rajaa - Autocar Professional","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vZmVhdHVyZS9vdXItYW1iaXRpb24taXMtdG8tbWFrZS10YW1pbC1uYWR1LXRoZS1yZC1jYXBpdGFsLW9mLWluZGlhLWlmLW5vdC1hc2lhLWRyLXRyYi1yYWphYS0xMTgxNzHSAYIBaHR0cHM6Ly93d3cuYXV0b2NhcnByby5pbi9mZWF0dXJlL291ci1hbWJpdGlvbi1pcy10by1tYWtlLXRhbWlsLW5hZHUtdGhlLXJkLWNhcGl0YWwtb2YtaW5kaWEtaWYtbm90LWFzaWEtZHItdHJiLXJhamFhLTExODE3MT9hbXA9MQ?oc=5\" target=\"_blank\">‘Our ambition is to make Tamil Nadu the R&amp;D capital of India, if not Asia’: Dr TRB Rajaa<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Autocar Professional<\/font>","source.href":"https:\/\/www.autocarpro.in","source.title":"Autocar Professional","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Manufacturing\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Dr TRB Rajaa, Tamil Nadu's Minister for Industries, Investment Promotions and Commerce is a man on a mission. And it is clear from the self assuredness when he speaks, that the mission is going well. Addressing the Autocar Professional India EV Conclave, and talking on its sidelines, Dr Raja outlined the blueprint for the state of Tamil Nadu to become the EV manufacturing and R&D hub of South Asia. In short, the administration of the state is on its way to create the complete ecosystem to make and market EVs on the back of a robust skilling policy and the intent to create multiple mobility zones. According to state data, Tamil Nadu accounts for close to 40 percent of all EV investments in India, and the Industry Minister has plans to double this in the next two years. Keen on attracting more investments in the electric vehicles (EV) sector in particular, Tamil Nadu has outlined close to Rs 300 crore for a 300- acre, first-of-its-kind Future Mobility and E-Vehicle Park at Shoolagiri on the outskirts of this industrial city and plans to offer a plug-and-play business model for those setting up their units. The state already has EV OEM majors like Ather, Ola, TVS Motor Company, and Simple Energy, which have set up multiple manufacturing units in the Hosur[1]Krishnagiri-Dharmapuri (HKD) region. Plans are in place to connect the Sriperumbudur and Oragadam corridors to the existing mobility zones. After attracting global carmaker Stellantis, which has a facility in Thiruvallur, the state is making rapid advances in battery manufacturing, with global majors like BYD, Lucas-TVS, and Li Energy establishing units in the state. Here is a summary of what the minister said. On attracting investments When any investor walks into India, the first door they knock on is Tamil Nadu. It would be fairly realistic to say that Tamil Nadu is India's electric vehicle manufacturing hub. Our EV policy specifically focuses on developing cells and battery manufacturing, which is expected to draw investments close to Rs 80,000 crore up from the current Rs 40,000 crore. The state's base in electronic manufacturing encourages more electric vehicle companies to establish local operations here. We have a clear vision of inclusive, long-term growth. Our EV policy is comparable to, and even exceeds, what other states have to offer because we are \"future-ready.\" The Tamil Nadu Global Investors Meet, which is scheduled for January 7-8, 2024, is where we will be making significant announcements on our EV policy. On talent development We need to preserve the head start that we have currently, and maintain the flow of talent into the sector. The quality of the human resources in the sector should be strong, and that is why there is a lot of focus on capacity building and skilling. To develop in-house competencies for skilling, the city of Coimbatore is developing an MSME EV Skilling Programme to equip Micro, Small, and Medium Enterprises (MSMEs) with the skills and knowledge required to thrive in the rapidly growing EV sector. On job creation Our target is to create about 1.5 lakh new jobs. We want to create an environment that contributes to sustainable development goals. We want to provide employment for women in rural areas around EV clusters. We want to create a multitude of opportunities for generation of employment. On climate common sense Here in Tamil Nadu, the government is inculcating a climate common sense in our people. This is an inherent understanding of what is good for the environment and what is not. We take a a practical and informed approach to addressing climate change that is based on a shared understanding of scientific evidence and the need for collective, responsible action. In Tamil Nadu, we are taking steps to achieve this systematically. We are reforming our school and college curricula to create climate consciousness. Our youth are leading the way in climate action, and we are enabling them. We are even fostering a positive political fraternity environment in which professionals advise our legislators on the types of policies that we will need to develop in the future. I firmly believe that climate justice is also about social justice because it is understood that vulnerable communities are often disproportionately affected by climate change. On fast forwarding waiting times In some cases, the turnaround time for new proposals from the MoU to launch has been less than 60 days. Six months is a reasonable time for any investor to expect to hear back from TN state officials in larger proposals involving multiple departments and clearances. We intend to explore various opportunities and overcome challenges in the e-mobility domain by accelerating investments in the sector from a memorandum of understanding (MoU) to a business launch in less than 6 to 10 months. On new R&D centres in TN One key reason we see this happening is that the industry, the government, and academia are all in sync. Now, there is a need to push this to the next level, through a strong R&D ecosystem. Our ambition is to make Tamil Nadu the R&D capital of India, if not Asia. This is our primary goal moving forward. R&D will be critical, and we will develop an ecosystem centred on innovation. On TN becoming a hydrogen hub Tamil Nadu has been leading the green energy transition revolution and is in the process of developing a green hydrogen hub. I am pleased to inform you that more than half of the state's installed energy capacity is green, with the government aiming for 75 percent. The government’s commitment and efforts were acknowledged with the UN Promotion Award 2023 for Excellence in Scaling Up Energy Transition Investments. On battery swapping Battery swapping will also get support from the government and plenty of benefits are on offer for the EV ecosystem play, which as I said before, will be unveiled at the Tamil Nadu Global Investors Meet to be held on January 7 and 8, 2024. On battery charging infrastructure We have already outlined a plan to bump up our EV charging footprint to close to 2,000 EV chargers and bring about revolutionary changes in the way people commute. The government targets expanding its current 300–350 charging stations by fivefold over the next few years through robust coordination between the state's various departments and oil marketing companies. Currently, we don’t have enough EV charging facilities in the state. But soon, you are going to see a multi-fold expansion in the state’s charging infrastructure. We also plan to launch an EV portal, which will integrate all charging stations in the state. As we strive to become India's EV charging capital, we want to hand hold adoption, provide consumers with more charging stations, and eliminate range anxiety. On the scrapping policy The Tamil Nadu government is working on a scrapping policy for the state that will encourage consumers to give up their old vehicles while also incentivising consumers to switch to EVs and decarbonise road transportation. We will be announcing more details on this shortly. On prioritising MSMEs We have a strong MSME focus, with a multi-city plug-and[1]play facility for MSMEs created and conceptualised by the MSME department. The industry's needs are so progressive that we are looking to create demand-based interventions. Tamil Nadu's DNA is such that it competes not only with other states, but also with countries such as Malaysia and Vietnam, where global companies can shift their supply chains to India. We are constantly expanding the skill sets required as you transition to cleaner, greener vehicle manufacturing and building R&D capabilities. On the new EV Park The EV park will be located inside Hosur’s third industrial estate being developed by the State Industries Promotion Corporation of Tamil Nadu (SIPCOT), which has already acquired over 800 acres of land out of the planned 1,025 acres. It will house OEMs and component makers such as battery and charging infrastructure providers. The idea behind an EV park is to attract more EVs to Hosur and increase the presence of ancillary industries, which will give investors confidence to choose the location. This feature was first published in Autocar Professional's December 1, 2023 issue.","filter_flag":1}
