{"title":"Competitiveness, Constraints, & Coordination: A Strategy for Accelerating Energy Transition Investment in the Great ... - Rocky Mountain Institute","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vcm1pLm9yZy9hLXN0cmF0ZWd5LWZvci1hY2NlbGVyYXRpbmctZW5lcmd5LXRyYW5zaXRpb24taW52ZXN0bWVudC1pbi10aGUtZ3JlYXQtbGFrZXMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vcm1pLm9yZy9hLXN0cmF0ZWd5LWZvci1hY2NlbGVyYXRpbmctZW5lcmd5LXRyYW5zaXRpb24taW52ZXN0bWVudC1pbi10aGUtZ3JlYXQtbGFrZXMv0gEA?oc=5","id":"CBMiXGh0dHBzOi8vcm1pLm9yZy9hLXN0cmF0ZWd5LWZvci1hY2NlbGVyYXRpbmctZW5lcmd5LXRyYW5zaXRpb24taW52ZXN0bWVudC1pbi10aGUtZ3JlYXQtbGFrZXMv0gEA","guidislink":false,"published":"Tue, 26 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=269, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vcm1pLm9yZy9hLXN0cmF0ZWd5LWZvci1hY2NlbGVyYXRpbmctZW5lcmd5LXRyYW5zaXRpb24taW52ZXN0bWVudC1pbi10aGUtZ3JlYXQtbGFrZXMv0gEA?oc=5\" target=\"_blank\">Competitiveness, Constraints, & Coordination: A Strategy for Accelerating Energy Transition Investment in the Great ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Rocky Mountain Institute<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Competitiveness, Constraints, & Coordination: A Strategy for Accelerating Energy Transition Investment in the Great ... - Rocky Mountain Institute","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vcm1pLm9yZy9hLXN0cmF0ZWd5LWZvci1hY2NlbGVyYXRpbmctZW5lcmd5LXRyYW5zaXRpb24taW52ZXN0bWVudC1pbi10aGUtZ3JlYXQtbGFrZXMv0gEA?oc=5\" target=\"_blank\">Competitiveness, Constraints, & Coordination: A Strategy for Accelerating Energy Transition Investment in the Great ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Rocky Mountain Institute<\/font>","source.href":"https:\/\/rmi.org","source.title":"Rocky Mountain Institute","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Transition Strategies\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"The race to compete in the energy transition is on. As new energy technologies rapidly decrease in cost and improve in quality, regions across the world are scrambling to develop projects that can deliver high-quality jobs and sustained economic development. In 2022, for the first time, global clean energy transition investment surpassed the trillion-dollar mark and was equal to total investment in fossil fuels. Remarkably, global investment in solar energy is expected to surpass oil in 2023. In the United States, energy transition investment reached $140 billion in 2022 and is expected to more than triple by 2030. The Great Lakes region[i] is no exception. Since the start of 2021, the region has seen more than $40 billion in new energy transition investments, particularly in the electric vehicles (EVs) and batteries sector. Four-fifths of all new and planned electricity generation capacity in the region is in solar photovoltaic or onshore wind. Investments in new electrolyzer, thin-film solar, and lithium-ion battery manufacturing capacity are putting the region at the forefront of an American industrial renaissance. Manufacturing construction spending is at record highs, reaching $3.3 billion for the region in June 2023, a 150% increase over the pre-COVID average. These manufacturing announcements are just the most visible pieces of what is, so far, a historic economic recovery. Since COVID, the US economy has returned to pre-crisis levels of employment and growth faster than in any post-recessionary period of the past half-century. The labor market is the tightest in a generation, which is pushing up real wages, particularly among lower-income and marginalized communities. Measures of economic dynamism, like startup business formation and new firm job creation, are up to rates not seen since long before the Great Recession. These macro factors, despite a hiking interest rate environment, are powerful motivators of risk-taking and creative destruction, creating positive conditions for developers and investors to take chances on new opportunities. It is in this context that the federal government has further injected hundreds of billions of dollars into incentives for energy transition industries, left-behind places, and blue-collar workers. Between the 2022 Inflation Reduction Act (IRA), the 2021 Infrastructure Investment and Jobs Act (IIJA), and the 2022 CHIPS and Science Act, the federal government has rediscovered its capacity for coordinated industrial strategy. This approach has the potential to reshape the US economy in a way that leaves it cleaner, fairer, and more dynamic — but only if private investors, state legislatures, community organizations, and economic developers step up to the plate. Learning from past mistakes, these federal initiatives are designed not to pick winners, but rather to boost competitiveness, overcome constraints, and incentivize cooperation. Strategies regarding these Three C’s — competitiveness, constraints, and cooperation — should be at the heart of any region’s plan for energy transition investment. When analyzing the Great Lakes through this framework, several major themes and priorities become clear for the region. [i] In this report, we define the Great Lakes as the region extending from Minnesota through Wisconsin, Illinois, Indiana, Michigan, Ohio, and Pennsylvania. Competitiveness Great Lakes states are likely to be more competitive in energy transition industries where they have related existing capabilities. The feasibility of transitioning into these sectors can be measured using the tools of economic complexity, as shown in our Great Lakes Development Tool. Most states lack coherent or cohesive industrial strategies for priority energy transition industries. In the three priority industries where RMI has conducted deep-dive analyses — EV batteries, near-zero-emissions steel, and sustainable aviation fuels — no Great Lakes state has a strong policy mix in every major domain of a coordinated industrial strategy. The use of incentives to attract strategic projects can bolster competitiveness and economic development in a region if targeted appropriately and when conducted with best-practice program design. States and economic development organizations (EDOs) should look to incorporate more quantitative evidence in their incentive decisions, while reforming key programs to include best-practice features like clawback provisions and transparency requirements. Great Lakes states, cities, companies, and universities are already mobilizing to take advantage of a historic set of federal programs designed to encourage new clusters of innovative energy transition industries throughout the United States. Policymakers should be thinking about how to how to help successful funding recipients to develop these hubs of economic development opportunity and even consider whether coalitions that miss out on federal funding could develop with state-level resources. Constraints The Great Lakes region has suffered acutely from slow aggregate demand growth, with some of the weakest economic and population growth in the country. The robust post-COVID economic recovery, particularly in the labor market, is an opportunity for the region to encourage economic dynamism and investment in high-productivity sectors that can turn these factors around. Despite the region’s historic strengths in manufacturing, the South has continued to see faster job growth and more projects in the sector. With the energy transition providing one of the largest opportunities for the reshoring of manufacturing jobs in decades, the Great Lakes’ ability to take advantage of relevant federal provisions will be critical to reestablishing the region’s manufacturing competitiveness. Great Lakes states have made uneven progress on clean electricity, potentially inhibiting their abilities to attract new investments and meet ambitious emissions targets. Some states, like Illinois and Minnesota, have passed important state legislation to accelerate these transitions, while others, like Indiana and Ohio, remain well behind. Worker shortages are a critical challenge in all states but have been especially acute in the Great Lakes, where labor markets are tight and both domestic and international migration flows are low. Some states are being more proactive than others in identifying these workforce needs and preparing to fill them over time. Illinois, for example, is a national leader in this space, commissioning a clean energy jobs and training program inventory that other states, or indeed the region as a whole, would greatly benefit from imitating. The Great Lakes has a mixed record on issues of equity and justice, particularly in the context of the energy transition. Again, Illinois and Minnesota are national leaders in this space, and other states would benefit from implementing similar approaches across the major themes of best-practice energy justice policy. The Great Lakes region also has a rich history as a center of American innovation, and this remains true in emerging sectors of the energy transition like EV batteries, sustainable fuels, and low-carbon metals. State policymakers should provide further support for these ecosystems of invention, entrepreneurship, and cluster development. Coordination In emerging legislative priorities, Great Lakes states should be coordinating to share best practices and imitate novel solutions where they have common challenges and opportunities. In particular, Great Lakes states share similar regulatory and tax barriers to clean electricity deployment, can develop similar green banks, and implement similar competitiveness funds to access federal funding. Another example of a relatively low-cost form of cooperative economic development could be a regional investment attraction strategy. By promoting the common sources of investment attractiveness in the region — such as workforce skills, industrial capacity, infrastructure, and natural resources — while providing educational material on subregional specializations, all Great Lakes states and metros would stand to gain as foreign-domiciled companies and investors narrow their site search to the region. Competitiveness Economic development is a function of competitiveness — of the specialized knowledge and networks it takes to create world-class products. Each region has unique capabilities it can translate into new sources of competitiveness and economic development. What you created yesterday will limit or expand what you can create tomorrow. States, cities, and EDOs can strategically enhance their competitiveness by focusing on four areas: Prioritizing high-potential industries with quantitative measures Developing sector-specific and coordinated industrial strategies Aligning economic development incentives with proven best practices Taking advantage of federal place-based economic programs Industry Prioritization State policymakers and EDOs can compete in the energy transition by prioritizing industries where they already have the related workforce skills, physical infrastructure, knowledge networks, and natural resources to compete. RMI has worked with the Workforce of the Future Initiative at the Brookings Institution to create feasibility metrics for every metro in the Great Lakes region, helping local actors identify what energy transition industries they are most likely to be able to compete in based on existing implicit capabilities. The online Clean Growth Tool gives metros in the region an opportunity to identify strategic energy transition industries for them to move into. This tool can help stakeholders to better understand the unique opportunities in their region and develop more effective strategies for nurturing these high-priority industries. For example, based on this approach, Columbus, Ohio, should prioritize manufacturing EVs, energy transmission equipment, and, to a lesser extent, low-carbon iron and steel. The table below identifies the five most feasible energy transition industries for select Great Lakes cities. These are examples of industries each city can develop using current competitive strengths. Policymakers and EDOs can use this data and local knowledge to prioritize the energy transition industries that are most likely to deliver sustained, inclusive economic development in their local communities. Sector-Specific and Coordinated Industrial Policies Globally, industrial policy is continuing to gain traction as countries work to accelerate their own energy transition and compete in new markets for clean energy technologies. The term “industrial policy” simply refers to any goal-oriented state action whose “purpose is to shape the composition of economic activity.” Industrial policy is different from economic development because it exclusively refers to actions directed at changing the structure of the economy and does not include investment attraction or efforts to retain existing industries. Nor is industrial policy the same as climate policy. Traditionally, climate policy has focused on demand-side solutions, while where the supply of clean energy technologies comes from has been of little consequence. Instead, energy transition industrial policy focuses on building out domestic supply through sector-specific strategies that incentivize production, create new markets, and coordinate across key enabling inputs like electricity, labor, land, and capital. This approach helps not only mitigate carbon emissions but also improve supply chain resilience, drive down the cost of these technologies, empower political coalitions, and create sustained economic development opportunities. Working from a framework developed by the Organization for Economic Co-operation and Development, RMI has conducted a unique industrial policy gap assessment of every Great Lakes state and the federal government with respect to three potential high-priority industries — the EV battery supply chain, near-zero-emissions steel, and sustainable aviation fuels — and conducted a deep-dive analysis into their techno-economic potential in the region. This analysis can help states identify gaps in their industrial policy approach in these sectors and chart legislative priorities to boost competitiveness going forward. In EV battery manufacturing, for example, the figure below shows the four domains of industrial policy and illustrates which states RMI analysis rates as weak, moderate, and strong in these areas. Only Michigan has strong strategic coordination of its policies and economic development mechanisms, while only Minnesota has implemented relevant demand-side mechanisms. When it comes to enabling inputs to the industry, no state has a set of policies to encourage end-of-life and recycling of EV batteries, and the state of encouraging clean electricity throughout the region is mixed. Best-Practice Economic Development Incentives The Great Lakes is an established leader in economic development policy and implementation, with some of the most robust EDOs in the country and generous programs of investment attraction and retention. Yet in program design and industry targeting, opportunities remain for the region to improve its effectiveness and capitalize on the growing energy transition sector. States and cities should concentrate their development incentives on retaining and building on existing clusters and industrial capacities, rather than trying to create new specializations out of whole cloth. One proxy of whether this is taking place is industry feasibility, as described above, which measures the relatedness of capabilities between industries. To date, however, there is little indication of such targeting taking place. Of the announced energy transition projects nationwide since early 2021 with available subsidies data, for example, most subsidies have gone to projects with lower feasibility scores relative to the national average in that industry. This suggests these projects are more likely to have to bring in workers from outside the metro area, are less likely to see clusters develop around these anchor projects, and will have fewer productivity spillovers in related industries. Another means of improving the impact of economic development incentives is in the design of the programs themselves. Incorporating best-practice design features — including transparency, quantitative targeting, institutional guardrails, and clawback provisions — can improve program effectiveness. Among the largest discretionary programs in the Great Lakes region, adoption of these best practices is uneven at best, as shown in the gap analysis figure below. As the Great Lakes looks to take advantage of investment opportunities in the energy transition and deliver sustained development impacts in local communities, states would be well advised to revisit their economic development programs with these best practices in mind. Federal Place-Based Policy Opportunities The federal government is engaging in an ambitious place-based economic program to encourage regional innovation clusters, creating new opportunities for the Great Lakes region to develop world-beating hubs of exports and innovation. These programs include the $1 billion Build Back Better Regional Challenge under the American Rescue Plan Act (2021); the $8 billion Regional Clean Hydrogen Hubs and $3.5 billion Regional Direct Air Capture Hubs under the IIJA; and the $6.5 billion Regional Innovation Engines and $10 billion Regional Technology and Innovation Hubs under the CHIPS and Science Act. Additionally, several federal programs explicitly target disadvantaged and at-risk communities through quantitative screening tools. Constraints For all the recent policy momentum and signs of an economic recovery, major constraints still stand in the way of a robust, competitive energy transition sector in the Great Lakes. The lost decade of the post–Great Recession period has left deep scars across the country, and the Great Lakes has been no exception. Meanwhile, automation and globalization have hollowed out hundreds of manufacturing communities across the region, even as the digital revolution concentrated new sources of economic opportunity in a few metropolises. In the 2010s, these forces led to a broad slowdown in investment, dynamism, and innovation in the US economy as entrepreneurs stopped starting new businesses, workers stopped moving for new opportunities, and companies prioritized shareholder returns over new product lines. These are powerful constraints that cannot be overcome overnight, and while there are early signs of a positive turnaround, new technologies and policy tools will play a critical role in sustaining these developments into the future. The Constraints section of this report identifies some of the constraints holding back the Great Lakes’ competitiveness in emerging energy transition sectors and connects these to new policy and technology opportunities. These include lackluster economic growth, the southern migration of manufacturing capacity, stilted clean electricity deployment, labor shortages, inequality, and failure to capitalize on regional innovation ecosystems. These constraints span the macro and micro, the structural and political. The Great Lakes region has suffered from particularly poor aggregate demand and population growth, for example, forces over which state and local actors have only limited control. On the other hand, policy decisions can have a significant impact on the region’s lower attractiveness for new manufacturing projects or slower growth in clean electricity deployment. There are also large differences among states within the region, of course. Some, like Wisconsin and Pennsylvania, are proving to be national leaders in workforce development. Others, like Illinois and Minnesota, have demonstrated global leadership in their approaches to environmental justice and energy equity. Further, there are emerging hubs of clean energy innovation within the region, like Detroit in EVs and batteries; Columbus, Indiana, in sustainable fuels; and Cincinnati in low-carbon metals. Between large fiscal stimulus, programs to onshore clean energy supply chains, generous incentives for clean electricity, and increased funding for R&D throughout the energy transition, federal policy levers can play a major role in addressing these constraints. But so can state and local initiatives, particularly in workforce development, permitting and siting, and equity and justice. Coordination Finally, the very notion of multistate regions is underexplored in economic development and energy transition strategies. The Great Lakes states share a variety of political, economic, and social characteristics that could allow them to scale best-practice solutions through coordination and imitation. Meanwhile, the region’s states and cities could maintain a healthy competition with one another, encouraging improvement in each new iteration of these strategies. Further, this interstate approach could be a significant driver of competitiveness in the context of industry clusters that operate across state lines, such as the emerging “Battery Belt” that stretches from Michigan to Alabama. By harmonizing regulation and addressing common constraints, the Great Lakes region can situate itself as the premier destination for new investment, lifting up hundreds of communities in a strategy of specialized interconnection. Sharing Legislative Best Practices The Great Lakes is a hotbed of democratic experimentation with new policy ideas being tried and tested with every new legislative session. The legislative response to the accelerating energy transition and recent federal legislation has been no different. Three emerging themes within this legislation are (1) a desire to remove local regulatory barriers to clean energy deployment; (2) the establishment of green banks to access new federal funding; and (3) the creation of competitiveness funds to accelerate uptake of IRA, IIJA, and CHIPS incentives. Removing Local Regulatory Barriers to Clean Energy Development One shared approach to accelerating clean energy deployment in the region appears to be a desire to simplify tax requirements and encourage communities to adopt best practices in zoning and other areas. Many township and rural zoning ordinances make it difficult, risky, and\/or costly for solar and wind projects to be developed. In response, Michigan has passed a series of bills and budgetary programs designed to complement the IRA’s incentives for clean electricity development. The state’s Solar Energy Facilities Taxation Act (2023) reduces the tax burden of solar farms by allowing cities, townships, and villages to establish solar energy districts where they will not levy value-based taxes but rather apply a fixed tax rate based on the output of the solar farm, similar to Ohio’s Payment in Lieu of Taxes program. Considerable attention has been paid to permitting and siting reform at the federal level in recent months; however, state and local solutions are likely to be just as — if not more — important. When these efforts show promise, neighboring states and cities should cooperate to learn what has worked and what needs to change for their specific context. Streamlining and, where appropriate, removing local regulations and taxes that impede clean electricity deployment could provide a competitive edge for the region as it seeks to deliver the clean, cheap, and reliable energy its growing manufacturing and industrial sectors need. Establishing New or Expanded Green Banks Another common priority among state legislatures is an attempt to take advantage of the federal government’s $27 billion Greenhouse Gas Reduction Fund (GGRF) and create state or city green banks. The GGRF is the largest IRA program explicitly for disadvantaged communities, and funds have to support these communities. Green banks can be an important source of low-cost capital for emerging cleantech sectors in a state or community. In 2022, active green banks in the United States facilitated $4.64 billion in clean energy projects at a two-to-one leverage ratio with private capital. Since 2011, these lenders have helped create more than $14.8 billion in cumulative public–private investment. The Great Lakes region has a number of existing green banks that are well positioned to take advantage of additional capital allocations thanks to the GGRF, and several states are establishing new institutions modeled off these banks. In Minnesota, the state legislature recently established the Minnesota Climate Innovation Finance Authority with an initial $45 million capitalization. In April 2023, Governor Tony Evers of Wisconsin signed an executive order to begin the process of creating a Green Innovation Fund in the state. Reportedly, Pennsylvania lawmakers are also considering establishing a green bank to leverage GGRF funding. Authorizing Competitiveness Funds to Provide Broader Access to Federal Programs Between the IRA, CHIPS, and IIJA, there are more than 500 programs and potentially over $1 trillion worth of federal energy transition funding available for states, cities, community organizations, and economic developers to access and leverage. This creates significant complexity for states and local actors, many of whom lack adequate resources to develop federal grant proposals, set up coalitions, or overcome the technical hurdles to new project development. As such, several states are setting up competitiveness funds to provide monetary and, in some cases, technical resources so a broad suite of organizations can make the most of this federal funding opportunity. Minnesota and Michigan have already created such funds in their legislature and budget, respectively. Minnesota’s $190 million State Competitiveness Fund provides matching grants for IRA programs that require nonfederal matching, while also providing grant development assistance for nongovernmental organizations and other local entities. Michigan’s $350 million Make it in Michigan Competitiveness Fund is designed to leverage funding opportunities in formula- or competitive-based grants, cooperative agreements, and contracts. With historic federal funding on the table, the remaining Great Lakes states would be well advised to consider similar competitiveness funds of their own. This report — alongside three priority industry deep-dive briefs, an overview of the energy transition economy from the Brookings Workforce of the Future Initiative, a regional investment attraction strategy from OCO Global, and an online industry prioritization and workforce development data tool — represents the first stage of a collaborative energy transition investment strategy for the Great Lakes region. By no means an exhaustive analysis of the Three C’s of an investment strategy, we hope it can be a resource for policymakers, economic developers, and communities looking to take advantage of this historic moment.","filter_flag":1}
