{"title":"The Ball Valve Transformation – GF Piping Systems expands its line of Pro Ball Valves - GF Piping Systems - Cision News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiigFodHRwczovL25ld3MuY2lzaW9uLmNvbS9nZi1waXBpbmctc3lzdGVtcy9yL3RoZS1iYWxsLXZhbHZlLXRyYW5zZm9ybWF0aW9uLS0tZ2YtcGlwaW5nLXN5c3RlbXMtZXhwYW5kcy1pdHMtbGluZS1vZi1wcm8tYmFsbC12YWx2ZXMsYzM4MTkzOTTSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiigFodHRwczovL25ld3MuY2lzaW9uLmNvbS9nZi1waXBpbmctc3lzdGVtcy9yL3RoZS1iYWxsLXZhbHZlLXRyYW5zZm9ybWF0aW9uLS0tZ2YtcGlwaW5nLXN5c3RlbXMtZXhwYW5kcy1pdHMtbGluZS1vZi1wcm8tYmFsbC12YWx2ZXMsYzM4MTkzOTTSAQA?oc=5","id":"CBMiigFodHRwczovL25ld3MuY2lzaW9uLmNvbS9nZi1waXBpbmctc3lzdGVtcy9yL3RoZS1iYWxsLXZhbHZlLXRyYW5zZm9ybWF0aW9uLS0tZ2YtcGlwaW5nLXN5c3RlbXMtZXhwYW5kcy1pdHMtbGluZS1vZi1wcm8tYmFsbC12YWx2ZXMsYzM4MTkzOTTSAQA","guidislink":false,"published":"Thu, 17 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=229, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiigFodHRwczovL25ld3MuY2lzaW9uLmNvbS9nZi1waXBpbmctc3lzdGVtcy9yL3RoZS1iYWxsLXZhbHZlLXRyYW5zZm9ybWF0aW9uLS0tZ2YtcGlwaW5nLXN5c3RlbXMtZXhwYW5kcy1pdHMtbGluZS1vZi1wcm8tYmFsbC12YWx2ZXMsYzM4MTkzOTTSAQA?oc=5\" target=\"_blank\">The Ball Valve Transformation – GF Piping Systems expands its line of Pro Ball Valves - GF Piping Systems<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cision News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Ball Valve Transformation – GF Piping Systems expands its line of Pro Ball Valves - GF Piping Systems - Cision News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiigFodHRwczovL25ld3MuY2lzaW9uLmNvbS9nZi1waXBpbmctc3lzdGVtcy9yL3RoZS1iYWxsLXZhbHZlLXRyYW5zZm9ybWF0aW9uLS0tZ2YtcGlwaW5nLXN5c3RlbXMtZXhwYW5kcy1pdHMtbGluZS1vZi1wcm8tYmFsbC12YWx2ZXMsYzM4MTkzOTTSAQA?oc=5\" target=\"_blank\">The Ball Valve Transformation – GF Piping Systems expands its line of Pro Ball Valves - GF Piping Systems<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cision News<\/font>","source.href":"https:\/\/news.cision.com","source.title":"Cision News","query":"https:\/\/news.google.com\/rss\/search?q=\"Long-lasting materials\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"The Ball Valve Transformation – GF Piping Systems expands its line of Pro Ball Valves Thu, Aug 17, 2023 15:31 CET Report this content The Ball Valve 523 Pro and Ball Valve 546 Linear Pro have joined the Swiss flow solution provider’s growing product family of state-of-the-art and interoperable solutions for Process Automation. The line-up features corrosion-free materials, a simple and reliable operation, as well as various actuation options. Ball Valves are an essential part of every piping system and come in a variety of sizes, materials, and actuation technologies. They are used to regulate, mix, or distribute media in applications ranging from water treatment and desalination all the way to complex chemical and pharmaceutical processes. Starting with the Ball Valve 546 Pro in 2019, GF Piping Systems has created a product platform designed to meet the especially high demands of modern industries. Now, the company has introduced two additions to the product range with the Ball Valve 546 Linear Pro and the 523 Pro. The updated valves share all the features previously introduced to the Pro line. These include a lockable lever as standard, new stems with a reinforced security break point, and a Data-Matrix-Code for full traceability. Furthermore, they are available with additional accessories such as an LED position feedback sensor, or a dead-man lever for added safety. Additionally, they feature an automation interface that is suitable for pneumatic, electric, and smart actuators, introducing additional functionality. The Ball Valve 546 Linear Pro is a control valve that was developed for applications that require linear flow characteristics and can be operated with an opening between 0% and 100%. The 546 Linear Pro features an imprinted scale which shows the flow rate at a glance during manual operation and is lockable at predefined markings. Due to its construction, it enables high flow values while minimizing dead spaces. The Ball Valve 523 Pro, on the other hand, is a metering valve that was designed to dose and sample different types of media in the dimensions DN10 and DN15. It too features an imprinted scale showing the current opening angle between 0° and 180° and is also lockable at predefined markings. As a result, the 523 Pro is suited for precise flow rates and is capable of very accurately sampling small amounts. Yannic Ohms, Head of Product Management Valves at GF Piping Systems, emphasizes the importance of the two new products. “With the Pro line-up of ball valves, we are focusing on a clear goal: We want to offer our customers complete solutions that combine proven and long-lasting materials with new features and cutting-edge automation technology – from simple installations to complex industrial plants. The Ball Valve 546 Linear Pro and 523 Pro increase the functionality of the range and provide customers with even more options for modern valve technology.” The Ball Valve 546 Linear Pro and 523 Pro will be available from July 2023 in dimensions ranging from DN10 to DN50 and DN10 to DN15, respectively. Find out more about the Ball Valve 546 Linear Pro Find out more about the Ball Valve 523 Pro Constanze Werdermann Global PR Manager +41 763 399 218 constanze.werdermann@georgfischer.com GF Piping Systems As the leading flow solutions provider for the safe and sustainable transport of fluids, GF Piping Systems creates connections for life. The division focuses on industry-leading leak-free piping solutions for numerous demanding end-market segments. Its strong focus on customer-centricity and innovation is reflected by its global sales, service, and manufacturing footprint and its award-winning portfolio, including fittings, valves, pipes, automation, fabrication, and jointing technologies. GF Piping Systems has its own sales companies in 31 countries, which means it is always by its customers' side. Production sites in 36 locations in America, Europe, and Asia ensure sufficient availability and quick, reliable delivery. In 2022, GF Piping Systems generated sales of CHF 2'160 million and employed 8'085 people. GF Piping Systems is a division of Georg Fischer AG, founded in 1802 and headquartered in Schaffhausen, Switzerland. www.gfps.com","filter_flag":1}
