{"title":"A look at FedEx's sustainability policy - Sustainability Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vc3VzdGFpbmFiaWxpdHltYWcuY29tL25ldC16ZXJvL2RlbGl2ZXJpbmctc3VzdGFpbmFiaWxpdHnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vc3VzdGFpbmFiaWxpdHltYWcuY29tL25ldC16ZXJvL2RlbGl2ZXJpbmctc3VzdGFpbmFiaWxpdHnSAQA?oc=5","id":"CBMiQGh0dHBzOi8vc3VzdGFpbmFiaWxpdHltYWcuY29tL25ldC16ZXJvL2RlbGl2ZXJpbmctc3VzdGFpbmFiaWxpdHnSAQA","guidislink":false,"published":"Sat, 28 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=28, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vc3VzdGFpbmFiaWxpdHltYWcuY29tL25ldC16ZXJvL2RlbGl2ZXJpbmctc3VzdGFpbmFiaWxpdHnSAQA?oc=5\" target=\"_blank\">A look at FedEx's sustainability policy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sustainability Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"A look at FedEx's sustainability policy - Sustainability Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vc3VzdGFpbmFiaWxpdHltYWcuY29tL25ldC16ZXJvL2RlbGl2ZXJpbmctc3VzdGFpbmFiaWxpdHnSAQA?oc=5\" target=\"_blank\">A look at FedEx's sustainability policy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sustainability Magazine<\/font>","source.href":"https:\/\/sustainabilitymag.com","source.title":"Sustainability Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Where does FedEx stand today in terms of carbon neutrality and sustainability? As one of the world’s largest express transportation companies, we recognize the importance of taking action in addressing climate challenges and the positive impact we can make for our industry and our communities. In March 2021, we set an ambitious global goal to achieve carbon-neutral operations by 2040, 10 years earlier than the timeline laid out by the Paris Climate Agreement. We plan to achieve this through enterprise-wide initiatives that focus on vehicle electrification, sustainable fuels, fuel conservation and aircraft modernization, more efficient facilities, and natural carbon sequestration. We’ve set timetables and targets against these and established teams to execute against our plans. We are also collaborating with NGOs and other institutions throughout AMEA that are leading the charge on sustainability and helping restore and protect the environment. For instance, this year we are discontinuing the production of all seasonal paper products and printed calendars used in customer gifting and instead introducing a new AMEA sustainability customer engagement program. Through this we will be planting 48,000 trees to honor our FedEx customers as they join us in our focus on environment protection. Our 2040 target is an ambitious one which is why we’ve pledged an initial investment of more than $2 billion to help achieve it. This goal expands on existing actions to connect the world responsibly and resourcefully: from FY09 through FY21, we reduced our emissions intensity by 45% during a period when our average daily package volumes grew by 180%. What strategies has FedEx deployed in the AMEA region to achieve carbon neutrality? Our roadmap to carbon neutrality by 2040 lays out initiatives across our entire organization and there’s a common strategy woven throughout our sustainability efforts: reduce, replace, and revolutionize. We're focused on reducing emissions and waste, replacing older technologies and vehicles with more efficient ones, and revolutionizing our operations with new technologies. Every day, over 16 million packages pass through FedEx facilities globally. That makes our packaging an obvious place to start. I’m happy to say that 100% of FedEx packaging is now recyclable, and 49% is made from recycled materials. Across the AMEA region we are bringing more electric vehicles (EVs) into our network. So far, we’ve made significant progress with the deployment of over 250 EVs across China and that will increase to over 460 by the middle of 2023. We have also introduced our first zero-tailpipe emissions electric vehicles in Thailand and we are conducting EV trials in India with more planned in the coming year in other markets. Like any other industry, we are leaning on advanced technologies to explore new possibilities in operational efficiency that ultimately will contribute to reducing carbon emissions. For example, in China, we’re testing the use of autonomous vehicles to advance emissions-free ‘last-mile’ delivery. Our analytics team in Singapore is also working with FedEx Dataworks, which is steering the company’s digital transformation using data to help optimize internal operations, to apply technologies like artificial intelligence (AI) and machine learning into our internal systems that will make us more efficient. In markets like Singapore and China , we introduced Artificial Intelligence (AI)- powered robotic sorting arms at our sorting centers and hubs which is driving overall operational efficiency, as we continue to build a smart logistics network. What sort of role does sustainability play in the design of new products and infrastructure? Can you provide specific examples? Sustainability is a key driver in everything we do because it works hand in hand with greater operational efficiency and customer experience. Our own research shows that customers want both sustainable delivery and speedy delivery together, and don’t want to compromise in having one instead of the other. Digital technology is helping us innovate to provide more paperless solutions and more convenience for our customers. With millions of packages in our system every day, each and every way we can find to minimize paper usage makes a difference. For example, by using our Electronic Trade Documents, customers can now submit information essential for customs clearance electronically. This means there’s no need to attach printed paperwork to each shipment and delays at customs can be avoided. We have more than 5,000 air and ground hubs, local stations, freight service centers, and retail locations around the world and we understand the contribution they make to our carbon footprint. That’s why we’ve been building our facilities with sustainability in mind over the past decade to help ensure energy efficiency. Some of our newest facilities in places like Johannesburg in South Africa, Clark in the Philippines and Hong Kong incorporate multiple layers of sustainability features from construction materials to lighting, ventilation, insulation, water recycling, renewable power generation. In South Korea, our new Incheon gateway which opened in November this year is a great example. It’s a G-SEED (Green Standard for Energy and Environmental Design)-certified building that can generate renewable energy through 2,400 solar panels on its rooftop which will supply approximately 19% of its energy needs per month. It has a green roof to reduce heat flux and energy consumption for cooling or heating. The building also has a 1,000 square meter skylight to increase the amount of natural light and uses 100% LED lighting throughout to save more than 22,000kW per year compared to traditional lighting. It also collects and reuses rainwater on site. Our upcoming hub in Adelaide, Australia will incorporate similar features. What technologies does the company rely on to ensure sustainability? When we think about sustainability, we take both an immediate and long-term view. Converting our entire pickup and delivery fleet to zero-tailpipe emissions vehicles, for example, isn’t going to happen overnight as manufacturing and infrastructure scale up to meet growing demand for EVs. We aim for 50% of new vehicle purchases to be electric by 2025 increasing to 100% by 2030. That will help get us to our goal of making our entire pickup and delivery fleet electric by 2040. What we are doing at the same time is applying digital technologies including machine learning, artificial intelligence, and advanced analytics to improve the efficiency of our operations and predict problems before they happen. For instance, to optimize the efficiency of every vehicle in our fleet we are installing updated GPS tracking systems that provide the most efficient route, helping to save time, optimize driving distance, and help to reduce emissions. With e-commerce growing at a compound annual growth rate of 10% in APAC, we’re looking carefully at how we’re managing last-mile delivery to residential addresses. Delivery lockers are a great example. By providing delivery lockers in convenient locations in local neighbourhoods we meet customers where they want to pick up and reduce emissions and traffic congestion from wasted journeys for failed deliveries when the recipients aren’t home. Digital tools such as FedEx Delivery Manager work in parallel allowing recipients to schedule when and where their shipment is delivered so they are there to receive it. When it comes to achieving true sustainability in aviation, we are taking a long-term and multi-faceted approach. Today there are few viable alternatives to replace carbon-based jet fuels at the scale needed for the entire aviation industry. So, while we are investing in aircraft modernization and advocating for the scaling up of the sustainable aviation fuels—or SAF—market, we have also pledged $100 million to Yale University to help establish the Yale Center for Natural Carbon Capture and accelerate research into methods of carbon sequestration at scale, with an initial focus on helping to offset greenhouse gas emissions equivalent to current airline emissions. What does FedEx hope to achieve in terms of sustainability in the next 18-24 months? We’re focused on taking a combination of many small steps alongside big steps to multiply efficiencies across our operations to generate real results. What will be most visible to our customers will be the continued expansion of our digital solutions so that more of their interactions with us can be self-serve and completed with just a click. Customers in an increasing number of markets in the AMEA region will also be seeing more FedEx EVs on the roads. As customers look to us to help them reduce their carbon footprint within their supply chains, we are developing other data-driven tools that give them visibility into the CO2 emissions their shipping choices create. In this way, our customers can make more informed, sustainability-driven choices based on the options available. But there will also be a lot of change taking place internally that will be invisible to customers at our facilities and in our processes that will have a positive contribution to our long-term goals. We are committed to being transparent in reporting what we’ve achieved and what we’re prioritizing in our annual ESG reporting. For the past 50 years FedEx has always been a pioneer in our industry and we want to continue to lead in our sustainability efforts as well.","filter_flag":1}
{"title":"Top fashion executives share their 2023 sustainability agendas - Vogue Business","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LnZvZ3VlYnVzaW5lc3MuY29tL3N1c3RhaW5hYmlsaXR5L3RvcC1mYXNoaW9uLWV4ZWN1dGl2ZXMtc2hhcmUtdGhlaXItMjAyMy1zdXN0YWluYWJpbGl0eS1hZ2VuZGFz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LnZvZ3VlYnVzaW5lc3MuY29tL3N1c3RhaW5hYmlsaXR5L3RvcC1mYXNoaW9uLWV4ZWN1dGl2ZXMtc2hhcmUtdGhlaXItMjAyMy1zdXN0YWluYWJpbGl0eS1hZ2VuZGFz0gEA?oc=5","id":"CBMia2h0dHBzOi8vd3d3LnZvZ3VlYnVzaW5lc3MuY29tL3N1c3RhaW5hYmlsaXR5L3RvcC1mYXNoaW9uLWV4ZWN1dGl2ZXMtc2hhcmUtdGhlaXItMjAyMy1zdXN0YWluYWJpbGl0eS1hZ2VuZGFz0gEA","guidislink":false,"published":"Thu, 12 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=12, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=12, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LnZvZ3VlYnVzaW5lc3MuY29tL3N1c3RhaW5hYmlsaXR5L3RvcC1mYXNoaW9uLWV4ZWN1dGl2ZXMtc2hhcmUtdGhlaXItMjAyMy1zdXN0YWluYWJpbGl0eS1hZ2VuZGFz0gEA?oc=5\" target=\"_blank\">Top fashion executives share their 2023 sustainability agendas<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vogue Business<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top fashion executives share their 2023 sustainability agendas - Vogue Business","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LnZvZ3VlYnVzaW5lc3MuY29tL3N1c3RhaW5hYmlsaXR5L3RvcC1mYXNoaW9uLWV4ZWN1dGl2ZXMtc2hhcmUtdGhlaXItMjAyMy1zdXN0YWluYWJpbGl0eS1hZ2VuZGFz0gEA?oc=5\" target=\"_blank\">Top fashion executives share their 2023 sustainability agendas<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vogue Business<\/font>","source.href":"https:\/\/www.voguebusiness.com","source.title":"Vogue Business","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"This article is part of our Vogue Business Membership package. To enjoy unlimited access to Member-only reporting and insights, our NFT Tracker and TikTok Trend Tracker, weekly Technology and Sustainability Edits and exclusive event invitations, sign up for Membership here. Some of fashion’s top executives predicted a year of sustainability action in 2023. For that to bear out, those same executives have to lead the way.","filter_flag":1}
{"title":"12 women cultivating sustainable food systems in 2023 - GreenBiz","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlLzEyLXdvbWVuLWN1bHRpdmF0aW5nLXN1c3RhaW5hYmxlLWZvb2Qtc3lzdGVtcy0yMDIz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlLzEyLXdvbWVuLWN1bHRpdmF0aW5nLXN1c3RhaW5hYmxlLWZvb2Qtc3lzdGVtcy0yMDIz0gEA?oc=5","id":"CBMiU2h0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlLzEyLXdvbWVuLWN1bHRpdmF0aW5nLXN1c3RhaW5hYmxlLWZvb2Qtc3lzdGVtcy0yMDIz0gEA","guidislink":false,"published":"Thu, 05 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=5, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=5, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlLzEyLXdvbWVuLWN1bHRpdmF0aW5nLXN1c3RhaW5hYmxlLWZvb2Qtc3lzdGVtcy0yMDIz0gEA?oc=5\" target=\"_blank\">12 women cultivating sustainable food systems in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GreenBiz<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"12 women cultivating sustainable food systems in 2023 - GreenBiz","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlLzEyLXdvbWVuLWN1bHRpdmF0aW5nLXN1c3RhaW5hYmxlLWZvb2Qtc3lzdGVtcy0yMDIz0gEA?oc=5\" target=\"_blank\">12 women cultivating sustainable food systems in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GreenBiz<\/font>","source.href":"https:\/\/www.greenbiz.com","source.title":"GreenBiz","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"This article originally appeared as part of our Food Weekly newsletter. Subscribe to get sustainability food news in your inbox every Thursday. With a new year comes new inspiration and the opportunity to embed more resilience, equity and climate-smart practices into food systems around the world. But these changes won’t magically occur. They will happen because of the diligent and strategic work of the people who believe in a better future and are making it happen. More often than not, those people are women. Yet they continue to be underrepresented in startup funding rounds, corporate leadership teams and conference panels. To continue highlighting women's groundbreaking work in this space, here’s our second annual list of women cultivating sustainable food systems. Of course, far more than 12 women merit being on this list. So please take this read merely as a first opportunity to expand your horizon and reflect on how you can work to uplift more diverse talent in 2023. Image courtesy of Barbara Guerpillon. Barbara Guerpillon Senior Director Ventures, Transformation & Sustainability, Dole Sunshine Company LinkedIn I Twitter Following five years at Unilever Foundry, Unilever’s global startup collaboration platform, Barbara Guerpillon jumped ship in 2020 for a similar endeavor at the Dole Sunshine Company. As its venture director, she has been leading a $2 million annual new fund at Dole that aims to support global strategic partnerships and innovation for sustainability, food access and waste. Through this approach, Guerpillon ensures that the fund’s investments and partnerships accelerate the company’s overall sustainability and nutrition goals. Two years into the job, the fund can increase the number of projects it supports, such as a 740-acre pilot farm in the Philippines. Regenerative agriculture practices that improve soil health and reduce reliance on fertilizers over the long term are Guerpillon’s top priority, alongside scalable bio-based solutions for pest and disease control. The year 2023 will also be about finding relevant monitoring technology partners to set baselines and develop measurement tools for carbon sequestration on Dole’s main plantation in the Philippines. Image courtesy of Perteet Spencer. Perteet Spencer Co-Founder, Ayo West African Foods LinkedIn I Twitter In just over 2.5 years, Perteet Spencer has shown that there's a home in U.S. mainstream grocery for the flavors of West Africa. Her Liberian roots inspired Ayo West African Foods. The company brings authentic, convenient and sustainable West African cuisine to America’s tables, answering an unmet need. Since 2020, when Spencer teamed up with her husband to start the brand, it has grown from 50 Whole Foods stores in the South to over 5,000 retail locations across the country. Spencer isn’t only bringing new flavors to the table but also generating social, economic and environmental benefits along Ayo’s supply chains. It taps into underused crops from the West African diaspora to create scalable demand for a much broader base of resilient and nutrient-dense inputs such as egusi seeds and red millet leaves. It also celebrates plant-based and upcycled ingredients as the heroes of the plate. In partnership with the non-profit Girl Power Africa, Ayo sources ingredients from farms in Monrovia, Liberia, that provide new income streams for women who were victims of the country’s civil war. As Spencer and her husband work to grow the brand in 2023, so will this collaboration. In addition, the Chicago-based brand is planning to open an innovation center in the city’s historic Auburn Gresham neighborhood that will serve as a community engagement hub. Image courtesy of Danielle Nierenberg. Danielle Nierenberg President, Food Tank LinkedIn I Twitter As co-founder and president of Food Tank, Danielle Nierenberg has long been at the forefront of food systems change. But even the work of established changemakers shouldn’t be taken for granted, especially when they take on bridge-building and educational activities that are often hard to measure. And Nierenberg and her team are becoming ever-more strategic about how they can help transform food systems the most effectively. In 2023, Food Tank is particularly excited about two projects. In partnership with the Swette Center for Sustainable Food Systems at Arizona State University, it will organize an event series for policymakers in Washington, D.C., to address hunger on college campuses. Conversations will focus on food insecurity among college students and solutions, leveraging the expertise of Food Tank’s academic working group. Nierenberg also plans to build further momentum around food systems at COP28 in Dubai. She will ensure that the climate change conference’s programming highlights food solutions and publish content about the negotiations on Food Tank’s website and in her newsletter. Image courtesy of Arohi Sharma. Arohi Sharma Deputy Director; Regenerative Agriculture, Nature Program, Natural Resources Defense Council LinkedIn I Twitter The Farm Bill negotiations will be a big deal this year. Arohi Sharma plans to work diligently to achieve policy changes across the food and agriculture system that center soil health as a climate solution. Her policy priorities stem from interviews with 113 farmers and ranchers to ensure that the Natural Resources Defence Council’s (NRDC) regenerative agriculture policy platform draws heavily on the lived experiences of a large constituency of growers from across the country. From the pool of ideas gathered through this process, Sharma and her team prioritized the ones centered around equity and Indigenous leadership in addition to their climate benefits. They first appeared in the \"Regenerative Agriculture: Farm Policy for the 21st Century\" report published last year. One of Sharma’s key recommendations targets the Federal Crop Insurance Program. Instead of subsidizing farming practices that degrade soil health, she wants the program to reward farmers for using methods that build soil health, thereby reducing their farms’ climate risk. Overall, Sharma hopes to see more acres under regenerative management while advancing equity and honoring Indigenous leaders for their land stewardship. Image courtesy of Nina Mannheimer. Nina Mannheimer Chief Product Officer and Co-Founder, Klim LinkedIn I Twitter In early 2020, Nina Mannheimer had been thinking about ways farming systems can transition from climate culprits to climate solutions when she met Robert Gerlach and Adiv Maimon in Berlin. Together, they interviewed over 100 farmers in Germany to identify the potential for transitioning to regenerative agriculture and the barriers standing in the way. This discovery process led them to found the startup Klim, which addresses the three critical roadblocks identified in the process: lack of knowledge; bridge financing; and appreciation by the public. Klim offers farmers a platform to adopt regenerative agriculture practices by providing access to knowledge, a community and funding. Mannheimer collaborates with food companies that aim to make their supply chains more climate-friendly and resilient or strive to offset emissions while supporting the transformation of German agriculture to fund farmer efforts. Consumers can contribute to the mission by buying products with the Klim label. For 2023, Klim is envisioning its European expansion. Image courtesy of Laura Lee Cascada. Laura Lee Cascada Campaigns Director, Better Food Foundation LinkedIn I Twitter How many campaigns do you recall that changed eating habits for the better, at scale and without nasty backlash? Probably not that many. Laura Lee Cascada is leading one campaign at the Better Food Foundation that might just be the exception: serving plant-based foods, by default. Its premise is simple yet effective. Public institutions like New York City’s hospitals, Amsterdam's city council, and Denver's sustainability council are making plant-based meals the default for diners and nudging them towards this healthier and more sustainable choice. At the same time, people can opt out and order a meal with meat or dairy instead. Reframing the diet shift as inclusive and protective of individual choice, rather than restrictive, has proven highly impactful: over 50 percent of New York's eligible hospital patients are eating plant-based meals through its Greener by Default initiative, despite only 1 percent identifying as vegetarian or vegan. This simple shift will affect up to 800,000 meals in New York City annually. Building on this momentum, Laura Lee Cascada is expanding this work into a global campaign to encourage other cities to follow in New York City’s footsteps. Her strategy includes grassroots organizing, coalition-building and creating a network of activists. Better Food Foundation estimates that cities could cut their food-related emissions by 40 percent and their water footprint by 24 percent when using plant-based defaults as a flexible climate policy. Image courtesy of Julia Person. Julia Person Sustainability Manager, Bob’s Red Mill LinkedIn I Twitter If things go according to Julia Person’s plans, 2023 will be the year of food waste reductions at Bob’s Red Mill, an Oregon-based natural foods company best known for its flour variety. Preventing food waste is an essential strategy for mitigating global warming and hunger. To act on this opportunity, the company was the first manufacturer that signed onto the Pacific Coast Food Waste Commitment (PCFWC), a public-private partnership fostering collaboration among food businesses and governments to cut food waste in half by 2030 along the West Coast. Person and her colleagues have set themselves up for success by engaging Bob’s Red Mill employees in an internal campaign that birthed 176 food waste prevention ideas. One idea was to reduce grain spillover from a conveyor belt by maintaining a metal screening tool that controls grain flow more regularly. The new procedure is already operational and has cut over 70 percent of food waste from the production line. Person noticed that implementing many other ideas will \"require education and shifts in our day-to-day mindset.\" So for her, cross-functional collaboration that embeds food waste prevention as the default way of operating will be on the docket this year. Through participation in PCFWC and other partnerships, she will continue to share her learnings widely with other food companies. Image courtesy of Carmen Burbano. Carmen Burbano Director, Food Based Programmes Division, World Food Programme LinkedIn I Twitter When COVID-19 started ravaging the world, much of Carmen Burbano’s 16-year service at the United Nations’ World Food Programme had focused on step-by-step improvements for school meals. And then, all of a sudden, almost all countries closed their schools in April 2020, leaving 370 million children without access to meals. A catastrophe — and a political moment that Burbano would not let go to waste. In their absence, governments and families realized how vital school meals were. Burbano and her team took the opportunity to respond to the crisis. They organized a group of 74 countries led by Finland and France to launch the School Meals Coalition during the United Nations Food Systems Summit in 2021. The coalition supports governments and their partners to improve or restore national, sustainable school meal programs and is harvesting the fruit of its labor after just one year. For example, Rwanda went from covering 660,000 children in early 2020 to 3.8 million students in 2022, with a budget increase from $33 million to $80 million, reports Burbano. She also looks at Benin, which expanded its school meal program coverage to 75 percent of the children. Going into 2023, Burbano and her team will ensure low-income countries can afford these programs and support the connection between school meals, food systems and climate change. Image courtesy of Ahrum Pak. Ahrum Pak CEO and Co-Founder, WNWN Food Labs LinkedIn I Twitter Ahrum Pak has good news and bad news for you. Let’s start with the bad ones: \"Chocolate has a truly dark side: it emits more CO2, pound-for-pound, than cheese, lamb or chicken,\" she told GreenBiz. But fortunately, it doesn’t mean you need to put this life-giving substance on your food blacklist. Pak is working on a softer alternative for the planet and the people producing it. In 2022, her food tech company WNWN Food Labs (pronounced win-win) was the first to sell cocoa-free chocolate. Being of Korean heritage, Pak’s fridge was always stocked with homemade kimchi, kkakdugi, fish sauce, gochujang and doenjang. This upbringing gave her the idea of using fermentation techniques for new products such as chocolate, a category that hasn’t seen much innovation in a long time. Fermentation transforms ingredients such as barley and carob into products with the taste and texture of chocolate. WNWN says its products emit 80 percent less carbon and use 90 percent less water than conventional chocolates. Pak plans to launch cocoa-free chocolate bars in U.K. retail stores and online this year. Pak hopes this alternative will reduce pressure from traditional cocoa supply chains, which have been fraught with issues ranging from deforestation to child labor. It might give traditional cocoa farmers more bargaining power and allow them to reduce their environmental impact while providing consumers with a transparent option. Image courtesy of Corey Ramsden Scott. Corey Ramsden Scott Livestock Sustainability Services Lead, Truterra LinkedIn Corey Ramsden Scott is embedding a more holistic sustainability approach to the dairy production system. In her work at Truterra, a Land O’Lakes subsidiary focused on carbon markets, she works with dairy farmers and other stakeholders along the supply chain. The collaborations aim to go beyond traditional concerns of manure management and tackle emissions from cow’s feed and their digestion, which account for the bulk of dairy’s overall emissions. In 2023, Ramsden Scott aims to expand a pilot approach she developed in collaboration with cheese manufacturer Bel Brands that will help the company advance its science-based targets. The pilot project helped a dairy farmer apply regenerative practices to its feed production that sequestered 784 pounds of carbon dioxide equivalent per acre per year, according to Truterra’s evaluation. In addition to carbon, she also evaluates changes to soil quality, erosion and fertilizer efficiency. Ramsden Scott plans to bring the approach to over a dozen additional farmers in the Bel Brands milk supply shed this year, in addition to developing new strategies to bridge the gap between the environment and farmers' and ranchers’ bottom lines. Image courtesy of Rasha Hasaneen. Rasha Hasaneen Vice President, Innovation and Product Management Excellence, Trane Technologies LinkedIn I Twitter Leveraging her heritage, network and day job, Rasha Hasaneen brought new technology to life that can make a real dent in food waste and support some of the world’s most marginalized communities. Hasaneen sponsored a project as part of Trane Technologies’ social innovation program that can help street vendors in rural parts of India and elsewhere keep their produce fresh for longer. \"Our field research showed that street vendors in more rural parts of India earn less than $5 a day while throwing away around 30 percent of their produce due to spoilage,\" Hasaneen told GreenBiz. \"Our solution aims to directly benefit low-income vendors, who play such an important role in access to food, while simultaneously reducing food waste.\" How? By providing them with a cart that uses the latest passive-radiative cooling technology that doesn’t require electricity. During the day, the canopy reflects sunlight and produces a radiative cooling effect, preventing fresh produce from ripening faster. At night, vendors can lower the canopy and use it as a cooler, allowing them to store and sell the produce the next day — thus improving their income. After successfully piloting in Kolar, India, Hasaneen will work to expand the cooling cart project in 2023. Image courtesy of Catherine Musulin. Catherine Musulin Head of Sustainability, Meati Foods LinkedIn I Twitter After leading Danone North America to become one of the largest B Corporations in the world, Catherine Musulin started a new chapter at the end of 2022 when she joined Meati Foods. The startup is producing meat from mycelium, the root-like structure of fungi. For Musulin, 2023 will be all about building out a sustainability strategy from scratch that will allow the innovators at Meati Foods to get things right from the get-go. She wants sustainability to \"never feel like an add-on, but instead, second nature, our culture.\" She’s excited about the opportunity at Meati Foods because meat from mycelium promises to have remarkably lower carbon, water and land footprints than its animal-based counterparts while offering rich nutrition and taste. She hopes that this fast-growing option will make sustainably produced food more accessible. Correction: This article has been updated to clarify Laura Lee Cascada's work at the Better Food Foundation","filter_flag":1}
{"title":"AgriSound's insect listening device installed at Cranswick farms to monitor pollination - Pig World","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5waWctd29ybGQuY28udWsvbmV3cy9lbnZpcm9ubWVudC9hZ3Jpc291bmRzLWluc2VjdC1saXN0ZW5pbmctZGV2aWNlLWluc3RhbGxlZC1hdC1jcmFuc3dpY2stZmFybXMtdG8tbW9uaXRvci1wb2xsaW5hdGlvbi5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5waWctd29ybGQuY28udWsvbmV3cy9lbnZpcm9ubWVudC9hZ3Jpc291bmRzLWluc2VjdC1saXN0ZW5pbmctZGV2aWNlLWluc3RhbGxlZC1hdC1jcmFuc3dpY2stZmFybXMtdG8tbW9uaXRvci1wb2xsaW5hdGlvbi5odG1s0gEA?oc=5","id":"CBMiiAFodHRwczovL3d3dy5waWctd29ybGQuY28udWsvbmV3cy9lbnZpcm9ubWVudC9hZ3Jpc291bmRzLWluc2VjdC1saXN0ZW5pbmctZGV2aWNlLWluc3RhbGxlZC1hdC1jcmFuc3dpY2stZmFybXMtdG8tbW9uaXRvci1wb2xsaW5hdGlvbi5odG1s0gEA","guidislink":false,"published":"Thu, 26 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=26, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=26, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5waWctd29ybGQuY28udWsvbmV3cy9lbnZpcm9ubWVudC9hZ3Jpc291bmRzLWluc2VjdC1saXN0ZW5pbmctZGV2aWNlLWluc3RhbGxlZC1hdC1jcmFuc3dpY2stZmFybXMtdG8tbW9uaXRvci1wb2xsaW5hdGlvbi5odG1s0gEA?oc=5\" target=\"_blank\">AgriSound's insect listening device installed at Cranswick farms to monitor pollination<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pig World<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"AgriSound's insect listening device installed at Cranswick farms to monitor pollination - Pig World","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5waWctd29ybGQuY28udWsvbmV3cy9lbnZpcm9ubWVudC9hZ3Jpc291bmRzLWluc2VjdC1saXN0ZW5pbmctZGV2aWNlLWluc3RhbGxlZC1hdC1jcmFuc3dpY2stZmFybXMtdG8tbW9uaXRvci1wb2xsaW5hdGlvbi5odG1s0gEA?oc=5\" target=\"_blank\">AgriSound's insect listening device installed at Cranswick farms to monitor pollination<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pig World<\/font>","source.href":"https:\/\/www.pig-world.co.uk","source.title":"Pig World","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Cranswick, the British food products supplier, has teamed up with biodiversity firm AgriSound to install in-field insect sensor devices at its pig farms in Norfolk and Lincolnshire. The solar-powered insect listening device – the Polly – uses advanced algorithms to allow Cranswick to monitor pollinator activity and to compare data across its sites, meaning that pollination can be tracked and biodiversity can be explored. It gives the company access to real-time data allowing them to manage their crop yield. Founder and chief executive of AgriSound, Casey Woodward, said that the Polly devices have been installed in specific areas around the farms and its built-in microphone and environmental sensors measure temperature, light and humidity. He continued: “Polly listens 24\/7 for the sounds of insects and uses advanced sound-analysis to translate the data into activity scores. These are automatically sent back to the cloud where the farmer can view them via an app or web application. “This information, available in real time, can be used to target the introduction of pollinator-protection measures to the areas of greatest need, and also determine actions such as the planting of wildflowers or creating new habitats.” Mr Woodward reported that data from the first two months of the Polly’s use at Cranswick has shown an impressive estimated level of around 48,800 pollinators across the farms. Ash Gilman, director of agricultural strategy at Cranswick, said that the device is allowing the company to gain an in-depth understanding of activity on the farms: “Pollinators not only form a central part of our ecosystem but are fundamental to the food cycle. The objective is to demonstrate how pigs can play a positive role within the rotation, benefitting soil health and carbon sequestration, as well as presenting new habitats to encourage and increase biodiversity.” Mr Gilman said that he has been pleased with the initial results; Cranswick will be continuing to monitor the devices and look forward to learning more about activity on the farms.","filter_flag":1}
