{"title":"[Galaxy Unpacked 2023] The Epic Rundown of Galaxy Innovations – Samsung Mobile Press - Samsung Mobile Press","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnNhbXN1bmdtb2JpbGVwcmVzcy5jb20vZmVhdHVyZS1zdG9yaWVzL2dhbGF4eS11bnBhY2tlZC0yMDIzLXRoZS1lcGljLXJ1bmRvd24tb2YtZ2FsYXh5LWlubm92YXRpb25z0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnNhbXN1bmdtb2JpbGVwcmVzcy5jb20vZmVhdHVyZS1zdG9yaWVzL2dhbGF4eS11bnBhY2tlZC0yMDIzLXRoZS1lcGljLXJ1bmRvd24tb2YtZ2FsYXh5LWlubm92YXRpb25z0gEA?oc=5","id":"CBMibmh0dHBzOi8vd3d3LnNhbXN1bmdtb2JpbGVwcmVzcy5jb20vZmVhdHVyZS1zdG9yaWVzL2dhbGF4eS11bnBhY2tlZC0yMDIzLXRoZS1lcGljLXJ1bmRvd24tb2YtZ2FsYXh5LWlubm92YXRpb25z0gEA","guidislink":false,"published":"Fri, 03 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=3, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=34, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnNhbXN1bmdtb2JpbGVwcmVzcy5jb20vZmVhdHVyZS1zdG9yaWVzL2dhbGF4eS11bnBhY2tlZC0yMDIzLXRoZS1lcGljLXJ1bmRvd24tb2YtZ2FsYXh5LWlubm92YXRpb25z0gEA?oc=5\" target=\"_blank\">[Galaxy Unpacked 2023] The Epic Rundown of Galaxy Innovations – Samsung Mobile Press<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Samsung Mobile Press<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"[Galaxy Unpacked 2023] The Epic Rundown of Galaxy Innovations – Samsung Mobile Press - Samsung Mobile Press","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnNhbXN1bmdtb2JpbGVwcmVzcy5jb20vZmVhdHVyZS1zdG9yaWVzL2dhbGF4eS11bnBhY2tlZC0yMDIzLXRoZS1lcGljLXJ1bmRvd24tb2YtZ2FsYXh5LWlubm92YXRpb25z0gEA?oc=5\" target=\"_blank\">[Galaxy Unpacked 2023] The Epic Rundown of Galaxy Innovations – Samsung Mobile Press<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Samsung Mobile Press<\/font>","source.href":"https:\/\/www.samsungmobilepress.com","source.title":"Samsung Mobile Press","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-conscious Materials\" \"new products\"+after:2023-02-01+before:2023-02-28","text":" Designed With the Planet in Mind At first glance, it isn’t easy to see how and where the Galaxy S23 series incorporates eco-conscious materials. However, the Galaxy S23 series was made with more recycled materials than ever, furthering Samsung’s inspiring vision for sustainability. The Galaxy S23 series incorporates more recycled material than any Galaxy smartphone to date. The latest Galaxy S23 series is made from recycled aluminum, glass and PET, in addition to repurposed ocean-bound plastic. What's more, with a 100% recycled paper package box and paper-based materials used for front and back protectors, the Galaxy S23 series is eco-conscious from the inside out. In total, the number of parts using recycled materials in the lineup increased to 12. Unfolding Galaxy Book3 Series at Galaxy Unpacked 2023 In the Galaxy Experience Space, visitors discovered a new addition to the Galaxy Book3 Series. Galaxy Book3 Ultra, introduced for the first time at Galaxy Unpacked along with the Galaxy Book3 Pro 360 and Galaxy Book3 Pro, supercharges users’ productivity and creativity with seamless multi-device continuity and powerful performance. The Galaxy Book3 series, consisting of the Galaxy Book 3 Ultra, Galaxy Book 3 Pro 360 and Galaxy Book 3 Pro, was announced at Galaxy Unpacked 2023. Galaxy Book3 Ultra’s new Dynamic AMOLED 2X display and 3K high resolution with a 16:10 screen ratio provide a rich and detailed viewing experience with its wide and immersive screen. Samsung introduces the power of Ultra to its PCs with the Galaxy Book3 Ultra, shown here next to the Galaxy S23 Ultra. ","filter_flag":1}
{"title":"The epic rundown of Galaxy innovations - GhanaWeb","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LmdoYW5hd2ViLmNvbS9HaGFuYUhvbWVQYWdlL05ld3NBcmNoaXZlL1RoZS1lcGljLXJ1bmRvd24tb2YtR2FsYXh5LWlubm92YXRpb25zLTE3MTk4NjPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LmdoYW5hd2ViLmNvbS9HaGFuYUhvbWVQYWdlL05ld3NBcmNoaXZlL1RoZS1lcGljLXJ1bmRvd24tb2YtR2FsYXh5LWlubm92YXRpb25zLTE3MTk4NjPSAQA?oc=5","id":"CBMiYWh0dHBzOi8vd3d3LmdoYW5hd2ViLmNvbS9HaGFuYUhvbWVQYWdlL05ld3NBcmNoaXZlL1RoZS1lcGljLXJ1bmRvd24tb2YtR2FsYXh5LWlubm92YXRpb25zLTE3MTk4NjPSAQA","guidislink":false,"published":"Thu, 23 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=23, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=54, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LmdoYW5hd2ViLmNvbS9HaGFuYUhvbWVQYWdlL05ld3NBcmNoaXZlL1RoZS1lcGljLXJ1bmRvd24tb2YtR2FsYXh5LWlubm92YXRpb25zLTE3MTk4NjPSAQA?oc=5\" target=\"_blank\">The epic rundown of Galaxy innovations<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GhanaWeb<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The epic rundown of Galaxy innovations - GhanaWeb","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LmdoYW5hd2ViLmNvbS9HaGFuYUhvbWVQYWdlL05ld3NBcmNoaXZlL1RoZS1lcGljLXJ1bmRvd24tb2YtR2FsYXh5LWlubm92YXRpb25zLTE3MTk4NjPSAQA?oc=5\" target=\"_blank\">The epic rundown of Galaxy innovations<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GhanaWeb<\/font>","source.href":"https:\/\/www.ghanaweb.com","source.title":"GhanaWeb","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-conscious Materials\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Press Releases of Thursday, 23 February 2023 Source: Samsung At this year’s Galaxy Unpacked, Samsung Electronics unveiled a lineup of new products that offered users the ultimate and most premium mobile experiences yet. At the same time, visitors dove headfirst into an interactive, immersive experience at the marquee Galaxy Experience Space in San Francisco, exploring the latest Samsung Galaxy innovations and experiencing these new products firsthand. Whether it’s getting behind the lens of Galaxy’s latest camera system or testing the potential of Galaxy’s connected ecosystem, the fan reaction to everything revealed on February 1 has been nothing short of epic. Keep reading to learn more about Galaxy users’ responses to Samsung’s latest innovations. Highlight of Galaxy Unpacked 2023: Hands-on With Galaxy S23 Series In the lead-up to Galaxy Unpacked 2023, adverts across billboards, broadcast and online platforms had one common thread – three camera lenses that were cleverly infused into words like ‘soon’, ‘wow’, and ‘moon’ as teasers to what was coming up. The three camera lenses represented the actual lenses of the new and improved camera on the Galaxy S23 series. The rear camera design with linear lenses can be found on the new Galaxy S23 series, including S23, S23+, and S23 Ultra. The S23 (6.1”) and S23+ (6.6”) feature a premium flat design with a simple and refined look. The S23 Ultra (6.8”) has a sturdy and sophisticated edge design as a flagship model, complete with a built-in S Pen. Available in four colors — Phantom Black, Cream, Green, and Lavender — the Galaxy S23 series boasts a sleek and sturdy design with Corning® Gorilla® Glass Victus® 2, protecting the device from scratches and falls. Camera: Ultra High Resolution With 200MP, Enhanced Nightography and More Premium is the perfect way to summarise the experience offered by cameras in the new Galaxy S23 series. The Galaxy S23 series comes equipped with a 10MP Telephoto Camera and the 12MP Ultra-Wide Camera – so every shot comes out picture-perfect. Meanwhile, the Wide Cameras on S23 and S23+ have 50MP, while the S23 Ultra offers a 200MP ultra-high resolution. You can take a clear picture using the Wide Camera with sharp lines and vivid colors, even when tightly zooming in. Also, an improved 12MP front camera for all three models enables users to enjoy a bright and clear selfie experience. The Galaxy Experience Space also encouraged visitors to try the enhanced Nightography on Galaxy S23 series cameras. All front and back cameras have been improved and optimized for taking pictures in darkness, including enhanced night selfies and portraits. So even in low light, users can always look camera-ready. Level Up Your Mobile Gaming Gaming isn’t just for PC or console users – anyone can enjoy quality gaming on the Galaxy S23 series. Mobile gaming is now more popular than ever, so having a smooth, stable, high-definition gaming experience is essential to smartphones. When a player is in the middle of the game, even a slight delay can cause critical issues. For instance, racing games require fast-loading screens, so any distraction can get even the most experienced players off track. However, a racing game on Galaxy S23 Ultra provides not only full immersion but also no disruptions. With a display that supports a super smooth 120Hz refresh rate, coupled with Qualcomm’s Snapdragon® 8 Gen 2 Mobile Platform for Galaxy, gamers can expect smoother graphics, faster response speeds, and a seamless gaming experience. Designed With the Planet in Mind At first glance, it isn’t easy to see how and where the Galaxy S23 series incorporates eco-conscious materials. However, the Galaxy S23 series was made with more recycled materials than ever, furthering Samsung’s inspiring vision for sustainability. The latest Galaxy S23 series is made from recycled aluminum, glass, and PET, in addition to repurposed ocean-bound plastic. What’s more, with a 100% recycled paper package box and paper-based materials used for front and back protectors, the Galaxy S23 series is eco-conscious from the inside out. In total, the number of parts using recycled materials in the lineup increased to 12. Connect Your Life With Galaxy Ecosystem The connected experience among the Galaxy devices makes daily life easier for Galaxy users everywhere. Through seamless connectivity, users can enjoy new and convenient features like never before, including easy file or photo transfers between devices. “The new Galaxy S series line-up is the ultimate creative tool offered in a variety of models that are differentiated for individual needs — whether you’re a pro-grade photographer, content creator, or just want to share the epic moments in life. The Galaxy S23 series combines Samsung Galaxy-exclusive performance, standard-setting camera quality, and future-looking sustainability in one premium experience, so people don’t have to choose one over the other,” said Justin Hume, Samsung’s Vice President of Mobile Experiences. Availability The Galaxy S23 series comes in four nature-inspired matte hues: Phantom Black, Cream, Green, and Lavender. It ranges from 128GB on the Galaxy S23 up to 1TB on the Galaxy S23 Ultra and it’s now available nationwide for purchase. ","filter_flag":1}
