{"title":"Ferrero makes progress in traceability, recycling initiatives","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfb0fa142c4b98d3d26e199e45a&url=https%3a%2f%2fwww.foodbusinessnews.net%2farticles%2f26173-ferrero-makes-progress-in-traceability-recycling-initiatives&c=17013995066936238397&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfb0fa142c4b98d3d26e199e45a&url=https%3a%2f%2fwww.foodbusinessnews.net%2farticles%2f26173-ferrero-makes-progress-in-traceability-recycling-initiatives&c=17013995066936238397&mkt=en-us","summary":"The Ferrero Group has four main sustainability pillars: protecting the environment, sourcing ingredients responsibly, promoting responsible consumption and empowering people. \"Ferrero Group ...","published":"Wed, 29 May 2024 17:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=5, tm_mday=29, tm_hour=17, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=150, tm_isdst=0)","news_source":"FoodBusinessNews","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Ferrero makes progress in traceability, recycling initiatives","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"The Ferrero Group has four main sustainability pillars: protecting the environment, sourcing ingredients responsibly, promoting responsible consumption and empowering people. \"Ferrero Group ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Responsible Consumption\" \"new products\"&format=rss","text":"LUXEMBOURG — The Ferrero Group increased its traceability and recycling capabilities while reducing its water use in the fiscal year ended Aug. 31, 2023, according to the company’s sustainability report issued May 28. Luxembourg-based Ferrero sources hazelnuts, cocoa, palm oil, sugar, milk and eggs to make its products. In its hazelnut supply chain, Ferrero achieved 90% traceability in the 2022-23 fiscal year, up from 79% in 2021-22. Satellite mapping helped increase traceability of cocoa back to the farm level to 93% in the most recent fiscal year. Nearly 91% of the company’s packaging is now recyclable, reusable or compostable materials, up from 88.5%. When manufacturing the Ferrero Rocher 24-piece box, Ferrero now runs light-weight packaging on high-speed automated lines, which achieves on average 40% plastic reduction compared to the previous polystyrene box. Ferrero has reduced water intensity at the company’s plants by 20% from the base fiscal year of 2017\/18. Sustainability goals at Ferrero include reducing Scope 1 and Scope 2 emissions from a 2018 baseline by 50% by 2030, increasing the plastic recycled content from a 2019\/2020 baseline by 12% by 2025 and reducing the use of virgin plastic from a 2019\/2020 baseline by 10% by 2025. The Ferrero Group has four main sustainability pillars: protecting the environment, sourcing ingredients responsibly, promoting responsible consumption and empowering people. \"Ferrero Group recognizes the critical role that the company plays in safeguarding nature for future generations,” said Giovanni Ferrero, executive chairman. “We reaffirmed through concrete engagements that sustainability is embedded in Ferrero's long-term strategy. All four pillars of our sustainability framework guide every strategic decision we take.\" Ferrero operates 37 manufacturing plants across five continents, and its products are sold in over 170 countries.","filter_flag":1}
{"title":"Encouraging businesses to adopt ESG values","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfb0fa142c4b98d3d26e199e45a&url=https%3a%2f%2fwww.thestar.com.my%2fmetro%2fmetro-news%2f2023%2f06%2f16%2fencouraging-businesses--to-adopt-esg-values&c=10897089690653339478&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfb0fa142c4b98d3d26e199e45a&url=https%3a%2f%2fwww.thestar.com.my%2fmetro%2fmetro-news%2f2023%2f06%2f16%2fencouraging-businesses--to-adopt-esg-values&c=10897089690653339478&mkt=en-us","summary":"“This should spur more emerging enterprises to develop new products and services in ... The company also won Gold in the Responsible Consumption and Production category. Besides winning the ...","published":"Thu, 30 May 2024 17:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=5, tm_mday=30, tm_hour=17, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=151, tm_isdst=0)","news_source":"The Star","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Encouraging businesses to adopt ESG values","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"“This should spur more emerging enterprises to develop new products and services in ... The company also won Gold in the Responsible Consumption and Production category. Besides winning the ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Responsible Consumption\" \"new products\"&format=rss","text":"THE inaugural Star Media Group ESG Positive Impact Awards 2022 (ESG PIA 2022) saw 60 awards given out to 100 companies for driving positive change and inspiring others in the country to embrace sustainability. The awards across 15 categories were presented to the winners at the ESG PIA 2022 gala night on June 8 at M Resort & Hotel Kuala Lumpur. The ESG PIA, which honours remarkable initiatives within the environmental, social and governance (ESG) aspect, was made possible by OCBC Bank (Malaysia) Bhd (OCBC Bank) and Telekom Malaysia Bhd (TM). The submissions were evaluated by a panel of judges based on a set criteria across three ESG pillars. Geomax won Gold in Responsible Consumption and Production under the Environment pillar on top of the Outstanding ESG Initiative for SMEs to Mid-Tier. The ESG PIA embodies a collective commitment to creating a more sustainable and equitable Malaysia, and a recognition of companies which have done the work to make a tangible impact on society and the environment. The inaugural awards also saw Geomax Rubber Innovative Products Sdn Bhd and Heineken Malaysia Bhd pick up the award for “The Most Outstanding ESG Initiatives of The Year” for the “SME to mid-tier” and “large companies” categories respectively. Supporting sustainable values As the main sponsor of the ESG Positive Impact Awards, OCBC Bank congratulated all the winners on their achievements in their pursuit of sustainability. “As financiers, we actively seek to enable the creation and adoption of ground-breaking solutions that are not only economically viable, but also environmentally and socially sustainable in their contribution towards nation building over the longer term,” said OCBC Bank chief executive officer Tan Chor Sen. “To deliver on our own sustainability and climate commitments, we must encourage all our stakeholders, especially our customers, to strengthen the management of material ESG factors within their businesses,” Tan added. He continued by saying that recognition works wonders for “ensuring the desired posture continues to be held, and then bettered”. Besides the award for Outstanding ESG Initiative for Large Companies, Heineken won Gold twice, one for Waste Management and the other for Innovative Partnership. He added that the ESG PIA represents a prime platform for promoting sustainability through recognising the good that companies are currently doing. “That aside, the part played by role models should never be underestimated. We believe that by bringing those who have done well in ESG to the fore, others will have a solid foundation to work from. “Through our shared experiences we will be able to build and uplift each other. “And, along the way, we will be sounding the clarion call for even more companies to join us in this sustainability journey,” he emphasised. (From left) Wang, Tan, Renuka, Mohamad Razif and Yeow celebrating Heineken winning the Most Outstanding ESG Initiative Award for Large Companies. OCBC Bank also sees the awards as a way to influence other businesses and industries to adopt ESG practices and contribute to a more sustainable future no matter the size of the organisation. “This is all about setting the right agenda. “As more and more companies begin to witness the emergence of peers who are getting it right in the ESG space, they will find themselves compelled to do what is right,” said Tan. “The more we talk about what is good, the better the chance we have of ensuring the desired agenda stays in the minds of our key audiences. “While larger corporations may lead the way in charting their transition journeys, the awards also showcased SMEs’ diversity in innovative efforts across industries and sustainable focus areas. “This should spur more emerging enterprises to develop new products and services in carrying out their crucial role as changemakers or disruptors, providing impetus for climate action at scale,” he noted. Tan also shared words of advice for businesses looking to start sustainable initiatives by using the success of the winners of ESG PIA as an anchoring point. (From left) Wang, Tan, Ng, Mohamad Razif, Yeow and Tengku Muneer as Geomax was conferred the Most Outstanding ESG Initiative Award for SMEs to Mid-Tier. “Often, companies aren’t sure where to start. And sometimes there is not enough of an internal push to get things going. “The ESG PIA help point those who are new to the journey in the right direction to look to those who have done well and to emulate them,” Tan said encouragingly. Meanwhile, co-sponsor TM also lauded the winners during the gala night. TM chief corporate and regulatory officer Tengku Muneer Tengku Muzani shared that TM, as an organisation dedicated to nation building, has always had sustainability at the heart of what they do. “Our main goal has always been to make a positive impact on people’s lives while finding a balance between profits and purpose. We not only view sustainability as a moral obligation but also as an opportunity to create value for everyone involved. “We are determined to incorporate sustainability from every aspect of our core business to the daily practices of our employees,” he said. (From left) Telekom Malaysia chief corporate and regulatory officer Tengku Muneer Tengku Muzani, Star Media Group Berhad (SMG) chief executive officer Alex Yeow, Natural Resources, Environment and Climate Change (NRECC) Ministry deputy secretary-general (Energy) Datuk Mohamad Razif Abd Mubin, OCBC Bank (Malaysia) Bhd chief executive officer Tan Chor Sen and SMG chief business officer Lydia Wang sharing a light moment during the ESG Positive Impact Awards 2022 Gala Night at M Resort & Hotel Kuala Lumpur. – Photos: IZZRAFIQ ALIAS, RAJA FAISAL HISHAN, SHAARI CHEMAT and AZLINA ABDULLAH\/The Star He added TM’s involvement in these awards reflects their support for creating a sustainable and responsible future. “To further solidify sustainability within our organisation, we have integrated ESG-related Key Performance Indicators (KPIs) throughout our business operations. “This ensures greater accountability and performance. We aspire to contribute to a brighter future for the rakyat,” he added. TM also said that the ESG PIA is a great platform for businesses making progress in their sustainability efforts and following the best environmental, social, and governance practices. Renuka (sixth from left) with the elegantly attired Heineken team. “When a media organisation like The Star recognises these businesses, it inspires companies of all sizes and from different industries to join in and adopt responsible practices for a better and more sustainable future. “Nevertheless, establishing a sustainable future needs joint efforts from all parties. “It is not a race or a competition, but rather a process that requires commitment from various stakeholders and should be implemented in a collaborative manner,” he noted. He continued saying that being involved in such awards has inspired TM to look closer into their supplier ecosystem, with the Group being another key stakeholder to them. (From left) Telekom Malaysia chief corporate and regulatory officer Tengku Muneer Tengku Muzani, Star Media Group Berhad (SMG) chief executive officer alex yeow, natural resources, environment and Climate Change (nreCC) Ministry deputy secretary-general (energy) datuk Mohamad razif abd Mubin, OCBC Bank(Malaysia) Bhd chief executive officer Tan Chor Sen and SMG chief business officer Lydia Wang sharing a light moment during the eSG Positive impact awards 2022 Gala night at M resort & Hotel Kuala Lumpur. –Photos: iZZraFiQ aLiaS, raJa FaiSaL HiSHan, SHaari CHeMaT and aZLina aBduLLaH\/The Star “We are working towards further strengthening our supply chain to ensure that they are onboard with us in achieving our ESG commitments. “We are working closely with our suppliers to train and develop businesses on how they can improve their social and environmental impact. “This ensures that they can transition towards a sustainable economy while supporting TM’s sustainability aspirations.” By endorsing these initiatives, OCBC Bank and TM hope the winners will inspire others within their industries and beyond to embrace ESG principles, catalysing a ripple effect of collective effort towards positive transformation. Outstanding entries “I will continue to work hard to create more impact and inspire the younger generation,” said Geomax Rubber Innovative Products director Steven Ng. The company also won Gold in the Responsible Consumption and Production category. The grand ballroom hosted 100 companies during the ESG PIA 2022. Besides winning the outstanding awards for the year, Heineken also bagged two Gold awards in the categories of Waste Management and Innovative Partnership. The brewery’s Corp Affairs and Legal Director Renuka Indrarajah said, “We began with a water project, which is taking care of the water resources behind our brewery and today, our initiatives cut right across our entire value chain.” She added that Heineken Malaysia was looking at how to minimise its environmental impact and how to make a positive one for the society around them. The awards was organised to promote Malaysia’s ESG agenda through recognising the role and contributions of outstanding businesses towards a sustainable future. ‘When I started on the ESG journey, nobody believed that the ESG focus or that environment itself were important issues that needed solving,’ says Geomax Rubber Innovative Products Sdn Bhd director Steven Ng. Through these role models, it hopes to inspire other businesses to consider building, adopting and enhancing their own ESG initiatives – from SMEs to large corporations. ESG PIA 2022 categories were divided within the three main ESG pillars, with the Environment Awards covering Sustainable Ecosystems, Water Management and Efficiency, Waste Management, Responsible Consumption and Production, Renewable Energy and Energy Efficiency. The Social Awards covers Diversity, Equity and Inclusion; Relations with Local Communities; Human Rights and Labour Standards; Talent Management; and Good Health and Wellbeing. The Governance Awards has one category that focuses on Governance, Reporting and Transparency. There were also three standalone awards that are related to ESG and grouped under Other Awards category and these include Supply Chain Management, Innovative Partnership and Transformation. Stay tuned this July for more on the ESG PIA 2022. The ESG Positive Impact Awards 2022 was organised by SMG and endorsed by the NRECC ministry with OCBC Bank as main sponsor and TM as co-sponsor.","filter_flag":1}
{"title":"Passionate About Our Planet","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfb0fa142c4b98d3d26e199e45a&url=https%3a%2f%2fwww.tottenhamhotspur.com%2fthe-stadium%2fpassionate-about-our-planet%2f&c=13396167801271653727&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfb0fa142c4b98d3d26e199e45a&url=https%3a%2f%2fwww.tottenhamhotspur.com%2fthe-stadium%2fpassionate-about-our-planet%2f&c=13396167801271653727&mkt=en-us","summary":"promote sustainable and responsible consumption; and advocate for climate action through communications. Until recently, most companies have focused on measuring emissions from their own operations ...","published":"Fri, 29 Sep 2023 10:50:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=29, tm_hour=10, tm_min=50, tm_sec=0, tm_wday=4, tm_yday=272, tm_isdst=0)","news_source":"Tottenham Hotspur F.C.","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Passionate About Our Planet","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"promote sustainable and responsible consumption; and advocate for climate action through communications. Until recently, most companies have focused on measuring emissions from their own operations ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Responsible Consumption\" \"new products\"&format=rss","text":"UN Sports for Climate Action Framework - Race to Zero Tottenham Hotspur has proudly joined the UN Race to Zero, committing to halve its carbon emissions by 2030 and become net zero carbon by 2040. It follows the Club becoming a signatory of the UN Sports for Climate Action Framework, which supports and guides sports organisations globally to achieve climate change goals, in January 2021. The Race to Zero high ambition track was launched at last year’s COP26 and aims to rally non-state actors – including companies, cities, regions, financial and educational institutions – to take rigorous and immediate action to work towards achieving net zero carbon in line with the Paris Agreement, with transparent action plans and robust targets. The Sports for Climate Action initiative calls on sporting organisations to acknowledge the contribution of the sports sector to climate change and a collective responsibility to strive towards climate neutrality for a safer planet. By signing the Framework, the Club has demonstrated its commitment to playing its part to ensure the sports sector is on the path to a low-carbon future. In line with the five core principles enshrined in the Framework and the aims of the Paris Agreement, signatories strive to: promote greater environmental responsibility; reduce the overall climate impact from sports; use their platforms to educate for climate action; promote sustainable and responsible consumption; and advocate for climate action through communications. Until recently, most companies have focused on measuring emissions from their own operations and electricity consumption (Scope 1 and 2). Scope 3 accounts for the greenhouse gas (GHG) emissions associated with a company’s entire value chain. These are considered indirect emissions as are not under the company’s direct control. Scope 3 emissions are broken down into 15 categories which span the entire upstream and downstream activities of a company. Scope 3 emissions often account for 80% - 99% of a company’s total emissions footprint and it is therefore important to understand these emissions. Assessing the entire value chain emissions impact can help to identify where to focus reduction activities. The Club measured its Scope 3 emissions footprint for the first time in 2022. For the reporting period July 2021 - June 2022, the entire Tottenham Hotspur Ltd business produced 76,698 tonnes carbon dioxide equivalent (tCO2e) worth of Scope 3 emissions. These emissions account for over 90% of the Club’s total greenhouse gas emissions footprint. Our emissions are reported on a consolidation, operational control approach, as defined by the GHG Protocol. All emissions have been calculated following the GHG Protocol's Corporate Accounting and Reporting Standard and the guidelines of the ISO14064-1. All applicable Scope 3 categories have been quantified. Th Club reports its emissions on a tonnes carbon dioxide equivalent (tCO2e) basis. Each greenhouse gas has a different global warming potential (GWP) compared to carbon dioxide (CO2), for example, methane (CH4) has a warming potential 28 times that of CO2. Therefore, to be able to compare the emissions from all the Kyoto protocol GHGs on a like-for-like basis, they are converted to tCO2e using their respective GWP. The most significant source of Scope 3 emissions is fan travel to and from Tottenham Hotspur matches. These emissions have been included under the Scope 3 category “Downstream Transport and Distribution”, and account for 47% of the company's total greenhouse gas emissions footprint. Emissions embedded in purchased goods and services, capital goods, and business travel are also significant contributors to Scope 3 emissions. Our Scope 3 emissions are being addressed through engagement with suppliers and fans and internal policy changes. We are in the process of producing a decarbonisation action plan which will detail the short, medium and long term actions we will take to meet near-term and net-zero targets. Emissions Scope and Scope 3 Category June 2022 - July 2023 GHG Emissions (tCO2e) Scope 1 2,503 Gas 2,029 Transport (excluding grey fleet) 72 F-Gas 402 Scope 2 (location-based) 4,684 Scope 2 (market-based) 0 Scope 3 86,444 1: Purchased Goods and Services 21,503 2. Capital goods 11,502 3. Fuel-related emissions 1,904 4. Upstream Transportation and Distribution 615 5. Waste generated in operations 22 6. Business travel 3,484 7. Employee commuting 1,695 8. Upstream leased assets Not Applicable 9. Downstream Transportation and Distribution (Fan travel to matches) 44,558 10. Processing of sold products Not Applicable 11. Use of sold products 2 12. End of life treatment of sold products 8 13. Downstream leased assets 1,413 14. Franchises Not Applicable 15. Investments Not Applicable Total All Scopes (location-based) 93,894 Total All Scopes (market-based) 89,210 We are working to reduce our Scope 1, 2 and 3 emissions on an absolute basis as far as possible towards an ultimate goal of being net-zero by 2040. On the journey to net-zero we plan to take responsibility for emissions we haven’t prevented from being produced. The Club’s carbon reduction plan can be found here.","filter_flag":1}
{"title":"FERRERO GROUP'S 15th SUSTAINABILITY REPORT DEMONSTRATES SOLID PROGRESS AS COMPANY ACCELERATES EFFORTS TO MEET ITS TARGETS","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfb0fa142c4b98d3d26e199e45a&url=https%3a%2f%2fwww.newswire.ca%2fnews-releases%2fferrero-group-s-15th-sustainability-report-demonstrates-solid-progress-as-company-accelerates-efforts-to-meet-its-targets-882675808.html&c=13628891568834199516&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfb0fa142c4b98d3d26e199e45a&url=https%3a%2f%2fwww.newswire.ca%2fnews-releases%2fferrero-group-s-15th-sustainability-report-demonstrates-solid-progress-as-company-accelerates-efforts-to-meet-its-targets-882675808.html&c=13628891568834199516&mkt=en-us","summary":"Promoting Responsible Consumption and Empowering People. \"Ferrero Group recognises the critical role that the company plays in safeguarding nature for future generations. We reaffirmed through ...","published":"Tue, 28 May 2024 01:59:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=5, tm_mday=28, tm_hour=1, tm_min=59, tm_sec=0, tm_wday=1, tm_yday=149, tm_isdst=0)","news_source":"Newswire","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"FERRERO GROUP'S 15th SUSTAINABILITY REPORT DEMONSTRATES SOLID PROGRESS AS COMPANY ACCELERATES EFFORTS TO MEET ITS TARGETS","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Promoting Responsible Consumption and Empowering People. \"Ferrero Group recognises the critical role that the company plays in safeguarding nature for future generations. We reaffirmed through ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Responsible Consumption\" \"new products\"&format=rss","text":"LUXEMBOURG, May 28, 2024 \/CNW\/ -- The Ferrero Group has today announced the latest progress in its sustainability journey, with the release of its 15th Sustainability Report. Guided by Ferrero Group's long-standing commitment to having a positive impact throughout its value chain, the report demonstrates the considerable headway across its key sustainability pillars: Protecting the Environment, Sourcing Ingredients Responsibly, Promoting Responsible Consumption and Empowering People. \"Ferrero Group recognises the critical role that the company plays in safeguarding nature for future generations. We reaffirmed through concrete engagements that sustainability is embedded in Ferrero's long-term strategy. All four pillars of our sustainability framework guide every strategic decision we take\" said Giovanni Ferrero, Executive Chairman of the Ferrero Group. \"As Ferrero grows and diversifies its portfolio, we continue to value our long-term partnerships, in particular those dedicated to the communities where we operate and where our raw materials are sourced. We believe in the importance of partnerships to achieve progress, to move forward our sector's social and environmental agenda, and finally to create societal value.\" The latest Sustainability Report, for the 2022\/23 financial year, highlights Ferrero's continued focus on driving greater transparency across its core-ingredients supply chain, in line with its responsible sourcing approach. In its hazelnut supply chain, Ferrero has now achieved 90% traceability – a significant increase from the 79% reached in previous year 2021\/22 – sustained by its continued work with farmers, suppliers, institutions, universities, and research centres to promote and share sustainable farming practices. In collaboration with partners on the ground, Ferrero has also helped address complex supply chain challenges, like deforestation, across the areas from which it sources ingredients. For example, using satellite mapping to help increase traceability of cocoa back to farm level to 93% in 2022\/23. As well as working extensively with cutting edge technology, Ferrero is a long-standing member of the World Cocoa Foundation (WCF) and the International Cocoa Initiative (ICI). Collaboration has also played a key role in accelerating progress on tackling the causes behind child and forced labour. Ferrero continues to partner with Save the Children, working with 65 communities in the Haut-Sassandra Region in Ivory Coast, one of the main sourcing countries for cocoa, reaching over 18,000 people. Ferrero is also working with Earthworm Foundation and the International Labour Organisation (ILO) across its palm oil and hazelnut supply chains respectively to help support responsible labour practices. Other highlights from the Ferrero Group's Sustainability Progress Report include: 90.7% of Ferrero packaging is now designed to be recyclable, reusable, or compostable - up from 88.5% in 2021\/22. Achieved a 20% reduction in water intensity at Ferrero plants, through reduction and reuse initiatives since base year 2017\/18 (9.6% vs 2021\/2022. Kinder Joy of moving project has involved more than 60 million children since its inception in 2005 (3,4 million children in 22\/23 alone). You can read more about Ferrero's latest Sustainability Report here. About Ferrero Group Ferrero began its journey as a pastry shop in the small town of Alba in Piedmont, Italy, in 1946. Today, it is one of the world's largest sweet-packaged food companies, with much loved brands sold in more than 170 countries. The Ferrero Group brings joy to people around the world with much-loved products including Nutella®, Kinder®, Tic Tac®, and Ferrero Rocher®. About 47,000 employees are passionate about helping people celebrate life's special moments. The Ferrero Group's family culture, now in its third generation, is based on dedication to quality and excellence, heritage and a commitment to the planet and communities in which we operate. For more information, please visit www.ferrero.com Media Contacts [email protected] SOURCE Ferrero Group","filter_flag":1}
{"title":"Industry, Innovation and Infrastructure – Build resilience and foster innovation","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfb0fa142c4b98d3d26e199e45a&url=https%3a%2f%2fwww.ulster.ac.uk%2fsustainability%2fgoals%2findustry-innovation-and-infrastructure&c=7547758947216203857&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfb0fa142c4b98d3d26e199e45a&url=https%3a%2f%2fwww.ulster.ac.uk%2fsustainability%2fgoals%2findustry-innovation-and-infrastructure&c=7547758947216203857&mkt=en-us","summary":"Through our new multi-million pound Creative Industries Institute, we're collaborating with industry, government and civic partners to significantly increase employment in the Creative Industries ...","published":"Mon, 11 Oct 2021 08:14:00 GMT","published_parsed":"time.struct_time(tm_year=2021, tm_mon=10, tm_mday=11, tm_hour=8, tm_min=14, tm_sec=0, tm_wday=0, tm_yday=284, tm_isdst=0)","news_source":"Ulster University","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Industry, Innovation and Infrastructure – Build resilience and foster innovation","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Through our new multi-million pound Creative Industries Institute, we're collaborating with industry, government and civic partners to significantly increase employment in the Creative Industries ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Responsible Consumption\" \"new products\"&format=rss","text":"Through our new multi-million pound Creative Industries Institute, we're collaborating with industry, government and civic partners to significantly increase employment in the Creative Industries sector, driving the development of new products, services and experiences. At a Glance Creative Industries Institute The creative industry sector is forecast to grow to £128 billion by 2025 and generate one million new jobs by 2030. Ulster supporting this growing industry through our new multi-million pound Creative Industries Institute. Virtual Production Facility Investment in a new Virtual Production Facility (UViPrS). Utilising Virtual Production will continue to be a growing trend, due to its benefits which include a reduced environmental impact and cost efficiency. Unreal Academic Partner Epic Games has awarded Unreal Academic Partner status to the Ulster Screen Academy, endorsing the Games Design and Animation programmes. Unique Art and Design Shop Ulster’s UNIQUE Art and Design Shop on the Belfast campus is an important learning space and a forum for creative exploration and enterprise. UNIQUE provides an opportunity for artists to gain exposure, make professional connections and to sell their work. Advanced Diploma in Social Enterprise Our 'Advanced Diploma in Social Enterprise' supports the growth of the social sector by providing the much needed business skills to inspire, transform and enhance the competitiveness of potential and existing social enterprises in an often challenging marketplace. DEX (Dairy Evolution NeXt) DEX (Dairy Evolution NeXt) is a UK and Ireland dairy industry collaborative network who are collaborating to build a Sustainable Future for the Dairy Industry. Northern Ireland Bioengineering Center The Northern Ireland Bioengineering Center (NIBEC) carries out research across health technology, nanomaterials, optical technology, water systems, energy generation, plasma physics and tissue engineering. Connected Health Innovation Centre The Connected Health Innovation Centre (CHIC) is focused on business led research in the area of connected health and seeks to lead transformational research which aligns care needs with technology providers, researchers and clinical experience. Institute for Fire Safety Engineering Research and Technology","filter_flag":1}
{"title":"Arushi Rawat","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfb0fa142c4b98d3d26e199e45a&url=https%3a%2f%2fauto.economictimes.indiatimes.com%2fauthor%2f479252220%2farushi-rawat&c=10301154552407450244&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cfb0fa142c4b98d3d26e199e45a&url=https%3a%2f%2fauto.economictimes.indiatimes.com%2fauthor%2f479252220%2farushi-rawat&c=10301154552407450244&mkt=en-us","summary":"This trend aligns with broader societal concerns about environmental conservation and responsible consumption ... years and planning to bring three new products by 2025. The company also plans ...","published":"Mon, 15 Apr 2024 23:43:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=4, tm_mday=15, tm_hour=23, tm_min=43, tm_sec=0, tm_wday=0, tm_yday=106, tm_isdst=0)","news_source":"ET Auto","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Arushi Rawat","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"This trend aligns with broader societal concerns about environmental conservation and responsible consumption ... years and planning to bring three new products by 2025. The company also plans ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Responsible Consumption\" \"new products\"&format=rss","text":"CEO’s Take 2024: Aspirational neo-rich entrepreneurs to expand luxury car market in 2024 - Vikram Pawah, BMW Group India With its huge population and the emergence of the young, neo-rich entrepreneurs, the luxury car OEMs find great potential for their expensive products in India. Sales of luxury cars, both ICE and EV, have been on the rise and they are set to soar. “Apart from traditionally wealthy families, a new group of achievers has fast emerged in India with a global outlook. They are well-travelled and have an eye on luxury products. Young entrepreneurs and leaders are actively shaping demand for the luxury car market in Tier II and Tier III cities. With the rise in disposable income, they are not hesitant to spend on luxury products and services”, Vikram Pawah, told ETAuto in the CEO’s Take 2024.","filter_flag":1}
