{"title":"Where rubber meets road - Resource Recycling","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9yZWN5Y2xpbmcvMjAyMy8wOS8xOS93aGVyZS1ydWJiZXItbWVldHMtcm9hZC_SAUxodHRwczovL3Jlc291cmNlLXJlY3ljbGluZy5jb20vcmVjeWNsaW5nLzIwMjMvMDkvMTkvd2hlcmUtcnViYmVyLW1lZXRzLXJvYWQv?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9yZWN5Y2xpbmcvMjAyMy8wOS8xOS93aGVyZS1ydWJiZXItbWVldHMtcm9hZC_SAUxodHRwczovL3Jlc291cmNlLXJlY3ljbGluZy5jb20vcmVjeWNsaW5nLzIwMjMvMDkvMTkvd2hlcmUtcnViYmVyLW1lZXRzLXJvYWQv?oc=5","id":"CBMiTGh0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9yZWN5Y2xpbmcvMjAyMy8wOS8xOS93aGVyZS1ydWJiZXItbWVldHMtcm9hZC_SAUxodHRwczovL3Jlc291cmNlLXJlY3ljbGluZy5jb20vcmVjeWNsaW5nLzIwMjMvMDkvMTkvd2hlcmUtcnViYmVyLW1lZXRzLXJvYWQv","guidislink":false,"published":"Tue, 19 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=262, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9yZWN5Y2xpbmcvMjAyMy8wOS8xOS93aGVyZS1ydWJiZXItbWVldHMtcm9hZC_SAUxodHRwczovL3Jlc291cmNlLXJlY3ljbGluZy5jb20vcmVjeWNsaW5nLzIwMjMvMDkvMTkvd2hlcmUtcnViYmVyLW1lZXRzLXJvYWQv?oc=5\" target=\"_blank\">Where rubber meets road<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Resource Recycling<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Where rubber meets road - Resource Recycling","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9yZWN5Y2xpbmcvMjAyMy8wOS8xOS93aGVyZS1ydWJiZXItbWVldHMtcm9hZC_SAUxodHRwczovL3Jlc291cmNlLXJlY3ljbGluZy5jb20vcmVjeWNsaW5nLzIwMjMvMDkvMTkvd2hlcmUtcnViYmVyLW1lZXRzLXJvYWQv?oc=5\" target=\"_blank\">Where rubber meets road<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Resource Recycling<\/font>","source.href":"https:\/\/resource-recycling.com","source.title":"Resource Recycling","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"This article appeared in the August 2023 issue of Resource Recycling. Subscribe today for access to all print content. It is amazing how people’s faces light up when they first learn an unexpected item is recyclable. We have observed this response often during our ongoing development of a regional bicycle inner tube and tire recycling pilot in the Seattle region. Yet positive vibes alone don’t pave the road to success. Full Circle Environmental was hired by the Washington cities of Redmond and Bellevue to provide technical assistance to help businesses reduce waste, improve recycling and divert organic materials. Beyond conducting this outreach, Redmond and Bellevue directed our field team to identify and pursue innovative opportunities to divert hard-to-recycle materials from landfill. During conversations with staff at bike shops, our field team heard that bicycle tubes and tires represent a significant proportion of their waste stream. They asked us for recycling options, expressing their unanimous desire to reduce waste and shrink their garbage bills. This seemingly simple request led us down a nearly two-year road with many bridges to cross and hills to climb. The current landscape Other hard-to-recycle materials, such as paint, electronics, lights, medications and batteries, are already being addressed in Washington state through extended producer responsibility (EPR) policy frameworks, so there is precedent for managing something like bike tires through EPR. Vehicle tires are being managed through EPR programs in multiple Canadian provinces and European countries. In 2011, Tire Stewardship British Columbia began recycling bike tubes and tires in partnership with the Canadian Independent Bike Retailers Association. Including bike tubes and tires is voluntary in this product stewardship program, but in response to the cycling community seeking more sustainable disposal options, Tire Stewardship successfully integrated the collection of these materials into the existing system of vehicle tire recycling. Schwalbe, a German tire and tube manufacturer, is also in the midst of rolling out tube-to-tube recycling systems in several European countries. Clearly, initial efforts are being made to integrate bike tubes and tires into a circular economy, but is having a product stewardship program in place a necessary prerequisite for success? If not, could developing a small-scale pilot both achieve measurable material diversion and pedal the EPR conversation a little closer to reality? Having assessed the policy backdrop and confirmed the strong local cultures of both cycling and recycling, our team dove helmet-first into researching recycling options for bicycle tubes and tires. What are they made of? How can they be collected, consolidated, shipped, and processed? Who would want these materials, and how would they be used? Who could pay to keep this wheel spinning? The following sections take you on a ride through what we have learned so far. Conversations with ownership and staff at Redmond and Bellevue’s six bike shops provided valuable insights that helped shape the evolving pilot program, and ongoing discussions with two collection and recycling companies helped our team address some of the questions above. Collection Determining where used tubes and tires are generated was the first step toward planning an appropriate collection system. While residences and popular bike paths can serve as sources of generation, our team steered toward an initial focus on bike shops in order to simplify the collection and consolidation of materials. Many used tubes and tires are discarded at bike shops because people bring in their bike after experiencing a puncture to buy new gear and have it professionally installed. Bike shops typically perform sales and service, making them key leverage points through which new products flow to consumers and old products are exchanged and discarded. We learned tubes are more commonly discarded than tires because tires are designed for durability, whereas the lightweight and flexible tubes get damaged more easily. Store estimates range from 20 to 100 tubes per month compared to five to 40 tires, depending on seasonal variability and the size of the shop. Among the four bike shops in Redmond and the two in Bellevue, we estimate 120 to 600 tubes and 30 to 240 tires are generated each month. The vast majority of bicycle inner tubes are made almost entirely of synthetic “butyl” rubber (isobutylene), with a brass valve stem used to inflate and deflate the tube. Similar to car tires, bike tires contain a mix of rubber, metal wire, fabric fibers and fillers. The dimensions of bike tubes and tires vary widely, with typical tubes weighing just under half a pound and tires weighing between 0.5 and 2.5 pounds. When considering what kind of collection system might adequately capture these items, Full Circle reached out to Ridwell and DTG Recycle, two collection and recycling companies that manage hard-to-recycle materials in the Pacific Northwest. Discussions are ongoing as to whether a milk-run system to collect from each bike shop or a hub-and-spoke drop-off system with a central consolidation point would be preferable. Another potential collection option would leverage Ridwell’s existing residential doorstep subscription service. Bike tubes and tires could be added to Ridwell’s list of periodically collected specialty items, potentially capturing 15% to 20% of these materials generated in Redmond and Bellevue (as estimated by bike shop staff). Expanding its subscription service directly to the cities’ bike shops would be a new step into the commercial space for Ridwell, but given the motivation of shop staff to divert multiple hard-to-recycle materials, including metal components, Ridwell is not opposed to bike parts this expansion. DTG currently operates a number of recycling facilities near Redmond and Bellevue that process a variety of hard-to-recycle materials, including wood, electronics, mattresses, car tires and expanded polystyrene. In addition to operating a fleet of collection trucks, DTG also has experience running special collection events for hard-to-recycle items. Members of its team are actively exploring the development of systems for collecting, consolidating and shipping bike tubes and tires. Our team also reached out to the county-managed Jerry Baker Velodrome, a bicycle racing track in Redmond. Velodrome representatives have expressed preliminary interest in serving as a hub where tubes and tires could be collected and consolidated. A hub-and-spoke system with regular drop-offs to the velodrome is favored by the bike shops, most of which are located nearby. Processing and end markets As most nascent circular economy endeavors demonstrate, a steady supply of capturable materials does not guarantee that processors and end markets exist. This has proven true for bicycle tubes and tires generated in the Pacific Northwest, with dead ends thwarting several potential recycling pathways. Conversations with DTG initially uncovered potential tube and tire processors to which we sent samples for testing. We first explored the possibility of including bike tires and\/or tubes with DTG’s existing shipments of car tires to a Canadian company that processes crumb rubber into tire-derived fuel, floor mats and landscaping products. They determined the samples would not work in their regrind machinery. We offered samples to an Atlanta-based vehicle tire processor that creates micronized rubber powder; they declined testing because they did not have a current customer interested in the processed material they would generate. And a tire retread recycling operation in the Midwest received the samples, but has yet to send word on the outcome of any processing they may have undertaken. While the promise of folding bike tires into an existing vehicle tire recycling system sounded efficient on its face, it appears we spoke too soon. We reached out to a local cement kiln, which burns whole vehicle tires for fuel, but a representative indicated that bike tires and tubes are too small to be worthwhile fuel; the kiln prefers large tires from automobiles, trucks and heavy-duty construction vehicles. (We recognize the combustion of tire-derived fuel entails negative impacts on human health and the environment, but EPA guidance proclaims it a more beneficial use of waste tires than discarding them in a landfill, especially if high-carbon fossil fuels, such as coal, are replaced.) Rubber-modified asphalt is another commercial use of tire rubber, but without a cost-effective material processor, and with applications of this product having not yet gained traction in the Pacific Northwest, this would be an option for later down the road. Diversion opportunities are more readily available for inner tubes than they are for bike tires. Alchemy Goods, which upcycles tubes into bags and accessories, has agreed to accept tubes collected through this pilot if they are shipped to its facility in Boulder, Colo. Several Seattle-area bike shops, including REI in Bellevue, already send them used tubes. Small-scale local manufacturers of upcycled products, such as Metamorphic Gear and Refugee Artisan Initiative, have also expressed interest in experimenting with tube material. Funding Even when collection systems, feasible processing pathways and viable end-market products have been identified, funding will remain a critical component to the program’s forward movement, particularly given that recovered material values are not high enough to cover collection, shipping and processing costs. But who will pay? Our team identified early on that consumer fees are unlikely to be a viable funding approach. Many bike shops operate on slim margins, and while they might be willing to absorb the opportunity costs associated with separating and storing used tubes and tires, they largely expressed an unwillingness to add charges on the sale of new tubes and tires to cover shipment costs, citing to store policies and operational constraints. DTG, interested in establishing cost-efficient material recovery and processing, has proposed a potential fee for collection and consolidation services. Similarly, Ridwell employs a fee-for-service model that could be adapted to capture bike tires and tubes from bike shops or residences. However, in the absence of end markets or clear economic feasibility, Ridwell has not yet committed to participating in our pilot’s collection operations. Policy solutions Extended producer responsibility frameworks and other policy approaches could ultimately answer the funding question. Connecticut recently passed a first-in-the-nation EPR program for vehicle tires, which fell somewhat flat given its exclusion of bike tires and tubes. The Washington State Department of Ecology manages a waste tire program, funded by a required $1.00 disposal fee added to the sale of each “new replacement vehicle tire” in the state. Incorporating bike tires and tubes into this program could yield substantial benefits, such as engaging consumers and retailers around recycling and upcycling, increasing program revenues, spreading awareness of problems stemming from dumped tires, supporting the regional and statewide development of end markets for recycled tire rubber and enabling more bike tire and tube diversion programs to be initiated and expanded. We have also reached out to bike and tire manufacturers, as well as to the national trade association for bicycle manufacturers, with no clear engagement to date. Overall, while general interest in supporting end-of-life tire and tube management has been expressed by a number of stakeholders, this program is still leaning on its kickstand, awaiting producer support in the form of internalizing the end-of-life management costs of their products. Blazing the trail As this pilot program slowly gains momentum, we envision it expanding to cover dozens of other Seattle-area bike shops and divert increasingly significant quantities of materials. Bike shops see a strong alignment between the pilot and their products and services, their ethics and their customers’ desire to embrace sustainable behaviors. Our pilot paves a pathway toward establishing a circular economy for bike tubes and tires in the Pacific Northwest. Bike shop staff, cycling enthusiasts and local collector\/recyclers are excited to move forward as funding for tube shipments and end markets for tires can be solidified. Once those elements are in place, we can shift this program into high gear! Adam Ellner is a project manager at Full Circle Environmental. He can be reached at [email protected]. David Stitzhal is the president of Full Circle Environmental and managing partner at Signalfire Group. He can be reached at [email protected]. The authors are particularly grateful for the leadership, support and creativity of Micah Bonkowski, solid waste and sustainability program administrator for the city of Redmond ([email protected]); Stacey Auer, environmental program administrator for the city of Redmond ([email protected]); and Erin Hislop, utilities conservation and outreach program administrator for the city of Bellevue ([email protected]). This article appeared in the August 2023 issue of Resource Recycling. Subscribe today for access to all print content.","filter_flag":1}
{"title":"Making the most of materials: Africa's skills in repair and repurposing point the way for the Global North - ellenmacarthurfoundation.org","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmVsbGVubWFjYXJ0aHVyZm91bmRhdGlvbi5vcmcvYXJ0aWNsZXMvbWFraW5nLXRoZS1tb3N0LW9mLW1hdGVyaWFsc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmVsbGVubWFjYXJ0aHVyZm91bmRhdGlvbi5vcmcvYXJ0aWNsZXMvbWFraW5nLXRoZS1tb3N0LW9mLW1hdGVyaWFsc9IBAA?oc=5","id":"CBMiTmh0dHBzOi8vd3d3LmVsbGVubWFjYXJ0aHVyZm91bmRhdGlvbi5vcmcvYXJ0aWNsZXMvbWFraW5nLXRoZS1tb3N0LW9mLW1hdGVyaWFsc9IBAA","guidislink":false,"published":"Fri, 29 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=272, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmVsbGVubWFjYXJ0aHVyZm91bmRhdGlvbi5vcmcvYXJ0aWNsZXMvbWFraW5nLXRoZS1tb3N0LW9mLW1hdGVyaWFsc9IBAA?oc=5\" target=\"_blank\">Making the most of materials: Africa's skills in repair and repurposing point the way for the Global North<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ellenmacarthurfoundation.org<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Making the most of materials: Africa's skills in repair and repurposing point the way for the Global North - ellenmacarthurfoundation.org","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmVsbGVubWFjYXJ0aHVyZm91bmRhdGlvbi5vcmcvYXJ0aWNsZXMvbWFraW5nLXRoZS1tb3N0LW9mLW1hdGVyaWFsc9IBAA?oc=5\" target=\"_blank\">Making the most of materials: Africa's skills in repair and repurposing point the way for the Global North<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ellenmacarthurfoundation.org<\/font>","source.href":"https:\/\/www.ellenmacarthurfoundation.org","source.title":"ellenmacarthurfoundation.org","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"There’s a lot to be learnt from the artisans of Africa, and these talents are vital for advancing a circular economy circular economy A systems solution framework that tackles global challenges like climate change, biodiversity loss, waste, and pollution. It is based on three principles, driven by design: eliminate waste and pollution, circulate products and materials (at their highest value), and regenerate nature. globally. Repair and repurpose: vital loops in a circular economy Repair and repurpose strategies are essential, but frequently overlooked functions of the circular economy , key to circulating products and materials at their highest value. By keeping products, and – when they can no longer be used – their components and raw materials in use, nothing becomes waste and the intrinsic value of products and materials is retained. Image by Alex Mania (Ideas Unplugged) via Better Futures Colab. Although designing out waste in the first place is the priority, by extending the life of existing products through repair and repurposing, materials are kept in the economy and out of the environment. Developing these loops brings economic benefits. “Adopting value-retention processes is a win-win situation for governments, industry and customers,” according to the UN Environment Programme (UNEP). “Governments would have less waste to deal with, generate green jobs, and stimulate economic growth; industry could lower production costs, avoid resource constraints on business growth, and open new markets; and customers could benefit from lower prices for refurbished products.” The economic advantage is key. Some estimates put the annual growth of the repair and maintenance sector as high as 8.5% in 2023 with a total global value of USD 1,536 billion. A return to resourcefulness The Global North is beginning to return to these lost values, driven by an awakening to the damage caused by our wasteful economy, and the cost of living crisis. A trend to mend has been identified in the UK. In Germany, Repair Initiatives have been proliferating across the country. In Copenhagen, Resource Rows is building an entire new urban development from resources that would normally have been considered waste. From community repair cafes (now numbering more than 2,500 around the world); to disruptive digital start-ups (such as Sojo, which aims to make repairs accessible from your smartphone); and major corporate repair offerings from the likes of Apple and Tommy Hilfiger, repair is increasingly à la mode. Even celebrities are lending their weight to more circular consumption: Angelina Jolie’s recently launched Atelier Jolie links consumers with tailors to make individual products using leftover quality vintage material and deadstock. Although in African countries the sector has grown organically and still exists largely outside policy frameworks, in the Global North policy is beginning to move in support of these approaches. In March 2023 the European Commission adopted a ‘Right to Repair’ proposal, which will make it easier and more cost-effective for consumers to repair as opposed to replace goods. In North America, Canada announced a plan to implement the right to repair for electronic equipment in 2024, and Colorado passed the first Right to Repair legislation for agricultural equipment in April this year. So what can the Global North learn from Africa as it re-establishes these sidelined sectors? Four ways to embed repair and repurpose Mindset change The very first priority is a mindset shift. Companies and consumers in the Global North must continue to reevaluate their attitude towards repaired and repurposed products. It’s a process that’s already underway. The popularity of remanufactured automotive parts has grown, and acceptance of reconditioned electronic goods is also increasing. Europe’s refurbished mobile phone market, for example, is projected to grow by almost 10% a year between 2023 and 2033. However, for the segment to reach the necessary scale to cement a circular economy in place, refurbished goods across the board need to be as attractive as new ones. Appealing to consumers’ growing sustainability sensibilities to make refurbished goods ‘cool’ is one way of boosting sales, and one that has already borne fruit in the booming preloved clothing market where buying second hand has gone from niche to mainstream. That the UK’s popular reality TV show, Love Island, has switched from a fast-fashion sponsor to eBay is testament to the changing status of the resale sector. With Harry Styles's stylist launching a Depop store, Olivia Rodrigo popping on the app to sell her clothes, and tens of billions of TikTokkers celebrating the power of the old in fashion, it is clear that the resale sector has not only found its space, but is here to stay. In Africa, consumers are starting to view these products as positively as new ones. In Nairobi, Awale believes young people are driving the segment: “they see the craftsmanship and quality of our products and compare it to the imports they are buying. Upcycled products are cool and original, and they last longer.” Skills training Access to skills is critical. “We’re really big on crafts,” says Awale; “ it could be woodwork, metalwork or tailoring. If you’ve got an idea you want to try out and you can’t make it, you can find someone in the neighbourhood who can.” The same access does not exist in the blue collar economies of the Global North, and the International Labor Organisation has already identified skills gaps as a bottleneck for green growth in a number of sectors. Training more people in repair and artisanal skills, and finding ways to connect craftspeople with consumers nearby is key to developing the sector. Convenience It’s got to be easy. The Better Futures CoLab Repair & Reuse study found that “consumers were generally willing to repair broken items, however, their intentions could easily be hampered if repairs were seen to require too much effort compared to replacement”. African markets and high streets throng with stalls offering repair services. Generally, such hyperlocalised repair communities are the first port of call for customers; enhancing these can promote their use. Similarly, creating effective infrastructure for collecting, sorting, and redistributing products that have life extension potential is vital to divert usable materials from landfill. Essentially in order to scale these operations up, time-poor consumers need to know where to drop products; repairers and repurposers need to be able to easily find and collect them. Certification To keep returning to repair services, customers need to trust the quality of the work. Certification can be vital in this regard. “Both security and quality vetting are instrumental in promoting this reuse and repurposing culture,” says Irakoze. “These are some of the big challenges we scoped in this market. Our refurbishment lab checks device components and checks their durability durability The ability of a product, component or material to remain functional and relevant when used as intended. , and security.” Verifying workmanship in this way is crucial to building a consumer base and growing the sector. Moving forward together Africa has an established culture of repurposing materials, but the system is not perfect. Challenges exist around the quality of repairs, trust between consumers and businesses, a lack of policy support, and – as wealth increases – a growing trend towards the same disposable consumerism seen in the Global North. The continent currently generates less waste than much of the rest of the world but if current trends persist, sub-Saharan Africa is forecast to become the biggest global producer of waste. The continent can avoid making the same polluting mistakes as the Global North by preserving and enhancing existing talents for repair and repurpose. Rowe points out that “Europe has far greater advancements in policies, regulations and infrastructure promoting the circular economy and encouraging repair and reuse practices.” For example, the EU’s ecodesign rules require that spare parts are available for a product for a certain amount of time. Although both the Global North and Global South face unique challenges and opportunities, by harnessing the best practice of each region, the repair and repurpose sector could take critical strides forward. Key areas for development include: Standards Wastezon has identified the need to reassure their customers with guaranteed workmanship, but providing this reassurance at a national or regional scale has the potential to accelerate uptake of the sector. Centralised certification and regulation can level the playing field and build consumer confidence in the repair and repurpose sector. Legislating for such capacity changes the governance structure of the repair industry. Rather than manufacturers deciding which products are repairable or not, by creating a centralised set of standards and mandating access to competitive services, consumers and independent repair businesses can contribute to the development of the sector. But Rowe cautions that such standards should not force the formalisation of activities: “it’s through formalisation that repair can become a very exclusive experience, particularly for those that have existed in the informal part of the economy for decades.” As yet, the way forward for this isn't clear, but it will be the subject of Rowe's next study and hopefully provide crucial learnings for such collaborations across geographies and sectors. Accessibility Spare parts have to be easily accessible. Technology can help here. 3D printing, for example, can make a huge catalogue of parts available to tradespeople around the world. Digital parts tracing can improve transparency in availability and pricing of spare parts. A Brazilian platform – Spare Track – aims to do just this. However the reliance on online systems requires reliable and accessible internet systems, with a risk of deepening the digital divide. Innovation interventions in this regard need to be sensitive to the availability of online connections. Data “There’s just no data on repair,” says Rowe. “For me it’s another big area of opportunity. Imagine if we had enough data and insights to understand the repair and reuse economy across the entire continent and world. Big brands and businesses want to commit but they struggle to know where and how.” Data could surface the extent of the opportunity, the gaps, the success factors, and support businesses in the development of new business models and services. Talent hubs Rather than each national economy working to become a jack of all trades, the concept of value pools based on existing strengths holds weight in the repair and repurpose sector. Developing regional hubs for repair could play to current localised talents, and provide a pathway to scaling up hyperlocalised approaches where appropriate, driving reciprocal trade within those regions. For example, a broken computer could be taken to a local collection centre by the consumer then shipped to a central repair hub for specialised repair before being returned to the collection point. Policy and incentives Policies such as Extended Producer Responsibility and a ‘Right to Repair’ create push factors impelling businesses to create more robust products and provide repair infrastructure. In countries such as Slovenia and Sweden, governments have slashed VAT on repair services. France’s Repairability Repairability The ease with which a product or component can be repaired. Index mandates the display of clear repair information for electronic equipment.","filter_flag":1}
{"title":"Companies are claiming to be 'plastic neutral.' Is it greenwashing? - Grist","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vZ3Jpc3Qub3JnL2FjY291bnRhYmlsaXR5L2NvbXBhbmllcy1hcmUtY2xhaW1pbmctdG8tYmUtcGxhc3RpYy1uZXV0cmFsLWlzLWl0LWdyZWVud2FzaGluZy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vZ3Jpc3Qub3JnL2FjY291bnRhYmlsaXR5L2NvbXBhbmllcy1hcmUtY2xhaW1pbmctdG8tYmUtcGxhc3RpYy1uZXV0cmFsLWlzLWl0LWdyZWVud2FzaGluZy_SAQA?oc=5","id":"CBMiYWh0dHBzOi8vZ3Jpc3Qub3JnL2FjY291bnRhYmlsaXR5L2NvbXBhbmllcy1hcmUtY2xhaW1pbmctdG8tYmUtcGxhc3RpYy1uZXV0cmFsLWlzLWl0LWdyZWVud2FzaGluZy_SAQA","guidislink":false,"published":"Mon, 11 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=254, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vZ3Jpc3Qub3JnL2FjY291bnRhYmlsaXR5L2NvbXBhbmllcy1hcmUtY2xhaW1pbmctdG8tYmUtcGxhc3RpYy1uZXV0cmFsLWlzLWl0LWdyZWVud2FzaGluZy_SAQA?oc=5\" target=\"_blank\">Companies are claiming to be 'plastic neutral.' Is it greenwashing?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Grist<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Companies are claiming to be 'plastic neutral.' Is it greenwashing? - Grist","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vZ3Jpc3Qub3JnL2FjY291bnRhYmlsaXR5L2NvbXBhbmllcy1hcmUtY2xhaW1pbmctdG8tYmUtcGxhc3RpYy1uZXV0cmFsLWlzLWl0LWdyZWVud2FzaGluZy_SAQA?oc=5\" target=\"_blank\">Companies are claiming to be 'plastic neutral.' Is it greenwashing?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Grist<\/font>","source.href":"https:\/\/grist.org","source.title":"Grist","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"For years, companies have been trying to offset their greenhouse gas emissions with carbon credits. Now, they want to do the same thing for their plastic pollution. A growing number of companies are claiming “plastic neutrality” through the purchase of so-called plastic credits, tradable units that typically each represent 1 metric ton of plastic waste that’s been removed from the environment. These credits, sold by dozens of unregulated businesses and nonprofits, are supposed to complement companies’ internal plastic reduction strategies while also funding waste collection in the developing world. Companies as varied as Burt’s Bees, Nestlé, and the pet food brand Nature’s Logic have vowed to neutralize at least some of their plastic footprint using credits. The beauty product company Davines, for example, says that for every piece of plastic it sells to consumers, it funds the removal of an equivalent amount of plastic from coastal areas in Indonesia, the Philippines, and Brazil. “We are reaching a 1:1 balance between the plastic we use and the plastic we remove from the environment,” the company says on its website. To support our nonprofit environmental journalism, please consider disabling your ad-blocker to allow ads on Grist. Here's How But does plastic waste collection in one part of the world really “offset” the impacts from ongoing plastic production, use, and disposal somewhere else? Some experts and environmental groups are skeptical. They worry that plastic credits place a disproportionate emphasis on managing, rather than reducing, plastic garbage. Some say credits are just a way for polluters to burnish their reputations without taking responsibility for the plastic they produce. “Frankly, it’s all greenwashing,” said Kevin Budris, advocacy director for the nonprofit Just Zero. “The only real solution to the full suite of plastic pollution problems is to stop making so much plastic in the first place.” If you look at most of the plastic crediting initiatives out there — and there are a lot — most of them offer a similar value proposition: Plastic credits can help fund waste collection in the developing world. Here’s how they work: A crediting organization funds a project that purports to collect plastic pollution, or prevent it from escaping into the environment. This could be a beach or river cleanup that collects low-value, nonrecyclable plastic waste and disposes of it in a controlled landfill. Or it could be a program to pay “waste pickers,” the uncontracted workers who make their living by collecting refuse from dump sites and the natural environment and selling it to recyclers. The main requirement is that activities funded by plastic credits would not have taken place otherwise: They have to be “additional,” in the industry parlance. To support our nonprofit environmental journalism, please consider disabling your ad-blocker to allow ads on Grist. Here's How That crediting initiative then measures the amount of waste collected and posts the appropriate number of credits in a registry, usually one credit per metric ton. Companies buy those credits, and by doing so they support the underlying plastic collection activity. Waste pickers collect plastic and other refuse at a dump in Sylhet, Bangladesh. Md Rafayat Haque Khan \/ Eyepix Group \/ Future Publishing via Getty Images According to Peter Hjemdahl, co-founder of the plastic crediting initiative Repurpose Global, this financing from the private sector is “critical” for cleaning up plastic waste and “empowering” waste pickers. After all, many parts of the world lack formal waste management infrastructure to deal with domestically generated trash, let alone the 14 million metric tons of plastic that enters the ocean each year and may wash up on their shores. Hjemdahl claims companies want to fund these activities because their employees have “moral consciousness.” But there are other, more practical reasons companies might want to buy plastic credits: According to Thierry Sanders, co-founder and director of the crediting company Circular Action BV, polluters that have to comply with “extended producer responsibility,” or EPR, laws — policies that make companies financially responsible for dealing the pollution they cause — can use plastic credits to demonstrate that a certain percentage of the plastic they sell is ultimately collected and recycled. In Vietnam, for example, an EPR law enacted last year set mandatory recycling targets for a range of products, including plastic packaging. Any company wanting to sell plastic packaging could use plastic credits to prove that the required percentage of its sales was eventually recycled. (At least, they could prove that a certain amount of plastic was recycled; it would be nearly impossible to prove it was their plastic that was collected and turned into new products.) The current reality, however, is that most parts of the world don’t have EPR laws — which leads to the third and perhaps most salient reason companies are interested in plastic credits: for their marketing value. Credits are “more for corporations that want to make specific claims,” said Vincent Decap, co-founder of a crediting initiative called Zero Plastic Oceans. Indeed, many plastic crediting programs have a prominent section of their website explaining how companies can use credits to make green marketing claims, or affix proprietary labels to their products. Repurpose Global notes on its website that eco-friendly labels help products “scale significantly faster.” PCX, another crediting organization, encourages brands to “wear your badge with pride,” because doing so will help consumers “know you’re the real deal.” Most of these badges and labels involve some kind of offsetting language, like “plastic neutral,” “net circular plastic,” and “net-zero plastic to nature.” Similar to carbon credits, these claims generally mean that a company has purchased enough plastic credits to “offset” whatever plastic pollution it contributes to the world. In this way, the impact of one plastic bag sold to the public — and potentially littered into the ocean — is supposedly neutralized by the collection of an equivalent amount of plastic pollution by weight. Some 14 million metric tons of plastic enters the ocean each year. Mladen Antonov \/ AFP via Getty Images The problem, however, is that not everyone believes those neutrality claims are the real deal. First is an equivalency concern: Unlike with carbon molecules, which one can reasonably assume will all behave similarly in the atmosphere, not all plastics are created equal. Plastic film is the most lethal form of plastic to marine life and is extremely difficult to remove from the environment and recycle. Plastics labeled with a number 3, 6, or 7 may be more likely than others to release hormone and endocrine disruptors. Meanwhile, PET water bottles, labeled with the number 1, aren’t as dangerous to natural environments and tend to get recycled. Yet crediting programs may ignore these differences, using the collection of one polymer to ostensibly neutralize the impact of another. More broadly, there are concerns that neutrality will be used to justify ongoing plastic use and production, since the phrase implies that plastic production can be impact-free as long as it is “canceled out” with credits. To the contrary, plastic — which is made from fossil fuels — causes harms at every stage of its life cycle. Oil and gas extraction can create air and groundwater pollution that harms people living nearby. Manufacturing can release additional pollution that disproportionately impacts low-income communities and people of color, and plastic products sitting on supermarket shelves can leach toxic chemicals into people’s food and beverages. According to Alejandra Warren, co-founder and executive director of the nonprofit Plastic Free Future, these impacts are by no means erased when a plastic producer in one country pays for garbage to be removed from another country’s shoreline. “Plastic credits do not address the ongoing and future environmental injustices caused by the plastics industries around the world,” she told Grist. Plastic crediting organizations are not oblivious to these concerns, especially as the carbon market has become engulfed in controversy over alleged greenwashing and “phantom” carbon credits that don’t actually cancel out ongoing greenhouse gas emissions. By selling potentially fraudulent carbon offsets, some lawyers say carbon crediting organizations have put themselves at risk of a “wave of litigation” from consumer protection lawsuits. According to the legal nonprofit ClientEarth, plastic creditors may be exposing themselves to the same risks. Some crediting organizations are trying to distance themselves from those controversies by moving away from neutrality claims and toward something called a “contribution model,” in which companies pay for plastic credits without the goal of claiming plastic neutrality. Rather than bearing a “net-zero plastic” label, a product might read, “This company paid for the removal of 5 tons of plastic litter in 2022.” That kind of label describes “what’s actually happening,” said Alix Grabowski, director of plastic and material science for the nonprofit WWF, “versus this vague term of ‘neutral,’ which no one knows what it really means.” She said it would be helpful for regulators like the Federal Trade Commission, which enforces the United States’ consumer protection laws, to step in with some clearer guidelines on these kinds of environmental claims. Others are hopeful that an initiative called the Plastic Footprint Network, composed of consulting groups, plastic crediting initiatives, and a small number of nonprofits, will rally the industry around a common set of standards. Plastic bottles at a junk shop in Manila, Philippines. Ezra Acayan \/ Getty Images Decap, whose organization Zero Plastic Oceans offers companies a label that reads “ocean-bound plastic neutral,” said he hopes to switch to contribution-based labels by sometime next year. That way, he said, “we will not have this stain from what’s happening in the carbon market, which is honestly pretty ugly.” Hjemdahl also said more contribution-based language is needed, although he didn’t say whether or when Repurpose Global would phase out its plastic neutrality labels. Regardless of the kinds of claims companies make about plastic credits, they remain controversial. Credits represent a waste management approach to addressing the plastic pollution crisis, rather than the strict controls on plastic production that many experts and environmental advocates would prefer to focus on. Hjemdahl, with Repurpose Global, said reducing plastic production needs to be prioritized “first and foremost,” but also said that choosing one over the other creates a “false dichotomy” that is “actively allowing polluters to thrive amid the lack of clarity from practitioners.” According to him, plastic reduction “is not going to have an impact by itself if there is no infrastructure to actually collect waste in the first place.” Environmental advocates, on the other hand, say it’s the other way around: Even the sincerest efforts to ramp up waste collection and recycling will be futile in the face of the plastic industry’s plans to triple plastic production by 2060 — a scenario that’s expected to generate 44 million metric tons of plastic pollution annually. “If reduction and cleanup efforts are pursued simultaneously, but cleanup efforts are getting even an equal amount of attention, then those are resources and efforts that are misplaced,” said Budris, with Just Zero. He and others argue that cleanups like those encouraged by plastic credits align with the petrochemical industry’s “sophisticated greenwashing” strategy to build good will among consumers and policymakers so they can justify not imposing caps or reductions on the production of plastic. This dynamic has played out prominently in negotiations for a global plastics treaty, in which oil-producing nations have called for more cleanups and recycling as an alternative to a cap on plastic manufacturing. It’s also manifested in industry-led cleanup initiatives like the Alliance to End Plastic Waste, whose fossil fuel and petrochemical company members, including Exxon Mobil and Shell, have a vested interest in keeping the world dependent on plastics. Budris called it “preposterous” to frame plastic credits as a way to support waste pickers in the developing world. So much of the plastic waste that pickers deal with, he said, can be traced to the fact that they’re “drowning in a tide of single-use plastic” whose production they had no say in or control over. “If these companies really want to do something to improve waste management in the Global South,” he added, “they need to just stop making so much plastic. That’s the easiest route to addressing so many of these issues.”","filter_flag":1}
{"title":"The case for chemical recycling and mass balance accounting - BusinessGreen","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmJ1c2luZXNzZ3JlZW4uY29tL3Nwb25zb3JlZC80MTI4MTM3L2Rvdy1iZy1lbmdhZ2UtY2FzZS1jaGVtaWNhbC1yZWN5Y2xpbmctbWFzcy1iYWxhbmNlLWFjY291bnRpbmfSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmJ1c2luZXNzZ3JlZW4uY29tL3Nwb25zb3JlZC80MTI4MTM3L2Rvdy1iZy1lbmdhZ2UtY2FzZS1jaGVtaWNhbC1yZWN5Y2xpbmctbWFzcy1iYWxhbmNlLWFjY291bnRpbmfSAQA?oc=5","id":"CBMibWh0dHBzOi8vd3d3LmJ1c2luZXNzZ3JlZW4uY29tL3Nwb25zb3JlZC80MTI4MTM3L2Rvdy1iZy1lbmdhZ2UtY2FzZS1jaGVtaWNhbC1yZWN5Y2xpbmctbWFzcy1iYWxhbmNlLWFjY291bnRpbmfSAQA","guidislink":false,"published":"Wed, 27 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=270, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmJ1c2luZXNzZ3JlZW4uY29tL3Nwb25zb3JlZC80MTI4MTM3L2Rvdy1iZy1lbmdhZ2UtY2FzZS1jaGVtaWNhbC1yZWN5Y2xpbmctbWFzcy1iYWxhbmNlLWFjY291bnRpbmfSAQA?oc=5\" target=\"_blank\">The case for chemical recycling and mass balance accounting<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BusinessGreen<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The case for chemical recycling and mass balance accounting - BusinessGreen","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmJ1c2luZXNzZ3JlZW4uY29tL3Nwb25zb3JlZC80MTI4MTM3L2Rvdy1iZy1lbmdhZ2UtY2FzZS1jaGVtaWNhbC1yZWN5Y2xpbmctbWFzcy1iYWxhbmNlLWFjY291bnRpbmfSAQA?oc=5\" target=\"_blank\">The case for chemical recycling and mass balance accounting<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BusinessGreen<\/font>","source.href":"https:\/\/www.businessgreen.com","source.title":"BusinessGreen","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"As countries around the world continue to witness extreme weather events and climate change, along with concerning levels of plastic pollution and dwindling resources, the need for action is becoming ever more urgent by the day. Our industry is at the forefront of the issue, with a responsibility to drive the change needed to address climate change and the plastic waste crisis, which pose an existential threat to our planet. Plastics are essential to our society; we rely on their performance, benefits and convenience and their use has revolutionised our lives, from hygienic food packaging to safer medical supplies, lighter cars and more durable construction materials. But the affordability of plastic products has resulted in significant plastic use which has not been matched by an equivalently efficient end of life management process. It is clear that something must be done to reduce fossil based raw materials and associated carbon emissions and implement an effective circular economy within our industry. However, the industry cannot face this challenge alone; we must work alongside government on the formation of a workable circular economy. Governments are already beginning to prioritise the issue in their net zero strategies. Tackling plastic pollution is a key element of the European Green Deal, a roadmap which outlines the EU's ambition to reach net zero by 2050. As part of the Green Deal, the plastic value chains face bolder regulations on circularity for several end-markets such as packaging and automotive e.g. the Packaging and Packaging Waste Regulation (PPWR) and End of Life Vehicle Directive (ELV). Within packaging, under the latest European Commission proposal, EU member states must reduce packaging waste per capita by 15 per cent by 2040, in comparison with 2018 levels. Additionally, the following conditions are proposed with a 2030 deadline: Mandatory recyclability for all packaging based on design for recycling criteria. Mandatory recycled content targets for plastic packaging (differing targets with a 2030 and 2040 deadline). Mandatory eco-modulated packaging Extended Producer Responsibility fees based on recyclability for all packaging. At Dow, we see these proposed changes as positive, reflecting a sensible way forward for the industry. Through our own \"Transform the Waste\" strategy, we have committed to deliver globally three million metric tons per year of circular and renewable solutions by 2030, and we are investing in new technologies to produce circular products from plastic waste to meet rising market demand. However, in order to reach the recycled content targets outlined in the PPWR and the ELV Directive, the plastics industry and value chain need policymakers to introduce the right framework to truly enable the transition to a circular economy, where all plastics recycling technologies are recognised and scaled up significantly. This will be essential for an effective transition to a sustainable business model. Why should we invest in chemical recycling? When you think about recycling, you're probably picturing mechanical recycling. This is the most commonly used process by which plastic waste is turned into new products, without the molecular structure of the material being significantly altered. Mechanical recycling is critical and accounts for the majority of recycling volumes in Europe. As such, Dow is working with and investing in mechanical recycling companies like Valoregen. The process uses less energy than other forms of recycling, but it does have limitations. For example, highly regulated plastics such as those used in food packaging - approximately nine million tons of polyethylene and polypropylene are used in food packaging in the EU alone - cannot currently be produced by mechanical recycling at scale due to quality, performance and safety restrictions. To enable broader use of recycled plastic, Dow is investing in innovative companies, including Mura Technology, Valoregen, and Plastogaz, to scale up a technology called chemical recycling. Also known as advanced recycling, this is a complementary technology to mechanical recycling. It allows plastics which were previously difficult to recycle mechanically to be recycled back into the initial raw material (oil or gas), from which new plastic is made. This means the recycled plastic has the same performance and safety characteristics as virgin plastics. By investing in chemical recycling, alongside mechanical recycling, we can therefore help improve overall plastics recycling rates and achieve recycled content targets in this sector. Recent Life Cycle Assessment data, produced by the WMG research group at the University of Warwick, found that every ton of plastic that is chemically recycled prevents nearly three tons of CO2 being released through incineration. Alongside our partner Mura Technology, we are planning and building multiple chemical recycling facilities in the US and Europe, adding as much as 600 kilotons of recycling capacity by 2030. Additionally, Mura is opening a plant in Teesside in the UK later this year. A recent report from the European Commission's Joint Research Centre shows that Mura's specific technology - HydroPRS - has a global warming potential that is circa 50 per cent lower than the other chemical recycling process, pyrolysis. We still need to go further to expand chemical recycling to meet the recycled content targets, but to reach policy targets and market needs on recycled plastics, we must also have legal recognition of mass balance accounting. What is mass balance accounting and why do we need it? Mass balance accounting is, in short, a method which monitors the level of a sustainable raw material in a product by examining all inputs and outputs as they move through the production and supply chain. Let's start with what you may recognise - the mass balance models which already exist. For instance, the electricity we purchase is a combination of solar or wind powered electricity AND traditional oil or coal-based electricity. This combination is unavoidable as we transition from fossil-based energy to renewable energy. The Renewable Energy Certificates (REC), which are used in the electricity grid, are based on mass balance accounting. These allow industry and consumers to incentivise electricity producers to make the switch to renewable sources of energy. As renewable energy supply expands, the solar and wind powered electricity that goes into the grid will grow and the coal and oil-based electricity will diminish. A mass balance approach has many benefits. In the plastics industry, it addresses concerns from brand owners about recycled content at product level for food contact applications, and also allows credible product claims to be communicated to consumers, as the audited process enables traceability throughout the supply chain. This empowers consumers to drive a change in the packaging value chain, preventing greenwashing and allowing the scale-up of circular solutions. As importantly, this method encourages businesses to replace fossil, crude oil based feedstocks with plastic waste alternatives, enabling the transition to a circular economy at pace while keeping products affordable to consumers. By allowing recycled plastic use in all final products including food packaging, where existing recycling technologies have limitations, mass balance accounting can help the industry address consumers' rising demand for recycled products. What are the dangers of failing to recognise mass balance accounting? If we want to tackle the plastics problem effectively, mass balance accounting is an essential piece of the puzzle. The risks of not recognising this process are two-fold. Firstly, brands and retailers will struggle to meet legal requirements on recycled content and consumers' expectations of meaningful recycled content targets across Europe. Dow supports mass balance accounting as a way to deliver credible product claims to consumers, helping them to make informed decisions at point of sale. Secondly, building up chemical recycling plants to turn plastic waste into oil and gas for new recycled plastics comes with a cost. The smaller the proportion of the input that we can count as recycled content, the more expensive the circular products become, impacting the prices for consumers. This could result in lower consumer demand for recycled products at a time when it's imperative that consumers' interest in sustainable products is not lost. At Dow, we believe that acceptance of mass balance accounting is the only viable means of accounting for chemically recycled content if we want to drastically scale up circular solutions. The fundamental role of mass balance accounting in the circular transition There has never been a more vital time to acknowledge the role that chemical recycling and mass balance must play in the transition to a circular, low-carbon economy. Within the plastics and chemical industries, these processes would facilitate the replacement of fossil feedstocks and help in the delivery of products with credited recycled content to consumers. There is currently no alternative to chemical recycling in specific plastic products such as food packaging, where existing recycling technologies meet their limits. It is only through a mass balance accounting system that we can enable the expansion of chemical recycling required, and consequently achieve the reduction of fossil fuels required by industry to meet its net zero ambition by 2050. The plastics industry has welcomed the clear direction set by the European Green Deal, and Dow is proud to be playing a key role in supporting innovation in the sector. Now, the onus is on policymakers to introduce policies which back an affordable scale-up of circular business models so that the industry can innovate further as needed, and so that Europe is able to leverage every opportunity to work towards its net zero goals. Peter Sandkuehler is director of sustainability EMEA at Dow Packaging and Specialty Plastics You can watch a video discussing the necessity of chemical recycling and mass balance accounting on Dow's YouTube channel.","filter_flag":1}
{"title":"Giants lead green packaging future - Vietnam Investment Review","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vdmlyLmNvbS52bi9naWFudHMtbGVhZC1ncmVlbi1wYWNrYWdpbmctZnV0dXJlLTEwNTM0My5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vdmlyLmNvbS52bi9naWFudHMtbGVhZC1ncmVlbi1wYWNrYWdpbmctZnV0dXJlLTEwNTM0My5odG1s0gEA?oc=5","id":"CBMiQWh0dHBzOi8vdmlyLmNvbS52bi9naWFudHMtbGVhZC1ncmVlbi1wYWNrYWdpbmctZnV0dXJlLTEwNTM0My5odG1s0gEA","guidislink":false,"published":"Wed, 20 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=263, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vdmlyLmNvbS52bi9naWFudHMtbGVhZC1ncmVlbi1wYWNrYWdpbmctZnV0dXJlLTEwNTM0My5odG1s0gEA?oc=5\" target=\"_blank\">Giants lead green packaging future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vietnam Investment Review<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Giants lead green packaging future - Vietnam Investment Review","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vdmlyLmNvbS52bi9naWFudHMtbGVhZC1ncmVlbi1wYWNrYWdpbmctZnV0dXJlLTEwNTM0My5odG1s0gEA?oc=5\" target=\"_blank\">Giants lead green packaging future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vietnam Investment Review<\/font>","source.href":"https:\/\/vir.com.vn","source.title":"Vietnam Investment Review","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Giants lead green packaging future, illustration photo\/ Source: freepik.com About 450 businesses from more than 30 countries and territories will gather for the 16th edition of ProPak in Ho Chi Minh City in November to establish a panorama of equipment and new technology in future food processing and packaging. The exhibition will offer a dynamic business platform that is shaping the future of the processing and packaging industries, particularly in an industry closely impacting the environment like packaging. Food packaging currently accounts for 30-50 per cent of the total packaging industry space, according to statistics from the Ministry of Industry and Trade, leading to a strong symbiotic relationship between the two fields of food and packaging. According to German data provider Statista, the packaging sector has been growing on-year with an average rate of 15-20 per cent, in parallel with the average increase of about 10 per cent of the food and beverages market over the next four years. Statista predicts that the retail sales of packaged food is growing on-year in Vietnam, with it forecasted to grow to $18.4 billion in 2023 and become one of the fastest growing fields in Vietnam, attracting the participation of foreign business sector. After the investment and expansion of many foreign food packaging manufacturing enterprises in recent years, such as Tetra Pak, SCG Packaging, Wing Fat Printing, Meiwa Pax, and St. Johns Vietnam, the Vietnamese market continues to record the appearance of new faces. Packaging equipment multinational Sidel decided to move its headquarters from Thailand to Vietnam at the beginning of this year to take advantage of opportunities from a new market. According to East and West Asia sales director Parkpoom Praprom, Sidel had a representative office in Vietnam before 2023. “But now, all main departments have been brought to Vietnam, and Sidel also recruited more Vietnamese staff for this transformation,” he said. Last year, German waste management and recycling solutions provider ALBA Group Asia also signed a $50 million cooperation agreement with VietCycle partner in Vietnam to cooperate in developing a recycling plastic processing company with capacity of 48,000 tonnes a year. The result of this joint venture is the appearance of the first largest recycled plastic factory in the north, expected to come into operation in 2024. Changes in food packaging production receive active support from the production transformation process of food businesses for green and sustainable consumer needs from customers. According to consulting company Nielsen, 86 per cent of Vietnamese consumers said they are willing to pay more for products with biological or recycled packaging. Meanwhile, the Law on Environmental Protection that took effect last year and regulates the payment of emission treatment fees, also creates a push for manufacturers to invest more in the transition to green and sustainable packaging. The game continues to be led by foreign businesses with great potential and pioneering in environmental activities. Le Thi Hong Nhi, head of Communications and Corporate Affairs at Unilever Vietnam, said, “The green transformation journey plays a nuclear role in moving towards sustainable development. We are committed to building a green value chain and have pioneered achieving net-zero emissions across the entire operating system since 2021.” To date, Unilever has reduced by more than half the virgin plastic used in packaging. Nearly two-thirds of packaging is recyclable, while it has collected and processed more than 20,000 tonnes of plastic waste, improving social welfare conditions for more than 2,500 female workers in the informal collection workforce. Meanwhile, design improvements to eliminate unnecessary packaging, lower the use of virgin plastic, and replace with environmentally friendly materials helped Nestlé Vietnam reduce nearly 2,500 tonnes of plastic packaging over the last two years. Khuat Quang Hung, head of Corporate Affairs of Nestlé Vietnam, said that about 94 per cent of Nestlé’s product packaging is designed to be recyclable and reusable. This business is also aiming to use single-layer packaging to help operate recycling in an easier manner. “There is no sanction that forces the company to do so, but we recognise our responsibility and always want to be at the forefront of transformation activities,” Hung told VIR. The process of switching from paper straws to plastic straws for the Milo brand has tripled Nestlé’s production costs, but reduced up to 700 tonnes of disposable plastic each year. Improving the packaging of Maggi soy sauce and bottle caps also contributes to a 10 per cent improvement in the weight of plastic used for one product, equivalent to 130 tonnes of plastic per year. LaVie, a beverage brand belonging to Nestlé’s ecosystem, is also a pioneer in using PET recycled plastic. Currently, one bottle of LaVie uses 50 per cent recycled plastic. “Recycling is just one step of the circular economy, the necessary condition is to have a collection system, technology and solutions suitable for all types of product packaging,” Hung added. Nguyen Van Viet, chairman of the Vietnam Beer-Alcohol-Beverage Association, said that packaging technology is becoming an important challenge for the beverage industry because from 2024, manufacturers and importers will have to carry out extended producer responsibility according to the Law on Environmental Protection. “Businesses that produce and use cans and bottles all lose recycling costs. We are proposing solutions to overcome difficulties for businesses, including supporting recycling costs, especially for domestic enterprises that are behind foreign enterprises in both capital source and production scale,” Viet said. He admitted that while the country is doing a good job of recycling beverage cans, there are often issues when it comes to other types of packaging recycling. “The problem in Vietnam today is not what technology to apply, but how to recycle,” he said. According to Praprom from Sidel, this business wants to provide standard, sustainable packaging products, and reduce the amount of waste through simple recycling, “Glass packaging products take twice the time to be transported to the factory for washing and recycling. Canned products will not need to return to the factory but can be recycled directly at the collection point,” Praprom explained. Boon Teong Tee - General manager Informa Markets Vietnam Over the past few years, the food and beverage packaging industry has benefited from the development of e-commerce and the rapid spread of app-based delivery business locally, and the free trade agreements that Vietnam has participated in. The effects of social distancing in 2020-2021 have created consumer habits which rapidly spread due to the convenience it offers and has expanded the use of fast-moving consumer goods (FMCG) packaging. To date, we do not see this trend diminishing and in fact, it has accelerated due to its convenience element, and at the cost of more FMCG waste to be managed in the cities. This recent phenomenon has disrupted businesses and provided new opportunities for others. It has also introduced pressing needs of resource conservation through circularity practices, as Vietnam will be challenged to handle rapid FMCG waste volume increases. The urbanisation of Vietnam represents the key underlying reason, with both positive and negative effects for the environment and economy. Packaging remains one of the fastest growing sectors in the Vietnamese market, with a growth rate of 13.4 per cent per year in the 2015-2020 period. New products and technologies are expected to sustain this longer-term growth rate for the years to come. I think many market leaders are working aggressively towards creating products which generate less waste through circularity concepts that offer bigger recycling opportunities with lesser costs and simpler processes through the development of new materials and design. To acknowledge the growing importance of the drink and beverage industry, Informa Vietnam has also recently announced the launch of a dedicated exhibition focusing on new technologies and services to support the expanding drink and beverage industry. This exhibition cluster is co-located with Propak Vietnam and it is our intention to grow this sector aggressively for the expanding market. Hoang Duc Vuong - Chairman Vietnam Recycled Plastics Association The management of domestic waste in Vietnam in the past 40 years has not been properly cared for, with scrap taken to craft villages for recycling, causing pollution. For many years, waste has not been classified, leading to plastic scraps worth recycling being contaminated with unpleasant odors, and very difficult to clean. European deodorising technology will probably have to give up on waste in Vietnam if there is no waste classification. Most recyclers do not dare to use 100 per cent domestic scrap but mainly have to import scrap from abroad to ensure input. As for small recycling facilities in craft villages, the low quality of scrap is the very cause of poor quality recycled products, accompanied by secondary pollution. For businesses in this country, investment costs for recycling are very large, making competition with recycling craft villages more difficult. Classifying waste from beginning brings benefits that go beyond the development of the plastic recycling industry. Separating organic waste and recyclable waste from messy landfills is the first step to processing organic waste to make biofertiliser or animal feed and recycling less valuable waste such as nylon bags, cake shells, and candy shells. The benefits can be up to billions of dollars. I think that with the joint support of the community and international organisations, the recycling industry of Vietnam will also develop. It is because this is the path that must be taken if we want to build a circular economy, contribute to the circulation of waste, and save the cost of importing resources from abroad. Packaging provider SIG reinforces sustainability commitment in Asia Through its 25 years of sustainability journey in Asia, Switzerland-headquartered aseptic packaging solutions provider Schweizerische Industrie Gesellschaft (SIG) has been making ambitious sustainability commitments. Angela Lu, president and general manager Asia Pacific South at SIGdiscussed with VIR’s Luu Huong how SIG facilitates the consumer’s need for convenience, and how sustainable packaging is becoming a key focus for sustainability. ProPak Vietnam 2023 brings new solutions for the processing and packaging industry ProPak Vietnam 2023 is returning from November 8 to 10 at the Saigon Exhibition and Convention Center, promising to bring valuable trading opportunities for both domestic and foreign enterprises in the processing and packaging industries.","filter_flag":1}
{"title":"Products | UK Regulatory Outlook September 2023 - Osborne Clarke - Osborne Clarke","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3Lm9zYm9ybmVjbGFya2UuY29tL2luc2lnaHRzL3JlZ3VsYXRvcnktb3V0bG9vay1zZXB0ZW1iZXItMjAyMy1wcm9kdWN0c9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3Lm9zYm9ybmVjbGFya2UuY29tL2luc2lnaHRzL3JlZ3VsYXRvcnktb3V0bG9vay1zZXB0ZW1iZXItMjAyMy1wcm9kdWN0c9IBAA?oc=5","id":"CBMiUWh0dHBzOi8vd3d3Lm9zYm9ybmVjbGFya2UuY29tL2luc2lnaHRzL3JlZ3VsYXRvcnktb3V0bG9vay1zZXB0ZW1iZXItMjAyMy1wcm9kdWN0c9IBAA","guidislink":false,"published":"Wed, 27 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=270, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3Lm9zYm9ybmVjbGFya2UuY29tL2luc2lnaHRzL3JlZ3VsYXRvcnktb3V0bG9vay1zZXB0ZW1iZXItMjAyMy1wcm9kdWN0c9IBAA?oc=5\" target=\"_blank\">Products | UK Regulatory Outlook September 2023 - Osborne Clarke<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Osborne Clarke<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Products | UK Regulatory Outlook September 2023 - Osborne Clarke - Osborne Clarke","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3Lm9zYm9ybmVjbGFya2UuY29tL2luc2lnaHRzL3JlZ3VsYXRvcnktb3V0bG9vay1zZXB0ZW1iZXItMjAyMy1wcm9kdWN0c9IBAA?oc=5\" target=\"_blank\">Products | UK Regulatory Outlook September 2023 - Osborne Clarke<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Osborne Clarke<\/font>","source.href":"https:\/\/www.osborneclarke.com","source.title":"Osborne Clarke","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"UK government announces an indefinite extension of CE marking recognition | UK Product Safety Review | New guidance on Innovative Devices Access Pathway UK government announces an indefinite extension of CE marking recognition The UK government announced, on 1 August, an indefinite extension of CE marking recognition for businesses in the UK, which it hopes will ease the burdens on businesses by \"cutting barriers and red tape\". The Department for Business and Trade (DBT) confirmed on 1 August 2023 that businesses will be able to continue using the CE marking beyond the 31 December 2024 deadline, with the option for the UKCA (UK Conformity Assessed) mark to be used. Manufacturers can continue to use the UKCA marking for products to be placed on the Great Britain market. However, the UKCA mark is not recognised in the EU. UK manufacturers must continue to use the CE marking for goods to be placed on the EU market. See our Insight for more. There are different rules for medical devices, construction products, cableways, transportable pressure equipment, unmanned aircraft systems, rail products, marine equipment and ecodesign. The relevant departments covering these sectors either have communicated, or will communicate, plans in due course. The Medicines and Healthcare products Regulatory Agency (MHRA) has already confirmed that the announcement does not apply to medical devices. UK Product Safety Review On 2 August 2023, the government announced its consultation on proposals to overhaul the UK's product safety regulatory framework, the \"Product Safety Review\". The UK intends to adopt a new approach to product regulation, with a focus on potential hazards rather than sectors. The proposal is to move away from a perceived \"multiplicity of regulation\" and create a more streamlined single framework for product safety, which the government considers to be more proportionate. Product-specific regulation will only be used where strictly necessary. This is a significant departure from the EU position. The Product Safety Review puts forward a number of proposals, such as the introduction of e-labelling for product compliance information labelling whereby manufacturers could can make certain marking and compliance information available digitally via a screen rather than physically accompanying or indelibly marked on the product. Also there is a proposal for potential categorisation of products by hazards or risk (rather than product type or sector). A number of proposals have been put forward to regulate online sales and ensure online marketplaces are subject to proportionate responsibilities, including introducing specific duties for online marketplaces, such as exercising due care and removing unsafe product listings, in addition to ongoing importer or distributor obligations. While these proposals will be subject to the feedback received from the consultation, they indicate the government's clear intention to impose new obligations on online marketplaces. The government has not outlined how it will implement the proposals set out in the Product Safety Review, but recognises that primary legislation will need to be introduced to fully reform the UK product safety framework. It will also explore to what extent some of the proposals could be carried out through its powers in retained EU law. A consultation has now opened as the government seeks feedback on its proposals. This will close on 24 October 2023. New guidance on Innovative Devices Access Pathway (pilot scheme) Following the MHRA's announcement of plans for an Innovative Devices Access Pathway (IDAP) (see earlier Regulatory Outlook), it has now issued guidance on how to apply to be a part of the pilot phase (which will test the main elements of the pathway and help to build the future IDAP). The IDAP aims to help businesses bring innovative medical devices into the UK market to help with medical needs that are not currently being met. The IDAP partners will be choosing eight products that best meet the eligibility and innovation criteria. The successful applicants will then receive non-financial support from a team of experts at key stages of their product design and development stage. Businesses must apply by 29 October 2023. More details on applying to the IDAP pilot phase can be found here. There is also an opportunity to join the selection panel. PSTI Regulations made bringing into force security requirements for connectable products On 14 September 2023, the Product Security and Telecommunications Infrastructure (Security Requirements for Relevant Connectable Products) Regulations 2023 (Security Regulations) were made concerning security requirements for relevant products under the Product Security and Telecommunications Infrastructure Act 2022. The security regulations, which will come into force 29 April 2024, set out the minimum security requirements manufacturers of consumer connectable products must comply with, including: requirements for default passwords; information that must be provided to customers on how they can report security issues; and information that must be provided to customers on the minimum period for which relevant products will receive security updates. For further information, please see our previous Regulatory Outlook. Commission proposes a Toy Safety Regulation On 28 July 2023, the European Commission adopted a legislative proposal for a Regulation of the European Parliament and of the Council on the safety of toys. The proposal updates the safety requirements that toys must meet to be marketed in the EU, whether they are manufactured in the EU or elsewhere. In particular the proposal aims to: Increase protection from harmful chemicals by maintaining the current prohibition of substances that are carcinogenic, mutagenic or toxic for reproduction (CMRs), but it also prohibits the use of other harmful chemicals in toys, such as endocrine disruptors. Strengthen enforcement: The proposal ensures that only safe toys will be sold in the EU. All toys sold in the EU will be required to have a Digital Product Passport, which will include information on compliance with the proposed regulation. Importers will have to submit digital product passports for all toys at the EU borders, including for those sold online. A new IT system will screen all digital product passports at the external borders and will identify the shipments that need detailed controls at customs. National inspectors will continue to be responsible for carrying out checks on toys. In addition, if there are unsafe toys presenting risks not clearly foreseen by the regulation, the proposal ensures that the Commission has the power to require that these toys are taken off the market. See also the Q&A page for the proposal. Bans on single use plastics from 1 October 2023 As detailed in our previous Regulatory Outlook, the ban on further single-use plastic items in England comes in on 1 October 2023. The regulations imposing the bans were published on 7 September and come into force on 1 October. The regulations ban the supply of single-use plastic cutlery, balloon sticks, and expanded and foamed extruded polystyrene food and drinks containers. The regulation also bans the supply of single-use plastic plates, trays, and bowls to the end-user in England. This ban does not apply to the supply of a single-use plastic plate, tray, or bowl that is packaging as defined in regulation 3 of the Packaging (Essential Requirements) Regulations 2015. For example, this would include a bowl pre-filled with food before sale or a bowl filled with food at the counter of a takeaway. Sustainable batteries regulation published in Official Journal On 28 July, the Sustainable Batteries Regulation 2023\/1542 was published in the Official Journal of the European Union. It will apply to all batteries including all waste portable batteries (that is, those found in ordinary consumer goods), electric vehicle batteries, industrial batteries, starting, lightning and ignition batteries, used mostly for vehicles and machinery, and batteries for light means of transport. The regulation will apply from 18 August 2024, except for certain provisions relating to: treatment and recycling, which will continue to apply until 31 December 2025; labelling, which will continue to apply until 18 August 2026; and the removal of waste batteries and accumulators, which will continue to apply until 18 February 2027. Of importance to a number of businesses is that this new regulation introduces a requirement that by 2027 portable batteries incorporated into appliances should be removable and replaceable by the end-user. It also imposes, among other things, battery due diligence obligations on economic operators placing batteries on the market or putting them into service, as well as establishing requirements for digital battery passports. Agreement reached on Directive to ban greenwashing and improve consumer information on product durability On 19 September, the Council of the European Union and the European Parliament reached a provisional agreement on a directive to amend the Unfair Commercial Practices Directive and the Consumer Rights Directive, to prevent companies from making misleading environmental claims (see Advertising and marketing section for more). The directive also seeks to improve the credibility of sustainability labels by only allowing sustainability labels based on approved certification schemes or established by public authorities, clarifies traders' liability in relation to planned obsolescence, and harmonises labelling requirements for information about the durability of new products. The provisional agreement now needs to be endorsed and fully adopted by both European institutions. Following that, Member States will have a transposition period of 24 months to implement the changes. Requirements on energy labelling of smartphones and slate tablets published in Official Journal As detailed in an earlier Regulatory Outlook, the European Commission proposed new rules in regard to the energy labelling of smartphones and tablet which have now been published in the EU Official Journal. Devices that are put onto the Union market will have to display information on their energy efficiency, battery endurance, protection from dust and water, and resistance to accidental drops, as well as displaying a repairability score, which is the first time this is required on a product placed on the EU market. These rules will apply from 20 June 2025. Ecodesign requirements smartphones and mobile phones published in Official Journal The regulation setting out the ecodesign requirements for smartphones, mobile phones other than smartphones, cordless phones and slate tablets has also been published in the EU Official Journal. This regulation requires, among other things, that devices are able to be effectively repaired and spare parts should be available to professional repairers or end users, requirements to protect devices from dust and water and resistance to accidental drops. These rules will apply from 20 June 2025. Regulators defer enforcement of EPR As detailed in our previous Regulatory Outlook, the extended producer responsibility (EPR) scheme for packaging was delayed by a year and fees do not need to be paid until October 2025. Following this, the Environment Agency (regulator in England) and the Scottish Environment Protection Agency (regulator in Scotland) have now announced that enforcement action will not be taken against producers before 31 May 2024 even if they fail to report data. However, while enforcement action will not be taken until next year, it is still a legal requirement for businesses within scope to collect and report their packaging data by 1 October 2023. For those businesses in Wales, the reporting of packaging data for obligated producers comes into force in April 2024. A government guidance collection on the EPR for packaging has recently been published which will be of use for businesses to understand their obligations and what they need to do to comply with the rules. DRS set to be delayed until 2026 It has recently been reported that all the UK governments and industry bodies have reached a conclusion to delay the deposit return scheme (DRS) implementation until 2026, which was due to come into force in October 2025. At time of writing, the government has not yet published any details of this delay. CMA launches investigation into veterinary sciences The Competition and Markets Authority (CMA) has, on 7 September, launched an investigation into the provision of veterinary services in the UK, including: pricing; how prescriptions and medications are sold; chain practices; and out-of-hours options. Views are being sought from pet owners, veterinary surgeons, veterinary nurses, practice managers and veterinary businesses. The CMA will provide a further update on this review in early 2024, outlining the issues it has identified and its proposed next steps. This investigation comes after the review of the Veterinary Medicines Regulations 2013 earlier this year which poses the question of whether potential reforms are on the horizon for more accessible and transparent health services for pets. Consultation on mandatory disclosure of industry payments to the healthcare sector The MHRA has launched a consultation to introduce new legislation to place a duty on manufacturers and commercial suppliers of medicines, devices and borderline substances to report details of the payments and other benefits they provide to healthcare professionals (HCPs) and organisations. The consultation builds on issues identified by the Independent Medicines and Medical Devices Safety Review, which reported in 2020. The government asks whether the public should have access to information on how companies and HCPs interact in order to improve transparency for patients. This is in line with systems in place internationally, including the Netherlands, US and France. The consultation is open until 16 October 2023 Memorandum of Understanding between HSE and OPSS Please see Health and Safety.","filter_flag":1}
{"title":"Waste from electrical and electronic equipment - Malta Independent Online","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvbS5tdC9hcnRpY2xlcy8yMDIzLTA5LTAzL2J1c2luZXNzLW5ld3MvV2FzdGUtZnJvbS1lbGVjdHJpY2FsLWFuZC1lbGVjdHJvbmljLWVxdWlwbWVudC02NzM2MjU0NzY20gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvbS5tdC9hcnRpY2xlcy8yMDIzLTA5LTAzL2J1c2luZXNzLW5ld3MvV2FzdGUtZnJvbS1lbGVjdHJpY2FsLWFuZC1lbGVjdHJvbmljLWVxdWlwbWVudC02NzM2MjU0NzY20gEA?oc=5","id":"CBMiemh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvbS5tdC9hcnRpY2xlcy8yMDIzLTA5LTAzL2J1c2luZXNzLW5ld3MvV2FzdGUtZnJvbS1lbGVjdHJpY2FsLWFuZC1lbGVjdHJvbmljLWVxdWlwbWVudC02NzM2MjU0NzY20gEA","guidislink":false,"published":"Sun, 03 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=246, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvbS5tdC9hcnRpY2xlcy8yMDIzLTA5LTAzL2J1c2luZXNzLW5ld3MvV2FzdGUtZnJvbS1lbGVjdHJpY2FsLWFuZC1lbGVjdHJvbmljLWVxdWlwbWVudC02NzM2MjU0NzY20gEA?oc=5\" target=\"_blank\">Waste from electrical and electronic equipment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Malta Independent Online<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Waste from electrical and electronic equipment - Malta Independent Online","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvbS5tdC9hcnRpY2xlcy8yMDIzLTA5LTAzL2J1c2luZXNzLW5ld3MvV2FzdGUtZnJvbS1lbGVjdHJpY2FsLWFuZC1lbGVjdHJvbmljLWVxdWlwbWVudC02NzM2MjU0NzY20gEA?oc=5\" target=\"_blank\">Waste from electrical and electronic equipment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Malta Independent Online<\/font>","source.href":"https:\/\/www.independent.com.mt","source.title":"Malta Independent Online","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Electrical and Electronic waste, commonly known as Waste from Electrical and Electronic Equipment (WEEE), is a mounting environmental concern, both in Malta and worldwide. WEEE encompasses all devices with plugs or batteries, such as freezers, monitors, lamps, washing machines, vacuum cleaners, air conditioners, laptops, and mobile phones. Within WEEE, valuable materials and resources can be recovered and recycled, but they also contain hazardous substances that can pose risks to human health and the environment if not disposed of properly. In this regard, Waste Management (Electrical and Electronic Equipment) regulations, stemming from EU directives and applied variably across countries, are designed to curb the environmental and health effects of waste electrical and electronic equipment (WEEE). ADVERTISEMENT With respect to the local context, from 2004 to 2010, the annual waste generated in Malta declined from its peak. However, since 2010, the annual waste produced has been increasing again, and in 2020 the level of waste generated surpassed the levels recorded in 2006. The annual amount of Electrical and Electronic Equipment (EEEs) placed on the market declined from 3,716 tons in 2017 to 3,247 tons in 2021. Furthermore, the percentage of WEEE prepared for reuse and recycled increased from 9.77% to 22% over the same period. Domestic laws on WEEE in Malta are based on the Subsidiary Legislation 549.89, the Waste Management (Electrical and Electronic Equipment) Regulations, which transposed the EU Directive 2012\/19\/EU on WEEE. The aim of these regulations is to promote the prevention, reuse, recycle, and recovery of WEEE, and to reduce its environmental impact. In Malta, the regulations apply to all producers, registered producer either as self-compliant or authorised compliance scheme such as WEEE Malta, distributors and consumers of electrical and electronic equipment (EEE), as well as waste management operators who collect, transport, treat or export WEEE at the end of their life cycle. The regulations also define the categories of EEE and WEEE, the obligations of different actors, the registration and reporting requirements, the collection, targets, and the penalties for non-compliance. Moreover, the regulations uphold the principle of Extended Producer Responsibility (EPR), furthermore, EEE consumers who are encouraged to dispose of their old or unwanted appliances through various channels by WEEE Malta, which is a not-for-profit waste compliance scheme established by the Malta Chamber of Small & Medium Enterprises, GRTU, which manages WEEE on behalf of producers of EEE operating on the Maltese market, such as: Ø Door-to-door collection: Residents can schedule free WEEE pickups by phone or online. Ø Civic amenity sites: Six island-wide locations accept all WEEE seven days a week for free. Ø Retailers: Participating stores offer take-back services, recycling old items when new ones are purchased Ø Schools and businesses: Periodic WEEE collections are organized for schools and businesses in collaboration with the Malta Environment and Planning Authority (MEPA) and the Malta Communications Authority (MCA). This collective effort in an environmentally sound manner by consumers contributes to the circular economy, reducing the amount of waste sent to landfills, waste generation, greenhouse gas emissions, and carbon footprint, and creating eco-friendly job opportunities and safeguarding the environment and public health by recovering valuable materials from these devices to be repurposed to create new products, conserving energy, and resources, and ensuring the proper disposal of hazardous components. Managing WEEE sustainably, aligning with ESG criteria, which are increasingly used by stakeholders to assess the performance and impact of businesses, in Malta and globe, offers numerous benefits, including bolstering the Environmental, Social, and Governance (ESG) performance of businesses and organisations. By adhering to WEEE regulations, producers of EEE demonstrate their commitment to environmental protection, social responsibility, and good governance, which can elevate their reputation, competitiveness, and profitability. In this respect, combating the improper implementation of e-waste management could be undertaken by the following strategies: 1. Enhance Public Awareness and Education: Educate the public on e-waste disposal's importance and risks. Promote awareness of collection and recycling options. 2. Establishing and enforcing legislation and regulations: Implement strong e-waste laws covering collection to disposal, with shared responsibility among producers, importers, and consumers. 3. Promote Producer Responsibility: Implement Extended Producer Responsibility (EPR) initiatives to hold manufacturers accountable for product disposal and recycling. Promote recyclable designs and take-back programs. 4. Create accessible collection points: Establish convenient and accessible collection spots for e-waste throughout the country, such as recycling centres, retail stores, or designated zones. Simplifying the process to dispose of their electronic waste responsibly. 5. Advocate Reuse and Recycling: Promote the reuse of functional electronic devices whenever feasible. For non-functional items, use authorized facilities for safe recycling and hazardous waste disposal. 6. Formalise and Regulate Recycling Facilities: Address informal recycling practices that could endanger workers and the environment. Formalise and regulate recycling facilities to guarantee compliance with safety and environmental standards. 7. Provide training and capacity building: delivery training and capacity-building programs for workers engaged in e-waste management. Educate them about proper handling of hazardous materials and safe recycling practices. 8. Foster Collaborations between Public and Private Sectors: Encourage partnerships between governmental bodies, private enterprises, and non-governmental organisations to establish comprehensive e-waste management systems. Utilise combined resources and expertise to enhance the overall effectiveness of e-waste management. 9. Support Green Innovation: Invest research and innovation in e-waste management and recycling technologies. Cultivate the development of more efficient and environmentally friendly methods for handling e-waste. 10. Repair Centres: Establish repair centers that focus on various items, including electronics. These centres would serve as primary collection points for used products in need of repair, thus potentially reducing the amount of WEEE. This aligns with strategies for reuse and recycling, as well as promoting producer responsibility. 11. Government Support: Implement government-supported repair centres to address market inefficiencies, make repairs more cost-effective, and standardize the quality of repairs. This would complement existing legislation and regulations. In summary, WEEE presents significant health and environmental risks. Malta's regulations and adherence to the WEEE Directive focus on sustainable practices and responsible disposal. Compliance helps individuals and businesses promote a sustainable future and align with ESG criteria. Elena Goudarzvand is an Advisory Intern at PKF Malta","filter_flag":1}
