{"title":"Organic Valley Welcomes Jeff Frank As New Chief Executive Officer - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvb3JnYW5pYy12YWxsZXktd2VsY29tZXMtamVmZi1mcmFuay1hcy1uZXctY2hpZWYtZXhlY3V0aXZlLW9mZmljZXItMzAxNzIwMzk0Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvb3JnYW5pYy12YWxsZXktd2VsY29tZXMtamVmZi1mcmFuay1hcy1uZXctY2hpZWYtZXhlY3V0aXZlLW9mZmljZXItMzAxNzIwMzk0Lmh0bWzSAQA?oc=5","id":"CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvb3JnYW5pYy12YWxsZXktd2VsY29tZXMtamVmZi1mcmFuay1hcy1uZXctY2hpZWYtZXhlY3V0aXZlLW9mZmljZXItMzAxNzIwMzk0Lmh0bWzSAQA","guidislink":false,"published":"Thu, 12 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=12, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=12, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvb3JnYW5pYy12YWxsZXktd2VsY29tZXMtamVmZi1mcmFuay1hcy1uZXctY2hpZWYtZXhlY3V0aXZlLW9mZmljZXItMzAxNzIwMzk0Lmh0bWzSAQA?oc=5\" target=\"_blank\">Organic Valley Welcomes Jeff Frank As New Chief Executive Officer<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Organic Valley Welcomes Jeff Frank As New Chief Executive Officer - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvb3JnYW5pYy12YWxsZXktd2VsY29tZXMtamVmZi1mcmFuay1hcy1uZXctY2hpZWYtZXhlY3V0aXZlLW9mZmljZXItMzAxNzIwMzk0Lmh0bWzSAQA?oc=5\" target=\"_blank\">Organic Valley Welcomes Jeff Frank As New Chief Executive Officer<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Farmer-owned and known for its commitment to small organic family farms and farmer livelihoods, organic agriculture and its tenants of animal welfare and environmental stewardship, pioneering cooperative welcomes third CEO in its 35-year history LA FARGE, Wis., Jan. 12, 2023 \/PRNewswire\/ -- Organic Valley, the nation's leading cooperative of small organic family farms, announced today that Jeff Frank will join the cooperative as Chief Executive Officer, effective Jan. 23. Outgoing CEO Bob Kirchoff announced his retirement to the cooperative in 2022 and his last day will be Jan. 31. Frank has departed from his role at Hormel as group VP of grocery products to join Organic Valley as its third-ever CEO. Post this New Organic Valley CEO, Jeff Frank, will be starting at the co-op on Jan 23. \"We are happy to welcome Jeff as our next CEO to guide organic food and farming into the future,\" said Steve Pierson, president of the Organic Valley Board of Directors and a dairy farmer from Oregon. \"He shares our values and vision of nourishing people, animals and the earth through ethically sourced organic food from small family farms. He has the skills and experience to navigate the complex challenges facing small organic family farms.\" Jeff Frank joins from a 25-year career at Hormel Foods, where he demonstrated exceptional leadership skills and a strong ability to drive business growth. He began his journey with Hormel Foods in 1998, holding various senior roles in product and brand management. In 2009, he took on the role of vice president of marketing at MegaMex Foods. He was later promoted to president and CEO of MegaMex Foods, where he successfully led global supply chain efforts and brought successful consumer packaged goods to the market. Frank holds a bachelor's degree in business administration and Spanish from the University of Minnesota-Duluth, an MBA from the University of St. Thomas and an executive certificate from UCLA's Anderson School of Management. He has also completed the Executive Education program at Harvard Business School. Frank has departed from his role at Hormel as group vice president of grocery products to join Organic Valley as its third-ever CEO. \"It's truly an honor for me to join the cooperative. I have a deep admiration for the mission of this organization, and I'm excited to collaborate to drive continued success into the future!\" Frank said. \"I look forward to working with the board, the farmer-members and teams across the cooperative and the industry to expand the impact of this revolutionary and independent food lighthouse, while staying true to its values and mission of producing ethically sourced food from organic family farms.\" \"I am confident that Jeff will continue to uphold and enhance the reputation and values of Organic Valley,\" outgoing Organic Valley CEO Bob Kirchoff said. \"I think it's the perfect time for new leadership to guide the co-op's next phase of growth. I'm so proud of the hard work farmers and employees have put in to keep this cooperative moving forward. I am so grateful for having the opportunity the cooperative gave me and the support along the way.\" About Organic Valley Organic Valley is the leading organic farmer-owned cooperative on a mission to save, serve and safeguard small organic family farms. The brand's products are ethically sourced, which we define as food raised on organic farms where families manage the daily care for the animals and the earth while living up to the requirements of the USDA National Organic Program as well as our cooperative's own high standards and practices designed to promote the principles of organic agriculture, including respect for the dignity and interdependence of human, animal, plant, soil and global life. Founded in 1988, today the cooperative is owned by more than 1,700 organic family farms. Visit ov.coop for more information. Organic Valley is also @OrganicValley on Instagram, Facebook, LinkedIn, TikTok, and Twitter. Media Contact: Joshua Fairfield [email protected] 608-632-9157 SOURCE Organic Valley","filter_flag":1}
{"title":"New Vegan Tuna and Salmon Roll Out at Whole Foods Sushi Counters - VegNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vdmVnbmV3cy5jb20vdmVnYW4tdHVuYS1zYWxtb24td2hvbGUtZm9vZHMtc3VzaGktY291bnRlcnPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vdmVnbmV3cy5jb20vdmVnYW4tdHVuYS1zYWxtb24td2hvbGUtZm9vZHMtc3VzaGktY291bnRlcnPSAQA?oc=5","id":"CBMiQGh0dHBzOi8vdmVnbmV3cy5jb20vdmVnYW4tdHVuYS1zYWxtb24td2hvbGUtZm9vZHMtc3VzaGktY291bnRlcnPSAQA","guidislink":false,"published":"Thu, 26 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=26, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=26, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vdmVnbmV3cy5jb20vdmVnYW4tdHVuYS1zYWxtb24td2hvbGUtZm9vZHMtc3VzaGktY291bnRlcnPSAQA?oc=5\" target=\"_blank\">New Vegan Tuna and Salmon Roll Out at Whole Foods Sushi Counters<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New Vegan Tuna and Salmon Roll Out at Whole Foods Sushi Counters - VegNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vdmVnbmV3cy5jb20vdmVnYW4tdHVuYS1zYWxtb24td2hvbGUtZm9vZHMtc3VzaGktY291bnRlcnPSAQA?oc=5\" target=\"_blank\">New Vegan Tuna and Salmon Roll Out at Whole Foods Sushi Counters<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","source.href":"https:\/\/vegnews.com","source.title":"VegNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"The sushi counter at Whole Foods Market is a go-to for a quick meal but vegan options here have mostly been limited to edamame and avocado rolls. However, for some shoppers, that’s about to change with new vegan tuna and salmon rolls by Kikka Sushi. Kikka has been a partner of Whole Foods for more than 30 years and offers plant-based sushi options, such as vegetable and salad rolls, at 200 locations of the grocery chain. However, Kikka recently expanded its sushi selection to include its own plant-based fish alternatives, which are now hitting Whole Foods sushi counters at 17 flagship locations in six regions. “We have always had a strong emphasis on responsible environmental stewardship, and use products that are certified sustainable, natural, and responsible,” Grant Kimura, Director of Marketing and Business Development at Kikka Sushi, tells VegNews. Kikka Sushi “As food science and plant-based alternatives become more available, we have been able to develop a product in partnership with one of our vendors in Japan to create something that not only looks good but also tastes good,” he says. “Previous attempts at vegan fish substitutes had one or the other, but this is the first product we have tasted that does both.” Vegan tuna and salmon at Whole Foods To make realistic vegan tuna and salmon, Kikka uses a proprietary blend of red algae and konjac. Often referred to as “konnyaku,” konjac is a root vegetable that has been popular as a noodle base in Japanese cuisine for centuries. Now, its pliable texture is being explored in other applications, including as a plant-based alternative to fish. Kikka’s plant-based sushi was developed by the company’s vendor in Japan together with Kikka founder Tonny Soesanto, who holds a master’s degree in chemical engineering from acclaimed university California Institute of Technology (CalTech). Kikka Sushi Informed both by Japanese culinary traditions and a deep technical knowledge of plant chemistry and engineering, this unique collaborative effort, Kimura says, is what differentiates Kikka’s plant-based fish from others. “I think the difference is clear when you see and taste the product,” Kimura says. “The texture and ‘mouthfeel’ are on point, and the product tastes good.” Plant-based sushi for all Kikka expanded beyond its vegetable-centric sushi options with plant-based tuna and salmon alternatives to attract a broader range of consumers who abstain from fish for myriad reasons. While some avoid eating marine life for ethical reasons, ocean pollution—in the form of plastics and chemicals—has led many to avoid consuming fish, as well. One study published last year found a link between fish consumption and an increased risk of skin cancer, due likely to exposure to mercury. Due to its high levels of mercury, the United States Food and Drug Administration (FDA) recommends that people who are pregnant avoid certain fish to reduce chances of birth defects—creating another consumer base fish-free alternatives. Kikka Sushi “One other demographic we also encounter is expecting mothers who miss fish and sushi, and we are so glad we now have a product that they can consume,” Kimura says. Kikka’s new plant-based sushi is just the beginning for the brand’s exploration of fish-free innovations. Kikka also just launched plant-based gyoza and is working on other vegan seafood items such as hot bowls and poke. Kikka also transitioned to vegan sugar to ensure that all of its white rice products are free from bone char. Vegan seafood makes waves In addition to Kikka, a number of companies have developed realistic alternatives to sushi-grade fish, particularly bluefin tuna as numbers of the apex predator have sharply declined in the last decades due to overfishing. Current Foods is another company in the plant-based space making sushi-grade fish. Made from algae, koji, radish, bamboo, and potato, the company’s vegan tuna is so realistic that it put the startup on TIME’s 100 Best Inventions of 2021 list. GTFO It’s Vegan In 2021, vegan e-commerce platform GTFO It’s Vegan launched its own line of konjac-based vegan tuna, salmon, sailfish, and calamari which can be used for cold preparations of dishes that feature traditional sashimi. Over in Chicago, Aqua Cultured Foods is doing something a little different. The startup uses the power of microbial fermentation to develop vegan whole-cut fish products from mycoprotein. Earlier this month, the startup began the buildout of its new facility which will allow it to scale production of its ultra-realistic calamari, shrimp, scallops, and filets of tuna and whitefish. “This move is the final step on the road to commercialization of our alt-seafood, and it’s what we and our supporters have been waiting for,” Anne Palermo, CEO of Aqua Cultured Foods CEO, said in a statement. The startup plans to introduce its first products to market in the second quarter of 2023.","filter_flag":1}
{"title":"The ASUS product lineup at CES 2023 presses toward a more sustainable, incredible future - Edge Up - ASUS Edge Up","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vZWRnZXVwLmFzdXMuY29tLzIwMjMvdGhlLWFzdXMtcHJvZHVjdC1saW5ldXAtYXQtY2VzLTIwMjMtcHJlc3Nlcy10b3dhcmQtYS1tb3JlLXN1c3RhaW5hYmxlLWluY3JlZGlibGUtZnV0dXJlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vZWRnZXVwLmFzdXMuY29tLzIwMjMvdGhlLWFzdXMtcHJvZHVjdC1saW5ldXAtYXQtY2VzLTIwMjMtcHJlc3Nlcy10b3dhcmQtYS1tb3JlLXN1c3RhaW5hYmxlLWluY3JlZGlibGUtZnV0dXJlL9IBAA?oc=5","id":"CBMidWh0dHBzOi8vZWRnZXVwLmFzdXMuY29tLzIwMjMvdGhlLWFzdXMtcHJvZHVjdC1saW5ldXAtYXQtY2VzLTIwMjMtcHJlc3Nlcy10b3dhcmQtYS1tb3JlLXN1c3RhaW5hYmxlLWluY3JlZGlibGUtZnV0dXJlL9IBAA","guidislink":false,"published":"Wed, 04 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=4, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=4, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vZWRnZXVwLmFzdXMuY29tLzIwMjMvdGhlLWFzdXMtcHJvZHVjdC1saW5ldXAtYXQtY2VzLTIwMjMtcHJlc3Nlcy10b3dhcmQtYS1tb3JlLXN1c3RhaW5hYmxlLWluY3JlZGlibGUtZnV0dXJlL9IBAA?oc=5\" target=\"_blank\">The ASUS product lineup at CES 2023 presses toward a more sustainable, incredible future - Edge Up<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ASUS Edge Up<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The ASUS product lineup at CES 2023 presses toward a more sustainable, incredible future - Edge Up - ASUS Edge Up","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vZWRnZXVwLmFzdXMuY29tLzIwMjMvdGhlLWFzdXMtcHJvZHVjdC1saW5ldXAtYXQtY2VzLTIwMjMtcHJlc3Nlcy10b3dhcmQtYS1tb3JlLXN1c3RhaW5hYmxlLWluY3JlZGlibGUtZnV0dXJlL9IBAA?oc=5\" target=\"_blank\">The ASUS product lineup at CES 2023 presses toward a more sustainable, incredible future - Edge Up<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ASUS Edge Up<\/font>","source.href":"https:\/\/edgeup.asus.com","source.title":"ASUS Edge Up","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"When you purchase a new laptop, smartphone, or monitor, or when you buy a new component for your DIY PC, you know that there’s a story behind that piece of hardware. It’s a story that’s larger than the performance it provides, the conveniences it offers, and the experiences it creates. It’s a story that affects everyone around you, in ways large and small. And it’s a story that will shape what life is like for generations to come. We’re talking about the story of your hardware’s environmental impact. Was it constructed from responsibly sourced materials? Was it manufactured with sustainable practices? Was it shipped using environmentally friendly packaging? Does it operate efficiently? Will it provide value for a reasonable product lifespan — and then get reused in a new context down the line? And is it constructed for effective recycling when it reaches the end of its useful lifecycle? At ASUS, we know that we’re directly responsible for many of the chapters in each product’s story. Some chapters are controlled by our industry partners, and we’re responsible for using our influence to elevate their business practices. Other chapters are written by you, our customers. We believe that you, too, share our passion for making a positive impact on the world around us, and we work to empower you to push forward with us toward a more sustainable future. Through our bold ideas and innovative engineering, we’ve already revolutionized our corporate practices and culture to help ensure that we pass on a healthier planet to upcoming generations. But there’s so much more that we can do. For this year’s Consumer Electronics Show (CES) exhibition, we’re showcasing our latest efforts to sustain an incredible future. Through new product designs, new manufacturing techniques, and new partnerships with leading global environmental organizations, we’re creating shared value for everyone. A proven track record Our efforts to make sustainability a core value of our company began many years ago. In 2016 we made our headquarters in Taiwan the first in the consumer IT industry to achieve zero landfill waste. We believe that management is based on visible measurement, so in 2017 we became the first consumer technology company in Asia to produce a Social Return on Investment (SROI) report. In 2019, we became the world’s first technology company to publish an Environemtal Proft and Loss (EP&L) report, and the world’s first company to receive UL Solution’s Environment Circularity Facts Program Validation. This work has created real and positive change for our business, our customers, and our partners. We’ve recycled 40,000+ tons of e-waste just since 2019, and we’ve used 1,500 tons of post-consumer recycled (PCR) plastics in our products since 2017. Our company provides takeback services to 75% of markets globally, helping to ensure sustainable end-of-life practices for a wide range of our customers. Since 2018, 100% of our key minerals have been sourced from qualified smelters. When it comes to carbon emissions, we’ve backed our public commitments with concrete action. We reduced carbon emissions from our operational electricity consumption by 15.8% between 2021 and 2022. Empowering you to make sustainable choices We know that consumers want to make environmentally friendly choices as they purchase new technology. But we also know that it’s not always easy for consumers to get the information they need to make responsible purchasing decisions. That’s why we work closely with global third-party organizations to certify our products for their environmental impact, and then provide labels for our products that give you the information that you need at a glance. An important certification that you’ll see on many of our products in 2023 comes from the Electronic Product Environmental Assessment Tool (EPEAT). This is the leading global Type-1 ecolabel covering products and services from the technology sector. Any product with an EPEAT verification has been assessed for its material selection, product longevity, packaging, and end-of-life management, among many other factors. An EPEAT Bronze product meets all 25 baseline criteria laid out by the Global Electronics Council, and you can trust that its entire story from materials sourcing to recycling reflects our shared interest in protecting the environment. EPEAT Silver and EPEAT Gold products go above and beyond by meeting additional criteria for environmental stewardship. EPEAT labels empower you to easily measure and compare the environmental impact of different products as you make a purchasing decision. Packaging matters, too. We’ve led the way in using recyclable packaging materials to protect our products on their journey from our manufacturing facilities to your home. Unfortunately, not all providers of forest products share our commitment to sustainable practices. That’s why we’re proud to partner with the Forest Stewardship Council (FSC). This non-profit organization provides a proven sustainable forest management solution. When a product is FSC Certified, you can trust that its forest-based materials were sourced from responsibly managed forests.** Finally, we’re proud of our many devices that have earned an Energy Star© 8.0 badge. In order to display this certification, a product must meet the strict energy efficiency criteria laid out for its category by the U.S. Environmental Protection Agency or the U.S. Department of Energy. Energy Star products deliver the same experience you’d expect from standard models, but with less energy. That means you get to enjoy lower electricity bills and help protect the environment without compromising on quality or performance. Leading the way at CES 2023 If you browse the full lineup of new products that we’ve just announced at CES 2023, you’ll find many examples of our relentless quest toward sustainability. Consider our new Zenbook 14X OLED laptop, for instance. This premium notebook gives you exceptional performance with its 13th Gen Intel Core H-series CPU, optional NVIDIA GeForce RTX 3050 GPU, and a complete set of I\/O ports — all inside a light, travels-anywhere design. To improve the sustainability of our laptop manufacturing process, we’re debuting a new eco-friendly technology on a key element of this notebook: its finish. For the 2023 Zenbook 14X OLED, we’re introducing a new Plasma Ceramization finishing process that reduces the laptop’s total environmental impact. Through plasma electrolytic oxidation, we create a ceramic-like coating with a premium feel and an 8H* hardness that’s resistant to fading, wear, and fingerprints. This eco-friendly process is halogen free and generates lower toxic emissions than other finishing processes, making the product more durable with less environmental impact. The Zenbook 14X OLED is just one example of how we’re relentlessly optimizing our processes for sustainability. Over 90% of our 2023 consumer laptop lineup is eco-verified. We use as much post-consumer recycled plastics in our laptops as we can without compromising the durability and integrity of the product. Nearly fifty of our 2023 Studiobook, Zenbook, and Vivobook laptops will launch as EPEAT Silver products. Our enterprise customers will also be able to share the value of our sustainability efforts. Our flagship ExpertBook B9450 business laptop leads our lineup in performance and portability, and it’s also an EPEAT Gold product. We designed the ExpertBook B9 OLED (B9403), coming in 2023, with a priority on sustainability. We streamlined its manufacturing process to decrease waste by 29% and production time by up to 75%,* and we eliminated the use of halogen flame retardants in the process. Another option in our commercial laptop series, the ExpertBook B9 (B9400CBA), runs so efficiently that it exceeds the Energy Star standard by a full 67%. Over the lifespan of this device, it’ll provide energy savings equivalent to what you’d need in order to charge 8,267 smartphones. Due to its modular design, 90% of its materials are easy to recycle and reuse in waste treatment plans. All told, our commitment to sustainability throughout this laptop’s full lifecycle from manufacturing to recycling makes it our first carbon-neutral certified commercial laptop. On top of our efforts to offset residual emissions by using nature-based carbon credits, the ExpertBook B9 OLED and ExpertBook B9 move us one step forward on our net zero roadmap. You’ll also see our commitment to sustainability reflected in our notebook packaging in 2023. We make extensive use of recycled paper in our packaging — as much as 90% of the packaging of certain products is made from recycled pulp. We started using paper materials certified by FSC in our packaging in recent years, and we’re committed to using even more FSC-certified materials in the future, all the while significantly reducing the use of plastic. What’s more, we also design our packaging to be useful even after you’ve unboxed your new laptop. Printed directions make it easy for you to transform a section of the packaging into a convenient laptop stand. At ASUS, we’ve long used our position in the tech industry to lead the way toward a sustainable future, and that extends to our complete portfolio of displays. The ProArt Display PA248CRV, PA279CRV, and PA329CRV, announced at CES 2023, showcase our latest efforts on this important front. Each model is constructed of 85% post-consumer recycled material, and they ship in recycled pulp packaging. We plan for these upcoming models to bear an elite set of sustainability labels in 2023. We’re targeting an Energy Star certification for their efficient operation, we’re targeting the requirements of a TCO Certified label, and we’re working to earn an EPEAT Gold badge for these models to demonstrate that they meet the United States Enivronmental Protection Agency’s highest standards for crucial environmental performance criteria. The new ZenScreen MB249C portable monitor also showcases a wide range of our sustainability efforts. This compact and thin 23.8-inch monitor travels easily to give you the multitasking-boosting power of a second display wherever you need it. Through an exclusive insert molding process, we were able to make it supremely thin and light—it’s a mere 17.7mm thick—cutting down on its materials bill. It also earned an Energy Star ES8.0 badge due to its energy-efficient design. Our efforts to create a sustainable future also extend to our data center products. Across the world, facilities aggressively pursue strategies to reduce their power consumption and increase their reliance on renewable energy sources. It’s not hard to see why: improving efficiency leads to lower operating costs and improved sustainability, both primary motivating factors for today’s decision makers. For our latest AMD EPYC 9004 series servers, we’re helping data centers do even more to make their operations more efficient. With better cooling for storage drives, direct-to-chip liquid cooling solutions, and improved thermal dissipation for CPUs and GPUs with a new independent airflow tunnel design, we’re helping data centers reduce their total energy consumption. Much more to come On our incredible journey toward sustainability, we continually leverage our leadership in data-driven practices and human-centered philosophy. We’ve set ambitious sustainability goals for ourselves that we’re working hard to complete by 2025. Overall, we’ve put ASUS on a path to become a net-zero enterprise focused on creating a circular and responsible future, with shared benefits for every one of us. Four key values drive our innovation and decision making on sustainability. First, we’re committed to real and ongoing climate action. Specifically, we’re working to use 100% renewable energy in our Taiwan-based operation centers by 2030, and in all our global operation centers by 2035. We intend to design each year’s key products with an energy efficiency that’s 30% above the Energy Star Standard. Additionally, we’re working with our key suppliers to achieve a 30% reduction in carbon intensity by 2025. Second, we’re shifting toward a circular economy to extend the lifecycle of our products. This paradigm allows us to target sustainability across every phase of a product’s lifecycle and substantially reduce toxic waste on the planet. We intend to promote sustainable procurement and increase the use of environmentally friendly materials by 100% by 2025, and we have also set the goal to achieve a global recycling rate of 20% for ASUS products. Third, we’re taking immediate and impactful action regarding responsible manufacturing. To build an ecosystem of responsibility, we’ve audited 100% of our high-risk suppliers for labor and human rights practices, protecting the rights of over 390,000 workers. By 2025, we intend to source 100% of our tantalum, tin, tungsten, gold, and cobalt from qualified smelters. Finally, we explore innovations in digital inclusion, cross-sector collaborations, and sustainable business models for shared value creation. While we insist that our efforts toward sustainability will only strengthen our core competitiveness in the technology industry, we also know that our efforts will only be successful if our partners and customers benefit alongside us. We’ve conducted a digital inclusion project to empower digitally underprivileged communities, and we’ve donated over 20,000 computers to 1,800 nonprofit organizations. Additionally, we’ve set up 500 digital learning centers in 39 countries, creating equal opportunities for all. As we develop new technologies, new opportunities, and new talents, we work to benefit our communities for generations to come. Learn more about sustainability at ASUS To learn more about sustainability at ASUS, please visit our Corporate Social Responsibility site. There, you’ll find detailed, transparent reports about our progress, in-depth explorations of the values that drive our decision-making, and the ambitious sustainability goals that we’ve set for our organization. 2023 will be a transformative year for sustainability at ASUS — but it wasn’t the start of our journey, nor will it be the end. The milestones that we’ve been able to reach thus far were built on our heritage of innovation and transparency, and we will only reach the milestones that we’ve set for ourselves in the future if we stay committed and focused in our efforts. The incredible future is in all our hands — together, let’s make it sustainable. *The 8H Pencil Hardness Test exclusively evaluates the coating’s hardness; it does not examine any other qualities. The 8H Hardness Test was conducted by ASUS on October 31st, 2022. **FSCTM N004058","filter_flag":1}
{"title":"Lallemand's probiotic authorized in the EU as a technological additive for all animal species - Aquafeed.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijgFodHRwczovL3d3dy5hcXVhZmVlZC5jb20vcHJvZHVjdHMvc3VwcGxpZXJzLW5ld3MvbGFsbGVtYW5kcy1wcm9iaW90aWMtYXV0aG9yaXplZC1pbi10aGUtZXUtYXMtYS10ZWNobm9sb2dpY2FsLWFkZGl0aXZlLWZvci1hbGwtYW5pbWFsLXNwZWNpZXMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijgFodHRwczovL3d3dy5hcXVhZmVlZC5jb20vcHJvZHVjdHMvc3VwcGxpZXJzLW5ld3MvbGFsbGVtYW5kcy1wcm9iaW90aWMtYXV0aG9yaXplZC1pbi10aGUtZXUtYXMtYS10ZWNobm9sb2dpY2FsLWFkZGl0aXZlLWZvci1hbGwtYW5pbWFsLXNwZWNpZXMv0gEA?oc=5","id":"CBMijgFodHRwczovL3d3dy5hcXVhZmVlZC5jb20vcHJvZHVjdHMvc3VwcGxpZXJzLW5ld3MvbGFsbGVtYW5kcy1wcm9iaW90aWMtYXV0aG9yaXplZC1pbi10aGUtZXUtYXMtYS10ZWNobm9sb2dpY2FsLWFkZGl0aXZlLWZvci1hbGwtYW5pbWFsLXNwZWNpZXMv0gEA","guidislink":false,"published":"Tue, 24 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=24, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=24, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijgFodHRwczovL3d3dy5hcXVhZmVlZC5jb20vcHJvZHVjdHMvc3VwcGxpZXJzLW5ld3MvbGFsbGVtYW5kcy1wcm9iaW90aWMtYXV0aG9yaXplZC1pbi10aGUtZXUtYXMtYS10ZWNobm9sb2dpY2FsLWFkZGl0aXZlLWZvci1hbGwtYW5pbWFsLXNwZWNpZXMv0gEA?oc=5\" target=\"_blank\">Lallemand's probiotic authorized in the EU as a technological additive for all animal species<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Aquafeed.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Lallemand's probiotic authorized in the EU as a technological additive for all animal species - Aquafeed.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijgFodHRwczovL3d3dy5hcXVhZmVlZC5jb20vcHJvZHVjdHMvc3VwcGxpZXJzLW5ld3MvbGFsbGVtYW5kcy1wcm9iaW90aWMtYXV0aG9yaXplZC1pbi10aGUtZXUtYXMtYS10ZWNobm9sb2dpY2FsLWFkZGl0aXZlLWZvci1hbGwtYW5pbWFsLXNwZWNpZXMv0gEA?oc=5\" target=\"_blank\">Lallemand's probiotic authorized in the EU as a technological additive for all animal species<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Aquafeed.com<\/font>","source.href":"https:\/\/www.aquafeed.com","source.title":"Aquafeed.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Bactocell is the first lactic acid bacteria to receive authorization related to the hygiene of liquid feed. Lallemand Animal Nutrition announced its unique lactic acid bacteria strain Pediococcus acidilactici CNCM I-4622 (BACTOCELL) has been authorized in the European Union as a technological feed additive in the functional group of acidity regulators and hygiene condition enhancers. The authorization is for use in all animal species (Regulation (EU) 2023\/53). BACTOCELL was already recognized by the European Food Safety Authority (EFSA) for its safety and potential to reduce pH and limit the growth of coliform bacteria in liquid feeds. The authorization covers the application of the lactic bacteria in mash compound feeds and\/or solid feed materials used for the preparation of liquid feeds at a minimum inclusion level of 1x109 (colony-forming units) CFU\/kg feed. This is the first","filter_flag":1}
{"title":"IPPE 2023 launch: Phileo Lesaffre targets poultry production with yeast probiotic - FeedNavigator.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5mZWVkbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDEvMjQvSVBQRS0yMDIzLWxhdW5jaC1QaGlsZW8tTGVzYWZmcmUtdGFyZ2V0cy1wb3VsdHJ5LXByb2R1Y3Rpb24td2l0aC15ZWFzdC1wcm9iaW90aWPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5mZWVkbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDEvMjQvSVBQRS0yMDIzLWxhdW5jaC1QaGlsZW8tTGVzYWZmcmUtdGFyZ2V0cy1wb3VsdHJ5LXByb2R1Y3Rpb24td2l0aC15ZWFzdC1wcm9iaW90aWPSAQA?oc=5","id":"CBMigQFodHRwczovL3d3dy5mZWVkbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDEvMjQvSVBQRS0yMDIzLWxhdW5jaC1QaGlsZW8tTGVzYWZmcmUtdGFyZ2V0cy1wb3VsdHJ5LXByb2R1Y3Rpb24td2l0aC15ZWFzdC1wcm9iaW90aWPSAQA","guidislink":false,"published":"Tue, 24 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=24, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=24, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5mZWVkbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDEvMjQvSVBQRS0yMDIzLWxhdW5jaC1QaGlsZW8tTGVzYWZmcmUtdGFyZ2V0cy1wb3VsdHJ5LXByb2R1Y3Rpb24td2l0aC15ZWFzdC1wcm9iaW90aWPSAQA?oc=5\" target=\"_blank\">IPPE 2023 launch: Phileo Lesaffre targets poultry production with yeast probiotic<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FeedNavigator.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"IPPE 2023 launch: Phileo Lesaffre targets poultry production with yeast probiotic - FeedNavigator.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5mZWVkbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDEvMjQvSVBQRS0yMDIzLWxhdW5jaC1QaGlsZW8tTGVzYWZmcmUtdGFyZ2V0cy1wb3VsdHJ5LXByb2R1Y3Rpb24td2l0aC15ZWFzdC1wcm9iaW90aWPSAQA?oc=5\" target=\"_blank\">IPPE 2023 launch: Phileo Lesaffre targets poultry production with yeast probiotic<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FeedNavigator.com<\/font>","source.href":"https:\/\/www.feednavigator.com","source.title":"FeedNavigator.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"The developer said the form of the product enables it to deliver intrinsic resistance in pelleting feed to combined temperature, friction, and moisture without the need for foreign material coating. Poultry trials in various global locations have shown the product delivers in terms of feed efficiency and production performance in birds, said the company. “A wide range of benefits, confirmed by peer-reviewed poultry trials, include improved gut microbiota diversity, gut function and digestibility; improved feed use efficiency, reduced FCR, higher body weights, and enhanced survival rates.”​ Trial data ​ A 2021 peer-reviewed study​​, conducted by He et al, showed the probiotic had positive effects on gut morphology in poultry with a significant increase in villus height observed at day 24. Actisaf Sc 47 HR+ was also shown to help birds achieve significantly improved villi height vs crypt depth ratio, compared to birds in both a control group and an antibiotic treatment group, said the firm. A US study, run by Texas A&M university (TAMU), and carried out last year also evaluated the probiotic product. Birds were vaccinated at one day old with live coccidiosis vaccine, at a double dose, they were fed a corn-soy diet with 5% DDGs throughout the study and were raised on used litter. The birds in two Actisaf Sc 47 HR+ groups (representing different feeding rates) ​achieved significantly better FCR, compared to birds in both a control group and an antibiotic group, reported Phileo Lesaffre. The company also reported results from a field trial carried out on a broiler farm in Eastern Europe in 2022. “Broilers were floor-raised for 39 days in two houses. In the first house, the birds were fed a basal feed without yeast probiotic supplementation. In the second house, birds were fed a basal feed supplemented with 400 g\/T of Actisaf Sc 47 HR+. At day 39, broilers in the Actisaf Sc 47 HR+ group achieved better production performance across all parameters (body weight, survival rates, feed efficiency, etc.). The trial also yielded in an 8:1 return on investment (ROI) for the broiler farm.”​","filter_flag":1}
{"title":"Serenity Kids Reinvents Smoothies with the Launch of the First Ever Low Sugar, Dairy-Free Smoothies with Grass Fed ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMivwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NlcmVuaXR5LWtpZHMtcmVpbnZlbnRzLXNtb290aGllcy13aXRoLXRoZS1sYXVuY2gtb2YtdGhlLWZpcnN0LWV2ZXItbG93LXN1Z2FyLWRhaXJ5LWZyZWUtc21vb3RoaWVzLXdpdGgtZ3Jhc3MtZmVkLWNvbGxhZ2VuLWZvci1jaGlsZHJlbi0zMDE3MzQyMDAuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMivwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NlcmVuaXR5LWtpZHMtcmVpbnZlbnRzLXNtb290aGllcy13aXRoLXRoZS1sYXVuY2gtb2YtdGhlLWZpcnN0LWV2ZXItbG93LXN1Z2FyLWRhaXJ5LWZyZWUtc21vb3RoaWVzLXdpdGgtZ3Jhc3MtZmVkLWNvbGxhZ2VuLWZvci1jaGlsZHJlbi0zMDE3MzQyMDAuaHRtbNIBAA?oc=5","id":"CBMivwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NlcmVuaXR5LWtpZHMtcmVpbnZlbnRzLXNtb290aGllcy13aXRoLXRoZS1sYXVuY2gtb2YtdGhlLWZpcnN0LWV2ZXItbG93LXN1Z2FyLWRhaXJ5LWZyZWUtc21vb3RoaWVzLXdpdGgtZ3Jhc3MtZmVkLWNvbGxhZ2VuLWZvci1jaGlsZHJlbi0zMDE3MzQyMDAuaHRtbNIBAA","guidislink":false,"published":"Tue, 31 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=31, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=31, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMivwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NlcmVuaXR5LWtpZHMtcmVpbnZlbnRzLXNtb290aGllcy13aXRoLXRoZS1sYXVuY2gtb2YtdGhlLWZpcnN0LWV2ZXItbG93LXN1Z2FyLWRhaXJ5LWZyZWUtc21vb3RoaWVzLXdpdGgtZ3Jhc3MtZmVkLWNvbGxhZ2VuLWZvci1jaGlsZHJlbi0zMDE3MzQyMDAuaHRtbNIBAA?oc=5\" target=\"_blank\">Serenity Kids Reinvents Smoothies with the Launch of the First Ever Low Sugar, Dairy-Free Smoothies with Grass Fed ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Serenity Kids Reinvents Smoothies with the Launch of the First Ever Low Sugar, Dairy-Free Smoothies with Grass Fed ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMivwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NlcmVuaXR5LWtpZHMtcmVpbnZlbnRzLXNtb290aGllcy13aXRoLXRoZS1sYXVuY2gtb2YtdGhlLWZpcnN0LWV2ZXItbG93LXN1Z2FyLWRhaXJ5LWZyZWUtc21vb3RoaWVzLXdpdGgtZ3Jhc3MtZmVkLWNvbGxhZ2VuLWZvci1jaGlsZHJlbi0zMDE3MzQyMDAuaHRtbNIBAA?oc=5\" target=\"_blank\">Serenity Kids Reinvents Smoothies with the Launch of the First Ever Low Sugar, Dairy-Free Smoothies with Grass Fed ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"The fastest growing shelf-stable baby and toddler food brand debuts a new range of vegetable-forward, protein-rich, and dairy-free smoothie pouches AUSTIN, Texas, Jan. 31, 2023 \/PRNewswire\/ -- Today, Serenity Kids , the nation's leading shelf-stable baby and toddler food brand, continues to introduce high-quality, nutrient-rich product offerings with four new innovative Dairy-Free Smoothie + Protein pouch varieties. These are the first-ever baby food products on the market to include protein from grass fed collagen. The four new varieties include: Berry Butternut, Pumpkin Spice, Sweet Potato Spice, and Beet & Carrot. Serenity Kids' New Dairy-Free Smoothie + Protein Line \"We pride ourselves at continuing to research, innovate, and further impact the baby and toddler food category for the better - and these new Dairy-Free Smoothies as the first baby food products to ever include grass-fed collagen protein prove just that!\" said Serenity Carr, co-founder and CEO of Serenity Kids. Current kid-centric smoothies on the market are made with dairy which is hard for many to digest and fruit that is naturally high in sugar. Other organic dairy-free options still contain over nine grams of sugar and very few vegetables which tend to be very sweet and can encourage an early preference for sugar in children. Serenity Kids' new shelf-stable Dairy-Free Smoothies reimagine the status quo for the category to offer the first low sugar, vegetable-forward option that boasts nutrient-rich protein from grass-fed collagen to support baby and toddlers' overall health, function, and growth. Serenity Kids introduces organic coconut cream in this range as a healthy dairy-free alternative, plus the pouches are packed with nutrition from organic vegetables, herbs, and spices. Each Dairy-Free Smoothie variety is loaded with protein-rich collagen, four grams or less of total sugar from the natural ingredients, no added sugar, five or more grams of brain boosting fat, and five grams of protein. The Berry Butternut Smoothie also includes antioxidant-rich, low glycemic blueberries. Serenity Kids' Smoothies line is third party tested for over 200 heavy metals, plasticizers, and contaminants by the Clean Label Project. \"Collagen continues to trend as a result of its many health benefits, but babies and toddlers have been left out! We have incorporated this superstar ingredient into our new line of shelf-stable, health-forward, and kid-approved Dairy-Free Smoothie + Protein pouches,\" said Carr. \"Young children may not always get enough protein from their normal diet, so collagen can be an effective supplement during this critical time of growth. Collagen can support the health of bones, digestion, connective tissue, and the cardiovascular system. Our new Smoothies line tastes great - the pouches are creamy with a perfect balance of savory and sweet.\" With this new line launch, Serenity Kids also intends to increase the age-range of pouches. While babies typically begin to age out of purees around 18 months, the Dairy-Free Smoothies can be enjoyed well into childhood or even by adults. Other established household brands that have created kid-centric or adult snack pouches have validated the popularity of spouted pouches well beyond baby, and now Serenity Kids' Smoothies are a low-sugar, protein-packed alternative to those products. Serenity Kids uses only premium ingredients without any antibiotics, added hormones, pesticides, fillers, or major allergens. In keeping with the brand's high standards, all of the Dairy-Free Smoothies are non-GMO and USDA Organic certified, contain no added sugar, and are Certified Gluten-Free. The new Dairy-Free Smoothie line will be available online at www.MySerenityKids.com , Thrive Market, and in Whole Foods nationwide for $3.99 MSRP each. The Berry Butternut Dairy-Free Smoothie variety has been selected by Whole Foods Market to be a part of the retailer's Product Discovery Program which highlights new, exciting, and on-trend products within the stores. About Serenity Kids: Serenity Kids makes premium products of the highest nutritional, ethical, and taste standards. Serenity Kids only uses ingredients without any antibiotics, added hormones, pesticides, fillers, GMOs, or major allergens. The brand has established partnerships with Land to Market and Partnership for a Healthier America. All of Serenity Kids' products are Clean Label Project certified, and the brand is one of the few baby and toddler food companies that has received a Clean Label Project Purity Award, indicating the products are amongst the cleanest in the category in terms of heavy metals, pesticides, and other neurotoxins. Serenity Kids' new Dairy-Free Smoothie, Ethically Sourced Meat, Organic Savory Veggie, and Purees with Bone Broth pouch lines as well as the Grain Free Puffs line and new Toddler Formula are available online at www.MySerenityKids.com , Amazon, and Thrive Market, and in over 12,000 grocery stores nationwide including Harris Teeter, select H-E-B locations, Kroger, Natural Grocers, Meijer, select Albertsons\/Safeway locations, Sprouts, Target, Wegmans, Whole Foods Market, Walmart, and more. Whole Foods Market recently awarded Serenity Kids the Supplier of the Year Environmental Stewardship Award. For more information on the brand, mission, and products, please go to www.MySerenityKids.com , and follow them on Instagram and Facebook . Media Contact: Leah Brown (858) 337-2995 [email protected] SOURCE Serenity Kids","filter_flag":1}
{"title":"Thai Stock Exchange Plans to Develop New Trading Platform within 1Q23 - KAOHOON INTERNATIONAL - KAOHOON INTERNATIONAL","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3Lmthb2hvb25pbnRlcm5hdGlvbmFsLmNvbS9tYXJrZXRzLzUyMTAxNdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3Lmthb2hvb25pbnRlcm5hdGlvbmFsLmNvbS9tYXJrZXRzLzUyMTAxNdIBAA?oc=5","id":"CBMiM2h0dHBzOi8vd3d3Lmthb2hvb25pbnRlcm5hdGlvbmFsLmNvbS9tYXJrZXRzLzUyMTAxNdIBAA","guidislink":false,"published":"Tue, 10 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=10, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3Lmthb2hvb25pbnRlcm5hdGlvbmFsLmNvbS9tYXJrZXRzLzUyMTAxNdIBAA?oc=5\" target=\"_blank\">Thai Stock Exchange Plans to Develop New Trading Platform within 1Q23 - KAOHOON INTERNATIONAL<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">KAOHOON INTERNATIONAL<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Thai Stock Exchange Plans to Develop New Trading Platform within 1Q23 - KAOHOON INTERNATIONAL - KAOHOON INTERNATIONAL","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3Lmthb2hvb25pbnRlcm5hdGlvbmFsLmNvbS9tYXJrZXRzLzUyMTAxNdIBAA?oc=5\" target=\"_blank\">Thai Stock Exchange Plans to Develop New Trading Platform within 1Q23 - KAOHOON INTERNATIONAL<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">KAOHOON INTERNATIONAL<\/font>","source.href":"https:\/\/www.kaohooninternational.com","source.title":"KAOHOON INTERNATIONAL","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"SET unveils 2023-2025 strategic plan, bolstering the Thai capital market with new economy companies and bridging today & tomorrow investments The Stock Exchange of Thailand (SET) unveils a three-year strategic plan (2023-2025) that steers towards mutual growth for businesses, industries, the capital market, society and the country for the greater opportunity for all (Growth for Business, Industry, Society). The plan focuses on developing a central platform, bridging the ecosystems of today’s and tomorrow’s investments, and making fundraising and investment simple for entrepreneurs and investors. SET will also address diverse preferences covering from being the fund-raising destination for businesses of all sizes, enticing companies in the new economy for listing, accommodating the fund-raising via digital tokens, launching small-ticket investment products to exploring to introduce environment-linked products. Aside, SET and its partners will pursue internal and external sustainability for Thailand’s balanced and sustainable growth. SET President Pakorn Peetathawatchai revealed that in the three years (2023-2025), amid the rapid changes in technology, consumer behavior, volatility of capital flows, uncertainties in economic recovery in light of high inflation and geopolitical risks, SET places importance on boosting the Thai capital market’s competitiveness and concurrently promoting sustainability in environmental, social and governance (ESG) aspects, for the benefits to all parties under the vision of “To Make the Capital Market ‘Work’ for Everyone”. This will be achieved through four strategies. Strategy 1: Make fundraising & investment simple Enhance fund-raising opportunity: Making it easier for businesses of every size in tapping funds from the stock market. Particular supports will be provided to new economy companies from the filing stage along with preparations for potential businesses. SMEs and startups are in the focal point for an access to funding, on top of LiVE Academy and LiVE Platform as Thai Digital Assets Exchange (TDX) will be developed as a trading platform for investment and utility tokens, scheduled to be operational in the third quarter of 2023. Enhance investment opportunities: Raising a variety of small-ticket products for small investors, studying environment-linked investment products and trading hour extension for greater convenience, enhancing efficiency in account opening to provide opportunities to access the capital market easier and more convenient while upgrading Settrade platform to be “Capital Market Super App” to efficiently connect investment opportunities in a diverse range of asset classes. Strategy 2: Move industry & ecosystem with standard Developing a new trading platform within the first quarter of 2023 to raise efficiency of investment ecosystem and accommodate the development of new products, strengthening cybersecurity in collaboration with other players in the industry and amending related trading regulations to be in line with the changing market condition and the new trading system. Strategy 3: Match partners for synergy Improving information disclosure via SMART Marketplace with analytical data and functions, materializing thematic and issue-based researches for further capital market development, putting listed companies’ ESG data on ESG Data Platform that will start distributing data in the second quarter of 2023 and devising ESG Ratings to support of launch of ESG-linked products. Strategy 4: Merge ESG with substance Deploying ESG in driving internal operations and collaborative efforts with external partners towards sustainable growth. E (Environmental) dimension: Grooming ESG workforce for the capital market and educational institutions, establishing ESG Champion on environmental stewardship via ESG Academy, and creating Climate Care Platform that includes an environmental management function and linkup with partners. Moreover, SET aims to achieve Net Zero greenhouse gas emissions, with the Cloud-based emission reduction infrastructure and energy efficiency enhancement of the green data center. S (Social) dimension: Promoting financial literacy among the retirees and low-income groups, measuring Thai people’s financial literacy for the design of right contents and communications channels, enhancing the capabilities of entrepreneurs and particularly family businesses via LiVE Platform, advocating social enterprises (SEs), promoting entrepreneurship in collaboration with universities and vocational institutions, and preparing SET human resources as well as improving their skillsets continuously to drive the capital market forward. G (Governance) dimension: Accelerating the amendments on supervisory and trading regulations to be appropriate and fit well with the current situation, devising efficient supervisory tools for new products and cooperating with government sector and regulatory bodies as well as other organizations on long-term capital market development. Internally, SET is prepared to strengthen organizational risk management with the deployment of technology and analytical data in constantly improving work processes. SET expects these four strategies to help create more opportunities to stakeholders in expanding fund-raising and investment opportunities for businesses and investors, upgrade infrastructure that will accommodate the capital market’s growth, and safeguard society and the environment to achieve a balanced and sustainable growth for businesses, the capital market, the economy, society and the country. Significant milestones and achievements in 2022 Opportunities for all IPOs’ offering size amounted to THB 127.84 billion (approx. USD 3.46 billion), the highest in ASEAN and the fourth in Asia. Nine companies were in the new economy, increasing the market’s diversity and attractiveness. SET had the highest liquidity among ASEAN exchanges, the position it has been holding since 2012, with average daily trading value of THB 76.77 billion. TFEX saw average 565,627 contracts traded daily (The second ranking in ASEAN according to an unofficial data as of November 2022). Two DRx products were issued to give investors, particularly small-time ones, a returngenerating opportunity and to promote the diversification of investment overseas: “AAPL80X” with Apple Inc as underlying assets and “TSLA80X” with Tesla Inc as underlying assets. Both companies are listed on Nasdaq, the United States. LiVE Exchange (LiVEx) welcomed three new listings: Advance Web Service pcl (AWS22), Sitron Power pcl (SITRON22) and Storage Asia pcl (ISTORE22). SET launched guidelines on process and operating mechanism improvement for securities trading. The adjustments included known your customers, customer data center development, securities listing, trading regulations, and data check to enhance efficiency for all stakeholders. Development of entrusted infrastructure innovations TDX was granted a business license and its system is ready for operation. At present, TDX joins hands with three ICO portal service providers. FundConnext saw the average 31,400 daily transactions of mutual funds, and an increase of 11 service users (to 78 selling agents and asset management companies, representing 73 percent of the mutual fund industry). FinNet’s payment transactions accounted for 25 percent of the capital market and continuously extended its services comprising Interbank, Intrabank, QR Code and Direct Debit Registration (DDR) to other investment products in the capital market to cover transactions of mutual funds and derivatives. e-Meeting was developed as an end-to-end meeting solution for the new normal. In 2022, 80 listed companies used the service. SMART Marketplace included ESG data and listed companies’ data in its data feed API channel for over 50 companies and continued its service expansion. ESG Data Platform was launched as ESG database, to demonstrate listed companies’ sustainability to investors and the society at large. Sustainability Promotion","filter_flag":1}
{"title":"Flipkart Launches ‘Flipkart Green’ for Customers Looking to Adopt a Sustainable Lifestyle - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2ZsaXBrYXJ0LWxhdW5jaGVzLWZsaXBrYXJ0LWdyZWVuLWN1c3RvbWVycy1sb29raW5nLWFkb3B0LXN1c3RhaW5hYmxlLWxpZmVzdHlsZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2ZsaXBrYXJ0LWxhdW5jaGVzLWZsaXBrYXJ0LWdyZWVuLWN1c3RvbWVycy1sb29raW5nLWFkb3B0LXN1c3RhaW5hYmxlLWxpZmVzdHlsZdIBAA?oc=5","id":"CBMicmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2ZsaXBrYXJ0LWxhdW5jaGVzLWZsaXBrYXJ0LWdyZWVuLWN1c3RvbWVycy1sb29raW5nLWFkb3B0LXN1c3RhaW5hYmxlLWxpZmVzdHlsZdIBAA","guidislink":false,"published":"Thu, 05 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=5, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=5, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2ZsaXBrYXJ0LWxhdW5jaGVzLWZsaXBrYXJ0LWdyZWVuLWN1c3RvbWVycy1sb29raW5nLWFkb3B0LXN1c3RhaW5hYmxlLWxpZmVzdHlsZdIBAA?oc=5\" target=\"_blank\">Flipkart Launches ‘Flipkart Green’ for Customers Looking to Adopt a Sustainable Lifestyle<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Flipkart Launches ‘Flipkart Green’ for Customers Looking to Adopt a Sustainable Lifestyle - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2ZsaXBrYXJ0LWxhdW5jaGVzLWZsaXBrYXJ0LWdyZWVuLWN1c3RvbWVycy1sb29raW5nLWFkb3B0LXN1c3RhaW5hYmxlLWxpZmVzdHlsZdIBAA?oc=5\" target=\"_blank\">Flipkart Launches ‘Flipkart Green’ for Customers Looking to Adopt a Sustainable Lifestyle<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Retail India News: Juicy Chemistry and Mommy Shots by Amrita Unveil 'Scars are Beautiful' In honor of Women’s Day, Juicy Chemistry and Mommy Shots by Amrita join forces for the 'Scars are Beautiful' campaign, shedding light on the beauty of postpartum bodies and stretch marks. The campaign, launched on March 5th, 2024, features 11 mothers proudly displaying their bodies and sharing their motherhood experiences to inspire other women to embrace their bodies and change societal perceptions. Era Vashishta, mother of a 2.5-year-old shares her story “ I was diagnosed with chronic PCOD when I was 28, which got me very scared as to whether or not I would ever get pregnant or have a baby. I never thought of motherhood before this. Because of the PCOD it made me want to be a mom, because I thought maybe I might not happen. After which, I became a mom and everything changed. As soon as I met my baby that’s when I knew this is someone I want to protect for the rest of my life, the love is unconditional. It was so scary and overwhelming, but once you hang on to all these feelings you wouldn’t have it any other way, I’d never not want to be a mom. My scars are my tiger stripes, because I think I draw a lot of power from them. I’m a mom and this body gave birth to a life, which is what makes me bigger, it makes me a tiger.” Megha Asher, the Co-Founder and COO of Juicy Chemistry said, “At Juicy Chemistry, we believe in promoting self-love and body positivity, and we are thrilled to partner with Mommy Shots for this unique campaign. Through this powerful photo series, we hope to inspire and empower women to embrace their bodies, and scars not just physical but emotional ones as well, and celebrate their unique journeys of motherhood. As mothers ourselves, we understand the challenges that come with motherhood and the impact it can have on a woman's body and self-perception. We hope that this campaign will help shift the narrative and encourage women to see their bodies as beautiful and strong, no matter their shape or size. Together, we can create a more inclusive and diverse representation of beauty and promote self-love and acceptance for all women.\" Amrita Samant, Founder and CEO Mommyshots said, “In my world of photography, motherhood, babies and art, creating something meaningful that helps change the world obsessed with perfection was very close to my heart. We want to redefine beauty with every line and every scar that spells resilience strength and a unique journey, we want to go beyond the surface with this campaign. They’re more than blemishes, they’re badges of honor, they are tender and timeliness. I am super proud of the 11 women who came forward to normalize what the society has for far too long considered unsightly.” Sonia Chandrakumar, one of the 11 mothers who posed and actively participated in the shoot said, “The journey of motherhood is very different for me, I had a really tough time the first 6 months. I had all kinds of nausea, I could not brush my teeth and I had a lot of body changes that took place. My husband was my greatest support because he constantly reminded me that there’s something beautiful coming out of this and if you want something beautiful in life you need to cope with the changes that take place in your body or yourself. So I kept reminding myself and dealing with the challenges. I’d describe my marks as Caleb’s wonderful art palette that I have around my stomach. I would not want to get rid of my marks, I want to keep it as a memory.” Motherhood scars, resembling intricate battle scars, symbolize the strength and resilience embedded in a woman's journey. Each mark narrates a story of endurance and courage, celebrating the remarkable strength of women. In honoring these scars, we acknowledge the transformative power of motherhood, inspiring women to embrace their bodies and celebrate their unique journeys. #scarsarebeautiful ","filter_flag":1}
