{"title":"When it comes to sustainability and stewardship, tell your own story - TurfNet","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LnR1cmZuZXQuY29tL25ld3MuaHRtbC93aGVuLWl0LWNvbWVzLXRvLXN1c3RhaW5hYmlsaXR5LWFuZC1zdGV3YXJkc2hpcC10ZWxsLXlvdXItb3duLXN0b3J5LXIxOTI0L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LnR1cmZuZXQuY29tL25ld3MuaHRtbC93aGVuLWl0LWNvbWVzLXRvLXN1c3RhaW5hYmlsaXR5LWFuZC1zdGV3YXJkc2hpcC10ZWxsLXlvdXItb3duLXN0b3J5LXIxOTI0L9IBAA?oc=5","id":"CBMibGh0dHBzOi8vd3d3LnR1cmZuZXQuY29tL25ld3MuaHRtbC93aGVuLWl0LWNvbWVzLXRvLXN1c3RhaW5hYmlsaXR5LWFuZC1zdGV3YXJkc2hpcC10ZWxsLXlvdXItb3duLXN0b3J5LXIxOTI0L9IBAA","guidislink":false,"published":"Fri, 01 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=1, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=335, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LnR1cmZuZXQuY29tL25ld3MuaHRtbC93aGVuLWl0LWNvbWVzLXRvLXN1c3RhaW5hYmlsaXR5LWFuZC1zdGV3YXJkc2hpcC10ZWxsLXlvdXItb3duLXN0b3J5LXIxOTI0L9IBAA?oc=5\" target=\"_blank\">When it comes to sustainability and stewardship, tell your own story<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TurfNet<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"When it comes to sustainability and stewardship, tell your own story - TurfNet","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LnR1cmZuZXQuY29tL25ld3MuaHRtbC93aGVuLWl0LWNvbWVzLXRvLXN1c3RhaW5hYmlsaXR5LWFuZC1zdGV3YXJkc2hpcC10ZWxsLXlvdXItb3duLXN0b3J5LXIxOTI0L9IBAA?oc=5\" target=\"_blank\">When it comes to sustainability and stewardship, tell your own story<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TurfNet<\/font>","source.href":"https:\/\/www.turfnet.com","source.title":"TurfNet","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"An irrigation audit under way at the Bear Trace at Harrison Bay in Harrison, Tennessee. Photo by Paul Carter There are countless stories that are a mouse click away that slam golf and everything it is about, from how they allegedly waste water to poisoning the soil with pesticides and fertilizers to handling animals that root in the soil. The reality is few if any of those stories perpetrated by mainstream media are based in fact, and superintendents are far ahead of the curve when it comes to environmental stewardship. To that end, when it comes to communicating the sustainability efforts of a golf, the best choice to convey the message is in the mirror. \"For me, it's vitally important to show the world and our community that we are stewards of the land,\" said Paul Carter, CGCS at The Bear Trace at Harrison Bay in Harrison, Tennessee (at right). \"We sit on 660 acres and we maintain 125 of that. Three-quarters of the property is the residence for the wildlife here. It's their home, we just come out here to play. \"We have to be conscious of what we do on the property and the only way to let people know what we're doing is to tell our story.\" Stewardship is something Carter wears on his sleeve at Harrison Bay. The property has been certified in the Audubon Cooperative Sanctuary Program for Golf since 2008, and the course became known around the globe 12 years ago when a video camera perched atop a tree showed the parenting skills of bald eagles to viewers around the world. Since then, visitors, many of them non-golfers, descend on Harrison Bay each winter to get a close-up view of the eagles in their natural habitat as well as the golf operation at work. The eagle cam will return next year after taking a year off to update the set up with new equipment. \"We have the Friends of Harrison Bay State Park who monitor our bluebird boxes, and every Tuesday after the eagles hatch we open the 11th hole for people to photograph and view the eagles,\" Carter said. \"We do that for about three months, those are people who never play golf. They get to see us maintaining the golf course, and we stop and talk to them because we're spokesmen for the golf course. We try our best to put that out there by inviting the community on the golf course and see what we're doing. \"Being in front of people and telling our story is vitally important.\" In Greenwich, Connecticut, Jim Pavonetti, CGCS, is a mouthpiece for Fairview Country Club as well as a handful of other private clubs in the town. Earlier this year, Pavonetti was named a winner of the GCSAA Environmental Leaders in Golf Award at Fairview, which has been a certified Audubon property for 13 years. This year was the ninth time Pavonetti has been an ELGA winner since 2006. He submitted his work at Fairview for a sustainability award given by the Greenwich Sustainability. Fairview Country Club in Greenwich, Connecticut. Photo by Jim Pavonetti Although he did not win the award, Pavonetti did not walk away empty handed. \"I didn't get it, but I got invited to be on the committee,\" Pavonetti said. \"Now, I get to represent golf and the interests of eight private clubs in one town.\" The committee includes a diverse cross section of Greenwich residents, including engineers, local leaders and concerned citizens. \"It's nice to have a voice,\" Pavonetti (at right) said. \"And if they're going to pass an ordinance that would affect golf, I can try to change that or at least talk to them about it.\" Pavonetti sees his place on the committee as an avenue to communicate what he and other superintendents in Connecticut do for the environment. \"This is me getting out of my comfort zone,\" he said. \"This is the opposite of me, but I'm doing it, and when I speak, everyone stops talking and they listen to every word.\" Indeed, others on the committee recognize Pavonetti's expertise. A woman on the committee who is committed to keeping natural grass fields throughout the town comes to him for advice as a turfgrass expert. Among Pavonetti's goals while on the committee is to promote smart water use among non-golf constituencies. \"My focus is protecting water quality and water conservation,\" he said. \"You can drive through my town or your town and see sprinklers running in every office park when it's raining. Golf courses aren't doing that. It's residents of the town are doing that.\" Pavonetti says not to discount the importance of government outreach efforts. \"Some of the most important things in my New York and Connecticut days were to go lobby and sit with legislators, explain some of the bills that were coming up and how they were going to affect golf, and how those bills may or may not be based in science. Legislators are pressured by the public, or the media. If they approve a new pesticide, there are those who will turn it around with no education even though new products are 10 times safer than the old ones that are less desirable. \"Politicians promise voters, especially on Long Island, that they won't allow any more pesticides. That sounds great to a homeowner, but those decisions are not educated decisions.\" That's why, as Harrison Bay's Carter says, it's best to look within to communicate what you do. \"Nobody tells your story better than you,\" Carter said. \"So, don't let anyone else tell it for you.\"","filter_flag":1}
{"title":"Venator Awarded Prestigious Gold Medal from EcoVadis for Sustainability Performance - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3ZlbmF0b3ItYXdhcmRlZC1wcmVzdGlnaW91cy1nb2xkLW1lZGFsLWZyb20tZWNvdmFkaXMtZm9yLXN1c3RhaW5hYmlsaXR5LXBlcmZvcm1hbmNlLTMwMjAyMTY1Mi5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3ZlbmF0b3ItYXdhcmRlZC1wcmVzdGlnaW91cy1nb2xkLW1lZGFsLWZyb20tZWNvdmFkaXMtZm9yLXN1c3RhaW5hYmlsaXR5LXBlcmZvcm1hbmNlLTMwMjAyMTY1Mi5odG1s0gEA?oc=5","id":"CBMiiwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3ZlbmF0b3ItYXdhcmRlZC1wcmVzdGlnaW91cy1nb2xkLW1lZGFsLWZyb20tZWNvdmFkaXMtZm9yLXN1c3RhaW5hYmlsaXR5LXBlcmZvcm1hbmNlLTMwMjAyMTY1Mi5odG1s0gEA","guidislink":false,"published":"Fri, 22 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=356, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3ZlbmF0b3ItYXdhcmRlZC1wcmVzdGlnaW91cy1nb2xkLW1lZGFsLWZyb20tZWNvdmFkaXMtZm9yLXN1c3RhaW5hYmlsaXR5LXBlcmZvcm1hbmNlLTMwMjAyMTY1Mi5odG1s0gEA?oc=5\" target=\"_blank\">Venator Awarded Prestigious Gold Medal from EcoVadis for Sustainability Performance<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Venator Awarded Prestigious Gold Medal from EcoVadis for Sustainability Performance - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3ZlbmF0b3ItYXdhcmRlZC1wcmVzdGlnaW91cy1nb2xkLW1lZGFsLWZyb20tZWNvdmFkaXMtZm9yLXN1c3RhaW5hYmlsaXR5LXBlcmZvcm1hbmNlLTMwMjAyMTY1Mi5odG1s0gEA?oc=5\" target=\"_blank\">Venator Awarded Prestigious Gold Medal from EcoVadis for Sustainability Performance<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Global chemical manufacturer Venator earns coveted gold recognition, marking a significant advancement from previous year. WYNYARD, UK, Dec. 22, 2023 \/PRNewswire\/ -- Venator Materials PLC (\"Venator\" or the \"Company\"), announced today that it has achieved a Gold Medal from EcoVadis, the world's most trusted provider of business sustainability ratings. This recognition marks a significant improvement from the preceding year's Silver Medal accolade, showcasing Venator's commitment to sustainability and environmental stewardship. EcoVadis Gold Medal Rob Portsmouth, Senior Vice President Sustainability and EHS, Venator EcoVadis is the global standard for business sustainability ratings. The EcoVadis assessment evaluates 21 sustainability criteria across four core themes: Environment, Labor & Human Rights, Ethics and Sustainable Procurement. More than 85,000 companies globally have been rated by EcoVadis. Venator's elevation to a Gold Medal reflects the company's enhanced performance in these critical areas, positioning it among the top 4% of companies rated globally. Rob Portsmouth, Senior Vice President Sustainability and EHS stated, \"We are immensely proud of this recognition, which underscores Venator's steadfast commitment to sustainability excellence and shows how deeply embedded our commitment to sustainability is in everything we do, from initial product design, right through to our stewardship of energy management on our sites. The Gold Medal award is the result of key steps we have taken towards our sustainability targets focussed on people, products, planet and performance, with specific projects in each area to move our business forward. Over the coming months, we will be working hard to further increase our score in the 2024 assessment.\" EcoVadis' business sustainability ratings are based on international sustainability standards such as the Ten Principles of the UN Global Compact, the International Labour Organization (ILO) conventions, the Global Reporting Initiative (GRI) standards and the ISO 26000 standard. The ratings provide an evidenced-based analysis on performance and an actionable roadmap for continuous improvement. The EcoVadis Gold Medal is testament to Venator's efforts and dedication to sustainable practices, exemplifying the company's strategic initiatives and policies aimed at minimizing environmental impact across its entire operation. About Venator Venator is a global manufacturer and marketer of chemical products that comprise a broad range of pigments and additives that bring color and vibrancy to buildings, protect and extend product life, and reduce energy consumption. We market our products globally to a diversified group of industrial customers through two segments: Titanium Dioxide, which consists of our TiO 2 business, and Performance Additives, which consists of our functional additives, color pigments and timber treatment businesses. Based in Wynyard, U.K., Venator employs approximately 2,800 associates and sells its products in more than 106 countries. Social Media: Twitter: www.twitter.com\/VenatorCorp Facebook: www.facebook.com\/venatorcorp LinkedIn: www.linkedin.com\/company\/venator-corp For more information about Venator and its sustainability initiatives, visit www.venatorcorp.com Cautionary Statement Concerning Forward-Looking Statements References in this press release to information should not be construed as a characterization regarding the materiality of such information to our financial results or under U.S. securities laws or regulations. While certain matters discussed in this press release may be significant, any significance should not be read as necessarily rising to the level of materiality used for the purposes of complying with U.S. securities laws and regulations. Certain statements contained in this communication constitute \"forward looking statements\" within the meaning of the U.S. Private Securities Litigation Reform Act of 1995, including statements regarding our environmental goals, commitments, strategies and related business and stakeholder impacts. These forward-looking statements represent Venator's expectations or beliefs concerning future events, and it is possible that the expected results described in this communication will not be achieved or will be materially different than as described. These forward-looking statements are subject to risks, uncertainties and other factors, many of which are outside of Venator's control, that could cause actual results to differ materially from the results discussed in the forward-looking statements. These risks and uncertainties include, without limitation, any failure to meet stated environmental goals and commitments, and our ability to execute our strategies in the time frame expected or at all, global sociodemographic and economic trends, changing government laws and regulations, technological innovations, climate-related conditions and weather events, our ability to gather and verify data regarding environmental impacts, the compliance of various third parties with our policies and procedures, and our expansion into new products and geographic regions. Any forward-looking statement speaks only as of the date on which it is made, and, except as required by law or regulation, Venator does not undertake any obligation to update or revise any forward-looking statement, whether as a result of new information, future events or otherwise. New factors emerge from time to time, and it is not possible for Venator to predict all such factors. When considering these forward-looking statements, you should keep in mind the risk factors and other cautionary statements in Venator's filings with the US Securities and Exchange Commission, including Venator's Annual Reports on Form 20-F and other reports on Form 6-K. Readers should not place undue reliance on the forward-looking statements made in this press release. Moreover, many of the assumptions, standards, metrics, and measurements related to the information in this press release continue to evolve and are based on assumptions believed to be reasonable at the time of preparation, but should not be considered guarantees. Given the inherent uncertainty of the estimates, assumptions, and timelines related to the information in this press release, we may not be able to anticipate whether or the degree to which we will be able to meet our plans, targets, or goals in advance. SOURCE Venator Materials PLC","filter_flag":1}
{"title":"Novozymes, Chr. Hansen unveil name of future combined company - Aquafeed.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9wcm9kdWN0cy9zdXBwbGllcnMtbmV3cy9ub3ZvenltZXMtY2hyLWhhbnNlbi11bnZlaWwtbmFtZS1vZi1mdXR1cmUtY29tYmluZWQtY29tcGFueS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9wcm9kdWN0cy9zdXBwbGllcnMtbmV3cy9ub3ZvenltZXMtY2hyLWhhbnNlbi11bnZlaWwtbmFtZS1vZi1mdXR1cmUtY29tYmluZWQtY29tcGFueS_SAQA?oc=5","id":"CBMibWh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9wcm9kdWN0cy9zdXBwbGllcnMtbmV3cy9ub3ZvenltZXMtY2hyLWhhbnNlbi11bnZlaWwtbmFtZS1vZi1mdXR1cmUtY29tYmluZWQtY29tcGFueS_SAQA","guidislink":false,"published":"Wed, 13 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=347, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9wcm9kdWN0cy9zdXBwbGllcnMtbmV3cy9ub3ZvenltZXMtY2hyLWhhbnNlbi11bnZlaWwtbmFtZS1vZi1mdXR1cmUtY29tYmluZWQtY29tcGFueS_SAQA?oc=5\" target=\"_blank\">Novozymes, Chr. Hansen unveil name of future combined company<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Aquafeed.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Novozymes, Chr. Hansen unveil name of future combined company - Aquafeed.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9wcm9kdWN0cy9zdXBwbGllcnMtbmV3cy9ub3ZvenltZXMtY2hyLWhhbnNlbi11bnZlaWwtbmFtZS1vZi1mdXR1cmUtY29tYmluZWQtY29tcGFueS_SAQA?oc=5\" target=\"_blank\">Novozymes, Chr. Hansen unveil name of future combined company<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Aquafeed.com<\/font>","source.href":"https:\/\/www.aquafeed.com","source.title":"Aquafeed.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"In 2022, Novozymes and Chr. Hansen announced their merger to create a global biosolutions group. The name of the future combined company has now been unveiled, Novonesis. Novonesis means “a new beginning” and derives from the Greek word “genesis”. The name reflects a new era of biosolutions where innovation in biological sciences and technology will offer solutions to solve some of the biggest challenges facing humanity. “Novonesis reflects where we came from, what we can achieve, and what we will become together. We are dedicated to harnessing the transformative potential of biology. Building on our legacy of developing innovative solutions, we stand ready to unlock unprecedented opportunities. In Novonesis, we will unite the brightest minds and the best science and technology in the field to help customers and businesses prosper while enabling them to solve some of the greatest challenges we all face. We are here to start an era of biosolutions. That is why we have chosen to call our new company Novonesis which means ‘A new beginning’,” said Ester Baiget, president and CEO of Novozymes. “We developed the name Novonesis in close collaboration and dialogue between Novozymes and Chr. Hansen. It has been crucial to find a name that can be a home to all our 10,000 employees, but even more importantly the name should represent the future potential of biosolutions. We believe we have found that name in Novonesis. A name that reflects our immense commitment to making biological solutions play an even bigger role in our planet’s future,” said Cees de Jong, chairman of Novozymes. The announcement of the name marks an important milestone towards uniting the two companies. The name \"Novonesis\" is supplemented by a brand identity inspired by the world of microbiology. Progress on closing the combination The merger approval process continues to progress as planned, and the closing is expected to take place in the first quarter of 2024 following regulatory approval. The name Novonesis will be used and gradually implemented once the proposed combination is completed. Until final merger control approvals are received, and the proposed combination completes, Novozymes and Chr. Hansen will operate as a completely separate companies. The combined group will have a global network of more than 23 manufacturing sites and close to 40 R&D and application centers that employ around 10,000 talented and purpose-driven employees.","filter_flag":1}
{"title":"Lezlee Westine Reflects on Her Tenure as President & CEO of Personal Care Products Council - Happi","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmhhcHBpLmNvbS9icmVha2luZy1uZXdzL2xlemxlZS13ZXN0aW5lLXJlZmxlY3RzLW9uLWhlci10ZW51cmUtYXMtcHJlc2lkZW50LWNlby1vZi1wZXJzb25hbC1jYXJlLXByb2R1Y3RzLWNvdW5jaWwv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmhhcHBpLmNvbS9icmVha2luZy1uZXdzL2xlemxlZS13ZXN0aW5lLXJlZmxlY3RzLW9uLWhlci10ZW51cmUtYXMtcHJlc2lkZW50LWNlby1vZi1wZXJzb25hbC1jYXJlLXByb2R1Y3RzLWNvdW5jaWwv0gEA?oc=5","id":"CBMifWh0dHBzOi8vd3d3LmhhcHBpLmNvbS9icmVha2luZy1uZXdzL2xlemxlZS13ZXN0aW5lLXJlZmxlY3RzLW9uLWhlci10ZW51cmUtYXMtcHJlc2lkZW50LWNlby1vZi1wZXJzb25hbC1jYXJlLXByb2R1Y3RzLWNvdW5jaWwv0gEA","guidislink":false,"published":"Wed, 20 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=20, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=354, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmhhcHBpLmNvbS9icmVha2luZy1uZXdzL2xlemxlZS13ZXN0aW5lLXJlZmxlY3RzLW9uLWhlci10ZW51cmUtYXMtcHJlc2lkZW50LWNlby1vZi1wZXJzb25hbC1jYXJlLXByb2R1Y3RzLWNvdW5jaWwv0gEA?oc=5\" target=\"_blank\">Lezlee Westine Reflects on Her Tenure as President & CEO of Personal Care Products Council<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Happi<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Lezlee Westine Reflects on Her Tenure as President & CEO of Personal Care Products Council - Happi","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmhhcHBpLmNvbS9icmVha2luZy1uZXdzL2xlemxlZS13ZXN0aW5lLXJlZmxlY3RzLW9uLWhlci10ZW51cmUtYXMtcHJlc2lkZW50LWNlby1vZi1wZXJzb25hbC1jYXJlLXByb2R1Y3RzLWNvdW5jaWwv0gEA?oc=5\" target=\"_blank\">Lezlee Westine Reflects on Her Tenure as President & CEO of Personal Care Products Council<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Happi<\/font>","source.href":"https:\/\/www.happi.com","source.title":"Happi","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"After 14 years as president and CEO of the Personal Care Products Council, Lezlee Westine is retiring. Tom Myers has been named president and CEO. The move is effective January 1. Lezlee Westine Lezlee Westine Tom Myers Tom Myers Related Content This week, she reflected on PCPC's accomplishments during her tenure.“I am immensely proud of what we have achieved together and grateful for the opportunity to work with a team whose dedication to excellence has driven our industry, our communities and our world to be more beautiful, sustainable and inclusive,” she said.According to Westine, five princlples have shaped her leadership and the Council's accomplishments:• Foster collaboration and break down barriers.• Encourage and trust in your team to deliver results; there’s more than one way to get there.• Focus on results, balancing flexibility with a clear vision of success.• Recruit the brightest minds, nurture their talents and support them through challenges.• Live by the Golden Rule, treating everyone with respect and fairness.“These principles have served as the bedrock of our shared journey at PCPC, which has included significant milestones,” said Westine. “One year ago, we celebrated the landmark enactment of The Modernization of Cosmetics Regulation Act ( MoCRA ) of 2022, a crowning achievement of our collective advocacy that established a new era of cosmetics regulation. This historic legislation is a testament to our ongoing commitment to safety, transparency and innovation.”Regulations aside, Westine said broadening PCPC's approach to include environmental stewardship, social responsibility and economic impact, spurred the exchange of industry best practices and strengthened relationships with key stakeholders. PCPC’s 2021 “ Creating a More Beautiful World ” sustainability report and the complementary Sustainability Handbook guide and showcase these efforts.PCPC's sustainability efforts include advancing the industry’s commitment to diversity, equity and inclusion (DEI).“We’ve made important strides to diversify our staff and membership and to educate our community about the importance of embracing diversity. In 2021, we launched the Madam C.J. Walker Award to recognize individuals in our industry who demonstrate an outstanding commitment to fostering inclusivity and equality,” she explained. “The third award, which honors industry pioneer Madam C.J. Walker who started her hair care business at the turn of the century during a time when women of color had few rights and little opportunity, will be presented at the 2024 Annual Meeting in Coral Gables, FL.”During her tenure, PCPC developed critical partnerships that have extended its reach and influence. United with more than 40 international trade associations, PCPC is part of a powerful and collective voice to address global challenges in the beauty and personal care industry, according to Westine.Myers joined PCPC in 2010. Prior to his appointment, Myers served as PCPC's executive vice president for legal & regulatory affairs and general counsel. Before joining PCPC, Myers worked with the US Chamber of Commerce and in private practice for international law firms.","filter_flag":1}
{"title":"BWH Hotels and Call2Recycle Bring Battery Recycling Practices to the Canadian Hospitality Sector - GlobeNewswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiqAFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8xMi8xMi8yNzk0OTM3LzAvZW4vQldILUhvdGVscy1hbmQtQ2FsbDJSZWN5Y2xlLUJyaW5nLUJhdHRlcnktUmVjeWNsaW5nLVByYWN0aWNlcy10by10aGUtQ2FuYWRpYW4tSG9zcGl0YWxpdHktU2VjdG9yLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiqAFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8xMi8xMi8yNzk0OTM3LzAvZW4vQldILUhvdGVscy1hbmQtQ2FsbDJSZWN5Y2xlLUJyaW5nLUJhdHRlcnktUmVjeWNsaW5nLVByYWN0aWNlcy10by10aGUtQ2FuYWRpYW4tSG9zcGl0YWxpdHktU2VjdG9yLmh0bWzSAQA?oc=5","id":"CBMiqAFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8xMi8xMi8yNzk0OTM3LzAvZW4vQldILUhvdGVscy1hbmQtQ2FsbDJSZWN5Y2xlLUJyaW5nLUJhdHRlcnktUmVjeWNsaW5nLVByYWN0aWNlcy10by10aGUtQ2FuYWRpYW4tSG9zcGl0YWxpdHktU2VjdG9yLmh0bWzSAQA","guidislink":false,"published":"Tue, 12 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=12, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=346, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqAFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8xMi8xMi8yNzk0OTM3LzAvZW4vQldILUhvdGVscy1hbmQtQ2FsbDJSZWN5Y2xlLUJyaW5nLUJhdHRlcnktUmVjeWNsaW5nLVByYWN0aWNlcy10by10aGUtQ2FuYWRpYW4tSG9zcGl0YWxpdHktU2VjdG9yLmh0bWzSAQA?oc=5\" target=\"_blank\">BWH Hotels and Call2Recycle Bring Battery Recycling Practices to the Canadian Hospitality Sector<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"BWH Hotels and Call2Recycle Bring Battery Recycling Practices to the Canadian Hospitality Sector - GlobeNewswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqAFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8xMi8xMi8yNzk0OTM3LzAvZW4vQldILUhvdGVscy1hbmQtQ2FsbDJSZWN5Y2xlLUJyaW5nLUJhdHRlcnktUmVjeWNsaW5nLVByYWN0aWNlcy10by10aGUtQ2FuYWRpYW4tSG9zcGl0YWxpdHktU2VjdG9yLmh0bWzSAQA?oc=5\" target=\"_blank\">BWH Hotels and Call2Recycle Bring Battery Recycling Practices to the Canadian Hospitality Sector<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","source.href":"https:\/\/www.globenewswire.com","source.title":"GlobeNewswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Toronto, ON, Dec. 12, 2023 (GLOBE NEWSWIRE) -- Call2Recycle, Canada’s leading battery collection and recycling program, and BWH Hotels (BWH), a leading global hospitality enterprise, are announcing a collaboration to implement battery recycling across the BWH network. It is the first time a major company in the Canadian hospitality sector has integrated battery recycling on a large scale as part of their sustainability strategy. To date, 47 BWH hotels in eight Canadian provinces and territories have joined the Call2Recycle battery recycling program, with more set to join in 2024. This program will provide BWH with a free and convenient solution to dispose of used batteries from their operations responsibly. Battery-powered devices are omnipresent in the operations of the hospitality industry, including being used in sensors, smoke detectors, door locks, and room devices such as clocks or TV remotes. This initiative is part of BWH’s global “Because We Care” sustainability program. Based on three pillars, Earth, People, Community (EPC), the program is aimed at increasing sustainable practices and reducing the carbon footprint across the hotel network. “We are thrilled to join forces with Call2Recycle to introduce battery recycling across our Canadian portfolio of hotels,” said Michael Morton, Vice President Brand Management and Member Services at BWH Hotels. “This significant step forward is a testament to our ongoing commitment to sustainability and environmental stewardship. Aligned with our global EPC program, this collaboration underscores our dedication to fostering sustainable hotel operations that not only safeguard our environment but contribute to the wellbeing of the communities we serve worldwide.” “We are excited to see BWH leading the way for new sustainability and battery recycling efforts in the hospitality sector,” said Joe Zenobio, President, Call2Recycle Canada. “Hotels are major users of battery-powered devices, and BWH’s recycling commitment will allow us to recycle greater volumes of used batteries and divert them from landfills, making a critical difference to protect the environment.” Environmental and economic benefits of battery recycling Recycling batteries is a collective responsibility and an essential part of Canada’s effort to reduce its carbon footprint by reusing waste materials. Properly disposing of batteries is critical to environmental protection and building sustainable recycling practices across Canada. In addition, batteries that have reached the end of their life can be used to make a variety of new products, supporting a strong circular economy. About Call2Recycle Canada, Inc. Call2Recycle® is Canada’s leading organization for battery collection and recycling, fulfilling product stewardship obligations on behalf of over 400 members, including producers of single-use and rechargeable batteries. It is the provincially-approved consumer battery collection and recycling program for British Columbia, Saskatchewan, Manitoba, Quebec, and Prince Edward Island, and operates as a registered Producer Responsibility Organization (PRO) in Ontario according to the Ontario Batteries Regulation. Call2Recycle accepts household batteries (weighing up to 5 kg) for recycling and eTransport batteries used to power eBikes, eScooters, eSkateboards, Hoverboards and Electric Vehicles (EVs). Since its inception in 1997, Call2Recycle has diverted over 40 million kilograms of batteries from Canadian landfills. This reputation for excellence has enabled Call2Recycle to maintain trusted, long-term relationships with stakeholders and a network of more than 10,000 participating collection locations across Canada, including at leading retailers and municipal facilities. About BWH℠ Hotels BWH Hotels is a leading, global hospitality enterprise comprised of three hotel companies, including WorldHotels™, Best Western® Hotels & Resorts and SureStay® Hotels. The global enterprise boasts approximately 4,300 hotels in over 100 countries and territories worldwide*. With 19 brands across every chain scale segment, from economy to luxury, BWH Hotels suits the needs of developers and guests in every market. *Numbers are approximate, may fluctuate, and include hotels currently in the development pipeline. Media Contact For BWH℠ Hotels: Shelby Bartemes, Senior Vice President The Brandman Agency +1.323.944.0064 BWHHotels@brandmanagency.com Attachment","filter_flag":1}
{"title":"Ineos Inovyn Broadens PVC Product Portfolio with Expansion Initiative - ChemAnalyst","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5jaGVtYW5hbHlzdC5jb20vTmV3c0FuZERlYWxzL05ld3NEZXRhaWxzL2luZW9zLWlub3Z5bi1icm9hZGVucy1wdmMtcHJvZHVjdC1wb3J0Zm9saW8td2l0aC1leHBhbnNpb24taW5pdGlhdGl2ZS0yNDA2M9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5jaGVtYW5hbHlzdC5jb20vTmV3c0FuZERlYWxzL05ld3NEZXRhaWxzL2luZW9zLWlub3Z5bi1icm9hZGVucy1wdmMtcHJvZHVjdC1wb3J0Zm9saW8td2l0aC1leHBhbnNpb24taW5pdGlhdGl2ZS0yNDA2M9IBAA?oc=5","id":"CBMigAFodHRwczovL3d3dy5jaGVtYW5hbHlzdC5jb20vTmV3c0FuZERlYWxzL05ld3NEZXRhaWxzL2luZW9zLWlub3Z5bi1icm9hZGVucy1wdmMtcHJvZHVjdC1wb3J0Zm9saW8td2l0aC1leHBhbnNpb24taW5pdGlhdGl2ZS0yNDA2M9IBAA","guidislink":false,"published":"Thu, 21 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=355, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5jaGVtYW5hbHlzdC5jb20vTmV3c0FuZERlYWxzL05ld3NEZXRhaWxzL2luZW9zLWlub3Z5bi1icm9hZGVucy1wdmMtcHJvZHVjdC1wb3J0Zm9saW8td2l0aC1leHBhbnNpb24taW5pdGlhdGl2ZS0yNDA2M9IBAA?oc=5\" target=\"_blank\">Ineos Inovyn Broadens PVC Product Portfolio with Expansion Initiative<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ChemAnalyst<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Ineos Inovyn Broadens PVC Product Portfolio with Expansion Initiative - ChemAnalyst","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5jaGVtYW5hbHlzdC5jb20vTmV3c0FuZERlYWxzL05ld3NEZXRhaWxzL2luZW9zLWlub3Z5bi1icm9hZGVucy1wdmMtcHJvZHVjdC1wb3J0Zm9saW8td2l0aC1leHBhbnNpb24taW5pdGlhdGl2ZS0yNDA2M9IBAA?oc=5\" target=\"_blank\">Ineos Inovyn Broadens PVC Product Portfolio with Expansion Initiative<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ChemAnalyst<\/font>","source.href":"https:\/\/www.chemanalyst.com","source.title":"ChemAnalyst","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Ineos Inovyn Broadens PVC Product Portfolio with Expansion Initiative Ineos Inovyn, a prominent vinyl producer headquartered in the UK, has recently embarked on a significant expansion of its polyvinyl chloride (PVC) range, introducing new products characterized by substantially reduced carbon footprints and heightened recycled content. This strategic move underlines the company's unwavering commitment to environmental sustainability and aligns with the broader industry shift towards eco-friendly practices. A cornerstone of Ineos Inovyn's ambitious journey towards carbon neutrality is Biovyn, an innovative bio-attributed PVC that made its debut in the market in 2019. Positioned as a pivotal element in the company's sustainability initiatives, Biovyn holds the potential to evolve into a carbon-neutral and net-zero solution. Its versatility is evident in diverse applications across various sectors, ranging from automotive and construction to medical and fashion. In response to the imperative for reducing greenhouse gas (GHG) emissions by 2030, Ineos Inovyn introduces Neovyn, a novel PVC range distinguished by a substantially reduced carbon footprint. According to the company, Neovyn achieves an impressive 37% reduction compared to the European industry average for suspension PVC, translating to a lower carbon footprint of 1.3 kilograms CO2 per kilogram PVC. The production of Neovyn will draw on sustainable initiatives implemented by Ineos Inovyn, including improved access to renewable energy, process electrification, and the production and utilization of renewable hydrogen. Positioned as the new standard for low carbon footprints, Neovyn aims to empower converters to advance their carbon roadmaps by reducing scope 3 emissions and offering products with smaller carbon footprints. Running in parallel with Neovyn, Ineos Inovyn introduces Recovyn, a product line meticulously designed to enhance recycling and circularity while minimizing non-mechanically recycled plastic waste. Comprising 100% recycled carbon feedstock, Recovyn caters to customers seeking to augment their recycled content while meeting stringent technical, quality, and regulatory requirements. The adaptability and versatility of Recovyn, Biovyn, and Neovyn are underscored by Ineos Inovyn, emphasizing their potential as drop-in solutions. These products undergo rigorous certification processes by independent third-party organizations such as the Roundtable on Sustainable Biomaterials (RSB) and the International Sustainability and Carbon Certification Plus (ISCC Plus), providing assurance of their sustainability credentials. Arnaud Valenduc, Business Director at Ineos Inovyn, articulates the company's commitment to maintaining industry leadership by continually introducing innovative products that respond to the urgent need for emission reduction and circularity. This commitment aligns seamlessly with the broader industry trajectory towards a sustainable and net-zero economy, showcasing Ineos Inovyn's proactive role in driving positive change on a global scale. The company's dedication to environmental stewardship and forward-thinking solutions positions it as a trailblazer in the pursuit of a more sustainable and eco-conscious future.","filter_flag":1}
{"title":"Best Agrolife acquires 99% stake in Kashmir Chemicals - Indian Chemical News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vY2hlbWljYWwvYmVzdC1hZ3JvbGlmZS1hY3F1aXJlcy05OS1zdGFrZS1pbi1rYXNobWlyLWNoZW1pY2Fscy0xOTc1OdIBa2h0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vY2hlbWljYWwvbGl0ZS9iZXN0LWFncm9saWZlLWFjcXVpcmVzLTk5LXN0YWtlLWluLWthc2htaXItY2hlbWljYWxzLTE5NzU5?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vY2hlbWljYWwvYmVzdC1hZ3JvbGlmZS1hY3F1aXJlcy05OS1zdGFrZS1pbi1rYXNobWlyLWNoZW1pY2Fscy0xOTc1OdIBa2h0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vY2hlbWljYWwvbGl0ZS9iZXN0LWFncm9saWZlLWFjcXVpcmVzLTk5LXN0YWtlLWluLWthc2htaXItY2hlbWljYWxzLTE5NzU5?oc=5","id":"CBMiZmh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vY2hlbWljYWwvYmVzdC1hZ3JvbGlmZS1hY3F1aXJlcy05OS1zdGFrZS1pbi1rYXNobWlyLWNoZW1pY2Fscy0xOTc1OdIBa2h0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vY2hlbWljYWwvbGl0ZS9iZXN0LWFncm9saWZlLWFjcXVpcmVzLTk5LXN0YWtlLWluLWthc2htaXItY2hlbWljYWxzLTE5NzU5","guidislink":false,"published":"Fri, 01 Dec 2023 12:01:25 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=1, tm_hour=12, tm_min=1, tm_sec=25, tm_wday=4, tm_yday=335, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vY2hlbWljYWwvYmVzdC1hZ3JvbGlmZS1hY3F1aXJlcy05OS1zdGFrZS1pbi1rYXNobWlyLWNoZW1pY2Fscy0xOTc1OdIBa2h0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vY2hlbWljYWwvbGl0ZS9iZXN0LWFncm9saWZlLWFjcXVpcmVzLTk5LXN0YWtlLWluLWthc2htaXItY2hlbWljYWxzLTE5NzU5?oc=5\" target=\"_blank\">Best Agrolife acquires 99% stake in Kashmir Chemicals<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Chemical News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Best Agrolife acquires 99% stake in Kashmir Chemicals - Indian Chemical News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vY2hlbWljYWwvYmVzdC1hZ3JvbGlmZS1hY3F1aXJlcy05OS1zdGFrZS1pbi1rYXNobWlyLWNoZW1pY2Fscy0xOTc1OdIBa2h0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vY2hlbWljYWwvbGl0ZS9iZXN0LWFncm9saWZlLWFjcXVpcmVzLTk5LXN0YWtlLWluLWthc2htaXItY2hlbWljYWxzLTE5NzU5?oc=5\" target=\"_blank\">Best Agrolife acquires 99% stake in Kashmir Chemicals<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Chemical News<\/font>","source.href":"https:\/\/www.indianchemicalnews.com","source.title":"Indian Chemical News","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental stewardship\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Best Agrolife Ltd. (BAL), a prominent player and one of the largest agro-input manufacturers in India, has executed a strategic investment in Kashmir Chemicals and acquired 99% stake in the company. This move is aimed at expanding its manufacturing capacity in response to the growing market demand for branded agrochemical products and formulations. On October 20, 2023, a Reconstitution Deed of Partnership was formalized, retroactively effective from September 16, 2023, and duly registered with the competent authority in Samba. Kashmir Chemicals is situated in Phase 1 of the Industrial Growth Centre in Samba and registered with the District Industries Centre. The facility is equipped with state-of-the-art machinery spread across 16 kanals of leasehold land allocated by J&K State Industrial Development Corporation Ltd. The company specializes in the production of pesticide formulations, including emulsified concentrates, wettable powders, and granules. The former partnership company was equally shared between Shyamanand Sharma and Pardeep Kumar Jain, with an annual turnover of approximately Rs. 100 crores and a healthy profit margin. During their board meeting on September 2, 2023, the board of directors reached a resolution acknowledging the escalating market demand for branded formulations. To address this demand, the company recognized the necessity to augment its manufacturing capacity. In evaluating potential solutions, such as in-house expansion and a greenfield project, the board noted the time constraints, estimating a minimum of 15-18 months and the risk of missing business opportunities. Given the current commitments of the company's existing partners to other business ventures, Kashmir Chemicals extended an invitation to BAL to enter into a partnership to facilitate the seamless operation of the manufacturing unit. Subsequently, the board decided to invest in Kashmir Chemicals by acquiring a 99% stake in the partnership, alongside the participation of the existing partners. This strategic move is expected to significantly contribute to BAL's expansion of formulation manufacturing capacity, resulting in an approximate addition of Rs. 350 crores to its overall returns. BAL has also been granted a 20-year patent for their innovative creation \"Synergistic Granular Herbicidal Composition for Paddy.\" The company intends to introduce this one-shot herbicide in the upcoming Kharif season under the brand name \"Orisulam\". With a strong focus on research and development, BAL is dedicated to sustainable agriculture practices and environmental stewardship. Currently, BAL has 7,000 MTPA and 30,000 MTPA technicals and formulation manufacturing capacity, respectively, through three of its manufacturing plants in Gajraula, Greater Noida, and Jammu & Kashmir. BAL currently has more than 5,200 distributors in India and retains an impressive portfolio of 450+ formulations and more than 115+ technical manufacturing licenses.","filter_flag":1}
