{"title":"Kraft Heinz Releases 2023 Environmental Social Governance Report, Revealing Continued Progress Toward Goals ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiwAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2tyYWZ0LWhlaW56LXJlbGVhc2VzLTIwMjMtZW52aXJvbm1lbnRhbC1zb2NpYWwtZ292ZXJuYW5jZS1yZXBvcnQtcmV2ZWFsaW5nLWNvbnRpbnVlZC1wcm9ncmVzcy10b3dhcmQtZ29hbHMtYWNyb3NzLXRocmVlLXByaW9yaXR5LXBpbGxhcnMtMzAxOTU3NzQzLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiwAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2tyYWZ0LWhlaW56LXJlbGVhc2VzLTIwMjMtZW52aXJvbm1lbnRhbC1zb2NpYWwtZ292ZXJuYW5jZS1yZXBvcnQtcmV2ZWFsaW5nLWNvbnRpbnVlZC1wcm9ncmVzcy10b3dhcmQtZ29hbHMtYWNyb3NzLXRocmVlLXByaW9yaXR5LXBpbGxhcnMtMzAxOTU3NzQzLmh0bWzSAQA?oc=5","id":"CBMiwAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2tyYWZ0LWhlaW56LXJlbGVhc2VzLTIwMjMtZW52aXJvbm1lbnRhbC1zb2NpYWwtZ292ZXJuYW5jZS1yZXBvcnQtcmV2ZWFsaW5nLWNvbnRpbnVlZC1wcm9ncmVzcy10b3dhcmQtZ29hbHMtYWNyb3NzLXRocmVlLXByaW9yaXR5LXBpbGxhcnMtMzAxOTU3NzQzLmh0bWzSAQA","guidislink":false,"published":"Mon, 16 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=289, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiwAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2tyYWZ0LWhlaW56LXJlbGVhc2VzLTIwMjMtZW52aXJvbm1lbnRhbC1zb2NpYWwtZ292ZXJuYW5jZS1yZXBvcnQtcmV2ZWFsaW5nLWNvbnRpbnVlZC1wcm9ncmVzcy10b3dhcmQtZ29hbHMtYWNyb3NzLXRocmVlLXByaW9yaXR5LXBpbGxhcnMtMzAxOTU3NzQzLmh0bWzSAQA?oc=5\" target=\"_blank\">Kraft Heinz Releases 2023 Environmental Social Governance Report, Revealing Continued Progress Toward Goals ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Kraft Heinz Releases 2023 Environmental Social Governance Report, Revealing Continued Progress Toward Goals ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiwAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2tyYWZ0LWhlaW56LXJlbGVhc2VzLTIwMjMtZW52aXJvbm1lbnRhbC1zb2NpYWwtZ292ZXJuYW5jZS1yZXBvcnQtcmV2ZWFsaW5nLWNvbnRpbnVlZC1wcm9ncmVzcy10b3dhcmQtZ29hbHMtYWNyb3NzLXRocmVlLXByaW9yaXR5LXBpbGxhcnMtMzAxOTU3NzQzLmh0bWzSAQA?oc=5\" target=\"_blank\">Kraft Heinz Releases 2023 Environmental Social Governance Report, Revealing Continued Progress Toward Goals ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Stewardship\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Company progresses against its goals related to achieving net-zero greenhouse gas emissions, strengthening diversity, equity, inclusion, and belonging, addressing global hunger, and more Developed innovative packaging solutions that support the Company's net zero ambitions, including the HEINZ ® Tomato Ketchup pilot with Pulpex to create a paper-based, renewable and recyclable bottle made from 100% sustainably sourced wood pulp HEINZ Exceeded 2022 employee representation aspirations, increasing representation of women in global management positions and people of color in the United States by two percentage points each Provided approximately 334 million meals to people in need in 2022, achieving 66% of the Company's goal of providing 1.5 billion meals to those in need by 2025 (from 2019) PITTSBURGH and CHICAGO, Oct. 16, 2023 \/PRNewswire\/ -- Today, The Kraft Heinz Company (Nasdaq: KHC) (the \"Company\" or \"Kraft Heinz\") released its 2023 Environmental Social Governance (\"ESG\") Report, 'Together at the Table,' sharing progress toward its ambitious goals to nourish the communities it serves and the planet through bold innovations and collaboration. The report highlights advancements across the Company's three key pillars – Healthy Living & Community Support, Environmental Stewardship, and Responsible Sourcing. \"Together at the Table Talk\" Experience the full interactive Multichannel News Release here: https:\/\/www.multivu.com\/players\/English\/9200351-kraft-heinz-releases-2023-environmental-social-governance-report\/ \"As we work to lead the future of food, we strive to do so responsibly. And as one of the largest food and beverage companies in the world, we embrace the opportunity that comes with our size and scale to have a profound impact on communities around the world and in the lives of consumers, customers, employees, and partners,\" said Miguel Patricio, Kraft Heinz CEO and Chair of the Board of Directors. \"Together, we are pioneering and advancing solutions that are transforming the products we bring to market to make a lasting, positive impact around us.\" Key Progress Across the Three ESG Pillars Include: Healthy Living & Community Support Kraft Heinz is committed to caring for its people, enhancing the nutrition and health of its products, and creating moments that matter for its people and communities. The Company is addressing these aspirations by developing data-driven diversity, equity, inclusion, and belonging (\"DEI&B\") strategies; strengthening partnerships aligned with hunger relief, nutrition support, and self-sustaining food sources; and making ongoing improvements to the nutrition of its product portfolio in alignment with credible science and public health goals. In 2022, Kraft Heinz: DEI&B Aspirations: Exceeded two employee representation aspirations, increasing representation of women in global management positions (41% vs. 39% in 2021) and people of color in U.S. salaried positions (28% vs. 26% in 2021). Achieved two employee representation aspirations, increasing ethnic minorities in U.K. salaried positions (13% vs. 11% in 2021) and Pretos e Pardos in Brazil salaried positions (32% vs. 30% in 2021). Exceeded two employee representation aspirations, increasing representation of women in global management positions (41% vs. 39% in 2021) and people of color in U.S. salaried positions (28% vs. 26% in 2021). Achieved two employee representation aspirations, increasing ethnic minorities in U.K. salaried positions (13% vs. 11% in 2021) and Pretos e Pardos in salaried positions (32% vs. 30% in 2021). Working to Alleviate Global Hunger: Provided approximately 334 million meals to people in need in 2022, achieving 66% of the Company's goal to provide 1.5 billion meals to people in need by 2025 (from 2019). Provided approximately 334 million meals to people in need in 2022, achieving 66% of the Company's goal to provide 1.5 billion meals to people in need by 2025 (from 2019). Product Health and Nutrition: Reduced approximately 47 million pounds of total sugar in its global portfolio through key renovations including: Capri Sun ® reduced sugar by an average of 40% across its entire original juice drink portfolio in the U.S. by using monk fruit concentrate to maintain the iconic taste kids love. ABC ® reduced sugar by 10% in its SOTO sweet soy sauce. Reduced approximately 47 million pounds of total sugar in its global portfolio through key renovations including: Environmental Stewardship To address ongoing environmental challenges, Kraft Heinz continues to innovate across its operational footprint and value chain to unlock energy, carbon, water, packaging, and waste solutions. When it comes to sustainable packaging, the Company is identifying relevant solutions and working with industry groups to collectively improve recycling infrastructure and explore alternative materials. In 2022, Kraft Heinz: Renewable Electricity: Contracted renewable electricity in Europe and the U.S. that is expected to equate to approximately 46% of the Company's current manufacturing facility demand over the next two years. Contracted renewable electricity in and the U.S. that is expected to equate to approximately 46% of the Company's current manufacturing facility demand over the next two years. Designing Better Packaging: HEINZ collaborated with Pulpex to develop a paper-based, renewable, and recyclable bottle made from 100% sustainably sourced wood pulp. Additionally, the brand created a new sachet design in Europe that is made with the equivalent of 35% recycled material on a mass balance basis and is recycle-ready based on future infrastructure. collaborated with Pulpex to develop a paper-based, renewable, and recyclable bottle made from 100% sustainably sourced wood pulp. Additionally, the brand created a new sachet design in that is made with the equivalent of 35% recycled material on a mass balance basis and is recycle-ready based on future infrastructure. Waste Reduction: Achieved zero waste-to-landfill status for its Elst, Netherlands and Pasuruan, Indonesia facilities, resulting in a total of 16 zero waste-to-landfill facilities across the Company. Achieved an 18.4% reduction in waste-to-landfill intensity across the Company's manufacturing facilities, putting it on-track to achieve its goal of a 20% reduction by 2025. Responsible Sourcing Kraft Heinz is working across the entire value chain to continue advancing sustainable practices and offering responsible choices. The Company is dedicated to responsible sourcing and related impacts such as human rights, deforestation, animal welfare, and sustainable agriculture. In 2022, Kraft Heinz: Sustainable Tomatoes: Achieved 75% sustainably sourced HEINZ ketchup tomatoes aligned with the Company's Sustainable Agricultural Practices Manual. Achieved 75% sustainably sourced ketchup tomatoes aligned with the Company's Sustainable Agricultural Practices Manual. Gender Equality in Brazilian Logistics: Engaged and challenged its suppliers to employ more women in transport operations, resulting in two suppliers permanently employing two women drivers with the aim to expand in 2023 and beyond. Engaged and challenged its suppliers to employ more women in transport operations, resulting in two suppliers permanently employing two women drivers with the aim to expand in 2023 and beyond. Education in Egypt : Immersed Egyptian growers in sustainable farming methods during educational events focused on the topics of climate change and health and safety to grow their awareness of how they can positively impact these areas. \"Our 2023 ESG Report is a testament to the change that's possible when we collaborate cross-functionally and come together with other businesses, nonprofit organizations, and experts,\" said Rashida La Lande, Executive Vice President, Global General Counsel, and Chief Sustainability and Corporate Affairs Officer at Kraft Heinz. \"We recognize we have a long way to go but innovative partnerships like we have with Pulpex, and smart investments in things like renewable electricity, will help position us to continue advancing toward our goals and propelling the industry forward.\" The 2023 ESG Report was prepared using the Global Reporting Initiative (\"GRI\") reporting standard and in alignment with the general principles of the Sustainability Accounting Standards Board (\"SASB\") for food and beverage companies, as well as the Task Force on Climate-related Financial Disclosure (\"TCFD\"). More information is available at www.kraftheinzcompany.com\/esg. About The Kraft Heinz Company We are driving transformation at The Kraft Heinz Company (Nasdaq: KHC), inspired by our Purpose, Let's Make Life Delicious. Consumers are at the center of everything we do. With 2022 net sales of approximately $26 billion, we are committed to growing our iconic and emerging food and beverage brands on a global scale. We leverage our scale and agility to unleash the full power of Kraft Heinz across a portfolio of six consumer-driven product platforms. As global citizens, we're dedicated to making a sustainable, ethical impact while helping feed the world in healthy, responsible ways. Learn more about our journey by visiting www.kraftheinzcompany.com or following us on LinkedIn. Forward-Looking Statements This press release contains a number of forward-looking statements. Words such as \"advance,\" \"aim,\" \"achieve,\" \"align,\" \"ambition,\" \"commit,\" \"continue,\" \"design,\" \"goal,\" \"grow,\" \"help,\" \"improve,\" \"increase,\" \"make,\" \"plan,\" \"propel,\" \"strengthen,\" \"strive,\" \"target,\" \"will,\" and variations of such words and similar future or conditional expressions are intended to identify forward-looking statements. These statements are not historical facts and are based on Kraft Heinz's current beliefs, expectations, estimates, and projections. These forward-looking statements are subject to a number of risks and uncertainties, many of which are difficult to predict and beyond Kraft Heinz's control, which could cause actual results to differ materially from those indicated in the forward-looking statements. Those factors include, but are not limited to, decreased agricultural productivity; increased consumer demand for food products or changes in consumer preferences; economic and political conditions in the United States and other places where Kraft Heinz does business or sources raw materials (including inflationary pressures); climate change, legal or regulatory responses thereto, and the Company's compliance with such laws; the Company's dependence on technology and the reliability of such technology, including the pace of changes in technology and potential damage to or interruptions in technology; costs of resources and raw materials; adverse weather conditions and natural disasters; Kraft Heinz's ability to successfully execute its strategic initiatives; the Company's ability to realize the anticipated benefits of alliances, joint ventures, investments, or partnerships; the Company's compliance with laws and regulations and related legal claims or regulatory enforcement actions; labor strikes; changes in Kraft Heinz's management team or other key personnel and its ability to attract, hire, and retain qualified personnel; and the Company's future financial and operating performance within and relative to its industry, as well as the other risks found in Kraft Heinz's 2023 ESG Report and the risk factors and the risk factors set forth in Kraft Heinz's filings with the U.S. Securities and Exchange Commission, including the Company's most recently filed Annual Report on Form 10-K and subsequent reports on Forms 10-Q and 8-K. Kraft Heinz disclaims and does not undertake any obligation to update, revise, or withdraw any forward-looking statement in this press release, except as required by applicable law or regulation. SOURCE The Kraft Heinz Company","filter_flag":1}
{"title":"Sustainability Guidelines - National Geographic Society","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3Lm5hdGlvbmFsZ2VvZ3JhcGhpYy5vcmcvc29jaWV0eS9zdXN0YWluYWJpbGl0eS1ndWlkZWxpbmVzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3Lm5hdGlvbmFsZ2VvZ3JhcGhpYy5vcmcvc29jaWV0eS9zdXN0YWluYWJpbGl0eS1ndWlkZWxpbmVzL9IBAA?oc=5","id":"CBMiRWh0dHBzOi8vd3d3Lm5hdGlvbmFsZ2VvZ3JhcGhpYy5vcmcvc29jaWV0eS9zdXN0YWluYWJpbGl0eS1ndWlkZWxpbmVzL9IBAA","guidislink":false,"published":"Fri, 20 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=293, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3Lm5hdGlvbmFsZ2VvZ3JhcGhpYy5vcmcvc29jaWV0eS9zdXN0YWluYWJpbGl0eS1ndWlkZWxpbmVzL9IBAA?oc=5\" target=\"_blank\">Sustainability Guidelines<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">National Geographic Society<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sustainability Guidelines - National Geographic Society","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3Lm5hdGlvbmFsZ2VvZ3JhcGhpYy5vcmcvc29jaWV0eS9zdXN0YWluYWJpbGl0eS1ndWlkZWxpbmVzL9IBAA?oc=5\" target=\"_blank\">Sustainability Guidelines<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">National Geographic Society<\/font>","source.href":"https:\/\/www.nationalgeographic.org","source.title":"National Geographic Society","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Stewardship\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Last updated: October 20, 2023 Sustainability is development that meets the needs of the present without compromising the ability of future generations to meet their own needs.1 A sustainable organization must embrace a holistic way of thinking that considers how we can create social and environmental value through our actions, while limiting negative impacts from those actions on communities, wildlife or natural resources. For National Geographic, sustainability is an essential component of the brand and is reflected in our storytelling, products, brand activations and nonprofit work. The existence of the people, places, and wildlife that we explore and celebrate depend on our decisions and actions. To combat climate change, resource depletion, pollution and social inequities we will make conscious choices about who and what contribute to the creation of our products, experiences, and supplies and we will consider carefully the short- and long-term consequences of their creation, use, and disposal on communities and the environment. Any individual, organization or company collaborating with or doing business with National Geographic, such as service providers and manufacturing suppliers, must be evaluated for their commitment to social and environmental principles, and National Geographic products, activations and promotions must be evaluated for their potential social and environmental impacts. For clarity, “National Geographic” includes the Society, and its licensee, NGP\/Disney and their licensees. Consistent with our core values, National Geographic embraces sustainable development and continuously evaluates impacts that are most material to business activities, including: Preservation of cultures and habitats Protection of endangered species Mitigating climate change Minimizing the use of toxic materials and finite natural resources like oils, gasses, metals and plastics by finding alternatives Replacing, replanting and regenerating renewable resources like wood and water Prioritizing durability, reparability and recyclability in the products used and created in order to reduce waste Eliminating as much as possible the creation of pollutants and unrecoverable waste Potential sustainability risks for the National Geographic brand from a particular product, service, activity, or activation can stem from a wide range of social and environmental issues:","filter_flag":1}
{"title":"Whole Foods Expands 'Sourced For Good' Label To Coffee - Store Brands Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vc3RvcmVicmFuZHMuY29tL3dob2xlLWZvb2RzLWV4cGFuZHMtc291cmNlZC1nb29kLWxhYmVsLWNvZmZlZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vc3RvcmVicmFuZHMuY29tL3dob2xlLWZvb2RzLWV4cGFuZHMtc291cmNlZC1nb29kLWxhYmVsLWNvZmZlZdIBAA?oc=5","id":"CBMiRWh0dHBzOi8vc3RvcmVicmFuZHMuY29tL3dob2xlLWZvb2RzLWV4cGFuZHMtc291cmNlZC1nb29kLWxhYmVsLWNvZmZlZdIBAA","guidislink":false,"published":"Tue, 03 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=276, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vc3RvcmVicmFuZHMuY29tL3dob2xlLWZvb2RzLWV4cGFuZHMtc291cmNlZC1nb29kLWxhYmVsLWNvZmZlZdIBAA?oc=5\" target=\"_blank\">Whole Foods Expands 'Sourced For Good' Label To Coffee<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Store Brands Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Whole Foods Expands 'Sourced For Good' Label To Coffee - Store Brands Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vc3RvcmVicmFuZHMuY29tL3dob2xlLWZvb2RzLWV4cGFuZHMtc291cmNlZC1nb29kLWxhYmVsLWNvZmZlZdIBAA?oc=5\" target=\"_blank\">Whole Foods Expands 'Sourced For Good' Label To Coffee<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Store Brands Magazine<\/font>","source.href":"https:\/\/storebrands.com","source.title":"Store Brands Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Stewardship\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Whole Foods Market is expanding its Sourced for Good certification to the coffee aisle, starting with 13 distinct blends of its private label coffee, which was previously sold under the Allegro Coffee Company label. The Sourced for Good seal signifies that the coffee has been sourced in a responsible way that benefits workers and the environment. Sourced for Good is Whole Foods Market's exclusive third-party certification program that supports responsible sourcing by providing tangible improvements in farm workers' lives, strengthening worker communities, and promoting environmental stewardship. The program spans 12 countries and raises millions of dollars annually for hundreds of communities. Funds have provided benefits such as housing, on-site laundry facilities, scholarships, health services, a dental clinic, transportation, and support for working parents and families such as stipends for daycare. The Sourced for Good label is already found in the grocer’s produce and floral departments. RELATED: Whole Foods 365 Products Now Available on Amazon In addition to the Sourced for Good seal, all Whole Foods Market brand single-origin coffees will now include a Q Coffee mark and score of 86+ on the front of the package. The Q Coffee mark is awarded by the Coffee Quality Institute (CQI) to coffees that are consistently of specialty quality. \"We are thrilled to bring the Sourced for Good program to more aisles across our stores, starting with our Whole Foods Market brand coffee blends,\" said Alyssa Vescio, Whole Foods Market's senior vice president of Merchandising. \"This certification not only deepens our relationship with suppliers, but also gives our customers the opportunity to make an even bigger impact, supporting environmental stewardship and workers in communities where these products are sourced.\" Customers can look for Whole Foods Market brand classic blends like Breakfast, Rainforest, and Continental, which are now Sourced for Good, and single-origin coffees with the Q mark score such as Ethiopia, Kenya, and Costa Rica, on shelves of Whole Foods Market stores nationwide by the end of October.","filter_flag":1}
{"title":"5 New technologies for beef producers - Successful Farming","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmFncmljdWx0dXJlLmNvbS81LW5ldy10ZWNobm9sb2dpZXMtZm9yLWJlZWYtcHJvZHVjZXJzLTc1NTQwNzfSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmFncmljdWx0dXJlLmNvbS81LW5ldy10ZWNobm9sb2dpZXMtZm9yLWJlZWYtcHJvZHVjZXJzLTc1NTQwNzfSAQA?oc=5","id":"CBMiSWh0dHBzOi8vd3d3LmFncmljdWx0dXJlLmNvbS81LW5ldy10ZWNobm9sb2dpZXMtZm9yLWJlZWYtcHJvZHVjZXJzLTc1NTQwNzfSAQA","guidislink":false,"published":"Thu, 12 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=285, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmFncmljdWx0dXJlLmNvbS81LW5ldy10ZWNobm9sb2dpZXMtZm9yLWJlZWYtcHJvZHVjZXJzLTc1NTQwNzfSAQA?oc=5\" target=\"_blank\">5 New technologies for beef producers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Successful Farming<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"5 New technologies for beef producers - Successful Farming","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmFncmljdWx0dXJlLmNvbS81LW5ldy10ZWNobm9sb2dpZXMtZm9yLWJlZWYtcHJvZHVjZXJzLTc1NTQwNzfSAQA?oc=5\" target=\"_blank\">5 New technologies for beef producers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Successful Farming<\/font>","source.href":"https:\/\/www.agriculture.com","source.title":"Successful Farming","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Stewardship\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Like every other area of agriculture, efficiency is the name of the game in the beef industry. Fortunately, farmers are changing the game with emerging innovations to monitor herd health by optimizing reproduction and helping build consumer trust. Here are five new technologies that may help you get in the game. 1. Invisible fence for cows Founded in 2020, Corral Technologies is another new virtual fence company option. Cows wear a two-sided collar with GPS tracking and can provide stimulation to help keep cows within a virtual boundary designed by the farmer based on GPS coordinates of their property. Cows can become trained after five days of use, but if a cow goes through the boundary, her collar will send her an alarm and stimulation to guide her back inside the perimeter. Farmers can control and track cows through Corral's collars and software via phone, tablet, or computer. 2. An inclusive cattle feeder platform with real-time data and bookkeeping AgResult is comprehensive cattle management software designed especially for farmers raising feeder cattle for finishing and on a contracting basis. It also helps organize feed rations and bookkeeping. Whether through the app on your phone or via computer, you can get real-time data on feed inventory, costs per pound of grain, and average daily gain. The pricing for the product is a pay-as-you-go model and is based on the number of head of cattle. 3. Food verification to help build consumer trust Where Food Comes From (WFCF), Inc. is an independent third-party verification company that helps over 15,000 farmers, processors, retailers, and consumer brands build trust with consumers. The company audits marketing claims using USDA's Process Verified Programs, National Organic Program, and the company's own CARE program, which covers animal welfare, environmental stewardship, and community supply-chain sustainability. WFCF also uses SunHarvest, a custom software platform that creates metrics on management practices used to achieve the claim, including Passport Traceability, which can track a product to its source of origin. 4. Watch your herd’s water intake Debuted earlier this year, Ranchbot is a water monitoring company that gives farmers insights into their water stock tanks to measure how much their cattle are drinking. Farmers can place Ranchbot's water level sensor in the water tank to monitor water metrics in real-time via a computer dashboard. The sensors and software can operate in remote locations with satellite connectivity. Access to the software is via subscription and costs $1 a day. The sensor costs $1,855. 5. Ear tags monitor bull health and performance Bull performance is essential to the success of a cowherd. For some farms, monitoring a bull's health can be a challenge. Farmers can use the 701x — XTpro's Autonomous Rancher software — and smart ear tags to collect animal footstep data via GPS. The data is connected to the Autonomous Rancher software and application. The platform can also send alerts to farmers' cellphones if the bull hasn't moved for an extended period or a high-speed warning if an animal moves above 29 mph. The platform also features a bull mounting algorithm to inform farmers which bulls are most proactive. Pricing is based on the number of animals a farmer records in the app and the type of operation. For a commercial herd, the monthly subscription price is $8.33, and for the year, it's $100. XTpro costs $83 per tag. A service charge option costs $42 per tag per year.","filter_flag":1}
{"title":"Oshi Salmon-Inspired Fillets Make Debut in NYC's Coletta Restaurant - vegconomist - the vegan business magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vdmVnY29ub21pc3QuY29tL2dhc3Ryb25vbXktZm9vZC1zZXJ2aWNlL2Zvb2Qtc2VydmljZS9vc2hpLXNhbG1vbi1kZWJ1dC1ueWNzLWNvbGV0dGEtcmVzdGF1cmFudC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vdmVnY29ub21pc3QuY29tL2dhc3Ryb25vbXktZm9vZC1zZXJ2aWNlL2Zvb2Qtc2VydmljZS9vc2hpLXNhbG1vbi1kZWJ1dC1ueWNzLWNvbGV0dGEtcmVzdGF1cmFudC_SAQA?oc=5","id":"CBMiZ2h0dHBzOi8vdmVnY29ub21pc3QuY29tL2dhc3Ryb25vbXktZm9vZC1zZXJ2aWNlL2Zvb2Qtc2VydmljZS9vc2hpLXNhbG1vbi1kZWJ1dC1ueWNzLWNvbGV0dGEtcmVzdGF1cmFudC_SAQA","guidislink":false,"published":"Fri, 27 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=300, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vdmVnY29ub21pc3QuY29tL2dhc3Ryb25vbXktZm9vZC1zZXJ2aWNlL2Zvb2Qtc2VydmljZS9vc2hpLXNhbG1vbi1kZWJ1dC1ueWNzLWNvbGV0dGEtcmVzdGF1cmFudC_SAQA?oc=5\" target=\"_blank\">Oshi Salmon-Inspired Fillets Make Debut in NYC's Coletta Restaurant<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">vegconomist - the vegan business magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Oshi Salmon-Inspired Fillets Make Debut in NYC's Coletta Restaurant - vegconomist - the vegan business magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vdmVnY29ub21pc3QuY29tL2dhc3Ryb25vbXktZm9vZC1zZXJ2aWNlL2Zvb2Qtc2VydmljZS9vc2hpLXNhbG1vbi1kZWJ1dC1ueWNzLWNvbGV0dGEtcmVzdGF1cmFudC_SAQA?oc=5\" target=\"_blank\">Oshi Salmon-Inspired Fillets Make Debut in NYC's Coletta Restaurant<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">vegconomist - the vegan business magazine<\/font>","source.href":"https:\/\/vegconomist.com","source.title":"vegconomist - the vegan business magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Stewardship\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Israeli startup Oshi announces that its flagship product, Oshi Salmon-Inspired Fillets, will debut at Coletta, an upscale vegan Italian restaurant located in New York City, starting this week. This marks a significant moment for the company as it enters the American foodservice market with its first offering. The fillet will be served for a limited time, and the menu offering includes “Seared Balsamic “Salmon” with velvety “parmesan” & chive polenta paired with roasted broccoli infused with thyme and a touch of zesty lemon.” Formerly known as Plantish, the company underwent a rebrand earlier this year in preparation for its entry into the US market. According to Ofek Ron, CEO of Oshi, the rebrand aimed to encapsulate the company’s mission and its commitment to environmental stewardship while conveying a deep-seated dedication to transforming the world’s oceans. Established in 2021, the company specializes in creating alternative fish products, starting with salmon. Last year, Oshi unveiled its salmon prototype – a boneless fillet boasting nutritional attributes equivalent to traditional salmon, including comparable protein content, B vitamins, and omega-3 fatty acids, while being free from contaminants such as microplastics and mercury. The product is crafted from a blend of legume proteins and algae extracts, featuring a fibrous structure akin to that of salmon, achieved through 3D printing technology, a method embraced by like-minded companies such as Revo Foods. Oshi’s journey received a significant boost when it secured a joint grant of $1 million in collaboration with The Better Meat Co. a few months ago. This funding is directed towards the research and development of seafood alternatives based on mycoprotein. The ideal venue for Oshi’s debut Coletta, strategically positioned near Gramercy Park, just blocks away from the Empire State Building, has been chosen as the ideal venue for the introduction of Oshi Salmon-Inspired Fillets. The 100% vegan and kosher Italian restaurant offers an intimate and exclusive dining experience, with brick oven pizzas, housemade ravioli, and artisanal vegan cheeses. Oshi isn’t the first Israeli startup to find itself on Coletta’s upscale Italian menu. Chunk Foods, with its Chunk Steak Filet, became a permanent fixture on the menu last year through a partnership with the restaurant. On its social channels, the Oshi Team expressed excitement about the milestone, stating, “Launching our product in New York is a huge milestone for us, and we are over the moon with the positive response we’ve been getting from customers. So if you’re in the New York area, swing by Coletta to experience firsthand the future of food.”","filter_flag":1}
{"title":"Lallemand celebrates one century of yeast production in Montreal - Aquafeed.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9wcm9kdWN0cy9zdXBwbGllcnMtbmV3cy9sYWxsZW1hbmQtY2VsZWJyYXRlcy1vbmUtY2VudHVyeS1vZi15ZWFzdC1wcm9kdWN0aW9uLWluLW1vbnRyZWFsL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9wcm9kdWN0cy9zdXBwbGllcnMtbmV3cy9sYWxsZW1hbmQtY2VsZWJyYXRlcy1vbmUtY2VudHVyeS1vZi15ZWFzdC1wcm9kdWN0aW9uLWluLW1vbnRyZWFsL9IBAA?oc=5","id":"CBMicmh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9wcm9kdWN0cy9zdXBwbGllcnMtbmV3cy9sYWxsZW1hbmQtY2VsZWJyYXRlcy1vbmUtY2VudHVyeS1vZi15ZWFzdC1wcm9kdWN0aW9uLWluLW1vbnRyZWFsL9IBAA","guidislink":false,"published":"Wed, 04 Oct 2023 12:14:25 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=4, tm_hour=12, tm_min=14, tm_sec=25, tm_wday=2, tm_yday=277, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9wcm9kdWN0cy9zdXBwbGllcnMtbmV3cy9sYWxsZW1hbmQtY2VsZWJyYXRlcy1vbmUtY2VudHVyeS1vZi15ZWFzdC1wcm9kdWN0aW9uLWluLW1vbnRyZWFsL9IBAA?oc=5\" target=\"_blank\">Lallemand celebrates one century of yeast production in Montreal<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Aquafeed.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Lallemand celebrates one century of yeast production in Montreal - Aquafeed.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9wcm9kdWN0cy9zdXBwbGllcnMtbmV3cy9sYWxsZW1hbmQtY2VsZWJyYXRlcy1vbmUtY2VudHVyeS1vZi15ZWFzdC1wcm9kdWN0aW9uLWluLW1vbnRyZWFsL9IBAA?oc=5\" target=\"_blank\">Lallemand celebrates one century of yeast production in Montreal<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Aquafeed.com<\/font>","source.href":"https:\/\/www.aquafeed.com","source.title":"Aquafeed.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Stewardship\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"At the celebration event, Antoine Chagnon, president and CEO of Lallemand, said that the company is working on the next generation of probiotics to promote further health benefits. Lallemand celebrated a significant milestone on September 21, 2023: 100 years of yeast production in its production plant on rue Préfontaine, Montreal. Colleagues from all around the world, clients, partners, and local politicians joined company executives for the celebration of this important landmark. “A 100 years! This is a great opportunity to pay tribute to our supportive business partners, valued customers and our talented employees who have all played a part in our success story,” stated Antoine Chagnon, president and CEO of Lallemand. “I raise my glass to those who built this factory, originally dedicated to baker's yeast for the local market, and the visionaries who made it a launching platform for the global company that Lallemand has become today.” hagnon took the helm of the company in 2015, succeeding his father Jean, and grand-father Roland before him. Notwithstanding its respectable age of 100 years, Lallemand’s Préfontaine plant has a bright and rich future ahead, due to the potential of microbes to help address some of the most pressing issues of our times. “We are all facing new challenges: climate change and feeding the entire planet are on the menu for the coming decades, and innovative microorganisms can play a key role in facing them. Among others, they can help us reduce carbon emissions, lower the use of antibiotics and chemical preservatives, and promote the use of microbial fertilizers or biological crop protection products that reduce the use of fossil products,” said Chagnon. “We are also working on the next generation of probiotics to promote further health benefits.” Lallemand now has diverse and global presence in 50 countries over five continents, employs more than 5,000 employees and operates 48 production facilities, including 24 yeast and 10 bacteria plants. The company develops, produces, and markets yeast, bacteria, fungi, and derivatives of these microorganisms for applications in baking, wine, beer, distilled spirits, fuel ethanol, animal and human nutrition, the pharmaceutical industry, and other food and agricultural industries.","filter_flag":1}
{"title":"MELITTA CANADA ANNOUNCES NEW SUSTAINABLE CERTIFICATIONS, HELPING CANADIAN COFFEE ... - Canada NewsWire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL21lbGl0dGEtY2FuYWRhLWFubm91bmNlcy1uZXctc3VzdGFpbmFibGUtY2VydGlmaWNhdGlvbnMtaGVscGluZy1jYW5hZGlhbi1jb2ZmZWUtZHJpbmtlcnMtbWFrZS1iZXR0ZXItY2hvaWNlcy04NzQzNzk3MDguaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL21lbGl0dGEtY2FuYWRhLWFubm91bmNlcy1uZXctc3VzdGFpbmFibGUtY2VydGlmaWNhdGlvbnMtaGVscGluZy1jYW5hZGlhbi1jb2ZmZWUtZHJpbmtlcnMtbWFrZS1iZXR0ZXItY2hvaWNlcy04NzQzNzk3MDguaHRtbNIBAA?oc=5","id":"CBMioQFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL21lbGl0dGEtY2FuYWRhLWFubm91bmNlcy1uZXctc3VzdGFpbmFibGUtY2VydGlmaWNhdGlvbnMtaGVscGluZy1jYW5hZGlhbi1jb2ZmZWUtZHJpbmtlcnMtbWFrZS1iZXR0ZXItY2hvaWNlcy04NzQzNzk3MDguaHRtbNIBAA","guidislink":false,"published":"Mon, 02 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=275, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL21lbGl0dGEtY2FuYWRhLWFubm91bmNlcy1uZXctc3VzdGFpbmFibGUtY2VydGlmaWNhdGlvbnMtaGVscGluZy1jYW5hZGlhbi1jb2ZmZWUtZHJpbmtlcnMtbWFrZS1iZXR0ZXItY2hvaWNlcy04NzQzNzk3MDguaHRtbNIBAA?oc=5\" target=\"_blank\">MELITTA CANADA ANNOUNCES NEW SUSTAINABLE CERTIFICATIONS, HELPING CANADIAN COFFEE ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"MELITTA CANADA ANNOUNCES NEW SUSTAINABLE CERTIFICATIONS, HELPING CANADIAN COFFEE ... - Canada NewsWire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL21lbGl0dGEtY2FuYWRhLWFubm91bmNlcy1uZXctc3VzdGFpbmFibGUtY2VydGlmaWNhdGlvbnMtaGVscGluZy1jYW5hZGlhbi1jb2ZmZWUtZHJpbmtlcnMtbWFrZS1iZXR0ZXItY2hvaWNlcy04NzQzNzk3MDguaHRtbNIBAA?oc=5\" target=\"_blank\">MELITTA CANADA ANNOUNCES NEW SUSTAINABLE CERTIFICATIONS, HELPING CANADIAN COFFEE ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","source.href":"https:\/\/www.newswire.ca","source.title":"Canada NewsWire","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Stewardship\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"The global coffee company's Canadian Division launches its line of 100% Arabica Rainforest Alliance whole bean coffee along with its FSC\/BPI Certified filters. TORONTO, Oct. 2, 2023 \/CNW\/ - Reinforcing its commitment to sustainability, Melitta Canada is excited to announce several new initiatives to strengthen its global environmental stewardship efforts. Through rigorous third-party certifications from Rainforest Alliance, the Forest Stewardship Council (FSC) and the Biodegradable Products Institute (BPI), Melitta Canada is adding to its repertoire of sustainable labels, seals and certifications and helping Canadians Choose Better with planet-friendly coffee products. Melitta Canada launches its line of 100% Arabica Rainforest Alliance whole bean coffee along with its FSC\/BPI Certified filters. (CNW Group\/Melitta Canada) \"Sustainability is at the core of Melitta's mission, and we are thrilled to be launching the Choose Better campaign with the announcement of the new Rainforest Alliance, FSC and BPI Certifications,\" says Lori Brick, Marketing Manager, Melitta Canada. \"We know that Canadian consumers want to make better choices for the planet, and we believe that businesses play a crucial role in ensuring they are able to do so. These certifications mean that coffee drinkers can Choose Better and feel good about their purchasing decisions.\" Sourced from Rainforest Alliance Certified farms and produced in accordance with its environmental, social, and economic standards, Melitta's whole bean coffees help create a better future by supporting farmers who employ responsible practices such as responsible land management and maintaining a habitat for native wildlife. The widely recognized sustainability certification allows consumers to choose products that contribute to a better planet. The newly certified line of 100% Arabica Rainforest Alliance Certified whole bean coffee includes the following varieties: Colombia Altura Blend, French Roast, Espresso Bellacrema, and Hazelnut Crème. \"We are proud to collaborate with companies like Melitta Canada to empower consumers to make better choices in their day-to-day lives. This certification highlights their dedication to upholding quality and ethical standards, positively impacting farmers, communities, and the environment,\" says the Rainforest Alliance organization. Several Melitta Cone Filter varieties have also recently obtained third-party certifications. The Melitta White and Natural Brown cone filters are certified by both FSC and BPI and the Bamboo Cone Filters hold a BPI Certification. By choosing FSC Certified products, consumers are supporting sustainable forestry practices, contributing to the conservation of forests, and helping to improve the livelihood of communities dependent on forestry. Melitta's White and Natural brown filter varieties are also manufactured using FSC Certified pulp. The BPI seal, now visible on its White, Natural Brown and Bamboo cone filters, is a recognized standard for compostability. It considers factors such as a product's biodegradability, disintegration, compost quality and timeframe and promotes sustainable consumption and waste management practices. Melitta's Choose Better Campaign, anchored by the announcement of the new third-party certifications, serves as a catalyst for inspiring Canadians to embrace more environmentally responsible and sustainable choices. Its overarching objective is to empower consumers, enabling them to conscientiously evaluate the environmental and social consequences of their daily decisions – big or small. Melitta acknowledges that each choice carries the potential to collectively shape the impact on both the environment and society. Canadians can now look out for Melitta's Rainforest Alliance Certified 100% Arabica whole bean coffee varieties and FSC and\/or BPI Certified cone filters at grocery stores across Canada. About Melitta Canada Melitta Canada, headquartered in Toronto, Ontario, is part of Melitta North America. As Melitta's first overseas subsidiary, Melitta Canada is an operating division of the privately held Melitta Group of Minden, Germany. For more than 100 years, Melitta has dedicated itself to providing the ultimate coffee experience with its premium line of coffee, coffee filters and high-quality coffeemakers, bringing European indulgence to life. The company was founded in 1908 by Melitta Bentz, after receiving a patent for her coffee filtering system consisting of a filter and filtration paper. The filter system was the first to successfully remove coffee residue in the brewing process, revolutionizing the way coffee was made. For more information visit Melitta.ca. SOURCE Melitta Canada Media Contacts: energi PR, Claire Dawson, Account Executive, 905 510 4127, [email protected]; Melitta North America, Donna Gray, Director, [email protected]","filter_flag":1}
{"title":"New funds allow Merritt forestry company to get more value out of harvest - Merritt Herald","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3Lm1lcnJpdHRoZXJhbGQuY29tL25ldy1mdW5kcy1hbGxvdy1tZXJyaXR0LWZvcmVzdHJ5LWNvbXBhbnktdG8tZ2V0LW1vcmUtdmFsdWUtb3V0LW9mLWhhcnZlc3Qv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3Lm1lcnJpdHRoZXJhbGQuY29tL25ldy1mdW5kcy1hbGxvdy1tZXJyaXR0LWZvcmVzdHJ5LWNvbXBhbnktdG8tZ2V0LW1vcmUtdmFsdWUtb3V0LW9mLWhhcnZlc3Qv0gEA?oc=5","id":"CBMiaGh0dHBzOi8vd3d3Lm1lcnJpdHRoZXJhbGQuY29tL25ldy1mdW5kcy1hbGxvdy1tZXJyaXR0LWZvcmVzdHJ5LWNvbXBhbnktdG8tZ2V0LW1vcmUtdmFsdWUtb3V0LW9mLWhhcnZlc3Qv0gEA","guidislink":false,"published":"Wed, 11 Oct 2023 19:55:15 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=11, tm_hour=19, tm_min=55, tm_sec=15, tm_wday=2, tm_yday=284, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3Lm1lcnJpdHRoZXJhbGQuY29tL25ldy1mdW5kcy1hbGxvdy1tZXJyaXR0LWZvcmVzdHJ5LWNvbXBhbnktdG8tZ2V0LW1vcmUtdmFsdWUtb3V0LW9mLWhhcnZlc3Qv0gEA?oc=5\" target=\"_blank\">New funds allow Merritt forestry company to get more value out of harvest<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Merritt Herald<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New funds allow Merritt forestry company to get more value out of harvest - Merritt Herald","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3Lm1lcnJpdHRoZXJhbGQuY29tL25ldy1mdW5kcy1hbGxvdy1tZXJyaXR0LWZvcmVzdHJ5LWNvbXBhbnktdG8tZ2V0LW1vcmUtdmFsdWUtb3V0LW9mLWhhcnZlc3Qv0gEA?oc=5\" target=\"_blank\">New funds allow Merritt forestry company to get more value out of harvest<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Merritt Herald<\/font>","source.href":"https:\/\/www.merrittherald.com","source.title":"Merritt Herald","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Stewardship\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"The British Columbia government has announced new funding to strengthen wood-product manufacturing and to further support local First Nations economies around the province. According to a news release, the funding announced is part of the BC Manufacturing Jobs Fund (BCMJF), which supports non-for-profit organizations to plan and launch high-value industrial and manufacturing projects. In the release, Brenda Bailey, minister of jobs, economic development and innovation, said the provincial government continues to work and support First Nations and manufacturing companies in order to achieve long-term growth in the industry. “By investing in innovation, we’re getting more value from the wood harvested in B.C., while creating and preserving high-quality jobs in the forestry sector,” she said. In addition to non-for-profit organizations, the BCMJF is also supporting three Indigenous-led planning projects, including Stuwix Resources, which is located in Merritt. Stuwix Resources is a forestry management company owned by eight First Nations bands located in the southern Interior of B.C. According to their website, the mission of the market logging company is to maximize the harvested trees, which aligns with their commitment of environmental stewardship. According to the release, Stuwix Resources will be receiving up to $50,000 for planning activities toward implementing new processing approaches that will allow them to recover up to 35 per cent more marketable volume out of their tenure harvest. Lindsay Tighe, general manager at Stuwix Resources, said that support from the Province will allow them to go back to a traditional long-log program, increasing their ability to send the log to the right market, manufacture new products and explore markets such as bio energy, chips, shavings and firewood. “Our communities and memberships’ values expect full utilization of forest resources so that we are not wasting and burning usable sources,” he said. “Our project will create a new business line, allowing us to do more on-site processing and decrease our wasted fibre.”","filter_flag":1}
{"title":"Nor-Feed makes progress in aquaculture - Aquafeed.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9wcm9kdWN0cy9zdXBwbGllcnMtbmV3cy9ub3ItZmVlZC1tYWtlcy1wcm9ncmVzcy1pbi1hcXVhY3VsdHVyZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9wcm9kdWN0cy9zdXBwbGllcnMtbmV3cy9ub3ItZmVlZC1tYWtlcy1wcm9ncmVzcy1pbi1hcXVhY3VsdHVyZS_SAQA?oc=5","id":"CBMiWGh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9wcm9kdWN0cy9zdXBwbGllcnMtbmV3cy9ub3ItZmVlZC1tYWtlcy1wcm9ncmVzcy1pbi1hcXVhY3VsdHVyZS_SAQA","guidislink":false,"published":"Wed, 04 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=4, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=277, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9wcm9kdWN0cy9zdXBwbGllcnMtbmV3cy9ub3ItZmVlZC1tYWtlcy1wcm9ncmVzcy1pbi1hcXVhY3VsdHVyZS_SAQA?oc=5\" target=\"_blank\">Nor-Feed makes progress in aquaculture<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Aquafeed.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Nor-Feed makes progress in aquaculture - Aquafeed.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9wcm9kdWN0cy9zdXBwbGllcnMtbmV3cy9ub3ItZmVlZC1tYWtlcy1wcm9ncmVzcy1pbi1hcXVhY3VsdHVyZS_SAQA?oc=5\" target=\"_blank\">Nor-Feed makes progress in aquaculture<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Aquafeed.com<\/font>","source.href":"https:\/\/www.aquafeed.com","source.title":"Aquafeed.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Stewardship\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"The use of the company’s plant-based additives in aquaculture has shown many benefits leading to a fast development. Nor-Feed is a leading French company in the development of plant-based additives, founded in 2003. Its primary objective is to eliminate the use of xenobiotics such as antibiotics, pesticides and synthetic solutions in animal feed. Following the success of Nor-Feed solutions in livestock, the approach has been extended to other species, including aquatic species. The use of their products in aquaculture has also shown many benefits leading to a fast development. Plant-based additives have demonstrated their efficacy within the field of aquaculture and are experiencing growing utilization in feed production. Nor-Feed's strength lies in its ability to focus on a limited range of perfectly characterized and standardized products. In other words, the concentration of active ingredients is known, communicated and always identical. The range includes: Nor-Grape, grape polyphenols to compensate oxidative stress. It is currently used in various species, from trout to shrimp, including salmon, tilapia, seabass, etc., to support the immune system and improve flesh quality. Nor-Spice AB, a prebiotic to improve growth and feed efficacy. Feedback from the field is very positive, and the results of recent trials on species such as tilapia and pangasius point in the same direction. Durelax, which contributes to animal welfare. It is used in particular when handling, vaccinating or transporting animals. Nor-Feed sources specific saponins, which are compounds naturally produced by plants as a defense mechanism, and they possess various properties, particularly due to their surface-active effect. Nor-Feed offers Norponin Opti for the control of ammonia, and Norponin XO to contribute to the control of certain intestinal parasites.","filter_flag":1}
{"title":"Dundee to smelt up to 230000t of copper – Windhoek Observer - Windhoek Observer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vd3d3Lm9ic2VydmVyMjQuY29tLm5hL2R1bmRlZS10by1zbWVsdC11cC10by0yMzAwMDB0LW9mLWNvcHBlci_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vd3d3Lm9ic2VydmVyMjQuY29tLm5hL2R1bmRlZS10by1zbWVsdC11cC10by0yMzAwMDB0LW9mLWNvcHBlci_SAQA?oc=5","id":"CBMiRmh0dHBzOi8vd3d3Lm9ic2VydmVyMjQuY29tLm5hL2R1bmRlZS10by1zbWVsdC11cC10by0yMzAwMDB0LW9mLWNvcHBlci_SAQA","guidislink":false,"published":"Fri, 13 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=286, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vd3d3Lm9ic2VydmVyMjQuY29tLm5hL2R1bmRlZS10by1zbWVsdC11cC10by0yMzAwMDB0LW9mLWNvcHBlci_SAQA?oc=5\" target=\"_blank\">Dundee to smelt up to 230000t of copper – Windhoek Observer<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Windhoek Observer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Dundee to smelt up to 230000t of copper – Windhoek Observer - Windhoek Observer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vd3d3Lm9ic2VydmVyMjQuY29tLm5hL2R1bmRlZS10by1zbWVsdC11cC10by0yMzAwMDB0LW9mLWNvcHBlci_SAQA?oc=5\" target=\"_blank\">Dundee to smelt up to 230000t of copper – Windhoek Observer<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Windhoek Observer<\/font>","source.href":"https:\/\/www.observer24.com.na","source.title":"Windhoek Observer","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Stewardship\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Observer Money talks to Alina Garises, communications manager at the Dundee Precious Metals Tsumeb (DPMT) about the company’s financial performance, its smelting forecast and the newly launched General Waste Management Facility. Observer Money (OM): Dundee Precious Metals Tsumeb (DPMT)’s turnover in 2022 was N$2.232 billion and a loss of N$839.4 million. When does DPMT forecast to break through and start making profit? Alina Garises (AG): The smelter is operating in a challenging global market environment. In order to ensure the long-term sustainability of the operation, the company launched a cost optimization and organisational efficiency program called the P300 project, which is expected to putthe business on the path to long-term sustainability. The losses for the 2022 is mainly related to an accounting impairment charge the company previously announced. (OM): DPMT also did not pay corporate tax and royalties in 2022, what are the factors that have led to DPMT to perform poorly? AG: Dundee Precious Metals Tsumeb is governed by Economic Processing Zone (EPZ) regulations. OM: The company also did pay the export levy and dividends paid in 2022, when does DPMT anticipate starting paying taxes and levies? AG: Dundee Precious Metals Tsumeb is governed by Economic Processing Zone (EPZ) regulations. OM: In 2022 the complex concentrate smelted for the full year was around 174,000 tonnes, what is the forecast for 2023? AG: Complex concentrate smelted is currently tracking at the low-end of the 2023 guidance range of 200000t to 230000t, and the Company plans to provide an update with its third quarter financial results. OM: What impact will the construction of Dundee’s General Waste Management Facility have on your operations? Is this facility operational? AG: The positive impacts of having a General Waste Management Facility include a significant shift from traditional practice of sending all waste to landfill to an integrated approach which is a modern acceptable practice. Economic benefits reduced waste quantity to landfill means prolonged life of landfill and hence cost saving from the need to expand the landfill space. Sorting waste for recycling purposes help to create and maintain downstream economy such as external waste recycling facilities which business entities on their own. In terms of social impacts, one of our core value is environmental stewardship, the facility is a testimony that we live by this value. This includes the creation of approximately nine direct job opportunities, comprised of general workers and equipment operators. In terms of environmental impact recycling helps to reduce pollution on environment and keep the site clean. Reduced amount of waste to landfill helps to reduce smelter foot print. The encouraging the use of recyclables to make new products help to preserve natural resources such as forests. Dundee’s General Waste Management Facility was inaugurated on 25 September.","filter_flag":1}
