{"title":"Senator Kavanagh's Carpet Recycling Bill Signed Into Law - The New York State Senate","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3Lm55c2VuYXRlLmdvdi9uZXdzcm9vbS9wcmVzcy1yZWxlYXNlcy8yMDIzL2JyaWFuLWthdmFuYWdoL3NlbmF0b3Ita2F2YW5hZ2hzLWNhcnBldC1yZWN5Y2xpbmctYmlsbC1zaWduZWQtbGF30gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3Lm55c2VuYXRlLmdvdi9uZXdzcm9vbS9wcmVzcy1yZWxlYXNlcy8yMDIzL2JyaWFuLWthdmFuYWdoL3NlbmF0b3Ita2F2YW5hZ2hzLWNhcnBldC1yZWN5Y2xpbmctYmlsbC1zaWduZWQtbGF30gEA?oc=5","id":"CBMid2h0dHBzOi8vd3d3Lm55c2VuYXRlLmdvdi9uZXdzcm9vbS9wcmVzcy1yZWxlYXNlcy8yMDIzL2JyaWFuLWthdmFuYWdoL3NlbmF0b3Ita2F2YW5hZ2hzLWNhcnBldC1yZWN5Y2xpbmctYmlsbC1zaWduZWQtbGF30gEA","guidislink":false,"published":"Tue, 10 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=10, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3Lm55c2VuYXRlLmdvdi9uZXdzcm9vbS9wcmVzcy1yZWxlYXNlcy8yMDIzL2JyaWFuLWthdmFuYWdoL3NlbmF0b3Ita2F2YW5hZ2hzLWNhcnBldC1yZWN5Y2xpbmctYmlsbC1zaWduZWQtbGF30gEA?oc=5\" target=\"_blank\">Senator Kavanagh's Carpet Recycling Bill Signed Into Law<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The New York State Senate<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Senator Kavanagh's Carpet Recycling Bill Signed Into Law - The New York State Senate","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3Lm55c2VuYXRlLmdvdi9uZXdzcm9vbS9wcmVzcy1yZWxlYXNlcy8yMDIzL2JyaWFuLWthdmFuYWdoL3NlbmF0b3Ita2F2YW5hZ2hzLWNhcnBldC1yZWN5Y2xpbmctYmlsbC1zaWduZWQtbGF30gEA?oc=5\" target=\"_blank\">Senator Kavanagh's Carpet Recycling Bill Signed Into Law<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The New York State Senate<\/font>","source.href":"https:\/\/www.nysenate.gov","source.title":"The New York State Senate","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Albany, NY — Senator Brian Kavanagh announced that the Carpet EPR bill (S5027C\/A9279A), which he sponsored along with Assemblymember Steven Englebright, was signed into law by Governor Kathy Hochul. The new law requires carpet manufacturers to establish a program for the collection and recycling of discarded and unused carpeting. Starting in January 2026, carpet sales in New York will be prohibited unless the manufacturers are participating in an approved industry-wide plan for recycling or have established their own program for carpet collection, approved by the State Department of Environmental Conservation. The new legislation establishes carpet recycling performance goals that the industry is required to achieve over time once the programs are approved. The first goal is for 30 percent of carpet recycling in five years, with at least 10 percent of the recovered materials being used as recycled content for new carpets. The final goal, to be achieved by the 15-year mark, calls for 75% carpet recycling, with at least 40% of recovered materials being used as recycled content for new carpets. “With this new law, New York takes a very big step forward in our goal of reducing waste and promoting a circular economy,” said Sen. Kavanagh. “Every year, hundreds of millions of pounds of carpet and carpeting materials are dumped in landfills and the dangerous PFAS chemicals in these carpets continue to negatively impact our health. This law will lead to a reliable mechanism for consumers to safely and easily recycle their carpet waste and ensure that instead of going into landfill, this material will be recycled into new carpets as well as other products. I thank Governor Kathy Hochul for signing this crucial legislation, Assemblymember Steve Englebright for his sponsorship in the Assembly, and the many advocates who have worked with us for many years to see this program enacted.” New York State generates about 515 million pounds of carpet waste annually, less than 1% of which are recycled. There is existing demand for more than 90% of the materials in recycled carpets, but government action is needed to spur the creation of systems for collection, transportation and processing of these materials. This legislation also prohibits the sale of carpeting containing hazardous PFAS materials after 2026. PFAS are linked with serious health harms in both children and adults, including impaired neurodevelopment, immune system dysfunction, hormone disruption, and cancer. The extended producer responsibility (EPR) program required by this new law has the potential to increase carpet recycling in New York State to 25% within four years, add hundreds of jobs, and save more than $4 million per year in waste disposal costs. Increasing the recycling rate to 25% would reduce CO2 emissions by about 165,000 tons per year, equivalent to taking 32,000 cars off the road. Kate Kurera, Deputy Director of Environmental Advocates NY said:“Disposed carpet fills up New York landfills at the rate of 515 million pounds per year, and not to mention, often contains dangerous PFAS chemicals that exposure our families and children within the home. This legislation meaningful addresses both of these problems, while importantly requiring the producers of the carpet to take responsibility for the environmental impacts of the products end of life. We commend Governor Hochul for signing this bill and Senator Kavanagh and Assemblymember Englebright for their leadership in establishing this program,” Julie Tighe, President of the New York League of Conservation Voters said:“We must stop using harmful chemicals and tossing everything in the trash, and instead move toward a circular economy and zero waste. Thanks to Governor Hochul, Senator Kavanagh and Assemblyman Englebright, New York is taking steps to clean up the carpet industry from production to disposal. The Carpet EPR bill moves the state one step closer to zero waste, promotes the circular economy, and cuts forever chemicals out of carpets in our homes and workplaces–that’s a win for the environment and for public health. We applaud Governor Hochul for signing this NYLCV 2022 Scorecard bill into law and Senator Kavanagh and Assemblyman Englebright for getting it through the legislature.” Resa Dimino, Managing Partner with the Signalfire Group said:“We are very pleased to have been a part of the team that brought this impactful new policy to life in New York. We are grateful to Senator Kavanagh for his leadership and dedication. Thanks to this carefully crafted bill, we’ll be creating jobs, providing feedstock for new products, and reducing greenhouse gasses through carpet recycling, instead of letting all those valuable materials go to waste.” Eric A. Goldstein, NYC Environment Director at the Natural Resources Defense Council said:\"This new law promises to deliver less carpeting sent to problematic landfills and incinerators, more carpet recycling, and fewer toxic chemicals in new carpeting. Three cheers for Senator Brian Kavanagh, Assemblymember Steve Englebright, and Governor Kathy Hochul for their leadership and for resisting plastics industry pressure to weaken the bill in the final, frenzied negotiations. The legislation should also save millions of dollars a year in reduced carpeting collection and disposal costs for city taxpayers.” David Bender, Chief Executive Officer of Circular Polymers by Ascend said:“We applaud the NY Legislature and Governor Hochul for the environmental and employment benefits that carpet recycling legislation brings to the Empire State. Circular Polymers by Ascend is excited to recover New York’s disposed carpet and transform it into raw materials that can be used to create new products.” Heidi Sanborn, Executive Director of the National Stewardship Action Council said:“We are delighted that after 12 years of having the only carpet stewardship program in the world, that New York has taken the step to join California in reducing waste, toxics and GHG emissions by ensuring carpet gets recycled. People do not realize that most carpet is made from fossil fuel with added chemicals that can negatively affect human and environmental health. We are delighted to have another big state that not only sees these issues, but now has a plan to address them.” Dawn Timm, Chair of New York Product Stewardship Council said:\"Manufacturer engagement is essential to move the needle on recovery and recycling efforts in New York. Extended Producer Responsibility (EPR) for carpets will help get this difficult-to-handle material out of landfills and into recycling systems. The New York Product Stewardship Council has, and will continue, to support meaningful EPR efforts in New York that deliver financial relief to local government.\" Bob Rossi, Executive Director of the New York Sustainable Business Council (NYSBC) said:“A carpet recycling program in New York will attract recycled carpet manufacturers and create new sustainable jobs in New York. The raw materials recovered from carpet recycling will provide plastic feedstock for new textiles and other products. This initiative is essential to building a circular economy and is projected to save taxpayers and businesses millions of dollars per year in disposal costs. New York State has the potential to become a national if not global leader in carpet recycling. Our business community applauds Governor Hochul for signing the Carpet EPR bill into law.” -30-","filter_flag":1}
{"title":"Determining factors in shaping the sustainable behavior of the generation Z consumer - Frontiers","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTA5NjE4M9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTA5NjE4M9IBAA?oc=5","id":"CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTA5NjE4M9IBAA","guidislink":false,"published":"Thu, 05 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=5, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=5, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTA5NjE4M9IBAA?oc=5\" target=\"_blank\">Determining factors in shaping the sustainable behavior of the generation Z consumer<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Determining factors in shaping the sustainable behavior of the generation Z consumer - Frontiers","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTA5NjE4M9IBAA?oc=5\" target=\"_blank\">Determining factors in shaping the sustainable behavior of the generation Z consumer<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","source.href":"https:\/\/www.frontiersin.org","source.title":"Frontiers","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Results and Discussion: The results show that there is a positive relationship between both the sustainable behavior of Generation Z consumers and the satisfaction it conveys to them, as well as their environmental protection activities. However, there is no relationship between the sustainable behavior of Generation Z consumers and the green marketing practices of the organizations, environmental issues and their identification with the environmentally responsible consumer. Methods: The research aims to determine the profile of the Generation Z consumer, in order to adapt the strategic actions of the government or organizations to direct and educate as objectively and efficiently as possible towards adopting the principles of ecological, sustainable and responsible consumption. Based on the data collected through a survey, we analyzed the sustainable behavior of Generation Z consumers studying at Romanian universities where there are specializations in this field. The research is quantitative, using structural equation modelling with partial least squares (PLSSEM) to test the hypotheses regarding the relationship between the determining factors and the sustainable behavior of Generation Z consumers. Introduction: Organizations currently emphasize green marketing strategies by implementing marketing practices, aiming to design, produce, promote and sell green products. Thus, both consumers and producers have turned their attention to the category of environmental friendly products, taking into account that the concept of green marketing is now being given greater importance. Responsible organizations have begun to adapt their strategies in production, promotion and interaction activities with consumers or potential consumers of organic products in the context we are going through, when environmental protection becomes an imperative. Analysis of the sustainable behavior of Generation Z is a determining factor from the perspective of the task that this generation will naturally take on, in terms of environmental responsibility. 1 Introduction The activity of Green Marketing (GMk) has a relatively recent history in the consumers’ perception and consciousness, in many cases the real evaluation of this concept causes confusion regarding its meaning. Thus, the implementation of GMk principles emerged in the 1970s from the need to educate the consumer towards a mindset favoring responsible consumption and environmental protection by adopting specific measures (Andronie et al., 2019). Among the first definitions of this concept, we can see an approach to the field from both a positive and negative perspective, showing that there are activities which contribute to the environmental pollution, consumption of energy resources, but also non-energy resources (Polonsky, 2011). GMk was defined as a complex product including improvement activities, pricing strategies, promotion policies and distribution methods which do not harm the environment (Saha and Darnton, 2005), instead, through the activity of product marketing, are safe for the environment (Xie et al., 2015). In this context, GMk goes beyond the simple promotion of products or services with a green component. It is considered a field which has been long-researched but still insufficiently understood, and the possibility that this marketing concept can make a relevant and impactful contribution to society brings the need to focus more on major changes in thinking and practice (Peattie and Crane, 2005). The mission to concretely define what GMk represents takes into account the numerous perceptions reflected in the literature. One understanding is that GMk sums up a wide range of processes, including product modification, production stages, packaging and promotion (Polonsky, 1994). In direct proportion to the importance given to the care of environmental sustainability, over time, the understandings regarding the approach to the concept of GMk have been very different (Dangelico and Vocalelli, 2017). Thus, the emphasis was placed on GMk policies which helped companies to identify new market niches and new consumer segments, by incorporating new visions and trends into their marketing process and strategy. In this context, organizations increasingly focused on the segment of green consumers, namely the consumers concerned with environmental protection and their own health (Pavan and Payal, 2012). In addition, because people are more and more willing to invest in the purchase of green products, the market includes them more (Ștefănică et al., 2020). The various objective reasons for this type of behavior relate to the concern for one’s own health, responsibility towards the environment and towards other people, the increasingly varied knowledge which consumers begin to acquire either through their own research in the market or in specialized publications, or through media channels, other categories of consumers or other sources of information. In the current activity of manufacturers or service providers, GMk can bring safe and long-term benefits, at the cost of observing the principles of quality management, primarily by being oriented to the customers and their needs. During the process of customer loyalty, in addition to the production and service delivery process, the provider manages to carry out an activity of education of the beneficiaries, by offering advantageous alternatives in terms of method, procurement time, method of use or price. Consequently, GMk is a concept which we meet both in the case of consumer and industrial goods, and we also find it in the service area, when more and more destinations try to promote themselves through activities provided to customers with a very small negative environmental impact, such as ecotourism (May 1991; Troumbis, 1991). Research shows that GMk brings with it particularities in behavior or purchasing intention, the actual purchasing behavior in the case of green products being influenced by a multitude of factors (Groening et al., 2018). Generation Z and their behavioral patterns regarding the purchasing and consumption of green products according to gender have been insufficiently addressed as a main theme in specialized analyses. The literature review shows that there are experimental studies indicating major differences between the ways of making purchasing decisions in women and men (Yang and Wu, 2007), or differences among men of different generations (Brosdahl and Carpenter, 2011). The field of purchasing behavior for Generation Z representatives lacks analyses to show significant details or validated studies, especially since this category of consumers have different purchasing styles compared to past generations. In this context, in-depth research is needed, an aspect also substantiated by Bakewell and Mitchell (2003), who pointed out the research gaps in this direction and the need to start and support them. Therefore, this study aims to bring more information in the field of GMk, especially since it is focused on an analysis of the factors highlighting the purchasing differences of Generation Z consumers for green products. Considering the issue analyzed, this paper is organized in the following sections: introduction, literature review and development of research hypotheses, research methodology, results, discussions and conclusions. 2 Theories and hypotheses 2.1 Green marketing practices and generation Z consumers In recent years, GMk has occupied an increasingly extensive field in the practice of organizations and in the research fields of specialists due to the need for awareness of the importance which environmental practices should have in the strategy of organizations (Mukonza et al., 2021). The trend in the intentions of orientation towards the GMk activity of the organizations is to increase and integrate the vast activity into the overall management strategy. The promotion and practice of green consumerism can be supported by including in the strategy the relevance of sustainability and eco-innovations in this sector (Sarkar, 2012). Currently, a real promoter of GMk culture is Generation Z, which is at an intersection of decisions regarding GMk practices, not having a relevant benchmark in previous generations and being the actual generation with responsible behavior regarding environmental protection. Considering that Generation Z is represented by the category of individuals born in the period 1990–2000, who from the point of view of their inclusion belong to a certain typology of consumers, they present obvious particularities, derived from the periods they crossed. These particularities are very well reflected in the purchasing behavior and the attitude towards specific concepts, in general, behavior marked by the following characteristics: the intention to innovate, the need for convenience, the search for security of any type and manifestations of escape from previous customs (Wood, 2013). Generation Z has also been called the Post-Millennial Generation (born between 1997–2012) (Loria, 2018) or IGen (Bromwich, 2018). This generation is considered the engine of innovation and change, being a huge challenge for the marketing of any organization (Wood, 2013; Morgan, 2016). The representatives of Generation Z consumers are generally more informed, and in particular, analyzing their degree of information in relation to the concepts of GMk and Green Marketing Practices (GMkP), it is obvious that there is a balance of the weights held by the information regarding GMk and GMkP, with advantageous fluctuations in certain periods for GMk. The explanation is easily observable and deductive from considerations related to age characteristics: the use of technology, the influence of the media, of social networks, the responsible behavior which young people take from those around them but without updating the information directly, and consequently, in certain circumstances, GMkP are not known, implicitly adopted, in their entirety (Bhavana and Thiruchanuru, 2018). Generation Z consumers are characterized by the tendency to avoid the agglomeration of information, by focusing not only on the factors concerning them directly, the lack of time or experience, they are focused more than other generations on the concepts of green, sustainable, ecological, and have several social and ecological objectives (Kılıç et al., 2021). Thus, experienced retailers can use prospects or actual consumers as a competitive advantage in capturing representatives of Generation Z, capitalizing on the attributes of this generation, one of the most important being the interest and access to technology (Dospinescu et al., 2019). Consumer training can be done through smart sale applications, through which young people can be informed in making correct purchasing decisions (Priporas et al., 2017). The young people of Generation Z grew up in an environment where the population was aware of the importance of environmental responsibility, with school hours specifically allocated to this subject and with natural recycling skills, perspectives predicting a strict future approach to this generation regarding GMk and GMkP (Líšková et al., 2016). Generation Z is assaulted daily in this information age we are going through by diverse pieces of information, coming from all environments, sometimes difficult to filter from the point of view of importance, which is why the concept of GMk is part of the category of notions which need to be explained, and later correctly understood by young people (Tamer and Popescu, 2016). Generation Z consumers inform themselves and are also informed about the concepts of GMk and GMkP, as they are an integral part of marketing and communication strategies of the companies. Generation Z is a generation formed in the context of the large-scale existence of environmental practices and is aware of environmental threats and their effects, being aware of the concepts of GMk and GMkP since primary school (Lerch, 2020). Attitudes related to green marketing are a natural component of the daily life of Generation Z, namely through recycling activities, use of energy efficient devices, purchase of environmental friendly products and food. According to this dimension resulted from the literature, the research hypothesis tested in our study is the following: Hypothesis 1 (H1). There is a direct and significant relationship between the GMkP of organizations and the sustainable behavior of Generation Z consumers. 2.2 The attitude of generation Z consumers towards environmental protection under the influence of GMkP Currently, GMkP have become a constant and a normality of our life, representing a tool to protect the environment. Consumers have become much more informed, advised through the campaigns of the organizations, and they are willing to allocate a larger budget for the purchase of green products. In this context, GMk creates new markets and implicitly new jobs (Yazdanifard and Mercy, 2011). Thus, GMkP transposed into company activities, including through their reflection in activities aimed at corporate social responsibility (CSR), later become practices assimilated by the population. Environmental protection is promoted by the efforts of the companies to produce, promote, distribute and price a product or service in accordance with GMkP (Polonsky, 2011). The way in which green marketing was promoted over time consisted of multiple improvements, practices or innovations, which were subsequently brought to the attention of customers or potential customers (Cherian and Jacob, 2012). These green practices consisted in processes, promotion, branding and communication activities, packaging, and supply chain, all fitted to protect the environment. Through these measures, consumers implemented GMk measures in their purchasing and consumption behaviour, and implicitly in environmental protection (Suki and Suki, 2019). Nguyen’s research (2021) illustrates the opposite of what was mentioned above, stating that there are representatives of Generation Z who are not influenced by GMkP measures adopted by companies, therefore, the intention to purchase green products is very rare, random or absent. According to the source of information and the manner of transmission of information regarding GMkP of the organizations, the attitude and behavior of Generation Z consumers regarding the active assimilation of these practices may vary as a form of manifestation. There are effective strategies for GMkP communication in the organizations, compatible with the profile of Generation Z representatives, as well as less inspired channels through which this information is attempted to be transmitted. Sometimes companies fail to convey enough information through their own campaigns regarding the way in which the products or services offered are compatible with the consumer’s vision of environmental protection. Generation Z exponents are also strongly influenced by the reputation of a company, by the information available on product packaging, by the use of symbols and specific terminology (Smith and Brower, 2012). Nadanyiová and Gajanová (2018) identified the benefits of organizations using green marketing principles and communicating them through multiple channels of information. According to this study, among all the age groups, Generation Z is the most interested category in getting involved in activities to protect the environment, an initiative which confirms the fact that organizations use effective channels or sources to transmit information about GMkP. They positively shaped the trend of millennials’ involvement in the purchase of green products and involvement in activities of environmental protection by saving water, energy and by recycling. Consequently, we can see that Generation Z has particularities in terms of consumption behavior, the choice of green products, principles or particular reasoning compared to other generations, so that both manufacturers and retailers take these aspects into account when choosing their own GMkP. In this context, there is a certain generational approach, often used in the development, promotion and sale of this particular category of products, i.e., green products (Dabija et al., 2020). GMkP are a support tool in choosing and maintaining consumption habits, but they can also be a determining factor of environmental protection activities or of the choice of green products. Studies indicate changes in the attitude and behavior of Generation Z, who, unlike the generation before them, seems to be oriented towards a behavior with a tendency to stability, both in terms of choosing a job and in terms of habits (Reiners, 2020). Thus, we can state that nowadays the GMkP of organizations, including related products or services, are much easier to transmit and receive by Generation Z consumers, because, as the existing research proves, this generation is the first to naturally realize the importance of the environment, of specific consumption, of adopting a certain behavior or type of consumption, which encourages companies to insist on the implementation of specific green marketing practices (Naidu et al., 2020). Moreover, Generation Z is the first generation born and raised in the era of technological development, focused on digital components and with a strong identity belonging to technology (Singh and Dangmei, 2016), a generation who will bring multiple changes, including on the labor market. The distinct style of behavior, attitudes, preferences, reactions to the marketing moves of the companies regarding green practices are diametrically opposed to those of the previous generation. Compared to Generation Y, Generation Z seems to be less motivated by the financial component or by marketing strategies involving discounts, promotions, sales, instead emphasizing quality (Schawbel, 2014). For this reason, a campaign tailored to the behavioral characteristics of this generation can be successful, having the advantage of being directed towards an informed, pragmatic generation oriented towards a high quality of life. According to this dimension resulted from the literature, the research hypothesis tested in our study is the following: Hypothesis 2 (H2). There is a direct and significant relationship between the environmental protection attitude and the sustainable behavior of Generation Z consumers. 2.3 Generation Z consumers’ perceptions of environmental issues Environmental issues are a significant source of concern for many people around the world (Stefănică et al., 2020), regardless of the consumer generation they belong to. Among them, for the representatives of Generation Z, climate change, pollution or loss of natural resources are at the top of the list of vital challenges of our time (Barbiroglio, 2019), which led them to mobilize and organize school strikes by which young people demanded specific actions to improve environmental problems. According to the results of the research conducted by Kamenidou et al. (2019), global warming and air pollution seem to be the most pressing problems, because they can lead to the extinction of species or the appearance of serious diseases. In this sense, there are recent studies (Bailey et al., 2022; Schwartz et al., 2022) linking environmental events such as temperature extremes, air pollution, flooding, and sea level rise to various mental health issues, including difficulties in social relationships, anxiety, depression (Reyes et al., 2021), recorded especially among young people. Air pollution and food safety concerns increased also the awareness of environmental issues for Generation Z consumers in Taiwan (Chen et al., 2018). Contrary to the results of previous research works, which demonstrate that the youth of Generation Z are aware of the seriousness of environmental issues and their influence on consumption, a study conducted by Jürkenbeck et al. (2021) divides this cohort into three different segments in terms of climate change awareness. However, the results show that of the nearly 1500 young people included in the sample, half are very aware of climate change, nearly 30% recognize climate change, but consider that the risks are relatively low, while 13.90% of respondents deny the existence of climate change. According to Singh and Dangmei (2016), Generation Z consumers are very concerned about environmental issues, very aware of looming shortages, indicating that they have a high degree of responsibility towards natural resources. Hidayat and Hidayat (2021) mention that the majority of Generation Z shows deep concern about the negative implications of a development which exploits nature, unbalanced ecosystems and human ignorance of environmental sustainability. Generation Z consumers are more willing than older generations to engage in environmental activism, such as volunteering and donating money to environmental causes. In order to meet the demands of Generation Z consumers, companies will need to adapt their green marketing strategies to fulfil consumers’ sustainability expectations, considering that this group of consumners is much more informed than the other generations, with more knowledge about sustainability and concerned about environmental issues, willing to pay more for green products, implicitly organic, healthier food (Su et al., 2019). According to this dimension resulted from the literature, the research hypothesis tested in our study is the following: Hypothesis 3 (H3). There is a direct and significant relationship between the perception of environmental issues and the sustainable behavior of Generation Z consumers. 2.4 Identification of generation Z with the green consumer According to specialized studies, consumers of environmental friendly products have their own, separate characteristics compared to non-consumers of green products. Generations X and Z seem to be much more concerned with everything related to green consumption, the practices of manufacturing companies or traders influence the attitude and size of consumption (Bhavana and Thiruchanuru, 2018). GMkP mainly include green marketing strategy, communication and promotion channels, price and quality offered. Regarding the gender-related consumption behaviors, specialists state that there are major differences in terms of attitude, purchasing and consumption behavior between men and women, influenced by marketing practices. Women consciously buy and consume green products more than men, they are receptive to recommendations coming from people they know or from marketing practices of organizations ((Zhao et al., 2021)). At the same time, Generation Z is guided and oriented towards everything that means the digital age, preferring online payments instead of printed invoices, they do not approve of waste, and they are willing to pay extra for the purchase of green products (Ahmad and Omar, 2018). Green advertising captures buyers emotionally, and the purchasing decision process in the case of female consumers from Generation Z is influenced to a greater extent than in the case of male consumers, preferring green products, their labelling, the information presented on the product packaging, and their recyclable quality (Narula and Sabharwal, 2016). Generation Z values quality more than previous generations. Most of the time, this group of consumers makes purchases based on their own beliefs and marketers start to earn their trust and loyalty as early as possible. Studies indicate that the women from this generation are the ones who purchase goods or services for the most part and marketing strategies are more focused on this aspect (Williams and Page, 2011). In addition, individual behavior is not always correlated with their perception of environmental components or green consumption, the latter being negative, in most cases discrepant with personal perceptions of the concepts as a whole (Deliana and Rum, 2019). Generation Z is an informed, practical generation, oriented towards healthy consumption, and in terms of gender differences in the purchasing process, the female gender outranks, both in terms of consumption and the orientation towards purchasing green products, men being less interested than women in the environment and implicitly in such products (Diamantopoulos et al., 2003). Some research works demonstrate that women are more attentive to environmental issues, purchasing and consumption of green products (Campbell-Arvai et al., 2012; Kamenidou et al., 2019), also local green products, from moral, ethical and economic considerations and factors (Bumbac et al., 2020). Generation Z avoids the waste of green food, compared to previous generations, and in terms of gender differences and sustainable consumption behavior, research works confirm the hypothesis that women show a greater degree of rational, responsible consumption of green products than men, having concerns and tendencies to reuse or recycle more (Bulut et al., 2017). Another research found significant gender differences in relation to the perception of Generation Z consumers according to gender, and this time there were higher percentages of women regarding the attitude and consistency of the act of purchasing (Lorincová et al., 2019). In conclusion, although the purchasing power of Generation Z exceeds that of Generation Y, the rational consumption of the first, makes them allocate a smaller budget to expenses, a situation also reflected in the case of purchasing green products (Kowalska et al., 2021). According to this dimension resulted from the literature, the research hypothesis tested in our study is the following: Hypothesis 4 (H4). There is a direct and significant relationship between the degree of identification with the green consumer and the sustainable behavior of Generation Z consumers. 2.5 Behavior of generation Z consumers in purchasing a green product Social behavior indicates for the representatives of Generation Z different behaviors and preferences regarding consumption and the manner of making purchasing decisions (Puiu, 2016). Although people are aware of the need to protect the environment, including through the behavior adopted when purchasing green products, sometimes a lack of responsible behaviour is manifested through specific actions (Hicks and Hicks, 2003). Even if Generation Z has a green consciousness, in certain periods they lack motivation, which prevents the millennials from putting into practice the spirit required (Gómez-Román et al., 2020). The purchasing behavior of a green product is also reflected in the way in which people feel correctly and completely informed about everything that the purchasing process entails. Ever since the last century, the need of efficiency by simplifying information activities has been reiterated (Herberger, 1975), and it is currently practiced with very good results in terms of the sale volume of green products. Thus, any purchasing behavior of a green product will be modified for the benefit of society (Gierszewska and Seretny, 2019). The green purchasing behavior of Generation Z representatives will increase when individuals operate personally and professionally in a predominantly green environment. Thus, we can see that the purchase of green products is increasingly frequent and sometimes a little encouraged by the development of technology (Jaciow and Wolny, 2021). In correlation with the principle of quality management and customer orientation, respectively, the companies producing or supplying green products and services supported directly or through outsourcing the research to identify as faithfully as possible the profile of the consumer, including their gender. Thus, the results of the study conducted by Davies et al. (1995) in the period 1989–1993 with actual buyers of green products as subjects highlighted that in that period, in relation to the size of purchases of such products and the degree of loyalty, the actual buyers were represented by women in the 30–45 age category, with children, and above average financial resources. Irianto (2015) and Bojkovska et al. (2017) demonstrated the tendency of women to purchase green products, their orientation towards protecting the environment and their own health as well as that of their family, while Hojnik et al. (2019) did not capture gender differences. The previously mentioned research works show us a predominant similarity of behavior in female consumers with regard to consumers both representatives of Generation Z and those of previous generations, and the higher degree of receptivity to purchase green products, compared to male consumers. Thus, it was found that there were attempts to define the profile of the consumers of green products according to their purchasing behavior, materialized in price acceptance, loyalty to the brand, or curiosity towards new products (Shrum et al., 1995). The purchasing and consumption decision among Generation Z representatives for green products is analyzed from several perspectives (economic, legal, ethical) (Pelikánová and Hála, 2021). Generation Z keeps more informed than other generations, choosing mainly the mass media as a source of information (Choi et al., 2021). Although the previously mentioned research works and those conducted by other authors (Shwetha, 2019) reflect an interest of Generation Z towards purchasing green products, concern for renewable energy, sustainability initiatives, this phenomenon cannot be extrapolated on a large scale to Generation Z to a high extent, as we are currently also facing negative phenomena regarding the purchasing and consumption behavior of young people, reflected in the massive food waste, and the lack of a green behavior (Kymäläinen et al., 2021). A research work conducted at the end of 2020 on the youngest representatives of Generation Z illustrates that, relative to gender, young men know more details and have more information and knowledge about green products and concepts, obtained in a proportion of over 50% from the Internet and social media (Guzel, 2020). In this sense, it is important that producers and traders stimulate through specific ways of promotion the responsible behavior of young people, regardless of gender, of positive perceptions towards green products and sustainability (Mohd Suki, 2013). When purchasing green products, consumers mainly request information about the nutritional value and the content of chemical residues, and the concern for one’s own health, the environment or the growth of the economy leads to the purchase of such products (Tsakiridou et al., 2008). The analyses performed so far in an attempt to identify the particularities in the purchasing process specific to Generation Z have divided opinions in this field. Thus, we can consider that the phenomenon of purchasing green products is mainly a generational characteristic (Eastman and Liu., 2012) or, on the contrary, it is less relevant than the research of preferences, implicitly segmenting consumers according to gender, income and education (Meredith and Schewe, 2003). It is also necessary to study Generation Z and its representatives, respectively, as carefully as possible in order to approach effective marketing strategies. It is necessary to identify the purchasing behavior of green products for this generation in order to be able to discover the motivations determining these behaviors (Young and Hinesly, 2012; Parment, 2013). According to this dimension resulted from the literature, the research hypothesis tested in our study is the following: Hypothesis 5 (H5). There is a direct and significant relationship between the willingness to purchase a green product and the sustainable behavior of Generation Z consumers. 2.6 Role of sustainable behavior in environmental protection and the satisfaction of the generation Z consumer 2.6.1 Sustainable behavior of generation Z consumer The severity of environmental problems, as well as global awareness of the balance between economic development and environmental conservation led consumers to adopt sustainable lifestyles and accept sustainable consumption patterns (Su et al., 2019). Thus, changing consumer lifestyles, environmental pollution and the determination to improve the quality of life have become prerequisites for new generations to take environmental criteria into account when making choices or making decisions. In this sense, the representatives of Generation Z present different behavior models, being interested not only in the present, but also in the future impact of their actions, they show a greater interest in actively participating in social issues, as well as an increased responsibility (Song et al., 2020). Generation Z consumers are known as the most socially aware and responsible, with responsible consumption, self-care and environmental care (Barber et al., 2009), they are highly motivated (Calk and Patrick, 2017), predominantly engaged in a specific consumer culture due to technological progress and innovations. There are stereotypes indicating the existence of prejudices according to which female consumers are predominant in the panel of purchasers of green products, due to the fact that this type of purchase is associated more with a female attribute (Brough et al., 2016). Contrary to the results of previous studies, the research conducted by Parzonko et al. (2021) showed that Generation Z representatives in Poland are less involved in pro-environmental behaviors than people from previous generations. In general, their sustainable behavior is based mainly on economic factors which bring financial benefits and is reflected in actions such as choosing public transport as a basic means of transport, turning off the lights when leaving a room or those imposed by legal regulations. According to this dimension resulted from the literature, the research hypothesis tested in our study is the following: Hypothesis 6 (H6). The sustainable behavior of Generation Z consumers has a positive and significant influence on environmental protection. 2.6.2 Environmental protection and green consumer satisfaction The effective management of the environmental protection activity is a long, expensive phenomenon, not at all easy to implement, which involves all categories of the resources of an organization, but with very positive results, benefits and perspectives for the environment (Ştefănică and Butnaru, 2019). Purchasing behavior, responsible consumerism practices and environmental protection attitude of Generation Z consumers were the subject of interest in the research conducted by Walters (2021), Võ (2019) and Gajda (2020). Many of the recent research works in the field gather representatives of Generations Y and Z in the sample, in order to identify purchasing attitudes regarding green products, awareness of environmental issues, information held about the concepts of GMk and GMkP, elements which indicate that there are many similarities of behavior regarding the representatives of the two generations, who want to be informed how to ensure the consumption of healthy products in the family so as to meet the requirements of environmental protection (Chandra, 2019). It is certain that we can identify behaviors illustrating young people’s positive perception of the importance of environmental protection through activities such as recycling, selective collection and purchase of energy efficient equipment (Hansmann et al., 2006; Aizawa et al., 2008). Considering these aspects, Anders (2021) believes that Generation Z is the one who will dictate many of the future directions and strategies of companies, including the trends in the labor market. Therefore, green marketing practices influence the behavior of Generation Z consumers regarding the adoption of environmental protection activities, given the role of the constant transmission of practices and the highly effective targeted manner, on all channels and through all the means to which Generation Z exponents have access. Similarly, the authors Dabija et al. (2020) state that members of Generation Z express a very strong interest in sustainable development and social responsibility and tend to get involved in environmental protection activities, because they bring them great satisfaction (Stefănică and Sandu, 2019). The conclusions of Witek and Kuźniar (2020) place the female population in a superior position in terms of receptivity to green consumer quality, being prone to pay a higher price and having an important concern for environmental protection. According to this dimension resulted from the literature, the research hypothesis tested in our study is the following: Hypothesis 7 (H7). The sustainable behavior of Generation Z consumers has a positive and significant influence on their satisfaction. Figure 1 shows the theoretical model regarding the relationship between the sustainable behavior of the consumer based on the determining factors influencing this behavior with an impact both on the environmental protection and on the green consumer satisfaction. FIGURE 1 FIGURE 1. Theoretical model regardingthe green consumer’s profile. The theoretical model proposed is based on the research conducted by Bhatia and Jain (2014), Shiel et al. (2020) and Gelderman et al. (2021) regarding green marketing practices, consumer’s perception and preferences for environmental friendly products, also sustainable development and responsible consumption behavior. Starting from these studies, our article proposes testing 7 research hypotheses, formulated on the basis of the 8 dimensions and 57 research items validated in the studies conducted by Bhatia and Jain (2014), Shiel et al. (2020) and Gelderman et al. (2021). 3 Methodology This research is designed as a quantitative study aiming to investigate the relationship between the determining factors and environmentally responsible behavior of Generation Z consumers, as well as the relationship between the sustainable behavior of the members of this particular group and environmental protection and green consumer satisfaction. The first approach is to estimate a model to test the relationships between GMk practices, environmental protection attitude, environmental issues, identification with the green consumer, and the purchase of green products and the sustainable behavior of Generation Z consumers. The second approach involves testing the relationships between the sustainable behavior of Generation Z consumers and the environmental protection, and the degree of satisfaction of the green consumer, respectively. In this analysis, we used structural equation modelling using the least squares method (PLS-SEM) (using IBM SPSS AMOS 23), to test the statistical hypotheses formulated, also to estimate the relationships between endogenous and exogenous variables. The quantitative approach was performed by investigation, using a questionnaire with 33 questions as a data collection tool, resulting in 784 completed questionnaires with valid answers. The questionnaire was developed according to the dimensions validated by the studies conducted by Bhatia and Jain (2014), Shiel et al. (2020) and Gelderman et al. (2021). In addition, our research tool includes 6 dimensions (green marketing practices–PGMk 1-8, environmental protection attitude–APM 1-6, environmental issues–PM 1–10, green consumer identification–CV 1–11, green product purchase–APE 1-4, environmental protection–IPM 3–4) which were validated by Bhatia and Jain (2014), one dimension (sustainable consumer behavior–CPE 1–10) validated by Shiel et al. (2020) and one dimension (green consumer satisfaction–SCV 1–6) validated by Gelderman et al. (2021). Therefore, there are 8 dimensions and 57 validated items. The respondents are students from university centers in Romania, aged between 18 and 29, coming from an urban environment. We chose to study the perception of young people of Generation Z primarily because it has been studied relatively little so far, and because more and more young people are concerned about environmental protection (Võ, 2019; Gajda, 2020; Walters, 2021). In addition, the young people of Generation Z are very interested in sustainable development and social responsibility (Dabija et al., 2020), responsible consumption (Barber et al., 2009), they are motivated in their decision to adopt measures to protect the environment (Calk and Patrick, 2017), which largely depends on their satisfaction as green consumers (Witek and Kuźniar, 2020). Thus, the target group received a link to an online survey made in Google Forms to answer the questions in the questionnaire. The questionnaires were anonymous to ensure the confidentiality and reliability of the data. The measurement scale of the items included a 7-point Likert-type construction, from “totally disagree” to “totally agree”. 4 Results 4.1 The descriptive statistical analysis report Table 1 shows the respondents’ characteristics. Analyzing it, we can see that the majority of respondents who answered the questionnaire are female (71.56%). Most of the respondents come from the urban environment, regardless of their gender. Analyzing the statistical data by age groups, we can see that the respondents who answered the questionnaire are people from Generation Z (age group 18–29 years old), their proportion being 100.00%. Students’ personal incomes, as shown in the table, are mostly under 1000 lei, the equivalent of 200 Euros, i.e., in a proportion of 39.54%.Unlike the personal income, the family income is mostly between 2000 and 4000 lei (between 400–800 Euro). TABLE 1 TABLE 1. Respondents’ characteristics. The results of descriptive statistics are showed in table 2 and they present the mean, median, module and standard deviation of each indicator separately. The mean value of 6.28 shows that the respondents totally agree with the importance of green marketing practices of organizations with a role in the acquisition by the consumer of a sustainable behavior with benefits in environmental protection. Regarding the respondents’ attitude towards environmental protection, they generally agree with the items in the questions (the mean is 5.82). Regarding environmental issues, the people who answered the questionnaire totally agree with the items formulated (the mean is 6.30). The mean value of 4.65 shows that the respondents mostly agree with the statements regarding the identification of the green consumer profile. Regarding the way of purchasing a green product, the mean was 5.48, which means that the people who answered the questionnaire generally agree with the items formulated. The respondents also generally agree with the answers given in the case of environmental protection activities (with a mean of 5.38), also with those regarding consumer satisfaction when consuming green products (the mean is 5.79). The mean of 5.29 shows that the respondents partially agree with the statements regarding the sustainable consumer behavior. The calculation of means for each constructor was done taking into account the values of the data representation scale, which has values between 1 and 7. TABLE 2 TABLE 2. Results of descriptive statistics. 4.2 External models Within this study, we defined 8 constructors, each of them including at least 3 measurement items. The participants were asked to rate each item on a 7-point Likert scale (1-totally disagree and 7-totally agree). We examined the relationship between each constructor and the items using measurement model analysis, consisting of reliability and validity tests. On this basis, we calculated reliability of the items and constructors, and convergent and discriminant validity for the constructor. Constructor reliability allows the evaluation of the consistency of a variable or set of variables in its intended measurement (Straub and Gefen, 2004). Composite reliability and the Cronbach’s Alpha test are used to determine reliability. The data obtained for the Cronbach’s Alpha test are presented in table 3. Analyzing these data, we can say that we are dealing with an excellent consistency, in other words there is a close connection among the items of each constructor. TABLE 3 TABLE 3. Results of Cronbach’s Alpha test. Composite reliability, also identified as constructor reliability, is a measure of internal consistency within a scale of items, being similar to Cronbach’s Alpha test. Its calculation was made using factor loadings. The values of this indicator must be above 0.7. The analysis of the factor loading data for each of the 8 constructors indicates that they are all reliable (the results are shown in Table 4). TABLE 4 TABLE 4. Constructor reliability. To test the validity of the constructors, we used convergent validity and discriminant (divergent) validity. To determine convergent validity, we used the average of the extracted dispersion (Average Variance Extracted-AVE), as suggested in the work of Fornell and Larcker (1981). Its value must be above 0.5 to show that the error value measured is not above the constructor dispersion. The values found for the 8constructors are presented in table 5. TABLE 5 TABLE 5. Convergent validity. As we can see in table 5, all the constructors, except the constructor “green consumer identification”, have values above 0.5. Given that the CR of the constructor is above 0.7 and only the AVE is below 0.5, we can say that the convergent validity of the constructor is adequate (Fornell and Larcker, 1981). Discriminant validity test was performed in this paper to see if one constructor has more variation in measurements than other constructors. To achieve this, we made a comparison between the square root of AVE and the correlation between the constructor and another constructor. The results in table 6 show that discriminant validity was met. TABLE 6 TABLE 6. Fornell-Larcker criterion analysis for checking discriminant validity. If this criterion is not met, then there is a problem with your questionnaire, thus, the items you claim are unrelated are in fact related. 4.3 Structural model analysis To test the hypotheses formulated, we used structural model analysis. This model was used to test the relationships between GMk practices, environmental protection attitude, environmental issues, green consumer identification and green product purchase and the sustainable behavior of Generation Z consumers. In addition, we tested the relationships between the sustainable behavior of Generation Z consumers and the environmental protection, and the degree of satisfaction of the green consumer. Table 7 shows the relationships between the variables and the significance of the relationship. Analyzing these results, we can see that there is no relationship between green marketing practices of organizations, environmental issues and green consumer identification and the sustainable behavior of Generation Z consumers (the β coefficient values are: β = 0.003, β = 0.009 and 0.091, respectively, for a significance threshold of 1%). As a result of these tests, hypotheses H1, H3 and H4 were not validated. Regarding the relationship with the sustainable behavior of Generation Z consumers, we can see that there is a positive relationship, both with the satisfaction it conveys to the consumer and with their environmental protection activities, so that hypotheses H2, H5, H6 and H7 were validated. The explained variation for the model verifies the relationship of sustainable behavior and is R2 = 0.517, while for the relationship between behavior and satisfaction it is R2 = 0.537. The relationship between sustainable behavior and environmental protection activities has a coefficient of determination of R2 = 0.181. TABLE 7 TABLE 7. Summary of the structural model analysis Table 8 in annex A shows the results of the structural model presented in Figure 2 and the relationships among the items. TABLE 8 TABLE 8. Regression Weights: (Group number 1 - Default model). FIGURE 2 FIGURE 2. Structural model. 5 Discussion In this study we used structural analysis (SEM), which tested the following hypotheses: Hypothesis 1 (H1): There is a direct and significant relationship between the GMkP of organizations and the sustainable behavior of Generation Z consumers. With respect to this hypothesis, we found that there was no significant difference in responsible consumption behavior regarding the green marketing practices (β = 0.003, p = 0.896), which means that the null hypothesis is accepted and it can be inferred that green marketing practices do not affect sustainable consumer behavior. So H1 is not supported. This phenomenon is explained by the fact that GMkP is not known and implicitly adopted in their entirety (Bhavana and Thiruchanuru, 2018) even if young people have several objectives related to the social and ecological side (Kılıç et al., 2021). From this point of view, the members of Generation Z have grown up in an environment with a high level of awareness regarding the importance of environmental responsibility. As a result of school education, they learned the benefits of recycling, with a strict future approach, regarding GMk and GMkP (Líšková et al., 2016) concepts that are critical to be correctly understood by young people (Baran et al., 2016). Although the concepts of GMk and GMkP have been known since primary grades (Lerch, 2020), the conclusion of our study shows that GMkP does not affect sustainable consumer behavior. Some studies have shown correlations between GMkP and the behavior of Generation Z through actions that manage to connect with young people’s preferences (Budac, 2014; Dabija et al., 2019; Adisa et al., 2021), as well as the lack of correlations, through the existence of higher expectations among consumers who have less pro-sustainability manifestations (Parzonko et al., 2021). Focusing organizations on creating, recreating, and delivering sustainable practices will help in a time horizon depending on the degree of knowledge of Gen Z consumer behavior, with results regarding the development of sustainable behavior. Hypothesis 2 (H2): This hypothesis was tested using the structural model, and the results show that there is a statistically significant relationship, so that H2 is accepted, proving that there is a relationship between the attitude towards the environment and sustainable consumer behavior. Sustainable consumer behavior is a good reason for increasing responsibility among young people concerned about it. Thus, consumers have implemented GMk measures in their purchasing behavior and implicitly to protect the environment (Suki and Suki, 2019) even though the study by Nguyen (2021) shows that there are representatives of Generation Z whom GMkP measures adopted by companies do not influence. Therefore the intention to purchase green products is rare, random, or non-existent. Our research results differ from these studies, as the findings suggest a relationship between the attitude towards the environment and green consumption behavior. Moreover, some studies emphasize the importance that protecting the environment and sustainable behavior has on the characteristics of Generation Z (Malikova, 2021), both through the awareness and application of purchase decisions and through the implementation of principles aimed at respect for the environment (Noor et al., 2017). Generation Z is aware of the importance of protecting the environment by acting in this direction with increasingly safe and efficient steps. Generation Z has particularities in consumer behavior in choosing green products, which leads manufacturers and retailers to consider the development, promotion, and sale of this particular category of products, namely green products (Dabija et al., 2020). Hypothesis 3 (H3): There is a direct and significant relationship between the perception of environmental issues and the sustainable behavior of Generation Z consumers. This hypothesis was tested using the structural model and the results show that there is not a statistically significant relationship between environmental issues and sustainable consumer behavior (β = 0.009, p = 0.749). The null hypothesis is accepted and can be inferred that the environmental issues do not affect the sustainable consumer behavior (H3 is not validated) even though environmental issues are a significant source of concern for many people around the world (Ștefănică et al., 2020). Moreover, the findings of our study refute to some extent the conclusions obtained by Chen et al. (2018) which show us that in Taiwan the degree of awareness of environmental issues has also increased for Generation Z consumers. Also, Hidayat and Hidayat (2021) showed that the majority of Generation Z youths show deep concern about the negative implications of a development that has consequences for environmental sustainability. However, from a theoretical point of view, the studies initiated still do not directly distinguish a correlation between environmental issues and the sustainable behavior of the analyzed generation (Arora and Manchanda, 2022; Djafarova and Foots, 2022), which determines the identification of some sustainable concerns that Generation Z has, and which can constitute the guarantee that young consumers, through their behavior, will positively influence the quality of the environment. Hypothesis 4 (H4): There is a direct and significant relationship between the degree of identification with the green consumer and the sustainable behavior of Generation Z consumers. This hypothesis was tested using the SEM analysis and it is not validated. There is no relationship between green consumer identification and sustainable consumer behavior and it is supported by the value of the coefficient β = 0.009, with p-value p = 0.749). Therefore, H4 is not validated. The fact that there is no relationship between the identification of the ecological consumer and the sustainable behavior of the consumer, this aspect determines a behavior of individuals (Ștefănică et al., 2021) which is not always correlated with their perception of an ecological consumption behavior, the latter being negative, in discrepancy with personal perceptions regarding the concepts in their entirety (Deliana and Rum, 2019), which confirms the results obtained from our study. So, although the purchasing power of Generation Z exceeds that of Generation Y, it causes Generation Z to allocate a smaller budget for purchasing green products (Kowalska et al., 2021), which confirms that there is no relationship between identification of the ecological consumer and his sustainable behavior. Also, there are studies that address both the concept of the green consumer and that of sustainable behavior, without an automatic connection between the two being strongly highlighted (Casalegno et al., 2022; Casalegno et al., 2022). Although distinctly, Generation Z does not fully identify with a particular sphere of consumption, their decisions are filtered through attention to what constitutes sustainable behavior. Hypothesis 5 (H5): There is a direct and significant relationship between the willingness to purchase a green product and the sustainable behavior of Generation Z consumers. With respect to this hypothesis, we found that there was a significant difference in sustainable consumer behavior regarding the purchase of green products (β = 0.468, p = 0.000), which means that the null hypothesis is not accepted and it can be inferred that the purchase of green products does affect responsible consumption behavior. So H5 is supported. The conclusions of the present study are similar to those obtained by Gómez-Román et al. (2020) showing that although there is an ecological consciousness of Generation Z, in certain periods there is a lack of motivation, which prevents them from putting into practice the spirit necessary for the desire to buy an ecological product. In this sense, studies show us that any purchase behavior of an ecological product will be modified for the benefit of society (Gierszewska and Seretny, 2019), and the ecological purchase behavior of Generation Z representatives regarding the purchase of ecological products will be more frequent (Jaciow and Wolny, 2021). People who are typologically included in Generation Z cohorts manifest and materialize intentions to purchase ecological products, more pronounced than other generations and also in relation to the area of origin (Dąbrowski et al., 2022; Liang et al., 2022). Through the means that countries, organizations, promoters of sustainable consumption will have at their disposal and will use, they will be able to guide Generation Z towards the consumption of ecological products, responsibly and sustainably. Hypothesis 6 (H6): The sustainable behavior of Generation Z consumers has a positive and significant influence on environmental protection. Results show a positive correlation between sustainable consumer behavior and the environmental protection (β = 0.504, p = 0.000). Hypothesis H6 is also validated. The results of our study are not correlated with those obtained in the research conducted by Parzonko et al. (2021) who showed that representatives of Generation Z in Poland are less involved in pro-environmental behaviors than people from previous generations. This aspect is probably due to the fact that representatives of Generation Z show different behavior patterns, and show a greater interest in actively participating in social issues, as well as an increased responsibility towards the environment (Song et al., 2020). Sustainable behavior is included in the panel of possible and very important means of protecting the environment. This practice is also adopted among the representatives of Generation Z, who through their contribution make a major contribution to improving environmental conditions (Chaturvedi et al., 2020; Tran et al., 2022). The behavior of this generation can further guide the behavior of future generations towards the right approach to environmental habits and practices. Hypothesis 7 (H7): The sustainable behavior of Generation Z consumers has a positive and significant influence on their satisfaction. The results show that there is a positive correlation between sustainable consumer behavior and consumer satisfaction. Therefore, there is a positive effect, which is confirmed by the coefficient of the exogenous variable. So, the hypothesis H7 is validated. The positive correlation between sustainable consumer behavior and consumer satisfaction shows that we align with the results highlighted by the studies carried out by Ştefănică and Butnaru (2019), especially since, as Anders (2021) also shows us, Generation Z is the one that will dictate many of the guidelines and strategies future of the companies, including the trends that will manifest themselves on the labor market. A similar opinion is shared by Dabija et al. (2019) who support the fact that the young people of Generation Z express a very strong interest in sustainable development and social responsibility and tend to get involved in actions to protect the environment because they bring them great satisfaction (Ștefănică and Sandu, 2019). Generation Z is more inclined than other generations to purchase ecological products in terms of the satisfaction received (Suchanek and Szmelter-Jarosz, 2019; Cui et al., 2022). This generation is aware of the positive impact and the consistent size of their own and collective contribution to protecting the environment, elements that determine a specific satisfaction. 6 Theoretical contributions, practical implications and future implications This study also brings theoretical contributions, constituting real support for the current and future practical side of all directly or indirectly stakeholders. Both academics and practitioners may use it as a starter for developing future research or designing market policies addressed to this consumer group, Generation Z. The following paragraphs develop these considerations and present in detail our research contribution and value for stakeholders. 6.1 Theotetical contributions In this article, shaped as an extensive documentation and empirical research, we analyzed the elements which complete the profile of the green consumer, aspects related to the behavior of the consumer as a representative of Generation Z, as well as the GMk practices of the organizations in the context of their adaptation to the new requirements of the profile market. The results found confirmed the theories stated by Su et al. (2019), Krasulja et al. (2020), who mention the fact that the profile of the green consumer of Generation Z has different characteristics compared to other generations, because millennials are much more informed, they choose to purchase environmentally friendly products, they are more pragmatic, avoiding to waste food, and the main GMkP activities of the organizations sensitize them and shape their purchasing and consumption behavior of green products. At the same time, although the young age sometimes prevents the young people of Generation Z from converting their opinions and intentions regarding the purchase of green products into actual purchases, due to financial limitations, their attitudes and knowledge can contribute to the formation of an appropriate behavior of purchasing green products and appreciation of GMkP activities of organizations, both for the current generation and for future generations. Generation Z no longer ignorantly considers the green concepts, the characteristics of green products, environmental protection or the methods of preventing pollution through their own activities; this is the generation born in the middle of these transformations, and they assimilated and perceived them naturally. In this context, we can say that the young people of Generation Z are not only the human category who best feels the importance of GMK measures and practices, but can also be the best promoters of these concepts for the previous generations, who to a large extent become more arduously familiar with these elements. Generation Z is educated to desire healthy, green products, but they are trying to identify them at good prices, which is why organizations need to streamline both their production costs and promotion practices, without greatly affecting the final price. Generation Z consumers show concern for the natural environment and this aspect is visible in their behavior and purchase reaction regarding products on the green market. In the consumption profile studied, the focus is oriented from quantity to quality. The practice of a sustainable behavior induces the consumers’ feeling of satisfaction, caused by the awareness of the contribution both to environmental protection and to the practice of a healthy lifestyle, through a suitable diet, with green products. Studies in the field highlight the preponderance of women as purchasers of green products, both for previous generations and for Generation Z. This results in a greater propensity to purchase green products on the part of the women, a fact that should not be confused with the degree of consumption of environmental friendly products related to people gender. It is well-known that in most cases the representatives of the female gender carry out the supply process for the family\/group\/union (Chen and Chai, 2010), an element which confirms the presumption of fair consumption of green products distributed by gender. The attempt to define an absolute green purchasing profile and consumption for Generation Z is still being observed and analyzed, because the reactions, personal implications, affinities, perceptions are not stabilized in order to be able to build a standard profile, but what is clearly reflected until now confirms the fact that we are talking about a more mature, conscious, economical generation, with an emphasis on the principles of a healthy life, in agreement with the norms of environmental protection. The first years of professional activity for Generation Z largely coincided with the onset of the COVID-19 pandemic, which influenced certain components of their natural behavior, given the state of uncertainty experienced, with multiple emotional connotations (Butnaru et al., 2021). The coming years will be able to stabilize the behavior, perception and profile of the Generation Z consumer of green products, including the exact determination of the impact of green marketing practices. The premises are promising, the behavior of Generation Z is currently sustainable, with an emphasis on environmental values and healthy consumption. This study aimed to identify the pattern of behavior and consumption of the young people of Generation Z at present, both in terms of the impact on environmental protection and the satisfaction given by the consumption of green products and the correlation of this pattern with the GMk practices of the organizations. Our article contributes to strengthening the relationship between actual GMk practices targeting Generation Z and research by identifying particular consumption factors. Based on this perspective, the research validates the hypotheses through structural model analysis, while also providing from a theoretical perspective the image reflected in the research of the existing approaches, which must be constantly updated and adapted, in accordance with the ever-changing challenges and trends. We believe that the main research limits are determined by the dynamism of the phenomenon illustrated over time, as well as the flexibility of consumption trends, which means adaptation to changes both by researchers and especially by producers. These limits require a close and uninterrupted collaboration between research and production, with the aim of adapting to the consumption profile of Generation Z. Through further analysis and research, we can contribute to shaping a realistic and current profile, which will come to the aid of researchers and companies, even of consumers of green products in the process of self-knowledge of the determining factors of consumption. 6.2 Practical implications The results of this research, carried out following an extensive and refined collaborative documentation process, can be successfully integrated into the future strategic and operational activity of the main stakeholders that include or follow distinctly in establishing the profile of the target consumer Generation Z: businesses, managers, the academic environment, including consumers. From the managerial perspective, the research presents practical implications because it illustrates how Generation Z relates to environmental issues, the influencing factors in substantiating the purchase or consumption decision, concerns for ecological consumption, and environmental protection. Moreover, it is essential as it partly presents the influence of GMk practices of the companies on the behavior and the desire to involve or support sustainable consumption. These aspects can be taken into account in substantiating operating decisions. Thus, at the managerial level, companies worldwide should adopt ecological strategies and actively implement green marketing practices to promote as best as possible among consumers. On the one hand, it is necessary to know their customers as well as possible, the particularities of their consumption behavior, and the principles and rationales underlying the adoption of sustainable behavior. On the other hand, it is necessary to build a green production system valid for the entire product cycle, continue developing green products and processes, and have green supply chains that integrate as many ecological practices as possible. The field researched is not a static one, it requires systematic updates to get the most current, relevant and easy-to-implement data within the management systems of the actors on the green product market. It is necessary to start innovative, sustainable businesses that incorporate green marketing practices from the planning and design phase, so that a business model that can be replicated and promoted, as a reference for those who want to transform their businesses into green, sustainable ones, and this study can provide some relevant elements of support. At the same time, in supporting such businesses, governments also have an essential role, encouraging this kind of initiative by offering financial and fiscal assistance to promote ecological practices or by implementing a system to protect intellectual property and improving the continuous improvement of environmental standards. 6.3 Future implications This study aimed to identify the pattern of behavior and consumption of the young people of Generation Z at present, both in terms of the impact on environmental protection and the satisfaction given by the consumption of green products and the correlation of this pattern with the GMk practices of the organizations. The academic environment relates to this type of research from a double standpoint: to continue the research of the described phenomenon through the prism of the background substantiated by the authors and the possibility of deepening the topic, and at the same time, from the position of the party that manifests a direct interaction with the representatives of Generation Z, through the possibility of knowing and understanding more effectively the actions of this generation and the foundation of future activity plans, specific to the needs of young people. From the consumers’ perspective, the results suggest that responsible consumption, environmental actions, and awareness may have a significant impact at the individual level and on the environment. It can stimulate Generation Z consumers to perpetuate responsible behaviour and, at the same time, raise the awareness of other generations regarding the consumption of ecological products, leaning towards responsible consumption, paying more attention to GMkP campaigns, and involvement in environmental protection activities. The validity of the results found in this extensive study offers the possibility both to the authors and to other researchers with study interests in this field to continue the analysis from an advanced stage. The future directions allow taking over the results obtained in this ample approach and improving their operationalization in order to build future models of management of GMkP, with impact in modelling the purchasing behavior of the new Generation Z. We are encouraged, following the analyses performed, to deepen the research through further research, not necessarily due to reasons determined by principles or lacunar previous research, but for the permanent needs required by this field of orientation of generational green marketing practices of companies. Data availability statement The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. Author contributions All authors listed have made a substantial, direct, and intellectual contribution to the work and approved it for publication. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References Adisa, I., Adeola, O., and Oparison, A. (2021). Harnessing the potentials of generation green for green marketing success in africa’s emerging economies. Palgrave Stud. Mark. Emerg. Econ. 131, 131–149. doi:10.1007\/978-3-030-73007-9_9 CrossRef Full Text | Google Scholar Ahmad, S. N. B., and Omar, A. (2018). Influence of perceived value and personal values on consumers repurchase intention of natural beauty product. Int. J. Sup. Chain. Mgt 7 (2), 116–125. Google Scholar Aizawa, H., Yoshida, H., and Sakai, S. (2008). Current results and future perspectives for Japanese recycling of home electrical appliances. Resour. Conservation Recycl. 52 (12), 1399–1410. doi:10.1016\/j.resconrec.2008.07.013 CrossRef Full Text | Google Scholar Anders, E. (2021). Generation Z and their perception towards the working environment. Munich: GRIN Verlag. Google Scholar Andronie, M., Gardan, D. A., Dumitru, I., Gardan, I. P., Andronie, I. E., and Uta, C. (2019). Integrating the principles of green marketing by using big data. Good Pract. 21 (50), 258. doi:10.24818\/ea\/2019\/50\/258 CrossRef Full Text | Google Scholar Arora, N., and Manchanda, P. (2022). Green perceived value and intention to purchase sustainable apparel among Gen Z: The moderated mediation of attitudes. J. Glob. Fash. Mark. 13 (2), 168–185. doi:10.1080\/20932685.2021.2021435 CrossRef Full Text | Google Scholar Bakewell, C., and Mitchell, V. (2003). Generation Y female consumer decision-making styles. Int. J. Retail Distribution Manag. 31 (2), 95–106. doi:10.1108\/09590550310461994 CrossRef Full Text | Google Scholar Barber, N., Taylor, D. C., and Dodd, T. (2009). The importance of wine bottle closures in retail purchase decisions of consumers. J. Hosp. Mark. Manag. 18 (6), 597–614. doi:10.1080\/19368620903025014 CrossRef Full Text | Google Scholar Barbiroglio, E. (2019). Generation Z fears climate change more than anything else. Available at: https:\/\/www.forbes.com\/sites\/emanuelabarbiroglio\/2019\/12\/09\/generation-z-fears-climate-change-more-than-anything-else\/. (Retrieved July 25, 2022). Google Scholar Bhatia, M., and Jain, A. (2014). Green marketing: A study of consumer perception and preferences in India. Electron. Green J. 1 (36). doi:10.5070\/g313618392 CrossRef Full Text | Google Scholar Bhavana, A., and Thiruchanuru, S. (2018). Green marketing: Gap analysis in the decision making process of a green consumer. J. Bus. Manag. Soc. Sci. Res. (JBM&SSR) 7 (3), 2319. Google Scholar Bojkovska, K., Dojchinovski, T., Jankulovski, N., Joshevska, E., and Najdovski, B. (2017). Contemporary approaches for consumer segmentation according to the level of ecological responsibility: The case of republic of Macedonia. Food Environ. Saf. J. 15 (2), 155–164. Google Scholar Bromwich, J. E. (2018). We asked generation Z to pick a name. It wasn’t generation Z. Available at: https:\/\/www.nytimes.com\/2018\/01\/31\/style\/generation-z-name.html. Google Scholar Brosdahl, D. J. C., and Carpenter, J. M. (2011). Shopping orientations of us males: A generational cohort comparison. J. Retail. Consumer Serv. 18 (6), 548–554. doi:10.1016\/j.jretconser.2011.07.005 CrossRef Full Text | Google Scholar Brough, A. R., Wilkie, J. E. B., Ma, J., Isaac, M. S., and Gal, D. (2016). Is eco-friendly unmanly? The green-feminine stereotype and its effect on sustainable consumption. J. Consumer Res. 43 (4), 567–582. doi:10.1093\/jcr\/ucw044 CrossRef Full Text | Google Scholar Budac, A.-C. (2014). Strategic considerations on how brands should deal with generation Z. Rev. Econ. 66 (5), 6–14. Google Scholar Bulut, Z. A., Kökalan Çımrin, F., and Doğan, O. (2017). Gender, generation and sustainable consumption: Exploring the behaviour of consumers from Izmir, Turkey. Int. J. Consumer Stud. 41 (6), 597–604. doi:10.1111\/ijcs.12371 CrossRef Full Text | Google Scholar Bumbac, R., Bobe, M., Procopie, R., Pamfilie, R., Giușcă, S., and Enache, C. (2020). How zoomers’ eating habits should be considered in shaping the food system for 2030—a case study on the young generation from Romania. Sustainability 12 (18), 7390. doi:10.3390\/su12187390 CrossRef Full Text | Google Scholar Butnaru, G. I., Haller, A.-P., Dragolea, L.-L., Anichiti, A., and Tacu Hârșan, G.-D. (2021). Students’ wellbeing during transition from onsite to online education: Are there risks arising from social isolation? Int. J. Environ. Res. Public Health 18 (18), 9665. doi:10.3390\/ijerph18189665 PubMed Abstract | CrossRef Full Text | Google Scholar Calk, R., and Patrick, A. (2017). Millennials through the looking glass: Workplace motivating factors | the journal of business inquiry. J. Bus. Inq. 16 (2), 131–139. Google Scholar Casalegno, C., Candelo, E., and Santoro, G. (2022). Exploring the antecedents of green and sustainable purchase behaviour: A comparison among different generations. Psychol. Mark. 39 (5), 1007–1021. doi:10.1002\/mar.21637 CrossRef Full Text | Google Scholar Chandra, S. (2019). A conceptual understanding of Green marketing in the Indian context. Int. J. Commer. Manag. Res. 5 (3), 80–87. Google Scholar Chaturvedi, P., Kulshreshtha, K., and Tripathi, V. (2020). Investigating the determinants of behavioral intentions of generation Z for recycled clothing: An evidence from a developing economy. Young Consum. 21 (4), 403–417. doi:10.1108\/yc-03-2020-1110 CrossRef Full Text | Google Scholar Chen, M.-H., Chen, B. H., and Chi, C. G. (2018). Socially responsible investment by generation Z: A cross-cultural study of Taiwanese and American investors. J. Hosp. Mark. Manag. 28 (3), 334–350. doi:10.1080\/19368623.2019.1525690 CrossRef Full Text | Google Scholar Chen, T. B., and Chai, L. T. (2010). Attitude towards the environment and green products: Consumers’ perspective. Manag. Sci. Eng. 4 (2), 27–39. doi:10.3968\/j.mse.1913035X20100402.002 CrossRef Full Text | Google Scholar Cherian, J., and Jacob, J. (2012). Green marketing: A study of consumers’ attitude towards environment friendly products. Asian Soc. Sci. 8 (12), 117. doi:10.5539\/ass.v8n12p117 CrossRef Full Text | Google Scholar Choi, Y., Kroff, M. W., and Kim, J. (2021). Developing brand advocacy through brand activities on Facebook. J. Consumer Mark. 38 (3), 328–338. doi:10.1108\/jcm-10-2019-3460 CrossRef Full Text | Google Scholar Cui, Y., Lissillour, R., Chebeň, J., Lančarič, D., and Duan, C. (2022). The position of financial prudence, social influence, and environmental satisfaction in the sustainable consumption behavioural model: Cross-market intergenerational investigation during the Covid-19 pandemic. Corp. Soc. Responsib. Environ. Manag. 29, 996–1020. doi:10.1002\/csr.2250 PubMed Abstract | CrossRef Full Text | Google Scholar Dabija, D.-C., Bejan, B. M., and Pușcaș, C. (2020). A qualitative approach to the sustainable orientation of generation Z in retail: The case of Romania. J. Risk Financial Manag. 13 (7), 152. doi:10.3390\/jrfm13070152 CrossRef Full Text | Google Scholar Dabija, D. C., Bejan, B. M., and Dinu, V. (2019). Transformations in business & economics. Int. J. Sch. Pap. 18. 47. Google Scholar Dangelico, R. M., and Vocalelli, D. (2017). Green marketing”: An analysis of definitions, strategy steps, and tools through a systematic review of the literature. J. Clean. Prod. 165 (0959-6526), 1263–1279. doi:10.1016\/j.jclepro.2017.07.184 CrossRef Full Text | Google Scholar Deliana, Y., and Rum, I. A. (2019). How does perception on green environment across generations affect consumer behavior? A neural network process. Int. J. Consumer Stud. 43 (4), 358–367. doi:10.1111\/ijcs.12515 CrossRef Full Text | Google Scholar Diamantopoulos, A., Schlegelmilch, B. B., Sinkovics, R. R., and Bohlen, G. M. (2003). Can socio-demographics still play a role in profiling green consumers? A review of the evidence and an empirical investigation. J. Bus. Res. 56 (6), 465–480. doi:10.1016\/s0148-2963(01)00241-7 CrossRef Full Text | Google Scholar Djafarova, E., and Foots, S. (2022). Exploring ethical consumption of generation Z: Theory of planned behaviour. Young Consum. 23 (3), 413–431. doi:10.1108\/yc-10-2021-1405 CrossRef Full Text | Google Scholar Dospinescu, O., Anastasiei, B., and Dospinescu, N. (2019). Key factors determining the expected benefit of customers when using bank cards: An analysis on millennials and generation Z in Romania. Symmetry 11 (12), 1449. doi:10.3390\/sym11121449 CrossRef Full Text | Google Scholar Eastman, J. K., and Liu, J. (2012). The impact of generational cohorts on status consumption: An exploratory look at generational cohort and demographics on status consumption. J. Consumer Mark. 29 (2), 93–102. doi:10.1108\/07363761211206348 CrossRef Full Text | Google Scholar Fornell, C., and Larcker, D. F. (1981). Evaluating structural equation models with unobservable variables and measurement error. J. Mark. Res. 18 (1), 39–50. doi:10.2307\/3151312 CrossRef Full Text | Google Scholar Gelderman, C. J., Schijns, J., Lambrechts, W., and Vijgen, S. (2021). Green marketing as an environmental practice: The impact on green satisfaction and green loyalty in a business-to-business context. Bus. Strategy Environ. 30 (4), 2061–2076. doi:10.1002\/bse.2732 CrossRef Full Text | Google Scholar Gierszewska, G., and Seretny, M. (2019). Sustainable behavior – the need of change in consumer and business attitudes and behavior. Found. Manag. 11 (1), 197–208. doi:10.2478\/fman-2019-0017 CrossRef Full Text | Google Scholar Gómez-Román, C., Lima, M. L., Seoane, G., Alzate, M., Dono, M., and Sabucedo, J.-M. (2020). Testing common knowledge: Are northern Europeans and millennials more concerned about the environment? Sustainability 13 (1), 45. doi:10.3390\/su13010045 CrossRef Full Text | Google Scholar Groening, C., Sarkis, J., and Zhu, Q. (2018). Green marketing consumer-level theory review: A compendium of applied theories and further research directions. J. Clean. Prod. 172 (1), 1848–1866. doi:10.1016\/j.jclepro.2017.12.002 CrossRef Full Text | Google Scholar Guzel, T. (2020). Generation Z attitudes and preferences about eco-friendly furniture and furnishings. Online J. Art Des. 8 (4), 38–39. Google Scholar Hansmann, R., Bernasconi, P., Smieszek, T., Loukopoulos, P., and Scholz, R. W. (2006). Justifications and self-organization as determinants of recycling behavior: The case of used batteries. Resour. Conservation Recycl. 47 (2), 133–159. doi:10.1016\/j.resconrec.2005.10.006 CrossRef Full Text | Google Scholar Herberger, R. A. (1975). The ecological product buying motive: A challenge for consumer education. J. Consumer Aff. 9 (2), 187–195. doi:10.1111\/j.1745-6606.1975.tb00562.x CrossRef Full Text | Google Scholar Hicks, D. D., and Hicks, D. (2003). Lessons for the future. The missing dimension in education. 1st Edition168 London: Routledge. doi:10.4324\/9780203219331 CrossRef Full Text | Google Scholar Hidayat, Z., and Hidayat, D. (2021). “Environmental sense of gen Z in online communities: Exploring the roles of sharing knowledge and social movement on instagram,” in Proceedings of the 2nd Borobudur International Symposium on Humanities and Social Sciences, Magelang, Central Java, Indonesia, , Bratislava, Slovakia: EAI – European Alliance for Innovation. doi:10.4108\/eai.18-11-2020.2311741 CrossRef Full Text | Google Scholar Hojnik, J., Ruzzier, M., and Konečnik Ruzzier, M. (2019). Transition towards sustainability: Adoption of eco-products among consumers. Sustainability 11 (16), 4308. doi:10.3390\/su11164308 CrossRef Full Text | Google Scholar Irianto, H. (2015). Consumers’ attitude and intention towards organic food purchase: An extension of theory of planned behavior in gender perspective. Int. J. Manag. Econ. Soc. Sci. 4 (1), 17–31. Google Scholar Jaciow, M., and Wolny, R. (2021). New technologies in the ecological behavior of generation Z. Procedia Comput. Sci. 192, 4780–4789. doi:10.1016\/j.procs.2021.09.256 CrossRef Full Text | Google Scholar Jürkenbeck, K., Spiller, A., and Schulze, M. (2021). Climate change awareness of the young generation and its impact on their diet. Clean. Responsible Consum. 3, 100041. doi:10.1016\/j.clrc.2021.100041 CrossRef Full Text | Google Scholar Kamenidou, I. C., Mamalis, S. A., Pavlidis, S., and Bara, E.-Z. G. (2019). Segmenting the generation Z cohort university students based on sustainable food consumption behavior: A preliminary study. Sustainability 11 (3), 837. doi:10.3390\/su11030837 CrossRef Full Text | Google Scholar Kılıç, B., Bekar, A., and Yozukmaz, N. (2021). “The new foodie generation: Gen Z,” in Generation Z marketing and management in tourism and hospitality, Berlin, Germany: Springer, 223–247. doi:10.1007\/978-3-030-70695-1_9 CrossRef Full Text | Google Scholar Kowalska, A., Ratajczyk, M., Manning, L., Bieniek, M., and Mącik, R. (2021). Young and green” a study of consumers’ perceptions and reported purchasing behaviour towards organic food in Poland and the United Kingdom. Sustainability 13 (23), 13022. doi:10.3390\/su132313022 CrossRef Full Text | Google Scholar Krasulja, N., Ilić, D., and Marković, B. M. (2020). Basic principles of circular economy with special focus on sustainable consumption “Y” and “Z” generation. Ecoforum 9 (2), 7. Google Scholar Kymäläinen, T., Seisto, A., and Malila, R. (2021). Generation Z food waste, diet and consumption habits: A Finnish social design study with future consumers. Sustainability 13 (4), 2124. doi:10.3390\/su13042124 CrossRef Full Text | Google Scholar Liang, J., Li, J., and Lei, Q. (2022). Exploring the influence of environmental values on green consumption behavior of apparel: A chain multiple mediation model among Chinese generation Z. Sustainability 14 (19), 12850. doi:10.3390\/su141912850 CrossRef Full Text | Google Scholar Líšková, Z. D., Cudlínová, E., Pártlová, P., and Petr, D. (2016). Importance of green marketing and its potential. Visegrad J. Bioeconomy Sustain. Dev. 5 (2), 61–64. doi:10.1515\/vjbsd-2016-0012 CrossRef Full Text | Google Scholar Loria, K. (2018). Here’s which generation you’re part of based on your birth year — and why those distinctions exist. Available at: https:\/\/www.businessinsider.com\/generation-you-are-in-by-birth-year-millennial-gen-x-baby-boomer-2018-3. Google Scholar Lorincová, T., Ondrijová, I., and Kovaľová, J. (2019). “Personality traits and buying behavior from the viewpoint of selected socio-demographic characteristics – preliminary findings,” in Third International Scientific Conference ITEMA Recent Advances in Information Technology, Tourism, Economics, Management and Agriculture, Bratislava, Slovakia, , Belgrade: Association of Economists and Managers of the Balkans, Belgrade. doi:10.31410\/itema.s.p.2019.99 CrossRef Full Text | Google Scholar Malikova, I. (2021). Perception of global issues of environment and circular economy by generation Z. SHS Web Conf. 92, 05018. doi:10.1051\/shsconf\/20219205018 CrossRef Full Text | Google Scholar Meredith, G., and Schewe, C. (2003). Defining markets, defining moments: America’s 7 generational cohorts, their shared experiences, and why businesses should care. J. Consumer Mark. 20 (2), 172–173. doi:10.1108\/07363760310464622 CrossRef Full Text | Google Scholar Morgan, J. (2016). Generation Z and the 6 forces shaping the future of business. Available at: https:\/\/www.inc.com\/jacob-morgan\/generation-z-and-the-6-forces-shaping-the-future-of-business.html. Google Scholar Mukonza, C., Hinson, R. E., Adeola, O., Adisa, I., Mogaji, E., and Kirgiz, A. C. (2021). “Green marketing: An introduction,” in Green marketing in emerging markets. Palgrave studies of marketing in emerging economies. Editors C. Mukonza, R. E. Hinson, O. Adeola, I. Adisa, E. Mogaji, and A. C. Kirgiz (Cham: Palgrave Macmillan), 3–14. doi:10.1007\/978-3-030-74065-8_1 CrossRef Full Text | Google Scholar Nadanyiová, M., and Gajanová, L. (2018). Consumersʼ perception of green marketing as a source of competitive advantage in the hotel industry. Littera Scr. 1 (1), 102–115. Google Scholar Naidu, M. N., Sonawane, M. S., Mohod, M. A., and Pendam, M. B. (2020). A study of consumers attitude towards green marketing. JournalNX - A Multidiscip. Peer Rev. J. 65, 83–91. Google Scholar Narula, S., and Sabharwal, D. (2016). The oritical study of green marketing in India: Its importance and need. J. Mass Commun. Journalism 06 (08). doi:10.4172\/2165-7912.s2-007 CrossRef Full Text | Google Scholar Nguyen, N. M. D. (2021). Factors influencing Finnish Generation Z consumer behaviors towards green purchase of cosmetics. Available at: https:\/\/www.theseus.fi\/handle\/10024\/493316. (Accessed: November 24, 2021). Google Scholar Noor, M. N. M., Jumain, R. S. A., Yusof, A., Ahmat, M. A. H., and Kamaruzaman, I. F. (2017). Determinants of generation Z green purchase decision: A SEM-PLS approach. Int. J. Adv. Appl. Sci. 4 (11), 143–147. doi:10.21833\/ijaas.2017.011.023 CrossRef Full Text | Google Scholar Parment, A. (2013). Generation Y vs. Baby Boomers: Shopping behavior, buyer involvement and implications for retailing. J. Retail. Consumer Serv. 20 (2), 189–199. doi:10.1016\/j.jretconser.2012.12.001 CrossRef Full Text | Google Scholar Parzonko, A. J., Balińska, A., and Sieczko, A. (2021). Pro-environmental behaviors of generation Z in the context of the concept of Homo socio-oeconomicus. Energies 14 (6), 1597. doi:10.3390\/en14061597 CrossRef Full Text | Google Scholar Pavan, M., and Payal, S. (2012). Green marketing: Challenges and opportunities for business. J. Mark. Commun. 8 (1), 35–41. Google Scholar Pelikánová, R. M., and Hála, M. (2021). CSR unconscious consumption by generation Z in the COVID-19 era—responsible heretics not paying CSR bonus? J. Risk Financial Manag. 14 (8), 390. doi:10.3390\/jrfm14080390 CrossRef Full Text | Google Scholar Priporas, C.-V., Stylos, N., and Fotiadis, A. K. (2017). Generation Z consumers’ expectations of interactions in smart retailing: A future agenda. Comput. Hum. Behav. 77 (1), 374–381. doi:10.1016\/j.chb.2017.01.058 CrossRef Full Text | Google Scholar Puiu, S. (2016). Generation Z – a new type of consumers. Young Econ. J.\/Revista Tinerilor Econ. 13 (27), 67–78. Google Scholar Reiners, B. (2020). A recruiter’s guide to preparing for the gen Z workforce. Available at: https:\/\/builtin.com\/recruiting\/gen-z-workforce (Retrieved February 1, 2022). Google Scholar Reyes, M. E. S., Carmen, B. P. B., Luminarias, M. E. P., Mangulabnan, S. A. N. B., and Ogunbode, C. A. (2021). An investigation into the relationship between climate change anxiety and mental health among Gen Z Filipinos. Curr. Psychol. 1, 1–9. doi:10.1007\/s12144-021-02099-3 CrossRef Full Text | Google Scholar Saha, M., and Darnton, G. (2005). Green companies or green con-panies: Are companies really green, or are they pretending to Be? Bus. Soc. Rev. 110 (2), 117–157. doi:10.1111\/j.0045-3609.2005.00007.x CrossRef Full Text | Google Scholar Sarkar, A. N. (2012). Green branding and eco-innovations for evolving a sustainable green marketing strategy. Asia-Pacific J. Manag. Res. Innovation 8 (1), 39–58. doi:10.1177\/2319510x1200800106 CrossRef Full Text | Google Scholar Schawbel, D. (2014). Gen Z employees: The 5 attributes you need to know. Available at: https:\/\/www.entrepreneur.com\/article\/236560. Google Scholar Schwartz, S. E. O., Benoit, L., Clayton, S., Parnes, M. F., Swenson, L., and Lowe, S. R. (2022). Climate change anxiety and mental health: Environmental activism as buffer. Curr. Psychol. 1, 1–14. doi:10.1007\/s12144-022-02735-6 CrossRef Full Text | Google Scholar Shrum, L. J., McCarty, J. A., and Lowrey, T. M. (1995). Buyer characteristics of the green consumer and their implications for advertising strategy. J. Advert. 24 (2), 71–82. doi:10.1080\/00913367.1995.10673477 CrossRef Full Text | Google Scholar Shwetha, G. Y. (2019). A descriptive study on attitude of generation Z towards green behaviour. Cape Comorin Res. 1 (1), 30–35. Google Scholar Singh, A., and Dangmei, J. (2016). Understanding the generation Z: The future workforce. South-Asian J. Multidiscip. Stud. 3, 1–5. Google Scholar Smith, K. T., and Brower, T. R. (2012). Longitudinal study of green marketing strategies that influence Millennials. J. Strategic Mark. 20 (6), 535–551. doi:10.1080\/0965254x.2012.711345 CrossRef Full Text | Google Scholar Song, Y., Qin, Z., and Qin, Z. (2020). Green marketing to gen Z consumers in China: Examining the mediating factors of an eco-label–informed purchase. SAGE Open 10 (4), 215824402096357–15. doi:10.1177\/2158244020963573 CrossRef Full Text | Google Scholar Ștefănică, M., and Butnaru, G. I. (2019). Some good practices for reducing energy consumption in hotels: A comparative analysis. J. E. U. Res. Bus. 2019, 1–8. doi:10.5171\/2019.985409 CrossRef Full Text | Google Scholar Ștefănică, M., Sandu, C. B., Butnaru, G. I., and Haller, A.-P. (2021). The nexus between tourism activities and environmental degradation: Romanian tourists’ opinions. Sustainability 13 (16), 9210. doi:10.3390\/su13169210 CrossRef Full Text | Google Scholar Ștefănică, M., and Sandu, C. B. (2019). Eco-practices â€“ prerequisite for increasing the environmental performance and the social responsibility in hotel industry. Ovidius Univ. Ann. Econ. Sci. Ser. 21 (1), 546–553. Google Scholar Ștefănică, M., Vodă, A. I., Butnaru, R. C., Butnaru, G. I., and Chirita, M. G. (2020). Ecological purchases made by managers in hotel industry. An approach of the main determining factors. Amfiteatru Econ. J. 22 (53), 1–57. doi:10.24818\/EA\/2019\/53\/57 CrossRef Full Text | Google Scholar Su, C.-H., Tsai, C.-H., Chen, M.-H., and Lv, W. Q. (2019). U.S. Sustainable food market generation Z consumer segments. Sustainability 11 (13), 3607. doi:10.3390\/su11133607 CrossRef Full Text | Google Scholar Suchanek, M., and Szmelter-Jarosz, A. (2019). Environmental aspects of generation Y’s sustainable mobility. Sustainability 11 (11), 3204. doi:10.3390\/su11113204 CrossRef Full Text | Google Scholar Suki, N. M., and Suki, N. M. (2019). “Correlations between awareness of green marketing, corporate social responsibility, product image, corporate reputation, and consumer purchase intention.Corp. Soc. Responsib. 2019, 143–154. doi:10.4018\/978-1-5225-6192-7.ch008 CrossRef Full Text | Google Scholar Tamer, B., and Popescu, C. (2016). Generation Z attitudes toward green marketing: A cross country and gender analysis. Ann. - Econ. Ser. 3, 6–9. Google Scholar Troumbis, A. Y. (1991). Environmental labelling on services: The case of tourism. Ekistics 58 (348\/349), 167–173. Google Scholar Tsakiridou, E., Boutsouki, C., Zotos, Y., and Mattas, K. (2008). Attitudes and behaviour towards organic products: An exploratory study. Int. J. Retail Distribution Manag. 36 (2), 158–175. doi:10.1108\/09590550810853093 CrossRef Full Text | Google Scholar Võ, M. (2019). Engaging generation Z through corporate social responsibility. Available at: https:\/\/www.semanticscholar.org\/paper\/Engaging-Generation-Z-through-Corporate-Social-V%C3%B5\/b8755c39803230384413cabb925753ae9c0a49aa. Google Scholar Walters, P. (2021). “Are generation Z ethical consumers?,” in Generation Z marketing and management in tourism and hospitality, Berlin, Germany: Springer, 303–325. doi:10.1007\/978-3-030-70695-1_12 CrossRef Full Text | Google Scholar Williams, K., and Page, R. (2011). Marketing to the generations. J. Behav. Stud. Bus. 3 (1), 37–53. Google Scholar Witek, L., and Kuźniar, W. (2020). Green purchase behavior: The effectiveness of sociodemographic variables for explaining green purchases in emerging market. Sustainability 13 (1), 209. doi:10.3390\/su13010209 CrossRef Full Text | Google Scholar Wood, S. (2013). Generation Z as consumers: Trends and innovation. Available at: https:\/\/archive.iei.ncsu.edu\/wp-content\/uploads\/2013\/01\/GenZConsumers.pdf. Google Scholar Xie, G.-X., Cavallero, A., Cheng, M., Kahle, L. R., and Gurel-Atay, E. (2015). Communicating sustainability for the green economy. in Reluctant for a reason? A persuasion knowledge perspective on green advertising, 1st Ed. London:Routledge. CrossRef Full Text | Google Scholar Yazdanifard, R., and Mercy, I. E. (2011). The impact of Green Marketing on Customer satisfaction and Envi-ronmental safety. Available at: https:\/\/www.semanticscholar.org\/paper\/The-impact-of-Green-Marketing-on-Customer-and-Envi-Yazdanifard-Mercy\/cb3927334b3e89761d573caaf47cff55c22ec2d6. Google Scholar","filter_flag":1}
{"title":"Hundreds of undersized lobsters found in New York City supermarkets - SeafoodSource","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LnNlYWZvb2Rzb3VyY2UuY29tL25ld3Mvc3VwcGx5LXRyYWRlL2h1bmRyZWRzLW9mLXVuZGVyc2l6ZWQtbG9ic3RlcnMtZm91bmQtaW4tbmV3LXlvcmstY2l0eS1zdXBlcm1hcmtldHPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LnNlYWZvb2Rzb3VyY2UuY29tL25ld3Mvc3VwcGx5LXRyYWRlL2h1bmRyZWRzLW9mLXVuZGVyc2l6ZWQtbG9ic3RlcnMtZm91bmQtaW4tbmV3LXlvcmstY2l0eS1zdXBlcm1hcmtldHPSAQA?oc=5","id":"CBMic2h0dHBzOi8vd3d3LnNlYWZvb2Rzb3VyY2UuY29tL25ld3Mvc3VwcGx5LXRyYWRlL2h1bmRyZWRzLW9mLXVuZGVyc2l6ZWQtbG9ic3RlcnMtZm91bmQtaW4tbmV3LXlvcmstY2l0eS1zdXBlcm1hcmtldHPSAQA","guidislink":false,"published":"Mon, 23 Jan 2023 14:52:59 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=23, tm_hour=14, tm_min=52, tm_sec=59, tm_wday=0, tm_yday=23, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LnNlYWZvb2Rzb3VyY2UuY29tL25ld3Mvc3VwcGx5LXRyYWRlL2h1bmRyZWRzLW9mLXVuZGVyc2l6ZWQtbG9ic3RlcnMtZm91bmQtaW4tbmV3LXlvcmstY2l0eS1zdXBlcm1hcmtldHPSAQA?oc=5\" target=\"_blank\">Hundreds of undersized lobsters found in New York City supermarkets<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SeafoodSource<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Hundreds of undersized lobsters found in New York City supermarkets - SeafoodSource","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LnNlYWZvb2Rzb3VyY2UuY29tL25ld3Mvc3VwcGx5LXRyYWRlL2h1bmRyZWRzLW9mLXVuZGVyc2l6ZWQtbG9ic3RlcnMtZm91bmQtaW4tbmV3LXlvcmstY2l0eS1zdXBlcm1hcmtldHPSAQA?oc=5\" target=\"_blank\">Hundreds of undersized lobsters found in New York City supermarkets<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SeafoodSource<\/font>","source.href":"https:\/\/www.seafoodsource.com","source.title":"SeafoodSource","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Authorities in the U.S. state of New York have discovered hundreds of undersized lobsters for sale in several New York City supermarkets. The New York State Department of Environmental Conservation's (DEC) Division of Law Enforcement conducted an inspection of an unidentified supermarket in the borough of Queens on 24 December, 2022, and found 128 undersized live lobsters for sale. On 26 December, 245 undersized lobsters were found for sale at a market in the borough of Brooklyn. Both supermarkets were issued violation notices, according to a DEC press release, with each violation coming with a fine of between USD 400 and USD 600 (EUR 368 and EUR 552). The lobsters were confiscated and donated to a food pantry in New York City. New York state law requires lobsters that are sold there to have a minimum carapace size of 3.375 inches and a maximum size of 5.25 inches. \"DEC Environmental Conservation Police Officers and Investigators work hard each day to serve their communities, protect our precious natural resources, and safeguard public health, while ensuring those who break the state's stringent Environmental Conservation Laws are held accountable,\" New York DEC Commissioner Basil Seggos said. \"In partnership with local, state, and federal law enforcement, DEC looks forward to continuing to support the work our ECOs perform in every corner of New York.\" A previous inspection in February 2022 by the DEC of nine retail food stores selling seafood uncovered four violations, including the possession of untagged shellfish and possession of undersized fish. And in 2016, the DEC seized more than 1,100 pounds of undersized lobster from several Price Chopper stores across the state. Photo courtesy of New York State Department of Environmental Conservation","filter_flag":1}
{"title":"The 'Shellmet' Is an Eco-Friendly Solution to Marine Waste in Japan | LBBOnline - Little Black Book","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vbGJib25saW5lLmNvbS9uZXdzL3RoZS1zaGVsbG1ldC1pcy1hbi1lY28tZnJpZW5kbHktc29sdXRpb24tdG8tbWFyaW5lLXdhc3RlLWluLWphcGFu0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vbGJib25saW5lLmNvbS9uZXdzL3RoZS1zaGVsbG1ldC1pcy1hbi1lY28tZnJpZW5kbHktc29sdXRpb24tdG8tbWFyaW5lLXdhc3RlLWluLWphcGFu0gEA?oc=5","id":"CBMiXGh0dHBzOi8vbGJib25saW5lLmNvbS9uZXdzL3RoZS1zaGVsbG1ldC1pcy1hbi1lY28tZnJpZW5kbHktc29sdXRpb24tdG8tbWFyaW5lLXdhc3RlLWluLWphcGFu0gEA","guidislink":false,"published":"Wed, 04 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=4, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=4, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vbGJib25saW5lLmNvbS9uZXdzL3RoZS1zaGVsbG1ldC1pcy1hbi1lY28tZnJpZW5kbHktc29sdXRpb24tdG8tbWFyaW5lLXdhc3RlLWluLWphcGFu0gEA?oc=5\" target=\"_blank\">The 'Shellmet' Is an Eco-Friendly Solution to Marine Waste in Japan | LBBOnline<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Little Black Book<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The 'Shellmet' Is an Eco-Friendly Solution to Marine Waste in Japan | LBBOnline - Little Black Book","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vbGJib25saW5lLmNvbS9uZXdzL3RoZS1zaGVsbG1ldC1pcy1hbi1lY28tZnJpZW5kbHktc29sdXRpb24tdG8tbWFyaW5lLXdhc3RlLWluLWphcGFu0gEA?oc=5\" target=\"_blank\">The 'Shellmet' Is an Eco-Friendly Solution to Marine Waste in Japan | LBBOnline<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Little Black Book<\/font>","source.href":"https:\/\/lbbonline.com","source.title":"Little Black Book","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"TBWA\\HAKUHODO and its partner Koushi Chemical Industry Co. announced the launch of 'Shellmet', an environment friendly helmet made from wasted scallop shells, in Sarufutsu Village, Hokkaido. In 2021 the export of scallop shells ceased causing concern for Soya district, where Sarufutsu Village is located, due to the area generating approximately 40,000 tons of shells as marine waste annually. The environmental impact on storing the scallops on the ground is hazardous and could lead to serious soil contamination, creating a social issue for the local community. To help solve the issue of surplus scallop shells, TBWA\\HAKUHODO’s discovered that scallop shells main component is calcium carbonate and could be reused as a raw material for a completely new material. The TBWA\\HAKUHODO team began efforts to recycle the material, which would become an important resource to support the village. The role of a shell is to protect itself from outside enemies. With scallop fishing being dangerous, the idea for the 'Shellmet' - a helmet made from scallops to protect scallop fishermen – was born. The opportunity to scale the Shellmet to become more than a protective wear for the fisherman was obvious. In recent years, Hokkaido has been hit by major earthquakes, and the risk of disasters such as heavy rain and snow damage due to abnormal weather has been increasing. From this discovery, the team decided to commercialise the product for use by villagers as disaster prevention helmets to protect themselves. Inventing the new material from wasted scallop shells and waste plastic The Shellmet is made from a new material based on scallop shells whose main component is calcium carbonate, and recycled plastic. It was developed by Koshi Chemical Industry Co. with professor Hiroshi Uyama of Osaka University with support from Sarufutsu Village in providing surplus shells. TBWA\\HAKUHODO developed the name of 'Shellstic' (Combination of 'shell' and 'plastic') and logo for the new recycled material which is a combination of wasted scallop shells and waste plastic. Characteristics of 'Shellstic' - Contributes to a maximum 36% reduction in CO2 emissions compared to the use of 100% new plastic - Contributes to a 20% reduction in CO2 emissions compared to limestone-derived eco-plastics. - By mixing scallop shells into the plastic, strength (bending modulus) is improved by about 33%. - Furthermore, because Shellstic is an upcycled material, which utilizes waste, the amount of waste will be reduced to not only help solve waste at a local level, but also globally. Characteristics of Shellmet “Biomimicry\" design inspired from seashells Shellmet is developed based on the concept of 'Biomimicry', which is the application of the mechanisms of the natural world to technological development. Shellmet incorporates a special ribbed structure in its design that mimics the structure of scallop shells, which is part of the material used for helmet production. As a result, the durability of Shellmet is improved by about 30% compared to the case without the ribbed structure, even though less material is used. From material development to product design, creating a product with minimal burden on the environment and sustainability have been central to this process. Shellmet upcycles scallop shells that would have otherwise been discarded. The product is available in a total of five color variations: CORAL WHITE, SAND CREAM, DEEP BLACK, OCEAN BLUE, and SUNSET PINK all colors inspired by the oceans, and can be used for a variety of purposes, including disaster prevention, work, and commuting by bicycle. In conjunction with this announcement, a crowdfunding campaign will be launched on MAKUAKE for pre-order sales. Future plans In Sarufutsu Village, approximately 270 fishermen wear plastic helmets daily, we will promote the use of eco-plastic by using helmets made of shell-derived eco-plastic as a trial starting in the spring of 2023. In addition, we plan to gradually develop 'Shellmet' by stockpiling it as a disaster prevention product, selling it to the general public, and introducing it as a tax return gift for hometowns ※ (※ Furusato Nozei: Japan’s tax reduction system for the taxpayers who donate to local municipalities). Through this initiative, we will promote the active use of reusable materials and raise awareness of disaster prevention among village residents. TBWA\\HAKUHODO will continue to disrupt conventions and stereotypes and create new products that meet the needs of the times, while actively taking the global and local environment into consideration. Through creativity, we will continue to create meaningful change in society. TBWA\\HAKUHODO creative director Masatoshi Usami says: \"Scallops are the most commonly eaten shellfish by Japanese people - and it is also the shellfish that results in the most amount of waste. If scallop shells are viewed as a resource, rather than waste, they offer new possibilities as a sustainable material. Shellmet is the first of these. Shells that have protected itself from external enemies can now be used to protect human lives. We hope this project will spread throughout society as a new form of environmental conservation that solves the problem of ocean discards and protects the fishing industry.\" Product designer Shintaro Monden (quantum) says: \"Shellmet's shell-like structure is based on the idea of biomimicry and designed to be both visually pleasing and functionally thoughtful. From material development to design, we aimed to create a sustainable product with minimal burden on the environment. With its minimalistic design, the lightweight and robust Shellmet can be used for a long period of time in various situations, from daily use to work sites. Not only the helmet itself, but also other parts including the buckle are all original designs, which give the wearer the feeling that every detail has been carefully crafted, giving the pleasure to own Shellmet.\" Koushi Chemical Industry Co. planning and development supervisor Tetsuya Nambara says: \"Various new eco-plastics are currently being released under the theme of SDGs. However, the reality is that true eco-plastics that meet cost, quality, and sustainability requirements are very limited at this time. While new materials are being mass-produced, hundreds of thousands of tons of waste are incinerated or landfilled each year that could still be used. We believe that it is essential to recycle more waste than ever before in order to promote a sustainable society. \"We are pleased to be able to collaborate with the people of Sarufutsu Village and help solve social issues in the region. We are committed to building a sustainable society that utilizes waste, and we hope that similar efforts will spread throughout Japan and around the world.\" Sarufutsu Village Mayor Koichi Ito says: \"The effective use of \"scallop\" shells, the treasure of Sarufutsu Village, has been sought for many years. We believe that we can contribute to the realization of a sustainable society if scallop shells, which have once finished their role of protecting itself from external enemies, can next be reborn and become a helmet to protect people's heads. First, we plan to use them for fishermen and as disaster prevention equipment. Sarufutsu Village will continue to seek ways to realize a sustainable society, not limited to the use of Sarufutsu scallops.\"","filter_flag":1}
{"title":"Implementing circular economy and sustainability policies in Rwanda: Experiences of Rwandan manufacturers with the ... - Frontiers","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2Zyc3VzLjIwMjMuMTA5MjEwN9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2Zyc3VzLjIwMjMuMTA5MjEwN9IBAA?oc=5","id":"CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2Zyc3VzLjIwMjMuMTA5MjEwN9IBAA","guidislink":false,"published":"Mon, 16 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=16, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=16, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2Zyc3VzLjIwMjMuMTA5MjEwN9IBAA?oc=5\" target=\"_blank\">Implementing circular economy and sustainability policies in Rwanda: Experiences of Rwandan manufacturers with the ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Implementing circular economy and sustainability policies in Rwanda: Experiences of Rwandan manufacturers with the ... - Frontiers","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2Zyc3VzLjIwMjMuMTA5MjEwN9IBAA?oc=5\" target=\"_blank\">Implementing circular economy and sustainability policies in Rwanda: Experiences of Rwandan manufacturers with the ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","source.href":"https:\/\/www.frontiersin.org","source.title":"Frontiers","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Despite the rise of plastic waste regulation and rising trends in the adoption of circular economy (CE) policies globally, investigations of their impact on businesses remain limited. Research on adoption of CE policies in Africa is particularly limited despite African countries leading the uptake of plastic ban laws and CE-related policies. This paper examines how the 10-R principles of CE feature in Rwanda's sustainability policies, and provides the experiences of Rwandan manufacturers following the implementation of the plastic ban. A qualitative review of key environmental sustainability policies in Rwanda shows alignment to different levels of 10-R principles of the circular economy. Meanwhile, field interviews with leading manufacturers comprising producers and users of single-use plastics in Rwanda indicate that businesses have faced internal and external challenges complying with the plastic ban and CE-related policies. These challenges range from limited capital to acquire new industrial technology, lack of expertise to develop circular business models, lack of alternative packaging to plastics, to loss in market competition since Rwanda's competitors in the international market still use cheap plastic packaging. Consequently, our findings indicate that insufficient government support such as lack of finance and capacity development to develop new business models, ambiguous regulatory framework, and inadequate stakeholder consultations impedes business uptake of CE and other sustainability policies. In addition to providing policy and managerial implications, we conclude by underscoring the importance of continued collaboration between government in terms of regulation, innovation from businesses, and consumer actions, in tackling environmental challenges caused by plastic waste and implementation of CE and other green policies. 1. Introduction Plastics are widely used globally in product packaging, manufacturing, and in households since they are cheap, lightweight, durable, and strong. The demand for plastics is expected to continue, and estimates indicate production will double by 2035 and probably quadruple by 2050 (UNEP, 2018a). Plastics are mainly produced using non-renewable resources such as oil, natural gas, and coal (Clapp and Swanston, 2009). A UN report notes that if current trends continue, the plastic industry could account for 20% of the world's total oil consumption by 2050. Plastics have thus emerged as one of the most pressing environmental issues since they are not naturally biodegradable. Furthermore, 60% of the estimated 8.3 billion tons of plastic produced since 1950 (UNEP, 2018b), have ended up in landfills or the natural environment, affecting climate change, marine life, biodiversity, and human health (Leonard and Barra, 2018). Tackling the environmental challenges caused by plastic waste require collaboration between governments in terms of regulation, innovation from business and action from individuals (UNEP, 2018b). While plastic garbage is taken up by a waste management system in developed nations and at least partly recycled, in low-income countries such as Rwanda, appropriate waste collection management or recycling infrastructure, though upcoming, is often lacking. Still, developing countries such as Rwanda are increasingly adopting mitigation strategies in response to the environmental damage caused by plastic waste. The most common has been to ban single-use plastics and encourage the production and use of environment-friendly alternatives. The prohibition of single-use plastics has been particularly popular in Africa, where 34 of 54 countries have implemented policies restricting single-use plastics since 2,000 (Greenpeace Africa, 2020). Rwanda became the first country in East Africa to introduce anti-plastic legislation in 2008 when it prohibited the manufacturing, use, sale, and importation of all plastic bags. Uganda and Kenya followed in 2009 and 2017, respectively. At the regional level, the East African Community (EAC) an intergovernmental body representing seven countries (Kenya, Tanzania, Uganda, Rwanda, Burundi, South Sudan, and the Democratic Republic of the Congo) banned the manufacturing, sale, importation, and use of polythene bags through the East African Community Polythene Materials Control Bill 2017 (Karuhanga, 2017). Following the ban on single-use plastics, Rwanda has subsequently emerged as a proponent of sustainability policies in Africa, including in the implementation of circular economy (CE) policies. A circular economy (CE) is an economic system that emphasizes processes and economic activities in which raw materials and products maintain a high value as long as possible and waste is reduced significantly (Kirchherr et al., 2017). The adoption of CE policies and implementation of the plastic ban disrupted the business models of Rwandan manufacturers. To stay in business in Rwanda, the policy requires that companies transition from manufacturing or using single-use plastics to production, and or use of environmentally friendly alternative materials. However, transitioning to alternative materials is capital intensive, and firms have faced challenges complying with the policy. Moreover, economic crises during the transition period can further exacerbate the challenges faced and derail the process, as Rwandan businesses experienced during the recent COVID-19 pandemic. In this study, we examined the experiences of Manufacturers in Rwanda as they navigate the ban on plastics, and Rwanda's drive toward sustainability policies aligned with CE principles. Transitioning from one regulatory policy to another requires collaboration among all stakeholders, including business and government. Studies have found that absence of adequate government support in the form of funding opportunities, capacity development, business-friendly taxation policies, laws and regulations, impedes uptake of CE policies by SMEs (Rizos et al., 2016). In many African countries, including Rwanda, the legal and regulatory frameworks that foster circularity are still in their infancy stages (Desmond and Asamba, 2019). Moreover, policies such as plastic ban are not always followed with mechanisms such as capacity that would support full realization of a country's circular or green economy initiatives. For example, Rwandan manufactures faced constraints in complying with plastic ban legislation (Behuria, 2021; Shabiti, 2021). The constraints initially ranged from a lack of knowledge to differentiate between permitted plastics and those outlawed, insufficient stakeholder consultation during policy design and implementation, and lack of capacity and finance to implement new business models necessitated by the ban (UNEP, 2018c; Behuria, 2021; Shabiti, 2021). Moreover, the emergence of a lucrative black market of smuggled plastic from neighboring countries initially affected implementation of the policy and the competitiveness of Rwandan manufacturers, but this was mitigated with stricter regulations. Punishments for violators included between 2 to 12 months in prison and hefty fines ranging from 5,000 to 100,000 Rwandan francs (between US$5 and $110) (Government of Rwanda, 2005). To support the transition process, the Rwandan government provided support in the form of fiscal policies such as tax waivers and special exemptions that allow eligible firms to continue using or importing plastics. Eligible firms include those that require plastic materials in their business operations such as packaging, especially exporters and importers of home compostable single-use plastics. The policy was also implemented in transition stages that allowed firms to comply over a period of time. Meanwhile, donor communities offered technical and capacity-building support, including training businesses on CE business models and financial support in the form of venture funding to start-ups engaged in plastic waste management. The study contributes to the literature on CE-related policies in Africa by providing Rwanda's experiences implementing the CE principles. We frame the plastic ban as a key feature of Rwanda's CE and other sustainability policies. We also examine the experiences of Rwanda manufacturers with implementation of the plastic ban and CE policies, focusing on understanding the challenges they face, and the strategies they employ to address those challenges. Moreover, we examine existing forms of support provided by the government to support firms as Rwanda transitions from linear to CE policies. The experiences of the Rwandan private sector in the transition from single-use plastics to alternative materials, including challenges faced, offers lessons on the impact of anti-plastic legislation. The research was primarily exploratory, focusing on providing results of a field survey conducted in Rwanda in between May and June 2022, and complemented with secondary data collected through desktop research on circular economy and sustainability policies in Rwanda. This exploratory nature limits theoretical discussion to the definition or contextualization of CE principles within the Rwandan sustainability context. Nonetheless, it contributes to the qualitative research on CE and sustainability in Africa, within the context of plastic waste management, and the impact of such policies on business. The study is structured as follows. Building on the introduction, Section 2 explores the literature on CE and sustainability in Rwanda. The section also highlights the research gap and significance of the study. Section 3 presents discusses the research questions, approach, and methodology. Section 4 presents the results of the investigation. Sections 5 and 6 analyze the findings and provides concluding recommendations, respectively. 2. Literature review 2.1. Understanding circular economy principles Kirchherr et al. (2017) collated 114 definitions of a CE and argued that a common theme among them is that they describe the concept to be a combination of reduce, reuse, and recycle practices, and not a modification of systems geared toward economic prosperity, environmental sustainability, and social equity. These three circular processes are usually termed as the “3R framework” highlighted by authors such as King et al. (2006) and Ghisellini et al. (2016). Other frameworks based on modifying the 3R framework with additional features that aim to holistically encompass the CE processes have been formulated and used by other specialists. For example, the 4Rs used by the European Parliament (2008), 6Rs used by Sihvonen and Ritola (2015) as a product's end-of-life technique, 9Rs by Van Buren et al. (2016) and 10Rs described by the PBL Netherlands Environmental Assessment Agency (2017) (see Table 1). The CE concept often contrasts with linear economy where materials are sourced, converted to products, and then used by the consumers who dispose of them after use. Kirchherr et al. (2017) defined CE as an economic system that replaces the “end-of-life” concept with reducing, alternatively reusing, recycling, and recovering materials in production\/distribution and consumption processes. CE operates at the micro level (products, companies, and consumers), meso-level (eco-industrial parks), and macro level (city, region, nation and beyond), with the aim of accomplishing sustainable development, thus simultaneously creating environmental quality, economic prosperity, and social equity, to the benefit of current and future generations. CE is enabled by novel business models and responsible consumers who, for example, implement circular processes in their production or consumption, respectively. However, the concept has also been criticized as being too vague to be used practically (Valenzuela and Böhm, 2017; Corvellec et al., 2021). Critics of the model claim that it is more of a theoretical than a practical concept to drive sustainability of scarce resources and wastes commonly associated with the traditional linear economy (Corvellec et al., 2021). Despite these critiques, the CE concept is increasingly gaining prominence and has been widely adopted by stakeholders exploring mechanisms to address the impact of climate change, waste management, and environmental conservation. TABLE 1 Table 1. A summarized explanation of 10 -R circular economy framework. 2.2. Explaining the plastic ban as a key component of CE and sustainability policies in Rwanda Sustainability has emerged as a strong component in Rwanda's social and economic development journey post-1994 genocide. In 2005, Rwanda adopted Organic law No. 04\/2005 which determines the modalities of protection, conservation, and promotion of the environment (Government of Rwanda, 2005). The adoption of the 2005 Organic law followed a 2004 study by the Rwanda Ministry of Environment which found that plastic litter threatened agricultural production, contaminated water sources, killed fish and created visual pollution that tarnished the image of the country (Dsilva, 2019). This law established the initial framework for policies relating to sustainability. Indeed, guided by the Organic law of 2005, in September 2008 Rwandan parliament passed Law N57\/2008 which prohibited the manufacture, importation, use, and sale of polyethylene bags in Rwanda. The law defined polythene bags as synthetic plastic made up of numerous simple chemicals called ethene (monomer). In August 2019, this regulation was expanded to include other single-use plastic products, including straws, bottles, and food containers (Government of Rwanda, 2019). Protecting the environment and sustainable management of natural resources has become integral in Rwanda's national development plans. It was a central part of Rwanda's Vision 2020, in which Rwanda sought to diminish pressure on natural resources and reverse environmental degradation (Government of Rwanda, 2012). In the successor Vision 2050, conservation is recognized as important to the sustainability of the tourism industry and the preservation of Rwanda's national heritage. Through Vision 2050, the government plans to continue positioning Rwanda as the global frontier for conservation (Government of Rwanda, 2020). 2.3. Research gap While Rwanda has consistently used the plastic ban to position itself as champion of CE and sustainability in Africa, few studies [see for example, Behuria (2021)], have explored the implementation of such policies in Rwanda without focusing much on their climate-change and conservation related effects. While scholars have explored implementation of environmental protection policies in Rwanda (Siegel et al., 2011; Nibeza, 2015; Danielsson et al., 2017; Whyte et al., 2020; Behuria, 2021), a few studies have explored strategies adopted by Rwandan manufacturers to ensure compliance with anti-plastic regulations [see for example, Behuria (2021). Similarly lacking is research exploring the effectiveness of government support to manufacturers following the ban on plastics and the implementation of CE-related policies. Existing studies tend to focus on the business-government dynamics environment and the politics surrounding the implementation of policies banning plastic (Behuria, 2019, 2021), or the environmental impacts of plastics, approaches to alleviate plastics and the attendant effects of such policies on the country's image, such as the “cleanest city” moniker given to Rwanda's capital Kigali by media commentators and scholars (see Hakuzimana, 2021). Other scholars have also found that despite efforts to make Rwanda a plastic-free country, scientific studies on plastic pollution and the impact of adopted policies in Rwanda are still lacking (Hakuzimana, 2021). The absence of such studies makes it challenging to obtain reliable data, and to understand the implications of adopted policies, for example, on the business environment. However, the lack of studies on the impact of sustainability-related policies, such as CE policies on business is not unique to Rwanda. In Africa, investigations on the impacts of CE policies on business, though upcoming are still limited (Andersen et al., 2021; Behuria, 2021). The limitation of studies on Africa is partly due to the lack of reliable data sources (Andersen et al., 2021) and the reluctance of businesses to participate in empirical research involving their relationship with the government, which is true in the case of our study. In states like Rwanda, with a centralized political system and a high degree of government involvement in business (Behuria, 2015, 2021), manufacturers often fear that their data may be transferred to authorities, whom they often perceive as “policing” them through environmental regulations. Furthermore in East Africa, such fears are not unique to Rwanda as manufacturers in Kenya and Uganda (Behuria, 2021), and Tanzania exhibited similar sentiments (Andersen et al., 2021). Lastly, the reluctance of manufacturers to participate in empirical studies, as one business leader informed us, is further caused by the fact that researchers do not always share the results of their studies with the private sector. As aforementioned, the study thus sought to explore the experiences of Manufacturers in Rwanda as they navigate the ban on plastics and Rwanda's drive toward sustainability. More specifically, the questions we explored include: What are the challenges manufacturers face in their transition to alternative materials (question 1)? What strategies did Rwandan manufacturers adopt as they transitioned from the production or use of single-use plastics, which are prohibited, to alternative materials (question 2)? How has the Rwandan government been supporting manufacturers as they transition—and what other form of support do businesses require as they transition (question 3)? Finally, how does circular economy principles feature in Rwanda's sustainability policies, including national development plans (question 4)? Since Rwanda is a leading pioneer in plastic regulation and CE policies in Africa, a critical analysis of the experiences of its private sector with the implementation of related policies offers lessons other jurisdictions may consider in developing plastic management regulations and other green policies. 3. Materials and methods 3.1. Study design The study employed a descriptive qualitative research design based on qualitative data collected through field interviews with Rwanda manufacturers and desk review of literature on CE-related policies in Rwanda. Descriptive studies systematically describe a situation, problem, phenomenon, service, or programme (Kumar, 2011). The research was informed by the study focus, which sought understand the experiences of Rwandan manufacturers with the plastic ban policy. 3.2. Sample & sampling technique Study participants were identified through a purposive sampling technique, which identifies respondents based on the nature and intent of the study (Groenewald, 2004; Tongco, 2007). The sampling process involved a desk study of firms manufacturing or using plastics in their business operations, and those responsible for implementing economic and sustainability policies in Rwanda. This resulted in the classification of firms into either primary or secondary manufacturers. Primary manufacturers are firms that manufacture single-use plastics, while secondary manufacturers are firms that use single-use plastic products to develop their final product. For example, a plastic bottle manufacturer would be classified as a primary manufacturer, while a water company that uses the bottle to package water for sale is classified as a secondary manufacturer. The total sample included 35 respondents comprising 14 primary manufacturers, 14 secondary manufacturers, three government agencies and two leading industry groups representing manufacturers (see Table 2). Despite this large sample, empirical data was collected from only nine participants, comprising four primary manufacturers, four secondary manufacturers and the government agency responsible for implementing and enforcing environmental policies in Rwanda. Some of the targeted respondents declined to participate despite ethical assurances and our framing of the study as necessary in understanding the experiences of firms as Rwanda implements CE policies. As aforementioned, businesses in Rwanda, and indeed most East African countries, are often reluctant to participate in studies that examine their relationship with the government (Andersen et al., 2021; Behuria, 2021). Manufacturers that participated in the study shared our view that the study could help inform policy changes that positively improve the business environment. The interviews were complemented with reliable secondary materials including media reports that contained statements from business leaders and business community representatives such as officials from Rwanda Association of Manufacturers and the Private Sector Federation (PSF), public officials such as the Rwandan Minister for Environment and Members of Parliament. The sample size is summarized in Table 2. TABLE 2 Table 2. Study sample. 3.3. Data collection and analysis Secondary data was collected through a desk review of the Rwandan CE landscape by reviewing Rwanda's sustainable development policies and its adoption and implementation of regulations to manage plastics. The review covered academic articles, media publications, and government policy documents. The academic documents reviewed were those discussing CE concepts and its implementation, and those examining implementation of regulations banning plastics in Rwanda and Africa broadly. For media articles, the study focused on publications by leading Rwandan business and environmental journalists; these included their interviews with public officials such as parliamentarians and ministers. Finally, the study reviewed key Rwanda policy documents related to environmental conservation and sustainability, national development plans such as Rwanda Vision 2020 and Vision 2050 and the country's manufacturing-related policies. These documents outline Rwanda's sustainable economic development plans and related policies. Following desk research, empirical data was collected from the sampled population through field interviews using semi-structured questionnaires. The questionnaires were designed to collect information on business responses to the plastic ban, challenges faced, and available government support to enhance transition. Semi-structured questionnaires allowed participants to share their experiences broadly, allowing the researchers to ask follow-up questions based on participant responses. The data was manually cleaned and analyzed thematically to identify themes and patterns that respond to the research questions. 4. Results This section presents the results of the fieldwork interviews with select Rwandan manufacturers is the study participants consisted of businesses that are primary and secondary manufacturers of single-use plastics. There were four primary manufacturers and four secondary manufacturers. To triangulate data on government support since the ban on plastic, Rwanda Environmental Agency (REMA) was also interviewed. REMA is the government regulatory agency responsible for ensuring that environmental issues and climate change are integrated into Rwanda's development plans. REMA enforces environmental policies, including the plastic ban. For anonymity purposes, the names of firms interviewed into participant 1–9. Table 3 presents a summary of the participant's demographic data. The results are presented based on the research questions, and the data is summarized in tables based on key themes. TABLE 3 Table 3. Demographic data of the firms interviewed. 4.1. Research question 1: Challenges facing manufacturers as they transition from manufacturing of single-use plastics to environment-friendly packaging Results of thematic analysis of qualitative data show that there are two broad categories of challenges that manufacturers experienced as they transitioned from single-use plastics to environmentally friendly packaging. These challenges are classified as internal and external and summarized in Table 4. TABLE 4 Table 4. Challenges firms face as the transition from single use plastics to other alternatives. 4.2. Research question 2: Government support provided to manufacturers during the transition process Considering the ban of single-use plastic, the study sought to understand the available support provided by the government to support manufacturers. Thematic analysis of interviews indicate that manufacturers received support in the form of capacity development on the production of alternative materials, financial support, and tax exemption. In addition, the policy is implemented in phases, allowing them to transition their processes gradually. Moreover, firms that use plastic in their operations may apply to the government for a special waiver to the policy that enables them to continue using plastics in their operations. Given the highlighted challenges, the study explored what form of interventions would better support manufacturers in their transition processes. Table 5 summarizes the available government support and the type of interventions required. TABLE 5 Table 5. Government support provided to manufacturers during the transition process. 4.3. Research question 3: Transition strategies adopted by Rwanda manufacturers This research question sought to understand the strategies and approaches manufacturers adopt to transition to production or use environmentally friendly materials. Seven of the eight firms interviewed (87.5%) reported having a transition plan. The strategies adopted under these plans include being flexible to easily adapt to changing government policy, working with recycling and waste management companies to collect and process plastic waste, engaging in consumer awareness activities, and using new packaging materials such as paper bags and glass in replacement of plastics. Thematic analysis of the data collected from firms that reported having transition plans is summarized in Table 6. TABLE 6 Table 6. Strategies adopted by Rwanda manufactures as they transition from single-use plastics to other alternatives. 4.4. Research question 4: Circular economy feature in sustainability-related policies in Rwanda The key aspect of this study was to understand the implementation of CE-related principles in Rwanda. One of the research questions thus sought to explore how CE-related principles feature in Rwanda's sustainability and national development policies. The results indicate that since banning single-use plastics, Rwanda has consistently been implementing sustainable development policies and encouraging the adoption of CE principles. Rwanda has adopted various policies that align with the 10-R principles of circular economy (R0, Refuse; R1, Rethink; R2, Reduce; R3, Reuse; R4, Repair; R5, Refurbish; R6, Remanufacture; R7, Repurpose; R8, Recycle; R9, Recover) as summarized in Table 7. TABLE 7 Table 7. How sustainability policies in Rwanda align with the 10-R principles of circular economy. 5. Discussion 5.1. Challenges facing Rwanda manufacturers as they transition to circular economy The implementation of anti-plastic legislation in Rwanda has not been without challenges. Studies have found that while most SMEs are aware of the benefits of CE-related policies, their uptake of CE in business model development is hampered by various barriers, including a lack of financial resources and technical skills (Rizos et al., 2016; Andersen et al., 2021). For the firms studied, the policy resulted in increased business costs to acquire alternative materials and a lengthy licensing process to obtain exemption to the law from the environmental agency—for those eligible businesses. Primary manufacturers that initially produced plastic packaging have struggled to acquire capital to invest in a circular production process, such as introducing new technology to create alternative materials. They suffered from skills shortages as most were not better trained on new business models at the industry and managerial levels, a challenge further compounded by the lack of overall employability skills among graduates in Rwanda. Those firms are unable to compete by innovating new products or business models aligned with the new policies were forced to wind-up their operations (Participant 3). More than 17 years since Rwanda first banned plastics, the most widely used packaging material, the country has not been able to produce or find a reliable source of alternative packaging materials. Secondary manufacturers that require packaging materials in their operations continue to face a supply crisis and have been unable to find a reliable supply chain to support the scale of their operations. When available, the alternative materials are costlier compared to plastics. Small and medium-sized enterprises (SMEs) are particularly affected, as one Rwanda-based fruits and vegetable processing company that exports to European and North American markets reported. Though the firm has transitioned and mainly uses paper-based packaging instead of plastics, it noted that paper bags are not appropriate for packaging agricultural products as wet consumables can easily destroy them. According to the company: “It's not easy to find packaging material that is environment-friendly and what we use we import from Kenya. Before they prohibited plastic bags, we used them [as] was much easier. After the ban, we had to find another packaging tool…, [this] was very difficult because our products are delicate, and one can't use any type of packaging. We [have] to find appropriate packaging that [is] suitable for our products. But sometimes we stop production due to a lack of packaging tools (Participant 7). Previous studies found that the plastics prohibition in Rwanda increased the packaging cost for manufacturers (Danielsson et al., 2017). For instance, following the ban on single-use plastics, the price of packaging materials for the food-processing industry increased from RWF 29.55 (USD 0.03) to RWF 118.20 (USD 0.12) (Afadhali, 2022). One firm that transitioned to packaging its products in aluminum bags saw the cost of the final product increase from RWF 236.40 (USD 0.24) to RWF 305.35 (USD 0.31) per unit. For Inyange industries, one of Rwanda's largest manufacturers, the price of packaging increased from RWF 59.10 (USD 0.06) to RWF 295.50 (USD 0.30) (Afadhali, 2022). Meanwhile, a plastic straws manufacturer noted that they invested Rwandan Francs (RWF) 250 million (US$241,000) to start the factory years ago, but would require at least RWF600 million (US$578,592) to invest in new technology to produce eco-friendly straws (Nkurunziza, 2022). Internally, Rwanda lacks the capacity to develop a quality and reliable supply of packaging materials, and most secondary manufacturers rely on imports. Rwanda spent US$9.7 million on imports of polythene packaging in 2015, despite its ban on polythene bags (Bishumba, 2018). One firm observed that: “we have to import our material because we are looking for better quality material, and as you know Rwanda hasn't reached that level yet” (Participant 8). Before Rwanda introduced anti-plastic policies, chemicals, rubber, and plastics production accounted for <1 percent of its GDP in Rwanda. This was despite plastic production growing at an annual rate of 4.5 percent between 2004–07 (Jian and Martin, 2022). Between 2004 when Rwanda first banned plastic bags, and 2016, imports of plastics sharply reduced, falling from 1,092 tons in 2003 to just 18 tons in 2006, before bouncing back in 2008 when Rwanda formally introduced the national law banning plastic bags (Jian and Martin, 2022). Imports remained generally low, around 100 tons per year between 2009–2011 and reached 323 tons in 2016. Meanwhile, exports have drastically reduced (Jian and Martin, 2022). The reliance on imports brings the added challenge of transportation and high import fees. Transporting materials to Rwanda can be very costly, especially if the shipment is made by flight (Government of Rwanda, 2016). According to one of the participants, the implication of the high cost of imported packaging materials makes the entire product more expensive in both local and export markets, resulting in lost or low market share. The participant reported that “the only issue is the packaging which makes the entire product more expensive… during the COVID-19 pandemic period, we had to ship all our packaging material by flight which cost us a lot money” (participant 3). Rwanda relies primarily on imports for non-agricultural products, including packaging. But transporting materials to Rwanda can be very costly, especially if the shipment is made by flight (Government of Rwanda, 2016). A manufacturer of paper products noted that the challenges of being a landlocked country and fluctuations in exchange rates make raw materials expensive since it results in high transportation costs (Participant 3). Similarly, due to lack of managerial and technical skills, some firms are forced to bring in foreign labor, which is costly and sometimes unreliable when workers have to repatriate to their home countries on short notice or when movement is hindered due to global health crises such as the COVID-19 pandemic. Policies that support the development of firms' internal and industrial capacity to manufacture alternative materials to plastics and in general, innovate new business models and products are necessary to support firms' transition process. Policies that aim to develop Rwanda's nascent manufacturing industry will not only support continued business operations during the transition process but will help alleviate Rwanda's over-reliance on imports in the long term. Participants noted that monetary and non-monetary incentives such as training needed to support previous manufacturers of single-use plastics to align their business models with CE principles, for example, in developing alternative packaging to plastics. Besides, firms also need training and tools to respond better to changing government regulations. This is especially crucial since most products, including Rwanda's famous Akabanga chili, are still packaged in plastic bottles. While most products can be packaged in glass, the industry does not yet exist. The packaging sector is cross-cutting since packaging is required by manufacturers across all sectors. Developing the local capacity to manufacture sustainable packaging materials will be crucial since the manufacturing industry is key to realizing Rwanda's national development priorities. 5.2. Transition methodologies adopted by Rwandan manufactures to comply with plastic ban policy Except for one company, all the firms interviewed have not fully transitioned their business models and still use plastics at some point in their operations. The firms interviewed adopted different strategies to ensure compliance with plastic regulations and transform their operations from linear to circular production models. The strategies include employing a flexible approach to business strategy development based on monitoring, and responding to government policy-making since the law kept changing, building long-term relationships with suppliers and credit institutions, investing in new products and technology, training graduates with required business skills, and utilization of the special authorization license that allows eligible companies to import or use plastics in their operations. Though this was not a critical part of our study, we found that the firms are engaged in some form of circularity. All firms encourage their clients to practice recycling and proper waste disposal. For example, manufacturers who use single-use plastics in their product development process work with waste management companies in the waste disposal process. One firm manufactures construction products and plastic-sheeting materials used in greenhouse firms has a contractual agreement with its clients. The contract requires clients to return the materials to the company for recycling post-usage (Participant 4). These firms also use a mix of paper-based products and non-prohibited plastics. Meanwhile, a leading manufacturer transitioned from packing water in plastic bottles to glass bottles but reported that making glass is costly, and there is no reliable supply (Participant 6). A primary manufacturer of single-use plastics reported that starting the transition process earlier, when the policy was announced in 2008 was instrumental in their overall shift and continued business stability. The company shifted from producing plastic products to the production of paper-based packaging products. The company adopted an approach where instead of importing and supplying bags, it imports plastic reels and manufactures them locally for clients authorized by the environment management authority (Participant 3). Effective communication and cooperation of suppliers is also crucial in ensuring a seamless transition process. A paint manufacturing firm whose imports initially came wrapped in plastic bags reported that when the ban came into place, they informed their suppliers of the policy change. The suppliers had no alternative but to comply. While this particular company was not directly affected, they acknowledged that their suppliers may have incurred additional costs in finding alternative packaging. In general, businesses appeared to support the regulatory processes that protected the environment and noted that such regulations, if well implemented, are crucial to the long-term sustainability of their business and consumer markets. For example, Participant 6 reported that: “We are not phasing plastic bottles just because the government has asked us. But we believe it is the right thing to do. Our raw material comes from the farmers—cow farmers and fresh food farmers. These sectors are most affected by climate change. If we pollute the environment, it affects the cows and farming. And it will become very hard for us in the future to get the raw materials. We understand that this is better for our business sustainability in the long term.” Though Rwanda has banned plastics, companies can apply for a special exemption to import or use plastics in their operations (discussed in the next section). Due to shortage of alternative materials in Rwanda, especially packaging, and the lack of reliable supply, Rwandan firms are taking advantage of the special permit. According to the Rwanda Environment Management Authority (NEMA), manufacturers must apply for a license every time they import a prohibited plastic product (Participant 9). While some of the firms interviewed complained that the licensing process is time-consuming and the license itself amounts to the government policing their business, they understand it is the only way for them to continue some of their operations. To cope with the lengthy process, firms sometimes engage in marketing activities that sensitize their clients about their product and the process required to buy the product. Both firms and clients need a license to sell or purchase regulated plastics. The companies thus engage their clients first-hand and ask them to consider the time it takes to get the license to purchase the products. Firms reported that sometimes clients are frustrated by the process and often request them to apply on their behalf, which transfers the time-related costs to the business. 5.3. Government support to firms during the implementation plastic ban and CE-related polices 5.3.1. Special authorization to import, sell or use single-use plastics The special authorization license to import, sell or use single-use plastics is the cornerstone of government support to Rwandan manufacturers following the ban on single-use plastics. The exception is allowed by Article 4 of Rwanda's Law No. 17\/2019, the legal framework for the plastic ban. Article 4 states that “a person who intends to manufacture, import, export, or use prohibited items for an ‘exceptional reason' may apply for authorization in writing to REMA” (Government of Rwanda, 2019). Special authorization is granted to stakeholders in the public and private sectors with products without other technically viable alternative packaging to plastics (REMA, 2019). During application for the authorization, applicants are required to provide details of the products to be packaged, the type(s) of plastics used, why the special authorization is needed, expected quantities, origin of the packaging materials and waste management plan (for management and disposal of the accompanying plastic waste). REMA will then assess and approve or deny the application, including with specific pre-approval conditions where necessary. In case the authorization is granted, there is a follow-up, reporting and approval for clearance of the plastics from the customs—in case of imports—to verify compliance with approval conditions. The Rwandan firms that participated in the study have applied for the special authorization at some point, particularly during the early stages of the plastic ban. Studies have found that when not accompanied with a coherent and strict legislative framework, compliance with green economic policies often result in administrative burden, especially for SMEs without strong in-house legal capacities (Rizos et al., 2016). In Rwanda, the interviewed firms observed that the authorization process is sometimes frustrating, especially to their clients, who must also get authorization before they can purchase single-use plastics from local sellers. Meanwhile, while the special authorization supports Rwanda's transition process from single-use plastics, it was initially necessitated by a need to comply with various international trade agreements Rwanda has signed. For example, due to the non-discriminatory principle of the World Trade Organization (WTO), Rwanda cannot impose a complete ban on competing imports such as products that enter the country wrapped in plastics or it risks violation of its international obligations (Simo, 2019). Moreover, most of the European and North American markets where some Rwandan companies export food products such as processed fruits and vegetables (in the case of participant 7), have not entirely restricted plastics. This situation puts domestic firms at a distinct disadvantage. The special authorization thus allows companies producing packaged food products such as processed chillies and beverages for exports to import the plastic needed in their business operations while simultaneously allowing the importation of products wrapped in plastics under strict regulations. 5.3.2. Phased-out approach to transition—a grace period to transition The second intervention the government provides to manufacturers is a grace period for the transition process. When the 2019 law was enacted, factories manufacturing single-use plastics were granted 2 years grace period from the date of publication. They were required to phase out the outlawed plastics by September 2021 (Nkurunziza, 2019). Though this enabled some manufacturers to partially transition, many companies have not found a reliable supply of alternative packaging. Besides, due to lack of proper sensitization, some retailers cannot differentiate between permitted and restricted plastics (Elisabeth, 2021). According to media reports, in January 2022, local manufacturers petitioned REMA to extend the grace period, citing the impact of the COVID-19 pandemic and lack of finance to invest in modern technology. However, the agency denied their requests (Nkurunziza, 2022). NBG Limited which manufactures plastic drinking straws noted that before the COVID-19 pandemic, the company had invested more than 250 million Rwanda Franc (RWF) (US$250 thousand) to start the factory, but would require at least RWF 600 million (US$600 thousand) to invest in new technology to produce eco-friendly straws. Furthermore, the pandemic compounded the challenges faced and to change the business model, the company requires an additional 5-year grace period (Nkurunziza, 2022). Furthermore, firms noted that the transition timeline was insufficient to allow them to convert their machines and facilities from linear to circular production models. Interestingly, Rwandan legislators had initially warned of the potential consequences of the short transition time. During the approval of the draft law in 2019, members of parliament requested that businesses be given a longer phase-out period, or the country risked a shortage of packaging materials (Mbonyinshuti, 2019). One legislator observed that the transition process required research and consultation with stakeholders, while another noted that since the ban in 2008, Rwanda had “sustained the shortage of packaging materials” and that “10 years down the road there seems to be no alternative. “How sure are we that there will be packaging alternatives once we ban [all] single-use plastics?” The MP questioned (Mbonyinshuti, 2019). 5.3.3. Tax exemptions Rwanda has generally been at the forefront of supporting the development of a thriving manufacturing industry. One strategy to encourage local manufacturing capacity development is the exemption of customs and value-added tax (VAT) on imported raw materials and capital goods such as machines. To qualify for exemptions firms must meet specific requirements, including certifying that they do not intend to resell the imported product. The firms interviewed reported that they have benefited from tax exemption. To support the development of the local packaging industry and prevent competition between local and foreign suppliers, in 2018 Rwanda started taxing imported packaging materials. Imported packaging materials were initially cheaper than those produced locally, and local manufacturers complained of unfair competition. Even then, investments in alternative packaging materials have been slow, and the gap is still filled by imports mainly from Kenya and China. According to firms, beyond tax exemptions and special authorizations, government support can be designed in the form of financial assistance in the acquisition of new technologies, and training on best practices from other jurisdictions. These may be in the form of capacity development on circular business model development or development of biodegradable packaging materials. Regarding finance, some manufacturers noted that state and financial institutions should offer competitive credit terms which would be more sustainable than grants that are sometimes provided by non-governmental organizations (Participant 3). To develop the necessary skills, the government could work with educational institutions to develop curriculum and industrial academies to provide skills beyond those offered by existing TVET (technical and vocational education and training) institutions. 5.4. Collaboration between government and private sector in CE initiatives Collaboration between government and private sector in adopting CE and sustainability policies is intensifying in Rwanda. In June 2021, the Rwanda Private Sector Federation, an industry body, and the Rwanda environment management authority jointly established the Sustainable Management of Single Use Plastics Project (PET) (REMA, 2021). The PET project comprises three components: (i) collection, transportation, disposal, and recycling of single-use plastics, (ii) capacity development, research and awareness raising, and (iii) financial contribution from industries and importers. The project intends to contribute to Rwanda's plastic waste management processes through funding by private-sector companies who produce, import, or use plastic products in their business processes. As part of the project, the private sector federation expects to mobilize about RWF690.6 million (RWF) (US$0.7 million) during the first 5 years of the collaboration. Under the project one Rwandan investor has invested over US$3 million in a project that recycles plastic waste into construction materials (Moraes, 2021). In August 2021, the environment agency announced that all eligible manufacturers requiring special authorization to import plastic materials into Rwanda would have to contribute to the programme (REMA, 2021). Each firm that imports products packaged in single-use plastics into Rwanda will contribute RWF 90 (US$0.87) per kg of imported products; or US$90 for a ton of plastics imported. However, this requirement contributes to unfair competition between local manufacturers and importers since firms that export to Rwanda are not required to contribute to the Fund. While the private sector seeks to mobilize funding from their members for the project, the government has not provided similar financial incentives to complement their efforts. Indeed, most investments following the plastic ban, including in plastic waste management have come mostly from the private sector or the donor community. Nonetheless, the government has welcomed projects that support its CE and sustainability initiatives. This is evident in the rapidly increasing number of waste management and recycling companies, including start-ups engaged in other CE-related initiatives in Rwanda, as observed during fieldwork. By 2019, there were about fourteen recycling companies compared to none in 2008. Together, these companies recycle 70–80 percent of the total plastic waste in Rwanda. These firms have been critical in the sustainable disposal and management of imported plastic waste in the country and in promoting the recycling culture, despite facing financial and technological challenges. Some of the imported plastic include plastic from ports of entry, mainly the airport. One recycling company estimated that they collect more than a ton of plastic waste each week from the airport alone. In addition to the Sustainable Management of Single Use Plastics Project (PET), the government continues to collaborate with the private sector, including small and medium-sized enterprises, and civil society organizations. Initiatives involving civil society include promoting voluntary actions such as the National Circular Economy Forum that encourages business to lead in establishing a coalition on plastics and knowledge exchange between SMMEs and large companies. Rwanda has also developed policies that feature CE-principles in an effort to balance between growth and environmental efficiency (see Table 6) and is developing a draft National Strategy on CE. According to REMA, Rwanda will continue to explore initiatives and legal frameworks such as an environmental levy on imported consumer goods packaged in single-use plastics, training and research on circular economy and circular business models (Participant 9). 6. Conclusion and recommendations This study explored the experiences of Rwandan manufacturers following the plastic ban by investigating strategies adopted by manufacturers in response to the plastic ban, and the challenges manufacturers face in their transition process, and how they respond to those challenges. The study also sought to examine how CE principles feature in key sustainability policies in Rwanda. Although the effects of single-use plastics are clear and immediate actions need to be taken to reduce the manufacture and usage of plastics, and adoption of alternative materials, insights from the study indicate that the transition to a plastic-free world should be gradual. The prohibition of single-use plastics in Rwanda positively transformed the country's image, but also presented economic implications such as business shutdowns, job losses, and an increase in prices for different products. Moreover, alternative materials have not been developed to match the scale in which plastic products are used. The innovation of sustainable products to replace plastics falls on both private and public sector stakeholders. However, in Rwanda, following the ban on plastics, that responsibility appears to have been left to manufacturers. Manufacturers have faced transition challenges to comply with anti-plastic legislation, including expensive start-up resources such as capital, technology, manpower, and time constraints. The socioeconomic and political effects of the ban on plastic (bags) perhaps explain why it was initially unsuccessful or took longer to implement in Rwanda's neighboring countries, notably Kenya and Uganda (Behuria, 2021). Behuria (2021) argued that the ban was quickly implemented in Rwanda since the business power of the private sector is limited. 6.1. Policy and managerial implications Manufacturing is a sustainable growth engine that serves as an impetus for innovation and generates economies of scale. The Rwandan government has provided some support, including tax incentives, to companies willing to invest in plastic recycling equipment or manufacture environment-friendly alternatives. However, the manufacturing industry in Rwanda is still in its infancy stages, evidenced by the reliance on the import of most non-agricultural products. Regular collaboration between business and government remains crucial in balancing Rwanda's sustainability objectives and the development of the manufacturing industry. As the manufacturers who participated in the study observed, Rwanda should complement private sector initiatives, for example, by developing partnerships with financial institutions to offer capital or credit to assist firms to acquire the necessary technology to transition from linear to circular production models. The government should also continue raising awareness of the importance of CE in business efficiency. However, activities should be targeted to educate firms on how to repurpose their business models, including through research and development (R&D) support to allow them to remain relevant in the ever-changing marketplace. Manufacturers are aware that business regulations and policies are bound to change at some point in response to developments in society. However, they cautioned that the uptake of CE principles in business may be hard if firms are not trained on critical methodologies for meaningful CE-based business model innovation. Encouraging research and development may also allow manufacturers to dig deeper and discover more ways of incorporating circular economy principles into their processes. Furthermore, Rwanda needs to develop local capacity to produce alternative materials to plastic or develop a reliable global supply chain. This is necessary to cushion its manufacturing industry from the perennial shortage of packaging materials. Indeed, countries considering Rwanda's approach to the plastic ban should conduct an internal analysis to determine the potential impact of the ban on plastics on manufacturers and consumers beyond the well-documented positive environmental benefits. The challenges facing Rwanda firms after the prohibition are parallel to the challenges facing countries in the transition toward green energy. For example, the debates on the effectiveness and sustainability of green energy vs. fossil fuels such as coal in massive industrial development are necessary for job creation. In Rwanda, initial research on the potential impact of the ban on plastic seemed to have focused on the improvements in the environment and other dividends, such as the clean-country view, and largely ignored implications on the broader economy, such as constraints faced by manufacturers. Finally, Rwanda should work with local and international stakeholders to address the situation that warrants the issuance of exceptional authorization to import single-use plastics. While the license is necessary to ensure Rwanda complies with its international obligations, it indirectly hinders innovation and full adoption of the CE principles in business and other sustainability policies. Local manufacturers will likely continue to rely on the incentive until a local industry develops to provide alternative packaging materials. International companies exporting to Rwanda, protected by non-discriminatory clauses of global trade agreements, will similarly lack incentives to develop alternative packaging materials for products destined for Rwanda. Initiatives such as an international treaty to ban plastics which Rwanda participates in, if successful, could help address this challenge (United Nations, 2022). Rwanda should also consider joining the coalition of WTO countries participating in The Informal Dialogue on Plastics Pollution and Environmentally Sustainable Plastics Trade (IDP) that seeks to complement discussions in the Committee on Trade and Environment (CTE) (WTO, 2022). Despite its leadership in plastic management policies, at the time of writing, Rwanda was not among the 75 WTO members (including eight African countries) participating in the IDP, which is gradually emerging as a forum for setting informal agenda on trade in plastic products within the WTO framework. Data availability statement The original contributions presented in the study are included in the article\/supplementary material, further inquiries can be directed to the corresponding author. Ethics statement The studies involving human participants were reviewed and approved by the African Leadership University (ALU) Circular Economy Research Ethics Committee. The patients\/participants provided their written informed consent to participate in this study. Author contributions MO, JA, and MM conceived the paper. The research grant was awarded to MO who also supervised the research project and wrote the first manuscript. JA supervised the fieldwork and data collection in Rwanda and contributed to the section on CE principles. CN and OH students at the African Leadership University, Rwanda, assisted with fieldwork and data collection in Rwanda. MM reviewed and improved the final manuscript. All authors reviewed and approved the final version. Funding This research was undertaken as part of the CE Programme at African Leadership University (ALU). We thank MAVA Foundation for the support to the programme through their contribution to the ALU CE Programme. Acknowledgments We are grateful for the support provided through the Circular Economy Research Programme at ALU. We also thank Elke Nijman, Elisée Bahati Ntawuhiganayo, Dr. Theresa Lisita, and Lea McDonald for commenting on earlier drafts of the manuscript. Finally, we thank all our stakeholders and participants for their contributions to this research. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Publisher's note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References Afadhali, P. (2022). Rwanda banks on single-use plastic ban to tackle plastic pollution. InfoNile, Available online at: https:\/\/infonile.org\/en\/2022\/02\/rwanda-banks-on-single-use-plastic-ban-to-tackle-plastic-pollution\/ (accessed February 16, 2022). Andersen, M., Ogallo, E., and Faria, L. (2021). Green economic change in Africa – green and circular innovation trends, conditions and dynamics in Kenyan companies. Innov. Develop. 12, 231–57. doi: 10.1080\/2157930X.2021.1876586 CrossRef Full Text | Google Scholar Behuria, P. (2015). Between party capitalism and market reforms – understanding sector differences in Rwanda. J. Mod. African Stud. 53, 415–450. doi: 10.1017\/S0022278X15000403 CrossRef Full Text | Google Scholar Behuria, P. (2019). “The comparative political economy of plastic bag bans in East Africa: why implementation has varied in Rwanda, Kenya and Uganda,” in Global Development Institute Working Paper Series 372019, GDI, The University of Manchester. Available online at: https:\/\/ideas.repec.org\/p\/bwp\/bwppap\/372019.html (accessed October 25, 2022). Google Scholar Behuria, P. (2021). Ban the (plastic) bag? Explaining variation in the implementation of plastic bag bans in Rwanda, Kenya and Uganda. Environ. Plan. C. 39, 1–18. doi: 10.1177\/2399654421994836 CrossRef Full Text | Google Scholar Bishumba, N. (2018). Imported packaging materials to be struck off the tax-exempt list. The New Times. Available online at: https:\/\/www.newtimes.co.rw\/article\/148895\/News\/imported-packaging-materials-to-be-struck-off-tax-exempt-list (accessed October 25, 2022). Clapp, J., and Swanston, L. (2009). Doing away with plastic shopping bags: international patterns of norm emergence and policy implementation. Environ. Polit. 18, 315–332. doi: 10.1080\/09644010902823717 CrossRef Full Text | Google Scholar Danielsson, M., Wockelberg, H., and Kall, W. (2017). The Plastic Bag Ban in Rwanda: Local Procedures and Successful Outcomes -A Case Study on how Rwanda Implemented a Nation-wide Ban on Plastic Bags. Available online at: https:\/\/www.diva-portal.org\/smash\/get\/diva2:1067480\/FULLTEXT01.pdf (accessed October 25, 2022). Google Scholar Desmond, P., and Asamba, M. (2019). “Accelerating the transition to a circular economy in Africa: Case studies from Kenya and South Africa,” in The Circular Economy and the Global South: Sustainable Lifestyles and Green Industrial Development, eds. Schröder, P., Anantharaman, M., Anggraeni, K., and Foxon, T.J, . (London: Routledge). doi: 10.4324\/9780429434006-9 CrossRef Full Text | Google Scholar Dsilva, E. (2019). Going surgical on plastics in Rwanda. Available online at: https:\/\/www.downtoearth.org.in\/news\/waste\/going-surgical-onplastics-in-rwanda-68446 (accessed March 25, 2021). Google Scholar Elisabeth, I. (2021). REMA once again issues warning on the Use of Plastic Items on Rwandan soil (Top Africa News). Available online at: https:\/\/www.topafricanews.com\/2021\/05\/03\/rema-once-again-issues-warning-on-the-use-of-plastic-items-on-rwandan-soil\/ (accessed May 3, 2021). European Parliament (2008). Directive 2008\/98\/EC of the European Parliament and of the Council of 19 November 2008 on Waste and Repealing Certain Directives. Official Journal of the European Union. Google Scholar Ghisellini, P., Cialani, C., and Ulgiati, S. (2016). A review on circular economy: the expected transition to a balanced interplay of environmental and economic systems. J. Clean. Prod. 114, 11–32. doi: 10.1016\/j.jclepro.2015.09.007 CrossRef Full Text | Google Scholar Government of Rwanda (2020). Vision 2050. Available online at: https:\/\/www.nirda.gov.rw\/uploads\/tx_dce\/Vision_English_Version_2050_-31_Dec_2020.pdf (accessed October 25, 2022). Government of Rwanda (2019). Official Gazette n° 37 bis of 23\/09\/2019. LAW N° 17\/2019 OF 10\/08\/2019 Relating to the Prohibition of Manufacturing, Importation, use and sale of plastic carry bags and single use plastic items. Available online at: https:\/\/elaw.org\/system\/files\/attachments\/publicresource\/Law_relating_to_the_prohibition_of_manufacturing__importation__use_and_sale_of_plastic_carry_bags.pdf (accessed October 25, 2022). Government of Rwanda. (2005). Organic Law 4\/2005 Determining the Modalities of Protection, Conservation, and Promotion of Environment in Rwanda. Official Gazette of the Republic of Rwanda. Available online at: https:\/\/www.climate-laws.org\/geographies\/rwanda\/laws\/organic-law-4-2005-determining-the-modalities-of-protection-conservation-and-promotion-of-environment-in-rwanda (accessed February 20, 2022). Google Scholar Government of Rwanda (2012). Rwanda Vision 2020 - Revised 2012. Available online at: https:\/\/www.nirda.gov.rw\/uploads\/tx_dce\/05_-_Vision_2020_06.pdf (accessed June, 2022). Google Scholar Government of Rwanda (2016). Rwanda AGOA Action Plan. Available online at: https:\/\/agoa.info\/images\/documents\/6212\/rwanda-agoa-strategyr.pdf (accessed October 25, 2022). Greenpeace Africa (2020). 34 Plastic Bans in Africa | A Reality Check. Greenpeace Africa. Available online at: https:\/\/www.greenpeace.org\/africa\/en\/blogs\/11156\/34-plastic-bans-in-africa\/ (accessed October 25, 2022). Google Scholar Hakuzimana, J. (2021). Break free from plastics: environmental perspectives and evidence from Rwanda. Environ. Ecosyst. Sci. (EES). 5, 27–36. doi: 10.26480\/ees.01.2021.27.36 CrossRef Full Text | Google Scholar Jian, X., and Martin, J. (2022). Plastic Waste Management in Rwanda: An Ex-post Policy Analysis. Washington, DC: The World Bank. Available online at: https:\/\/openknowledge.worldbank.org\/handle\/10986\/37607 (accessed October 25, 2022). Karuhanga, J. (2017). EALA votes to ban polythene bags. The New Times, 2 June. Available online at: https:\/\/www.newtimes.co.rw\/section\/read\/213545\/ (accessed October 25, 2022). Google Scholar Kirchherr, J., Reike, D., and Hekkert, M. (2017). Conceptualising the circular economy: an analysis of 114 definitions. Resour. Conser. Recycl. 127, 221–232. doi: 10.1016\/j.resconrec.2017.09.005 CrossRef Full Text | Google Scholar Kumar, R. (2011). Research Methodology: A Step-by-Step Guide for Beginners, 3rd Edn. New Delhi: Sage. Google Scholar Leonard, S., and Barra, R. (2018). Plastics and the circular economy. Scientific and Technical Advisory Panel to the Global Environment Facility. Washington, DC. Available online at: https:\/\/stapgef.org\/resources\/advisory-documents\/plastics-and-circular-economy (accessed October 25, 2022). Google Scholar Mbonyinshuti, J. (2019). Firms should be given more time to phase out single use plastics: MPs. Available online at: https:\/\/www.newtimes.co.rw\/news\/phase-single-use-plastics (accessed February 18, 2019). Moraes, C. (2021). Rwandan Investor funding project to recycle plastic waste into construction materials. Construct Africa. Available online at: https:\/\/www.constructafrica.com\/news\/rwandan-investor-funding-project-recycle-plastic-waste-construction-materials (accessed December 31, 2021). Google Scholar Nibeza, S. (2015). Sustainable environment, a key to sustainable development, a case study of Rwanda. Int. J. Res. Econ. Soc. Sci. 5, 20–36. Available online at: https:\/\/euroasiapub.org\/wp-content\/uploads\/2016\/09\/3ESSJune-2261-1.pdf (accessed May 20, 2021). PubMed Abstract | Google Scholar Nkurunziza, M. (2019). How banning of single-use plastics will contribute to environment protection for Rwanda's green development. New Times Rwanda. Available online at: https:\/\/www.newtimes.co.rw\/news\/featured-how-banning-single-use-plastics-will-contribute-environment-protection-rwandas-green (accessed December 03, 2019). Google Scholar Nkurunziza, M. (2022). No extension of grace period for single-use plastics - Rema. New Times Rwanda. Available online at: https:\/\/www.newtimes.co.rw\/article\/193139\/News\/no-extension-of-grace-period-for-single-use-plastics—rema (accessed August 20, 2022). Google Scholar PBL Netherlands Environmental Assessment Agency (2017). Circular Economy: Measuring Innovation in the Product Chain. Policy Report. Google Scholar REMA (2019). Guidelines on Procedures and Conditions for Eligibility to grant exceptional permission to manufacture, use, import, or sell single-use plastic items or pack goods in single use plastics. Available online at: https:\/\/elaw.org\/system\/files\/attachments\/publicresource\/RW_BanException_Guidelines_2019.pdf (accessed October 25, 2022). Google Scholar REMA. (2021). All eligible manufacturers who want to get REMA authorization to import PET materials will have to contribute to the sustainable management of Single Use Plastics Project (PET). Twitter. Available online at: https:\/\/twitter.com\/rema_rwanda\/status\/1426165570253246468 (accessed October 20, 2022). Google Scholar Rizos, V., Behrens, A., Van der Gaast, W., Hofman, E., Ioannou, A., Kafyeke, T., et al. (2016). Implementation of circular economy business models by small and medium-sized enterprises (SMEs): Barriers and enablers. Sustainability. 8, 1212. doi: 10.3390\/su8111212 CrossRef Full Text | Google Scholar Shabiti, D. (2021). Rwanda Steps Up Single Use Plastic Ban Ahead of September Deadline. KT PRESS. Available online at: https:\/\/www.ktpress.rw\/2021\/05\/rwanda-steps-up-single-use-plastic-ban-ahead-of-september-deadline\/ (accessed October 25, 2022). Google Scholar Siegel, P. B., Gatsinzi, J., and Kettlewell, A. (2011). Adaptive social protection in Rwanda: ‘Climate-proofing the Vision 2020 Umurenge Programme. IDS Bull. 42, 71–78. doi: 10.1111\/j.1759-5436.2011.00276.x CrossRef Full Text | Google Scholar Sihvonen, S., and Ritola, T. (2015). “Conceptualizing ReX for aggregating end-of-life strategies in product development,” in Procedia CIRP. p. 639–644. doi: 10.1016\/j.procir.2015.01.026 CrossRef Full Text | Google Scholar Simo, R. Y. (2019). Of sustainable development in africa: addressing the (In)congruence of plastic bag regulations with international trade rules. Brooklyn J. Int. Law. 45, 240–299. doi: 10.2139\/ssrn.3391826 CrossRef Full Text | Google Scholar UNEP (2018a). United Nations Environment Programme News and Stories, “Back to School Plastic Challenge,”. Available online at: https:\/\/www.unenvironment.org\/news-and-stories\/story\/school-year-help-us-turn-tide-plastic (accessed Octomber 14, 2019). Google Scholar UNEP (2018b). Single-use plastics: A Roadmap for Sustainability (Rev. ed., pp. vi; 6). Available online at: https:\/\/www.unep.org\/resources\/report\/single-use-plastics-roadmap-sustainability (accessed October 25, 2022). Google Scholar UNEP (2018c). Our planet is drowning in plastic pollution. This World Environment Day, it's time for a change. Available online at: https:\/\/www.unep.org\/interactive\/beat-plastic-pollution\/ (accessed October 25, 2022). Google Scholar United Nations (2022). Speakers Call for International Treaty on Plastic Pollution, Circular Economic Models to Promote Reusability, Reduce Waste, as Stockholm+50 Meeting Concludes. Available online at: https:\/\/press.un.org\/en\/2022\/envdev2048.doc.htm (accessed October 25, 2022). Google Scholar Valenzuela, F., and Böhm, S. (2017). Against wasted politics: A critique of the circular. Ephemera. 17, 23–60. Available online at: https:\/\/ephemerajournal.org\/sites\/default\/files\/2022-01\/17-1valenzuelabohm.pdf (accessed May 20, 2021). Google Scholar Van Buren, N., Demmers, M., Van der Heijden, R., and Witlox, F. (2016). Towards a circular economy: The Role of Dutch Logistics Industries and Governments. Sustainability. 8, 647. doi: 10.3390\/su8070647 CrossRef Full Text | Google Scholar Whyte, C., Irakoze, G., Katanisa, P., Desmond, P., Hemkhaus, M., Ahlers, J., et al. (2020). Circular economy in the Africa EU cooperation - Country Report for Rwanda. Country report under EC Contract ENV.F.2.\/ETU\/2018\/004 Project: “Circular Economy in Africa-EU cooperation”, Trinomics B.V., ACEN, Adelphi Consult GmbH and Cambridge Econometrics Ltd. Available online at: https:\/\/trinomics.eu\/wp-content\/uploads\/2020\/12\/Country-Report-Rwanda_Final_20122020.pdf (accessed October 25, 2022). Google Scholar","filter_flag":1}
{"title":"Flipkart Launches ‘Flipkart Green’ for Customers Looking to Adopt a Sustainable Lifestyle - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2ZsaXBrYXJ0LWxhdW5jaGVzLWZsaXBrYXJ0LWdyZWVuLWN1c3RvbWVycy1sb29raW5nLWFkb3B0LXN1c3RhaW5hYmxlLWxpZmVzdHlsZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2ZsaXBrYXJ0LWxhdW5jaGVzLWZsaXBrYXJ0LWdyZWVuLWN1c3RvbWVycy1sb29raW5nLWFkb3B0LXN1c3RhaW5hYmxlLWxpZmVzdHlsZdIBAA?oc=5","id":"CBMicmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2ZsaXBrYXJ0LWxhdW5jaGVzLWZsaXBrYXJ0LWdyZWVuLWN1c3RvbWVycy1sb29raW5nLWFkb3B0LXN1c3RhaW5hYmxlLWxpZmVzdHlsZdIBAA","guidislink":false,"published":"Thu, 05 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=5, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=5, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2ZsaXBrYXJ0LWxhdW5jaGVzLWZsaXBrYXJ0LWdyZWVuLWN1c3RvbWVycy1sb29raW5nLWFkb3B0LXN1c3RhaW5hYmxlLWxpZmVzdHlsZdIBAA?oc=5\" target=\"_blank\">Flipkart Launches ‘Flipkart Green’ for Customers Looking to Adopt a Sustainable Lifestyle<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Flipkart Launches ‘Flipkart Green’ for Customers Looking to Adopt a Sustainable Lifestyle - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2ZsaXBrYXJ0LWxhdW5jaGVzLWZsaXBrYXJ0LWdyZWVuLWN1c3RvbWVycy1sb29raW5nLWFkb3B0LXN1c3RhaW5hYmxlLWxpZmVzdHlsZdIBAA?oc=5\" target=\"_blank\">Flipkart Launches ‘Flipkart Green’ for Customers Looking to Adopt a Sustainable Lifestyle<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental conservation\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Retail India News: Juicy Chemistry and Mommy Shots by Amrita Unveil 'Scars are Beautiful' In honor of Women’s Day, Juicy Chemistry and Mommy Shots by Amrita join forces for the 'Scars are Beautiful' campaign, shedding light on the beauty of postpartum bodies and stretch marks. The campaign, launched on March 5th, 2024, features 11 mothers proudly displaying their bodies and sharing their motherhood experiences to inspire other women to embrace their bodies and change societal perceptions. Era Vashishta, mother of a 2.5-year-old shares her story “ I was diagnosed with chronic PCOD when I was 28, which got me very scared as to whether or not I would ever get pregnant or have a baby. I never thought of motherhood before this. Because of the PCOD it made me want to be a mom, because I thought maybe I might not happen. After which, I became a mom and everything changed. As soon as I met my baby that’s when I knew this is someone I want to protect for the rest of my life, the love is unconditional. It was so scary and overwhelming, but once you hang on to all these feelings you wouldn’t have it any other way, I’d never not want to be a mom. My scars are my tiger stripes, because I think I draw a lot of power from them. I’m a mom and this body gave birth to a life, which is what makes me bigger, it makes me a tiger.” Megha Asher, the Co-Founder and COO of Juicy Chemistry said, “At Juicy Chemistry, we believe in promoting self-love and body positivity, and we are thrilled to partner with Mommy Shots for this unique campaign. Through this powerful photo series, we hope to inspire and empower women to embrace their bodies, and scars not just physical but emotional ones as well, and celebrate their unique journeys of motherhood. As mothers ourselves, we understand the challenges that come with motherhood and the impact it can have on a woman's body and self-perception. We hope that this campaign will help shift the narrative and encourage women to see their bodies as beautiful and strong, no matter their shape or size. Together, we can create a more inclusive and diverse representation of beauty and promote self-love and acceptance for all women.\" Amrita Samant, Founder and CEO Mommyshots said, “In my world of photography, motherhood, babies and art, creating something meaningful that helps change the world obsessed with perfection was very close to my heart. We want to redefine beauty with every line and every scar that spells resilience strength and a unique journey, we want to go beyond the surface with this campaign. They’re more than blemishes, they’re badges of honor, they are tender and timeliness. I am super proud of the 11 women who came forward to normalize what the society has for far too long considered unsightly.” Sonia Chandrakumar, one of the 11 mothers who posed and actively participated in the shoot said, “The journey of motherhood is very different for me, I had a really tough time the first 6 months. I had all kinds of nausea, I could not brush my teeth and I had a lot of body changes that took place. My husband was my greatest support because he constantly reminded me that there’s something beautiful coming out of this and if you want something beautiful in life you need to cope with the changes that take place in your body or yourself. So I kept reminding myself and dealing with the challenges. I’d describe my marks as Caleb’s wonderful art palette that I have around my stomach. I would not want to get rid of my marks, I want to keep it as a memory.” Motherhood scars, resembling intricate battle scars, symbolize the strength and resilience embedded in a woman's journey. Each mark narrates a story of endurance and courage, celebrating the remarkable strength of women. In honoring these scars, we acknowledge the transformative power of motherhood, inspiring women to embrace their bodies and celebrate their unique journeys. #scarsarebeautiful ","filter_flag":1}
