{"title":"Complimentary Recycling Strengthens Circular Plastics Economy - PlasticsToday","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnBsYXN0aWNzdG9kYXkuY29tL2FkdmFuY2VkLXJlY3ljbGluZy9jb21wbGltZW50YXJ5LXJlY3ljbGluZy1zdHJlbmd0aGVucy1jaXJjdWxhci1wbGFzdGljcy1lY29ub2150gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnBsYXN0aWNzdG9kYXkuY29tL2FkdmFuY2VkLXJlY3ljbGluZy9jb21wbGltZW50YXJ5LXJlY3ljbGluZy1zdHJlbmd0aGVucy1jaXJjdWxhci1wbGFzdGljcy1lY29ub2150gEA?oc=5","id":"CBMibmh0dHBzOi8vd3d3LnBsYXN0aWNzdG9kYXkuY29tL2FkdmFuY2VkLXJlY3ljbGluZy9jb21wbGltZW50YXJ5LXJlY3ljbGluZy1zdHJlbmd0aGVucy1jaXJjdWxhci1wbGFzdGljcy1lY29ub2150gEA","guidislink":false,"published":"Thu, 23 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=23, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=54, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnBsYXN0aWNzdG9kYXkuY29tL2FkdmFuY2VkLXJlY3ljbGluZy9jb21wbGltZW50YXJ5LXJlY3ljbGluZy1zdHJlbmd0aGVucy1jaXJjdWxhci1wbGFzdGljcy1lY29ub2150gEA?oc=5\" target=\"_blank\">Complimentary Recycling Strengthens Circular Plastics Economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PlasticsToday<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Complimentary Recycling Strengthens Circular Plastics Economy - PlasticsToday","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnBsYXN0aWNzdG9kYXkuY29tL2FkdmFuY2VkLXJlY3ljbGluZy9jb21wbGltZW50YXJ5LXJlY3ljbGluZy1zdHJlbmd0aGVucy1jaXJjdWxhci1wbGFzdGljcy1lY29ub2150gEA?oc=5\" target=\"_blank\">Complimentary Recycling Strengthens Circular Plastics Economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PlasticsToday<\/font>","source.href":"https:\/\/www.plasticstoday.com","source.title":"PlasticsToday","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Governments are getting serious about tackling the environmental risks posed by plastics that enter the waste stream, spurring exploration into achieving true plastics circularity. However, developments in advanced recycling technology are just one part of the equation. We must close the loop between recycling infrastructure owners and operators, plastics manufacturers, and consumer goods manufacturers to further improve the recycling rate. According to the Organisation for Economic Co-operation and Development, globally, only 9% of plastic waste is recycled. Of all the plastic manufactured between 1950 and 2017, 7 billion tonnes have become waste and that amount continues to grow. Today, the world produces twice as much plastic as two decades ago, and 8 million tons a year end up in oceans. By 2050, there could be more plastic in the sea than fish, according to the World Wildlife Fund. While reducing plastic use can help, the need for plastics is unlikely to disappear anytime soon. Plastic materials play an important role in preserving the shelf life of foods, protecting medical products from contamination, and the list goes on. Overall, our global society still needs plastics to maintain and expand a healthy, modern and safe standards of living. However, this doesn’t negate the plastics pollution problem. It just challenges critical decision-makers to avoid over-simplifying the issue and implement realistic and effective solutions to reduce plastic waste. Governments take action to reduce plastic waste. Around the world, national, state, and local government agencies are trying to reduce plastic waste. These measures can take the form of restrictions or bans on common single-use conveniences, like plastic bags at groceries stores. In another example, the US has seen growing interest in extended producer responsibility (EPR) legislation, which would require companies that put packaging into the marketplace to pay for its collection, sorting, and recycling after use. Maine and Oregon have already implemented EPR regulations, and another nine states are expected to follow suit in the near future. Meanwhile, 24 national governments have now adopted the New Plastics Economy Global Commitment launched in 2018 by the Ellen MacArthur Foundation and the United Nations Environment Programme, and hundreds of businesses - representing 20% of all plastic packaging produced worldwide – have also signed on to the initiative. Signatories of the Global Commitment endorse a shared vision for a “circular economy” for plastic in which it never becomes waste, and they commit to taking concrete actions by 2025 to realize that vision. Each signatory is expected to report annually on its progress. For example, France’s “3R” decree for packaging obligates all single-use plastic packaging marketers to work towards 100% recycling by 2025. The United Kingdom, meanwhile, has introduced taxes on packaging containing less than 30% recycled content to achieve that level for all plastic packaging by the same date. The Ellen MacArthur Foundation is also spearheading an initiative to create a new United Nations treaty on plastic pollution. Legislation alone will not solve the problem, however. Society also needs a holistic approach to achieving increased plastics recycling, and that means embracing a full range of technologies. New technology to address complex recycling challenges include pyrolysis. Today, mechanical recycling technologies process most of the plastic that is diverted from the waste stream. In this process, plastic is washed, chipped, melted, and reformed into pellets used to create new products. This method is widely adopted for its accessibility, energy efficiency, and cost effectiveness. New developments have even expanded the range of plastics that can be mechanically recycled beyond polyethylene terephthalate (PET) to include trickier materials like flexible packaging. However, mechanical recycling has its limitations. The physical properties of the material degrade in the process, and the plastics recycled using these methods are suitable for fewer applications and often “downgraded” to applications like the manufacture of park benches, certain fabrics for apparel, etc. Certain plastics are difficult to process through mechanical recycling altogether. Many films, mixed materials, and heavily pigmented plastics are generally unsuitable for mechanical recycling. At the same time, regulation restricts the recycled plastic content that can be used for certain applications, such as food-contact packaging, which may require further sterilization or decontamination before it can be used. Advanced recycling via pyrolysis turns flexible packaging and other mixed materials into oil (inset) that can be converted into new polymers. By contrast, chemical recycling breaks plastics down at the molecular level. The pyrolysis oils that are produced are routed to steam crackers and displace fossil-based feed streams. Steam crackers produce the monomers which are subsequently polymerized to create new plastics that replace fossil fuel-based plastic sources. According to Ghent University and Honeywell internal data, the yield of monomers produced in the steam cracker from recycled plastic pyrolysis oils is akin to fossil-based feedstocks. Recent developments in chemical recycling’s pyrolysis technology enable more effective processing of sorted mixed waste into high-quality, food-grade recycled plastics that offer the same levels of safety and performance as plastics made from conventional (fossil-fuel) sources. By combining pyrolysis with contaminants management and molecular conversion, Honeywell UOP has a commercially viable pyrolysis process that upgrades low-quality waste plastics into recycled polymer feedstock that can be used to produce new, virgin-quality plastics. The Honeywell UOP UpCycle Process Technology expands the universe of plastics that can be recycled and diverts them from landfill or incineration. Critical collaboration between mechanical and advanced recycling. Crucially, the two processes — mechanical and advanced recycling — are complementary rather than competitive. Where waste is suitable, mechanical recycling offers a simple, low-emissions method to return plastics to use. Where the plastic is contaminated, complex, or quality, advanced recycling prevents it from ending in landfill or incinerated and can radically reduce the need for virgin plastics. By advancing chemical recycling to process more of the plastics that cannot be recycled through established channels, we can build on an existing foundation of recycling infrastructure rather than wasting time and emissions reinventing the wheel. Just as the two technologies can work together to bring us closer to the plastics circular economy, collaboration amongst all parts of the waste management system is also needed — across converters, recyclers, processors, retailers, and consumer goods manufacturers. A key obstacle in tackling plastics recycling has been disconnects and inconsistencies between these key players and their approaches to recycling. The capabilities of private and municipal recyclers vary wildly by geography and consumer confusion over what plastics can be recycled and what their towns, cities, or countries can recycle has fuelled disenchantment. Honeywell has aimed to connect these various players by working with waste management companies to license their UpCycle Process Technology, providing an easier path to adopting the mechanisms of advanced recycling. Brands play a key role in communicating packaging and recycling processes to consumers. Once the capability exists, though, it is vital for all parties involved to educate consumer audiences on how these changes should impact recycling habits and advocate for the necessary changes in collection efforts. Brands can play a particularly important role in the conversation to work collectively and persistently to communicate changes to packaging materials and recycling practices to consumers. That collaboration is already increasing among businesses, working together to increase collections from stores, retailers, and manufacturers. There is more work to do, of course, but the focus must also turn to consumers — encouraging them to recycle and, crucially, making it as easy as possible to do so by reducing barriers such as the need to sort different materials. To make that work and ultimately achieve the circular economy that industry, governments and the public want will require using the full range of tools and technology offered. Kevin Quast, Global Head of Honeywell Plastics Circularity Business, is responsible for developing and executing the business and commercialization strategy to grow the Plastics Circularity business leveraging product technology, industry partnerships, and alternate business models. Prior to joining Honeywell, Quast served as a principal consultant for some of the largest consulting firms, such as Deloitte, Accenture, and PwC, where he led the global strategy and digital transformation practices. He is a published author on multiple topics ranging from M&A strategy to corporate transformation and workforces of the future. In addition to his consulting background, Quast spent over a decade in industry, and he has lived and worked in multiple countries assisting many of the major energy and pharmaceutical companies in market expansion and strategy efforts. Kevin started his career at Chevron as a Process Capital Projects Engineer, where he received the Chevron EH&S Design Excellence Award for greatly improving environment quality.","filter_flag":1}
{"title":"Recycle Track Systems announces acquisition of Cycle Technology - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvcmVjeWNsZS10cmFjay1zeXN0ZW1zLWFubm91bmNlcy1hY3F1aXNpdGlvbi1vZi1jeWNsZS10ZWNobm9sb2d5LTMwMTc0NTc3NC5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvcmVjeWNsZS10cmFjay1zeXN0ZW1zLWFubm91bmNlcy1hY3F1aXNpdGlvbi1vZi1jeWNsZS10ZWNobm9sb2d5LTMwMTc0NTc3NC5odG1s0gEA?oc=5","id":"CBMid2h0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvcmVjeWNsZS10cmFjay1zeXN0ZW1zLWFubm91bmNlcy1hY3F1aXNpdGlvbi1vZi1jeWNsZS10ZWNobm9sb2d5LTMwMTc0NTc3NC5odG1s0gEA","guidislink":false,"published":"Mon, 13 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=44, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvcmVjeWNsZS10cmFjay1zeXN0ZW1zLWFubm91bmNlcy1hY3F1aXNpdGlvbi1vZi1jeWNsZS10ZWNobm9sb2d5LTMwMTc0NTc3NC5odG1s0gEA?oc=5\" target=\"_blank\">Recycle Track Systems announces acquisition of Cycle Technology<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Recycle Track Systems announces acquisition of Cycle Technology - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvcmVjeWNsZS10cmFjay1zeXN0ZW1zLWFubm91bmNlcy1hY3F1aXNpdGlvbi1vZi1jeWNsZS10ZWNobm9sb2d5LTMwMTc0NTc3NC5odG1s0gEA?oc=5\" target=\"_blank\">Recycle Track Systems announces acquisition of Cycle Technology<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"RTS continues commitment to innovation in recycling through acquiring Cycle Reverse Vending Machines NEW YORK, Feb. 13, 2023 \/PRNewswire\/ -- Recycle Track Systems, Inc. (RTS), a leader in cutting edge traceability and sustainability solutions utilized in the materials, waste, and recycling industry, has acquired the assets of Cycle Technology, Inc. (Cycle), including its reverse vending machine (RVM) technology and recycling rewards platform, as part of ongoing commitment to increase innovation by expanding recycling through engagement programs, like gamification and rewards. Recycle Track Systems (RTS) announces acquisition of Cycle Technology, Inc. Post this Recycle Track Systems, Inc. (RTS), has acquired Cycle Technology, Inc. (Cycle), including its reverse vending machine (RVM) technology and recycling rewards platform, as part of ongoing commitment to increase innovation by expanding recycling through engagement programs, like gamification and rewards. Cycle powered by RTS partners with teams across the MLB, MLS, and NFL to increase recycling rates and reduce waste, and today is available in select stadiums. Cycle made its debut with HEINEKEN USA and Inter Miami CF in early 2022 then quickly expanded as part of Anheuser-Busch's National Recycling League, a multi-sports league coalition aiming to reduce waste on game day, to first launch at Washington Nationals' Nationals Park, then with the Philadelphia Eagles. The Eagles were the first team in the NFL to debut the emerging technology, offering prizes from autographed items to even tickets to next year's season opener, for fans who make use of them at their home games at Lincoln Financial Field. This past weekend, RTS and Cycle brought RVM technology to the big game for the first-time with Anheuser-Busch. Cycle co-founder, Anwar Khan, shared \"Cycle and RTS have been collaborating over the last year and it was clear, given their size and scale, for us to formally team up. We are thrilled to expand the impact RVMs have through RTS's expansive portfolio of services and clients, and through the mentorship of their executive team. Greg Lettieri has been a tremendous mentor and resource to Cycle, and we look forward to growing with him and his team's leadership. From humble beginnings in our freshman dorm rooms, all of us on the Cycle team never imagined this outcome when we first started, and we are grateful for all those that have been a part of this journey.\" Today, RTS is also the proud sustainable materials management provider for professional teams, including the New York Mets' Citi Field and Brooklyn Nets' Barclays Center, assisting in reduced emissions through increasing diversion from landfill and providing sustainable material management services powered by real-time metrics and feedback regarding the team's waste management practices. With the help of RTS, Philadelphia Union's Subaru Park was able to achieve zero landfill status, meaning that all of the waste generated at games was reduced, reused or recycled. RTS Chief Executive Officer, Greg Lettieri, \"RTS's momentum has been rooted in our ability to deliver cutting-edge waste management solutions that inspire and incentivize consumers to strive for sustainability. Our acquisition of Cycle adds an interactive, real-time recycling experience our customers can leverage. At RTS, Cycle joins Zerowaste.com, Recyclebank and our expanding suite of innovative, industry-leading products that are driving the community engagement and education our customers need to meet their zero waste goals.\" Together with Cycle reverse vending machine (RVM) technology and recycling rewards platform, RTS will continue to highlight the importance of existing sustainability efforts on and off the field, by engaging fans on recycling across our network of stadium, event, and other commercial facilities. About Recycle Track Systems, Inc. Recycle Track Systems, Inc. combines technology with high-touch service to make waste disposal easier, smarter, and more responsible. From on-demand removal to fully integrated waste management solutions, RTS helps companies and municipalities easily track and optimize their pickups. Using data insight, RTS empowers clients with visibility into their waste habits and tangible figures on their climate impact to improve their waste and recycling practices. For more information, visit rts.com or follow RTS on Linkedin , Facebook , Instagram or Twitter . For more zero-waste resources, visit zerowaste.com or follow on Facebook , Instagram or Twitter . About Cycle As part of RTS' portfolio of IoT products, Cycle is a recycling technology and data platform that rewards fans and event-goers for recycling their empty beverage containers at Reverse Vending Machines (RVMs). For more information, visit rts.com\/cycle or follow Cycle on LinkedIn , Instagram , or Twitter . CONTACT: Lindsey Casella Marketing & Communications, VP at Recycle Track Systems [email protected] SOURCE Recycle Track Systems (RTS)","filter_flag":1}
