{"title":"WinCup Announces Transition of Foam Products to its Biodegradable Vio Technology - Packaging Strategies","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDM5OTItd2luY3VwLWFubm91bmNlcy10cmFuc2l0aW9uLW9mLWZvYW0tcHJvZHVjdHMtdG8taXRzLWJpb2RlZ3JhZGFibGUtdmlvLXRlY2hub2xvZ3nSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDM5OTItd2luY3VwLWFubm91bmNlcy10cmFuc2l0aW9uLW9mLWZvYW0tcHJvZHVjdHMtdG8taXRzLWJpb2RlZ3JhZGFibGUtdmlvLXRlY2hub2xvZ3nSAQA?oc=5","id":"CBMihAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDM5OTItd2luY3VwLWFubm91bmNlcy10cmFuc2l0aW9uLW9mLWZvYW0tcHJvZHVjdHMtdG8taXRzLWJpb2RlZ3JhZGFibGUtdmlvLXRlY2hub2xvZ3nSAQA","guidislink":false,"published":"Thu, 27 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=208, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDM5OTItd2luY3VwLWFubm91bmNlcy10cmFuc2l0aW9uLW9mLWZvYW0tcHJvZHVjdHMtdG8taXRzLWJpb2RlZ3JhZGFibGUtdmlvLXRlY2hub2xvZ3nSAQA?oc=5\" target=\"_blank\">WinCup Announces Transition of Foam Products to its Biodegradable Vio Technology<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Strategies<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"WinCup Announces Transition of Foam Products to its Biodegradable Vio Technology - Packaging Strategies","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDM5OTItd2luY3VwLWFubm91bmNlcy10cmFuc2l0aW9uLW9mLWZvYW0tcHJvZHVjdHMtdG8taXRzLWJpb2RlZ3JhZGFibGUtdmlvLXRlY2hub2xvZ3nSAQA?oc=5\" target=\"_blank\">WinCup Announces Transition of Foam Products to its Biodegradable Vio Technology<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Strategies<\/font>","source.href":"https:\/\/www.packagingstrategies.com","source.title":"Packaging Strategies","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Alternatives\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"In a major shift in its product portfolio, WinCup, a leading national manufacturer of disposable foodservice products, has announced it will transition its core traditional products, including foam cups, food containers, bowls, lids, and polypropylene straws, to its Vio® biodegradable* technology platform. Founded in 1961, WinCup has grown into a national leader in foodservice packaging products. Over the decades, its foam to-go cups, lids and containers have become a preferred option for many major national brands. Under its current leadership, WinCup made a commitment to focus on innovative solutions that are more environmentally friendly than its traditional offerings. The company first launched Vio cups in 2016, and they have become very popular for customers seeking biodegradable solutions. Moving forward, all of WinCup’s foam products will be manufactured with this Vio technology. “Here in the U.S., the reality is that less than 10% of plastic actually gets recycled, and the vast majority of foodservice items end up in a landfill,” said Brad Laporte, WinCup’s CEO. “Our Vio branded products tackle this issue head on, and our Vio foam will biodegrade in a majority of landfills in about four years versus traditional plastic that takes decades or even centuries to go away.” Laporte added: “The time is right for WinCup to take an eco-friendly leadership position in the industry by investing in our customers and transitioning all of our WinCup branded foam, lids, and polypropylene straws to the Vio biodegradable technology, not because it’s easy, but because it’s the right thing to do.” The Vio product line offers numerous benefits that align with WinCup's commitment to the environment and customer satisfaction. Vio is created with an FDA food contact safe additive that allows products to biodegrade. Vio products are also recyclable in foam recycling programs or facilities where available, helping to ensure a reduced environmental impact. Vio foam maintains the strength and comfort associated with traditional foam so that customers enjoy the same quality and functionality without compromising their experience. Because WinCup is committed to making eco-friendly alternatives accessible to all, cost for Vio products will remain the same as its traditional foam products. WinCup's dedication to affordability ensures that environmental responsibility is within reach for businesses of all sizes. News of the Vio transition comes as WinCup’s sustainable brand phade® is also making major impacts nationwide in the straw, stirrer, and paper cup segments among multiple channels such as restaurants, big box retailers, hospitality, and professional sports. WinCup’s focus on sustainable solutions was bolstered in September 2020 when Los Angeles-based global private investment firm Atar Capital acquired the company. Among Atar’s core principles is a commitment to sustainability and investing in companies that work toward protecting the environment. For more information about Vio®, please visit viofoam.com. * Vio® cups biodegrade 92% after 4 years, Vio® lids biodegrade 86.8% after 7.9 years, & Vio® straws biodegrade 88.5% after 7 years. Tested under conditions that simulate both wetter and biologically active landfills, using the ASTM D5511 test. Wetter or biologically active landfills may not exist in your area. The stated rate and extent of degradation do not mean that the product will continue to decompose. ","filter_flag":1}
{"title":"Karin Fleck | CEO | Vienna Textile Lab - Fibre2fashion.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvdmllbm5hLXRleHRpbGUtbGFiL2thcmluLWZsZWNrLzEzNjU5LTHSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvdmllbm5hLXRleHRpbGUtbGFiL2thcmluLWZsZWNrLzEzNjU5LTHSAQA?oc=5","id":"CBMiXmh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvdmllbm5hLXRleHRpbGUtbGFiL2thcmluLWZsZWNrLzEzNjU5LTHSAQA","guidislink":false,"published":"Mon, 03 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=184, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvdmllbm5hLXRleHRpbGUtbGFiL2thcmluLWZsZWNrLzEzNjU5LTHSAQA?oc=5\" target=\"_blank\">Karin Fleck | CEO | Vienna Textile Lab<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2fashion.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Karin Fleck | CEO | Vienna Textile Lab - Fibre2fashion.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvdmllbm5hLXRleHRpbGUtbGFiL2thcmluLWZsZWNrLzEzNjU5LTHSAQA?oc=5\" target=\"_blank\">Karin Fleck | CEO | Vienna Textile Lab<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2fashion.com<\/font>","source.href":"https:\/\/www.fibre2fashion.com","source.title":"Fibre2fashion.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Alternatives\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Microbial dyes have the potential to revolutionise the textile industry Vienna Textile Lab transforms naturally occurring bacteria into organic, sustainable colours, revolutionising the textile industry. It provides eco-friendly alternatives to conventional dyes, fostering responsible, environmentally thoughtful design practices. In an interview with Fibre2Fashion, CEO Karin Fleck discusses production of textile dyes from bacteria, and how it can contribute to sustainability. How do you see the future of sustainable textiles and fashion evolving in terms of consumer demand, technological advancements, and industry collaboration? I have noticed an increasing diversity and complexity in the industry, driven by the growing demands of consumers who are now more curious about the manufacturing processes and materials used in products. This shift has brought about a renewed focus on sustainability, social welfare, and innovation. The industry itself is vast and interconnected, encompassing both mass manufacturing and small family businesses. This diversity presents unique challenges and opportunities for all stakeholders involved. What are some of the key challenges that the textile industry faces in achieving widespread adoption of sustainable practices, and how can these challenges be addressed? There is a noticeable trend in the industry where fashion companies are embracing new technologies that were not traditionally used before, such as biotechnology and electrochemistry. This shift has led to the hiring of sustainability experts, bioengineers, and other professionals to develop in-house knowledge and establish new material supply chains, even before these innovations are fully market-ready. By proactively investing in these areas, companies aim to stay ahead of the curve and meet the growing consumer demand for sustainable and innovative products. This strategic approach allows the textile industry to shape the future of the industry and contribute to the development of more environmentally friendly and socially responsible practices. What are some of the most promising trends or developments in sustainable textile manufacturing that you believe will have a significant impact on the industry in the coming years? One of the most promising trends in the industry is the emergence of new bio-based fibres, which are often locally produced and have the potential for significant social impact. These fibres offer a sustainable alternative to traditional materials and contribute to the reduction of carbon footprint. Another important trend is the development of process improvements that aim to replace water as a medium in various stages of the dyeing and finishing process. These innovations reduce water consumption and minimise the environmental impact associated with traditional textile treatments. Additionally, there is a growing focus on fibre recycling and garment recycling, aiming to close the loop in the fashion supply chain. This circular approach promotes the reuse and repurposing of textiles, reducing waste and resource depletion. Lastly, of course, the industry is actively exploring new colour molecules and bio-manufactured dyes sourced from bacteria, fungi, and algae. These bio-based dyes offer a sustainable alternative to synthetic dyes, reducing the reliance on petrochemicals and minimising environmental harm. Overall, these trends highlight the industry’s commitment to sustainability, innovation, and responsible practices. By embracing these advancements, the fashion industry can make significant strides towards a more environmentally friendly and socially conscious future. How do bacteria and microorganisms naturally produce colour, and what is the science behind harnessing their colour-producing capabilities for textile dyeing? Microorganisms have long been known to produce coloured molecules, and these discoveries have played a significant role in our understanding of early microorganism diversity. These colour molecules, known as secondary metabolites, serve specific functions within the organisms, helping them adapt and survive in stressful environments. Biotechnology, also known as biotech, utilises the principles of biology to develop new products, methods, and organisms with the aim of improving human health and society as a whole. The field of biotechnology has been present throughout human civilisation, starting from the domestication of plants and animals to the discovery of fermentation processes. By harnessing the potential of biotechnology, we can explore the vast diversity of microorganisms and their colour-producing capabilities. This knowledge opens up exciting opportunities for developing sustainable and eco-friendly approaches to colour production, such as bio-manufactured dyes sourced from bacteria, fungi, and algae. Biotechnology continues to drive innovation and advancement, offering new possibilities for various industries and contributing to a more sustainable and technologically advanced future. What are some emerging trends and innovations in the field of bacterial dyeing? In recent years, there has been a growing interest in alternative dyeing methods that utilise living bacteria and broth dyeing directly on fabric. These techniques offer unique possibilities for small-scale dyeing and creative applications. One approach involves isolating bacterial dyes and purifying them to achieve vibrant and diverse colour palettes. By harnessing the natural pigments produced by bacteria, designers and textile artists can explore a wide range of hues and shades that are not commonly found in traditional dye sources. Additionally, bacterial pigments have shown potential for printing applications. The use of bacterial pigments in printing processes allows for intricate designs and patterns to be transferred onto fabrics, adding a unique touch to textile creations. Could you provide an overview of Vienna Textile Lab’s approach to fabricating organic colours from naturally occurring bacteria and how it contributes to sustainability in the textile industry? Nature offers a remarkable source of inspiration and potential solutions for sustainable development. Its vast biodiversity provides us with abundant resources that can be harnessed without causing harm to the environment. By deepening our understanding of the world around us, we can unlock the power of nature to drive positive change. Microorganisms provide some sort of one-pot reactions instead of lengthy chemical value chains. This approach streamlines the manufacturing process, reducing waste and energy consumption. By simplifying the production steps and utilising nature-inspired reactions, we can achieve efficient and environmentally friendly manufacturing practices. Furthermore, this approach enables manufacturing to take place wherever it is needed. By embracing decentralised production, we can reduce transportation-related emissions and create local economic opportunities. This shift not only promotes sustainability but also fosters resilience and self-sufficiency within communities. What inspired you to explore the use of bacteria and microorganisms in producing dyes, and what unique advantages do these colours offer compared to conventional synthetic dyes? Textile Lab Amsterdam’s bioshades project, along with my personal interest in dyes and pigments during my school years, greatly influenced my decision to pursue the development of microbial dyes. Witnessing the innovative work being done at Textile Lab Amsterdam and their exploration of sustainable dyeing methods using microorganisms sparked my curiosity and passion for this field. It became clear to me that microbial dyes have the potential to revolutionise the textile industry by offering environmentally friendly alternatives to conventional synthetic dyes. How do you ensure that the dyes produced from bacteria remain organic and environmentally friendly throughout the production process? We adhere to the principles of green chemistry, which means we prioritise processes and materials that are environmentally friendly and avoid those that are toxic or harmful. Our commitment to sustainability extends throughout our entire operation, from the selection of raw materials to the development of innovative manufacturing processes. By discarding toxic processes and materials, we ensure that our products have minimal negative impact on human health and the environment. We continuously strive to find alternative solutions that are safer, more sustainable, and align with our vision of creating a greener future. Transparency and accountability are paramount to us. We believe in providing clear and accurate information about our products and practices to empower consumers to make informed choices. Our commitment to green chemistry is unwavering, and we will continue to explore and implement eco-friendly alternatives as we work towards a more sustainable and responsible industry. Can you share some insights into the selection and sourcing of bacteria used in the dye production? What factors are considered when choosing specific strains? When working with microorganisms, ensuring biosafety is of utmost importance. This allows us to conduct our research and development processes in a safe and controlled manner. In addition to biosafety considerations, we also assess the affinity of dyes to textile fibres. It is important for the dyes to have a basic affinity to ensure effective and durable colouration of the textiles. This helps us achieve the desired colour fastness and quality in our products. Furthermore, we carefully evaluate the chemical composition of the dye molecules. We avoid using dyes that are toxic or have large molecular structures that could potentially harm the environment or cause adverse effects. Our aim is to develop and utilise dyes that are environmentally friendly, non-toxic, and sustainable. In terms of application, which types of textiles and materials have been successfully dyed using Vienna Textile Lab’s colours? Are there any limitations or challenges when working with certain fabric types? It is indeed surprising that the general notion of natural dyes and animal fibres working best together holds true. However, it is also noteworthy that synthetic fibres can effectively absorb and showcase the vibrant colours of bacterial dyes. Traditionally, natural dyes, derived from plants, insects, or other natural sources, have been extensively used with animal fibres like wool and silk. These fibres have inherent properties that allow them to readily accept and retain natural dyes, resulting in beautiful and long-lasting colouration. On the other hand, synthetic fibres, such as polyester and nylon, are known for their resistance to dye absorption. However, advancements in dyeing techniques and the development of bacterial dyes have opened up new possibilities. Bacterial dyes have shown promising results in their ability to adhere to synthetic fibres, offering a wide range of colour options for textiles made from these materials. What measures does Vienna Textile Lab take to ensure the safety and quality of the dyed textiles, considering that bacteria are involved in the dyeing process? In our case bacteria are not involved in the dyeing process, as we remove all biomaterials. By removing the biomaterial and isolating the bacterial dyes, you can obtain pure colourants that can be applied to various textile fibres. This approach allows for greater control over the dyeing process and ensures consistency in colour and performance. What kind of research and development activities are undertaken by Vienna Textile Lab to continuously improve and expand the range of colours and dyeing techniques offered? The Vienna Textile Lab is proud to foster strong collaborations not only with renowned universities such as the Vienna University of Technology, the University of Natural Resources and Life Sciences, and Hochschule Niederrhein, but also with industry partners. These partnerships bring together a diverse range of expertise and resources to drive innovation and create meaningful impact in the textile industry. By collaborating with universities, we benefit from their research capabilities, cutting-edge facilities, and academic insights. This allows us to stay at the forefront of scientific advancements, explore new technologies and materials, and conduct rigorous research and development. The academic collaborations provide a solid foundation for our work, ensuring that our solutions are based on sound scientific principles and rigorous testing. What role do you see Vienna Textile Lab playing in driving innovation and sustainability in the textile industry? Are you planning to collaborate with designers and businesses to incorporate your colours into their products? Collaboration is at the core of our approach. Engaging with diverse individuals and organisations brings invaluable perspectives and expertise. It invigorates and motivates us to explore new ideas and innovative approaches. Through collaboration, we tap into collective intelligence, driving more impactful outcomes. By leveraging the strengths of others, we gain a comprehensive understanding of challenges and opportunities, enabling us to tackle complex problems and amplify our impact. Collaboration fosters shared purpose, fuelling our motivation to surpass limitations. It is about creating a culture where diverse perspectives are valued, trust is built, and collective success is celebrated. Through collaboration, we drive innovation and create a sustainable future for the textile industry and beyond. When can consumers and businesses expect to have access to Vienna Textile Lab’s colours for purchase? What will be the distribution model?","filter_flag":1}
{"title":"'You don't have to be an activist': Here's how your simple actions can help protect the Earth - The Economic Times","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbmV3cy9ob3ctdG8veW91LWRvbnQtaGF2ZS10by1iZS1hbi1hY3RpdmlzdC1oZXJlcy1ob3cteW91ci1zaW1wbGUtYWN0aW9ucy1jYW4taGVscC1wcm90ZWN0LXRoZS1lYXJ0aC9hcnRpY2xlc2hvdy8xMDIxNDIyNDIuY21z0gGeAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9uZXdzL2hvdy10by95b3UtZG9udC1oYXZlLXRvLWJlLWFuLWFjdGl2aXN0LWhlcmVzLWhvdy15b3VyLXNpbXBsZS1hY3Rpb25zLWNhbi1oZWxwLXByb3RlY3QtdGhlLWVhcnRoL2FtcF9hcnRpY2xlc2hvdy8xMDIxNDIyNDIuY21z?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbmV3cy9ob3ctdG8veW91LWRvbnQtaGF2ZS10by1iZS1hbi1hY3RpdmlzdC1oZXJlcy1ob3cteW91ci1zaW1wbGUtYWN0aW9ucy1jYW4taGVscC1wcm90ZWN0LXRoZS1lYXJ0aC9hcnRpY2xlc2hvdy8xMDIxNDIyNDIuY21z0gGeAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9uZXdzL2hvdy10by95b3UtZG9udC1oYXZlLXRvLWJlLWFuLWFjdGl2aXN0LWhlcmVzLWhvdy15b3VyLXNpbXBsZS1hY3Rpb25zLWNhbi1oZWxwLXByb3RlY3QtdGhlLWVhcnRoL2FtcF9hcnRpY2xlc2hvdy8xMDIxNDIyNDIuY21z?oc=5","id":"CBMimgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbmV3cy9ob3ctdG8veW91LWRvbnQtaGF2ZS10by1iZS1hbi1hY3RpdmlzdC1oZXJlcy1ob3cteW91ci1zaW1wbGUtYWN0aW9ucy1jYW4taGVscC1wcm90ZWN0LXRoZS1lYXJ0aC9hcnRpY2xlc2hvdy8xMDIxNDIyNDIuY21z0gGeAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9uZXdzL2hvdy10by95b3UtZG9udC1oYXZlLXRvLWJlLWFuLWFjdGl2aXN0LWhlcmVzLWhvdy15b3VyLXNpbXBsZS1hY3Rpb25zLWNhbi1oZWxwLXByb3RlY3QtdGhlLWVhcnRoL2FtcF9hcnRpY2xlc2hvdy8xMDIxNDIyNDIuY21z","guidislink":false,"published":"Wed, 26 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=207, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbmV3cy9ob3ctdG8veW91LWRvbnQtaGF2ZS10by1iZS1hbi1hY3RpdmlzdC1oZXJlcy1ob3cteW91ci1zaW1wbGUtYWN0aW9ucy1jYW4taGVscC1wcm90ZWN0LXRoZS1lYXJ0aC9hcnRpY2xlc2hvdy8xMDIxNDIyNDIuY21z0gGeAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9uZXdzL2hvdy10by95b3UtZG9udC1oYXZlLXRvLWJlLWFuLWFjdGl2aXN0LWhlcmVzLWhvdy15b3VyLXNpbXBsZS1hY3Rpb25zLWNhbi1oZWxwLXByb3RlY3QtdGhlLWVhcnRoL2FtcF9hcnRpY2xlc2hvdy8xMDIxNDIyNDIuY21z?oc=5\" target=\"_blank\">'You don't have to be an activist': Here's how your simple actions can help protect the Earth<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Economic Times<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"'You don't have to be an activist': Here's how your simple actions can help protect the Earth - The Economic Times","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbmV3cy9ob3ctdG8veW91LWRvbnQtaGF2ZS10by1iZS1hbi1hY3RpdmlzdC1oZXJlcy1ob3cteW91ci1zaW1wbGUtYWN0aW9ucy1jYW4taGVscC1wcm90ZWN0LXRoZS1lYXJ0aC9hcnRpY2xlc2hvdy8xMDIxNDIyNDIuY21z0gGeAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9uZXdzL2hvdy10by95b3UtZG9udC1oYXZlLXRvLWJlLWFuLWFjdGl2aXN0LWhlcmVzLWhvdy15b3VyLXNpbXBsZS1hY3Rpb25zLWNhbi1oZWxwLXByb3RlY3QtdGhlLWVhcnRoL2FtcF9hcnRpY2xlc2hvdy8xMDIxNDIyNDIuY21z?oc=5\" target=\"_blank\">'You don't have to be an activist': Here's how your simple actions can help protect the Earth<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Economic Times<\/font>","source.href":"https:\/\/m.economictimes.com","source.title":"The Economic Times","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Alternatives\" \"new products\"+after:2023-07-01+before:2023-07-31","text":" (You can now subscribe to our (You can now subscribe to our Economic Times WhatsApp channel The health and sustainability of our planet, Earth , is in danger due to human activities. Numerous human-produced challanges like climate change , pollution, deforestation, and resource depletion are posing a serious threat to the delicate balance of nature.The current heat waves across the globe are an indicator of what's wrong with the planet and what worse can happen in future. Researchers have warned that the deadly hot spells in the American Southwest and Southern Europe could not have happened without the continuing buildup of warming gases in the air.Amidst these critical problem that can threaten the very survival of human beings, it's crucial to recognize that individuals can make a substantial impact when they adopt environmentally conscious habits and make eco-friendly choices.“You don't have to become an activist to mitigate the ill effects of climate changes. We can achieve that the simple actions by every individual. The climate emergency warrants action by every single individual. The actions of every single individual matter and can make a difference when it comes to avert the challenge of climate change. Everyone should take charge of the carbon emissions they are responsible for and actively works towards mitigating them,” said, GS Jaisal, Global Head of Government & Corporate Affairs, Save Earth Mission With efforts of every individual we can limit or slow down the harmful effects on our planet. If you also always think of contributing to Earth conservation but don't know where to start, here are some simple actions that can help protect the Earth without burdening our daily lives.The timeless mantra of \"Reduce, Reuse, Recycle\" holds true today more than ever. Embracing waste reduction by opting for products with minimal packaging and avoiding single-use items is a step in the right direction. Choose reusable water bottles, coffee cups, and shopping bags to reduce plastic waste. Don't forget to recycle materials like paper, glass, and plastic to conserve resources and prevent them from polluting oceans or ending up in landfills.“There is a need to adopt a plastic-free lifestyle and work towards decarbonising our future. As an individual and dedicated efforts by civil society we can conserve our environment. As part of a global community of over 10 million people in 68 countries, we are proud of our efforts for environment conservation,” said Sandeep Choudhary, Global Founder, Save Earth Mission said..Water, being a precious resource, requires careful conservation for the health of our planet. Simple actions such as fixing leaky faucets, using a broom instead of a hose for outdoor cleaning, and installing water-saving showerheads can significantly reduce water consumption. Additionally, practicing mindfulness in everyday tasks like washing dishes or brushing teeth can help in water conservation.The transportation sector contributes significantly to greenhouse gas emissions. Whenever possible, consider eco-friendly alternatives like walking, cycling, carpooling, or using public transportation. With electric vehicles becoming more accessible, making the switch to zero-emission vehicles can greatly reduce your carbon footprint.Transitioning to renewable energy sources like solar, wind, and hydroelectric power plays a vital role in reducing greenhouse gas emissions. If feasible, think about installing solar panels on your property or supporting local and national efforts to invest in renewable energy infrastructure.Mindful purchasing choices can have a positive impact on the environment. Opt for products made from sustainable materials and support businesses that prioritize eco-friendly practices and ethical sourcing. Participating in clothing swaps or buying second-hand items can help reduce the demand for new products and limit waste generation.Trees serve as natural carbon sinks, absorbing carbon dioxide from the atmosphere. Engage in tree-planting initiatives or support organizations focusing on reforestation efforts. Additionally, advocate for the preservation of green spaces in your community, as they provide crucial habitats for wildlife and contribute to cleaner air.Reducing energy consumption is essential in minimizing environmental impact. Utilize energy-efficient appliances, turn off lights when not in use, and ensure proper home insulation. Simple actions like adjusting your thermostat and utilizing natural light can lead to significant energy savings over time.The earth is the only home we have and we must do everything in our power to save it. “There is an important need for collective action to safeguard the planet. There is only one way to address the unprecedented environmental challenges, and that is through community efforts. Everyone needs to come together and work together to protect planet Earth and ensure it can sustain humans and other life forms,” Amit Tiwari, Global Admin Head, Save Earth Mission, said.Protecting the Earth is a collective responsibility that extends beyond governments and large corporations. Each individual possesses the power to effect positive change through daily actions. By incorporating simple, eco-friendly habits into our lives, we can work together towards a more sustainable and thriving planet. Remember that even small contributions, when multiplied globally, can create a significant impact. Let us unite to safeguard the Earth for future generations and foster a healthier and more resilient world.","filter_flag":1}
{"title":"Impossible Foods IPO: Plant-Based Food Giant Eyes 2022 Listing - Investment U","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiLWh0dHBzOi8vaW52ZXN0bWVudHUuY29tL2ltcG9zc2libGUtZm9vZHMtaXBvL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiLWh0dHBzOi8vaW52ZXN0bWVudHUuY29tL2ltcG9zc2libGUtZm9vZHMtaXBvL9IBAA?oc=5","id":"CBMiLWh0dHBzOi8vaW52ZXN0bWVudHUuY29tL2ltcG9zc2libGUtZm9vZHMtaXBvL9IBAA","guidislink":false,"published":"Fri, 14 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=195, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLWh0dHBzOi8vaW52ZXN0bWVudHUuY29tL2ltcG9zc2libGUtZm9vZHMtaXBvL9IBAA?oc=5\" target=\"_blank\">Impossible Foods IPO: Plant-Based Food Giant Eyes 2022 Listing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investment U<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Impossible Foods IPO: Plant-Based Food Giant Eyes 2022 Listing - Investment U","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLWh0dHBzOi8vaW52ZXN0bWVudHUuY29tL2ltcG9zc2libGUtZm9vZHMtaXBvL9IBAA?oc=5\" target=\"_blank\">Impossible Foods IPO: Plant-Based Food Giant Eyes 2022 Listing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investment U<\/font>","source.href":"https:\/\/investmentu.com","source.title":"Investment U","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Alternatives\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Investors are eager for the Impossible Foods IPO. The agrifood tech giant is catching the eye of investors after its recent $7 billion valuation. So, when can we expect Impossible Foods stock? Let’s take a look… Impossible Foods IPO: About the Business Impossible Foods is an agrifood tech startup. The company makes plant-based substitutes for meat, dairy and fish products. The company is on a mission to make the global food system sustainable by eliminating the need to make food from animals. But, it isn’t looking to build a better veggie burger. Instead, Impossible Foods started with a goal to engineer something that meat-eaters will love too. The company has products in over 20,000 grocery stores and 40,000 restaurants around the world. Today, Impossible Foods is the fastest-growing plant-based meat company in retail, according to the company. Impossible Foods is best known for its soy-based Impossible Burger. The company has also released several new products, including plant-based sausage, chicken nuggets, meatballs and ground pork. Its products are currently available in seven different countries. This includes recent expansion into Australia and New Zealand. However, that is only a fraction of what the company is doing to grow. Dr. Patrick O. Brown, M.D., Ph.D., founder and CEO of Impossible Foods, said… Our mission is to replace the world’s most destructive technology – the use of animals in food production – by 2035. To do that, we need to double production every year, on average, for 15 years and double down on research and innovation. The market has its ups and downs, but the global demand for food is always there, and the urgency of our mission only grows. Our investors not only believe in our mission, but they also recognize an extraordinary opportunity to invest in the platform that will transform the global food system. Thanks to its mission to create tasty plant-based meat, this startup has gathered a legion of fans as well as lots of positive press. So, how does it compare to the competition? Plant-Based Food Market Facing Rapid Growth Impossible has tapped into a growing hunger for its better burger. In 2019, UBS estimated that plant-based food sales would rise from $4.6 billion in 2018 to $85 billion by 2030. Furthermore, concerns over climate change could also increase demand for products that emit fewer greenhouse gasses. The meat industry is one of the biggest producers of global greenhouse gas emissions. It has a huge carbon footprint. As the climate crisis worsens, people are seeking out healthier, more eco-friendly alternatives. During the past few years, ESG investments – environmental, social and governance – have attracted tens of billions of dollars. Impossible Foods is well-positioned to benefit from these investment trends. Despite this, Impossible Foods has more to compete with than Beyond Meat. In the last couple of years, major names in the meat industry like Tyson, Perdue, Smithfield and Hormel have introduced meat alternatives. Meaning Impossible Foods is competing against some of the largest consumer staples companies in the United States. However, Impossible Foods does have the advantage of already having established partnerships with major fast food restaurants. Burger King launched the Impossible Whopper in August 2019. And it also partnered with Starbucks (Nasdaq: SBUX) to bring customers the Impossible breakfast sandwich. These huge partnerships have brought major brand awareness to Impossible Foods. Impossible Foods was one of the highest-funded agrifood tech startups in 2021. So, let’s take a look at the finances… Impossible Foods Lands $7 Billion Valuation Ahead of IPO Because Impossible Foods is a private company, so are its finances. However, Impossible Foods’ 2021 retail sales were up 85% year-over-year, according to Forbes. Moreover, the company is attracting major investors. Company investors include Coatue Management, Temasek, Horizons Ventures, Mirae Asset and Khosla Ventures. Several celebrities have also pledged support, including Microsoft co-founder Bill Gates, musician Jay-Z, athlete Serena Williams and film director Peter Jackson. Impossible Foods has raised $2.1 billion in total funding, according to CrunchBase. In November 2021, Impossible Foods secured $500 million in a new funding round led by Mirae Asset Global Investments. This funding round landed Impossible Foods a $7 billion valuation. Impossible Foods will use the money to continue its retail expansion in new international markets. In addition, it plans to build out its technology platform, product portfolio and supply chain capabilities. The recent funding round has investors asking: How much will the Impossible Foods IPO raise? Let’s take a look… Impossible Foods IPO Filing Details In April 2021, sources familiar with the matter reported that the company is planning an Impossible Foods IPO soon. According to the sources, the company will make its public debut through a traditional IPO or SPAC merger. Furthermore, sources said that Impossible Foods has received “offers at a lucrative valuation” – as much as $10 billion – from SPAC suitors. However, sources added that the company is mindful that the SPAC route to going public could dilute existing shareholders more than a traditional IPO. Sources warned that market conditions could influence the timing, valuation and size of the Impossible Foods IPO. Considering current market volatility, it’s unknown when investors should prepare for Impossible Foods stock. But it’s expected to come in either late 2022 or sometime in 2023. Impossible Foods’ archrival, Beyond Meat, made its public debut in a $240 million IPO in May 2019. The company held a $1.46 billion valuation at the time. However, Beyond Meat stock is currently trading around half of its IPO price. Which is not a good omen for the Impossible Foods IPO. As always, make sure to research before you invest. IPOs can be volatile for the first few months and share prices are constantly changing. Furthermore, if IPO investing interests you, check out our top recent IPOs and our IPO calendar. We update the calendar daily to give you the latest news on upcoming and filed IPOs.","filter_flag":1}
{"title":"News - Retail India News: Herby Angel Launches Organic Milk Mixes for Kids' Nutrition - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3JldGFpbC1pbmRpYS1uZXdzLWhlcmJ5LWFuZ2VsLWxhdW5jaGVzLW9yZ2FuaWMtbWlsay1taXhlcy1raWRzLW51dHJpdGlvbtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3JldGFpbC1pbmRpYS1uZXdzLWhlcmJ5LWFuZ2VsLWxhdW5jaGVzLW9yZ2FuaWMtbWlsay1taXhlcy1raWRzLW51dHJpdGlvbtIBAA?oc=5","id":"CBMibGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3JldGFpbC1pbmRpYS1uZXdzLWhlcmJ5LWFuZ2VsLWxhdW5jaGVzLW9yZ2FuaWMtbWlsay1taXhlcy1raWRzLW51dHJpdGlvbtIBAA","guidislink":false,"published":"Thu, 06 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=187, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3JldGFpbC1pbmRpYS1uZXdzLWhlcmJ5LWFuZ2VsLWxhdW5jaGVzLW9yZ2FuaWMtbWlsay1taXhlcy1raWRzLW51dHJpdGlvbtIBAA?oc=5\" target=\"_blank\">News - Retail India News: Herby Angel Launches Organic Milk Mixes for Kids' Nutrition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"News - Retail India News: Herby Angel Launches Organic Milk Mixes for Kids' Nutrition - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL3JldGFpbC1pbmRpYS1uZXdzLWhlcmJ5LWFuZ2VsLWxhdW5jaGVzLW9yZ2FuaWMtbWlsay1taXhlcy1raWRzLW51dHJpdGlvbtIBAA?oc=5\" target=\"_blank\">News - Retail India News: Herby Angel Launches Organic Milk Mixes for Kids' Nutrition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Alternatives\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Retail India News: FootSecure India Ventures into Prescription Footwear Manufacturing FootSecure, a Bangalore-based healthcare start-up, specializing in podiatric medicine and wound care, has introduced a state-of-the-art custom footwear manufacturing unit. Supported by the Karnataka Institute of Endocrinology and Research, this venture aims to revolutionize foot care by providing tailored solutions for various foot conditions, thereby reducing amputation rates through timely intervention and care. According to Allied Market Research, the global diabetic footwear market was valued at $5.8 billion in 2020 and is projected to reach $14.2 billion by 2031, with a CAGR of 7.9 percent from 2022 to 2031. The rise in the market for therapeutic and custom pedorthic footwear is driven by the increasing prevalence of chronic diseases like diabetes, arthritis, and plantar fasciitis, as well as advancements in medical technology. Founded in 2018, FootSecure has focused on making quality podiatric services affordable and accessible. The new custom prescription footwear manufacturing facility in Bangalore marks a significant milestone for the start-up. Dr. Sanjay Sharma, Co-Founder of FootSecure said, “Today, there is little to no awareness about Podiatry as a specialised medical science and there is even lower awareness about therapeutic footwear. There are tens and thousands of Diabetic \/ Medical \/ Ortho Footwear available in the market, which do not necessarily meet the therapeutic standards, and cause more harm than good. For example, a lot of people believe that the softer the soles, the better the footwear. However, that is a myth. What a lot of patients need is an insole, which is hard enough to correct the foot position and the gait and withstand the body weight. Similarly, in the case of a pathological foot, standard off-the-shelf footwear doesn’t work in protecting the feet, giving stability, or preventing any injuries. A unique foot requires bespoke footwear. That is where therapeutic or prescription footwear comes into play.” As a phygital platform, FootSecure offers diagnosis, treatments, and surgeries for over 300 foot and ankle conditions, including chronic wounds and sports injuries. The launch of the prescription footwear facility aligns with FootSecure's mission to integrate specialized foot health solutions. Dr. Sharma expressed excitement about this advancement and gratitude towards the Karnataka Institute of Endocrinology and Research for their support. He highlighted the potential of well-designed prescription footwear to reduce pain, improve healing, and enhance mobility and quality of life for patients. Sanjay Sharma added, “We are thrilled to launch our prescription footwear manufacturing unit, which represents a significant step forward in our mission to provide tailored foot care solutions. We are also truly grateful for the support of the Karnataka Institute of Endocrinology & Research institute for their trust in our venture. I truly believe that good quality, affordable, and well-designed prescription footwear can not only help reduce pain and improve healing but can also help enhance mobility and drastically improve the quality of life of patients with various foot conditions. Our next step towards making these products truly accessible to all is the launch of our application which will allow clinicians to upload clinical parameters for making custom footwear. Our investment in this initiative reflects our commitment to innovation and excellence in podiatric care.” With an initial investment of Rs 30 Lakhs, the facility offers custom-designed footwear based on the pathology and biomechanics of the foot, ensuring stability, injury prevention, and comfort. The current range includes six models, with options for both men and women, starting from Rs 2000. Advanced customizations cover the outer sole, midsole, insole, and uppers, catering to patients with various foot conditions. The facility has a capacity of up to 300 pairs of custom footwear per day. Patients need to visit FootSecure centers in Bangalore to order custom footwear. However, by September, FootSecure plans to launch an app allowing clinicians nationwide to upload clinical parameters for creating custom footwear. Additionally, FootSecure offers digital solutions like Wound360 and Foot360, which provide guidelines and support for comprehensive foot health and wound care management. Looking ahead, FootSecure aims to expand into new geographies, introduce innovative products and services, and establish India’s first dedicated podiatry hospital by 2025","filter_flag":1}
{"title":"Zouk Launches Flagship Store at Nexus Seawoods, Mumbai - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L2Zhc2hpb24tYWNjZXNzb3JpZXMvem91ay1sYXVuY2hlcy1mbGFnc2hpcC1zdG9yZS1uZXh1cy1zZWF3b29kcy1tdW1iYWnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L2Zhc2hpb24tYWNjZXNzb3JpZXMvem91ay1sYXVuY2hlcy1mbGFnc2hpcC1zdG9yZS1uZXh1cy1zZWF3b29kcy1tdW1iYWnSAQA?oc=5","id":"CBMifGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L2Zhc2hpb24tYWNjZXNzb3JpZXMvem91ay1sYXVuY2hlcy1mbGFnc2hpcC1zdG9yZS1uZXh1cy1zZWF3b29kcy1tdW1iYWnSAQA","guidislink":false,"published":"Wed, 05 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=186, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L2Zhc2hpb24tYWNjZXNzb3JpZXMvem91ay1sYXVuY2hlcy1mbGFnc2hpcC1zdG9yZS1uZXh1cy1zZWF3b29kcy1tdW1iYWnSAQA?oc=5\" target=\"_blank\">Zouk Launches Flagship Store at Nexus Seawoods, Mumbai<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Zouk Launches Flagship Store at Nexus Seawoods, Mumbai - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L2Zhc2hpb24tYWNjZXNzb3JpZXMvem91ay1sYXVuY2hlcy1mbGFnc2hpcC1zdG9yZS1uZXh1cy1zZWF3b29kcy1tdW1iYWnSAQA?oc=5\" target=\"_blank\">Zouk Launches Flagship Store at Nexus Seawoods, Mumbai<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Alternatives\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Year Ender: How India is embracing New-Age Beauty and Personal Care Brands With the eventful year of 2022 coming to an end, every Indian can be seen to rejoice and prep for the new year as the same is happening after a pandemic-struck hiatus of 2 long years. With festivities around the corner, there has been a significant surge in demand in the markets which are flooded with consumers. Every industry is witnessing the surge, and Beauty and Personal Care is not behind. However, the stiff competition for customers between online and offline brands has become more prominent than ever. To understand the commotion among the brands this season, these brands give us an insight into their 2022 journey and their 2023 growth plans. SUGAR Cosmetics This year SUGAR Cosmetics touched larger milestones, becoming one of the select few brands that have launched 120+ of their own stores in retail, reaching a total of 45000+ retail touchpoints across 550+ cities. SUGAR’s IG page garnered 2.4M+ followers, becoming the largest consumer brand in India on the platform, along with our experiment into gamified AR filters that hit virality on platforms like Instagram and Moj. The brand’s #ShukarHaiSUGARHai Campaign with campaign ambassadors Ranveer Singh and Tamannaah Bhatia was also a huge viral success allowing the brand to receive support from impactful investors namely LCatterton and Ranveer Singh. “At SUGAR in 2022, we managed to almost double our sales over the previous year, achieved the target of being one of the Top 3 brands in color cosmetics in India, and are looking at another year of massive growth,” said Vineeta Singh, Co-founder, and CEO, SUGAR Cosmetics. She further added, “Our plans for 2023 include targeting and achieving a 100 percent Y-O-Y revenue growth over last year, expansion to more than 60,000 retail outlets, making our D2C platform base stronger and larger, and growing our team size to 3,000 employees.” Keeping its audience in mind, SUGAR is looking forward to tapping into different categories of the beauty industry. The brand will also focus on creating solid content to keep educating and engaging its community across all platforms–digital and others. The Body Shop \"We at The Body Shop are embarking upon a new strategy of ‘Change Making Beauty’, which means that we aim to empower customers, employees, and partners to drive positive change for the world through our channels, our products, and our activism,\" stated Vishal Chaturvedi, Vice President, The Body Shop, South Asia. With this vision, the brand is aligned to reach its goal of 25 new stores in 2022 at various locations. Currently, having 200 highly visible and accessible stores all over India, including Tier I and II cities, with the latest additions in Itanagar, Surat, and Indore. The brand's current product portfolio is already over 60 percent Vegan, aiming to become 100 percent Vegan by 2023. This aim is the natural next step forward for the brand's Cruelty-Free commitment, including reformulating all our core products from 100 percent Vegetarian to 100 percent Vegan, while focusing on making its product packaging 100 percent recyclable thus reducing its environmental impact. \"We are strengthening our retail and e-commerce channels by opening more workshop stores and launching new digital experiences. We are expanding our retail footprint with a clear focus on smaller cities and towns. Rolling out the new Workshop store format in as many stores as possible: 30+ new ACTIVIST Workshop stores per year, every year till 2025 bringing the brand to people where they love to shop,\" added Chaturvedi. Plum Plum would be closing the financial year at over 2x the revenue of the previous FY, complemented by the 44 percent growth seen in its overall customer base with a 96.54 percent increase in repeat buyers which is a great win in the D2C space. “We raised $35 million (Rs 270 crore) in a Series C round in March 2022 totaling our funding to over $50 million. With this, our efforts have been towards bringing in more salient brand communication, growing our omnichannel presence and onboarding high-quality talent with a focus on investments in marketing and technology,” said Shankar Prasad, Founder & CEO, Plum Having launched over 8 exclusive brand outlets in the last year across cities, the brand plans to scale this up to 50 in the coming year. Furthermore, Plum onboarded Rashmika Mandanna and Mithila Palkar as its brand ambassadors for the Plum skincare range and Ananya Panday for the Plum Body Lovin’ fragrance range. “We would be expanding our makeup range aggressively with a host of innovative product formats in the coming year. We would also be launching a line of products in the essentials and advanced ranges under both skincare and haircare categories,” added Prasad. Colorbar The post-pandemic period has witnessed a radical shift in consumer behavior and expectations. As per research, the total retail sale is expected to reach $5.5 trillion by 2027 with online sales making up 30 percent of the market. The retail industry has been largely shadowed by challenges across the supply chain, economic uncertainty, and geo-political factors. I feel that going forward, the only way for retailers to sail through is by exhibiting strong levels of adaptability, agility, and flexibility. \"As we graduate into the next year, we can expect a renewed focus on enhancing the customer shopping journey by providing a seamless experience for hybrid shopping. Re-invention of physical store designs along with a robust omnichannel strategy would, however, emerge as a top priority. Many companies will be seen adding features to support new shopping initiatives while integrating technologies supporting AR\/VR advancements. We are aligned to lead the change and have a strong conviction that our strategy would create benchmarks of excellence in 2023,” stated Samir Kumaar Modi, Founder, and Managing Director, Colorbar Cosmetics. Kapiva “We have been relentlessly working towards improving the health and wellness quotient of Indians with Ayurveda. Recently, we expanded in the US and UAE to enable this for the global audience as well. Our focus this year was on increasing the effectiveness of our products. We’ve moved the needle on that front by successfully conducting a clinical trial for our Dia Free Juice. It has also proven to be effective in decreasing HbA1c to an extent of 11 percent and increasing insulin production in the body by up to 25-30 percent. However, the highlight of the year was definitely the recognition by Honorable PM Modi,” said Ameve Sharma, Founder, Kapiva. In the upcoming year, Kapiva aims to double down, concurrently increasing brand awareness and recall to become a household name. Modern consumers are less concerned with outward appearance than they once were, and are more concerned with their complete well-being, which encompasses physical, mental, and emotional health. In order to capitalize on this trend, Kapiva is constantly creating consumer awareness by keeping the emphasis on the paramount importance of Ayurveda and how it can enable people to live a holistic lifestyle. Earth Rhythm 2022 was a favorable year for Earth Rhythm, as it brought in a lot of positive changes in terms of organization, growth, and product. At an organizational level, the brand was able to double the size of the team with its customer base growing 4x times compared to the previous financial year. The brand also went offline with the launch of its exclusive kiosks at 12 different locations across India. “We are expanding our makeup category which will go on to strengthen Earth Rhythm’s wide-ranging portfolio, we have also been intensifying the existing categories. True to our digital-first identity, it was also a natural step for us to continue investing in technology in a bid to further streamline operations and give our customers every convenience they desire. We successfully launched our very own mobile App for both Android and iOS platforms this year and have been gaining steady traction on it. Next year, we plan to further build our portfolio by deepening the makeup category launched in 2022. We reckon 2x growth over FY 2021-22,” said Harini Sivakumar, Founder, and CEO, Earth Rhythm. In keeping with this shift in the consumer’s preference, the brand aims to reinforce its multifunctional product range in both makeup and personal care (face, body, hair), aimed at eliminating the need for and use of multiple products in everyday makeup and skincare routines. ARATA This year at Arata launched over 20 products and 30 offline stores across India, steadily growing 10 percent month on month with respect to GMV. “In the upcoming year, we will go full throttle to bridge the gaps in our product line and be a one-stop shop for all hair care needs. We have already begun our groundwork and have set processes to create formulas in the anti-hair fall, hair colorants, and hair styling segments,” said Dhruv Madhok, Co-Founder, ARATA. BlushBee 2022 has been the year of the first full-fledged operations for Blushbee. Beginning with just three products and later expanding to 10 categories with 64 unique SKUs, the brand has witnessed massive organic growth in its customer base. BlushBee as a cosmetics line is a product of careful decisions in choosing what it wants, the other advantage is that being a clean and green beauty brand which is an important factor in the value proposition. “We hope to grow into a one-stop shop for all things related to color cosmetics, so we are actively looking into introducing new products like foundations, gloss, and so on. We have also discussed extending our horizons beyond just the realm of color cosmetics very soon,” stated Shobana and Navneethan, Founders, BlushBee Organic Beauty Brand. Crazy Owl - Your Skin Co The brand was launched in 2022 with the mindset of embracing the true self and exploring the crazy side. The brand is PETA and IFRA certified, FDA approved, and currently provides the best possible sensorial experience in Hair Care with India's First Date Seed Oil Shampoo, Conditioner, and Hair Oil. “In the short term, we are working towards expanding on two fronts- launching more affordable luxury products across categories in which we operate. With the right set of team, products, and marketing strategy we were able to launch our brand, and today, 6 months post the launch we are happy to serve more than 2000+ households,” commented Damanjit Kohli and Karishma Sahni, Founders, Crazy Owl - Your Skin Co. Increasing its touchpoint and interaction with the product, currently, Crazy Owl has signed up on all major marketplace platforms – Amazon Launchpad, Flipkart Propel Program, Purple, Snapdeal, Tata 1 mg, First cry, Myntra, Nykaa, Bigbasket and will be launching itself on Blink it, Paytm, Pharmeasy and Shopperstop planning to grow its channel every month. Pilgrim “As one of the fastest growing personal care brands in India, we have seen significant growth in the last 12 months and clocked a sale of Rs 10 crore per month along with a growth of 6X. With the trust that the brand has built throughout, we have had some great partnerships this year for our campaigns. Celebrity shout-outs from personalities like Soha Ali Khan, and Vidya Balan, and association with Kalki Koechlin in our most recent commercial have been one of the key highlights,” said Anurag, Co-Founder and CEO, Pilgrim. With a strong consumer base of 1 million, the brand aims to improve its interaction and thus upgraded its technology. Along with updating its technology, the brand is also using innovative ways to reach its target audience. Pilgrim aims to be a Rs 1,000 crore brand in the next 3-4 years by facilitating new product and category launches and exploring newer international markets like the Middle East. Moreover, planning to double down on its R&D capabilities and increase brand investments by bringing in global experiences for its customers, both online and offline. Along with establishing its presence internationally, Pilgrim aims to achieve an annualized run rate of Rs 500 crore by December 2023. iluvia Professional As a new-age, self-care brand pioneering product-driven innovation and technology, during the course of the year iluvia witnessed growth across different channels, and new launches, and hit several milestones. The organization has grown 25x in revenue between October 2021 and 2022 along with a 20x growth in its online consumer base, currently present across key marketplaces and in over 1800 salons in India across 70+ cities. “It is a very exciting time for us as we are working on introducing new patented treatment technologies and new launches in the haircare category. We also expect a positive growth trajectory of 6x to 7x in the coming year,” stated Nishant Gupta and Palash Pandey, Directors, Renaura Wellness Pvt. Ltd. Beauty and Skincare, as a category, has burst forth since the onset of the pandemic in late 2019. The D2C space, especially, has seen remarkable growth which we expect will continue in 2023 and beyond. Moreover, The Indian beauty and personal care segment, which stood above Rs 54,500 crore only two years ago, is expected to grow at a CAGR of 11 percent over the next five years.","filter_flag":1}
