{"title":"Eastman announces project success with USAMP, PADNOS and Yanfeng for fully circular recycling study in automotive ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMirwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vhc3RtYW4tYW5ub3VuY2VzLXByb2plY3Qtc3VjY2Vzcy13aXRoLXVzYW1wLXBhZG5vcy1hbmQteWFuZmVuZy1mb3ItZnVsbHktY2lyY3VsYXItcmVjeWNsaW5nLXN0dWR5LWluLWF1dG9tb3RpdmUtbWFya2V0LTMwMTgwMTE3OC5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMirwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vhc3RtYW4tYW5ub3VuY2VzLXByb2plY3Qtc3VjY2Vzcy13aXRoLXVzYW1wLXBhZG5vcy1hbmQteWFuZmVuZy1mb3ItZnVsbHktY2lyY3VsYXItcmVjeWNsaW5nLXN0dWR5LWluLWF1dG9tb3RpdmUtbWFya2V0LTMwMTgwMTE3OC5odG1s0gEA?oc=5","id":"CBMirwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vhc3RtYW4tYW5ub3VuY2VzLXByb2plY3Qtc3VjY2Vzcy13aXRoLXVzYW1wLXBhZG5vcy1hbmQteWFuZmVuZy1mb3ItZnVsbHktY2lyY3VsYXItcmVjeWNsaW5nLXN0dWR5LWluLWF1dG9tb3RpdmUtbWFya2V0LTMwMTgwMTE3OC5odG1s0gEA","guidislink":false,"published":"Wed, 19 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=109, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMirwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vhc3RtYW4tYW5ub3VuY2VzLXByb2plY3Qtc3VjY2Vzcy13aXRoLXVzYW1wLXBhZG5vcy1hbmQteWFuZmVuZy1mb3ItZnVsbHktY2lyY3VsYXItcmVjeWNsaW5nLXN0dWR5LWluLWF1dG9tb3RpdmUtbWFya2V0LTMwMTgwMTE3OC5odG1s0gEA?oc=5\" target=\"_blank\">Eastman announces project success with USAMP, PADNOS and Yanfeng for fully circular recycling study in automotive ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Eastman announces project success with USAMP, PADNOS and Yanfeng for fully circular recycling study in automotive ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMirwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vhc3RtYW4tYW5ub3VuY2VzLXByb2plY3Qtc3VjY2Vzcy13aXRoLXVzYW1wLXBhZG5vcy1hbmQteWFuZmVuZy1mb3ItZnVsbHktY2lyY3VsYXItcmVjeWNsaW5nLXN0dWR5LWluLWF1dG9tb3RpdmUtbWFya2V0LTMwMTgwMTE3OC5odG1s0gEA?oc=5\" target=\"_blank\">Eastman announces project success with USAMP, PADNOS and Yanfeng for fully circular recycling study in automotive ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular economy solutions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"New closed-loop technology provides cost-effective options for OEM automakers to create sustainable materials from automotive plastic waste KINGSPORT, Tenn., April 19, 2023 \/PRNewswire\/ -- Eastman today announced the successful completion of the closed-loop recycling project for automotive mixed plastic waste. Through a collaborative effort, Eastman, the United States Automotive Materials Partnership LLC (USAMP), automotive recycler PADNOS and global automotive interior supplier Yanfeng , demonstrated first of its kind plastic recycling from the by-product of shredding end-of-life vehicles. Eastman announces project success with USAMP, PADNOS and Yanfeng for fully circular recycling study in automotive market. New closed-loop technology provides cost-effective options for OEM automakers to create sustainable materials from automotive plastic waste. When automobiles are at the end of their life, metals, tires and glass account for 80%–90% of the materials that can be recycled through traditional mechanical recycling streams. The other 10%–20%, referred to as automotive shredder residue (ASR), consists of mixed plastic and other nonrecycled materials that currently end up in landfills or are recovered through waste-to-energy technologies. Under this initiative, PADNOS supplied a plastic-rich fraction of ASR as a sustainable feedstock to Eastman's carbon renewal technology (CRT). Eastman successfully demonstrated addition and conversion of that ASR feedstock into a synthesis gas (syngas) which is subsequently used downstream in the production of its polyester and cellulosic thermoplastics. Resins from this production process were further formulated and then supplied to Yanfeng. The parts molded by Yanfeng for demonstration were successfully tested to meet a variety of OEM – Ford, GM, and Stellantis – requirements, thereby demonstrating proof of concept for a truly circular solution. The study proved feasibility of Eastman's carbon renewal technology (CRT), one of Eastman's two molecular recycling technologies, which breaks down the plastic-rich ASR into molecular building blocks. By recycling these complex plastics in CRT, Eastman can replace fossil-based feedstock and create polymers without compromising performance for use in new automotive applications. In addition to diverting waste from landfills, USAMP, a subsidiary of the United States Council for Automotive Research LLC (USCAR) also sees the potential for energy savings and reduced overall greenhouse gas emissions. Deloitte Consulting, LLP estimates more than 10 billion pounds of ASR is sent to landfills globally each year. \"We are encouraged by the initial results of this study,\" said Warwick Stirling, USCAR Executive Director. \"Innovative processes that enable ASR to be used in automotive parts can help bring us closer to more fully recycling end-of-life vehicles and enabling the possibility of a truly circular economy.\" \"This is a prime example of how collaboration across the value chain is essential to making material circularity mainstream,\" said Steve Crawford, Eastman executive vice president, manufacturing and chief sustainability officer. \"Modern cars are made with approximately 50% plastics by volume, on average; and this number is only expected to increase as automotive manufacturers continue to seek lighter electric vehicles. We're demonstrating a future where automotive hard-to-recycle plastics and fibers are diverted from landfills and recycled to produce new automotive parts.\" Kari Bliss, principal of sustainability at PADNOS said, \"The collaboration on this project is indicative of the work that is needed to create closed-loop and circular economy solutions. Our purpose statement is on full display with this project — to continue to find ways to innovate, lead and make a positive impact in this world. We are proud to be the mechanical recycler involved in this complex endeavor, which is the first of its kind in North America.\" \"Yanfeng is honored to be part of this project with USAMP, PADNOS and Eastman. Circularity and keeping plastic waste out of landfills is a priority for our company and the industry,\" said Jeff Stout, executive director global innovation for Yanfeng. \"We see a lot of potential with the resin developed with molecular reprocessing. We are pleased with the performance of the interior components we molded during the study and believe it would be a sustainable solution in production.\" About Eastman Eastman is a global specialty materials company that produces a broad range of products found in items people use every day. For more information, visit Eastman.com . About USCAR USCAR is the collaborative automotive technology company for Ford Motor Company, General Motors and Stellantis. The goal of USCAR is to further strengthen the technology base of the domestic auto industry through cooperative research and development. For more information, visit USCAR.org . About PADNOS PADNOS is a fourth-generation, family-owned company with diverse processing capabilities to create real recycling solutions for ferrous and nonferrous metals, end-of-life vehicles, paper, plastics and electronics. For more information, visit PADNOS.com . About Yanfeng Yanfeng is a leading global automotive supplier, focusing on interiors, exterior, seating, cockpit electronics and passive safety. For more information, visit Yanfeng.com . Media Contacts: Eastman Jacob Teetzmann Tombras [email protected] +1 (423) 494-3673 USCAR Stacey Boyle [email protected] PADNOS Kevin Everhart [email protected] (616) 796-7210 Yanfeng Debra Ortisi [email protected] (734) 255-1660 Video - https:\/\/www.youtube.com\/watch?v=f_AWIDlY79M Logo - https:\/\/mma.prnewswire.com\/media\/2055873\/Eastman_Logo.jpg","filter_flag":1}
{"title":"Why Earth Day 2023 Is A Big Deal For Brands And Consumers In China - Jing Daily","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vamluZ2RhaWx5LmNvbS9wb3N0cy9lYXJ0aC1kYXktMjAyMy1icmFuZHMtY29uc3VtZXJzLWNoaW5hLXByYWRh0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vamluZ2RhaWx5LmNvbS9wb3N0cy9lYXJ0aC1kYXktMjAyMy1icmFuZHMtY29uc3VtZXJzLWNoaW5hLXByYWRh0gEA?oc=5","id":"CBMiR2h0dHBzOi8vamluZ2RhaWx5LmNvbS9wb3N0cy9lYXJ0aC1kYXktMjAyMy1icmFuZHMtY29uc3VtZXJzLWNoaW5hLXByYWRh0gEA","guidislink":false,"published":"Fri, 21 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=111, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vamluZ2RhaWx5LmNvbS9wb3N0cy9lYXJ0aC1kYXktMjAyMy1icmFuZHMtY29uc3VtZXJzLWNoaW5hLXByYWRh0gEA?oc=5\" target=\"_blank\">Why Earth Day 2023 Is A Big Deal For Brands And Consumers In China<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Jing Daily<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why Earth Day 2023 Is A Big Deal For Brands And Consumers In China - Jing Daily","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vamluZ2RhaWx5LmNvbS9wb3N0cy9lYXJ0aC1kYXktMjAyMy1icmFuZHMtY29uc3VtZXJzLWNoaW5hLXByYWRh0gEA?oc=5\" target=\"_blank\">Why Earth Day 2023 Is A Big Deal For Brands And Consumers In China<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Jing Daily<\/font>","source.href":"https:\/\/jingdaily.com","source.title":"Jing Daily","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular economy solutions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"This year a rising number of international and domestic players have actively taken part and promoted initiatives around Earth Day in China to showcase a commitment towards sustainability. Domestic sportswear label Li-Ning released a limited-edition recycled skater clothing capsule collection in collaboration with Steve Harrington. Beauty brands Shiseido and Biotherm exhibited their green proposals during the China International Consumer Products Expo in Hainan. And luxury houses like Prada announced their past year’s results and upcoming ESG (environmental, social, and corporate governance) plans to further commit in the field. Domestic sportswear label Li-Ning released a limited-edition recycled skater clothing capsule collection in collaboration with Steve Harrington. Image: Li-Ning The scenario reflects the reality of brands trying to cater to local consumers becoming increasingly climate-conscious through green practices. In 2021, Accenture observed that the pandemic strongly influenced Chinese shoppers’ sustainable consumption more than average globally. According to the consulting survey, 83 percent of Chinese consumers shared that the pandemic influenced them to make greener purchases versus 64 percent globally. With consumers pursuing sustainable practices and looking for brands that align with their values, Earth Day allows businesses to demonstrate their progress in space. “Earth Day carries an incredible educational potential,” says Sennait Ghebreab, academic and program leader at the Istituto Marangoni, and author of Responsible Fashion Business in Practice: Sustainable Concepts and Cases across the Fashion Industry. “Year by year, it has been an effective way to promote eco-friendly programs, such as using renewable energy sources, resource conservation, and trash reduction,” she continues. Here, Jing Daily looks at how brands approach the theme of sustainability in light of Earth Day. Local consumers’ growing interest in clean and green beauty pushes skincare and cosmetics brands to act on reducing their packaging, supply chain CO2 emissions, and business models to meet shifting ethical needs. L’Oréal signed a three-year deal with e-tailer Alibaba to establish low-carbon standards, develop new products, and create measurable circular economy solutions. Japanese beauty giant Shiseido is pushing for all its brands to integrate refill options into their selling methods. Image: Shiseido Other brands have come up with creative and innovative ways to address the issue for Earth Day. US-based skincare label Estée Lauder encourages its clients to reuse their serum and cream bottles for house decoration, offering DIY suggestions. Japanese beauty giant Shiseido is pushing for all its brands to integrate refill options into their selling methods. Both initiatives aim to reduce beauty’s notorious packaging and plastic waste issues. According to consumer research and retail monitoring service NIQ’s 2023 report , 78 percent of respondents agreed that companies should show full supply chain transparency. “The development of conscious consumers has resulted in more thoughtful customers, who question their purchases and demand transparent and honest communication from all brands,” states Ghebreab, the Istituto Marangoni fashion business course program leader. French beauty house Biotherm developed a product impact labeling system, which grades a product’s pollution levels during the supply chain process. Image: Biotherm In light of this, French beauty house Biotherm developed a product impact labeling system, which grades a product’s pollution levels during the supply chain process, allowing consumers to track the product’s environmental and social impact. Biotherm introduced the new initiative at China International Consumer Products Expo in Hainan. Meanwhile, Prada Group is continuously investing in a vertical integration model to attain complete control and traceability of its supply chain — from sourcing, sampling, and production, to logistics. Eighty-eight percent of the group’s manufacturing occurs in Italy, and a large part is conducted inside the group’s owned facilities. Its logistic hub in Levanella, which covers 44,000 square meters, allows the brand to manage all its product shipments from the site. Its logistic hub in Levanella, which covers 44,000 square meters, allows the brand to manage all its product shipments from the site. Image: Prada Thanks to the easy accessibility of corporate information online today, consumers increasingly hold companies and groups accountable for their environmental and social impact. The corporate image directly influences the perception of its brand portfolio. Businesses are directly acting on a group level. Luxury conglomerates like Kering, LVMH, Prada, as well as Chinese sportswear group Xtep have all signed to reach net zero carbon footprint by 2050, the most ambitious goal of the Paris Agreement. Environmental is one aspect of sustainability. Social responsibility is also becoming a key area brand are investing in. “Prada's motto is to be drivers of change. This vision is based on three pillars: planet, people, and culture,” shares Lorenzo Bertelli, Prada Group head of corporate social responsibility. At the Italian luxury maison, women represent the majority of the workforce, 63 percent of the corporate population, and 59 percent of the women hold managerial positions. Through Prada Academy, the house trains young people to ensure the know-how is passed down to young generations. Image: Prada The fashion house is also investing in the future of the workforce. Through Prada Academy, the house trains young people to ensure the know-how is passed down to young generations. The company plans to employ 400 people by 2023, of which 200 will come from the Prada Academy. The latest figures show that 20 percent of Prada Group’s workforce is under 30. Xtep’s 2022 ESG report points out that the company invests in its employees’ career growth and safety. In 2022, Xtep employee training hours reached 364,305 hours, training a total of 11,278 employees. Regarding employee health and safety management, Xtep implemented the Occupational Health and Safety Management System (OHSMS) at work. Meanwhile, Pwc’s 2021 Global Consumer Insights survey on China revealed that 72 percent of Chinese consumers said they try to buy from environmentally responsible companies versus 54 percent globally. Not only do brands need to act on their traditional business model to make it sustainable and socially responsible, but they also need to communicate their commitment to shoppers timely. Sennait Ghebreab, the fashion academic adds: “The pivotal element to consider is always having a genuine and honest conversation and avoid greenwashing, as consumers penalize firms that release deceptive statements.” That being said, Earth Day has become the perfect moment to deliver such a message.","filter_flag":1}
{"title":"L'Oréal and Alibaba join hands in sustainable packaging campaign - Dao Insights","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vZGFvaW5zaWdodHMuY29tL25ld3MvbG9yZWFsLWFuZC1hbGliYWJhLWpvaW4taGFuZHMtaW4tc3VzdGFpbmFibGUtcGFja2FnaW5nLWNhbXBhaWduL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vZGFvaW5zaWdodHMuY29tL25ld3MvbG9yZWFsLWFuZC1hbGliYWJhLWpvaW4taGFuZHMtaW4tc3VzdGFpbmFibGUtcGFja2FnaW5nLWNhbXBhaWduL9IBAA?oc=5","id":"CBMiXWh0dHBzOi8vZGFvaW5zaWdodHMuY29tL25ld3MvbG9yZWFsLWFuZC1hbGliYWJhLWpvaW4taGFuZHMtaW4tc3VzdGFpbmFibGUtcGFja2FnaW5nLWNhbXBhaWduL9IBAA","guidislink":false,"published":"Wed, 26 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=116, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vZGFvaW5zaWdodHMuY29tL25ld3MvbG9yZWFsLWFuZC1hbGliYWJhLWpvaW4taGFuZHMtaW4tc3VzdGFpbmFibGUtcGFja2FnaW5nLWNhbXBhaWduL9IBAA?oc=5\" target=\"_blank\">L'Oréal and Alibaba join hands in sustainable packaging campaign<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Dao Insights<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"L'Oréal and Alibaba join hands in sustainable packaging campaign - Dao Insights","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vZGFvaW5zaWdodHMuY29tL25ld3MvbG9yZWFsLWFuZC1hbGliYWJhLWpvaW4taGFuZHMtaW4tc3VzdGFpbmFibGUtcGFja2FnaW5nLWNhbXBhaWduL9IBAA?oc=5\" target=\"_blank\">L'Oréal and Alibaba join hands in sustainable packaging campaign<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Dao Insights<\/font>","source.href":"https:\/\/daoinsights.com","source.title":"Dao Insights","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular economy solutions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"French cosmetics giant L’Oréal has teamed up with the Chinese e-commerce giant Alibaba in an effort to make China’s beauty industry more sustainable. The two companies have signed a three-year contract to “establish green and low-carbon standards, develop new products and create measurable circular economy solutions for China’s 87 billion USD beauty and personal care industry”. Both entities will work together to make the beauty industry’s supply chain greener, from warehousing, packaging, and distribution to recycling, as well as promote sustainable lifestyles to consumers. Image: SocialBeta As part of the project, L’Oréal and Alibaba have jointly launched the “88 Carbon Reduction Day” campaign from April 20 to 24, encouraging consumers to reduce their carbon footprint through reduced, reusable, and recyclable low-carbon product choices. This campaign includes improving product packaging to comply with L’Oréal’s 3R principles of reduce, reuse, and recycle. By 2030, the global beauty brand aims to have 100% of the plastic used in packaging come from recycled or bio-based resources. The agreement builds on a previously signed agreement in 2018 with Alibaba to foster green consumption and reduce waste by using eco-friendly packaging for all L’Oréal products sold in China. The new partnership between L’Oréal and Alibaba takes their commitment to sustainability to the next level and is expected to bring significant carbon reductions on the “88 Carbon Reduction Day,” while also enhancing the companies’ image as sustainable and socially responsible entities. Share Join our newsletter","filter_flag":1}
{"title":"L'Oréal And Alibaba To Tackle Beauty's Environmental Problem In China - Jing Daily","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vamluZ2RhaWx5LmNvbS9wb3N0cy9sb3JlYWwtYWxpYmFiYS1iZWF1dHktc3VzdGFpbmFiaWxpdHktY2hpbmHSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vamluZ2RhaWx5LmNvbS9wb3N0cy9sb3JlYWwtYWxpYmFiYS1iZWF1dHktc3VzdGFpbmFiaWxpdHktY2hpbmHSAQA?oc=5","id":"CBMiRmh0dHBzOi8vamluZ2RhaWx5LmNvbS9wb3N0cy9sb3JlYWwtYWxpYmFiYS1iZWF1dHktc3VzdGFpbmFiaWxpdHktY2hpbmHSAQA","guidislink":false,"published":"Fri, 14 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=104, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vamluZ2RhaWx5LmNvbS9wb3N0cy9sb3JlYWwtYWxpYmFiYS1iZWF1dHktc3VzdGFpbmFiaWxpdHktY2hpbmHSAQA?oc=5\" target=\"_blank\">L'Oréal And Alibaba To Tackle Beauty's Environmental Problem In China<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Jing Daily<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"L'Oréal And Alibaba To Tackle Beauty's Environmental Problem In China - Jing Daily","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vamluZ2RhaWx5LmNvbS9wb3N0cy9sb3JlYWwtYWxpYmFiYS1iZWF1dHktc3VzdGFpbmFiaWxpdHktY2hpbmHSAQA?oc=5\" target=\"_blank\">L'Oréal And Alibaba To Tackle Beauty's Environmental Problem In China<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Jing Daily<\/font>","source.href":"https:\/\/jingdaily.com","source.title":"Jing Daily","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular economy solutions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"What happened The world’s largest cosmetics company is teaming up with Alibaba Group in a bid to make China’s beauty industry greener. On April 6, L’Oréal signed a three-year deal with the Chinese ecommerce giant to establish low-carbon standards, develop new products, and create measurable circular economy solutions, according to Alibaba’s news site Alizila. Additionally, the two industry leaders will work together to clean up the beauty sector’s supply chain — which covers warehousing, packaging, distribution and recycling — and to increase consumer education on sustainable lifestyles. The agreement comes after L’Oréal signed a deal with Alibaba in 2018 to use environmentally friendly packaging for all its products sold in China. The Jing Take Both L’Oréal and Alibaba have taken steps over the years to reduce their carbon footprint. In 2019, L’Oréal achieved carbon-neutrality across its operation sites in China and has since launched a number of localized campaigns to raise awareness around sustainable consumption. Meanwhile, Alibaba has pledged to go carbon neutral by 2030 and facilitate 1.5 gigatons of decarbonization by 2035, supported by initiatives like its carbon ledger whereby consumers can earn points for making low-carbon choices. While these steps are commendable, it’ll take a lot more to address beauty’s glaring sustainability problem. The global beauty industry produces an estimated 120 billion units of packaging annually — most of which is not recyclable — and this packaging accounts for 70 percent of the industry’s waste. This has a ripple effect on our oceans, forests, and even our bodies as microplastics end up in the food we consume. But tackling the issue is not just a matter of ethics; it’s also a promising business opportunity. As awareness around climate change grows, so too does the demand for green products. According to a 2022 PWC survey, 50 percent of Chinese respondents said they are willing to pay a higher than average price for a product that has a traceable and transparent origin, while 45 percent are willing to do so for products made from recycled or eco-friendly materials. “In general, the willingness of Chinese consumers to pay more for ESG-friendly products is driven by the search for ‘better-for-me’ products — whether they are produced from a better source or made from materials that contain less ‘harmful’ materials to human,” states the report. Ultimately, zero waste measures can only be accomplished when a product is eliminated entirely, which is an unrealistic expectation as companies vie for China’s 88 billion beauty and personal care market. Perhaps making products more sustainably and strengthening public education around the concept, like what L’Oréal and Alibaba hope to do, is the next best step. The Jing Take reports on a piece of the leading news and presents our editorial team’s analysis of the key implications for the luxury industry. In the recurring column, we analyze everything from product drops and mergers to heated debate sprouting on Chinese social media.","filter_flag":1}
{"title":"CS Tuiya invites Danish waste recyclers to invest in Kenya - The Star Kenya","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LnRoZS1zdGFyLmNvLmtlL25ld3MvMjAyMy0wNC0yNy1jcy10dWl5YS1pbnZpdGVzLWRhbmlzaC13YXN0ZS1yZWN5Y2xlcnMtdG8taW52ZXN0LWluLWtlbnlhL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LnRoZS1zdGFyLmNvLmtlL25ld3MvMjAyMy0wNC0yNy1jcy10dWl5YS1pbnZpdGVzLWRhbmlzaC13YXN0ZS1yZWN5Y2xlcnMtdG8taW52ZXN0LWluLWtlbnlhL9IBAA?oc=5","id":"CBMiZmh0dHBzOi8vd3d3LnRoZS1zdGFyLmNvLmtlL25ld3MvMjAyMy0wNC0yNy1jcy10dWl5YS1pbnZpdGVzLWRhbmlzaC13YXN0ZS1yZWN5Y2xlcnMtdG8taW52ZXN0LWluLWtlbnlhL9IBAA","guidislink":false,"published":"Thu, 27 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=117, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LnRoZS1zdGFyLmNvLmtlL25ld3MvMjAyMy0wNC0yNy1jcy10dWl5YS1pbnZpdGVzLWRhbmlzaC13YXN0ZS1yZWN5Y2xlcnMtdG8taW52ZXN0LWluLWtlbnlhL9IBAA?oc=5\" target=\"_blank\">CS Tuiya invites Danish waste recyclers to invest in Kenya<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Star Kenya <\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CS Tuiya invites Danish waste recyclers to invest in Kenya - The Star Kenya","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LnRoZS1zdGFyLmNvLmtlL25ld3MvMjAyMy0wNC0yNy1jcy10dWl5YS1pbnZpdGVzLWRhbmlzaC13YXN0ZS1yZWN5Y2xlcnMtdG8taW52ZXN0LWluLWtlbnlhL9IBAA?oc=5\" target=\"_blank\">CS Tuiya invites Danish waste recyclers to invest in Kenya<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Star Kenya <\/font>","source.href":"https:\/\/www.the-star.co.ke","source.title":"The Star Kenya","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular economy solutions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Environment CS Soipan Tuiya has invited Danish waste recycling companies to invest in Kenya's emerging circular economy. She said the country has established a robust regulatory framework to anchor the sector, assuring them of government's support. She spoke on Thursday during the official opening of the 2023 Loop Forum in Copenhagen, Denmark, where she delivered the key note address at the invitation of the Danish Government. \"I therefore invite Danish, and by extension, Scandinavian investors interested in tapping into Kenya's waste economy to bring their circular economy solutions to Nairobi,\" she said. \"I assure you of my Ministry's and the government's full support as you bring your investments to Kenya.\" The Forum is Scandinavia's largest exhibition of circular economy technologies, products and innovations. It was attended by circular economy entrepreneurs, innovators and industrialists from Europe and the rest of the world. \"We look forward to joint learning and joint information exchange. We look forward to a robust partnership that will help us realise zero waste as we make circular economy a reality for Kenya,\" CS Tuiya added. In February 2023, Kenya hosted her inaugural Loop Forum with the support of the Danish and Dutch governments. The exhibition brought together over one thousand participants from across the world.","filter_flag":1}
