{"title":"Ark Energy wins tender for world's largest 8-hour lithium battery - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzIwL2Fyay1lbmVyZ3ktc2VjdXJlcy1hcHByb3ZhbC1mb3Itd29ybGRzLWxhcmdlc3QtOC1ob3VyLWxpdGhpdW0tYmF0dGVyeS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzIwL2Fyay1lbmVyZ3ktc2VjdXJlcy1hcHByb3ZhbC1mb3Itd29ybGRzLWxhcmdlc3QtOC1ob3VyLWxpdGhpdW0tYmF0dGVyeS_SAQA?oc=5","id":"CBMibWh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzIwL2Fyay1lbmVyZ3ktc2VjdXJlcy1hcHByb3ZhbC1mb3Itd29ybGRzLWxhcmdlc3QtOC1ob3VyLWxpdGhpdW0tYmF0dGVyeS_SAQA","guidislink":false,"published":"Wed, 20 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=20, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=354, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzIwL2Fyay1lbmVyZ3ktc2VjdXJlcy1hcHByb3ZhbC1mb3Itd29ybGRzLWxhcmdlc3QtOC1ob3VyLWxpdGhpdW0tYmF0dGVyeS_SAQA?oc=5\" target=\"_blank\">Ark Energy wins tender for world's largest 8-hour lithium battery<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Ark Energy wins tender for world's largest 8-hour lithium battery - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzIwL2Fyay1lbmVyZ3ktc2VjdXJlcy1hcHByb3ZhbC1mb3Itd29ybGRzLWxhcmdlc3QtOC1ob3VyLWxpdGhpdW0tYmF0dGVyeS_SAQA?oc=5\" target=\"_blank\">Ark Energy wins tender for world's largest 8-hour lithium battery<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Production\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"From pv magazine Australia The Richmond Valley Battery Energy Storage System lithium-iron phosphate battery system is being developed at the proposed Richmond Valley Solar Farm site at Myrtle Creek by Ark Energy, which, along with the Sun Metals Zinc Refinery in Queensland, is a subsidiary of Korea Zinc. The battery project, which will use lithium-iron phosphate (LFP) technology, will have a power capacity of 275 MW and an energy storage capacity of up to 2,200-MWh over eight hours. With existing and planned projects globally, this constitutes the largest eight-hour lithium-ion battery project in the world to date. Behind the large-scale project, Korea Zinc is already working on other energy storage mechanisms closer to its Townsville base, from where it supplies much of Asia with non-ferrous metals. The Richmond Valley project is being developed by Ark Energy, which has a mandate to provide Korea Zinc with enough renewable energy for the production of green zinc. The Richmond Valley battery project is one of five energy infrastructure projects representing 750 MW of renewable energy generation and 524 MW\/4,192 MWh of long-duration storage that have been successful to the New South Wales (NSW) government’s latest tender round as it prepares for the exit of coal-fired power generation from the state’s electricity grid. “NSW is now almost halfway there on our 2030 renewable generation target, and over a quarter of the way there on our long-duration storage target,” said NSW Energy Minister Penny Sharpe. The five successful projects represent AUD 4.2 billion ($2.84 billion) in private sector investment in NSW’s renewable energy infrastructure. The energy storage projects are expected to be operational by 2028 and are expected to contribute an estimated 1,000 jobs, AUD 2 billion in local supply chain benefits and AUD 40 million towards First Nations initiatives. With an energy storage capacity of up to 2.2 GWh over eight hours, the Richmond Valley durational battery storage project exceeds other big batteries planned for Australia and globally, including Akaysha’s Waratah Super Battery, which has a capacity of 850 MW\/1,680 MWh and the Orana battery in NSW that clocks in 415 MW\/1,660 MWh. It is also larger than Synergy’s 500 MW \/ 2,000 MWh Collie battery in WA and has six hours more capacity than Equis’ 1,200 MW\/2.4 GWh (two hours) Melbourne Renewable Energy Hub battery project. The Richmond Valley battery project will be built alongside the proposed Richmond Valley Solar Farm being developed near Casino in northern NSW. The project includes the construction, operation, maintenance and decommissioning of the solar farm with a capacity of 500 MW. The project includes the installation of approximately one million PV panels on a mounted tracking system and will connect to the grid via the Coffs Harbour to Lismore 330 kV powerline that transects the site. Australia’s leadership in renewable durational battery storage lies in its ideal circumstances for large-scale solar. The combination of available land, high solar coverage, a comparatively high level of technological infrastructure and functional governance are all elements that make Australia an ideal breeding ground for renewable energy projects such as the Richmond Valley battery. Australian conditions make it ideal for industrial giants such as Korea Zinc, the world’s largest producer of zinc, lead and silver, and its subsidiaries. Korea Zinc is currently trying to organise its supply chains so it can avoid exclusion from battery production in the US with the new FEOC regulations (‘foreign entities of concern’) – basically trying to reduce the total dependence on China for all things battery-related. The company is also ramping up its renewable energy production – with Ark Energy, among others – as well as ramping up its recycling activities to keep critical raw materials in production loops. According to US stipulations, if battery materials were originally produced in China but recycled outside of FEOC, these materials regain eligibility for US subsidies. Popular content The clean production of energy and short transport distances mark two important issues in compliance with standards for government investments in important industries. Refining zinc takes a lot of energy. If battery materials are not produced and transported with the lowest possible carbon footprint, they face exclusion from many governmental support schemes globally as countries try to decarbonise their industries. Ark Energy is tasked with decarbonising the Korea Zinc subsidiary Sun Metal’s Townsville zinc refinery. The plant is currently Queensland’s second biggest electricity user and chews up between AUD 50 million to AUD 80 million in energy costs each year. Korea Zinc has recognised Australia’s combination of assets, making it one of the world’s ideal locations for industrial activity, with production on-site reducing excessive transportation costs of renewable energy – particularly from neighbouring regions with high energy needs. In terms of durational storage, lithium battery projects are said to be limited to eight hours of storage potential. The use of lithium for durational storage pits it in competition with transportation needs as the world’s transport industries transition off fossil fuels. Vehicle batteries have higher demands of battery performance and are, therefore, not as flexible as the frameworks applying to stationary storage in terms of alternative methods. Lithium battery storage systems typically last four to eight hours. As renewable energy generation becomes a higher share of the grid, it will require longer durations and technologies with different characteristics to simulate a “base load” generation mix. Besides lithium battery storage systems, “mid- to long-term” storage technologies such as iron air or zinc-based battery storage systems (which still have other drawbacks) boast the use of significantly more abundant materials. Renewable energy stored in green hydrogen can make electricity available months later. Gravitational storage provides a duration of 4-24 hours and has a lifespan of up to 35 years. Korea Zinc is covering all options. In November, Ark Energy broke ground on its SunHQ green hydrogen hub. The industrial group is also getting primed to export energy to those places less well-endowed with the combination of sun and space – such as most of densely populated Asia – by means of a renewable energy hub in Queensland. In terms of durational energy storage potential, publications in China point to gravity energy being one of the most tenable energy storage mechanisms for durational storage, also mentioning Vault Energy as an industry leader in this regard. Compared to other methods, gravity-based storage does not need to rely on research years or decades in the future, has a low environmental footprint, no supply chain issues, and is flexible and scalable, making it versatile for both small- and large-scale energy storage. In 2022, Korea Zinc signed a partnership with Vault Energy. The Swiss company’s gravitational EVx storage system works like pumped hydro. It uses power when supply is abundant to drive motors and raise 30-tonne blocks made of soil and waste materials, rather than water, up to a height. When energy is needed – irrespective of whether the sun is shining or the wind is blowing – the blocks are lowered, which releases their potential energy to generate electricity. Pumped storage has been around for a long time, but utilising moving mass is relatively new, and Energy Vault is considered a leader in this area. Energy Vault says the technology is not dependent on specific terrain, lasts four to 24 hours, and has a lifespan of up to 35 years. The title of this article was amended on 09.02.2024 to reflect that the project has been awarded a long-term energy service agreement (LTESA) through the Australian Energy Market Operator’s LTESA tender program but has not yet been approved as the title previously stated. Ark Energy pointed out that the project still has to go through the planning and assessment process and be approved by the NSW Government, which has not happened yet. ","filter_flag":1}
