{"title":"EcoFlow Wins TIME Best Inventions 2023 Award - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvZWNvZmxvdy13aW5zLXRpbWUtYmVzdC1pbnZlbnRpb25zLTIwMjMtYXdhcmQtMzAyMDE3NzAzLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvZWNvZmxvdy13aW5zLXRpbWUtYmVzdC1pbnZlbnRpb25zLTIwMjMtYXdhcmQtMzAyMDE3NzAzLmh0bWzSAQA?oc=5","id":"CBMiZGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvZWNvZmxvdy13aW5zLXRpbWUtYmVzdC1pbnZlbnRpb25zLTIwMjMtYXdhcmQtMzAyMDE3NzAzLmh0bWzSAQA","guidislink":false,"published":"Mon, 18 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=18, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=352, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvZWNvZmxvdy13aW5zLXRpbWUtYmVzdC1pbnZlbnRpb25zLTIwMjMtYXdhcmQtMzAyMDE3NzAzLmh0bWzSAQA?oc=5\" target=\"_blank\">EcoFlow Wins TIME Best Inventions 2023 Award<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"EcoFlow Wins TIME Best Inventions 2023 Award - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvZWNvZmxvdy13aW5zLXRpbWUtYmVzdC1pbnZlbnRpb25zLTIwMjMtYXdhcmQtMzAyMDE3NzAzLmh0bWzSAQA?oc=5\" target=\"_blank\">EcoFlow Wins TIME Best Inventions 2023 Award<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly energy solutions\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"SEATTLE, Dec. 18, 2023 \/PRNewswire\/ -- EcoFlow, a leading portable power and eco-friendly energy solutions company, is thrilled to announce that the EcoFlow GLACIER portable refrigerator has been honored with the prestigious TIME Best Inventions 2023 Award in the Green Energy category. This recognition underscores EcoFlow's commitment to green and sustainable development. EcoFlow GLACIER portable refrigerator has been honored with the prestigious TIME Best Inventions 2023 Award in the Green Energy category. The EcoFlow GLACIER stands out as a game-changer in the outdoor industry, offering a portable cooler that not only enhances convenience but also aligns with a commitment to environmental responsibility. TIME's recognition highlights GLACIER's positive impact on reducing the ecological footprint associated with outdoor activities. A standout feature of the GLACIER is its detachable plug-in battery, providing up to 40 hours of cordless power. This not only ensures extended cooling and portable capabilities, but also serves as a clean energy source for charging essential devices, aligning with EcoFlow's dedication to fostering a green energy future. The TIME Best Inventions 2023 Award solidifies EcoFlow's leadership in the green energy and portable power industry. The company continues to forge ahead with its mission to develop cutting-edge, sustainable solutions that empower individuals to enjoy a seamless and eco-friendly outdoor lifestyle. In addition to the TIME award, EcoFlow has garnered numerous prestigious accolades this year. The EcoFlow GLACIER also received the CES 2023 Innovation Awards Honoree and the 2023 Good Design Award winner earlier this year. The EcoFlow WAVE 2 portable air conditioner and DELTA Pro whole-home backup power solution won the Good Housekeeping 2023 Home Reno Award last month. Furthermore, the EcoFlow DELTA 2 Max portable power station won the Red Dot Award, while the RIVER 2 secured the Good Housekeeping Best Family Travel Awards. Looking forward, EcoFlow is excited to share that this year has been one of success and experimentation in new areas, particularly in the smart devices segment. Anticipating the future, EcoFlow is gearing up to focus on the energy storage industry in the coming year. About EcoFlow EcoFlow is a leading eco-friendly energy solutions company with the vision to power a new world. Since its founding in 2017, EcoFlow aims to become a reliable and trusted energy companion for individuals and families across the world, providing accessible and renewable power solutions at home, outdoors, and in mobile spaces. Today, with operational headquarters located in the USA, Germany, and Japan, EcoFlow has empowered more than 2.5 million users in over 100 markets worldwide. For more information, visit https:\/\/www.ecoflow.com\/us . SOURCE EcoFlow Technology Inc.","filter_flag":1}
