{"title":"Leadership for a changing energy environment - McKinsey","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3Lm1ja2luc2V5LmNvbS9pbmR1c3RyaWVzL29pbC1hbmQtZ2FzL291ci1pbnNpZ2h0cy9wb3dlcmluZy11cC1uZXctbGVhZGVyc2hpcC1mb3ItYS1jaGFuZ2luZy1lbmVyZ3ktZW52aXJvbm1lbnTSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3Lm1ja2luc2V5LmNvbS9pbmR1c3RyaWVzL29pbC1hbmQtZ2FzL291ci1pbnNpZ2h0cy9wb3dlcmluZy11cC1uZXctbGVhZGVyc2hpcC1mb3ItYS1jaGFuZ2luZy1lbmVyZ3ktZW52aXJvbm1lbnTSAQA?oc=5","id":"CBMieWh0dHBzOi8vd3d3Lm1ja2luc2V5LmNvbS9pbmR1c3RyaWVzL29pbC1hbmQtZ2FzL291ci1pbnNpZ2h0cy9wb3dlcmluZy11cC1uZXctbGVhZGVyc2hpcC1mb3ItYS1jaGFuZ2luZy1lbmVyZ3ktZW52aXJvbm1lbnTSAQA","guidislink":false,"published":"Fri, 03 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=3, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=34, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3Lm1ja2luc2V5LmNvbS9pbmR1c3RyaWVzL29pbC1hbmQtZ2FzL291ci1pbnNpZ2h0cy9wb3dlcmluZy11cC1uZXctbGVhZGVyc2hpcC1mb3ItYS1jaGFuZ2luZy1lbmVyZ3ktZW52aXJvbm1lbnTSAQA?oc=5\" target=\"_blank\">Leadership for a changing energy environment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">McKinsey<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Leadership for a changing energy environment - McKinsey","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3Lm1ja2luc2V5LmNvbS9pbmR1c3RyaWVzL29pbC1hbmQtZ2FzL291ci1pbnNpZ2h0cy9wb3dlcmluZy11cC1uZXctbGVhZGVyc2hpcC1mb3ItYS1jaGFuZ2luZy1lbmVyZ3ktZW52aXJvbm1lbnTSAQA?oc=5\" target=\"_blank\">Leadership for a changing energy environment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">McKinsey<\/font>","source.href":"https:\/\/www.mckinsey.com","source.title":"McKinsey","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Technological, economic, regulatory, and geopolitical forces are driving a rapid evolution of the global energy landscape. Although opinions vary on the pace and extent of the resulting transitions, attempts to balance energy security, affordability, and long-term decarbonization ambitions are contributing to unprecedented uncertainty about the global energy future. While transformation of the global energy mix is not new, the current transition is larger in scale and more complex than previous ones due to the multitude and sometimes divergent drivers of the transition. As one industry CEO summed it up: “The energy industry has basically been static for a long time, although we did not know it was static. We’ve now moved from a largely internal, incremental agenda, to a whole set of existential risks and opportunities in front of us.” On one hand, the increasing urgency around climate change and reducing greenhouse-gas emissions is driving the transition to cleaner energy sources. Many countries and corporations have committed to achieving net-zero emissions within the next few decades. Early movers—industry incumbents and pure-play, clean-energy players—are leading the paradigm shift, disrupting traditional business models, and making permanent structural changes to these industries. On the other hand, the rebound in energy demand after the first wave of the COVID-19 pandemic, coupled with supply-side constraints over the past year, have revealed the magnitude of the challenge in achieving climate-change ambitions. Global energy demand and supply-side variability are expected to increase over the next decade. Until alternative energy sources are universally efficient, scalable, and affordable, traditional energy sources and related infrastructure will continue to play an essential role. These considerations introduce a high degree of uncertainty about the path ahead, including how energy supply and demand, competitive and geopolitical dynamics, and societal implications will evolve. One thing is clear, however: the search for sustainable, reliable, and affordable energy will be at the core of global aspirations. Five ways leaders can transform to succeed in this shifting landscape These unprecedented and evolving challenges need to be tackled by all leaders of companies in the energy sector, from pure-play, new-energy startups to more traditional oil and gas companies balancing old and new business models, risk profiles, and cultures. Many of the elements of what it takes to succeed in the evolving energy environment will likely differ from those experienced in the past. Fresh demands may be placed on leaders, and a fundamentally new approach to leadership will likely be required for incumbents and startups. This is irrespective of the business strategy adopted—which may range from a full pivot to clean energy, to a combination play, to an ongoing focus on a core hydrocarbon business but with the introduction of emissions abatement. Overall, we see companies—and leaders—needing to operate with substantially greater speed and entrepreneurialism, and this is especially applicable in the new energy sector. They may need to develop and practice fresh ways of collaborating, both within their organizations and in the emerging energy ecosystems. A major challenge is attracting and retaining talent in an environment where traditional energy companies are under intense negative public pressures. We interviewed 15 C-suite executives across organizations in the energy sector to gain their perspectives on the critical leadership capabilities required to succeed in this new energy era. The interviews were complemented by a global survey of more than 140 senior industry leaders. The survey asked leaders to identify and rate the importance of different leadership capabilities against the backdrop of the current macro environment, and to offer their perception on how leaders in their organizations are currently performing across these capabilities. Finally, we layered in data from our extensive body of leadership research and decades of experience helping organizations with their leadership transformations. Based on our experience and research, we defined five key roles that leaders typically perform, from setting focus and direction to showing up as a leader, and identified two broad categories of leadership qualities and mindsets, which we have called “traditional” and “emerging” (Exhibit 1). 1 The survey results illustrate a high level of agreement from respondents on the importance of emerging leadership qualities and mindsets to succeed in the new energy environment, while reiterating the ongoing relevance of traditional qualities (Exhibit 2). We observed a larger gap between desired and current levels of competency for emerging leadership qualities and mindsets. This is unsurprising, as successful leaders and executives have practiced and honed the traditional qualities for many years. 2 A closer look at the data suggests that some traditional leadership qualities are more important than others. For example, being an effective executive delivering financial returns for shareholders continues to be a prerequisite, and detailed planning and working toward defined delivery is still important. In terms of emerging qualities, numerous respondents highlighted the importance of meeting stakeholder expectations, with growing pressure on energy firms beyond creating value for their shareholders. Furthermore, there is clear recognition of the need for new leadership approaches to operate through shorter decision cycles and with greater experimentation, and to take advantage of market fluctuations and emerging and uncertain new-energy opportunities. Shifting one’s mindset and embracing emerging leadership qualities can be a challenge for senior leaders who have relied on traditional tool kits. However, there is also a great opportunity here. During our research, many sector leaders expressed excitement about building and leading new kinds of organizations, and designing them to succeed today and in the future. There was also much enthusiasm about the prospect of exhibiting greater purpose, promoting employee empowerment, facilitating collaboration inside and outside their organizations, and operating with higher levels of agility and entrepreneurialism. What does this leadership transformation require? We see it as including five key unlocks, involving mindset and behavioral shifts (Exhibit 3). 3 1. Setting focus and direction: Beyond profit to impact The purpose of any organization is to create value for its stakeholders. In today’s open environment, where people have more information and options than before, leaders are well-placed to deeply understand how their organizations will add unique value to customers, colleagues, investors, partners, and other key stakeholders. While generating financial returns for shareholders remains critical, the purpose of an organization now extends to the role it plays in benefiting society. The energy sector is becoming keenly aware of this need to widen the scope of value-add. The CEO of a downstream company emphasized what this means for leadership: “In the past, the oil and gas industry has been made up of engineers and accountants. In today’s world, we need to include communicators in our leadership to help us find an emotional attachment to what we do. Their involvement will help demonstrate how using practical solutions to do things more sustainably can be exciting and inspiring.” The CEO of a European private energy company echoed this sentiment, saying: “There is a huge opportunity ahead to have unbelievable impact. It’s the kind of opportunity that only arises once in a generation. We can change our country, we can change our region, we can contribute to global change. Realizing this opportunity will be monumental, and stepping away is unthinkable. This is what is inspiring us now.” Top-performing organizations know that purpose is both a differentiating factor and a must-have. A strongly held sense of corporate purpose is a company’s unique affirmation of its identity and embodies what the organization stands for, from a historical, emotional, social, and practical point of view. Future-ready companies recognize that purpose helps attract and retain talent and ensures these individuals thrive. Investors understand why this is valuable, and factor purpose into their decision-making. Crafting a compelling, purposeful narrative is particularly important for companies navigating the energy transition. Leaders may look to build new, lower-carbon businesses while generating most of the cash flow and profits from the traditional core. A balance may then need to be struck between the past and the future in a way that is coherent and inspiring for employees in all parts of the business. On maintaining this balance, one executive reflected: “We originally got this wrong and over-indexed on the newer businesses when describing our purpose. This led to many in the traditional heart of our company questioning their role and even reconsidering their future with us. We quickly had to rebalance and find a more sophisticated narrative: celebrating our role in supplying secure and reliable energy to the world, while leading the charge to make sure this was ever cleaner through decarbonization and building new-energy businesses.” Nonetheless, few companies harness purpose fully. In a McKinsey survey of employees at US companies, 82 percent said organizational purpose is important, but only half that number said their purpose drives impact. Leaders may wish to spend time thinking about, articulating, and championing their company’s purpose as it relates to the real impact of day-to-day business practices. One CEO put it this way: “We need to transform and unite our leadership. Leadership transformation will help us position our company and its culture to meet the new challenges. A united leadership is important to give our people and stakeholders a consistent message about the kind of place we want our company to be.” This emphasizes the importance of an inspiring company identity beyond the attachment to functions and business units. Would you like to learn more about our Oil & Gas Practice 2. Redesigning value creation: Beyond rivalry to camaraderie Leaders seeking to succeed in the new energy environment may look at moving beyond a win\/lose, “fixed mindset” approach, where the dominant focus is on protecting market share and beating competitors in existing businesses. Instead, they could make greater strides by adopting a win\/win, “growth mindset” approach, by shifting focus to new value opportunities—working with suppliers, customers, and other stakeholders to introduce new technologies and solutions that will lead to new products, services, and businesses—and creating major new markets that do not exist today. Such a shift in focus may require changes to capital allocation, operations, and performance management. Moreover, some changes may be contingent on actions by other entities. For example, mass uptake of electric vehicles depends on utilities expanding grid capacity to support charging networks. Companies may find they need to partner with other organizations to meet common needs, such as the necessity for industrial-scale networks in hydrogen production and distribution. Leaders may have to engage and work with a wide range of external partners and stakeholders to enhance and evolve the ecosystem within which the organization operates, exploring and generating mutually beneficial opportunities. They could benefit from developing connected thinking: joining traditionally separate sectors; fostering new links between companies, organizations, and citizens; and taking calculated risks. An executive in an energy service company emphasized the profound challenges they face, and the need for new and often uncomfortable thinking and action: “We are moving away from stable businesses that we are familiar with to ones we don’t understand. This is uncomfortable. In ten years, we will look back and say we did not take enough risks.” Another executive said: “We instinctively play defense instead of offense, because we believe we have so much to lose. I don’t have a fear of losing, but I do have a fear of not showing up for the game. We need to take more swings, which will then help us get more hits.” While leaders may be required to take risks and try new approaches, they are well-placed to do this while being conscious of the resources used and with capital discipline. In most organizations, the “old” is subsidizing the “new”, which needs to be managed. One CEO from our research stressed the challenges of managing this duality: “Both the old and the new need to be included in the energy transition. There is nothing sustainable about not making money.” He also said he needs to be increasingly clinical about “stopping some projects that don’t work” to create space for those that show more potential. Further, there is the need for new forms of ownership and governance. In this context, one CEO commented: “It is very easy to lose investors if you say, ‘Don’t worry, we will lose money on this for the next ten years.’ But to succeed now, you need to find the oxygen and the space to develop the new and the uncertain.” 3. Organizing how people work: Beyond command to collaboration To survive and thrive, energy organizations and their leaders are well-placed to engage with their teams in ways that make them feel connected. Social capital—the presence of networks, relationships, shared norms, and trust among individuals, teams, and business leaders—is increasingly the glue that holds organizations together. When teams feel connected, they tend to get more work done and do it faster. When colleagues trust their managers and one another, they are more engaged, more willing to go beyond minimum work requirements, and more likely to stick around. Social capital matters to an organization’s performance. By leaving frontline employees on the sidelines, companies miss out on critical information that could bring key strategic insights. An executive at a private oil and gas company noted how they are attempting to tap into their employee base: “Disruptive trends may start at the margins of an organization, where frontline employees operate. These employees’ perspectives and ideas often do not get clearly communicated to leadership, making it easy to brush them off, thinking they are not important.” Leaders could engage and unleash the full potential of everyone in the organization by empowering people in small units (cross-network teams) instead of managing individuals through the narrow lens of rigid job descriptions. Small units might then be focused on a clear and distinct value-contribution mission, giving them the autonomy, access to information, guidance, training, and multi-disciplinary capabilities they need to operate with high levels of entrepreneurship to successfully deliver on their goals. One oil and gas executive described this evolved leadership as “turning the whole pyramid leadership structure on its head. The people doing the work are key, and everyone else supports them. Servant leadership, role-modeling, and listening to the people who understand how the work gets done are all part of this new approach.” Leading this empowered network requires high-performing leaders who offer effective and efficient leadership, beyond the management of internal politics inherent in a hierarchy of individual managers and traditional governance groups. It requires fundamental shifts in the mission, culture, and operating models of every leader and leadership team in the network. This new leadership style is often challenging. One head of production at an international energy company said: “My biggest change was giving up control and delegating. It wasn’t easy, but that’s exactly the change that was needed. Instead of asking teams for updates and reports, leaders now focus on giving context, setting the mission, and defining the purpose and intent. Leaders ask, ‘How can I help?’ when engaging with teams, and focus on tackling problems. Teams are empowered to figure out how to deliver the mission within the boundaries defined by standard processes.” To amplify and realize the full potential of everyone in the system, leaders could foster peer-to-peer transparency, relationships, and workflow across the various “small units”. This can be done by removing roadblocks that prevent empowered teams from bringing ideas to reality, fostering connections across the organization, helping people to connect what they’re working on with the organization’s vision and aspiration, and encouraging an inclusive and welcoming environment where people bring their authentic selves to the office and pursue the full range of their aspirations. How people and organizational moves can power up energy firms in 2023 4. Getting the work done: Beyond control to evolution Energy companies operate in a highly dynamic, unknown, and volatile environment, where major “black swan” opportunities and challenges are emerging with increasing frequency. As energy markets and related policies find a new equilibrium, organizations must keep an eye on the horizon to plan robustly for the uncertain future, while maintaining business continuity on their core value proposition. Hence, in addition to the primary disciplined focus on executing today and co-creating tomorrow, leaders could build effective “first responder” capabilities to tackle major discontinuities within any business cycle. One senior executive in a traditional oil and gas company put it this way: “The old style was slow and steady decision-making. But when you decided, you carried through with it. This doesn’t work in the energy transition. Instead of slow and flawless execution of large, incremental decisions, we need to rapidly learn and evolve.” Successful leaders have traditionally managed their organizations through planning and control based on extensive analysis, while seeking to minimize disruptions. Today, leaders could learn to become comfortable with operating in shorter, rapid cycles. This requires increased focus on quick, low-risk decisions and experiments, learning from those that fail, and scaling those that succeed. Leaders could begin and end each rapid cycle with a retrospective to review progress, deepen learning, and plan for the next cycle. Each cycle could focus on a set of short-term outcomes, accomplished via prioritized deliverables and initiatives that reflect available short-term capacity and appropriately manage risk. Outcomes, deliverables, activities, and resources may be reprioritized during each cycle to reflect rapidly changing realities. What this means for leadership in the new energy world is captured by the director of strategy at an offshore driller, who said: “In an industry where it is becoming increasingly challenging to raise capital, a sharp external focus and agile thinking can create opportunities.” The CEO of a traditional oil and gas service company summed up what many executives said: “We need to become entrepreneurial and non-bureaucratic. Being slow and considered may be important in large, traditional engineering projects, but this approach doesn’t work in the new energy space. Right now, we love to control and work in silos. This must change.” The CEO of an integrated energy company emphasized the importance of empowering those who work in their organizations: “I want to see us acting more quickly, allowing employees to take decisions at the lowest level possible. We need to empower them to identify and make decisions without having to consult their bosses. It’s OK for us to make mistakes if we take accountability, fix them, and learn. It would be much worse if we didn’t make mistakes, which would tell me that we are not taking risks and are playing too safe.” Many of the leaders we interviewed emphasized the need to take risks to succeed in the emerging energy era. For organizations to continually evolve in this emergent way, leaders may need to overcome status-quo bias—to imagine a world or a market that is very different from what it is today. Recognizing the inherent challenges in such a transformation, a leader in a major energy company said: “In fairness, it is difficult as a leader to take your attention and resources from a business area that is already highly profitable, to focus on an extremely uncertain one.” Leaders in the energy sector may increasingly need to balance their attention between current activities and future opportunities. 5. Showing up as a leader: Beyond professional to human Navigating this uncertainty is an immense challenge that will require best-in-class talent to solve complex problems. As traditional business models are disrupted, organizations in the energy industry will need to ensure they retain their core experienced workforce while attracting diversified talent in line with new business needs. The competition for talent is intense and potential employees are looking for more than financial compensation. Creating an attractive destination for top talent means fostering an inclusive employee experience. This influences whether employees remain and thrive, which in turn drives the company’s financial sustainability. Leaders across all levels have a critical role to play in creating an environment where employees can bring their full authentic selves to work and feel empowered to pursue a sustainable work\/life balance. For this to happen, leaders themselves need to show up with greater wholeness and authenticity. One industry executive connected this with the impact of the pandemic: “In COVID-19, leaders had to become more authentic—we all went through the same war together. This is an asset now in terms of the leadership we need.” One way this leadership manifests itself is in relation to the demand by today’s employees for more flexibility and autonomy. Leaders can facilitate this by allowing employees a degree of autonomy—empowering them to do their best work where they feel deeply motivated and energized. Another executive in the energy business effectively captures this role for leadership using a metaphor: “Think of it as driving on a highway. You can set some limits, like the road barriers on left and right. But once you set some boundaries, you must let others drive. You cannot take everyone on the back of a lorry that you are driving.” An executive in another global company reinforces this point: “Traditionally, there has been a lot of focus on presence in the office but, since COVID-19, employees demand flexibility. Many senior leaders find it hard to make this adjustment, and this could lead to high performers leaving the company.” Conclusion These five mindset and behavioral shifts could contribute to a unique and more powerful kind of leadership. When leaders identify and build the culture they want the organization to embody, they can create a virtuous cycle, attracting the right talent that will thrive, unlock their value agenda, and turbocharge their performance. However, the road to transformation is full of bumps and bends. Such shifts often require changing current systems and ways of operating, which will inevitably create some organizational resistance. Leaders may need to brace themselves for complexity and chaos, while demonstrating deep self-awareness, as they address their own embedded biases and overhaul their own mindsets for the new environment. The transformation can also require organizations to commit to leadership development and a holistic cultural transformation—broad ideals and small incremental changes may no longer be sufficient. Emerging behaviors and mindsets cannot exist as mere slogans on a wall or in catchy email signatures. They require embodiment on a day-to-day basis, being continuously role-modeled by senior executives; integration into core business activities and specific actions; and demonstration in the moments that matter. These are exciting times for the energy sector, given its placement at the center of the critical challenges facing our world. Meeting these challenges requires the development of the extended characteristics of leadership we have highlighted here. The good news is that industry leaders are aware of the challenges and are consciously starting to address the demands of new leadership. This not only requires new talent from places outside the traditional energy sector, but also active transformation of existing leadership. One sector CEO summed up the challenges: “Where do we get the entrepreneurs we need now to lead in the next phase of the energy industry? You need some new leaders from outside the industry, in balance with those from the existing business. You need the new-energy zealots to provide inspiration, but you also need leaders to demonstrate that real practical progress is being made on the ground. We are finding that there are many ‘entrepreneurs in residence’—leaders who are more incremental but who just need permission to be entrepreneurs. We need to activate them!”","filter_flag":1}
{"title":"Irwin Mitchell Launches ESG Advisory Service - Irwin Mitchell","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3Lmlyd2lubWl0Y2hlbGwuY29tL25ld3MtYW5kLWluc2lnaHRzL25ld3NhbmRtZWRpYS8yMDIzL2ZlYnJ1YXJ5L2lyd2luLW1pdGNoZWxsLWxhdW5jaGVzLWVzZy1hZHZpc29yeS1zZXJ2aWNl0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3Lmlyd2lubWl0Y2hlbGwuY29tL25ld3MtYW5kLWluc2lnaHRzL25ld3NhbmRtZWRpYS8yMDIzL2ZlYnJ1YXJ5L2lyd2luLW1pdGNoZWxsLWxhdW5jaGVzLWVzZy1hZHZpc29yeS1zZXJ2aWNl0gEA?oc=5","id":"CBMid2h0dHBzOi8vd3d3Lmlyd2lubWl0Y2hlbGwuY29tL25ld3MtYW5kLWluc2lnaHRzL25ld3NhbmRtZWRpYS8yMDIzL2ZlYnJ1YXJ5L2lyd2luLW1pdGNoZWxsLWxhdW5jaGVzLWVzZy1hZHZpc29yeS1zZXJ2aWNl0gEA","guidislink":false,"published":"Wed, 08 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=39, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3Lmlyd2lubWl0Y2hlbGwuY29tL25ld3MtYW5kLWluc2lnaHRzL25ld3NhbmRtZWRpYS8yMDIzL2ZlYnJ1YXJ5L2lyd2luLW1pdGNoZWxsLWxhdW5jaGVzLWVzZy1hZHZpc29yeS1zZXJ2aWNl0gEA?oc=5\" target=\"_blank\">Irwin Mitchell Launches ESG Advisory Service<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Irwin Mitchell<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Irwin Mitchell Launches ESG Advisory Service - Irwin Mitchell","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3Lmlyd2lubWl0Y2hlbGwuY29tL25ld3MtYW5kLWluc2lnaHRzL25ld3NhbmRtZWRpYS8yMDIzL2ZlYnJ1YXJ5L2lyd2luLW1pdGNoZWxsLWxhdW5jaGVzLWVzZy1hZHZpc29yeS1zZXJ2aWNl0gEA?oc=5\" target=\"_blank\">Irwin Mitchell Launches ESG Advisory Service<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Irwin Mitchell<\/font>","source.href":"https:\/\/www.irwinmitchell.com","source.title":"Irwin Mitchell","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"08.02.2023 Irwin Mitchell’s Environment, Social and Governance (ESG) Advisory Service Brings Together 80 Service Lines Irwin Mitchell is launching a new Environment, Social and Governance (ESG) Advisory Service for corporate and institutional clients leading with new products to audit cyber security and help clients with diversity and inclusion assessment, support and training. The immediate focus sees the firm bring together its ESG Advisory Services for clients including 80 different service lines. Alongside the advisory services will be a new web portal where clients will be able to access materials to help them in building their ESG strategies, there will be other new products launching in the next few months including: An in-depth cyber security audit which tests key risk areas and checks multiple controls to provide an assessment of the cyber risk profile and digital footprint of the business An in-depth cyber security audit which tests key risk areas and checks multiple controls to provide an assessment of the cyber risk profile and digital footprint of the business A diversity and inclusion assessment that will help evaluate existing policies and procedures and give recommendations for improvement The first in a suite of diversity and inclusion training modules which can be tailored and personalised to meet clients’ needs. The advisory services, thought leadership, training and audits will also contain specific advice from Irwin Mitchell’s sector experts in sport, real estate, manufacturing, financial services, consumer services and education. Irwin Mitchell is already working with many organisations in the ESG space including property developer Artisan which is turning 11 acres of land into a sustainable community near the Salt Mills World Heritage site at Saltaire Shipley, West Yorkshire; and Landlink Estates which is developing a business park utilising renewable and alternative energy sources as part of the scheme. Irwin Mitchell has also set out its commitment to environmental, social and governance principles in recent years with a responsible business strategy focused on sustainability and inclusion. Recently, the firm published an in depth annual Responsible Business Report, which highlighted progress made and aspirations for the future: A leader in the legal industry for gender equality – with the highest percentage of female partners and a low gender pay gap Ranked 16 th in the Great Place to Work Index for Super Large Businesses across the UK with new wellbeing initiatives, improved menopause support for colleagues and achieving Level 2 Disability Confident as an employer Publishing its environment strategy and road map to Net Zero by 2040 with a target to achieve 100% renewable electricity across its offices by 2025. The firm is also working with the Science Based Targets Initiative (SBTI) to verify its plans Bespoke training programme for 60 colleagues involved in ESG advisory services. A survey of 200 businesses showed that 42% had already implemented or revised their ESG strategy while 35% were looking at options to form their strategy and 22% are just beginning to start their ESG journey*. Businesses are mostly seeing ESG as a vital part of their sustainable growth strategies, opening doors to new customers and allowing them to retain clients and colleagues. It can also give them a competitive advantage in a crowded market. Expert Opinion “As a legal and financial services firm, ESG runs through almost everything we do. Our ESG Advisory Service is about making sure that our clients get value from their ESG advice, as well as benefitting from the experience of our own ESG journey. “Due to the nature of our work, we’re an ideal partner for ESG services. With expertise in compliance and regulations we typically apply less bias to a business situation and provide objective advice and guidance on legislative issues. Where we believe Irwin Mitchell can add further value is in helping clients in areas of strength for us such as diversity and inclusion and cyber security. “The driver for some business leaders may be client demand, others are swayed by their moral compass or internal colleague requests, and for some it’s a desire to be a more sustainable business in the widest sense. “Many people think 2023 could be a tough year but far from being an additional cost, getting ESG right can help businesses both save money and make money. There is good evidence to demonstrate that businesses that are purpose led and that build ESG into the heart of their business strategy deliver improved financial and commercial performance.” Victoria Brackett, Chief Commercial Officer","filter_flag":1}
