{"title":"How to ensure the PPWR actually enables more sustainable packaging - EURACTIV","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vd3d3LmV1cmFjdGl2LmNvbS9zZWN0aW9uL2VuZXJneS1lbnZpcm9ubWVudC9vcGluaW9uL2hvdy10by1lbnN1cmUtdGhlLXBwd3ItYWN0dWFsbHktZW5hYmxlcy1tb3JlLXN1c3RhaW5hYmxlLXBhY2thZ2luZy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vd3d3LmV1cmFjdGl2LmNvbS9zZWN0aW9uL2VuZXJneS1lbnZpcm9ubWVudC9vcGluaW9uL2hvdy10by1lbnN1cmUtdGhlLXBwd3ItYWN0dWFsbHktZW5hYmxlcy1tb3JlLXN1c3RhaW5hYmxlLXBhY2thZ2luZy_SAQA?oc=5","id":"CBMif2h0dHBzOi8vd3d3LmV1cmFjdGl2LmNvbS9zZWN0aW9uL2VuZXJneS1lbnZpcm9ubWVudC9vcGluaW9uL2hvdy10by1lbnN1cmUtdGhlLXBwd3ItYWN0dWFsbHktZW5hYmxlcy1tb3JlLXN1c3RhaW5hYmxlLXBhY2thZ2luZy_SAQA","guidislink":false,"published":"Tue, 29 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=241, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vd3d3LmV1cmFjdGl2LmNvbS9zZWN0aW9uL2VuZXJneS1lbnZpcm9ubWVudC9vcGluaW9uL2hvdy10by1lbnN1cmUtdGhlLXBwd3ItYWN0dWFsbHktZW5hYmxlcy1tb3JlLXN1c3RhaW5hYmxlLXBhY2thZ2luZy_SAQA?oc=5\" target=\"_blank\">How to ensure the PPWR actually enables more sustainable packaging<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EURACTIV<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How to ensure the PPWR actually enables more sustainable packaging - EURACTIV","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vd3d3LmV1cmFjdGl2LmNvbS9zZWN0aW9uL2VuZXJneS1lbnZpcm9ubWVudC9vcGluaW9uL2hvdy10by1lbnN1cmUtdGhlLXBwd3ItYWN0dWFsbHktZW5hYmxlcy1tb3JlLXN1c3RhaW5hYmxlLXBhY2thZ2luZy_SAQA?oc=5\" target=\"_blank\">How to ensure the PPWR actually enables more sustainable packaging<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EURACTIV<\/font>","source.href":"https:\/\/www.euractiv.com","source.title":"EURACTIV","query":"https:\/\/news.google.com\/rss\/search?q=\"Closed-loop recycling\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"As the Packaging and Packaging Waste Regulation (PPWR)’s plenary voting date quickly approaches, The Alliance for Beverage Cartons and the Environment (ACE) takes a look at this draft piece of legislation with a critical question and asks, “what do we want our packaging to be like in the future?” What is the PPWR and Why is it Important? Anybody working in EU policy is acutely aware of the draft PPWR legislation, which aims to ensure that the packaging we use every day is sustainable and circular. This piece of legislation will drive change in how products are packed and delivered throughout the EU. Beverage cartons are an essential, sustainable, packaging solution and a familiar household product used daily by millions of Europeans, to provide safe and nutritious milk and juice. Keep sustainable products sustainable To support continued innovation and sustainability leadership we need a legislative framework which supports: 1) An open-loop approach to high-quality recycling A high-quality recycling definition should be linked to the quality of secondary raw materials. What does this mean? Secondary raw materials are the “recycled materials that can be used in manufacturing processes instead of or alongside virgin raw materials.” Our view is that secondary raw materials need to find their way into new products with the least environmental and economic impact. For instance, beverage cartons consumed and collected in Spain are currently recycled in Spain into corrugated boxes. This is what we call an open-loop approach, meaning that recycled material is used to create a broad range of products. However, some proposed amendments in the PPWR could impose a closed-loop recycling approach, meaning a recycled product needs to be used to create the same product from which they derive. This would mean, for example, that beverage cartons collected in Spain would need to be sent to Germany or Sweden to be recycled and used in new beverage cartons. This solution would be economically unsustainable and technically challenging. Also, it would lead to increased transport operations which would result in higher emissions, environmental impact and make it difficult to satisfy food safety requirements. A network of effective beverage carton recycling systems is already in place throughout Europe. Our proposal for an open-loop approach would promote circular systems, and avoid unnecessary circularity disruptions. 2) A transparent, technical and evidence-based approach for Design for Recycling (DfR) Guidelines For those who may not be aware, beyond the PPWR context, Design for Recycling Guidelines aim to ensure that products are designed to be recycled and do not become “waste”. Guidelines are often based on third party, technical expertise. It is therefore essential to avoid that the PPWR is overly prescriptive and, as suggested by some stakeholders, contains a list of packaging attributes that supposedly preclude recyclability. The PPWR should promote Design for Recycling Guidelines based on sound technical knowledge. A prime example of this are the beverage carton industry’s Design for Recycling Guidelines, which provide producers of beverage cartons with technical guidance to identify the materials needed in the packaging composition that are compatible with existing recycling processes and how the recyclability of beverage cartons can be optimized. Any arbitrary list of attributes that could hinder recyclability could also contradict key Treaty principles including proportionality, the obligation to avoid errors of assessment, and could create an unfair advantage for one material over another (e.g. plastic over paper). Sometimes a picture …. 3) No reuse targets for microbiological sensitive products What is a microbiological sensitive product? It’s your daily juice and milk which are not allowed to have additives or preservatives and are more sensitive compared to soft drinks and water. Because of this, it is critical to use packaging like beverage cartons, which provide a crucial and effective barrier against the entry of microorganisms, light and oxygen and allow for an extended shelf-life, potentially avoiding food waste. Putting a lens on the European juice industry, 59% of their products are packed in beverage cartons. Why? Beverage cartons protect, transport and preserve juices, contributing to lower carbon emissions and a longer shelf life. The only technically feasible reusable packaging for fruit juices is glass. That means, if mandatory reuse targets are set for the fruit juice industry, the only alternative is heavy returnable glass bottles. These have a higher environmental footprint, and come with other challenges: they are heavier, bulky to transport, easily breakable, hard to clean after first use and could fail to meet hygiene requirements. So, why choose a glass bottle when the European Commission’s Impact Assessment accompanying the PPWR proposal calculates that switching from heavy packaging such as glass towards lighter alternatives would lead to a significant reduction in GHG emissions and water use? While reuse systems do exist, they’re not always the best solution for all packaging formats and only possible under certain conditions and at a small scale, which is not meaningful across the EU. Let’s safeguard our juices and milk and not have them be in the scope of mandatory reuse targets. …Is worth a 1,000 words Looking to the future, not the past Depending on the direction taken by EU Parliament discussions, the PPWR runs the risk of promoting fossil-fuel driven alternatives with a negative impact on the environment in the European market and negating sustainable paper packaging solutions, like beverage cartons. So, let’s call on our policymakers to adopt meaningful decisions by looking at the bigger picture. We’ve provided the evidence needed to ensure they vote for measures that protect sustainable packaging. Now let’s look forward to continued innovation for sustainable solutions, decreasing fossil fuel emissions and have the EU’s reputation shine as a truly green leader.","filter_flag":1}
{"title":"Recycling of Polyurethane Foam Takes a Step Forward - AZoCleantech","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3LmF6b2NsZWFudGVjaC5jb20vbmV3cy5hc3B4P25ld3NJRD0zMzgwMtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3LmF6b2NsZWFudGVjaC5jb20vbmV3cy5hc3B4P25ld3NJRD0zMzgwMtIBAA?oc=5","id":"CBMiM2h0dHBzOi8vd3d3LmF6b2NsZWFudGVjaC5jb20vbmV3cy5hc3B4P25ld3NJRD0zMzgwMtIBAA","guidislink":false,"published":"Wed, 02 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=214, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3LmF6b2NsZWFudGVjaC5jb20vbmV3cy5hc3B4P25ld3NJRD0zMzgwMtIBAA?oc=5\" target=\"_blank\">Recycling of Polyurethane Foam Takes a Step Forward<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AZoCleantech<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Recycling of Polyurethane Foam Takes a Step Forward - AZoCleantech","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3LmF6b2NsZWFudGVjaC5jb20vbmV3cy5hc3B4P25ld3NJRD0zMzgwMtIBAA?oc=5\" target=\"_blank\">Recycling of Polyurethane Foam Takes a Step Forward<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AZoCleantech<\/font>","source.href":"https:\/\/www.azocleantech.com","source.title":"AZoCleantech","query":"https:\/\/news.google.com\/rss\/search?q=\"Closed-loop recycling\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Investigators from Aarhus University have now demonstrated, in collaboration with partners from the industry, that straightforward chemistry can do more from polyurethane foam than just extract vital raw materials; the most significant component can also be reused repeatedly in new mattresses. Image Credit: Aarhus University When scientists from Aarhus University announced a new and cost-effective method of breaking polyurethane (PU) plastic into its original components, which can then be recycled into new PU material instead of ending up in landfills or incinerators, it caused a bit of a stir back in 2022. The same scientists have now demonstrated that the method can be used to address flexible foam polyurethane in collaboration with Plixxent A\/S, Dan-Foam Aps, and the Danish Technological Institute as part of the Danish RePURpose consortium. Researchers have broken down approximately one and a half kilos of foam mattresses, retrieved its major components, and used one of them, polyol, as a raw material in a new piece of mattress. The scientists replaced 64% of the mattress without compromising quality by using “fresh” polyol, which is majorly produced from crude oil, with polyol extracted from the old mattress. Researchers have also illustrated that the method can be repeated many times. In other words, the polyol can be extracted and reused from polyurethane foam. The findings were recently published in the American Chemical Society’s scientific journal ACS Sustainable Chemistry & Engineering. Much Needed Solution This advances us one step closer to a circular economy for flexible PU foam. It is also urgently needed. Since it is difficult to recycle, the vast majority of global PU waste is disposed of in landfills. Because PU cannot be melted, it cannot be molded into new products like many other plastics. In 2021, the global PU market was 24.7 million tons, and it is anticipated to reach 29 million tons by 2029. Flexible PU foam used in mattresses accounts for approximately 30% of the market. The PU family of advanced plastic materials, which has a wide range of properties and uses, is not just used in mattresses. It is also utilized in a wide range of products, including furniture, footwear, toys, paints, fillers, insulation, automobiles, wind turbines, and other aircraft. Requires Waste Control Solvolysis is a process that Aarhus University chemists invented and patented that involves placing the material under pressure with hot tert-amyl alcohol and a small amount of caustic potash to dissolve the chemical bonds in PU. The entire PU market may not be supported by this method, according to the researchers. There are too many variants of PU. Our technique can push society towards a circular economy for PU mattresses. But if recycling is to put and end to landfilling and incineration, industry and society need full control of waste streams. The problem is that each manufacturer of PU-based materials has its own unique recipe. Steffan Kvist Kristensen, Study Co-Author and Assistant Professor, Interdisciplinary Nanoscience Center, Aarhus University Journal Reference: Johansen, M. B., et al. (2023). Closed-Loop Recycling of Polyols from Thermoset Polyurethanes by tert-Amyl Alcohol-Mediated Depolymerization of Flexible Foams. ACS Sustainable Chemistry & Engineering. doi.org\/10.1021\/acssuschemeng.3c01469.","filter_flag":1}
{"title":"Old Mattresses Made New: Simple Chemistry Can Recycle Polyurethane - Technology Networks","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy50ZWNobm9sb2d5bmV0d29ya3MuY29tL2FwcGxpZWQtc2NpZW5jZXMvbmV3cy9vbGQtbWF0dHJlc3Nlcy1tYWRlLW5ldy1zaW1wbGUtY2hlbWlzdHJ5LWNhbi1yZWN5Y2xlLXBvbHl1cmV0aGFuZS0zNzcxMjPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy50ZWNobm9sb2d5bmV0d29ya3MuY29tL2FwcGxpZWQtc2NpZW5jZXMvbmV3cy9vbGQtbWF0dHJlc3Nlcy1tYWRlLW5ldy1zaW1wbGUtY2hlbWlzdHJ5LWNhbi1yZWN5Y2xlLXBvbHl1cmV0aGFuZS0zNzcxMjPSAQA?oc=5","id":"CBMigQFodHRwczovL3d3dy50ZWNobm9sb2d5bmV0d29ya3MuY29tL2FwcGxpZWQtc2NpZW5jZXMvbmV3cy9vbGQtbWF0dHJlc3Nlcy1tYWRlLW5ldy1zaW1wbGUtY2hlbWlzdHJ5LWNhbi1yZWN5Y2xlLXBvbHl1cmV0aGFuZS0zNzcxMjPSAQA","guidislink":false,"published":"Wed, 02 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=214, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy50ZWNobm9sb2d5bmV0d29ya3MuY29tL2FwcGxpZWQtc2NpZW5jZXMvbmV3cy9vbGQtbWF0dHJlc3Nlcy1tYWRlLW5ldy1zaW1wbGUtY2hlbWlzdHJ5LWNhbi1yZWN5Y2xlLXBvbHl1cmV0aGFuZS0zNzcxMjPSAQA?oc=5\" target=\"_blank\">Old Mattresses Made New: Simple Chemistry Can Recycle Polyurethane<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Technology Networks<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Old Mattresses Made New: Simple Chemistry Can Recycle Polyurethane - Technology Networks","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy50ZWNobm9sb2d5bmV0d29ya3MuY29tL2FwcGxpZWQtc2NpZW5jZXMvbmV3cy9vbGQtbWF0dHJlc3Nlcy1tYWRlLW5ldy1zaW1wbGUtY2hlbWlzdHJ5LWNhbi1yZWN5Y2xlLXBvbHl1cmV0aGFuZS0zNzcxMjPSAQA?oc=5\" target=\"_blank\">Old Mattresses Made New: Simple Chemistry Can Recycle Polyurethane<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Technology Networks<\/font>","source.href":"https:\/\/www.technologynetworks.com","source.title":"Technology Networks","query":"https:\/\/news.google.com\/rss\/search?q=\"Closed-loop recycling\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Thank you. Listen to this article using the player above. ✖ Complete the form below to unlock access to ALL audio articles. Want to listen to this article for FREE? Read time: 2 minutes It created something of a stir when, back in 2022, researchers from Aarhus University announced a new and inexpensive way of breaking down polyurethane (PU) plastic into its original components, which can then be recycled into new PU material instead of ending up in landfills or incinerators. Now, together with Plixxent A\/S, Dan-Foam Aps and the Danish Technological Institute as part of the Danish RePURpose consortium, the same researchers have proven that the method can be used to tackle flexible foam polyurethane: They have broken down approx. one-and-a-half kilos of foam mattress, extracted its main components and used one of them, polyol, as a raw material in a new piece of mattress. By replacing \"fresh\" polyol, which is primarily produced from crude oil, with polyol extracted from the old mattress, the researchers have replaced 64 percent of the mattress, without impairing quality in any way. They have also demonstrated that the process can be repeated several times. In other words, the polyol can be re-extracted from polyurethane foam and reused again. The results have just been published in the scientific journal ACS Sustainable Chem & Eng, which is published by the American Chemical Society. Much needed solution This takes us a step further towards a circular economy for flexible PU foam. And it is desperately needed. The vast majority of global PU waste is deposited in landfills because it is difficult to recycle. PU cannot be melted, and for this reason it is not possible to simply mould it into new products like many other plastics. Want more breaking news? Subscribe to Technology Networks’ daily newsletter, delivering breaking science news straight to your inbox every day. Subscribe for FREE The global market for PU was 24.7 million tonnes in 2021, and it is expected to exceed 29 million tonnes by 2029. The flexible PU foam used in mattresses accounts for about 30 percent of the market. PU is not only used in mattresses; it is a group of advanced plastic materials with many different properties and even more applications. It is also used in furniture, refrigerators, shoes, toys, paints, fillers, insulation, cars, wind turbines, aircraft and much more. Requires waste control The method developed and patented by the chemists at Aarhus University is called solvolysis, and breaks down the chemical bonds in PU by putting the material in a sort of pressure cooker with hot tert-amyl alcohol and a little caustic potash. However, the researchers do not expect that this process can be used for the entire PU market. The different types of PU are too different. \"Our technique can push society towards a circular economy for PU mattresses. But if recycling is to put and end to landfilling and incineration, industry and society need full control of waste streams. The problem is that each manufacturer of PU-based materials has its own unique recipe,\" says Assistant Professor Steffan Kvist Kristensen from the Interdisciplinary Nanoscience Center (iNANO) at Aarhus University, who is a co-author of the study. Reference: Johansen MB, Donslund BS, Larsen E, et al. Closed-loop recycling of polyols from thermoset polyurethanes by tert -amyl alcohol-mediated depolymerization of flexible foams. ACS Sustainable Chem Eng. 2023;11(29):10737-10745. doi: 10.1021\/acssuschemeng.3c01469 This article has been republished from the following materials. Note: material may have been edited for length and content. For further information, please contact the cited source.","filter_flag":1}
{"title":"Lush taps into the Barbie craze with a limited-edition collection - Premium beauty","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9sdXNoLXRhcHMtaW50by10aGUtYmFyYmllLWNyYXplLDIyNDEz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9sdXNoLXRhcHMtaW50by10aGUtYmFyYmllLWNyYXplLDIyNDEz0gEA?oc=5","id":"CBMiSmh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9sdXNoLXRhcHMtaW50by10aGUtYmFyYmllLWNyYXplLDIyNDEz0gEA","guidislink":false,"published":"Fri, 11 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=223, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9sdXNoLXRhcHMtaW50by10aGUtYmFyYmllLWNyYXplLDIyNDEz0gEA?oc=5\" target=\"_blank\">Lush taps into the Barbie craze with a limited-edition collection<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Lush taps into the Barbie craze with a limited-edition collection - Premium beauty","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9sdXNoLXRhcHMtaW50by10aGUtYmFyYmllLWNyYXplLDIyNDEz0gEA?oc=5\" target=\"_blank\">Lush taps into the Barbie craze with a limited-edition collection<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","source.href":"https:\/\/www.premiumbeautynews.com","source.title":"Premium beauty","query":"https:\/\/news.google.com\/rss\/search?q=\"Closed-loop recycling\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"The Barbie x Lush collection offers a complete range of personal and beauty care products in the doll’s quintessential pink hue. “We imagined what Barbie’s self-care routine would look like and created this range, meant to be used and loved by all. The collection is for everyone who wants to embrace the power of the colour pink,” explained Melody Morton, Creative Concepts Director at Lush Cosmetics. The Barbie x Lush collection is available on the Lush app since August 9th and in Lush stores since August 10th. The assortment features ‘naked’ products that don’t require any packaging – from soaps, to bath bombs to bubble bars. Products in packaging are part of the brand’s closed-loop recycling program, Bring It Back, which encourages customers to bring their empties to a local Lush shop for money off their same day purchase, or five empty pots for a free Fresh Face Mask.","filter_flag":1}
