{"title":"What goes into the launch of a new irrigation product? - Landscape Management magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmxhbmRzY2FwZW1hbmFnZW1lbnQubmV0L3doYXQtZ29lcy1pbnRvLXRoZS1sYXVuY2gtb2YtYS1uZXctaXJyaWdhdGlvbi1wcm9kdWN0L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmxhbmRzY2FwZW1hbmFnZW1lbnQubmV0L3doYXQtZ29lcy1pbnRvLXRoZS1sYXVuY2gtb2YtYS1uZXctaXJyaWdhdGlvbi1wcm9kdWN0L9IBAA?oc=5","id":"CBMiWmh0dHBzOi8vd3d3LmxhbmRzY2FwZW1hbmFnZW1lbnQubmV0L3doYXQtZ29lcy1pbnRvLXRoZS1sYXVuY2gtb2YtYS1uZXctaXJyaWdhdGlvbi1wcm9kdWN0L9IBAA","guidislink":false,"published":"Thu, 13 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=103, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmxhbmRzY2FwZW1hbmFnZW1lbnQubmV0L3doYXQtZ29lcy1pbnRvLXRoZS1sYXVuY2gtb2YtYS1uZXctaXJyaWdhdGlvbi1wcm9kdWN0L9IBAA?oc=5\" target=\"_blank\">What goes into the launch of a new irrigation product?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Landscape Management magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"What goes into the launch of a new irrigation product? - Landscape Management magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmxhbmRzY2FwZW1hbmFnZW1lbnQubmV0L3doYXQtZ29lcy1pbnRvLXRoZS1sYXVuY2gtb2YtYS1uZXctaXJyaWdhdGlvbi1wcm9kdWN0L9IBAA?oc=5\" target=\"_blank\">What goes into the launch of a new irrigation product?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Landscape Management magazine<\/font>","source.href":"https:\/\/www.landscapemanagement.net","source.title":"Landscape Management magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Product longevity\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Newly created irrigation products go through several stages of testing before hitting the market. (Photo: Hunter Industries) Long before contractors hear about the release of a new controller, nozzle or other irrigation product, manufacturers spend countless hours bringing them from concept to completion. Gathering information Coming up with a good irrigation product idea is the easy part, says Joe Porrazzo, marketing group manager of the contractor division at Rain Bird. The difficult part of the process is going from that abstract concept to the finished good because no two people see everything the same way. An important aspect of the development process is customer feedback. Rain Bird uses a combination of formal interviews, questionnaires, surveys and in-field meetings to drive most of their feedback. The development process varies by product, but Porrazzo says Rain Bird increased the velocity of its timelines during the past five years through new manufacturing processes, technologies and other innovative means to test products in the field with customers. The company uses a testing facility at its Tucson, Ariz., corporate office and performs testing in-house at its manufacturing facilities. “Rain Bird works with independent testing facilities outside of the irrigation industry to ensure product longevity and reliability,” Porrazzo says. “Rain Bird also works very closely with the Irrigation Association and other industry peer groups to ensure our product development plans help drive their core initiatives with conservation and sustainability.” Crowdsourcing feedback Irrigation contractor feedback is central to developing product ideas and efforts, says Jeffery Kremicki, manager of business development for Hunter Industries. Customers can submit their ideas to product development teams on the company’s Great Ideas for Innovation site. The company also actively reaches out to customers through surveys and site visits to confirm the product they plan to develop will meet the contractor’s needs. “In addition, our employees take an active role in the collaboration around our next new products,” Kremicki says. “Product advisory groups consisting of members from sales, engineering and marketing are tasked with ensuring that the voice of the customer is present in our development activities.” From inception to launch, a project could take several days to several years. Generally, implementing enhancements and new features to existing products takes less time than the development of a completely new product, Kremicki says. “Product enhancements to our web-connected irrigation controllers, which have firmware and software, allow Hunter engineers to release new features quickly ‘over the air’ to our customers,” Kremicki says. “The design, development and testing of a new rotor product is a much more involved process.” Hunter forms product development teams after the product idea is approved. The company creates product design specifications based on customer requirements. Then, the engineers develop designs and prototypes for testing. Testing, Testing, Testing Once internal testing is complete, Hunter commonly sends products into the field to confirm the product meets customer requirements, Kremicki says. Product field testing could take years to gather the necessary data. Many products also go through internationally recognized compliance testing to ensure they meet industry standards. “For many new products, testing can become the most involved part of the product development process,” Kremicki says. “Once a design has been ‘frozen’ and prototypes are developed, they are sent through a battery of Hunter internal tests to confirm performance and reliability.” Kremicki says Hunter prioritizes the development of low-impact products to help ensure their products and processes remain as efficient and socially responsible as possible. “Whether we are developing a water-efficient sprinkler or smart irrigation controller, much of our product focus is on addressing concerns regarding water use and the scarcity of this valuable resource,” he says.","filter_flag":1}
{"title":"Bang & Olufsen Introduces Beosound A5 Portable Speaker - eCoustics","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LmVjb3VzdGljcy5jb20vcHJvZHVjdHMvYmFuZy1vbHVmc2VuLWJlb3NvdW5kLWE1LXBvcnRhYmxlLXNwZWFrZXIv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LmVjb3VzdGljcy5jb20vcHJvZHVjdHMvYmFuZy1vbHVmc2VuLWJlb3NvdW5kLWE1LXBvcnRhYmxlLXNwZWFrZXIv0gEA?oc=5","id":"CBMiTWh0dHBzOi8vd3d3LmVjb3VzdGljcy5jb20vcHJvZHVjdHMvYmFuZy1vbHVmc2VuLWJlb3NvdW5kLWE1LXBvcnRhYmxlLXNwZWFrZXIv0gEA","guidislink":false,"published":"Thu, 27 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=117, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LmVjb3VzdGljcy5jb20vcHJvZHVjdHMvYmFuZy1vbHVmc2VuLWJlb3NvdW5kLWE1LXBvcnRhYmxlLXNwZWFrZXIv0gEA?oc=5\" target=\"_blank\">Bang & Olufsen Introduces Beosound A5 Portable Speaker<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">eCoustics<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bang & Olufsen Introduces Beosound A5 Portable Speaker - eCoustics","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LmVjb3VzdGljcy5jb20vcHJvZHVjdHMvYmFuZy1vbHVmc2VuLWJlb3NvdW5kLWE1LXBvcnRhYmxlLXNwZWFrZXIv0gEA?oc=5\" target=\"_blank\">Bang & Olufsen Introduces Beosound A5 Portable Speaker<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">eCoustics<\/font>","source.href":"https:\/\/www.ecoustics.com","source.title":"eCoustics","query":"https:\/\/news.google.com\/rss\/search?q=\"Product longevity\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Bang & Olufsen has introduced the new portable Beosound A5 speaker. Designed in collaboration with the Danish-Italian design duo GamFratesi, Beosound A5 poetically bridges northern and southern design cultures with the immersive sound, meticulous craftsmanship and product longevity that Bang & Olufsen is renowned for. “Beosound A5 is our new high-end portable speaker which combines Bang & Olufsen’s long standing approach to timeless design with our vision on sound for the future”, says VP of Product Marketing, Michael Henriksson. We’re excited to collaborate with GamFratesi for the first time, to create two speaker designs that are rooted in a Scandinavian aesthetic with a distinct design signature on their own”. Bang & Olufsen Beosound A5 Portable Speaker comes in Dark Oak or Nordic Weave Available in two colourways, Beosound A5 in natural aluminium with a woven paper fibre front incorporates a light oak handle, creating a feeling of laid-back Scandinavian summers spent at the beach. The black anthracite aluminium version paired with a dark oak wood speaker cover and handle evokes the aesthetic of winter woodlands. Both finishes can sit beautifully inside a home or outside in nature, presenting the best of Scandinavian design excellence. Inspiration Beosound A5 sits at the junction where portable and home audio meet. The solid oak handle allows the speaker to be carried from room to room with ease, whether placed on the floor, shelf or table. Thanks to an IP65 water and dustproof rating, Beosound A5 can also be taken outside and on any adventure, effortlessly. With more than 12 hours of playtime and a wireless phone charger integrated into the top panel of the speaker, Beosound A5 is Bang & Olufsen’s most versatile speaker to date, and the perfect portable audio companion. It is controlled by either a sleek user-interface or directly from the Bang & Olufsen App. “Our inspiration for Beosound A5 came from many places including the iconic Beolit series as well as natural materials synonymous with the colours and textures found in Scandinavian nature”, say GamFratesi. “From the traditional Panama straw hats worn on beaches, to the hand-woven leather accents of Danish chairs from the 1960s, blends of natural materials applied in experimental ways guided our design journey”. Inspiration for the Beosound A5 The soft organic curves and natural materials of Beosound A5 reference the curved edges and handle from Beolit 607 launched in 1961. The wooden teak finish of the Beolit 800 and Beolit 1000, originally designed by Jacob Jensen between the late 60’s and early 70’s was also influential in GamFratesi’s design process for Beosound A5. Audio Performance As Bang & Olufsen’s most powerful portable speaker to date, Beosound A5 provides big sound wherever it is placed. The four-way driver setup with four digital amplifiers provides a combined 280 watts of power, which can fill large rooms with dynamic 360-degree sound. Comprising of 1 x 5.25” woofer, 2 x 2” midrange and 1 x ¾ tweeter, Beosound A5 excels in design and sound in equal measure. Whilst taking aesthetic inspiration from Bang & Olufsen’s Beolit series, the technology in Beosound A5 draws from the class leading Beolab 90 and 50 hi-fi speakers. Beamforming technology, an innovation first built into the Beolab series, has been brought to Beosound A5 to control the sound with high precision. This creates an immersive experience far beyond the expectations of a portable speaker. Longevity Bang & Olufsen is renowned for its long-lasting products, and Beosound A5 is no exception. In addition to its timeless appearance, the speaker has been modularly designed so that it can be easily serviced and repaired to extend its lifetime if needed instead of being replaced by a new speaker. Bang & Olufsen will continue to produce the easily exchangeable front covers in new materials and colourways so that Beosound A5 can evolve with a customer’s style and identity. These design elements ensure a long lifetime with one customer and potentially multiple loops with a series of different ownerships in the future. Once Beosound A5 does reach its end-of-life point after many years of service, the ease of disassembly and use of high-quality materials for structural components supports circular solutions. Thanks to Bang & Olufsen’s Mozart software platform, the longevity of Beosound A5 goes beyond physical craftsmanship and modular design. Mozart provides the most up-to-date features across audio, connectivity, and software design. It connects the heritage of the past, technology of the present, and innovation of the future for Bang & Olufsen products. Beosound A5 has the capacity and capability to evolve with new technologies, and unlock new listening experiences, for years to come. Advertisement. Scroll to continue reading. Connectivity The versatility of Beosound A5 goes beyond design and into software. As well as being a standalone speaker, the Mozart platform allows two Beosound A5s to connect seamlessly with each other in a stereo system or any other Mozart-enabled speaker in Bang & Olufsen’s portfolio. Furthermore, it can integrate smoothly into a Bang & Olufsen smart home system, creating an immersive multiroom experience at the tap of a button. Mozart’s future-gazing capabilities and the introduction of ultra-wide-band will unlock new features over time, such as Proximity Pairing, taking connectivity one step further. Proximity Pairing will automatically connect two Beosound A5’s for an impressive stereo experience when they are placed near to each other. A wireless phone charger is integrated into the top panel. Beosound A5 is compatible with Beolink Multiroom, Airplay 2, Chromecast, Spotify Connect, Bluetooth 5.2 and more, proving that it’s more than just it’s physical design that is made to be taken anywhere. Pricing & Availability Beosound A5 in Nordic Weave is $1,049 at bangolufsen.com (899 GBP \/ 999 EUR \/ 7499 DKK \/ 1499 CAD) and available in stores and online from 27th April 2023. Beosound A5 in Dark Oak is $1,149 at bangolufsen.com (999 GBP \/ 1099 EUR \/ 8299 DKK \/ \/ 1599 CAD) and available in stores and online from 27th April 2023.","filter_flag":1}
